{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Cesar Cadenas", "title": "Philips Hue's new powerful smart lights can illuminate every nook and cranny in your home - TechRadar", "description": "The triple Runner spotlight can output 1,200 lumens of light", "url": "https://www.techradar.com/home/smart-lights/philips-hues-new-powerful-smart-lights-can-illuminate-every-nook-and-cranny-in-your-home", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZgHSXNpL8aXqzmyawHAazZ-1200-80.jpg", "publishedAt": "2024-07-02T03:01:56Z", "content": "Lighting brand Philips Hue has quietly launched refreshes of their Pillar and Runner spotlights in Europe. Their respective lines consist of multiple models with several similarities between them. \r\n… [+3157 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 amazing images of solar system shared by NASA Hubble Space Telescope - HT Tech", "description": "5 amazing images of solar system shared by NASA Hubble Space Telescope Check out the images of Neptune Uranus Jupiter and other planets in the solar system captured by NASAs Hubble Space Telescope. Our solar system is made up of stars eight planets and other …", "url": "https://tech.hindustantimes.com/web-stories/5-amazing-images-of-solar-system-shared-by-nasa-hubble-space-telescope-71719889345612.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/02/1600x900/STScI-01HGXC3YSEJ0XP2SMN3JKV4S2W_1719889749378_1719889751806.png/", "publishedAt": "2024-07-01T21:39:24Z", "content": "Photo Credit: Pixabay Check out the images of Neptune, Uranus, Jupiter and other planets in the solar system captured by NASAs Hubble Space Telescope. \r\nPhoto Credit: Pixabay Our solar system is made… [+1236 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Discovery: How Zinc Could Change Farming Forever - SciTechDaily", "description": "Researchers have found that zinc significantly influences the nitrogen fixation process in legumes, a discovery that could transform legume-based agriculture. Climate change, drought, increased temperature, and other stressors challenge agricultural sustainab…", "url": "https://scitechdaily.com/groundbreaking-discovery-how-zinc-could-change-farming-forever/", "urlToImage": "https://scitechdaily.com/images/Crops-Growing-Fertile-Farm-Land.jpg", "publishedAt": "2024-07-01T11:09:10Z", "content": "A new study reveals zinc’s critical role in regulating nitrogen fixation in legumes through a sensor named FUN. This discovery could help improve crop efficiencies and reduce synthetic fertilizer use… [+5220 chars]"}]}