{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Wearable 'Ai Pin' launched by Humane, backed by ex-Apple executives and Microsoft - Moneycontrol", "description": "The Ai Pin, as the device is called, is designed to be worn on clothing and can be tapped to talk to a virtual assistant powered by technologies from ChatGPT-creator OpenAI and cloud computing power from Microsoft. It uses a laser projection system to display…", "url": "https://www.moneycontrol.com/news/world/wearable-ai-pin-launched-by-humane-backed-by-ex-apple-executives-and-microsoft-11713531.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/08/artificial-intelligence-rep-770x433.jpg", "publishedAt": "2023-11-10T01:04:01Z", "content": "Humane, a Silicon Valley startup with a star-studded list of co-founders and executives, on Thursday released a $699 device that aims to bring cutting-edge artificial intelligence to a lapel near you… [+1575 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "CRISPR High-Throughput Screening Identifies Master Regulator That Could Enhance Cancer T-Cell Therapy - Genetic Engineering & Biotechnology News", "description": "Researchers used a CRISPR-based screening platform to identify genes that could potentially improve T-cell therapies for cancer treatment.", "url": "https://www.genengnews.com/topics/translational-medicine/crispr-high-throughput-screening-identifies-master-regulator-that-could-enhance-cancer-t-cell-therapy/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2023/11/low-res-7.jpeg", "publishedAt": "2023-11-09T21:45:23Z", "content": "Researchers at Duke University have adapted CRISPR technologies to enable high-throughput screening of gene function in human immune cells, and discovered that a single master regulator of the genome… [+7026 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Amazing aurora after solar storm strike! Just check out this NASA image of Utah sky from ISS - HT Tech", "description": "NASA wows space enthusiasts with a dazzling snapshot of an aurora snapped from the International Space Station after a solar storm. The green celestial display above Utah has captured the imaginations of viewers worldwide.", "url": "https://tech.hindustantimes.com/tech/news/amazing-aurora-after-solar-storm-strike-just-check-out-this-nasa-image-of-utah-sky-from-iss-71699552062268.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/09/1600x900/NASA_1699552210802_1699552211084.jpg", "publishedAt": "2023-11-09T17:52:14Z", "content": "Prepare to be captivated by the latest visual treat from NASA as the space agency has unveiled a breathtaking image of an aurora taken from the International Space Station (ISS) after a solar storm s… [+2020 chars]"}]}