{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astonishing Discovery Reveals Water in Our Solar System May Have Originated Billions of Years Before the Sun - SciTechDaily", "description": "ALMA Traces History of Water in Planet Formation Back to the Interstellar Medium Observations of water in the disk forming around protostar V883 Ori have unlocked clues about the formation of comets and planetesimals in our own Solar System. Scientists studyi…", "url": "https://scitechdaily.com/?p=259198", "urlToImage": "https://scitechdaily.com/images/History-of-Water-in-Planet-Formation.jpg", "publishedAt": "2023-03-09T09:24:38Z", "content": "ByNational Radio Astronomy ObservatoryMarch 9, 2023\r\nV883 Ori is a remarkable protostar that boasts a temperature that is just hot enough for converting water in its circumstellar disk into gas. This… [+10014 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Silvia Amaro, Arjun Kharpal", "title": "The U.S. imposed semiconductor export controls on China. Now a key EU nation is set to follow suit - CNBC", "description": "The Netherlands — home to critical chip firm ASML — is embroiled in political tensions between the U.S. and China over semiconductor technology.", "url": "https://www.cnbc.com/2023/03/09/asml-netherlands-to-restrict-semiconductor-machine-exports-after-us-pressure.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107012429-1644326826840-gettyimages-450100802-NETHERLANDS_ASML.jpeg?v=1678350593&w=1920&h=1080", "publishedAt": "2023-03-09T08:29:53Z", "content": "An employee stands by cables inside a ASML Twinscan XT1000 lithography machine, during manufacture at the ASML factory in Veldhoven, Netherlands.\r\n\"Given the technological developments and the geopol… [+2869 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Nanotube sensors can detect and distinguish gibberellin plant hormones - Tech Explorist", "description": "The nondestructive nanosensors could have wide applications in agricultural science.", "url": "https://www.techexplorist.com/nanotube-sensors-detect-distinguish-gibberellin-plant-hormones/57452/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/03/SMART-DiSTAP-nanotube-fluorescence.jpg", "publishedAt": "2023-03-09T06:56:31Z", "content": "Gibberellins (GAs) are a family of phytohormones that are essential for plant development but are challenging to recognize due to their identical chemical structures. MIT researchers build and manufa… [+5657 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Vikas Yadav", "title": "Google I/O 2023: Android 14, Pixel 7a, New AI Tools On Cards In Mega Event; Check Details Here - Jagran English", "description": "The American tech-giant every year organises the IO event to launch its latest products and services Google is likely to reveal a bucket of Android 14 features with exclusive stuff for Pixel phones", "url": "https://english.jagran.com/technology/google-io-2023-android-14-pixel-7a-new-ai-tools-on-cards-in-mega-event-check-details-here-10068244", "urlToImage": "https://imgeng.jagran.com/images/2023/mar/google-io-event1678344794821.jpg", "publishedAt": "2023-03-09T06:48:00Z", "content": "GOOGLE is all set to unveil a brand new version of its operating system, Android 14, in its upcoming I/O Event scheduled to take place on May 10, 2023. The American tech-giant every year organises th… [+1852 chars]"}, {"source": {"id": null, "name": "CBS Sports"}, "author": "", "title": "College basketball coaching changes 2023 tracker: Jim Boeheim out at Syracuse, Texas Tech's Mark Adams resigns - CBS Sports", "description": "Wednesday also brought news that Chris Beard is involved and being seriously considered at Ole Miss", "url": "https://www.cbssports.com/college-basketball/news/college-basketball-coaching-changes-2023-tracker-jim-boeheim-out-at-syracuse-texas-techs-mark-adams-resigns/", "urlToImage": "https://sportshub.cbsistatic.com/i/r/2023/02/05/19221ea4-f6be-4969-b303-3c66f0741893/thumbnail/1200x675/6e01df0e73ab737f006d08486155620f/usatsi-19439910-1.jpg", "publishedAt": "2023-03-09T06:11:00Z", "content": "Wednesday was a huge day in college basketball in off-the-court news, as it brought the next major phase of the carousel: Jim Boeheim's time at Syracuse coming to an end after 47 years as the head co… [+1962 chars]"}, {"source": {"id": null, "name": "Hype.my"}, "author": "Justin", "title": "5 Reasons Why We Need Adequate Protein In Our Daily Lives - Hype.MY", "description": "With all of today’s modern conveniences and technology, it’s more important than ever to get the proper nutrition to keep up with your growth and active lifestyle. Even though all nutrients are essential for growth, there are three types of nutrients for grow…", "url": "https://hype.my/2023/318368/5-reasons-why-we-need-adequate-protein-in-our-daily-lives/", "urlToImage": "https://hype.my/wp-content/uploads/2023/03/333663443_946514253006979_2347785329451469433_n.jpg", "publishedAt": "2023-03-09T05:10:56Z", "content": "With all of today’s modern conveniences and technology, it’s more important than ever to get the proper nutrition to keep up with your growth and active lifestyle. Even though all nutrients are essen… [+4276 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "COVID survivors at increased risk of long-term gastrointestinal conditions - Ars Technica", "description": "Although people with severe COVID had highest risk, mild cases also upped risks.", "url": "https://arstechnica.com/science/2023/03/having-covid-ups-risk-of-many-long-term-gut-problems-study-finds/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-151046607-760x380.jpeg", "publishedAt": "2023-03-08T23:00:12Z", "content": "37 with \r\nSurviving a bout of COVID-19 can significantly increase the risk of developing a range of long-term gastrointestinal symptoms and conditionsfrom constipation and diarrhea to chronic acid re… [+4527 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Georgia Institute of Technology: Super-fast Insect Urination Powered by the Physics of Superpropulsion - India Education Diary", "description": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail and then launched it away so quickly that it seemed", "url": "https://indiaeducationdiary.in/georgia-institute-of-technology-super-fast-insect-urination-powered-by-the-physics-of-superpropulsion/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/visit-tech.png?fit=1024%2C444&ssl=1", "publishedAt": "2023-03-08T13:02:55Z", "content": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail a… [+117 chars]"}]}