{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 19 May 2023: M63 Spiral Galaxy shot by deep-sky imaging camera - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of the M63 Curly Spiral Galaxy located about 30 million light-years away towards the constellation Canes Venatici.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-19-may-2023-m63-spiral-galaxy-shot-by-deep-sky-imaging-camera-71684486221700.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/19/1600x900/nasa_1684486462273_1684486468664.jpg", "publishedAt": "2023-05-19T08:55:32Z", "content": "Over the past few days, we have seen NASA publish mesmerizing snapshots of celestial objects as part of its daily Astronomy Picture of the Day. But how does NASA capture these objects that are locate… [+2137 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Energy Waves: Smart Material Prototype Challenges Newton's Laws of Motion - SciTechDaily", "description": "University of Missouri researchers designed a prototype of a small, lightweight active ‘metamaterial’ that can control the direction and intensity of energy waves. Professor Guoliang Huang of the University of Missouri has developed a prototype metamaterial t…", "url": "https://scitechdaily.com/harnessing-energy-waves-smart-material-prototype-challenges-newtons-laws-of-motion/", "urlToImage": "https://scitechdaily.com/images/Swirl-Particle-Physics-Concept.gif", "publishedAt": "2023-05-19T08:28:11Z", "content": "ByUniversity of Missouri-ColumbiaMay 19, 2023\r\nA prototype innovative metamaterial with unconventional properties employs electrical signals to control the direction and intensity of energy waves tra… [+3959 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Vikas Yadav", "title": "Google Pixel 8 Pro Could Come With Temperature Sensing Tech; Check First Look Here - Jagran English", "description": "Pixel 8 Pro Leaks The temperature-capturing sensor could be placed next to the camera and below the flash", "url": "https://english.jagran.com/technology/google-pixel-8-pro-could-come-with-temperature-sensing-tech-check-first-look-here-10078638", "urlToImage": "https://imgeng.jagran.com/images/2023/may/google-pixel-8-pro1684485385427.jpg", "publishedAt": "2023-05-19T08:28:00Z", "content": "GOOGLE will likely unveil the highly-anticipated Pixel 8 series in 2023. Like previous years, the company could announce two phones - Pixel 8 and Pixel 8 Pro. While the smartphones have not been subj… [+2263 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "ChatGPT now available Apple phones; OpenAI to expand iOS availability globally soon | World DNA - WION", "description": "Few years ago AI was a dream but now it has become a game changer and OpenAI has now decided to take its technology to the next level by bringing the wonders...", "url": "https://www.youtube.com/watch?v=yF8-lPhaphA", "urlToImage": "https://i.ytimg.com/vi/yF8-lPhaphA/maxresdefault.jpg", "publishedAt": "2023-05-19T05:43:58Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Apple releases iOS 16.5 with a new sports tab in Apple News - TechCrunch", "description": "Apple released iOS 16.5 today with a new sports tab in the Apple News app. The tab acts as a hub for scores and match schedules.", "url": "https://techcrunch.com/2023/05/18/apple-releases-ios-16-5-with-a-new-sports-tab-in-apple-news/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/04/GettyImages-1243025472.jpg?resize=1200,675", "publishedAt": "2023-05-19T04:55:52Z", "content": "Apple released iOS 16.5 Thursday to all users with a new sports tab in the Apple News app. The tab acts as a hub for scores, match schedules, and articles on your favorite sports teams.\r\nThe company … [+1137 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New technique for early detection of foodborne bacteria - News-Medical.Net", "description": "Produce such as lettuce and spinach is routinely tested for foodborne pathogenic bacteria like salmonella, listeria monocytogenes and pathogenic types of E. coli in an effort to protect consumers from getting sick.", "url": "https://www.news-medical.net/news/20230518/New-technique-for-early-detection-of-foodborne-bacteria.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/134984011-620x480.jpg", "publishedAt": "2023-05-19T02:41:00Z", "content": "Produce such as lettuce and spinach is routinely tested for foodborne pathogenic bacteria like salmonella, listeria monocytogenes and pathogenic types of E. coli in an effort to protect consumers fro… [+5618 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Master of Disguise: The Ant-Plant-Spider Triple Threat! - SciTechDaily", "description": "The Siler collingwoodi, a jumping spider species, uses camouflage and ant-mimicry as defenses against predators, blending with plants and adopting ant-like movement to evade spider predators, but not praying mantises, a study in iScience revealed. However, li…", "url": "https://scitechdaily.com/master-of-disguise-the-ant-plant-spider-triple-threat/", "urlToImage": "https://scitechdaily.com/images/Siler-collingwoodi-Ant-Mimicking-Spider-scaled.jpg", "publishedAt": "2023-05-19T00:36:26Z", "content": "ByCell PressMay 18, 2023\r\nThis is a photo of Siler collingwoodi, an ant-mimicking spider. This species of jumping spider uses a combination of camouflage and ant-mimicry for protection from predators… [+6917 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "A Universal Flu Vaccine Is Getting Closer to Reality - Gizmodo", "description": "The NIH announced the start of a new phase I trial of a potential universal flu vaccine, which uses mRNA technology.", "url": "https://gizmodo.com/universal-flu-vaccine-clinical-trial-nih-mrna-1850451350", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/88782c6ee65ee5eafac86516e54ae282.jpg", "publishedAt": "2023-05-18T20:20:00Z", "content": "We might be one major step closer toward ending the scourge of the seasonal flu. This week, the U.S. National Institutes of Health announced the start of a phase I clinical trial testing out a potent… [+2860 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Popular Android TV boxes sold on Amazon are laced with malware - TechCrunch", "description": "The malware-infected AllWinner and RockChip-powered Android TV models are still available to purchase on Amazon.", "url": "https://techcrunch.com/2023/05/18/popular-android-tv-boxes-sold-on-amazon-are-laced-with-malware/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/amazon-tv-android-allwinner-rockchip.jpg?resize=1200,718", "publishedAt": "2023-05-18T18:05:55Z", "content": "AllWinner and RockChip might not be household names, but the two China-based companies power several wildly popular Android TV boxes that are sold on Amazon.\r\nThese Android-powered television set-top… [+4495 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New DNA Research Changes Origin of Human Species - SciTechDaily", "description": "New model for human evolution suggests Homo sapiens arose from multiple closely related populations. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations across Africa, with the earliest …", "url": "https://scitechdaily.com/new-dna-research-changes-origin-of-human-species/", "urlToImage": "https://scitechdaily.com/images/Human-Homo-Sapien-Concept-Art-Illustration.jpg", "publishedAt": "2023-05-18T12:44:46Z", "content": "ByUniversity of California - DavisMay 18, 2023\r\nA new model for human evolution asserts that modern Homo sapiens stemmed from multiple genetically diverse populations across Africa rather than a sing… [+6176 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "120-foot asteroid 2023 JS4 rushing towards Earth, NASA's NEOWISE spacecraft warns - HT Tech", "description": "A 120-foot asteroid is on its way to make a close approach to Earth. Here’s what NASA said.", "url": "https://tech.hindustantimes.com/tech/news/120foot-asteroid-2023-js4-rushing-towards-earth-nasas-neowise-spacecraft-warns-71684407398363.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/18/1600x900/asteroid-4063790_960_720_1670757436603_1684407657906.jpg", "publishedAt": "2023-05-18T11:01:29Z", "content": "NASA's Center for Near Earth Object Studies (CNEOS) is responsible for monitoring all known near-Earth objects (NEOs) and assessing their potential risk of impact. Scientists actively scan the skies … [+2684 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "3 free alternatives to Microsoft Excel: save money and boost your productivity - HT Tech", "description": "If you're looking to avoid the expense of a Microsoft Office subscription, there are excellent free alternatives to Microsoft Excel available. These alternatives offer comparable features without the price tag, making them ideal for budget-conscious individua…", "url": "https://tech.hindustantimes.com/how-to/3-free-alternatives-to-microsoft-excel-save-money-and-boost-your-productivity-71684395648455.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/18/1600x900/Microsoft_excel_alternative_1684395976231_1684395976606.jpg", "publishedAt": "2023-05-18T07:53:00Z", "content": "Spreadsheets have become an integral part of the modern business world, and they offer valuable tools for students and teachers as well. However, Microsoft Office's Excel, while powerful, can be expe… [+2600 chars]"}]}