{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Google Maps is getting new AI-powered search updates, an enhanced navigation interface and more - TechCrunch", "description": "Google is rolling out new updates for Maps, including AI-powered features that are designed to make it easier to search and explore.", "url": "https://techcrunch.com/2023/10/26/google-maps-is-getting-new-ai-powered-search-updates-an-enhanced-navigation-interface-and-more/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/06/google-maps-ios-icon.jpg?resize=1200,675", "publishedAt": "2023-10-26T13:01:34Z", "content": "Google is adding a slew of new updates for Maps, including a few AI-powered features that are designed to make it easier for users to search, explore their surroundings and get to their destinations.… [+3715 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars' Seismic Secrets: Decoding the Red Planet's Core Mystery - SciTechDaily", "description": "Mars’s liquid iron core is smaller and denser than previously thought. Not only is it smaller, but it is also surrounded by a layer of molten rock. This is what ETH Zurich researchers conclude on the basis of seismic data from the InSight lander. One year aft…", "url": "https://scitechdaily.com/mars-seismic-secrets-decoding-the-red-planets-core-mystery/", "urlToImage": "https://scitechdaily.com/images/Mars-Core-Molten-Silicate-Layer.jpg", "publishedAt": "2023-10-26T12:39:12Z", "content": "ByETH ZurichOctober 26, 2023\r\nAnalysis of Martian seismic data recorded by the InSight mission in combination with first-principles simulations of the seismic properties of liquid metal alloys have r… [+12348 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Carly Page", "title": "Google adds generative AI threats to its bug bounty program - TechCrunch", "description": "Given that generative AI brings to light new security issues, Google said it sought to rethink how bugs it receives should be categorized and reported", "url": "https://techcrunch.com/2023/10/26/google-generative-ai-threats-bug-bounty/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1246897887.jpg?resize=1200,800", "publishedAt": "2023-10-26T12:19:11Z", "content": "Google has expanded its vulnerability rewards program (VRP) to include attack scenarios specific to generative AI.\r\nIn an announcement shared with TechCrunch ahead of publication, Google said: We bel… [+2238 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "A liquid crystal elastomer fiber can produce morphing fabrics - Tech Explorist", "description": "Shape-shifting fiber can produce morphing fabrics.", "url": "https://www.techexplorist.com/liquid-crystal-elastomer-fiber-produce-morphing-fabrics/76349/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/10/FibeRobo.jpg", "publishedAt": "2023-10-26T09:15:31Z", "content": "An interdisciplinary MIT team has developed FibeRobo- a programmable, actuating fiber that could someday be used in textiles. This thermally-actuated liquid crystal elastomer (LCE) fiber could enable… [+4316 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}]}