{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for April 25: Grab the chance to claim freebies now - HT Tech", "description": "Garena Free Fire MAX redeem codes for April 25, 2022: The process to claim freebies is very simple and easy. The only thing you need is redeem codes and then visit the Garena Free Fire redemption website.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-april-25-grab-the-chance-to-claim-freebies-now-71650848276560.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/Web_capture_5-4-2022_8817_ff.garena.com_1649129974320_1650848346271.jpeg", "publishedAt": "2022-04-25T01:05:25Z", "content": "Garena Free Fire MAX redeem codes for April 25, 2022: Have you claimed Garena Free Free in-game items using redeem codes? If yes, then you can know that you can do the same for its higher version-Gar… [+1928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Holes Devour Thousands of Stars To Fuel Growth - SciTechDaily", "description": "In some of the most crowded parts of the universe, black holes may be ripping apart thousands of stars and using their remains to pack on weight. This discovery, made using NASA's Chandra X-ray Observatory, could help resolve key questions about an elusive cl…", "url": "https://scitechdaily.com/black-holes-devour-thousands-of-stars-to-fuel-growth/", "urlToImage": "https://scitechdaily.com/images/Black-Holes-Raze-Thousands-of-Stars-to-Fuel-Growth.jpg", "publishedAt": "2022-04-24T23:52:19Z", "content": "These four galaxies are part of a large survey of more than 100 galaxies conducted by Chandra that looked for evidence of growing black holes. A new study uncovered evidence that stellar-mass black h… [+5433 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Apple supplier Foxconn suspends production at two China factories: Report - CNA", "description": "Apple's prime supplier Foxconn Technology Group halted operations at two of its factories in eastern China's Kunshan after new COVID-19 cases were reported on site, the South China Morning Post reported on Monday (Apr 25).\r\n\r\nThe operations at those plants ha…", "url": "https://www.channelnewsasia.com/business/apple-supplier-foxconn-suspends-production-two-china-factories-report-2645051", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--YXWym3k_--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-04-24t234619z_2_lynxnpei3n0fd_rtroptp_3_foxconn-results.jpg?itok=xQQ3zzzY", "publishedAt": "2022-04-24T23:43:24Z", "content": "Apple's prime supplier Foxconn Technology Group halted operations at two of its factories in eastern China's Kunshan after new COVID-19 cases were reported on site, the South China Morning Post repor… [+470 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Third Dose Vaccine Protection Against Hospitalization Wanes After 3 Months - SciTechDaily", "description": "Kaiser Permanente finds the Pfizer COVID-19 third dose vaccine protection against hospitalization from omicron wanes after 3 months. A research study released on April 22, 2022, in The Lancet Respiratory Medicine shows that a booster dose of the Pfizer COVID-…", "url": "https://scitechdaily.com/?p=167498", "urlToImage": "https://scitechdaily.com/images/Three-COVID-19-Vaccine-Doses.jpg", "publishedAt": "2022-04-24T19:13:44Z", "content": "A new research study published in The Lancet Respiratory Medicine shows that protection against the omicron variant deteriorates over time even after a third vaccine dose.\r\nKaiser Permanente finds th… [+2986 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Juno Captures Moon Shadow on Jupiter - Tech Explorist", "description": "The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede.", "url": "https://www.techexplorist.com/juno-captures-moon-shadow-on-jupiter/46752/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/04/view-of-Jupiter.jpg", "publishedAt": "2022-04-24T18:30:02Z", "content": "On Feb. 25, 2022, NASA’s Juno spacecraft completed its mission’s 40th close pass by the giant planet, Jupiter. During this pass, it captured a moon shadow view.\r\nJupiter’s moon Ganymede cast a large,… [+1400 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Sun emits massive solar flare with potential to impact satellite communications: CESSI - HT Tech", "description": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems", "url": "https://tech.hindustantimes.com/tech/news/sun-emits-massive-solar-flare-with-potential-to-impact-satellite-communications-cessi-71650711160202.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/23/1600x900/SUn_flares_NASA_pic_1645287521356_1650714493036.jpg", "publishedAt": "2022-04-24T17:48:20Z", "content": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems, the Centre of Excellence in Space Sciences India (CESS… [+1515 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Decade of Science and Trillions of Collisions Show the W Boson Is More Massive Than Expected – A Physicist Explains What It Means - SciTechDaily", "description": "“You can do it quickly, you can do it cheaply, or you can do it right. We did it right.” These were some of David Toback opening remarks when the leader of Fermilab's Collider Detector unveiled the results of a decade-long experiment to measure the mass of a …", "url": "https://scitechdaily.com/a-decade-of-science-and-trillions-of-collisions-show-the-w-boson-is-more-massive-than-expected-a-physicist-explains-what-it-means/", "urlToImage": "https://scitechdaily.com/images/Quantum-Atom-Particle-Physics-Concept.jpg", "publishedAt": "2022-04-24T16:15:51Z", "content": "Measuring the mass of W bosons took 10 years and the result was not what physicists expected.\r\nYou can do it quickly, you can do it cheaply, or you can do it right. We did it right. These were some o… [+8039 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tom Huddleston", "title": "Some of tech's biggest names want a future without passwords — here's what that would look like - CNBC", "description": "From Google to Microsoft, some of tech's biggest names say the dream of a password-less internet is close to reality. The truth is a little more complicated.", "url": "https://www.cnbc.com/2022/04/24/what-a-future-without-passwords-would-look-like-when-it-might-happen.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106197655-1571819572820gettyimages-866481488.jpeg?v=1571887535&w=1920&h=1080", "publishedAt": "2022-04-24T13:30:01Z", "content": "Managing your online passwords can be a chore.\r\nCreating the sort of long, complicated passwords that best deter cyber-thieves especially for dozens of different online accounts can be tedious. But i… [+4631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What a good credit score looks like and how to improve it - BusinessTech", "description": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your ability to continue improving your life over the long term.", "url": "https://businesstech.co.za/news/finance/579878/what-a-good-credit-score-looks-like-and-how-to-improve-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/06/money-e1467040680257.jpg", "publishedAt": "2022-04-24T09:03:21Z", "content": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your abili… [+4305 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "EU to pursue trade deal with India to reduce its ties to Russia - Economic Times", "description": "In addition to trade, the EU will pursue a technology council with India that could include discussions on the general data protection regulation, social media and broader digitalization efforts, said the official, who asked not to be identified because the t…", "url": "https://economictimes.indiatimes.com/news/economy/foreign-trade/eu-to-pursue-trade-deal-with-india-to-reduce-its-ties-to-russia/articleshow/91044746.cms", "urlToImage": "https://img.etimg.com/thumb/msid-91044866,width-1070,height-580,imgsize-65986,overlay-economictimes/photo.jpg", "publishedAt": "2022-04-24T04:47:00Z", "content": "The European Union plans to relaunch trade talks with India in an attempt to give the South Asian nation a viable alternative to diversify away from Russia, according to a senior official familiar wi… [+739 chars]"}, {"source": {"id": null, "name": "Techgamingreport.com"}, "author": "Ebenezer Robbins", "title": "How to secure your Wi-Fi - Tech Gaming Report", "description": "Software bugs or improperly configured interfaces can turn your home router into a gateway for...", "url": "https://www.techgamingreport.com/how-to-secure-your-wi-fi/", "urlToImage": null, "publishedAt": "2022-04-23T16:40:54Z", "content": "Software bugs or improperly configured interfaces can turn your home router into a gateway for hackers. here are ten Security tips that users should definitely consider when setting up their home net… [+4180 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone TRICKS that Apple seriously needs to advertise! These 6 tips are AMAZING - HT Tech", "description": "iPhone tricks that can make using your iPhone so much easier. Apple bakes in a lot of smart features on its iOS.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-tricks-that-apple-seriously-needs-to-advertise-these-6-tips-are-amazing-71650699292003.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/23/1600x900/iPhone_13_Pro_Max_(6)_1633406841433_1650699459251.jpg", "publishedAt": "2022-04-23T07:40:05Z", "content": "iPhone tricks to get the most out of your prized possession: People often say that nothing beats Android phones when it comes to productivity and tricks, and the iPhone is often scoffed at for missin… [+2928 chars]"}]}