{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ingrid Lunden", "title": "Black Friday hits a record $74.4B in sales online, up 5% on last year - TechCrunch", "description": "The momentum of Thanksgiving — which saw consumers spend a record $33.6 billion spent globally online on the day — looks like it continued into Black", "url": "https://techcrunch.com/2024/11/30/black-friday-hits-a-record-74-4b-in-sales-online-up-5-on-last-year/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/09/bomb-explosion.jpg?resize=1200,893", "publishedAt": "2024-11-30T15:19:15Z", "content": "The momentum of Thanksgiving which saw consumers spend a record $33.6 billion spent globally online on the day looks like it continued into Black Friday, with a bang. Adobe said that in the U.S., con… [+3432 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Geoff Colvin", "title": "By Warren Buffett's favorite financial metric, Berkshire's net worth leaves Nvidia and Apple in the dust - Fortune", "description": "At 94, Buffett has managed to best the hottest tech companies around.", "url": "https://fortune.com/2024/11/30/warren-buffett-stocks-net-worth-berkshire-hathaway/", "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2024/11/GettyImages-849890494-e1732738073147.jpg?resize=1200,600", "publishedAt": "2024-11-30T10:00:00Z", "content": "Look at the list of the ten most valuable companies traded on U.S. stock exchanges, and something immediately jumps out. Nine of the companies comprise the business worlds coolest and most exclusive … [+5329 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Reversing Time From Within: Can Gut Bacteria Delay Aging? - SciTechDaily", "description": "The gut microbiome profoundly influences aging, and its modulation may support healthy aging and disease prevention. Aging is a universal and intricate process impacting all living organisms, marked by key genetic features like telomere shortening, genomic in…", "url": "https://scitechdaily.com/reversing-time-from-within-can-gut-bacteria-delay-aging/", "urlToImage": "https://scitechdaily.com/images/Clock-Microbiome-Concept.jpg", "publishedAt": "2024-11-29T21:20:23Z", "content": "Aging is a complex process involving genetic changes and physiological shifts, with the gut microbiome emerging as a critical yet understudied factor influencing health. New research explores the evo… [+5580 chars]"}]}