{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Tata Technologies IPO: GMP jumps after strong subscription status. How to chech allotment, all eyes set on listing date | Mint - Mint", "description": "Tata Technologies IPO GMP today: Shares of the Tata group company are available at a premium of  ₹402 in grey market today", "url": "https://www.livemint.com/market/ipo/tata-technologies-ipo-gmp-jumps-after-strong-subscription-status-how-to-chech-allotment-all-eyes-set-on-listing-date-11700879602279.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/25/1600x900/Tata_Technologies_IPO_GMP_subscription_listing_dat_1700879800218_1700879800366.JPG", "publishedAt": "2023-11-25T02:48:39Z", "content": "Tata Technologies IPO: After closure of subscription of the initial public offering (IPO) of Tata Technologies Ltd, all eyes are now set on Tata Technologies IPO allotment date and Tata Technologies … [+3230 chars]"}, {"source": {"id": null, "name": "Azomining.com"}, "author": null, "title": "Mining Equipment in Space: The Future of Extraterrestrial Resource Extraction - AZoMining", "description": "With the resources present on Earth depleting at an alarming rate, scientists have shifted their focus toward space. In this regard, space mining, which involves extracting precious resources, is considered the future. The space mining industry and technology…", "url": "https://www.azomining.com/Article.aspx?ArticleID=1773", "urlToImage": "https://d2c0zrx8qw0prh.cloudfront.net/images/Article_Images/ImageForArticle_1773_17007502858706510.jpg", "publishedAt": "2023-11-23T15:12:00Z", "content": "With the resources present on Earth depleting at an alarming rate, scientists have shifted their focus toward space. In this regard, space mining, which involves extracting precious resources, is con… [+12086 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is Biohacking? The Wellness Trend Taking Internet By Storm - NDTV", "description": "While some biohacking techniques may appear extreme, others, like meditation and intermittent fasting, are tried-and-tested methods that have been shown to be effective.", "url": "https://www.ndtv.com/feature/what-is-biohacking-the-wellness-trend-taking-internet-by-storm-4600361", "urlToImage": "https://c.ndtvimg.com/2023-11/ttkjfp_walking_625x300_23_November_23.jpeg?ver-20231128.06", "publishedAt": "2023-11-23T13:36:03Z", "content": "Biohacking is also popular among those who are into sports.\r\nThese days wellness trends are all over social media. Recently biohacking, the latest trend has taken the internet by storm after Bryan Jo… [+2978 chars]"}]}