{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Climate: Could Moon Dust Keep Earth Cool? - News18", "description": "The solar radiation technique with the most traction so far is the 24/7 injection of billions of shiny sulphur particles into the upper atmosphere.", "url": "https://www.news18.com/buzz/climate-could-moon-dust-keep-earth-cool-7066051.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/02/moon-2-167626041916x9.png", "publishedAt": "2023-02-13T03:54:44Z", "content": "Whether out-of-the-box thinking or a sign of desperation, scientists on Wednesday proposed the regular transport of moon dust to a gravity point between Earth and Sun to temper the ravages of global … [+3240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Aero India Takes Off In Bengaluru, 809 Companies, 98 Countries, Air Shows - NDTV", "description": "Prime Minister Narendra Modi today inaugurated Asia's largest aero show, Aero India 2023, in Bengaluru. The 14th edition of the event will display indigenous equipment and technologies to forge partnerships with foreign companies.", "url": "https://www.ndtv.com/india-news/aero-india-2023-pm-modi-to-inaugurate-asias-biggest-aero-show-in-bengaluru-today-3777006", "urlToImage": "https://c.ndtvimg.com/2023-02/borqccu8_aero-india_625x300_13_February_23.jpg", "publishedAt": "2023-02-13T02:27:49Z", "content": "<li>Aero India 2023 will feature aerobatics along with a large exhibition and trade fair of aerospace and defence companies.\r\n</li><li>Nearly 809 companies from 98 countries are taking part in Aero I… [+1403 chars]"}, {"source": {"id": null, "name": "Techguide.com.au"}, "author": "Stephen Fenech", "title": "Samsung Galaxy S23 Ultra review - setting a new standard for smartphones - Tech Guide", "description": "98% Design Samsung has knocked it out of the park with the Galaxy S23 Ultra flagship smartphone with a new level of power and performance and a range of features and a stunning camera to make this one of the best smartphones money can buy. Pros Stunning perfo…", "url": "https://www.techguide.com.au/reviews/mobiles-reviews/samsung-galaxy-s23-ultra-review-setting-a-new-standard-for-smartphones/", "urlToImage": "https://www.techguide.com.au/wp-content/uploads/2023/02/S23Review3.jpeg", "publishedAt": "2023-02-13T00:21:45Z", "content": "Its that time of year again – Samsung has released the first flagship devices of 2023 and they have set the bar even higher with an impressively updated Galaxy S23 range.\r\nWeve been using the top-of-… [+7548 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Nathan VanderKlippe", "title": "Israel on 'brink of constitutional collapse,' President Herzog says, calling for delay to legal overhaul - The Globe and Mail", "description": "Some of the most insistent opposition is coming from the tech sector, which has become the economic heart of the country", "url": "https://www.theglobeandmail.com/world/article-netanyahu-israel-judicial-reform/", "urlToImage": "https://www.theglobeandmail.com/resizer/c_ymLVU1pSdXqfFAM6wrO-BxARw=/1200x800/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/KGIE6JDMJBMEVEIL2EF37ZSLKE.jpg", "publishedAt": "2023-02-12T23:40:37Z", "content": "Thousands demonstrate in the streets of Tel Aviv on Saturday in opposition to Israeli Prime Minister Benjamin Netanyahu's new right-wing coalition and its proposed judicial reforms to reduce powers o… [+6932 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Links Obesity to Blinding Eye Disease - SciTechDaily", "description": "A new study from Canada, published in the renowned journal Science, has shed light on a potential molecular cause of age-related macular degeneration (AMD). Research conducted at Hôpital Maisonneuve-Rosemont in Montreal has revealed how stressors of daily lif…", "url": "https://scitechdaily.com/?p=249345", "urlToImage": "https://scitechdaily.com/images/Human-Eye-Close-Up-1.jpg", "publishedAt": "2023-02-12T22:30:33Z", "content": "Macular degeneration is a progressive eye disease that affects the central part of the retina, called the macula. It leads to a loss of central vision, making it difficult to read, drive, and recogni… [+2608 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Feeding Billions: Researchers Clone Hybrid Rice Strains With 95% Efficiency - SciTechDaily", "description": "An international group of researchers has achieved a 95% success rate in reproducing a commercial hybrid rice variety as a clone through seeds. This breakthrough has the potential to reduce the cost of hybrid rice seeds, making high-yielding and disease-resis…", "url": "https://scitechdaily.com/feeding-billions-researchers-clone-hybrid-rice-strains-with-95-efficiency/", "urlToImage": "https://scitechdaily.com/images/Rice-Farming-Concept.jpg", "publishedAt": "2023-02-12T21:20:57Z", "content": "ByUniversity of California - DavisFebruary 12, 2023\r\nThe new approach could enable seed companies to quickly and extensively produce hybrid seeds, as well as providing farmers with seeds that can be … [+4925 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": null, "title": "Ed Sheeran’s message to Kiwis following concert technical difficulties and impending Cyclone Gabrielle - New Zealand Herald", "description": "With surprise performances, technical difficulties and wild weather, the star saw it all.", "url": "https://www.nzherald.co.nz/entertainment/ed-sheerans-message-to-kiwis-following-concert-technical-difficulties-and-impending-cyclone-gabrielle/L55XEK33UJFCTILEUKSD7WZL44/", "urlToImage": "https://www.nzherald.co.nz/resizer/aIdmKIzTy-PQNQGAouE_yUVXJkI=/1200x675/smart/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/C4CH7KRPUJHW3DTHRBTOUJQBUE.JPG", "publishedAt": "2023-02-12T20:20:14Z", "content": "Ed Sheeran has released a video wrapping up his New Zealand leg of the tour and addressing the Auckland show's technical issues. Video / \r\nteddysphotosThe legendary Ed Sheeran has officially left the… [+3842 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sandisiwe Shoba", "title": "Seize the Momint! Cape Town startup offers blockchain-based solution to energy crisis - News24", "description": "A new initiative, using blockchain technology, could potentially help roll out more solar PV across South Africa.", "url": "https://www.news24.com/fin24/climate_future/solutions/seize-the-momint-cape-town-startup-offers-blockchain-based-solution-to-energy-crisis-20230212", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3741/75c834d0c4b74b8cb70ca00e2017c09d.jpg", "publishedAt": "2023-02-12T11:46:44Z", "content": "<ul><li>Delmas High School in Mpumalanga is getting a solar PV system that was funded via blockchain technology.</li><li>The project is part of an initiative launched earlier this year by Cape Town-b… [+4184 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Could ChatGPT replace Google? Experts weigh in on who will win the race to an AI search engine - Daily Mail", "description": "MailOnline asks tech experts if they think artificial intelligence tools like ChatGPT will surpass Google as the world's number one search engine.", "url": "https://www.dailymail.co.uk/sciencetech/article-11723499/Could-ChatGPT-replace-Google-Experts-weigh-win-race-AI-search-engine.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/09/15/67511119-0-image-a-23_1675955724077.jpg", "publishedAt": "2023-02-12T10:17:05Z", "content": "So far, there doesn't seem to be an awful lot that ChatGPT the chatbot powered by artificial intelligence (AI) can't do.\r\nIt has been used to pass exams, deliver a sermon, write software and give rel… [+16233 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "The Tech Weekender | Top news from the world of technology this week - msnNOW", "description": "We tell you how Google hasn't had the best start for Bard, its answer to ChatGPT. Apple is looking to increase prices of iPhone 15, OnePlus has ditched the Pro variant, Elon Musk fires a Twitter engineer over the poor engagement of his tweets, Opera is lookin…", "url": "https://www.moneycontrol.com/news/photos/technology/the-tech-weekender-top-news-from-the-world-of-technology-this-week-61-10061941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/394965563-770x433.jpg", "publishedAt": "2023-02-12T06:39:01Z", "content": null}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Mantashe still thinks he has a chance with Eskom - BusinessTech", "description": "Many ANC leaders were surprised by the appointment of an electricity minister, with some saying the new minister would merely serve as a temporary “project manager”.", "url": "https://businesstech.co.za/news/government/664017/mantashe-still-thinks-he-has-a-chance-with-eskom/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/12/Gwede-Mantashe.jpg", "publishedAt": "2023-02-12T06:16:19Z", "content": "There has been growing concern over President Cyril Ramaphosa’s announcement that the government will be looking to appoint an ‘electricity minister’ to deal specifically with the energy crisis in So… [+3776 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 is coming with USB-C port, but with a TWIST - HT Tech", "description": "Apple is planning to create a big difference between standard iPhone 15 models and the iPhone 15 Pro series in terms of charging speed by introducing a new USB-C port.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-is-coming-with-usb-c-port-but-with-a-twist-71676176987608.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/02/12/1600x900/lasse-jensen-lxzWmerBObA-unsplash_1676177175371_1676177191738_1676177191738.jpg", "publishedAt": "2023-02-12T04:47:17Z", "content": "After the European Union's order, Apple has no alternative but to include a USB Type-C port in its iPhones. Several leaks and rumours have suggested that iPhone 15 series would be the first iPhone li… [+1898 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover the Origins of a Devastating Childhood Illness - SciTechDaily", "description": "Scientists from Karolinska Institutet, in collaboration with Karolinska University Hospital, have uncovered the root cause of Langerhans cell histiocytosis. These groundbreaking findings, published in the journal Science Immunology, could pave the way for new…", "url": "https://scitechdaily.com/scientists-discover-the-origins-of-a-devastating-childhood-illness/", "urlToImage": "https://scitechdaily.com/images/Young-Child-Disease-Illness-Concept.jpg", "publishedAt": "2023-02-11T19:55:26Z", "content": "Langerhans Cell Histiocytosis (LCH) is a rare, cancer-like disease that affects cells called Langerhans cells. These cells are found in the skin, bone, and other organs, and play a key role in the im… [+3767 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "This protein in the lungs blocks SARS-CoV-2 infection - Tech Explorist", "description": "The receptor sticks to the virus and pulls it away from the target cells.", "url": "https://www.techexplorist.com/protein-lungs-blocks-sars-cov-2-infection/56879/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/02/LRRC15-green.jpg", "publishedAt": "2023-02-11T12:16:44Z", "content": "COVID-19, caused by SARS-CoV-2, enters the human body through its spike protein, which attaches to a specific receptor in our cells. It mainly uses a protein called the angiotensin-converting enzyme … [+3207 chars]"}]}