{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "STUNNING iPhone 13 price cut announced as iPhone 14 launch gets nearer - HT Tech", "description": "iPhone 13 price cut: With iPhone 14 launch set to happen in just a few months, Amazon is offering a great iPhone deal that should not be missed at all.", "url": "https://tech.hindustantimes.com/mobile/news/stunning-iphone-13-price-cut-announced-as-iphone-14-launch-gets-nearer-71652768191341.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/17/1600x900/4_1646716534850_1652768318280.jpg", "publishedAt": "2022-05-17T06:22:21Z", "content": "iPhone 13 price cut: As the much anticipated iPhone 14 launch gets nearer, the offers on the existing iPhone 13 are getting better and better. If you have been window shopping for a new smartphone an… [+1761 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung to follow Apple again! Could design its OWN exclusive chipset - HT Tech", "description": "Yes, you read that right. Samsung could design its own exclusive chipset for its flagship Galaxy S series devices.", "url": "https://tech.hindustantimes.com/mobile/news/samsung-to-follow-apple-again-could-design-its-own-exclusive-chipset-71652762870073.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/17/1600x900/DSC_1664_1646205496466_1652762969534.jpg", "publishedAt": "2022-05-17T04:52:03Z", "content": "Yes, you read the headline right! Samsung could take a leaf out of Apples book once again and work on a custom chipset that it could use on a future Galaxy S device! But wait! Do you wonder that Sams… [+2120 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Georgia State researchers find CRISPR-Cas9 gene editing approach can alter the social behavior of animals - EurekAlert", "description": "New gene-editing techniques are shedding light on how hormones impact social behavior in animals and possibly, humans. The research was led by Dr. Elliott Albers, Director of the Georgia State Center for Behavioral Neuroscience.", "url": "https://www.eurekalert.org/news-releases/952802", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-05-17T02:06:39Z", "content": "ATLANTA –Georgia State University scientists have created gene-edited hamsters for studies of social neuroscience and have found that the biology behind social behavior may be more complex than previ… [+3546 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Engineers Design an Electrical Microgrid for a Lunar Base - Universe Today", "description": "Sandia National Laboratories is developing microgrid technology that will power the Artemis Base Camp and operations on the Moon!", "url": "https://www.universetoday.com/155906/engineers-design-an-electrical-microgrid-for-a-lunar-base/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/12/artemis_basecamp.jpg", "publishedAt": "2022-05-16T19:01:35Z", "content": "For seventy years, Albuquerque-based Sandia National Laboratories has been developing electrical microgrids that increase community resilience and ensure energy security. Applications include the Sma… [+8739 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Colin Lodewick", "title": "Getting sick from Omicron protects you against a wide range of variants better than a booster, studies find - Fortune", "description": "Only vaccinated individuals are protected, according to the studies by the University of Washington and BioNTech", "url": "https://fortune.com/2022/05/16/omicron-infection-covid-protects-better-than-booster/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2022/05/GettyImages-1238718817.jpg?resize=1200,600", "publishedAt": "2022-05-16T18:36:59Z", "content": "Skip to Content"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "CRISPR now possible in cockroaches - Science Daily", "description": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a new study. The simple and efficient technique, named 'direct parental' CRISPR (DIPA-CRISPR), involves the injection of materials into female adults where e…", "url": "https://www.sciencedaily.com/releases/2022/05/220516123952.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-16T17:35:15Z", "content": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a study published by Cell Press on May 16th in the journal Cell Reports Methods.The simple and ef… [+3316 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Converting CO2 to formic acid using an alumina-supported, iron-based compound - Phys.org", "description": "Photoreduction of CO2 into transportable fuel like formic acid (HCOOH) is a great way of dealing with CO2's rising levels in the atmosphere. To aid in this mission, a research team from Tokyo Tech chose an easily available iron-based mineral and loaded it ont…", "url": "https://phys.org/news/2022-05-co2-formic-acid-alumina-supported-iron-based.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/lights-catalyst-reacti.jpg", "publishedAt": "2022-05-16T14:47:11Z", "content": "Photoreduction of CO2 into transportable fuel like formic acid (HCOOH) is a great way of dealing with CO2's rising levels in the atmosphere. To aid in this mission, a research team from Tokyo Tech ch… [+4401 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp Tips and Tricks: How to change WhatsApp chat wallpaper - HT Tech", "description": "Users can change WhatsApp chat wallpaper either for all or for a specific chat. Here is a step-by-step guide for the same.", "url": "https://tech.hindustantimes.com/how-to/whatsapp-tips-and-tricks-how-to-change-whatsapp-chat-wallpaper-71652696997246.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/16/1600x900/WhatsApp_1643269476629_1652697086112.jpg", "publishedAt": "2022-05-16T10:35:00Z", "content": "WhatsApp, one of the most widely used applications for chatting, allows its users to change the chat wallpaper. Android users who are using WhatsApp on their devices can change the chat wallpaper for… [+1302 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Economists predict big rate hike for South Africa this week – here’s what to expect - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger than at previous meetings.", "url": "https://businesstech.co.za/news/finance/586648/economists-predict-big-rate-hike-for-south-africa-this-week-heres-what-to-expect/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand-e1606294594929.jpg", "publishedAt": "2022-05-16T07:19:40Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger tha… [+3907 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Analysts warn of a massive fuel price increase for June. Crumbling weather service infrastructure could hamper the prediction and issuing of warnings for severe events. amaBhungane has revealed a fuel theft operation, siphoning millions of rands worth of fuel…", "url": "https://businesstech.co.za/news/government/586590/5-important-things-happening-in-south-africa-today-1279/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/04/Flood-climate-change.jpg", "publishedAt": "2022-05-16T06:02:11Z", "content": "Heres what is happening in and affecting South Africa today:\r\n<ul><li>Fuel price hike: Analysts have warned motorists to expect a significant petrol price increase next month. Economist Dawie Roodt s… [+2410 chars]"}]}