{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Elon Musk's SpaceX Inspiration4 will send 4 people into space - HT Tech", "description": "SpaceX’s Falcon 9 rocket and crew Dragon vehicle, however, are powerful enough to take the Inspiration4 crew all the way into orbit, where they will circle the Earth for three days.", "url": "https://tech.hindustantimes.com/tech/news/elon-musk-s-spacex-inspiration4-will-send-4-people-into-space-71631345070857.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/09/11/1600x900/d72872d63e97493b95f74b9fc099d957-d72872d63e97493b95f74b9fc099d957-1_1623636772188_1631345181512.jpg", "publishedAt": "2021-09-11T07:24:30Z", "content": "By Wendy Whitman Cobb,Professor of Strategy and Security Studies, US Air Force School of Advanced Air and Space Studies\r\nMontgomery, Sep 11 (The Conversation) On September 15, 2021, the next batch of… [+4660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aswathi Pacha", "title": "Explained: Can a solar storm disrupt your internet connection? - The Indian Express", "description": "Massive Solar Storm could cause global internet blackout: The rapid development of technology took place in the last three decades when the Sun was in its period of low activity and there are very limited studies on whether our current infrastructure can with…", "url": "https://indianexpress.com/article/explained/solar-storm-internet-apocalypse-explained-7502072/", "urlToImage": "https://images.indianexpress.com/2021/09/SolarFlares_NASA_1200.jpg", "publishedAt": "2021-09-11T03:26:29Z", "content": "Impact of solar storm could be a threat to the internet. Everything you need to know: After witnessing a pandemic, locust attack and cicada invasion in 2020, meme pages quipped that human beings are … [+5389 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Steve Haske", "title": "Your standard SSD might work as an Xbox storage expansion - Ars Technica", "description": "The right PCIe 4.0 drives could offer a cheaper solution to Seagate's pricey card.", "url": "https://arstechnica.com/gaming/2021/09/your-standard-ssd-might-work-as-an-xbox-storage-expansion/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/09/xbox-series-ssd-upgrade-760x380.jpg", "publishedAt": "2021-09-10T21:53:27Z", "content": "10 with 10 posters participating\r\nXbox Series X or S owners in need of more storage space for current-gen software may be in luck if they have a spare SSD, according to one modder's experiences.\r\nWri… [+2717 chars]"}, {"source": {"id": null, "name": "Webbikeworld.com"}, "author": "Facebook", "title": "Stab-Proof Vest Tech: A Variable-Rigidity Prototype For Motorcycle Gear - webBikeWorld", "description": "https://youtu.be/LocoDawNIns    Two labs have created a new type of material originally meant for stab-proof and bullet-proof vests - and I want it in my motorcycle jacket.    The motorcycle gear industry has seen a Renaissance of improvement on", "url": "https://www.webbikeworld.com/variable-rigidity-prototype-for-motorcycle-gear-from-the-labs-of-stab-proof-vests/", "urlToImage": "https://www.webbikeworld.com/wp-content/uploads/2021/09/Chain-Mail-Fabric.jpg.jpg", "publishedAt": "2021-09-10T17:01:44Z", "content": "Two labs have created a new type of material originally meant for stab-proof and bullet-proof vests – and I want it in my motorcycle jacket.\r\nThe motorcycle gear industry has seen a Renaissance of im… [+3974 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Scientists' egos are key barrier to progress, says Covid vaccine pioneer - The Guardian", "description": "Prof Katalin Karikó of BioNTech says she endured decades of scepticism over her work on mRNA vaccines", "url": "https://amp.theguardian.com/world/2021/sep/10/scientists-egos-key-barrier-to-progress-covid-vaccine-pioneer-katalin-kariko", "urlToImage": null, "publishedAt": "2021-09-10T11:46:00Z", "content": "CoronavirusProf Katalin Karikó of BioNTech says she endured decades of scepticism over her work on mRNA vaccines \r\nScientists would make swifter progress in solving the worlds problems if they learne… [+5258 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Associated Press", "title": "Facebook, Ray-Ban launch smart glasses — who will wear them? - Fox Business", "description": "Seven years after the ill-fated Google Glass, and five years after Snap rolled out Spectacles, another tech giant is trying its hand at internet-connected smart glasses, hoping that this time around things might be different and people will actually wear them.", "url": "https://www.foxbusiness.com/markets/facebook-ray-ban-launch-smart-glasses", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/09/0/0/ray-ban-facebook.jpg?ve=1&tl=1", "publishedAt": "2021-09-10T10:48:19Z", "content": "Seven years after the ill-fated Google Glass, and five years after Snap rolled out Spectacles, another tech giant is trying its hand at internet-connected smart glasses, hoping that this time around … [+2962 chars]"}, {"source": {"id": null, "name": "Road to VR"}, "author": "Scott Hayden", "title": "Facebook & Ray-Ban Launch $300 Stories Glasses, a Hybrid Between Snap Spectacles & Bose Frames - Road to VR", "description": "Facebook and Ray-Ban today unveiled Stories, a new line of tech-forward glasses the companies hope will pave the way for a future of smart and stylish AR devices. Stories appear to fit in the same category as the first three generations of Snap’s Spectacles, …", "url": "https://www.roadtovr.com/facebook-ray-ban-stories-release-300/", "urlToImage": "https://roadtovrlive-5ea0.kxcdn.com/wp-content/uploads/2021/09/stories-1.jpg", "publishedAt": "2021-09-09T16:27:55Z", "content": "Facebook and Ray-Ban today unveiled Stories, a new line of tech-forward glasses the companies hope will pave the way for a future of smart and stylish AR devices. Stories appear to fit in the same ca… [+3567 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Sinovac to trial Covid-19 vaccine in children in South Africa - BusinessTech", "description": "China’s Sinovac Biotech will trial its Covid-19 vaccine in children and adolescents in South Africa as part of a global study, Reuters reports.", "url": "https://businesstech.co.za/news/trending/520012/sinovac-to-trial-covid-19-vaccine-in-children-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/Sinovac.jpg", "publishedAt": "2021-09-09T13:56:50Z", "content": "China’s Sinovac Biotech will trial its Covid-19 vaccine in children and adolescents in South Africa as part of a global study, Reutersreports.\r\nThe study will evaluate the efficacy, immunogenicity an… [+1367 chars]"}]}