{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Microsoft Surface event LIVE: Event begins; urface Go 4, Laptop Go 3, more to be launched - HT Tech", "description": "Microsoft Surface event updates: Microsoft has announced Surface Go 4, Laptop Go 3, new Windows 11 features, as well as AI. The blog is now closed.", "url": "https://tech.hindustantimes.com/tech/news/microsoft-surface-event-live-surface-go-4-laptop-go-3-windows-11-features-to-ai-check-what-may-launch-today-71695294006932.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/21/1600x900/Surface_Studio_1695311399457_1695311404770.png", "publishedAt": "2023-09-21T14:11:46Z", "content": "Microsoft Surface event: The event ends, here are the key highlights\r\nIf you missed the event, do not worry. Here are the major announcements that took place today.\r\nCopilots for Windows 11 were anno… [+12554 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Violating the Universal Kasha's Rule – Scientists Uncover Secrets of a Mysterious Blue Molecule - SciTechDaily", "description": "Scientists from IOCB Prague are the first to describe the causes of the behavior of one of the fundamental aromatic molecules, azulene. This molecule has captivated the scientific community not just with its distinct blue hue, but also with its unique propert…", "url": "https://scitechdaily.com/violating-the-universal-kashas-rule-scientists-uncover-secrets-of-a-mysterious-blue-molecule/", "urlToImage": "https://scitechdaily.com/images/Artistic-Rendering-of-the-Unusual-Behaviour-of-Azulene.jpg", "publishedAt": "2023-09-21T13:41:11Z", "content": "ByInstitute of Organic Chemistry and Biochemistry of the Czech Academy of Sciences (IOCB Prague)September 21, 2023\r\nResearchers have deciphered azulenes unique behavior, paving the way for advances i… [+5974 chars]"}, {"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "Machine Learning challenges earlier concepts about formation of long and short duration Gamma-Ray Bursts - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/machine-learning-challenges-earlier-concepts-about-formation-long-and-short-duration-gamma-ray", "urlToImage": null, "publishedAt": "2023-09-21T11:30:55Z", "content": "Machine learning algorithms have revealed unexpected complexity in Gamma-Ray Bursts (GRBs), challenging earlier concepts that Long-duration GRBs, originate from the collapse of massive stars and shor… [+3236 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shackleton Shadows Unveiled: NASA Stunning Moon Camera Mosaic Sheds Light on Lunar South Pole - SciTechDaily", "description": "LROC and ShadowCam collaboratively unveil the Shackleton Crater's mosaic, providing unparalleled insights into the lunar South Pole and its potential ice deposits, aiding future lunar exploration missions. A new mosaic of the Shackleton Crater showcases the p…", "url": "https://scitechdaily.com/shackleton-shadows-unveiled-nasa-stunning-moon-camera-mosaic-sheds-light-on-lunar-south-pole/", "urlToImage": "https://scitechdaily.com/images/Shackleton-Crater-Mosaic.jpg", "publishedAt": "2023-09-21T09:42:26Z", "content": "ByNASASeptember 21, 2023\r\nA new mosaic of the Shackleton Crater. Credit: Mosaic created by LROC (Lunar Reconnaissance Orbiter) and ShadowCam teams with images provided by NASA/KARI/ASU\r\nLROC and Shad… [+5527 chars]"}]}