{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "KSL.com"}, "author": "Sean Walker, KSL.com", "title": "It's official: No. 11 BYU will play No. 5 Texas Tech for Big 12 title — after home finale with UCF - KSL.com", "description": "The Cougars didn't have to wait until after Saturday's 11 a.m. kickoff in Provo to clinch their first Big 12 championship game berth: Arizona did that for them Friday night.", "url": "https://www.ksl.com/article/51411972/its-official-no-11-byu-will-play-no-5-texas-tech-for-big-12-title--after-home-finale-with-ucf", "urlToImage": "https://img.ksl.com/slc/3118/311884/31188418.jpeg?filter=kslv2/responsive_story_lg", "publishedAt": "2025-11-29T05:47:55Z", "content": "PROVO BYU didn't have to wait until after Saturday morning's kickoff against UCF (11 a.m. MST, ESPN2) to clinch a spot in the Big 12 championship game.\r\nIn that regard, Arizona took the suspense out … [+3904 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Isis Almeida, Katherine Doherty, Christian Dass", "title": "CME Partially Restores Operations With Restart of Forex Platform - Bloomberg.com", "description": "The Chicago Mercantile Exchange restored trading operations in time to wrap up a holiday-shortened week in the US, recovering from an hours-long technical outage that had disrupted multiple financial markets across Asia and Europe.", "url": "https://www.bloomberg.com/news/articles/2025-11-28/cme-partially-restores-operations-with-restart-of-forex-platform", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i29wru1F_qpo/v0/1200x799.jpg", "publishedAt": "2025-11-28T20:03:09Z", "content": "The Chicago Mercantile Exchange restored trading operations in time to wrap up a holiday-shortened week in the US, recovering from an hours-long technical outage that had disrupted multiple financial… [+392 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Rohail Saleem", "title": "Samsung Galaxy Z TriFold To Cost Just A Trifle More Than Apple’s iPhone Fold - Wccftech", "description": "Samsung appears to be pricing the upcoming Galaxy Z TriFold at a very attractive price point in anticipation of Apple's iPhone Fold.", "url": "https://wccftech.com/samsung-galaxy-z-trifold-to-cost-just-a-trifle-more-than-apples-iphone-fold/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/10/ked202510280015.700x.0-1-scaled.jpg", "publishedAt": "2025-11-28T10:11:00Z", "content": "Samsung appears to be deliberately pricing the upcoming Galaxy Z TriFold at a very attractive price point in anticipation of Apple's iPhone Fold, which is expected to launch in the second half of 202… [+1904 chars]"}]}