{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "CNBCTV18"}, "author": "https://www.cnbctv18.com", "title": "TCS top brass salary jumps 120% in three years, former CEO Rajesh Gopinathan took home nearly Rs 30 cr in FY23 - CNBCTV18", "description": "TCS’ former CEO Rajesh Gopinathan took home nearly Rs 30 crore in FY23, which still lower than what his peers at HCL Tech, Infosys, Tech Mahindra and Wipro received as compensation in the previous fiscal.", "url": "https://www.cnbctv18.com/education/tcs-former-ceo-rajesh-gopinathan-salary-rs-30-crore-fy23-top-brass-compensation-up-120-percent-in-three-years-16869331.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2018/04/2018-04-19T154830Z_1_LYNXMPEE3I1HG_RTROPTP_4_TCS-RESULTS.jpg", "publishedAt": "2023-06-07T04:42:25Z", "content": "homeeducation NewsTCS top brass salary jumps 120% in three years, former CEO Rajesh Gopinathan took home nearly Rs 30 cr in FY23\r\nTCS former CEO Rajesh Gopinathan took home nearly Rs 30 crore in FY23… [+1060 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "House-sized asteroid hurtling towards Earth, NASA reveals crucial details! - HT Tech", "description": "NASA has revealed that a house-sized asteroid named Asteroid 2018 KR could make its closest trip to Earth soon. Know its speed, distance, and more details.", "url": "https://tech.hindustantimes.com/tech/news/housesized-asteroid-hurtling-towards-earth-nasa-reveals-crucial-details-71686112640341.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/07/1600x900/space-7288750_1280_1677829805863_1686112725493.jpg", "publishedAt": "2023-06-07T04:39:17Z", "content": "To determine the potential danger posed by asteroids that come close to Earth, NASA calculates its orbit to gauge the distance at which it will pass the planet. The asteroid's orbit is computed by fi… [+1917 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "We asked AI chatbot Google Bard about the next big solar storm; The answer was TERRIFYING - HT Tech", "description": "We asked Google Bard, the AI chatbot, about the possibility of a major solar storm in 2023. The answer was quite terrifying. Find out what it revealed.", "url": "https://tech.hindustantimes.com/tech/news/we-asked-ai-chatbot-google-bard-about-the-next-big-solar-storm-the-answer-was-terrifying-71686111925622.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/07/1600x900/NOAA_1632590234307_1686111980087.JPG", "publishedAt": "2023-06-07T04:28:45Z", "content": "The Earth continues to wait for the big cloud of coronal mass ejections (CME) that is expected to hit between June 7-8 and spark a minor solar storm. In the last couple of weeks, our planet has witne… [+2602 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Quantum of Solace: Resolving a Mathematical Puzzle in Quarks and Gluons in Nuclear Matter - SciTechDaily", "description": "Scientists have taken a significant step forward in the study of the properties of quarks and gluons, the particles that make up atomic nuclei, by resolving a long-standing issue with a theoretical calculation method known as “axial gauge.” MIT and University…", "url": "https://scitechdaily.com/a-quantum-of-solace-resolving-a-mathematical-puzzle-in-quarks-and-gluons-in-nuclear-matter/", "urlToImage": "https://scitechdaily.com/images/Quark-Gluon-Plasma-Illustration.jpg", "publishedAt": "2023-06-07T03:14:30Z", "content": "ByU.S. Department of EnergyJune 6, 2023\r\nA cartoon of the quark-gluon plasma (small red, green, and blue circles) produced in a relativistic heavy ion collision between two heavy nuclei (white circle… [+6238 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Apple reveals its 2023 Apple Design Award winners - TechCrunch", "description": "Apple has unveiled the winners of the 2023 Apple Design Awards at its annual Worldwide Developers Conference.", "url": "https://techcrunch.com/2023/06/06/apple-reveals-its-2023-apple-design-award-winners/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/Apple-WWDC23-Design-Awards-trophy-230605_big.jpg.large_2x.jpg?resize=1200,675", "publishedAt": "2023-06-06T20:40:47Z", "content": "Apple has unveiled the winners of its 2023 Apple Design Awards at its annual Worldwide Developers Conference this week. Each year, the tech giant recognizes a dozen apps and games across six categori… [+2217 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Shows Early Universe Crackled With Bursts of Star Formation - SciTechDaily", "description": "Webb Also Continues To Uncover a Bounty of Distant, Young Galaxies With its large, light-gathering mirror and infrared sensitivity, NASA’s James Webb Space Telescope (JWST) is uniquely suited to study galaxies that existed in the early universe, just a few hu…", "url": "https://scitechdaily.com/webb-space-telescope-shows-early-universe-crackled-with-bursts-of-star-formation/", "urlToImage": "https://scitechdaily.com/images/Star-Formation-Illustration.jpg", "publishedAt": "2023-06-06T19:23:32Z", "content": "BySpace Telescope Science InstituteJune 6, 2023\r\nThe James Webb Space Telescopes JADES program is providing unprecedented insights into the early universe, discovering hundreds of ancient galaxies an… [+9481 chars]"}]}