{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Japan's lunar lander achieves successful touchdown - Moneycontrol", "description": "Japan's lunar lander achieves historic moon landing. Technical glitch questions mission goals.", "url": "https://www.moneycontrol.com/news/photos/space/japans-lunar-lander-achieves-successful-touchdown-12093481.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/Japans-Moon-Mission-Slim2-770x433.png", "publishedAt": "2024-01-20T10:29:38Z", "content": "Discover the latest business news, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated!"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": null, "title": "Video: Gadgets 360 With Technical Guruji: Galaxy AI Debuts on Galaxy S24 Series - Gadgets 360", "description": "Samsung recently unveiled its much-anticipated Galaxy S24 series, showcasing an array of AI features powered by Galaxy AI. Galaxy AI brings a new set of AI-powered features for Samsung devices, enabled by on-device AI and cloud-based AI. The AI features inclu…", "url": "https://www.gadgets360.com/videos/gadgets-360-with-technical-guruji-galaxy-ai-debuts-on-galaxy-s24-series-754907", "urlToImage": "https://c.ndtvimg.com/2024-01/afeiru1_ai-debut_640x480_20_January_24.jpg", "publishedAt": "2024-01-20T06:46:57Z", "content": "Samsung recently unveiled its much-anticipated Galaxy S24 series, showcasing an array of AI features powered by Galaxy AI. Galaxy AI brings a new set of AI-powered features for Samsung devices, enabl… [+573 chars]"}, {"source": {"id": null, "name": "9to5Mac"}, "author": "Zac Hall", "title": "Apple updates Vision Pro tech specs to correct video mirroring AirPlay quality - 9to5Mac", "description": "Apple revealed Vision Pro tech specs today as pre-orders went live in the United States. One specification appears to have...", "url": "https://9to5mac.com/2024/01/19/vision-pro-video-mirroring-resolution/", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/01/vision-pro-tour.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2024-01-20T01:57:00Z", "content": "Apple revealed Vision Pro tech specs today as pre-orders went live in the United States. One specification appears to have been published with an error, however, as the tech specs page has changed si… [+878 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "After Netflix says no, other app makers debate a Vision Pro launch - TechCrunch", "description": "YouTube is following in Netflix’s footsteps as it decides not to release a dedicated app for the Apple Vision Pro’s upcoming launch. Like Netflix YouTube is following in Netflix’s footsteps as it decides not to release a dedicated app for the Apple Vision Pro…", "url": "https://techcrunch.com/2024/01/19/youtube-and-other-apps-missing-from-apple-vision-pro-launch/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/wwdc-2023-vision-pro-lifestyle-plane-e1686004427171.jpg?w=1200", "publishedAt": "2024-01-19T21:21:21Z", "content": "YouTube is following in Netflixs footsteps as it decides not to release a dedicated app for the Apple Vision Pros upcoming launch. Like Netflix subscribers, viewers will have to go to the web browser… [+2962 chars]"}]}