{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's Lucy mission spacecraft will fly by asteroid Dinikinesh for the first time - HT Tech", "description": "NASA's Lucy mission is set to carry out its first flyby of the asteroid Dinikinesh today, November 1, as an engineering test to keep the asteroid within the science instruments' fields of view.", "url": "https://tech.hindustantimes.com/tech/news/nasas-lucy-mission-spacecraft-will-flyby-asteroid-dinikinesh-for-the-first-time-71698830392006.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/01/1600x900/asteroid_1698836496040_1698836503161.jpg", "publishedAt": "2023-11-01T11:03:07Z", "content": "Asteroids have posed a threat to Earth with their close approaches throughout history. While most of these ancient space rocks have passed the planet at close proximity, a few of them have impacted E… [+2166 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Juno Mission Discovers Organics on Jupiter's Giant Moon Ganymede - SciTechDaily", "description": "Data collected by NASA’s Juno mission indicates a briny past may be bubbling to the surface on Jupiter’s largest moon. NASA’s Juno mission has observed mineral salts and organic compounds on the surface of Jupiter’s moon Ganymede. Data for this discovery was …", "url": "https://scitechdaily.com/?p=323393", "urlToImage": "https://scitechdaily.com/images/Enhanced-Ganymede-scaled.jpg", "publishedAt": "2023-11-01T08:46:14Z", "content": "ByJet Propulsion LaboratoryNovember 1, 2023\r\nThis enhanced image of the Jovian moon Ganymede was obtained by the JunoCam imager aboard NASAs Juno spacecraft during the missions June 7, 2021, flyby of… [+8878 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What’s the ISRO budget for the project? - HT Tech", "description": "Shukrayaan1 mission Whats theISRObudget for the project The Shukrayaan1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour. The Shukrayaan1 mission is expected to cost between Rs. 500 cr…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan1-mission-what-s-the-isro-budget-for-the-project-71698724427302.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/31/1600x900/Venus_1696761565001_1698724499602.jpg/", "publishedAt": "2023-10-30T22:33:48Z", "content": "Photo Credit: Pixabay\r\n The Shukrayaan-1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour.\r\nPhoto Credit: Pixabay\r\n The Shuk… [+1527 chars]"}]}