{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Revolutionary New Physics Hypothesis: Three Time Dimensions, One Space Dimension - SciTechDaily", "description": "How would our world be perceived by observers moving faster than light in a vacuum? According to theorists from Warsaw and Oxford universities, such a view would differ from what we encounter daily, with the presence of not only spontaneous phenomena but also…", "url": "https://scitechdaily.com/a-revolutionary-new-physics-hypothesis-three-time-dimensions-one-space-dimension/", "urlToImage": "https://scitechdaily.com/images/Clock-Time-Relativity-Concept-Art.jpg", "publishedAt": "2023-02-02T11:48:01Z", "content": "The researchers hope that their findings will contribute to a better understanding of the phenomenon of spontaneous symmetry breaking associated with the mass of the Higgs particle and other particle… [+6538 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Breakthrough: Accurate New Map of All the Matter in the Universe Released - SciTechDaily", "description": "Analysis combines Dark Energy Survey and South Pole Telescope data to understand evolution of universe. Sometimes to know what the matter is, you have to find it first. When the universe began, matter was flung outward and gradually formed the planets, stars,…", "url": "https://scitechdaily.com/cosmic-breakthrough-accurate-new-map-of-all-the-matter-in-the-universe-released/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Expanding-Universe-Concept.jpg", "publishedAt": "2023-02-02T10:25:30Z", "content": "ByLouise Lerner, University of ChicagoFebruary 2, 2023\r\nA team of scientists, comprising experts from the University of Chicago and Fermi National Accelerator Laboratory, have made a game-changing an… [+6057 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Advanced Remote Soil Carbon Sequestration and Emissions Measurement - AZoCleantech", "description": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering, costs, precision, and availability. Carbon sequestration an…", "url": "https://www.azocleantech.com/article.aspx?ArticleID=1655", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/Article_Images/ImageForArticle_1655_16753236478707967.jpg", "publishedAt": "2023-02-02T07:43:00Z", "content": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering,… [+7165 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "Dashveenjit Kaur", "title": "IBM and NASA are collaborating to study the impact of climate change using AI - Tech Wire Asia", "description": "The joint work will apply AI foundation model technology by IBM to NASA's Earth-observing satellite data for the first time.", "url": "https://techwireasia.com/2023/02/ibm-and-nasa-are-collaborating-to-study-the-impact-of-climate-change-using-ai/", "urlToImage": "https://techwireasia.com/wp-content/uploads/2023/02/shutterstock_409229497-e1675313736477.jpg", "publishedAt": "2023-02-02T04:02:36Z", "content": "<ul><li>The joint work will apply AI foundation model technology by IBM to NASA’s Earth-observing satellite data for the first time.</li><li>The collaboration has the potential to quickly advance the… [+4503 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I tried using a smart lock for a week – here's how it went - AsiaOne", "description": "\"What's the point of all this?\" Those were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\". In the clip, almost everything in her home was powered by technology an…", "url": "https://www.asiaone.com/digital/i-tried-using-smart-door-lock-week-heres-how-it-went-aqara-zigbee-a100", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/20230102_smart_lock_aqara.jpg?h=efed96af&itok=s0FOS7mc", "publishedAt": "2023-02-02T04:00:00Z", "content": "\"What's the point of all this?\"\r\nThose were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\".\r\nIn the cl… [+6893 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "cue", "title": "More than 16400 Moderna/Spikevax doses given to children up to 4 years, 8 adverse events reported - The Straits Times", "description": "More than 81,400 doses of Pfizer-BioNTech/Comirnaty vaccine were given to children aged 5 to 11.\n Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/over-16k-doses-of-modernaspikevax-given-to-children-6-months-to-4-years-old-8-adverse-events-reported", "urlToImage": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2023/02/02/rrvaxchild0202_13.jpg?VersionId=.s.VdFC3Cdm8VnIQ1Bely4oki9lHle71", "publishedAt": "2023-02-02T03:25:59Z", "content": "SINGAPORE More than 16,400 doses of the Moderna/Spikevax vaccine have been administered to children between six months and four years old since its roll-out in October 2022 for this age group, with e… [+2661 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Revolutionary automated LiDAR classification now available through Neara's self-service offering - PR Newswire", "description": "/PRNewswire/ -- Neara, a leading climate tech software platform and provider of 3D interactive simulation models of critical infrastructure, today announced...", "url": "https://www.prnewswire.com/news-releases/revolutionary-automated-lidar-classification-now-available-through-nearas-self-service-offering-301736722.html", "urlToImage": null, "publishedAt": "2023-02-01T22:17:00Z", "content": "New solution offers LiDAR-based insights of critical infrastructure 30x faster than manual processing\r\nSEATTLE, Feb. 1, 2023 /PRNewswire/ -- Neara, a leading climate tech software platform and provid… [+3729 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Could a Nuclear Thermal Rocket Engine Power a Trip to Mars? NASA and DARPA Are Testing - SciTechDaily", "description": "NASA and the Defense Advanced Research Projects Agency (DARPA) recently announced a collaboration to demonstrate a nuclear thermal rocket engine in space, an enabling capability for NASA crewed missions to Mars. NASA and DARPA will partner on the Demonstratio…", "url": "https://scitechdaily.com/could-a-nuclear-thermal-rocket-engine-power-a-trip-to-mars-nasa-and-darpa-are-testing/", "urlToImage": "https://scitechdaily.com/images/Mars-Transit-Habitat-and-Nuclear-Propulsion-System-scaled.jpg", "publishedAt": "2023-02-01T13:46:57Z", "content": "ByNASAFebruary 1, 2023\r\nArtist concept of Demonstration for Rocket to Agile Cislunar Operations (DRACO) spacecraft, which will demonstrate a nuclear thermal rocket engine. Nuclear thermal propulsion … [+6332 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:08:55Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}, {"source": {"id": null, "name": "Techland.net"}, "author": null, "title": "Let's celebrate One Year Anniversary of Dying Light 2 Stay Human - Techland", "description": "Techland Kicks off the year with 30 million Sales of Flagship Dying Light games and celebrates One Year Anniversary of Dying Light 2 Stay Human.", "url": "https://techland.net/news/lets-celebrate-one-year-anniversary-of-dying-light-2-stay-human", "urlToImage": "https://techland.net/img/fb_img.png", "publishedAt": "2023-01-31T22:52:57Z", "content": "Celebrate the success of Dying Light with Techland. The flagship games have had an excellent start to the year, selling a whopping 30 million units, and the numbers continue to grow with each month. … [+3504 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UCF researchers uncover key mechanisms for sustainable ammonia production - EurekAlert", "description": "A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing sustainable fertilizer research and thus aiding global food safety efforts.\nAmmonia, a…", "url": "https://www.eurekalert.org/news-releases/978297", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-31T19:54:28Z", "content": "ORLANDO, Jan. 31, 2022 — A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing s… [+4796 chars]"}]}