{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mapping the Mind: Decoding Neuropsychiatric Disorders With the Human Brain Cell Atlas - SciTechDaily", "description": "Researchers map gene switches and brain cell types associated with schizophrenia, bipolar disorder, Alzheimer’s disease, and major depression. In a large, multi-institutional effort led by University of California San Diego (UCSD), researchers have analyzed m…", "url": "https://scitechdaily.com/mapping-the-mind-decoding-neuropsychiatric-disorders-with-the-human-brain-cell-atlas/", "urlToImage": "https://scitechdaily.com/images/Brain-Mapping-Concept-Art.jpg", "publishedAt": "2023-10-15T14:23:20Z", "content": "ByUniversity of California - San DiegoOctober 15, 2023\r\nResearchers from the University of California San Diego, in a major collaborative effort, have mapped gene switches in different brain cell typ… [+6461 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Davidson", "title": "What's the difference between a cheap and premium OLED TV? You might be surprised - TechRadar", "description": "The difference between low-end and high-end OLED TVs isn’t as big as you think", "url": "https://www.techradar.com/televisions/whats-the-difference-between-a-cheap-and-premium-oled-tv-you-might-be-surprised", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eEosiz8ZSJ8bnXqy4B4D4J-1200-80.jpg", "publishedAt": "2023-10-15T12:00:05Z", "content": "If you're thinking of updating your TV, the world of OLED displays has probably intrigued you. OLED technology is common among the best TVs, often delivering the best picture quality on the market th… [+8049 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Richard Waters, Arjun Neil Alim", "title": "How Brad Smith used Microsoft's $1bn law and lobbying machine to win Activision battle - Financial Times", "description": "Company’s top legal officer has honed diplomatic skills to recast the US tech giant’s reputation", "url": "https://www.ft.com/content/07c507bd-2ce7-4345-85bd-0c27f408afbe", "urlToImage": null, "publishedAt": "2023-10-14T12:00:05Z", "content": "What is included in my trial?\r\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\r\nStandard Digital includ… [+1494 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X", "title": "Scientists begin building AI for scientific discovery using tech behind ChatGPT - Tech Xplore", "description": "An international team of scientists, including from the University of Cambridge, have launched a new research collaboration that will leverage the same technology behind ChatGPT to build an AI-powered tool for scientific discovery.", "url": "https://techxplore.com/news/2023-10-scientists-ai-scientific-discovery-tech.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/particle-graphic.jpg", "publishedAt": "2023-10-13T15:13:38Z", "content": "An international team of scientists, including from the University of Cambridge, have launched a new research collaboration that will leverage the same technology behind ChatGPT to build an AI-powere… [+5474 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Caterpillars Chubby Legs May Have Evolved From Crabs - Technology Networks", "description": "The existence of extra legs in caterpillars has long posed an evolutionary mystery to biologists. A recent study by researchers from the National University of Singapore (NUS) linked this novel trait to crustaceans.", "url": "https://www.technologynetworks.com/genomics/news/caterpillars-chubby-legs-may-have-evolved-from-crabs-379876", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/379876/caterpillars-chubby-legs-may-have-evolved-from-crabs-379876-640x360.jpg?cb=20231013", "publishedAt": "2023-10-13T15:10:13Z", "content": "Adult insects, including butterflies and moths, typically have only three pairs of legs. But the existence of extra legs in caterpillars chubby abdominal appendeages also known as prolegs has long po… [+2953 chars]"}]}