{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "CNET"}, "author": null, "title": "I Wore the Future With a Brain-Connected AR-VR Headset - CNET", "description": "The next frontier might be neurotech: OpenBCI's Galea headset, along with advances in assistive controls, points to a wild, wearable road ahead.", "url": "https://www.cnet.com/tech/computing/i-wore-the-future-of-brain-connected-arvr/", "urlToImage": "https://www.cnet.com/a/img/resize/74cb09b255fb74fa59ac09179a28e1280c13a6b3/hub/2023/06/30/e4df7d90-831e-466d-bc47-c4bf040eb145/openbci-galea-1.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2023-07-06T12:00:00Z", "content": "A few weeks ago, I saw the best-quality mixed-reality headset with an interface controlled using my fingers and eyes: Apple's Vision Pro. But a few months before its announcement, I saw something per… [+10209 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Study Shakes Up Established Views on Mountain Formation - SciTechDaily", "description": "New research led by Colorado State University indicates the answers to how and why mountains form are buried deeper than once thought. \"Mountain building is a fundamental process of how Earth behaves,” said Sean Gallen, lead author and CSU assistant professor…", "url": "https://scitechdaily.com/groundbreaking-study-shakes-up-established-views-on-mountain-formation/", "urlToImage": "https://scitechdaily.com/images/Green-Mysterious-Mountain.jpg", "publishedAt": "2023-07-06T08:44:02Z", "content": "A new study suggests that the formation of mountains, particularly in subduction zones like southern Italy, might be significantly influenced by the descension of a tectonic plate through Earths mant… [+4697 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Scientists Discover Strong Link Between Childhood Maltreatment and Adult Emotional Difficulties - SciTechDaily", "description": "Have you ever grappled with articulating your emotions, unable to locate the perfect words to express how you feel? This is a predicament shared by millions who wrestle with a personality trait referred to as alexithymia - literally translated as \"having no l…", "url": "https://scitechdaily.com/stanford-scientists-discover-strong-link-between-childhood-maltreatment-and-adult-emotional-difficulties/", "urlToImage": "https://scitechdaily.com/images/Sad-Girl-Crying.jpg", "publishedAt": "2023-07-06T07:23:52Z", "content": "A new meta-analysis conducted by Stanford University researchers indicates a strong link between child maltreatment, particularly emotional and physical neglect, and alexithymia in adulthood. Alexith… [+6502 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "TechRadar special report - TechRadar", "description": "Major survey reveals surprising changes in consumer tech buying habits", "url": "https://www.techradar.com/tech/techradar-special-report-tech-fans-are-choosing-gadgets-over-netflix-and-socializing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HDkqTHXaeuFr3gsZsQf4Q7-1200-80.jpg", "publishedAt": "2023-07-06T05:30:00Z", "content": "Most technology fans think buying gadgets is more important than subscribing to streaming services like Netflix and socializing, a major new TechRadar survey has revealed.\r\nThe in-depth survey, condu… [+17731 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid warning! Aircraft-sized space rock approaching Earth at fearsome speed TODAY - HT Tech", "description": "Asteroids have been threatening Earth with extremely close approaches recently, and now another one is set to pass the planet today. Know its speed, distance, size, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-warning-aircraft-sized-space-rock-approaching-earth-at-fearsome-speed-today-71688618848435.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/ygy_1637905928669_1688618998360.jpg", "publishedAt": "2023-07-06T04:50:30Z", "content": "Asteroids have the potential to cause armageddon on Earth, especially if they crash in a densely populated area. To counter this very threat to life, space agencies keep developing technology for ast… [+2314 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "OPPO Reno10 Pro+ Review: The Perfect Blend of Art and Technology - Pandaily", "description": "OPPO’s Reno series has always been focusing on stylish designs and good camera systems for daily photos and portraits, and the Reno10 Pro+ is no different. I...", "url": "https://www.youtube.com/watch?v=7IrPtr5cDaU", "urlToImage": "https://i.ytimg.com/vi/7IrPtr5cDaU/maxresdefault.jpg", "publishedAt": "2023-07-06T03:30:01Z", "content": null}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Fluxonium Qubit Retains Information For 1.43 Milliseconds – 10x Longer Than Before - ScienceAlert", "description": "Superconducting quantum technology has long promised to bridge the divide between existing electronic devices and the delicate quantum landscape beyond.", "url": "https://www.sciencealert.com/fluxonium-qubit-retains-information-for-1-43-milliseconds-10x-longer-than-before", "urlToImage": "https://www.sciencealert.com/images/2023/07/QuantumChip.jpg", "publishedAt": "2023-07-06T00:45:07Z", "content": "Superconducting quantum technology has long promised to bridge the divide between existing electronic devices and the delicate quantum landscape beyond. Unfortunately progress in making critical proc… [+3060 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers discover unique blood plasma protein patterns in patients with long COVID - Medical Xpress", "description": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID that could improve patient outcomes. This research, which used…", "url": "https://medicalxpress.com/news/2023-07-unique-blood-plasma-protein-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fatigue-1.jpg", "publishedAt": "2023-07-05T14:07:50Z", "content": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID th… [+4047 chars]"}]}