{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Stock Market LIVE Updates: Indices trade lower; Eicher Motors top gainer, IT drags - Moneycontrol", "description": "Sensex Today | Stock Market LIVE Updates: Eicher Motors, Tata Steel, Bajaj Auto, Hero MotoCorp and Nestle India were among the top gainers on the Nifty, while losers were IndusInd Bank, Tech Mahindra, Asian Paints, Kotak Mahindra Bank and Infosys. Buying seen…", "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-26-09-2023-11427471.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/09/market_volatile-16-770x433.jpg", "publishedAt": "2023-09-26T08:01:15Z", "content": "RVNL emerges as the Lowest Bidder (L1) for construction of 4 Nos. Tunnels (total Length 1.6km) with ballast less track, Earthwork in formation, Construction of Important Bridges (2nos), Major Bridges… [+230 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple iPhone 15 got off to a hot start, but there was a bug, says Mark Gurman - HT Tech", "description": "iPhone 15 users are running into a new bug during the initial setup process that is rendering their devices inoperable, but Apple has already rolled out a fix for it, according to Bloomberg’s Mark Gurman.", "url": "https://tech.hindustantimes.com/mobile/news/apple-iphone-15-got-off-to-a-hot-start-but-there-was-a-bug-says-mark-gurman-71695608674744.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/25/1600x900/TOPSHOT-US-TECH-APPLE-IPHONE-0_1695608778694_1695608808752.jpg", "publishedAt": "2023-09-25T02:27:49Z", "content": "Apple debuted the iPhone 15 series at its Wonderlust event on September 12 and opened the pre-orders for the devices on September 15. The Cupertino-based tech giant kicked off the deliveries of its n… [+1934 chars]"}]}