{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "With macOS Sonoma, Intel Macs are still getting fewer updates than they used to - Ars Technica", "description": "Nearly 20 years of data show how Intel Macs are faring as Apple switches chips.", "url": "https://arstechnica.com/gadgets/2023/07/with-macos-sonoma-intel-macs-are-still-getting-fewer-updates-than-they-used-to/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/macos-finder-faces-sonoma-760x380.jpg", "publishedAt": "2023-07-17T11:00:19Z", "content": "30 with \r\nA year ago, we compiled a model list of Macs spanning over two decades, complete with their launch dates, discontinuation dates, and all the available information about the macOS updates ea… [+4737 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Mrigakshi Dixit", "title": "Scientists simulate environment of enigmatic black holes in a hi-tech lab - Interesting Engineering", "description": "The black hole conditions are being stimulated with the help of a tiny vortex produced inside a bell jar of superfluid helium.", "url": "https://interestingengineering.com/science/scientists-simulate-environment-of-enigmatic-black-holes-in-a-hi-tech-lab", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/07/17/image/jpeg/4VXmjPS2cTCrbnxA8FJAYAobrsCaCfcdkMaNDBIk.jpg", "publishedAt": "2023-07-17T10:22:00Z", "content": "The ripples formed on the helium's surface resemble radiation approaching a black hole. Scientists closely study this rippling effect using a high-resolution camera with nanometre precision. \r\nWeinfu… [+1138 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Chrome now lets iPhone users add web apps to Home Screen - HT Tech", "description": "Google Chrome will let you add web apps just like Safari does on iPhones! Here is how to use it.", "url": "https://tech.hindustantimes.com/how-to/google-chrome-now-lets-iphone-users-add-web-apps-to-home-screen-71689577128702.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/17/1600x900/screen-post-svsKYetYPUI-unsplash_1688820000991_1689577302286.jpg", "publishedAt": "2023-07-17T07:08:43Z", "content": "Apple is focusing on web apps since the rollout of iOS 16. A few months back, with iOS 16.4 update, Apple seeded some notable features such as third-party apps on Home Screen, web push notifications,… [+1861 chars]"}, {"source": {"id": null, "name": "Techlusive.in"}, "author": "Techlusive India", "title": "How to Set Up Standby Mode on Your iPhone - Techlusive", "description": "With Standby Mode iOS 17 empowers users to maximize their device's battery life and enhance overall performance. By intelligently managing background activities this feature ensures that your iPhone or iPad remains responsive when you need it while conserving…", "url": "https://www.techlusive.in/how-to/how-to-set-up-standby-mode-on-your-iphone-1390873/", "urlToImage": "https://st1.techlusive.in/wp-content/uploads/2023/07/How-to-use-Standby-on-iPhone-with-iOS-17.jpeg", "publishedAt": "2023-07-17T06:23:21Z", "content": "Standby Mode is a new feature in iOS 17 that turns your iPhone into a digital nightstand display when placed on a charging stand in landscape mode.\r\nApple announced iOS 17 with a host of new and inte… [+2648 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "On the Trail of a Mysterious Force in Space – Scientists Shed New Light on Dark Energy - SciTechDaily", "description": "An initial study of dark energy using eROSITA suggests that it is evenly dispersed across both space and time. Edwin Hubble's observation of distant galaxies in the 1920s led to the groundbreaking conclusion that our universe is in a state of expansion. It wa…", "url": "https://scitechdaily.com/on-the-trail-of-a-mysterious-force-in-space-scientists-shed-new-light-on-dark-energy/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Dark-Energy-Concept-Illustration.jpg", "publishedAt": "2023-07-17T06:21:45Z", "content": "Using advanced space telescopes and data sets, researchers concluded that dark energy, representing about 76% of the universes energy density, is evenly spread throughout space and remains constant o… [+4510 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Intelligence Unlocks New Possibilities in Anti-Aging Medicine - SciTechDaily", "description": "New platform holds the promise to drive progress in the development of senolytic anti-aging compounds and research on longevity. A recent paper published in Nature Aging by researchers from Integrated Biosciences, a biotechnology company combining synthetic b…", "url": "https://scitechdaily.com/?p=292628", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-Drug-Medicine-Discovery.jpg", "publishedAt": "2023-07-17T03:49:08Z", "content": "ByIntegrated BiosciencesJuly 16, 2023\r\nResearchers have utilized AI to discover new senolytic compounds that can suppress age-related processes, such as cancer and inflammation. By training deep neur… [+7794 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA warns of close approach by asteroid! 190-ft space rock racing towards Earth - HT Tech", "description": "An aircraft-sized asteroid is on its way towards Earth and could come as close as 1.2 million kilometers. Know details, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/nasa-warns-of-close-approach-by-asteroid-190-ft-space-rock-racing-towards-earth-71689561537925.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/17/1600x900/asteroid-4369511_1280_1689561850237_1689561860706.jpg", "publishedAt": "2023-07-17T02:44:59Z", "content": "An asteroid, given the designation of Asteroid 2020 UQ3, is on its way towards Earth and could make its closest approach to the planet as soon as tomorrow, July 18. NASA revealed these shocking detai… [+2095 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Detects Universe's Oldest Active Supermassive Black Hole - SciTechDaily", "description": "The James Webb Space Telescope has uncovered the most remote active supermassive black hole known to date, situated in the galaxy CEERS 1019, which existed about 570 million years after the Big Bang. Researchers, using the James Webb Space Telescope (JWST), h…", "url": "https://scitechdaily.com/webb-space-telescope-detects-universes-oldest-active-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Distant-Black-Hole-Concept-Art.jpg", "publishedAt": "2023-07-17T02:20:42Z", "content": "ByUniversity of Texas at AustinJuly 16, 2023\r\nThe James Webb Space Telescope has discovered the furthest active supermassive black hole yet, situated in the CEERS 1019 galaxy, which is less massive t… [+12574 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Potential organic molecules, clues to previous life on Mars - study - The Jerusalem Post", "description": "The research employed an innovative technique utilizing the SHERLOC instrument to detect signs of past life, paving the way for future extraterrestrial exploration.", "url": "https://www.jpost.com/science/article-750314", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/513284", "publishedAt": "2023-07-17T00:38:00Z", "content": "A recent study utilizing data collected by NASA's Mars Perseverance rover has revealed promising indications of organic molecules on Mars, suggesting a complex organic geochemical cycle and raising t… [+3697 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Celebrates First Year, NASA Humanoid Robot, Low Altitude Flights - SciTechDaily", "description": "Celebrating the Webb Space Telescope’s first year of science … Testing remote possibilities of a NASA humanoid robot … And a fleet of clean new rides for Artemis astronauts … A few of the stories to tell you about – This Week at NASA! https://youtu.be/isLhOu_…", "url": "https://scitechdaily.com/this-week-nasa-webb-celebrates-first-year-nasa-humanoid-robot-low-altitude-flights/", "urlToImage": "https://scitechdaily.com/images/Webb-Interstellar-Clouds-Art-Concept.jpg", "publishedAt": "2023-07-16T03:27:58Z", "content": "ByNASAJuly 15, 2023\r\nNASAs James Webb Space Telescope marks its first year of operations, delivering a detailed image of the nearest star-forming region to Earth, the Rho Ophiuchi cloud complex. This… [+4114 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Alert! NASA telescopes find colossal 910-foot asteroid heading towards Earth today - HT Tech", "description": "NASA has warned about a gigantic asteroid heading towards Earth today! Is it potentially hazardous for Earth? Know what NASA revealed.", "url": "https://tech.hindustantimes.com/tech/news/alert-nasa-telescopes-find-colossal-910-foot-asteroid-heading-towards-earth-today-71689477165187.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/16/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1683132681194_1689477299600.jpg", "publishedAt": "2023-07-16T03:15:25Z", "content": "A majority of asteroids can be found in the region of space situated between the orbits of Jupiter and Mars. These celestial bodies follow elliptical paths around the Sun, exhibiting irregular moveme… [+2085 chars]"}]}