{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hidden Wonders: Webb Space Telescope Detects Unexplained Structures in Heart of Milky Way - SciTechDaily", "description": "The play of darkness and light in our galaxy’s crowded core is put on display like never before. A bright field of gas sweeps around the edge of a dark, dense cloud where young stars are bursting out to take their place in the universe. They join an estimated…", "url": "https://scitechdaily.com/hidden-wonders-webb-space-telescope-detects-unexplained-structures-in-heart-of-milky-way/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Sagittarius-C-Art-Concept.jpg", "publishedAt": "2023-11-22T09:27:00Z", "content": "BySpace Telescope Science InstituteNovember 22, 2023\r\nNASAs James Webb Space Telescope has captured a detailed image of the Sagittarius C region near the Milky Ways core, revealing a dense star-formi… [+10273 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "In a first, NASA’s Psyche spacecraft blasts laser beam 10 mn miles in deep space - The Financial Express", "description": "According to the space agency, the technology demonstration achieved \"first light\" in the early hours of November 14 following its flight laser transceiver, which is a cutting-edge device aboard Psyche.", "url": "https://www.financialexpress.com/life/science-in-a-first-nasas-psyche-spacecraft-blasts-laser-beam-10-mn-miles-in-deep-space-bkg-3314006/", "urlToImage": "https://www.financialexpress.com/wp-content/uploads/2023/11/missionswebPIA21499-20170523-16c_yBpP14o.width-1440-1.jpg", "publishedAt": "2023-11-22T07:10:06Z", "content": "NASA has once again achieved yet another milestone in space communication, as it successfully transmitted information over a distance of 10 million miles through laser light for the very first time. … [+1691 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Nikita Prasad", "title": "Tata Technologies IPO opens today! Here's why Tata's first issue in 20 years has gripped the pulse on D-Street | Mint - Mint", "description": "Tata Technologies IPO: Ending the agony of the long wait among investors and analysts today, Tata Technologies IPO has set the primary market buzzing, in what market observers feel has become the most talked about IPO of this decade.", "url": "https://www.livemint.com/market/ipo/tata-technologies-ipo-opens-today-heres-why-tatas-first-issue-in-20-years-has-gripped-the-pulse-on-dstreet-11700602389154.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/21/1600x900/tata_1700602704405_1700602810265.jpg", "publishedAt": "2023-11-22T03:35:21Z", "content": "Tata Technologies IPO: The Tata Group's much-awaited initial public offering (IPO) is all set to open for subscription today (November 22, 2023). Tata Technologies IPO has gripped the pulse on D-Stre… [+7836 chars]"}]}