{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "Has science gone too far? Windows 11 spotted running on Lumia 950XL smartphone - TechRadar", "description": "Someone has already put it on an old phone", "url": "https://www.techradar.com/news/has-science-gone-too-far-windows-11-spotted-running-on-lumia-950xl-smartphone", "urlToImage": "https://cdn.mos.cms.futurecdn.net/abDvonnZJdauUiGNQYDJDG-1200-80.jpg", "publishedAt": "2021-06-18T09:54:24Z", "content": "You may have noticed that what appears to be Windows 11, the follow up to Windows 10, has leaked online, and some enterprising soul has already put it on the old Lumia 950XL.\r\nThe Microsoft Lumia 950… [+2034 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Experience a smooth performance with the 8GB+3GB extended RAM in the all-new vivo V21 series - BusinessWorld Online", "description": "Extra powerful processors and Extended RAM Technology enable users to enjoy the glossy-smooth functionality of the vivo V21 Series Enjoy the smooth performance of the vivo V21 Series, made possible with 8GB + 3GB Extended RAM Technology The vivo V21 5G and V2…", "url": "https://www.bworldonline.com/experience-a-smooth-performance-with-the-8gb3gb-extended-ram-in-the-all-new-vivo-v21-series/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/06/vivo-V21_Tech-Sustaining-PR-PHOTO-1024x1024.png", "publishedAt": "2021-06-18T07:00:50Z", "content": "<ul><li>Enjoy the smooth performance of the vivo V21 Series, made possible with 8GB + 3GB Extended RAM Technology</li><li>The vivo V21 5G and V21e runs on seriously powerful mobile processors</li><li… [+3635 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "China orders billionaire to lie low after poem post sparks fury - The Star Online", "description": "China’s government summoned Meituan’s Wang Xing to a meeting recently and warned him to keep a low profile, after the founder of China’s third-largest tech corporation last month posted a controversial poem that convulsed markets and sparked a social media fu…", "url": "https://www.thestar.com.my/tech/tech-news/2021/06/18/china-orders-billionaire-to-lie-low-after-poem-post-sparks-fury", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/06/18/1188991.jpg", "publishedAt": "2021-06-18T06:30:00Z", "content": "Chinas government summoned Meituans Wang Xing to a meeting recently and warned him to keep a low profile, after the founder of Chinas third-largest tech corporation last month posted a controversial … [+3383 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Daphne Galvez", "title": "Infectious disease expert backs use of face shield vs COVID-19 - INQUIRER.net", "description": "MANILA, Philippines — An infectious disease expert, who is also a government technical adviser, still recommends the use of face shields even in", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2020/12/face-shield-22dec2020-620x413.jpeg", "publishedAt": "2021-06-18T05:29:00Z", "content": "MANILA, Philippines An infectious disease expert, who is also a government technical adviser, still recommends the use of face shields even in outdoor settings due to the threat of COVID-19’a more in… [+3635 chars]"}, {"source": {"id": null, "name": "Voxy.co.nz"}, "author": null, "title": "Pioneering technology to help NASA land the next person on the moon - University of Western Australia - Voxy", "description": "A project led by The University of Western Australia in partnership with Fugro Australia and supported by the Australian Space Agency will expand optical communication technology to support international space exploration missions such as NASA’s", "url": "http://www.voxy.co.nz/technology/5/388933", "urlToImage": null, "publishedAt": "2021-06-18T02:23:46Z", "content": "A project led by The University of Western Australia in partnership with Fugro Australia and supported by the Australian Space Agency will expand optical communication technology to support internati… [+2607 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Nick Pino", "title": "Xbox Design Lab has reopened for custom Xbox Series X controllers - Techradar", "description": "Microsoft reopens the customization software for next-gen hardware", "url": "https://www.techradar.com/news/xbox-design-lab-has-reopened-for-custom-xbox-series-x-controllers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ShNS3L2VkjoKx2XmFh8Qe4-1200-80.jpg", "publishedAt": "2021-06-17T18:26:03Z", "content": "Microsoft has announced that Xbox Design Lab, its controller customization software that allows gamers to design their own controllers, can now be used to create Xbox Series X and Xbox Series S contr… [+1605 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Fran Sanders", "title": "Rocket Lab to Design NASA’s Mars Spacecraft: ESCAPADE Duo Using Photon Spacecraft Bus - Tech Times", "description": "Rocket Lab will get to design NASA’s ESCAPADE duo – Mars Spacecraft for future missions. Rocket Lab finally got Mars in its crosshairs.", "url": "https://www.techtimes.com/articles/261530/20210616/rocket-lab-design-nasa-s-mars-spacecraft-escapade-duo-using.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/387275/rocket-lab-builds-nasas-mars-spacecrafts.png", "publishedAt": "2021-06-16T13:02:13Z", "content": "(Photo : NASA) \r\nThe California-based Rocket Lab has finally got Mars in its crosshairs as the company will send a NASA CubeSat mission straight to the Earth's moon in fall. It also plans to launch i… [+3078 chars]"}]}