{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Saurav Das", "title": "Pokémon Go: Tips to use Rocket Radar and Rocket Balloons in the game - GamingonPhone", "description": "Pokémon Go is a popular mobile game from Niantic which combines gaming with the real world with the help of augmented reality technology. The game makes it possible for the players to catch and train", "url": "https://gamingonphone.com/guides/pokemon-go-tips-to-use-rocket-radar-and-rocket-balloons-in-the-game/", "urlToImage": "https://i0.wp.com/gamingonphone.com/wp-content/uploads/2022/09/Pokemon-Go-Rocket-Radar-Rocket-Balloons.jpg", "publishedAt": "2022-09-12T17:22:10Z", "content": "Pokémon Go is a popular mobile game fromNiantic which combines gaming with the real world with the help of augmented reality technology. The game makes it possible for the players to catch and train … [+3772 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Tuesday: Top 15 things to know before the opening bell - Moneycontrol", "description": "Based on the open interest future percentage, there were 82 stocks, including PVR, L&amp;T Technology Services, Ambuja Cements, GNFC, and Divis Laboratories. in which a short-covering was seen", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-tuesday-top-15-things-to-know-before-the-opening-bell-6-9168021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_556282549-2-770x433.jpg", "publishedAt": "2022-09-12T16:54:31Z", "content": "The market extended its northward journey for the third consecutive session as the benchmark indices gained more than half a percent on September 12, tracking positive global cues. All sectoral indic… [+9605 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Skull Bones Restricted the Evolution of Earth’s Earliest Land Animals - SciTechDaily", "description": "According to new research, the skulls of tetrapods had fewer bones than extinct and living fish, restricting their evolution for millions of years. By analyzing fossil skulls of animals across the transition from an aquatic to terrestrial environment, scienti…", "url": "https://scitechdaily.com/skull-bones-restricted-the-evolution-of-earths-earliest-land-animals/", "urlToImage": "https://scitechdaily.com/images/Early-Tetrapod-scaled.jpg", "publishedAt": "2022-09-12T15:33:56Z", "content": "ByUniversity of BristolSeptember 12, 2022\r\nEarly tetrapod. The skulls of tetrapods had fewer bones than extinct and living fish, limiting their evolution for millions of years, according to the lates… [+4020 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Executive Order on Advancing Biotechnology and Biomanufacturing Innovation for a Sustainable, Safe, and Secure American Bioeconomy - The White House", "description": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows: Section 1.", "url": "https://www.whitehouse.gov/briefing-room/presidential-actions/2022/09/12/executive-order-on-advancing-biotechnology-and-biomanufacturing-innovation-for-a-sustainable-safe-and-secure-american-bioeconomy/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2022-09-12T14:06:16Z", "content": "By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows:\r\nSection 1.  Policy.  It is the policy of my Administrati… [+42988 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Spotlight Special", "title": "Apple iPhone monthly subscription plans soon? All you need to know - Economic Times", "description": "This year, you might get the monthly subscription for the Apple iPhone that the tech giant is thinking of bringing for both the services and hardware, just like the Apple One, according to reports.", "url": "https://economictimes.indiatimes.com/magazines/panache/trending-tech/apple-iphone-monthly-subscription-plans-soon-all-you-need-to-know/articleshow/94157479.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94157468,width-1070,height-580,imgsize-16456,overlay-etpanache/photo.jpg", "publishedAt": "2022-09-12T14:00:00Z", "content": "So, you have bought an Apple iPhone? Now, be all charged up to obtain the monthly subscription for its services and hardware. Yes! Apple, the tech giant, is planning to bring the subscription just li… [+1716 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Murk Rizwan", "title": "Get Advanced Desktop Wireless Charger With Alarm Clock For Just $51.99 - Wccftech", "description": "Get Advanced Desktop Wireless Charger With Digital Clock For Just $51.99. Power up your phone wirelessly and wake up on Alarm Clock", "url": "https://wccftech.com/get-desktop-wireless-charger-with-alarm-clock-for-just-51-99/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2022/09/wireless-charger.jpg", "publishedAt": "2022-09-12T13:41:53Z", "content": "If you are looking for a good deal to buy a digital alarm and wireless charger, then your search has ended today because Mbeat is offering you the best product with a big discount. You can buy the De… [+1319 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Phenomenon on Sun Imaged by Solar Orbiter for First Time – Mystery Solved - SciTechDaily", "description": "With fresh data from its closest pass of the Sun thus far, the ESA/NASA Solar Orbiter spacecraft has found compelling clues as to the origin of solar magnetic switchbacks. The discovery points toward how their physical formation mechanism might help accelerat…", "url": "https://scitechdaily.com/strange-phenomenon-on-sun-imaged-by-solar-orbiter-for-first-time-mystery-solved/", "urlToImage": "https://scitechdaily.com/images/Capturing-a-Solar-Switchback.jpg", "publishedAt": "2022-09-12T12:56:35Z", "content": "ByEuropean Space Agency (ESA)September 12, 2022\r\nA magnetic phenomenon known as solar switchbacks has been imaged by the ESA/NASA Solar Orbiter spacecraft for the first time. The image zooms in on th… [+13627 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Harish Upadhya", "title": "Why Bengaluru Demolition Drive is Going Silent Near Tech Parks Owned by the Mighty - News18", "description": "A BBMP demolition squad reached Bagmane tech park in the morning and even identified and marked 2.4 meters storm water drain encroachment by the IT park. Officials along with police reached the spot but mysteriously they left the tech park few hours later wit…", "url": "https://www.news18.com/news/india/why-bengaluru-demolition-drive-is-going-silent-near-tech-parks-owned-by-the-mighty-5942287.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/bengaluru-demolition-drive-166298135016x9.jpg", "publishedAt": "2022-09-12T11:32:00Z", "content": "In the aftermath of massive waterlogging in Bengaluru, the citys municipal body Bruhat Bengaluru Mahanagara Palike (BBMP) has started a demolition drive. The BBMP teams reached two locations in Mahad… [+2417 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Priyanka Iyer", "title": "Sachin Bansal-led Navi Technologies gets SEBI nod for Rs 3,350 crore IPO - Moneycontrol", "description": "The fintech company plans to invest the proceeds of the IPO in Navi Finserv and Navi General Insurance companies in addition to general expansion goals.", "url": "https://www.moneycontrol.com/news/business/ipo/sachin-bansal-led-navi-technologies-gets-sebi-nod-for-3350-crore-ipo-9166441.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Sachin-Bansal-1-770x433.jpg", "publishedAt": "2022-09-12T11:27:13Z", "content": "The Securities and Exchange Board of India (SEBI) has approved Sachin Bansal's fintech startup Navi Technologies for an Initial Public Offering (IPO), providing the Flipkart co-founder a boost as he … [+2854 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WhatsApp New Feature Alert !! No More Scrolling For Your Older Messages - BGR India", "description": "#BGRIndia #TechNews Do you often Miss Out on Messages which are days old and you struggle in the chat box to go up and look for the messages send by the send...", "url": "https://www.youtube.com/watch?v=T0ycQqYUUiE", "urlToImage": "https://i.ytimg.com/vi/T0ycQqYUUiE/maxresdefault.jpg", "publishedAt": "2022-09-12T11:13:15Z", "content": null}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Why load shedding is back this week – and things aren’t looking good - BusinessTech", "description": "Eskom says that it lost 42 generating units over the last week – and while it has managed to bring 37 back, it underlines how volatile and vulnerable the grid is, with uncertainty over maintenance persisting.", "url": "https://businesstech.co.za/news/energy/624775/why-load-shedding-is-back-this-week-and-things-arent-looking-good/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Eskom-fire.png", "publishedAt": "2022-09-12T09:22:30Z", "content": "Eskom says that it lost 42 generating units over the last week – and while it has managed to bring 37 back, it underlines how volatile and vulnerable the grid is, with uncertainty over maintenance pe… [+3550 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "How Protein Differences Across Species Drive Biological Diversity - Technology Networks", "description": "Yale researchers have compared the proteomes of skin cells from 11 mammals, which, they say, will help scientists understand the molecular drivers of biodiversity and how these factors have evolved over time.", "url": "https://www.technologynetworks.com/proteomics/news/how-protein-differences-across-species-drive-biological-diversity-365540", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/365540/how-protein-differences-across-species-drive-biological-diversity-365540-640x360.jpg?cb=20220911", "publishedAt": "2022-09-11T16:58:28Z", "content": "To better understand what drives biological diversity on Earth, scientists have historically looked at genetic differences between species. But this only provides part of the picture. The traits of a… [+6382 chars]"}]}