{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "Rivian’s new ‘treehouse’ rooftop tent comes with a movie projector - TechCrunch", "description": "Rivian has designed a number of accessories for its upcoming R2 and R3 EVs, including a rooftop tent with a movie projector.", "url": "https://techcrunch.com/2024/03/08/rivians-new-treehouse-rooftop-tent-comes-with-a-movie-projector/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/03/rivian-r3x-hatchback.jpg?resize=1200,900", "publishedAt": "2024-03-08T20:03:30Z", "content": "Rivian has a little cinematic surprise tucked in its new “treehouse” rooftop tent, one of the many accessories the automaker plans to sell alongside its next-generation R2 SUV and future R3 EVs.\r\nThe… [+2422 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Kris Holt", "title": "Fortnite's new season is delayed due to tech issues - Engadget", "description": "Epic Games has delayed the start of the new Fortnite season due to a technical issue. The latest season focuses on Greek gods.", "url": "https://www.engadget.com/fortnites-new-season-is-delayed-due-to-tech-issues-161538098.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2024-03/d2d92110-dd63-11ee-b57f-2141e7463943", "publishedAt": "2024-03-08T16:15:38Z", "content": "As is always the case between seasons, Epic Games took Fortnite offline early on Friday to perform some maintenance and get the game ready for all the new stuff fans are about to enjoy. While the dow… [+1905 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "AI Might Not be The Only Reason Why iOS 18 Will Be The Biggest Update For iPhone, As Apple Works On New Accessibility Features - Wccftech", "description": "Apple is planning to make iOS 18 a much bigger update than expected with AI features and new Accessibility features for the iPhone.", "url": "https://wccftech.com/accessibility-features-in-iso-18-for-iphone/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/03/iOS-18-Title-Image.jpg", "publishedAt": "2024-03-08T11:30:00Z", "content": "iOS 18 will potentially be the biggest update the iPhone has ever received due to Apple's decision to incorporate AI on a kernel level. We have previously covered that Apple is developing various app… [+2502 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says bus-sized asteroid will pass Earth by a close margin today; Know how fast it is travelling - HT Tech", "description": "An Apollo-group asteroid has been tracked in its orbit and it is expected to pass Earth by a close margin today, March 8, NASA has revealed. Know how big is the asteroid and how close it will get.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-bus-sized-asteroid-will-pass-earth-by-a-close-margin-today-know-how-fast-it-is-travelling-71709867378159.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/08/1600x900/ygy_1637905928669_1709867451663.jpg", "publishedAt": "2024-03-08T04:29:54Z", "content": "With the help of its advanced ground and space-based telescopes, NASA has revealed that as many as four asteroids are expected to pass Earth by a close margin today, March 8. Most of these asteroids … [+2054 chars]"}]}