{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "In Down Syndrome Cells, Genome-Wide Disruptions Mimic a Senescence-Like State – Points to Potential Treatment - SciTechDaily", "description": "Extra chromosome alters chromosomal conformation and DNA accessibility in neural progenitor cells; study establishes senescence as a potentially targetable mechanism for future treatment. In Down syndrome, the third copy of chromosome 21 causes a reorganizati…", "url": "https://scitechdaily.com/in-down-syndrome-cells-genome-wide-disruptions-mimic-a-senescence-like-state-points-to-potential-treatment/", "urlToImage": "https://scitechdaily.com/images/Neural-Progenitor-Cells.jpg", "publishedAt": "2022-01-16T11:32:24Z", "content": "ByDavid Orenstein, Picower InstituteJanuary 16, 2022\r\nNeural progenitor cells with the typical number of chromosomes show significant outward migration in culture (top). The cells in the bottom left … [+7706 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "iPad Air 2022 and iPhone SE 2022 could launch in 1H 2022 - TechNave", "description": "Sometime this year,&nbsp;Apple&nbsp;is expected to launch a&nbsp;new iPhone SE and iPad Air&nbsp;model. While the launch date hasn't been confirmed, both device", "url": "https://technave.com/gadget/iPad-Air-2022-and-iPhone-SE-2022-could-launch-in-1H-2022-28085.html", "urlToImage": "https://technave.com/data/files/article/202201161045191139.jpg", "publishedAt": "2022-01-16T10:47:53Z", "content": "Sometime this year, Apple is expected to launch a new iPhone SE and iPad Air model. While the launch date hasn't been confirmed, both devices could launch within the first half of the year.\r\nAccordin… [+888 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Citizen Scientists Discover Giant Jupiter-Like Planet in NASA TESS Data - SciTechDaily", "description": "Tom Jacobs of Bellevue, Washington, loves treasure hunts. Since 2010, the former U.S. naval officer has participated in online volunteer projects that allow anyone who is interested — “citizen scientists” — to look through NASA telescope data for signs of exo…", "url": "https://scitechdaily.com/citizen-scientists-discover-giant-jupiter-like-planet-in-nasa-tess-data/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-TOI-2180-b-scaled.jpg", "publishedAt": "2022-01-16T10:22:05Z", "content": "ByNASAJanuary 16, 2022\r\nThis illustration depicts a Jupiter-like exoplanet called TOI-2180 b. It was discovered in data from NASA’s Transiting Exoplanet Survey Satellite. Credit: NASA/JPL-Caltech/R. … [+14100 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Android tips and tricks: Secret codes to know on your phone - HT Tech", "description": "Your Android phone has many secret codes that allows you to take some critical steps that can prove to be very helpful.", "url": "https://tech.hindustantimes.com/tech/news/android-tips-and-tricks-secret-codes-to-know-on-your-phone-71642316776952.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/16/1600x900/android-ga8e1c78df_1920_1642319497724_1642319529027.jpg", "publishedAt": "2022-01-16T07:15:38Z", "content": "Your Android smartphone is full of surprises! Yes, your phone has a a number of tips and tricks that will you make you exclaim, Why did I not find these earlier! Well, to cut to the chase, we have li… [+2291 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Ostrich Eggshell Beads Reveal 50,000-Year-Old Social Network Across Africa - SciTechDaily", "description": "New archeological study shows ancient connection between populations 3,000 km apart, and provides first direct link between climate change and ancient human social behavior. Humans are social creatures, but little is known about when, how, and why different p…", "url": "https://scitechdaily.com/ancient-ostrich-eggshell-beads-reveal-50000-year-old-social-network-across-africa/", "urlToImage": "https://scitechdaily.com/images/Ostrich-Eggshell-Beads.jpg", "publishedAt": "2022-01-16T05:26:57Z", "content": "ByMax Planck Institute for the Science of Human HistoryJanuary 15, 2022\r\nA string of modern ostrich eggshell beads from eastern Africa. Credit: Hans Sell\r\nNew archeological study shows ancient connec… [+5229 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Fight to head South Africa’s ruling party intensifies - BusinessTech", "description": "South Africa’s justice minister fired the latest salvo in a war of words between those who want president Cyril Ramaphosa to remain the ruling party’s head and those who want him ousted in December at a conference where its members will vote on senior leaders…", "url": "https://businesstech.co.za/news/business-opinion/551030/fight-to-head-south-africas-ruling-party-intensifies/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Lindiwe-Sisulu.png", "publishedAt": "2022-01-16T05:19:37Z", "content": "South Africas justice minister fired the latest salvo in a war of words between those who want president Cyril Ramaphosa to remain the ruling partys head and those who want him ousted in December at … [+1923 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: Indonesia's sweeping restructuring of science sector faces criticism; Anemia in astronauts could be a challenge for space missions - Devdiscourse", "description": "The policy will see half a dozen science, technology and research institutes integrated into a National Research and Innovation Agency (BRIN), a move the government hopes will improve access to resources and funding, and boost competitiveness.  Anemia in astr…", "url": "https://www.devdiscourse.com/article/technology/1884931-science-news-roundup-indonesias-sweeping-restructuring-of-science-sector-faces-criticism-anemia-in-astronauts-could-be-a-c", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_06_2021_09_58_02_3896563.jpg?width=920&format=jpeg", "publishedAt": "2022-01-16T04:57:26Z", "content": "Following is a summary of current science news briefs.\r\nIndonesia's sweeping restructuring of science sector faces criticism\r\nIndonesia's government is facing criticism from some top scientists and l… [+875 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth’s Interior Is Cooling “Much Faster Than Expected” - SciTechDaily", "description": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat may dissipate sooner than previously thought. The evolution of…", "url": "https://scitechdaily.com/earths-interior-is-cooling-much-faster-than-expected/", "urlToImage": "https://scitechdaily.com/images/Earth-Core-Animation.gif", "publishedAt": "2022-01-16T01:35:57Z", "content": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat ma… [+3896 chars]"}, {"source": {"id": null, "name": "North Delta Reporter"}, "author": "Bailey Moreton", "title": "Space travel can improve everyone's lives, says Canadian astronaut Chris Hadfield – North Delta Reporter - North Delta Reporter", "description": "<p>Improvements in space technology accelerating, having major impact on life on Earth </p>", "url": "https://www.northdeltareporter.com/news/space-travel-can-improve-everyones-lives-says-canadian-astronaut-chris-hadfield/", "urlToImage": "https://www.northdeltareporter.com/wp-content/uploads/2022/01/27839615_web1_25788207-8af8c497f3a548acb6ee68d58168c9db-1024x677.jpg", "publishedAt": "2022-01-15T23:00:00Z", "content": "Space exploration continues to deliver benefits to life on Earth, despite criticism of recent private ventures into the beyond by billionaires, according to Canadian astronaut Cmdr. Chris Hadfield.\r\n… [+3524 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "All iPhone 14 models tipped to get 120Hz displays, 6GB of RAM - TechRadar", "description": "Upgrades on the way", "url": "https://www.techradar.com/news/all-iphone-14-models-tipped-to-get-120hz-displays-6gb-of-ram", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7qeBL9rBcucTwFMP4DqTPn-1200-80.jpg", "publishedAt": "2022-01-15T16:30:24Z", "content": "We probably won't see the iPhone 14 handsets appear until September, but we're seeing plenty of leaks and rumors in the meantime. Now we've got news of upgrades potentially coming to all the models i… [+2393 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Major Milestone for the James Webb Space Telescope, a “Mini” Monster Black Hole [Video] - SciTechDaily", "description": "A major milestone for the James Webb Space Telescope, what astronomers could learn from a “mini” monster black hole, and the latest assessment of our planet’s global surface temperature … a few of the stories to tell you about – This Week at NASA! https://you…", "url": "https://scitechdaily.com/a-major-milestone-for-the-james-webb-space-telescope-a-mini-monster-black-hole-video/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-01-15T12:37:43Z", "content": "Video transcript:\r\nA major milestone for the James Webb Space Telescope, what astronomers could learn from a mini monster black hole, and the latest assessment of our planet’s global surface temperat… [+2536 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/mehar.pranjal", "title": "World’s largest fishing colony discovered in Antarctica - Tech Explorist", "description": "The most spatially extensive contiguous fish breeding colony discovered worldwide to date.", "url": "https://www.techexplorist.com/world-largest-fishing-colony-discovered-antarctica/44122/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/01/Fish-nests.jpg", "publishedAt": "2022-01-15T08:58:52Z", "content": "Using a towed camera system, a team of scientists recently discovered the world’s largest fish breeding area near the Filchner Ice Shelf in the south of the Antarctic Weddell Sea. They photographed a… [+4339 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Earth Isn't 'Super' Because the Sun Had Rings - ExtremeTech", "description": "By modeling our solar system with a supercomputer, astrophysicist André Izidoro and his colleagues have shown that the early formation of rings around the sun influenced the size of the resulting planets.", "url": "https://www.extremetech.com/extreme/330589-earth-isnt-super-because-the-sun-had-rings", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/08/638831main_globe_east_1344-640x360.jpg", "publishedAt": "2022-01-14T20:25:00Z", "content": "As we explore the cosmos, astronomers have spotted a lot of so-called “super-Earths.” These rocky planets may be several times as massive as Earth, and there’s no analog in our solar system. But why … [+2815 chars]"}, {"source": {"id": null, "name": "Highland Radio"}, "author": null, "title": "Donegal success in BT Young Scientists exhibition - Highland Radio", "description": "Six projects in four Donegal schools have been successful in the BT Young Scientist and Technology Exhibition. The awards have gone to schools in Letterkenny, Donegal Town and Stranorlar. Two Letterkenny schools received awards, Iseult Ni Mhathuna in Colaiste…", "url": "https://highlandradio.com/2022/01/14/donegal-success-in-bt-young-scientists-exhibition/", "urlToImage": "https://highlandradio.com/wp-content/uploads/2022/01/bt1.jpg", "publishedAt": "2022-01-14T19:49:10Z", "content": null}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "Ayub", "title": "2022 Lexus NX 350 burnishes brand with great tech - Toys Matrix", "description": "Reputations are a hard thing to build and an even harder thing to shake. When the Lexus NX arrived in 2014, the compact crossover was intended to bring some youthful swagger to a brand favored by a quieter, comfier, stay-off-my-lawn kinda own", "url": "https://toysmatrix.com/2022-lexus-nx-350-burnishes-brand-with-great-tech/", "urlToImage": "https://images.hgmsites.net/hug/2022-lexus-nx_100809032_h.jpg", "publishedAt": "2022-01-14T14:09:06Z", "content": "Reputations are a hard thing to build and an even harder thing to shake. When the Lexus NX arrived in 2014, the compact crossover was intended to bring some youthful swagger to a brand favored by a q… [+6518 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "James Webb Space Telescope: Mirror, Mirror…On Its Way! - SciTechDaily", "description": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the beginning of a several-month phase of aligning the telescop…", "url": "https://scitechdaily.com/james-webb-space-telescope-mirror-mirroron-its-way/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Primary-Mirror-in-Space.gif", "publishedAt": "2022-01-14T12:14:03Z", "content": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the… [+3139 chars]"}]}