{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for June 14: Select collection rewards now available! - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for June 14: Free weapons, skins, loot crates, and much more are available today. Grab free rewards this way.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-june-14-select-collection-rewards-now-available-71686706019669.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/14/1600x900/be05021dcfd0b5a8b45272d19c9a5b1ejpg_1650761539952_1686706484241.jpg", "publishedAt": "2023-06-14T01:38:45Z", "content": "Garena Free Fire MAX redeem codes for June 14: Garena Free Fire MAX players are in luck as they can grab several themed rewards and collections right now! First up is the Spider-Man: Across the Spide… [+1915 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "3D muscle reconstruction shows 3.2 million-year-old “Lucy” walked upright - Ars Technica", "description": "\"Lucy’s muscles suggest that she was as proficient at bipedalism as we are.\"", "url": "https://arstechnica.com/science/2023/06/3d-muscle-reconstruction-shows-3-2-million-year-old-lucy-walked-upright/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/lucyTOP2-760x380.jpg", "publishedAt": "2023-06-13T23:01:43Z", "content": "14 with \r\n3D reconstruction of lower limb muscles of Australopithecus afarensis fossil AL 288-1, aka \"Lucy.\" Credit: Ashleigh Wiseman\r\n3D reconstruction of lower limb muscles of Australopithecus afar… [+4108 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Joe Rossignol", "title": "15-Inch MacBook Air With 256GB Storage Has Slower SSD Speeds Than Higher-Capacity Models - MacRumors", "description": "As expected, the 15-inch MacBook Air with 256GB of storage is equipped with a single NAND chip, according to YouTube channel Max Tech. This will...", "url": "https://www.macrumors.com/2023/06/13/15-inch-macbook-air-single-256gb-chip/", "urlToImage": "https://images.macrumors.com/t/KjaKTVh9L1O4_2klFRf-gmBWu6Q=/1600x/article-new/2023/06/MacBook-Air-15-Inch-Feature-Blue.jpg", "publishedAt": "2023-06-13T21:03:33Z", "content": "As expected, the 15-inch MacBook Air with 256GB of storage is equipped with a single NAND chip, according to YouTube channel Max Tech. This will result in the 256GB model having slower SSD read and w… [+1310 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling Quantum Gravity: New Results From IceCube Neutrino Observatory and Fermi Space Telescope - SciTechDaily", "description": "Researchers have reached a significant milestone in the field of quantum gravity research, finding preliminary statistical support for quantum gravity. In a study published in Nature Astronomy on June 12, a team of researchers from the University of Naples “F…", "url": "https://scitechdaily.com/?p=285779", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Quantum-Gravity-Art-Concept.jpg", "publishedAt": "2023-06-13T12:42:40Z", "content": "New research provides preliminary evidence supporting a quantum gravity model which suggests that the speed of ultrarelativistic particles reduces with increased energy. The study used data from the … [+2365 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Mega-Bubble Triggers Coronial Chaos, Earth Narrowly Escapes Devastating Solar Storm - Transcontinental Times", "description": "UNITED STATES: Coronal mass ejections, gigantic eruptions of plasma and magnetic fields from the Sun's corona, are known to wreak havoc on Earth's delicate technological infrastructure. These powerful outbursts can disrupt satellite communications and power g…", "url": "https://www.transcontinentaltimes.com/earth-escape-devastating-solar-storm/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/06/Sun.jpg", "publishedAt": "2023-06-13T12:09:47Z", "content": "UNITED STATES: In a jaw-dropping celestial spectacle, a mega-bubble collapsing in the Sun’s atmosphere set off a series of extraordinary events that had astronomers on the edge of their seats. The co… [+3798 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Some Species Survive Mass Extinctions? Hidden “Whole Genome Duplication” May Be the Secret - SciTechDaily", "description": "Geneticists have made a significant discovery about the ancient history of sturgeons and paddlefish, which carries profound implications for our understanding of evolution. They identified a previously hidden instance of \"whole genome duplication\" (WGD) in th…", "url": "https://scitechdaily.com/?p=283315", "urlToImage": "https://scitechdaily.com/images/Abstract-Genetic-Sequencing-Fail.jpg", "publishedAt": "2023-06-13T10:12:28Z", "content": "ByTrinity College DublinJune 13, 2023\r\nGeneticists discovered a past whole genome duplication (WGD) event in the common ancestor of sturgeons and paddlefish that occurred just before a significant ma… [+4344 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Insights Into Redox-Independent Cellular Stress Response - Technology Networks", "description": "Researchers from Juntendo University have unraveled the roles of phase-separated liquid droplets, p62 bodies, in redox-independent NRF2 activation and the significance of phosphorylation in this process.<br />", "url": "https://www.technologynetworks.com/cell-science/news/new-insights-into-redox-independent-cellular-stress-response-374617", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374617/new-insights-into-redox-independent-cellular-stress-response-374617-640x360.jpg?cb=20230613", "publishedAt": "2023-06-13T07:42:28Z", "content": "Cellular stress, or oxidative stress, occurs when there is a buildup of reactive oxygen species (ROS), which interferes with cellular mechanisms and can even cause damage to proteins, lipids, and DNA… [+4955 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Quantum Physics: New Visualization Technique Gives Insight Into Photosynthesis - SciTechDaily", "description": "Researchers have developed coherence maps, a technique to visualize quantum mechanics and understand the mechanisms underpinning photosynthesis. The maps elucidate the complex energy transfer process in photosynthesizing bacteria, providing a clear picture of…", "url": "https://scitechdaily.com/harnessing-quantum-physics-new-visualization-technique-gives-insight-into-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-06-12T23:06:14Z", "content": "ByUniversity of Illinois Grainger College of EngineeringJune 12, 2023\r\nScientists have developed an illustrative method called coherence maps to elucidate quantum phenomena. They used these maps to g… [+4561 chars]"}]}