{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "CircleCI says hackers stole encryption keys and customers’ source code - TechCrunch", "description": "In a post-mortem, CircleCi blamed malware stole an employee's session token allowing intruders to access customer data.", "url": "https://techcrunch.com/2023/01/14/circleci-hackers-stole-customer-source-code/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1404252962.jpg?resize=1200,800", "publishedAt": "2023-01-14T22:27:57Z", "content": "CircleCi, a software company whose products are popular with developers and software engineers, confirmed that some customers’ data was stolen in a data breach last month.\r\nThe company said in a deta… [+2952 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Innovative Treatment Prevents Diabetes - SciTechDaily", "description": "Researchers from the Liston lab at the Babraham Institute have recently published a study on a preventative therapy for diabetes in mice. They were able to prevent the onset of diabetes in mice by modifying signaling pathways in pancreatic cells to prevent st…", "url": "https://scitechdaily.com/new-innovative-treatment-prevents-diabetes/", "urlToImage": "https://scitechdaily.com/images/No-Diabetes-Concept.jpg", "publishedAt": "2023-01-14T21:46:47Z", "content": "Diabetes is a chronic condition characterized by high levels of sugar (glucose) in the blood. It is caused by a problem with the hormone insulin, which regulates the amount of glucose in the body. Th… [+3907 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "ChatGPT goes pro, layoffs at Alphabet, and Dungeons & Dragons flirts with restrictive new licensing - TechCrunch", "description": "This week, OpenAI signaled the launch of a pro-level ChatGPT, while Microsoft unveiled a cheaper Microsoft 365 plan and layoffs continued at major tech firms.", "url": "https://techcrunch.com/2023/01/14/chatgpt-goes-pro-layoffs-at-alphabet-and-dungeons-dragons-flirts-with-restrictive-new-licensing/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/01/GettyImages-1167399542.jpg", "publishedAt": "2023-01-14T21:15:53Z", "content": "Welcome, welcome, folks, to Week in Review, TechCrunch’s regular column that recaps the last week in news. If you’d like it in your inbox every Saturday, sign up here. Hope you’re sitting comfortably… [+7367 chars]"}, {"source": {"id": null, "name": "Auburn Citizen"}, "author": "Cheryl Kahla", "title": "CES 2023: Spatial vision tech brings 3D to life, without glasses or headsets - The Citizen", "description": "Spatial Vision Technology enables you to see 3D with the naked eye. No wearables, glasses or VR headsets required...", "url": "https://www.citizen.co.za/lifestyle/technology/ces-2023-spatial-vision-tech-3d-asus/", "urlToImage": "https://media.citizen.co.za/wp-content/uploads/2023/01/spatial-vision-technology-ces-2023.jpg", "publishedAt": "2023-01-14T18:08:30Z", "content": "ASUS unveiled several game-changing laptops and gadgets at CES 2023, held in Las Vegas earlier this month but their Spatial Vision Technology stole the show.\r\nThe Citizen was invited to attend a virt… [+2674 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "After a slow start, SpaceX’s Falcon Heavy rocket is about to hit its stride - Ars Technica", "description": "A trickle of Falcon Heavy launches may soon turn into a flood.", "url": "https://arstechnica.com/science/2023/01/the-first-of-five-falcon-heavy-launches-this-year-could-take-flight-today/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/01/TTM_4073-760x380.jpg", "publishedAt": "2023-01-14T16:19:17Z", "content": "Enlarge/ A Falcon Heavy rocket rolls to the launch pad on Saturday January 14 2023.\r\n7 with 0 posters participating\r\nNearly five years have passed since the massive Falcon Heavy rocket made its succe… [+3241 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Jeran Wittenstein", "title": "Tech’s Slump Camouflages a Rally Sweeping Across Most of S&P 500 - Yahoo Finance", "description": "(Bloomberg) -- The S&P 500 is technically still mired in a bear market, but a closer look below the surface shows that most of its stocks are in the midst of...", "url": "https://finance.yahoo.com/news/tech-slump-camouflages-rally-sweeping-160000740.html", "urlToImage": "https://media.zenfs.com/en/bloomberg_markets_842/94b2f91df2b66b44aec782b107d22b73", "publishedAt": "2023-01-14T16:00:00Z", "content": "(Bloomberg) -- The S&amp;P 500 is technically still mired in a bear market, but a closer look below the surface shows that most of its stocks are in the midst of a big rally.\r\nMost Read from Bloomber… [+3490 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Hole's Deep Gravitational Sinkhole Twists Unlucky Star Into Donut Shape - SciTechDaily", "description": "A Deep Gravitational Sinkhole Swallows Unlucky Bypassing Star Black holes have such a voracious gravitational pull that they even swallow light. This makes them hungry monsters lurking in the eternal darkness. There’s no escape if you happen to stumble across…", "url": "https://scitechdaily.com/black-holes-deep-gravitational-sinkhole-twists-unlucky-star-into-donut-shape/", "urlToImage": "https://scitechdaily.com/images/Star-Spaghettification-Black-Hole.gif", "publishedAt": "2023-01-14T11:18:51Z", "content": "BySpace Telescope Science InstituteJanuary 14, 2023\r\nThis animation depicts a star experiencing spaghettification as its sucked in by a supermassive black hole during a tidal disruption event. Credit… [+9715 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroids gave birth to life? NASA crashes rocks on Earth to unveil secret to origin of life - HT Tech", "description": "A group of NASA scientists have conducted an experiment in which they simulated asteroid strikes on Earth to determine whether the origin of life was a result of a cosmic accident.", "url": "https://tech.hindustantimes.com/tech/news/asteroids-gave-birth-to-life-nasa-crashes-rocks-on-earth-to-unveil-secret-to-origin-of-life-71673691589678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/14/1600x900/pillars_of_creation_1673691774097_1673691787681_1673691787681.png", "publishedAt": "2023-01-14T10:25:16Z", "content": "The belief that the origin of life on Earth may have extraterrestrial roots is solidifying in the astronomical community. Recently, a study was published in the journal ACS Central Science which cond… [+2355 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Global rates could be 'high for long': RBI governor Shaktikanta Das - The Economic Times", "description": "Slowing inflation has prompted several economists to forecast an imminent end to the US Federal Reserve's rate-tightening cycle, hauling Wall Street indices from 52-week lows. Lately, the technology-heavy Nasdaq, the stock gauge most battered by Fed's liquidi…", "url": "https://economictimes.indiatimes.com/news/economy/policy/global-rates-could-be-high-for-long-rbi-governor-shaktikanta-das/articleshow/96979426.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96979455,width-1070,height-580,imgsize-47434,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-14T01:50:00Z", "content": "Mumbai: India's central bank governor Shaktikanta Das Friday said that interest rates globally could remain elevated if the current geo-political tensions were to continue, although odds have lengthe… [+2450 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Tanushree Shenwai, Tanushree Shenwai", "title": "This Artificial Intelligence (AI) Research Proposes A New Poisoning Attack That Could Trick AI-Based Coding Assistants Into Suggesting Dangerous Code - MarkTechPost", "description": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit 'AI pair programmer' called GitHub Copilot was unveiled in June 2021 by GitHub and OpenAI. Depending on the surrounding code and c…", "url": "https://www.marktechpost.com/2023/01/13/this-artificial-intelligence-ai-research-proposes-a-new-poisoning-attack-that-could-trick-ai-based-coding-assistants-into-suggesting-dangerous-code/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-13-at-12.06.15-PM.png", "publishedAt": "2023-01-13T20:07:25Z", "content": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit “AI pair programmer” called GitHub Copilot was unveiled in June 2021 b… [+4516 chars]"}, {"source": {"id": null, "name": "Technocio.com"}, "author": "technocio", "title": "CES 2023: Un futuro sostenible gracias a la conectividad - Technocio", "description": "CES 2023, futuro sostenible, conectividad, Samsung, SmartWork, Health & Wellness, Galaxy Watch, SmartThings, Pet Care, ReadyCare, Blockchain, Knox Matrix, Net Zero Home", "url": "https://technocio.com/ces-2023-un-futuro-sostenible-gracias-a-la-conectividad/", "urlToImage": "http://technocio.com/wp-content/uploads/2023/01/Samsung-CES-2023.jpg", "publishedAt": "2023-01-13T17:28:59Z", "content": "Samsung presentó sus innovaciones para este año en la feria más importante de la tecnología en el mundo. \r\nEl CES 2023 finalizó con éxito. Más de 115.000 asistentes visitaron la feria más importante … [+7511 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Gerard Ramos", "title": "The Huawei Mate 50 Pro: An excellent, exciting reflection of things to come | Gerard Ramos - BusinessMirror", "description": "THE punishing trade restrictions the US government slapped in 2017 on prominent China-based technology companies that included Huawei and ZTE, ostensibly due to possible national security threats, have not eased, and there appears to be no indication the blac…", "url": "https://businessmirror.com.ph/2023/01/14/the-huawei-mate-50-pro-an-excellent-exciting-reflection-of-things-to-come/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2023/01/digitallife01-011423.jpg", "publishedAt": "2023-01-13T16:00:00Z", "content": "THE punishing trade restrictions the US government slapped in 2017 on prominent China-based technology companies that included Huawei and ZTE, ostensibly due to possible national security threats, ha… [+9705 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Artificial nerve cells - almost like biological - Nanowerk", "description": "Researchers have created an artificial organic neuron that closely mimics the characteristics of biological nerve cells. This artificial neuron can stimulate natural nerves, making it a promising technology for various medical treatments in the future.", "url": "https://www.nanowerk.com/news2/biotech/newsid=62152.php", "urlToImage": "https://www.nanowerk.com/news2/biotech/id62152_1.jpg", "publishedAt": "2023-01-13T09:45:04Z", "content": "Nanowerk Newsletter\r\nGet our Biotechnology News updates to your inbox!"}]}