{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "BepiColombo's Space Odyssey: Third Mercury Flyby Reveals Geological Wonders - SciTechDaily", "description": "The ESA/JAXA BepiColombo mission has made its third of six gravity assist flybys at Mercury, snapping images of a newly named impact crater as well as tectonic and volcanic curiosities as it adjusts its trajectory for entering Mercury orbit in 2025. The close…", "url": "https://scitechdaily.com/bepicolombos-space-odyssey-third-mercury-flyby-reveals-geological-wonders/", "urlToImage": "https://scitechdaily.com/images/BepiColombo-First-Mercury-Flyby-3-scaled.jpg", "publishedAt": "2023-06-21T19:49:38Z", "content": "ByEuropean Space Agency (ESA)June 21, 2023\r\nESA/JAXAs BepiColombo mission successfully completed its third flyby of Mercury, capturing valuable images of geological features including the newly named… [+8734 chars]"}, {"source": {"id": null, "name": "The Economist"}, "author": "The Economist", "title": "The scientific search for the origin of covid-19 - The Economist", "description": "Our podcast on science and technology. This week, how to trace a virus back to its source—and why it’s important to investigate how the pandemic started", "url": "https://www.economist.com/covid-origins-pod", "urlToImage": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20230624_PDP506.jpg", "publishedAt": "2023-06-21T17:28:52Z", "content": "THE BIDEN ADMINISTRATION is expected to declassify some information gathered on the origin of the SARS-CoV-2 virus, hoping to end a three-year battle over whether covid-19 came from a seafood market … [+938 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Euclid Spacecraft Fueled for Launch – New Space Telescope Will Explore the Dark Universe - SciTechDaily", "description": "The European Space Agency's Euclid spacecraft has been fueled with hydrazine and gaseous nitrogen in preparation for launch on a SpaceX Falcon 9 this summer. The highly toxic hydrazine, used for propulsion and spacecraft disposal, is handled by experts wearin…", "url": "https://scitechdaily.com/euclid-spacecraft-fueled-for-launch-new-space-telescope-will-explore-the-dark-universe/", "urlToImage": "https://scitechdaily.com/images/Euclid-Universe-scaled.jpg", "publishedAt": "2023-06-21T17:13:16Z", "content": "ByEuropean Space Agency (ESA)June 21, 2023\r\nArtists impression of the Euclid mission in space. Euclid is designed to look far and wide to answer some of the most fundamental questions about our Unive… [+4271 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Frederic Lardinois", "title": "Microsoft expects to build a quantum supercomputer within 10 years - TechCrunch", "description": "Microsoft believes it will take fewer than 10 years to build a quantum supercomputer using qubits that will be able to perform a reliable 1M quantum operations per second.", "url": "https://techcrunch.com/2023/06/21/microsoft-expects-to-build-a-quantum-supercomputer-within-10-years/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/azure-quantum-topological-qubit-chip-edited_1572.jpg?resize=1200,675", "publishedAt": "2023-06-21T15:00:23Z", "content": "Microsoft today announced its roadmap for building its own quantum supercomputer, using the topological qubits the company’s researchers have been working on for quite a few years now. There are stil… [+3445 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Novel Probiotic Treatment Shows Success in Treating Crohn’s Disease - Technology Networks", "description": "Probiotics can help maintain a healthy gut microbiome or restore populations of “good bacteria” after a heavy course of antibiotics. But now, they could also be used as an effective treatment strategy for certain intestinal diseases, such as Crohn’s disease.", "url": "https://www.technologynetworks.com/drug-discovery/news/novel-probiotic-treatment-shows-success-in-treating-crohns-disease-375086", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/375086/novel-probiotic-treatment-shows-success-in-treating-crohns-disease-375086-640x360.jpg?cb=20230621", "publishedAt": "2023-06-21T14:09:01Z", "content": "Probiotics can help maintain a healthy gut microbiome or restore populations of good bacteria after a heavy course of antibiotics. But now, they could also be used as an effective treatment strategy … [+3059 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Min Jeong Lee, Vlad Savov, Takahiko Hyuga", "title": "Masayoshi Son Says SoftBank to Shift to 'Offense' in Investments, Touts AI Power - Bloomberg", "description": "SoftBank Group Corp. founder Masayoshi Son declared in an emotional meeting with investors that he will go back on the offensive in tech investing soon, seeking to establish his credentials in the burgeoning field of artificial intelligence.", "url": "https://www.bloomberg.com/news/articles/2023-06-21/softbank-to-shift-to-offense-in-investments-ceo-says", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i9yu2k5J.cog/v0/1200x800.jpg", "publishedAt": "2023-06-21T01:30:00Z", "content": "SoftBank Group Corp. founder Masayoshi Son declared in an emotional meeting with investors that he will go back on the offensive in tech investing soon, seeking to establish his credentials in the bu… [+279 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Euclid fuelled for launch - European Space Agency", "description": "ESA’s Euclid gets fuelled inside an Astrotech facility near Cape Canaveral in Florida (USA) ahead of its launch on a SpaceX Falcon 9.", "url": "https://www.esa.int/Science_Exploration/Space_Science/Euclid/Euclid_fuelled_for_launch", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/06/euclid_fuelled_for_launch/24932671-1-eng-GB/Euclid_fuelled_for_launch_pillars.jpg", "publishedAt": "2023-06-20T05:51:42Z", "content": "ESAs Euclid gets fuelled inside an Astrotech facility near Cape Canaveral in Florida (USA) ahead of its launch on a SpaceX Falcon 9.The Euclid spacecraft is supplied with two types of propellant: hyd… [+1402 chars]"}]}