{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Apple is reportedly exploring a partnership with Google for Gemini-powered feature on iPhones - TechCrunch", "description": "Apple is looking to team up with Google for a mega-deal to leverage the Gemini AI model for features on iPhone, Bloomberg reported.", "url": "https://techcrunch.com/2024/03/17/apple-is-reportedly-exploring-a-partnership-with-google-for-gemini-powered-feature-on-iphones/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/10/apple-fighting-google.jpg?resize=1200,675", "publishedAt": "2024-03-18T06:22:30Z", "content": "Apple is looking to team up with Google for a mega-deal to leverage the Gemini AI model for features on iPhone, Bloomberg reported. This will put Google in a commanding position as the company alread… [+2135 chars]"}, {"source": {"id": null, "name": "Asia Times"}, "author": "Gabriel Honrada", "title": "China building giant hypersonic railgun for space launches - Asia Times", "description": "In a hypersonic race for rapid-fire satellite-launching supremacy, China and the US are unveiling dueling futuristic technologies that could be crucial in", "url": "http://asiatimes.com/2024/03/china-building-giant-hypersonic-railgun-for-space-launches/", "urlToImage": "https://asiatimes.com/wp-content/uploads/2024/03/Spaceplane-China.jpg", "publishedAt": "2024-03-18T04:39:21Z", "content": "In a hypersonic race for rapid-fire satellite-launching supremacy, China and the US are unveiling dueling futuristic technologies that could be crucial in a war scenario where satellites are targeted… [+6922 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "140-foot asteroid to pass Earth at a close distance today, reveals NASA; Know how fast it is approaching - HT Tech", "description": "The orbit of a 140-foot asteroid is predicted to bring it to the closest point to Earth today, March 18. From size, speed to distance of approach, know all about this upcoming asteroid.", "url": "https://tech.hindustantimes.com/tech/news/140foot-asteroid-to-pass-earth-at-a-close-distance-today-reveals-nasa-know-how-fast-it-is-approaching-71710735745242.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/18/1600x900/g1b69efea58486d7510946e54_1708083615031_1710735929409.jpg", "publishedAt": "2024-03-18T04:35:36Z", "content": "Two asteroids passed Earth yesterday at the closest points in their orbit. Now, NASA has revealed that four more asteroids are expected to pass by Earth today, March 18. These space rocks often come … [+2013 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Francesco De Meo", "title": "PlayStation 5 Pro CPU Will Boost to 3,85 GHz With High CPU Frequency Mode; Will Use RDNA 4’s RT Engine - Wccftech", "description": "New details on the PlayStation 5 Pro specs surfaced online, highlighting boosts for CPU and memory as well as usage of RDNA 4's RT engine", "url": "https://wccftech.com/playstation-5-pro-cpu-memory-boost-rdna-4-rt/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/12/Sony-PS5-Pro-PlayStation-5-Pro.jpg", "publishedAt": "2024-03-18T01:09:00Z", "content": "Additional details on the PlayStation 5 Pro specs emerged online today, highlighting boosts for CPU and system memory performance and other GPU details.\r\nA new report by Insider Gaming reveals how th… [+1453 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Excessive Sitting Raises Risk of Early Death: Now We Know How Much - ScienceAlert", "description": "Advances in technology in recent decades have obviated the need and desire for humans to move.", "url": "https://www.sciencealert.com/excessive-sitting-raises-risk-of-early-death-now-we-know-how-much", "urlToImage": "https://www.sciencealert.com/images/2024/03/man_standing_stretching.jpg", "publishedAt": "2024-03-17T10:31:11Z", "content": "Advances in technology in recent decades have obviated the need and desire for humans to move. Many of the world's population sit for long periods throughout the day, whether in front of a computer a… [+3409 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "WhatsApp update set to enhance your experience, allow you to pin multiple chats and messages - HT Tech", "description": "WhatsApp is rolling out a new feature allowing users to pin multiple chats and messages to streamline the organization and enhance accessibility for important conversations. This WhatsApp update is available to some beta testers now.", "url": "https://tech.hindustantimes.com/tech/news/whatsapp-update-set-to-enhance-your-experience-allow-you-to-pin-multiple-chats-and-messages-71710661827725.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/17/1600x900/WhatsApp_1710662154217_1710662154419.jpg", "publishedAt": "2024-03-17T07:58:58Z", "content": "WhatsApp, under Meta's umbrella, is testingout a new feature that will allow users to pin multiple chats and messages simultaneously. This functionality is currently in the testing phase and is avail… [+1732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Leap in Material Science: Researchers Unveil AI-Powered Atomic Fabrication Technique - SciTechDaily", "description": "Researchers at the National University of Singapore (NUS) have developed an innovative method for creating carbon-based quantum materials atom by atom. This method combines the use of scanning probe microscopy with advanced deep neural networks. The achieveme…", "url": "https://scitechdaily.com/quantum-leap-in-material-science-researchers-unveil-ai-powered-atomic-fabrication-technique/", "urlToImage": "https://scitechdaily.com/images/Quantum-Material-Manufacturing.jpg", "publishedAt": "2024-03-17T05:38:15Z", "content": "This allows for precise engineering of their -electron topology and spin configurations in an automated manner, mirroring the capabilities of human chemists.very goodPlease consider:1. Can spin creat… [+4596 chars]"}]}