{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Maxwell Zeff", "title": "Tech Bros Are Returning Their Vision Pros and Keeping Receipts - Gizmodo", "description": "“I returned my Apple Vision Pro. Here’s why,” stories have flooded the internet with tragic tales of regret and sore faces.", "url": "https://gizmodo.com/tech-bros-returning-vision-pro-keeping-receipts-1851256024", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/137ad723fbbc37485ec3e52cf7d94fb2.jpg", "publishedAt": "2024-02-14T16:55:00Z", "content": "Thousands of people lined up outside Apple Stores on Feb. 2 to see the Vision Pros stunning debut, but dissatisfied customers are returning their headsets this week. Why? Apples 14-day return period … [+2580 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Potentially Hazardous Asteroid to pass Earth today, says NASA; Know how big it is - HT Tech", "description": "NASA has shed light on a massive Potentially Hazardous Asteroid which is predicted to pass by Earth today, February 14. Know its speed, size, distance of approach, and other details, as per the space agency.", "url": "https://tech.hindustantimes.com/tech/news/potentially-hazardous-asteroid-to-pass-earth-today-says-nasa-know-how-big-it-is-71707907671196.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/14/1600x900/wikimedia_commons_1673950232106_1707907778943.jpg", "publishedAt": "2024-02-14T11:04:53Z", "content": "Asteroids are ancient space rocks floating in their orbits in space. However, sometimes they come dangerously close to a planet like Earth. This happens due to the interaction with a large planet's g… [+2965 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "NASA solar sail tech is ready – now who's up to use it in a mission? - The Register", "description": "Ready for cruising: successful deployment leaves the ball in the scientists' court", "url": "https://www.theregister.com/2024/02/14/nasa_solar_sail_is_ready/", "urlToImage": "https://regmedia.co.uk/2023/05/04/shutterstock_sun.jpg", "publishedAt": "2024-02-14T10:21:00Z", "content": "NASA says its latest take on solar sail technology is ready for proposals for it to be flown on science missions.\r\nThe announcement comes after a quarter of the sail was unfurled, demonstrating that … [+3246 chars]"}, {"source": {"id": null, "name": "Xm.com"}, "author": null, "title": "Intuitive Machines slides as launch of its US moon lander postponed - XM", "description": "The XM Research Desk, manned by market expert professionals, provides live daily updates on all the major events of the global markets in the form of market reviews, forex news, technical analysis, investment topics, daily outlook and daily videos.", "url": "https://www.xm.com/research/markets/allNews/reuters/intuitive-machines-slides-as-launch-of-its-us-moon-lander-postponed-53764815", "urlToImage": "https://cloud.xm-cdn.com/static/xm/common/logos/XM-logo.jpg", "publishedAt": "2024-02-14T10:05:30Z", "content": "What are Cookies?\r\nCookies are small data files. When you visit a website, the website sends the cookie to your computer. Your computer stores it in a file located inside your web browser.\r\nCookies d… [+3361 chars]"}]}