{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Cecilia D'Anastasio", "title": "Twitch sues users over alleged “hate raids” against streamers - Ars Technica", "description": "The lawsuit accuses two anonymous users of “targeting black and LGBTQIA+ streamers with racist, homophobic, sexist and other harassing content” in violation of its terms of service.", "url": "https://www.wired.com/story/twitch-sues-users-over-alleged-hate-raids/", "urlToImage": "https://media.wired.com/photos/613b6d0e6ab67fe10ebfff58/191:100/w_1280,c_limit/Gaming-Twitch-lawsuire-1339094198.jpg", "publishedAt": "2021-09-11T16:10:49Z", "content": "Since early August, Twitch has been wrestling with an epidemic of harassment against marginalized streamers known as hate raids. These attacks spam streamers chats with hateful and bigoted language, … [+3837 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Tourism: SpaceX Inspiration4 Mission Will Send 4 Civilians With Minimal Training Into Orbit - SciTechDaily", "description": "On September 15, 2021, the next batch of space tourists is set to lift off aboard a SpaceX rocket. Organized and funded by entrepreneur Jared Isaacman, the Inspiration4 mission touts itself as “the first all-civilian mission to orbit” and represents a new typ…", "url": "https://scitechdaily.com/space-tourism-spacex-inspiration4-mission-will-send-4-civilians-with-minimal-training-into-orbit/", "urlToImage": "https://scitechdaily.com/images/Inspiration4-Mission-Crew-Members.jpg", "publishedAt": "2021-09-11T14:21:00Z", "content": "ByWendy Whitman Cobb, US Air ForceSeptember 11, 2021\r\nFour people – none of them trained astronauts – are scheduled to launch into orbit aboard a SpaceX Dragon capsule on September 15, 2021. Credit: … [+5607 chars]"}, {"source": {"id": null, "name": "The Sun Daily"}, "author": null, "title": "Covid-19 digital certificate: MOSTI, MOH to carry out data cleanup - The Sun Daily", "description": "KOTA BHARU: The Ministry of Science, Technology and Innovation (MOSTI) and the Ministry of Health Malaysia (MOH) will carry out data clean up to tackl...", "url": "https://www.thesundaily.my/local/covid-19-digital-certificate-mosti-moh-to-carry-out-data-cleanup-DX8321674", "urlToImage": "https://www.thesundaily.my/binrepository/480x326/0c75/480d250/none/11808/YCVS/kb06-11092021-ppv-vaksin_1890020_20210911203341.jpg", "publishedAt": "2021-09-11T12:33:00Z", "content": "KOTA BHARU: The Ministry of Science, Technology and Innovation (MOSTI) and the Ministry of Health Malaysia (MOH) will carry out data clean up to tackle the problem faced by fully vaccinated individua… [+2187 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm may hit Earth! Double whammy to destroy your Internet, electricity - HT Tech", "description": "A solar storm is likely coming of such great magnitude that it will cause immense damage on Earth in terms of loss of lives and economic damage.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-may-hit-earth-double-whammy-to-destroy-your-internet-electricity-71631362121728.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/09/11/1600x900/explosion-1497200_1920_1631362627318_1631362632315.jpg", "publishedAt": "2021-09-11T12:08:41Z", "content": "A prediction, based on research, has it that a massive solar storm, dubbed a solar superstorm, is likely to hit Earth in the near future and it will be catastrophic for humanity. A solar storm is a p… [+2064 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp voice transcriptions feature coming soon! Here's how to benefit from it - HT Tech", "description": "WhatsApp voice transcriptions feature is coming soon and users are set to benefit in many ways. Here are top 7 questions answered on this WhatsApp feature.", "url": "https://tech.hindustantimes.com/tech/news/whatsapp-voice-transcriptions-feature-coming-soon-here-s-how-to-benefit-from-it-71631358748728.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/09/11/1600x900/WhatsAPp_1631360141796_1631360152254.jpg", "publishedAt": "2021-09-11T11:12:28Z", "content": "WhatsApp Voice Transcriptions feature: Earlier this week, WhatsApp rolled out a feature on its platforms, both Android and iOS, that enables users to encrypt their chat backups with the same end-to-e… [+3248 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Perseverance Rover Collects Puzzle Pieces of Mars’ History – Reveal “Potentially Habitable Sustained Environment” - SciTechDaily", "description": "The rocks it has analyzed for sample collection are helping the team better understand a past marked by volcanic activity and water. NASA’s Perseverance Mars rover successfully collected its first pair of rock samples, and scientists already are gaining new i…", "url": "https://scitechdaily.com/nasas-perseverance-rover-collects-puzzle-pieces-of-mars-history-reveal-potentially-habitable-sustained-environment/", "urlToImage": "https://scitechdaily.com/images/Mars-Perseverance-Rover-Sample-Collection.jpg", "publishedAt": "2021-09-11T09:42:29Z", "content": "ByNASASeptember 11, 2021\r\nTwo holes are visible in the rock, nicknamed “Rochette,” from which NASA’s Perseverance rover obtained its first core samples. The rover drilled the hole on the left, called… [+6734 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "OnePlus Buds Z2 leak shows off the next affordable earbuds from OnePlus - TechRadar", "description": "They're sticking to the OnePlus Buds Z design", "url": "https://www.techradar.com/news/oneplus-buds-z2-leak-shows-off-the-next-affordable-earbuds-from-oneplus", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ebnJFfRo9B2nhpRFy82e7K-1200-80.jpg", "publishedAt": "2021-09-11T09:30:53Z", "content": "You're spoilt for choice at the moment if you want some wireless earbuds from OnePlus, with the OnePlus Buds, OnePlus Buds Pro, and OnePlus Buds Z all available at the moment – and it's the latter pa… [+2786 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Hassan Mujtaba", "title": "NVIDIA GeForce RTX 2060 12 GB Graphics Card Reportedly Launches In Q1 2022 To Tackle GPU Availability Issues - Wccftech", "description": "NVIDIA is reportedly preparing a new version of its GeForce RTX 2060 graphics card which could feature double the memory capacity to tackle the current gaming graphics card availability issue. NVIDIA GeForce RTX 2060 12 GB Graphics Cards Reportedly In The Wor…", "url": "https://wccftech.com/nvidia-geforce-rtx-2060-12-gb-graphics-card-launches-in-q1-2022-to-tackle-gpu-availability-issues/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2019/01/39677053423_26b964b37a_b.jpg", "publishedAt": "2021-09-11T08:49:14Z", "content": "NVIDIA is reportedly preparing a new version of its GeForce RTX 2060 graphics card which could feature double the memory capacity to tackle the current gaming graphics card availability issue.\r\nThe l… [+2240 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Dr. Adrian Wong", "title": "Are Chinese Vaccines The Most Effective Vs. Delta Variant? - Tech ARP", "description": "Are Chinese vaccines the most effective vaccines against the Delta variant of COVID-19? Find out what the facts really are!", "url": "https://www.techarp.com/internet/chinese-vaccines-vs-delta-variant/", "urlToImage": "https://www.techarp.com/wp-content/uploads/2021/09/China-COVID-19-Vaccine-Delta-Variant-Fact-Check.jpg", "publishedAt": "2021-09-11T06:48:34Z", "content": "Are Chinese vaccines the most effective vaccines against the Delta variant of COVID-19?\r\nFind out what just went viral, and what the facts really are!\r\nClaim : Chinese Vaccines Are The Most Effective… [+6628 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Indian IT struggles to get experienced hands amid tech boom - Economic Times", "description": "IT firm Cognizant plans to hire 30,000 freshers and 1,00,000 laterals this year, which translates to onboarding nearly 300 experienced professionals every day. However, to achieve this an IT firm would need to make offers to 700 people a day, explains Kamal K…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/indian-it-struggles-to-get-experienced-hands-amid-tech-boom/articleshow/86111556.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86111661,width-1070,height-580,imgsize-84596,overlay-economictimes/photo.jpg", "publishedAt": "2021-09-11T05:38:00Z", "content": "India's top IT firms TCS, Infosys, HCL and Wipro plan to hire more than 1 lakh freshers this fiscal. But intent and and ability to hire are different things, explains Kamal Karanth, co-founder of spe… [+1460 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Hannah Paine", "title": "Major change coming for Pfizer vax - NEWS.com.au", "description": "<p>The Pfizer-BionNTech coronavirus vaccine could soon be administered to all children aged five and above, amid growing concern about the number of Delta infections detected in kids.</p>", "url": "https://www.news.com.au/world/coronavirus/global/major-change-coming-for-pfizer-with-vaccines-for-children-on-the-cards/news-story/abe9a2ea3f60b5d8560df53884f69edc", "urlToImage": "https://content.api.news/v3/images/bin/e9e3c7186ea4c9e8cdf164e90ab90e74", "publishedAt": "2021-09-11T04:18:52Z", "content": "The makers of the popular vaccine have revealed that a major decision in how the jab will be administered is expected in weeks.The Pfizer-BionNTech coronavirus vaccine could soon be administered to a… [+2878 chars]"}, {"source": {"id": null, "name": "Webbikeworld.com"}, "author": "Facebook", "title": "Stab-Proof Vest Tech: A Variable-Rigidity Prototype For Motorcycle Gear - webBikeWorld", "description": "https://youtu.be/LocoDawNIns    Two labs have created a new type of material originally meant for stab-proof and bullet-proof vests - and I want it in my motorcycle jacket.    The motorcycle gear industry has seen a Renaissance of improvement on", "url": "https://www.webbikeworld.com/variable-rigidity-prototype-for-motorcycle-gear-from-the-labs-of-stab-proof-vests/", "urlToImage": "https://www.webbikeworld.com/wp-content/uploads/2021/09/Chain-Mail-Fabric.jpg.jpg", "publishedAt": "2021-09-10T17:01:44Z", "content": "Two labs have created a new type of material originally meant for stab-proof and bullet-proof vests – and I want it in my motorcycle jacket.\r\nThe motorcycle gear industry has seen a Renaissance of im… [+3974 chars]"}]}