{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple Looks to Unveil new iMacs and MacBook Pros, at their \"Scary Event\" - Bloomberg Television", "description": "Bloomberg Mark Gurman joined Bloomberg Radio to go over what to expect at today's evening Apple Event. As well as what is happening to the Tech Company in th...", "url": "https://www.youtube.com/watch?v=WD3gug0F8CE", "urlToImage": "https://i.ytimg.com/vi/WD3gug0F8CE/maxresdefault.jpg", "publishedAt": "2023-10-30T18:09:44Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Breakthrough! In a first, infrared auroras on Uranus confirmed - HT Tech", "description": "Scientists have made a groundbreaking discovery, confirming the existence of infrared auroras on Uranus, shedding light on the planet's mysterious heat.", "url": "https://tech.hindustantimes.com/tech/news/breakthrough-in-a-first-infrared-auroras-on-uranus-confirmed-71698678719519.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/Uranus_1698679202744_1698679202995.jpg", "publishedAt": "2023-10-30T15:20:58Z", "content": "In a remarkable breakthrough, scientists have, after nearly two decades of research, confirmed the presence of stunning infrared auroras gracing the northern regions of Uranus. This revelation not on… [+2619 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Dark Matter to Bright Stars: Webb Telescope and “Renaissance Simulations” Reveal the Early Universe - SciTechDaily", "description": "Researchers have created a model of the early Universe that better corresponds to observations. Researchers have developed a new computer simulation of the early Universe that closely aligns with observations made by the James Webb Space Telescope (JWST). Ini…", "url": "https://scitechdaily.com/from-dark-matter-to-bright-stars-webb-telescope-and-renaissance-simulations-reveal-the-early-universe/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Formation-Concept.jpg", "publishedAt": "2023-10-30T12:46:44Z", "content": "ByMaynooth UniversityOctober 30, 2023\r\nA new computer simulation aligns with the James Web Space Telescopes observations of the early universe, accurately portraying early galaxy formations and the U… [+3027 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What are the aims and objectives of ISRO's Venus endeavor? - HT Tech", "description": "Shukrayaan1 mission What are the aims and objectives of ISROs Venus endeavor Just a month after Indias historic space achievement in the form of Chandrayaan3 mission ISRO is ready for its next projectShukrayaan1 mission. Aims and ObjectivesShukrayaan1 mission…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan-1-mission-what-are-the-aims-and-objectives-of-isros-venus-endeavor-71698658529678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/Venus_1696761851332_1698658717116.png/", "publishedAt": "2023-10-30T04:17:50Z", "content": "Photo Credit: Pixabay\r\n Just a month after India's historic space achievement in the form of Chandrayaan-3 mission, ISRO is ready for its next project: Shukrayaan-1 mission.\r\nPhoto Credit: NASA\r\n Aim… [+1111 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering Uranus' Glow: New Hints for Life on Icy Exoplanets - SciTechDaily", "description": "University of Leicester astronomers confirm the existence of an infrared (IR) aurora on Uranus. The presence of an infrared aurora on the cold, outer planet of Uranus has been confirmed for the first time by University of Leicester astronomers. The discovery …", "url": "https://scitechdaily.com/?p=322736", "urlToImage": "https://scitechdaily.com/images/Uranus-Aurora.jpg", "publishedAt": "2023-10-29T14:31:04Z", "content": "ByUniversity of LeicesterOctober 29, 2023\r\nAn artistic representation of how the northern infrared aurora would have looked in 2006 (marked in red). The darker red locations indicate confirmed aurora… [+7707 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "iPhone 15 charging problem in BMW cars: Apple reacts - HT Tech", "description": "Apple acknowledges iPhone 15 charging problem in BMW cars, and urges users to avoid these chargers temporarily.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-charging-problem-in-bmw-cars-apple-reacts-71698562245372.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/29/1600x900/BMW_1696251677673_1698562535629.jpg", "publishedAt": "2023-10-29T06:56:28Z", "content": "Apple has addressed the growing concerns raised by iPhone 15 users who reported issues with their device's NFC chips while using BMW's in-car wireless charging. The problem has left many frustrated, … [+1968 chars]"}]}