{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/andrew-tarantola", "title": "Google is shoving generative AI into Gmail, Docs, Sheets, Meet, Chat and Slides - Engadget", "description": "You'd better already be comfortable with using AI in your daily life because Google's about to put the tech front and center in all of its Workspace products..", "url": "https://www.engadget.com/google-is-shoving-generative-ai-into-gmail-docs-sheets-meet-chat-and-slides-161711903.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/iCNq2RcP3wmjEoexBWNb_g--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-03/fd4a1800-c27f-11ed-b7ff-02db82aeb64a.cf.jpg", "publishedAt": "2023-03-14T16:18:41Z", "content": "Google has been scrambling to catch up to to OpenAI for months, ever since the latter dropped its conversational bot, ChatGPT, and took the generative AI industry by storm. Google's first attempted r… [+1888 chars]"}, {"source": {"id": null, "name": "Timestech.in"}, "author": "Ishita Chaturvedi", "title": "element14 celebrates Pi-Day with the Sci-Pi Design Challenge - TimesTech", "description": "element14, an Avnet community, is celebrating Pi-Day with the Sci-Pi Design Challenge, encouraging their community of makers,", "url": "https://timestech.in/element14-celebrates-pi-day-with-the-sci-pi-design-challenge/", "urlToImage": "https://timestech.in/wp-content/uploads/2023/03/FAR-898-Featured.jpg", "publishedAt": "2023-03-14T11:41:23Z", "content": "element14, an Avnet community, is celebrating Pi-Day with the Sci-Pi Design Challenge, encouraging their community of makers, designers and engineers to creatively solve problems facing scientists an… [+1975 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sea Monster From Age of Dinosaurs Found on Remote Arctic Island - SciTechDaily", "description": "For nearly 190 years, scientists have searched for the origins of ancient sea-going reptiles from the Age of Dinosaurs. Now a team of Swedish and Norwegian palaeontologists has discovered remains of the earliest known ichthyosaur or ‘fish-lizard’ on the remot…", "url": "https://scitechdaily.com/?p=260349", "urlToImage": "https://scitechdaily.com/images/Reconstruction-of-Earliest-Ichthyosaur.jpg", "publishedAt": "2023-03-14T03:15:22Z", "content": "Reconstruction of the earliest ichthyosaur and the 250-million-year-old ecosystem found on Spitsbergen. Credit: Illustration by Esther van Hulsen\r\nFor nearly 190 years, scientists have searched for t… [+3444 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Pi Day Challenge: Celebrate the Mathematical Marvel With Stellar Math Problems - SciTechDaily", "description": "Pi Day is a day for people to celebrate and appreciate the importance of pi in our lives, and is often marked by various events and activities such as pie-eating contests, pi recitation competitions, and lectures on the history and significance of pi. Some pe…", "url": "https://scitechdaily.com/nasa-pi-day-challenge-celebrate-the-mathematical-marvel-with-stellar-math-problems/", "urlToImage": "https://scitechdaily.com/images/Pi-Number-and-Symbol.jpg", "publishedAt": "2023-03-13T19:46:07Z", "content": "ByJet Propulsion LaboratoryMarch 13, 2023\r\nPi Day is an annual celebration commemorating the mathematical constant (pi). It is observed on March 14th (3/14) since the first three digits of pi are 3.1… [+3870 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Chinese scientists use stem cell technology to grow antlers on MICE - Daily Mail", "description": "Scientists from Northwestern Polytechnical University in Xi'an, China have grown antler-like structures on the foreheads of mice by transplanting stem cells from deer.", "url": "https://www.dailymail.co.uk/sciencetech/article-11854197/Chinese-scientists-use-stem-cell-technology-grow-antlers-MICE.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/13/16/68652753-0-image-a-22_1678723606193.jpg", "publishedAt": "2023-03-13T16:41:21Z", "content": "Scientists have managed to grow antler-like structures on the foreheads of mice by transplanting stem cells from deer.\r\nDeer antlers fall off and regrow each year during the spring they'll increase i… [+4928 chars]"}]}