{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Josh Dinner", "title": "Falcon Heavy seen from space with satellite operated by company who built satellite launching on Falcon Heavy - Space.com", "description": "Maxar Technologies snapped photos of Falcon Heavy before it launches their largest satellite ever.", "url": "https://www.space.com/falcon-heavy-jupiter-3-maxar-satellite-photos", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rZ4RQxpTxHGCSPy4GodeJ6-1200-80.jpeg", "publishedAt": "2023-07-27T19:00:00Z", "content": "Before SpaceX's Falcon Heavy made its seventh flight to space, space decided to send some Falcon Heavy to Earth. \r\nIn photographs beamed back from one of Maxar Technologies' imaging satellites, Space… [+1685 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "It’s not just Netflix’s $900K AI jobs, it’s the hypocrisy - TechCrunch", "description": "It's no surprise one of the world's biggest tech companies is paying top dollar for AI experts - but we can still call them out.", "url": "https://techcrunch.com/2023/07/27/its-not-just-netflixs-900k-ai-jobs-its-the-hypocrisy/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1252544261-1.jpg?resize=1200,726", "publishedAt": "2023-07-27T18:16:33Z", "content": "The discovery of an AI product manager role at Netflix with a pay ceiling of $900,000 sent critics of the company and entertainment industry wild yesterday. That isn’t the only such listing, and like… [+6626 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "Some Alloys Don't Change Size When Heated. We Now Know Why. - Caltech", "description": "Researchers in the lab of Brent Fultz have discovered why so-called Invar alloys keep a steady size and shape over a broad range of temperatures—unlike most materials.", "url": "https://www.caltech.edu/about/news/some-alloys-dont-change-size-when-heated-we-now-know-why", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/invar_midst.width-600.jpg", "publishedAt": "2023-07-27T16:59:44Z", "content": "Nearly every material, whether it is solid, liquid, or gas, expands when its temperature goes up and contracts when its temperature goes down. This property, called thermal expansion, makes a hot air… [+6289 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lorenzo Franceschi-Bicchierai", "title": "Hackers are infecting Call of Duty players with a self-spreading malware - TechCrunch", "description": "Activision said it brought the 2009-released game offline while it investigates \"an issue.\"", "url": "https://techcrunch.com/2023/07/27/hackers-are-infecting-call-of-duty-players-with-a-self-spreading-malware/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/activision-call-of-duty-modern-warfare-2-1.jpg?resize=1200,675", "publishedAt": "2023-07-27T13:42:45Z", "content": "Hackers are infecting players of an old Call of Duty game with a worm that spreads automatically in online lobbies, according to two analyses of the malware.\r\nOn June 26, a user on a Steam forum aler… [+2074 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Ex-Twitter Blue chief on Musk’s ‘lack of process’ and impulsive management style - TechCrunch", "description": "Esther Crawford, the former head of Twitter Blue, wrote a long post on Twitter talking about the old management and working under Elon Musk.", "url": "https://techcrunch.com/2023/07/27/ex-twitter-blue-chief-on-musks-lack-of-process-and-impulsive-management-style/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/x-logo-impales-twitter-bird.jpg?resize=1200,675", "publishedAt": "2023-07-27T13:03:11Z", "content": "Esther Crawford, the former head of Twitter Blue, wrote a long post on X, the social network formerly known as Twitter, talking about the old management, working under Elon Musk and going viral for s… [+4758 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Simple Brain Hack Could Boost Learning and Improve Mental Health - SciTechDaily", "description": "The act of pretending to be an art thief supercharges people's memory of paintings, thanks to their heightened curiosity. Adopting a curious mindset over a high-pressure one can enhance memory, according to recent research from Duke University. The study show…", "url": "https://scitechdaily.com/simple-brain-hack-could-boost-learning-and-improve-mental-health/", "urlToImage": "https://scitechdaily.com/images/Brain-Ideas-Innovation-Knowledge-Concept.jpg", "publishedAt": "2023-07-27T12:36:00Z", "content": "A study by Duke University discovered that a mindset of curiosity can enhance memory, shown through a virtual art museum game where participants playing as curious thieves scouting for a future heist… [+6330 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Full Communications With Space Station Restored, Astrobee Free-Flying Robots Powered On - SciTechDaily", "description": "Another round of safety training commenced on Wednesday, July 27, on the International Space Station. In addition to this, the Expedition 69 crew members embarked on various tasks including robotic activities, ultrasound scans, and station maintenance. Astrob…", "url": "https://scitechdaily.com/?p=295643", "urlToImage": "https://scitechdaily.com/images/Astrobees-on-ISS.gif", "publishedAt": "2023-07-27T07:19:48Z", "content": "ByNASAJuly 27, 2023\r\nAnimation of Astrobees on the International Space Station. Credit: NASA\r\nAnother round of safety training commenced on Wednesday, July 27, on the International Space Station\r\nThe… [+3965 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Meteorite created Madhya Pradesh's famous Dhala impact crater, new study reveals - HT Tech", "description": "New study suggests rare Ureilite meteorite formed India's Dhala impact crater, offering insights into early solar system and potential impact on Earth's water and life development.", "url": "https://tech.hindustantimes.com/tech/news/meteorite-created-madhya-pradeshs-famous-dhala-impact-crater-new-study-reveals-71690439056785.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/27/1600x900/Meteorite_1690439443530_1690439443836.jpg", "publishedAt": "2023-07-27T06:32:48Z", "content": "Over the course of its 4.5 billion years of existence, Earth has encountered an untold number of extraterrestrial bodies hurtling through its atmosphere. Some have disintegrated before reaching the s… [+2010 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA telescopes track 170-foot asteroid charging towards Earth for a close approach - HT Tech", "description": "Asteroid 2018 BG5, which is the size of an aircraft, is expected to make its closest approach to Earth today. Know details, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/nasa-telescopes-track-170-foot-asteroid-charging-towards-earth-for-a-close-approach-71690432702262.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/27/1600x900/planet-7777704_1280_1689918138485_1690432808303.jpg", "publishedAt": "2023-07-27T04:40:41Z", "content": "We've heard the tale of an asteroid crashing on Earth nearly 65 million years ago and wiping out the dinosaurs since our childhood. But did you know that it is backed up by a hypothesis? According to… [+2254 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Tech Mahindra drops over 4% after Q1 earnings; brokerages maintain cautious approach, here's why - Moneycontrol", "description": "Tech Mahindra saw its revenue fall by 4 percent sequentially to $1600.7 million. Revenue has fallen 4.2 percent in constant currency terms", "url": "https://www.moneycontrol.com/news/business/markets/tech-mahindra-drops-over-4-after-q1-earnings-brokerages-maintain-cautious-approach-heres-why-11038981.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/09/TechM_logo_300dpi-770x433.png", "publishedAt": "2023-07-27T04:27:03Z", "content": "Shares of Tech Mahindra fell over 4 per cent in early trade on July 27 on BSE a day after the company reported its Q1FY24 earnings. It hit a low of Rs 1097.25 a share. The stock fell for five straigh… [+3348 chars]"}]}