{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "COVID survivors at increased risk of long-term gastrointestinal conditions - Ars Technica", "description": "Although people with severe COVID had highest risk, mild cases also upped risks.", "url": "https://arstechnica.com/science/2023/03/having-covid-ups-risk-of-many-long-term-gut-problems-study-finds/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-151046607-760x380.jpeg", "publishedAt": "2023-03-08T23:00:12Z", "content": "37 with \r\nSurviving a bout of COVID-19 can significantly increase the risk of developing a range of long-term gastrointestinal symptoms and conditionsfrom constipation and diarrhea to chronic acid re… [+4527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy", "title": "Fox News and Dominion spar in new legal filings - CNN", "description": "Dominion Voting Systems and Fox News traded barbs in new court filings Wednesday, with the election technology company accusing Fox of wanting a \"license to knowingly spread lies,\" and the right-wing channel claiming the lawsuit is an \"unprecedented assault o…", "url": "https://www.cnn.com/2023/03/08/media/fox-news-dominion-lawsuit-filing/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230308104920-01-fox-news-network-0206-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-08T22:49:00Z", "content": "Dominion Voting Systems and Fox News traded barbs in new court filings Wednesday, with the election technology company accusing Fox of wanting a license to knowingly spread lies, and the right-wing c… [+1979 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Niharika Singh, Niharika Singh", "title": "Google AI Introduces Universal Speech Model (USM): A Family of State-of-the-Art Speech Models with 2B Parameters Trained on 12 Million Hours of Speech and 28 Billion Sentences of Text - MarkTechPost", "description": "Self-supervised learning has recently made significant strides, ushering in a new age for voice recognition. In contrast to earlier studies, which mainly concentrated on enhancing the quality of monolingual models for widely used languages, 'universal' models…", "url": "https://www.marktechpost.com/2023/03/08/google-ai-introduces-universal-speech-model-usm-a-family-of-state-of-the-art-speech-models-with-2b-parameters-trained-on-12-million-hours-of-speech-and-28-billion-sentences-of-text/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/03/Screenshot-2023-03-08-at-7.56.19-AM.png", "publishedAt": "2023-03-08T15:59:14Z", "content": "Self-supervised learning has recently made significant strides, ushering in a new age for voice recognition.\r\nIn contrast to earlier studies, which mainly concentrated on enhancing the quality of mon… [+4658 chars]"}, {"source": {"id": null, "name": "Unwomen.org"}, "author": null, "title": "Statement: Defiant and steadfast for full equality in the digital world - UN Women", "description": "Women and girls have just as much right to access the digital world and prosper in it as men and boys. Their creativity, knowledge and perspectives can shape a future where technology contributes to transforming social norms, amplifying women’s voices, pushin…", "url": "https://www.unwomen.org/en/news-stories/statement/2023/03/statement-defiant-and-steadfast-for-full-equality-in-the-digital-world", "urlToImage": "https://www.unwomen.org/sites/default/files/2022-05/UN-Women-Executive-Director-Sima-Sami-Bahous-UN-Photo-Evan-Schneider-1200x800.jpg", "publishedAt": "2023-03-07T12:00:00Z", "content": "All over the world, womens and girls movements are defiant and steadfast in the face of regressive gender norms and pushback against their rights. Activists are raising their powerful voices for incl… [+2525 chars]"}]}