{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New resource could provide clues on the past, present, and future of clownfish - Science Daily", "description": "Researchers from the Okinawa Institute of Science and Technology Graduate University have produced a comprehensive genome of the false clownfish, which could be used to answer a myriad of biological questions.", "url": "https://www.sciencedaily.com/releases/2022/04/220408083852.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-08T14:44:37Z", "content": "Clownfish may have been made famous through the popular film Finding Nemo, but probably only a few people realize that these charismatic orange-and-white fish offer huge potential for scientific rese… [+4050 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "ProtonMail buys email alias startup SimpleLogin - TechCrunch", "description": "Proton, the startup behind the E2E encrypted webmail service ProtonMail, has acquired SimpleLogin, which offers a freemium service for creating email aliases.", "url": "https://techcrunch.com/2022/04/08/proton-buys-simplelogin/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-834609032.jpg?w=480", "publishedAt": "2022-04-08T14:05:39Z", "content": "Proton, the Geneva, Switzerland-based startup behind the eponymous E2E encrypted webmail service ProtonMail, has acquired French startup SimpleLogin, which offers a freemium, open-source service for … [+3935 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Britain's defence sector must focus on high-tech weapons that worked in Ukraine - The Telegraph", "description": "The UK already has one of the best defence industries in the world, and the market is up for grabs", "url": "https://www.telegraph.co.uk/business/2022/04/08/britains-defence-sector-must-focus-high-tech-weapons-have-worked/", "urlToImage": "https://www.telegraph.co.uk/content/dam/business/2022/04/08/TELEMMGLPICT000286532670_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?impolicy=logo-overlay", "publishedAt": "2022-04-08T14:00:00Z", "content": "Easy to operate shoulder-mounted missiles are taking out tanks. Stealthy drones that fly by night are destroying supply lines. And highly mobile, well trained small units have been wreaking havoc on … [+2337 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Particle Physics Shock: Most Precise Ever Measurement of W Boson Mass Differs From Standard Model Prediction - SciTechDaily", "description": "Most precise ever measurement of W boson mass to be in tension with the Standard Model. After 10 years of careful analysis and scrutiny, scientists of the CDF collaboration at the U.S. Department of Energy’s Fermi National Accelerator Laboratory announced on …", "url": "https://scitechdaily.com/particle-physics-shock-most-precise-ever-measurement-of-w-boson-mass-differs-from-standard-model-prediction/", "urlToImage": "https://scitechdaily.com/images/Particle-Collision-Neutrino-Concept.jpg", "publishedAt": "2022-04-08T12:31:27Z", "content": "Most precise ever measurement of W boson mass to be in tension with the Standard Model.\r\nAfter 10 years of careful analysis and scrutiny, scientists of the CDF collaboration at the U.S. Department of… [+8582 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Cadila Pharma launches three-dose rabies vaccine - Moneycontrol", "description": "The three-dose vaccine, named as 'ThRabis’, is a recombinant nano-particle based G protein vaccine which is prepared using Virus-like Particle technology, the company said in a release, adding that the three-dose schedule is spread over only one week.", "url": "https://www.moneycontrol.com/news/business/cadila-pharma-launches-three-dose-rabies-vaccine-8335341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Vaccine-770x433.jpg", "publishedAt": "2022-04-08T10:58:20Z", "content": "Pharmaceutical major Cadila Pharmaceuticals on Friday announced that it has developed the worlds first novel three-dose vaccine against rabies.\r\nThe three-dose vaccine, named as 'ThRabis, is a recomb… [+2108 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tesla Marks New Texas 'Gigafactory' Opening With Huge Cyber Rodeo Party - NDTV", "description": "Amidst fireworks, carnival games, music and futuristic technology, multi-billionaire Tesla CEO Elon Musk threw a grand invitation-only party for some 15,000 guests at the company's new billion-dollar-plus \"Gigafactory\" in Austin.", "url": "https://www.ndtv.com/world-news/tesla-marks-opening-of-new-texas-gigafactory-with-huge-cyber-rodeo-party-elon-musk-2870827", "urlToImage": "https://c.ndtvimg.com/2022-04/9qe9n1bs_elon-musk-tesla-afp_625x300_08_April_22.jpg", "publishedAt": "2022-04-08T10:34:00Z", "content": "Elon Musk said that plant would build ITS Cybertruck, Semi, Model 3 and Model Y sport utility vehicles.\r\nHouston: Amidst fireworks, carnival games, music and futuristic technology, multi-billionaire … [+3918 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Himani Jha", "title": "Spotify Car Thing rolls out new feature; know how to make your drive better - HT Tech", "description": "Spotify Car Thing now allows users to take and dismiss incoming calls, switch between media by presets, or voice, or simply tapping the screen.", "url": "https://tech.hindustantimes.com/tech/news/spotify-car-thing-rolls-out-new-feature-know-how-to-make-your-drive-better-71649404192712.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/08/1600x900/spotify_car_thing_1618345399604_1649405031104.jpg", "publishedAt": "2022-04-08T08:05:15Z", "content": "Spotify has announced a bunch of new features and control on its Car Thing. Spotify Car Thing is a $90 device launched in the US in February 2022. Its basically an infotainment system for cars. The m… [+1811 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "You could win a Vivobook Pro 15 OLED from just sharing a photo in the ASUS OLED & Creator Series contest - TechNave", "description": "Back in December 2021,&nbsp;ASUS Malaysia&nbsp;released the new&nbsp;Vivobook Pro 15 OLED&nbsp;and now there's an&nbsp;ASUS OLED &amp; Creator Series&nbsp;givea", "url": "https://technave.com/gadget/You-could-win-a-Vivobook-Pro-15-OLED-from-just-sharing-a-photo-in-the-ASUS-OLED-Creator-Series-contest-29500.html", "urlToImage": "https://technave.com/data/files/article/202204080656345026.jpg", "publishedAt": "2022-04-08T07:08:41Z", "content": "Back in December 2021, ASUS Malaysia released the new Vivobook Pro 15 OLED and now there's an ASUS OLED &amp; Creator Series giveaway contest. If you feel confident to win something, now here's your … [+1117 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "South Africa has abstained from a UN General Assembly resolution to suspend Russia from the Human Rights Council. Over R8 billion is needed to restore South Africa’s sewage and wastewater facilities. Health activists have taken legal action against the govern…", "url": "https://businesstech.co.za/news/government/575534/5-important-things-happening-in-south-africa-today-1257/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Naledi-Pandor-South-African-Minister-of-International-Relations-and-Cooperation-1.jpg", "publishedAt": "2022-04-08T06:14:49Z", "content": "Here’s what is happening in and affecting South Africa today:\r\n<ul><li>Abstained: South Africa has for the third time abstained from voting in a UN resolution on the Russian invasion of Ukraine – thi… [+2541 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Station Crew Preps for Spacewalks and Ax-1 Private Astronaut Mission - SciTechDaily", "description": "The seven-member Expedition 67 crew is gearing up for a pair of spacewalks scheduled for later this month while ensuring the International Space Station orbits Earth in tip-top shape. Meanwhile, the first private astronaut mission is less than one day from la…", "url": "https://scitechdaily.com/space-station-crew-preps-for-spacewalks-and-ax-1-private-astronaut-mission/", "urlToImage": "https://scitechdaily.com/images/Orbital-Sunrise-From-Space-Station-scaled.jpg", "publishedAt": "2022-04-08T04:26:23Z", "content": "An orbital sunrise is pictured from the space station beaming across Earth’s horizon revealing the silhouetted clouds above the South China Sea. Credit: NASA\r\nThe seven-member Expedition 67 crew is g… [+2234 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Abigail Ng", "title": "Chinese tech stocks in Hong Kong slip as investors watch Covid situation in China - CNBC", "description": "Shares in Asia-Pacific mostly declined on Friday after a comeback on Wall Street as investors continued to digest the Fed's plans to fight inflation.", "url": "https://www.cnbc.com/2022/04/08/asia-stocks-federal-reserve-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106816845-1609213716683-gettyimages-1229866474-JAPAN_JPX.jpeg?v=1649319771&w=1920&h=1080", "publishedAt": "2022-04-07T23:41:25Z", "content": "SINGAPORE Shares in Asia-Pacific were mixed on Friday, as Chinese tech shares slipped and investors watched the Covid situation in China.\r\nHong Kong's Hang Seng index fell 0.19%, while the Hang Seng … [+2765 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Putin's daughters, sanctioned by US, hidden from public eye - EWN", "description": "The US Treasury identified the daughters as Katerina Tikhonova, \"a tech executive whose work supports ... the Russian defense industry\" and Maria Vorontsova, who leads state-funded genetics research programs \"personally overseen by Putin.\"", "url": "https://ewn.co.za/2022/04/07/putin-s-daughters-sanctioned-by-us-hidden-from-public-eye", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/c3o93oittbsnlszu2b1t", "publishedAt": "2022-04-07T19:38:30Z", "content": "The US Treasury identified the daughters as Katerina Tikhonova, \"a tech executive whose work supports ... the Russian defense industry\" and Maria Vorontsova, who leads state-funded genetics research … [+2721 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Google’s new ‘multisearch’ feature lets you search using text and images at the same time - TechCrunch", "description": "Google announced today that it’s rolling out a new “multisearch” feature that allows users to search using text and images at the same time via Google Lens, the company’s image recognition technology. Google first teased the functionality last September at it…", "url": "https://techcrunch.com/2022/04/07/googles-multisearch-search-using-text-images/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/04/Multisearch-on-Lens_dress.png?w=709", "publishedAt": "2022-04-07T13:02:13Z", "content": "Google announced today that it’s rolling out a new “multisearch” feature that allows users to search using text and images at the same time via Google Lens, the companys image recognition technology.… [+3414 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s NHI is coming – whether you like it or not: government - BusinessTech", "description": "The Department of Health will not back down from plans to introduce a new National Health Insurance (NHI) scheme in South Africa, says director-general Dr Nicholas Crisp.", "url": "https://businesstech.co.za/news/government/575106/south-africas-nhi-is-coming-whether-you-like-it-or-not-government/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/NasrecFiledHospital-e1603263426991.jpg", "publishedAt": "2022-04-07T07:25:32Z", "content": "The Department of Health will not back down from plans to introduce the National Health Insurance (NHI) scheme in South Africa, says director-general Dr Nicholas Crisp.\r\nSpeaking to News24at a confer… [+3576 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom warning for South Africa - BusinessTech", "description": "Credit rating agency Moody’s has maintained its rating of Eskom at Caa1 with a negative outlook, warning that the power utility continues to be in a precarious position despite prolonged financial support.", "url": "https://businesstech.co.za/news/energy/575050/eskom-warning-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/07/Eskom.jpg", "publishedAt": "2022-04-07T05:54:23Z", "content": "Credit rating agency Moody’s has maintained its rating of Eskom at Caa1 with a negative outlook, warning that the power utility continues to be in a precarious position despite prolonged financial su… [+2998 chars]"}]}