{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Mars Streak Mystery Might Finally Be Solved – And It’s Not Great News - SciTechDaily", "description": "A sweeping machine learning study scanning over 86,000 high-res Mars images reveals that the mysterious streaks seen on Martian slopes are likely dry dust slides, not evidence of flowing water as previously hoped. Long debated as possible indicators of presen…", "url": "https://scitechdaily.com/?p=475993", "urlToImage": "https://scitechdaily.com/images/Streaks-on-Mars.jpg", "publishedAt": "2025-05-20T02:57:15Z", "content": "Thousands of odd streaks once thought to be signs of liquid water on Mars are likely just dust slipping downhill, according to a massive AI analysis. Credit: NASA\r\nA sweeping machine learning study s… [+5276 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "Apple approves Spotify update so US users can buy audiobooks within the app - TechCrunch", "description": "Spotify announced on Monday that Apple has approved a new app update, allowing iPhone users in the U.S. to purchase individual audiobooks directly within Spotify now allows iPhone users in the U.S. to purchase individual audiobooks directly within the app.", "url": "https://techcrunch.com/2025/05/19/apple-approves-spotify-update-so-us-users-can-buy-audiobooks-within-the-app/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1783835425-crop-e1717409949317.jpg?resize=1200,676", "publishedAt": "2025-05-19T21:09:21Z", "content": "Spotify announced on Monday that Apple has approved a new app update, allowing iPhone users in the U.S. to purchase individual audiobooks directly within the app. Users can also view audiobook prices… [+1259 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "GitHub, Microsoft embrace Anthropic’s spec for connecting AI models to data sources - TechCrunch", "description": "GitHub and Microsoft, GitHub's corporate parent, are joining the steering committee for MCP, Anthropic’s standard for connecting AI models to the systems where data resides.", "url": "https://techcrunch.com/2025/05/19/github-microsoft-embrace-anthropics-spec-for-connecting-ai-models-to-data-sources/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1785159335.jpg?resize=1200,800", "publishedAt": "2025-05-19T16:00:00Z", "content": "GitHub and Microsoft, GitHub’s corporate parent, are joining the steering committee for MCP, Anthropics standard for connecting AI models to the systems where data resides. \r\nThe announcement, which … [+2161 chars]"}]}