{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Spots a Galactic Powerhouse - SciTechDaily", "description": "This image shows the spiral galaxy NGC 3254, observed using Hubble's Wide Field Camera 3 (WFC3). WFC3 has the capacity to observe ultraviolet, visible, and near-infrared light, and this image is a composite of observations taken in the visible and infrared. I…", "url": "https://scitechdaily.com/hubble-spots-a-galactic-powerhouse/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-3254.jpg", "publishedAt": "2021-06-14T04:04:55Z", "content": "Hubble Space Telescope image of spiral galaxy NGC 3254. Credit: ESA/Hubble &amp; NASA, A. Riess et al.\r\nThis image shows the spiral galaxy NGC 3254, observed using Hubble’s Wide Field Camera 3 (WFC3)… [+1110 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple iOS 15 update brings useful multitasking feature for text, images from iPads: Here's how it works - HT Tech", "description": "iPads have supported the ability to drag and drop content across multiple apps for years – now the feature is likely to make its way to iPhones with iOS 15. Here's how it will work and how to use the feature.", "url": "https://tech.hindustantimes.com/mobile/news/apple-ios-15-update-brings-useful-multitasking-feature-for-text-images-from-ipads-here-s-how-it-works-71623616661522.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/06/13/1600x900/david-grandmougin-cfV8CtFQyjs-unsplash_1616311037333_1623616910820.jpg", "publishedAt": "2021-06-14T02:00:17Z", "content": "Just a week ago, Apple took the wraps off iOS 15, the latest version of the companys mobile operating system that was coming to recent as well as older devices later this year. Now that developers ha… [+2526 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Daniel Hurst", "title": "Scott Morrison inks G7 deals with Japan and Germany to develop lower-emissions technology - The Guardian", "description": "PM resists pressure to commit Australia to 2050 climate deadline as he talks up hydrogen, LNG and carbon capture and storage", "url": "https://amp.theguardian.com/australia-news/2021/jun/14/scott-morrison-inks-g7-deals-with-japan-and-germany-to-develop-lower-emissions-technology", "urlToImage": null, "publishedAt": "2021-06-13T22:02:00Z", "content": "Australian foreign policyPM resists pressure to commit Australia to 2050 climate deadline as he talks up hydrogen, LNG and carbon capture and storage \r\nScott Morrison has inked deals with Japan and G… [+6264 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Technology Gives Scientists Better Ways to Follow Birds - VOA Learning English", "description": "Using the International Space Station and the Argos Satellite along with very small devices, scientists can now learn where little songbirds go throughout the year.", "url": "https://learningenglish.voanews.com/a/technology-gives-scientists-better-ways-to-follow-birds/5924851.html", "urlToImage": "https://gdb.voanews.com/2605A498-75CF-49F6-AD21-956ED33E975B_w1200_r1.jpg", "publishedAt": "2021-06-13T21:55:04Z", "content": "A well-fed songbird jumps around in grass near Washington, D.C. On its back it carries a very small, lightweight electronic device called a tag. The bird, a robin, sees an insect nearby. The bird att… [+4890 chars]"}, {"source": {"id": null, "name": "Evening Standard"}, "author": "Barney Davis", "title": "‘We’re proud to be British’ Andrew Neil launches GB News with some technical difficulties - Evening Standard", "description": "Andrew Neil has launched his new GB News channel to introduce his “anti-woke” co-stars saying “we’re proud to be British - the clue is in the name”.", "url": "https://www.standard.co.uk/news/uk/gb-news-andrew-neil-launch-dan-wooten-b940381.html", "urlToImage": "https://static.standard.co.uk/2021/06/13/20/newFile-1.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2021-06-13T21:27:24Z", "content": "Andrew Neil has launched his new GB News channel to introduce his anti-woke co-stars saying were proud to be British - the clue is in the name.\r\nThe chairman of the new channel told viewers that GB N… [+3402 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "The Canadian Press", "title": "Canada's vaccine contracts allow for doses to be donated, in some cases resold - Ottawa Citizen", "description": "OTTAWA — Canada paid a premium to get more than 250,000 doses of the Pfizer-BioNTech vaccine delivered last December, weeks earlier than planned.", "url": "https://nationalpost.com/pmn/news-pmn/canada-news-pmn/canadas-vaccine-contracts-allow-for-doses-to-be-donated-in-some-cases-resold", "urlToImage": null, "publishedAt": "2021-06-12T16:38:08Z", "content": "Article content\r\nOTTAWA Canada paid a premium to get more than 250,000 doses of the Pfizer-BioNTech vaccine delivered last December, weeks earlier than planned.\r\nThe detail is contained in heavily re… [+6639 chars]"}]}