{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 latest breathtaking images of galaxies, nebulae, dwarf stars and black holes shared by NASA - HT Tech", "description": "Top 5 latest breathtaking images of galaxies nebulae dwarf stars and black holes shared by NASA NASA has shared stunning new images of celestial wonders captured by the Hubble Space Telescope showcasing spiral galaxies nebulae and black holes revealing the un…", "url": "https://tech.hindustantimes.com/web-stories/top-5-latest-breathtaking-images-of-galaxies-nebulae-dwarf-stars-and-black-holes-shared-by-nasa-71716705965837.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/26/1600x900/NASA_1716706004117_1716706058890.jpg/", "publishedAt": "2024-05-27T08:23:57Z", "content": "Photo Credit: NASA\r\n NASA has shared stunning new images of celestial wonders captured by the Hubble Space Telescope, showcasing spiral galaxies, nebulae, and black holes, revealing the universe's be… [+1859 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Elon Musk's xAI raises $6B from Valor, a16z, and Sequoia - TechCrunch", "description": "Elon Musk's AI startup, xAI, has raised $6 billion in a new funding round, it said today, in one of the largest deals in the red-hot nascent space, as he Elon Musk's AI startup, xAI, has raised $6 billion in a new funding round in one of the largest deals in …", "url": "https://techcrunch.com/2024/05/26/elon-musks-xai-raises-6b-from-valor-a16z-and-sequoia/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/04/GettyImages-2147789850.jpg?resize=1200,800", "publishedAt": "2024-05-27T06:57:59Z", "content": "Elon Musk’s AI startup, xAI, has raised $6 billion in a new funding round, it said today, in one of the largest deals in the red-hot nascent space, as he shores up capital to aggressively compete wit… [+2272 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Akash Dutta, Siddharth Suvarna", "title": "Apple Could Add AI-Powered Emoji Generation, App Icon Customisation With iOS 18: Report - Gadgets 360", "description": "Apple is reportedly planning some major new introductions for the iPhone with the iOS 18 update. The Cupertino-based tech giant is expected to unveil the new operating system at the Worldwide Developers Conference (WWDC) 2024 event, scheduled for June 10. A n…", "url": "https://www.gadgets360.com/mobiles/news/apple-ios-18-ai-generated-emoji-app-icon-customisation-wwdc-2024-report-5754459", "urlToImage": "https://i.gadgets360cdn.com/large/iphone4_1716788945642.jpg", "publishedAt": "2024-05-27T06:21:10Z", "content": "Apple is reportedly planning some major new introductions for the iPhone with the iOS 18 update. The Cupertino-based tech giant is expected to unveil the new operating system at the Worldwide Develop… [+2263 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "China's premier to hold rare summit with US - allied South Korea, Japan - Moneycontrol", "description": "Chinese Premier Li Qiang, South Korean President Yoon Suk Yeol, and Japanese Prime Minister Fumio Kishida will adopt a joint statement on six areas including the economy and trade, science and technology, people-to-people exchanges and health and the aging po…", "url": "https://www.moneycontrol.com/news/world/chinas-premier-to-hold-rare-summit-with-us-allied-south-korea-japan-12732489.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/us-china-cold-war-flag.jpg", "publishedAt": "2024-05-27T00:44:15Z", "content": "Leaders from China, Japan, and South Korea will meet for the first three-way talks in four years on Monday in Seoul, as they try to revive trade and security dialogues hampered by global tensions.\r\nC… [+1825 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "mRNA vaccine technology changes cancer treatment landscape, offering promising potential beyond COVID-19 - MENAFN.COM", "description": "(MENAFN) The COVID-19 pandemic has served as a pivotal proving ground for the efficacy of messenger RNA (mRNA) vaccines in combating viral", "url": "https://menafn.com/1108258655/mRNA-vaccine-technology-changes-cancer-treatment-landscape-offering-promising-potential-beyond-COVID-19", "urlToImage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_PharmaHealth_65.jpg", "publishedAt": "2024-05-26T13:21:46Z", "content": "(MENAFN) The COVID-19 pandemic has served as a pivotal proving ground for the efficacy of messenger RNA (mRNA) vaccines in combating viral outbreaks. However, the pioneers behind this revolutionary t… [+2894 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Another report hints at the Galaxy Ring, Z Fold 6 and Z Flip 6 launch date - TechRadar", "description": "A lot of devices are incoming", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/another-report-hints-at-the-galaxy-ring-z-fold-6-and-z-flip-6-launch-date", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pi9qW9ak6miZWXkNMPz43E-1200-80.jpg", "publishedAt": "2024-05-26T09:30:09Z", "content": "Samsung is expected to launch a whole host of new devices in the near future, and a previous leak suggested July 10 would be the day of the grand unveiling. Now a second report has mentioned the same… [+1962 chars]"}]}