{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "CNET"}, "author": null, "title": "Cyber Monday 2023 Live Blog: Over 170 Early Deals to Shop Right Now - CNET", "description": "The deals keep rolling in, with thousands of Cyber Monday savings on tech, home goods, everyday essentials and much, much more.", "url": "https://www.cnet.com/deals/cyber-monday-2023-live-ongoing/", "urlToImage": "https://www.cnet.com/a/img/resize/f2c6c4412bbe5874175fe06a97c7d65a062bedbb/hub/2023/11/22/28c57259-0308-4d06-a541-b2c08bc0bded/1-copy-2.png?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2023-11-27T00:43:39Z", "content": "Black Friday has come and gone, but the Cyber Monday deals are already here, and they're some of the best bargains we've seen so far. Our dedicated team of more than a dozen shopping experts and deal… [+19630 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Surprise: Plants Might Be Able To Absorb More CO2 Than Expected - SciTechDaily", "description": "A new study reveals that plants might absorb more CO2 than expected, offering hope in combating climate change. However, reducing emissions remains crucial, as planting trees alone isn't a sufficient solution. New research published on November 17 in Science …", "url": "https://scitechdaily.com/natures-surprise-plants-might-be-able-to-absorb-more-co2-than-expected/", "urlToImage": "https://scitechdaily.com/images/Forest-Absorbs-Carbon-Dioxide-Like-Lungs-Concept-Art.jpg", "publishedAt": "2023-11-26T21:19:55Z", "content": "ByTrinity College DublinNovember 26, 2023\r\nRecent research indicates that plants could absorb more atmospheric CO2 than previously believed, providing a hopeful perspective on climate change mitigati… [+6390 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moonbound Majesty: Astronauts' Inside Look at SLS, the Engine of Artemis Dreams - SciTechDaily", "description": "Artemis II astronauts, preparing for a lunar mission, examined the powerful SLS core stage, reflecting NASA's ongoing efforts to return to and explore the Moon. Artemis II NASA astronauts Reid Wiseman and Christina Koch of NASA, and CSA (Canadian Space Agency…", "url": "https://scitechdaily.com/moonbound-majesty-astronauts-inside-look-at-sls-the-engine-of-artemis-dreams/", "urlToImage": "https://scitechdaily.com/images/Artemis-II-Astronauts-View-SLS-at-NASA-Michoud-scaled.jpg", "publishedAt": "2023-11-26T20:09:12Z", "content": "ByNASA Marshall Space Flight CenterNovember 26, 2023\r\nNASA and CSA astronauts inspected the Space Launch Systems core stage, vital for the upcoming Artemis II mission. The visit marked a year since A… [+4876 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 671 answer for November 26: Twice the trouble! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 671 answer for November 26: Today’s puzzle is filled with words that have repeated letters within them. It is a very tricky puzzle. Solve it using our Quordle hints, clues and solutions.", "url": "https://tech.hindustantimes.com/tech/news/quordle-671-answer-for-november-26-twice-the-trouble-check-quordle-hints-clues-solutions-71701021798758.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/26/1600x900/quordle_1654498442093_1701021864029.webp", "publishedAt": "2023-11-26T18:05:58Z", "content": "Quordle 671 answer for November 26: After a long time, Quordle has come out all guns blazing. We have not seen a puzzle this difficult in weeks and it sure threw us off-guard at first. We predict a l… [+1852 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Tata Technologies IPO: Check share allotment and listing dates, grey market premium - Moneycontrol", "description": "Tata Technologies IPO: The company is expected to finalise the basis of allotment of IPO shares by November 28.", "url": "https://www.moneycontrol.com/news/business/ipo/tata-technologies-ipo-check-share-allotment-and-listing-dates-grey-market-premium-11813781.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/TataTechnologies2-770x433.jpg", "publishedAt": "2023-11-26T11:59:44Z", "content": "After receiving an amazing response to the IPO from across categories of investors last week, all eyes will now be on the share allotment by Tata Technologies, the subsidiary of Tata Motors. The comp… [+3966 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Mahmoud Ghorbel, Mahmoud Ghorbel", "title": "This AI Research Proposes Random Slices Mixing Data Augmentation (RSMDA) for Superior Image Classification: A Novel Approach to Enhancing Neural Network Accuracy and Robustness - MarkTechPost", "description": "Data augmentation is a critical technique in deep learning that involves creating new training data by modifying existing samples. It is essential because it diversifies the training data, improving the model's ability to generalize to new, unseen examples. C…", "url": "https://www.marktechpost.com/2023/11/25/this-ai-research-proposes-random-slices-mixing-data-augmentation-rsmda-for-superior-image-classification-a-novel-approach-to-enhancing-neural-network-accuracy-and-robustness/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/11/applsci-13-01711-g002.png", "publishedAt": "2023-11-25T20:55:06Z", "content": "Data augmentation is a critical technique in deep learning that involves creating new training data by modifying existing samples. It is essential because it diversifies the training data, improving … [+4760 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Science Made Simple: What Is the Theory of Relativity? - SciTechDaily", "description": "What Is the Theory of Relativity? Relativity is two related theories: special relativity, which explains the relationship between space, time, mass, and energy; and general relativity, which describes how gravity fits into the mix. Albert Einstein proposed th…", "url": "https://scitechdaily.com/science-made-simple-what-is-the-theory-of-relativity/", "urlToImage": "https://scitechdaily.com/images/Theory-of-Relativity-Physics-Concept.jpg", "publishedAt": "2023-11-25T08:35:35Z", "content": "ByU.S. Department of EnergyNovember 25, 2023Relativity, comprising Albert Einsteins theories of special and general relativity, revolutionized our understanding of space, time, mass, energy, and grav… [+5367 chars]"}]}