{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Have a home in any cricket centre? List it on MakeMyTrip; big surge seen in homestays - HT Tech", "description": "MakeMyTrip is planning to capitalize on the upcoming cricket season that is expected to bring loads of fans to various cities by increasing the inventory of homestay properties across these cricketing venues.", "url": "https://tech.hindustantimes.com/tech/news/have-a-home-in-any-cricket-centre-list-it-on-makemytrip-big-surge-seen-in-homestays-71688643770534.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/oanh-mj-XFKr7Fphwgs-unsplash_1688643924074_1688643928557.jpg", "publishedAt": "2023-07-06T11:51:11Z", "content": "For Indians, cricket is not just a game but a deep-rooted passion that can be seen whenever the Men in Blue play or for that matter when IPL tournament takes place. Whenever given the opportunity, di… [+2542 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Study Shakes Up Established Views on Mountain Formation - SciTechDaily", "description": "New research led by Colorado State University indicates the answers to how and why mountains form are buried deeper than once thought. \"Mountain building is a fundamental process of how Earth behaves,” said Sean Gallen, lead author and CSU assistant professor…", "url": "https://scitechdaily.com/groundbreaking-study-shakes-up-established-views-on-mountain-formation/", "urlToImage": "https://scitechdaily.com/images/Green-Mysterious-Mountain.jpg", "publishedAt": "2023-07-06T08:44:02Z", "content": "A new study suggests that the formation of mountains, particularly in subduction zones like southern Italy, might be significantly influenced by the descension of a tectonic plate through Earths mant… [+4697 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "AWESOME! NASA will let you engrave your name on the historic Europa Clipper spacecraft for FREE - HT Tech", "description": "Grab an amazing opportunity to have your name engraved on a NASA spacecraft heading to Jupiter’s Europa moon as part of the Message in a Bottle project. Here’s how.", "url": "https://tech.hindustantimes.com/tech/news/awesome-nasa-will-let-you-engrave-your-name-on-the-historic-europa-clipper-spacecraft-for-free-71688626883804.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/space_exploratory_missions_1688627236743_1688627236978.jpeg", "publishedAt": "2023-07-06T07:09:42Z", "content": "NASA has several space exploratory missions to planets such as Mars and Jupiter in place, and now the space agency is offering a unique opportunity for the public to have their name etched on a NASA … [+2504 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "TechRadar special report - TechRadar", "description": "Major survey reveals surprising changes in consumer tech buying habits", "url": "https://www.techradar.com/tech/techradar-special-report-tech-fans-are-choosing-gadgets-over-netflix-and-socializing", "urlToImage": "https://cdn.mos.cms.futurecdn.net/HDkqTHXaeuFr3gsZsQf4Q7-1200-80.jpg", "publishedAt": "2023-07-06T05:30:00Z", "content": "Most technology fans think buying gadgets is more important than subscribing to streaming services like Netflix and socializing, a major new TechRadar survey has revealed.\r\nThe in-depth survey, condu… [+17731 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid warning! Aircraft-sized space rock approaching Earth at fearsome speed TODAY - HT Tech", "description": "Asteroids have been threatening Earth with extremely close approaches recently, and now another one is set to pass the planet today. Know its speed, distance, size, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-warning-aircraft-sized-space-rock-approaching-earth-at-fearsome-speed-today-71688618848435.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/ygy_1637905928669_1688618998360.jpg", "publishedAt": "2023-07-06T04:50:30Z", "content": "Asteroids have the potential to cause armageddon on Earth, especially if they crash in a densely populated area. To counter this very threat to life, space agencies keep developing technology for ast… [+2314 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "OPPO Reno10 Pro+ Review: The Perfect Blend of Art and Technology - Pandaily", "description": "OPPO’s Reno series has always been focusing on stylish designs and good camera systems for daily photos and portraits, and the Reno10 Pro+ is no different. I...", "url": "https://www.youtube.com/watch?v=7IrPtr5cDaU", "urlToImage": "https://i.ytimg.com/vi/7IrPtr5cDaU/maxresdefault.jpg", "publishedAt": "2023-07-06T03:30:01Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers discover unique blood plasma protein patterns in patients with long COVID - Medical Xpress", "description": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID that could improve patient outcomes. This research, which used…", "url": "https://medicalxpress.com/news/2023-07-unique-blood-plasma-protein-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fatigue-1.jpg", "publishedAt": "2023-07-05T14:07:50Z", "content": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID th… [+4047 chars]"}]}