{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Google Drive users say Google lost their files; Google is investigating - Ars Technica", "description": "Google tells users to not delete local Drive profile data while it investigates.", "url": "https://arstechnica.com/gadgets/2023/11/google-drive-is-investigating-sync-issues-as-users-complain-of-lost-files/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/07/Google-Drive-760x380.jpg", "publishedAt": "2023-11-28T19:05:30Z", "content": "87 with \r\nDid Google Drive lose some people's data? That's the question swirling around the Internet right now as Google announces it's investigating \"sync issues\" for Google Drive for desktop. On Mo… [+3899 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "Sai Aravindh", "title": "Tata Technologies, FedBank Financial Services, Gandhar Oil To List On Nov. 30 - BQ Prime", "description": "The four issues saw stellar demand from investors, with over Rs 2.01 lakh crore in investor money locked up in the IPOs.", "url": "https://www.bqprime.com/business/tata-technologies-fedbank-financial-services-gandhar-oil-to-list-on-nov-30", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2023-11%2F309be0bd-d336-484b-9788-427d81851a0a%2Fmarkus_winkler_IrRbSND5EUc_unsplash.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-11-28T13:26:13Z", "content": "The much-awaited listing of Tata Technologies Ltd. is scheduled to go live on the exchanges on Nov. 30. \r\nAlong with Tata Technologies, FedBank Financial Services Ltd. and Gandhar Oil Refinery (India… [+586 chars]"}, {"source": {"id": null, "name": "Geospatial World"}, "author": "Jeffy Jacob", "title": "Geospatial Technologies for Disaster Management: A Data-Driven Approach - Geospatial World", "description": "At the AGI GeoResilience Symposium, Dr. Mrutunjay Mohapatra, Director General of Meteorology at IMD, emphasized the critical role of high-resolution geospatial data in disaster management. He stated, \"We have the framework but need better data.\"", "url": "https://www.geospatialworld.net/news/data-driven-approach-disaster-mitigation/", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2023/11/MicrosoftTeams-image-138.jpg", "publishedAt": "2023-11-28T10:43:53Z", "content": "In today’s world, where natural disasters are becoming increasingly frequent and severe, the need for effective disaster management strategies is more crucial than ever. Geospatial technologies, such… [+4405 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Jinit Parmar", "title": "PSBs hiring senior tech experts in bid to ramp up cybersecurity - Moneycontrol", "description": "The increasing number of digital transactions has made it necessary for banks to put stringent cybersecurity measures in place. Banks such as SBI, Bank of Maharashtra and IOB are hiring senior technical experts to put systems in place, to avoid a recurrence o…", "url": "https://www.moneycontrol.com/news/business/psbs-hiring-senior-tech-experts-in-bid-to-ramp-up-cybersecurity-11820781.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/cyber-attack2.jpg", "publishedAt": "2023-11-28T08:57:59Z", "content": "Public sector banks (PSBs) are looking to hire tech and cyber security specialists after the recent issues in the digital banking services of some PSBs, three top bankers told Moneycontrol.\r\nAfter th… [+4396 chars]"}]}