{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Unity U-turns on controversial runtime fee and begs forgiveness - TechCrunch", "description": "Unity has done a 180 on a controversial new pricing scheme that users of its cross-platform game engine almost unanimously disparaged.", "url": "https://techcrunch.com/2023/09/22/unity-u-turns-on-controversial-runtime-fee-and-begs-forgiveness/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/09/unity-logo.jpeg?resize=1200,675", "publishedAt": "2023-09-22T18:55:54Z", "content": "Unity has done a 180 on a controversial new pricing scheme that users of its cross-platform game engine almost unanimously disparaged. A new pricing policy is still incoming, but it’s far less fraugh… [+2486 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Settlement and Innovation 476,000 Years Ago: Archaeologists Discover World's Oldest Wooden Structure - SciTechDaily", "description": "Research from the University of Liverpool and Aberystwyth University reveals humans were constructing wooden structures 476,000 years ago at Kalambo Falls, Zambia. This discovery, dated using advanced techniques, highlights the early human capability to settl…", "url": "https://scitechdaily.com/settlement-and-innovation-476000-years-ago-archaeologists-discover-worlds-oldest-wooden-structure/", "urlToImage": "https://scitechdaily.com/images/Uncovering-Wooden-Structure.jpg", "publishedAt": "2023-09-22T08:27:09Z", "content": "ByUniversity of LiverpoolSeptember 22, 2023\r\nProfessor Larry Barham (pictured, right) uncovering the wooden structure on the banks of the river with a fine spray. Credit: Professor Geoff Duller, Aber… [+5867 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Bernard Marr", "title": "Generative AI Is Breathing New Life Into Classic Computer Games - Forbes", "description": "Revolution Software leverages generative AI technology to revitalize classic computer games, enhancing graphics and gameplay to introduce a new generation of gamers to old favorites", "url": "https://www.forbes.com/sites/bernardmarr/2023/09/22/generative-ai-is-breathing-new-life-into-classic-computer-games/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/650d264d7512de65ddc7771f/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-09-22T05:30:45Z", "content": "Generative AI has the potential to revolutionize every creative industry, and the gaming industry is no exception. Game worlds are getting richer, more immersive, and in many ways closer to being sim… [+7081 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Vishal Upadhyay", "title": "Microsoft launches surface laptops, Windows 11 update with AI-powered copilot feature, and more | Technology News - India TV News", "description": "The announcement also highlighted updates in Bing and Edge. Bing Chat Enterprise will receive upgrades, including support for multimodal visual search, while Image Creator will be available in the Microsoft Edge mobile app.", "url": "https://www.indiatvnews.com/technology/news/microsoft-surface-event-windows-11-update-new-surface-laptops-binge-edge-upgrades-and-more-2023-09-22-894046", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/09/microsofttt-1695352066.jpg", "publishedAt": "2023-09-22T03:19:04Z", "content": "Microsoft's Chairman and CEO, Satya Nadella, in Surface Event emphasised the pivotal role of generative AI in the company's product lineup. This push begins with the upcoming release of Windows 11, f… [+1924 chars]"}]}