{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: President's Budget, New Moon Mission Spacesuit, Crew-5 Back on Earth - SciTechDaily", "description": "The President’s Budget Request for NASA … Crew-5 is safely back on Earth … And a look at a possible Moon mission spacesuit … A few of the stories to tell you about – This Week at NASA! https://youtu.be/KCZx6uRJR-o The President’s Budget Request for NASA The B…", "url": "https://scitechdaily.com/?p=261328", "urlToImage": "https://scitechdaily.com/images/SpaceX-Starship-Human-Lunar-Lander-scaled.jpg", "publishedAt": "2023-03-19T22:43:32Z", "content": "ByNASAMarch 19, 2023\r\nIllustration of SpaceX Starship human lander design that will carry the first NASA astronauts to the surface of the Moon under the Artemis program. NASAs new budget includes $8.… [+4211 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss Eclipses: NASA Releases New Map of Upcoming Solar Eclipses - SciTechDaily", "description": "Where will you be for the 2023 and 2024 solar eclipses in the United States? NASA has released a new map that could help you decide. Based on observations from several NASA missions, the map details the path of the Moon’s shadow as it crosses the contiguous U…", "url": "https://scitechdaily.com/?p=261604", "urlToImage": "https://scitechdaily.com/images/Moon-Appearance-November-2022-Total-Lunar-Eclipse.gif", "publishedAt": "2023-03-19T21:22:28Z", "content": "ByVanessa Thomas, NASAs Goddard Space Flight CenterMarch 19, 2023\r\nThe appearance of the Moon during the November 2022 total lunar eclipse. NASA has released a new map that details the 2023 and 2024 … [+9845 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Perspective on the Fundamental Structure of the Universe - SciTechDaily", "description": "The universe is peppered with galaxies, which, on large scales, exhibit a filamentary pattern, referred to as the cosmic web. This heterogeneous distribution of cosmic material is in some ways like blueberries in a muffin where material clusters in certain ar…", "url": "https://scitechdaily.com/new-perspective-on-the-fundamental-structure-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Perspective-on-Universe-Structure.jpg", "publishedAt": "2023-03-19T17:37:46Z", "content": "ByInstitute for Advanced StudyMarch 19, 2023\r\nResearchers have used simulations to investigate the cosmic web, the filamentary pattern of galaxies that exists on large scales throughout the universe.… [+7671 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lance Ulanoff", "title": "Siri can't beat ChatGPT unless Apple breaks its own rules - TechRadar", "description": "Opinion: The one thing that's most important to Apple", "url": "https://www.techradar.com/opinion/siri-cant-beat-chatgpt-unless-apple-breaks-its-own-rules", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cQN5rxJTRtg46QzL7fhuHg-1200-80.jpg", "publishedAt": "2023-03-19T17:00:46Z", "content": "I''ve known Siri, Apple's voice assistant, for almost a dozen years, and yet I still can't recall a single meaningful conversation we've had. Conversely, ChatGPT and I have known each other for six m… [+4838 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iOS 16.4 update is on the way! Check benefits for your iPhone! - HT Tech", "description": "iOS 16.4 update is on the way Check benefits for your iPhone iOS 16.4 update release date has still not been declared but iPhone users have been anticipating this update for quite some time and it is likely very soon. Unsplash The expected iOS 16.4 release da…", "url": "https://tech.hindustantimes.com/web-stories/ios-16-4-update-is-on-the-way-check-benefits-for-your-iphone-71679224511678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/HT_Tech_1679225023193_1679225056883_1679225056883.jpg/", "publishedAt": "2023-03-19T11:30:51Z", "content": "iOS 16.4 update release date has still not been declared, but iPhone users have been anticipating this update for quite some time and it is likely very soon. (Unsplash)\r\nThe expected iOS 16.4 release… [+1468 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study Shows Healthy Dogs and Cats Can Transmit Dangerous Microbes to Humans – And Vice Versa - SciTechDaily", "description": "Multi-drug-resistant organisms can be transmitted between healthy dogs and cats and their hospitalized owners. Fortunately, only a small number of cases were found suggesting pets are not a major source of antibiotic-resistant infections in hospital patients.…", "url": "https://scitechdaily.com/study-shows-healthy-dogs-and-cats-can-transmit-dangerous-microbes-to-humans-and-vice-versa/", "urlToImage": "https://scitechdaily.com/images/Veterinarians-Masks-Checking-Dog.jpg", "publishedAt": "2023-03-19T09:57:56Z", "content": "BySciTechDailyMarch 19, 2023\r\nHealthy dogs and cats may be transmitting multidrug-resistant organisms (MDROs) to their hospitalized owners, while humans could also be passing these microbes to their … [+5888 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14 Gudi Padwa offer rolled out on Maple; Get Rs. 8000 instant discount - HT Tech", "description": "You can grab amazing offers on iPhone 14, iPhone 14 Plus, and iPhone 14 Pro models on Maple till March 31. Check details here.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-gudi-padwa-offer-rolled-out-on-maple-get-rs-8000-instant-discount-71679216893102.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/2_1677833039942_1679216955411_1679216955411.jpg", "publishedAt": "2023-03-19T09:18:39Z", "content": "Maple has announced a special offer on the iPhone 14, iPhone 14 Plus and iPhone 14 Pro in celebration of the upcoming festival of Gudi Padwa. You can avail the offers from March 15 to March 31, 2023.… [+1418 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "Mirai Solar harnesses green energy to power greenhouses - The Rahnuma Daily", "description": "(RAHNUMA):Mirai Solar, a solar technology startup of King Abdullah University of Science and Technology, is disrupting the greenhouse market by developing foldable roof shades that not only prevent fruits, vegetables and flowers from extreme sunlight but also…", "url": "https://www.therahnuma.com/mirai-solar-harnesses-green-energy-to-power-greenhouses/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2023/03/16-20.jpg", "publishedAt": "2023-03-18T13:58:14Z", "content": "Founding team of Mirai Solar, from left, inside the KAUST Solar Center labs: Emmanuel Van Kerschaver, Michael Salvador, Tom Allen, Michele de Bastiani, Ahmed Balawi.\r\n(RAHNUMA):Mirai Solar, a solar t… [+5605 chars]"}]}