{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Corey Gaskin", "title": "Our 22 favorite desk accessories for a more organized and comfy workplace - Ars Technica", "description": "We tested foot rests, chargers, and other desk gear to make your workday easier.", "url": "https://arstechnica.com/gadgets/2021/11/best-home-office-accessories-for-desk/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/09/Ars-WFH-Office-Setup-Vari-Standing-Desk-4-760x380.jpg", "publishedAt": "2021-11-01T15:45:26Z", "content": "Enlarge/ Your home office can always use some sprucing up, especially when it's your main place of work.\r\n31 with 27 posters participating\r\nRecently, I've gotten really into ergonomics. Since the pan… [+7180 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Novavax submits COVID-19 vaccine for approval by Health Canada - CTV News", "description": "Biotechnology company Novavax Inc. says it has submitted its COVID-19 vaccine for approval in Canada. The U.S. company says it has now completed the submission of all modules required by Health Canada for the regulatory evaluation of its protein-based COVID-1…", "url": "https://www.ctvnews.ca/health/coronavirus/novavax-submits-covid-19-vaccine-for-approval-by-health-canada-1.5646791", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5577011.1631110098!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-11-01T14:41:40Z", "content": "GAITHERSBURG, MD. -- \r\nBiotechnology company Novavax Inc. says it has submitted its COVID-19 vaccine for approval in Canada.\r\nThe U.S. company says it has now completed the submission of all modules … [+602 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Runjhun Sharma", "title": "Bharat Biotech Submits Additional Data on Covaxin to WHO Ahead of Crucial Nov 3 Meet on EUL - News18", "description": "WHO had sought immunogenicity data for those above 60 years, and gender-wise split data on immunogenicity and efficacy of Covaxin.", "url": "https://www.news18.com/news/india/bharat-biotech-submits-additional-data-on-covaxin-to-who-ahead-of-crucial-nov-3-meet-4391333.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/covaxin-1-163153659516x9.jpg", "publishedAt": "2021-11-01T13:50:00Z", "content": "Hyderabad-based Bharat Biotech has submitted additional data sought by the World Health Organisations (WHO) technical advisory group ahead of the final assessment to be conducted on November 3, CNN-N… [+1979 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Using Microbes To Make Martian Rocket BioFuel on Mars - SciTechDaily", "description": "A new study outlines a biotechnology process to produce rocket fuel on red planet. Researchers at the Georgia Institute of Technology have developed a concept that would make Martian rocket fuel, on Mars, that could be used to launch future astronauts back to…", "url": "https://scitechdaily.com/using-microbes-to-make-martian-rocket-biofuel-on-mars/", "urlToImage": "https://scitechdaily.com/images/Mars-Exploration-Base.jpg", "publishedAt": "2021-11-01T13:43:52Z", "content": "ByGeorgia Institute of TechnologyNovember 1, 2021\r\nA new study outlines a biotechnology process to produce rocket fuel on red planet.\r\nResearchers at the Georgia Institute of Technology have develope… [+7511 chars]"}, {"source": {"id": null, "name": "Chipdesignmag.com"}, "author": "nirav", "title": "CRISPR and CAS Gene Market Detailed In New Research Report 2021 | Thermo Fisher Scientific, Merck KGaA (Sigma-Aldrich), OriGene Technologies – Chip Design Magazine - Chip Design Magazine", "description": "Request Here Sample ReportBuy This Complete Business ReportThe CRISPR and CAS Gene Market report contains historical data, current market trends, the environment, technological innovation, upcom", "url": "https://chipdesignmag.com/crispr-and-cas-gene-market-detailed-in-new-research-report-2021-thermo-fisher-scientific-merck-kgaa-sigma-aldrich-origene-technologies/", "urlToImage": null, "publishedAt": "2021-11-01T08:07:01Z", "content": "Request Here Sample ReportBuy This Complete Business Report\r\nThe CRISPR and CAS Gene Market report contains historical data, current market trends, the environment, technological innovation, upcoming… [+4669 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "TCS, Celcom partner for large-scale digital transformation - The Star Online", "description": "KUALA LUMPUR: Tata Consultancy Services (TCS), a leading global information technology (IT) service provider, is expanding its partnership with Celcom Axiata Bhd (Celcom) for large-scale transformation of core business support systems using TCS platforms host…", "url": "https://www.thestar.com.my/business/business-news/2021/11/01/tcs-celcom-partner-for-large-scale-digital-transformation", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/01/1352720.jpg", "publishedAt": "2021-11-01T06:31:00Z", "content": "KUALA LUMPUR: Tata Consultancy Services (TCS), a leading global information technology (IT) service provider, is expanding its partnership with Celcom Axiata Bhd (Celcom) for large-scale transformati… [+1767 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": null, "title": "NASA prepares for planetary defense demonstration mission - Techstory", "description": "To be launched by SpaceX, NASA prepares for the planetary defense demonstration mission.", "url": "https://techstory.in/nasa-prepares-for-planetary-defense-demonstration-mission/", "urlToImage": "https://techstory.in/wp-content/uploads/2021/11/900_DART_still-revisedA_1600.jpg", "publishedAt": "2021-11-01T03:23:44Z", "content": "To be launched by SpaceX, NASA prepares for the planetary defense demonstration mission. With Double Asteroid Redirection Test(DART) NASA will launch their debut demo flight. Which will test the tech… [+1613 chars]"}, {"source": {"id": null, "name": "Newshub"}, "author": null, "title": "Review: GoCube adds an excellent tech twist on classic Rubik's Cube puzzle - Newshub", "description": "It's a new take on an old favourite, so is the technology worth the increase price?", "url": "https://www.newshub.co.nz/home/technology/2021/11/review-gocube-adds-an-excellent-tech-twist-on-classic-rubik-s-cube-puzzle.html", "urlToImage": "https://www.newshub.co.nz/home/technology/2021/11/review-gocube-adds-an-excellent-tech-twist-on-classic-rubik-s-cube-puzzle/_jcr_content/par/video/image.dynimg.1280.q75.jpg/v1635735225173/mikekilpatrick_gocube-review2_011121_1120x640.jpg", "publishedAt": "2021-11-01T03:06:08Z", "content": "Once you get your head around the step-by-step instructions you can look at the cube and understand what you need to do to start solving it, but there were still points where even looking at the inst… [+1330 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Top Lenovo laptop deals for everyone this 11.11, Digital News - AsiaOne", "description": "When it comes to technology companies synonymous with high-end computing devices known throughout the world, few come to the level of Lenovo, known for its range of reliable electronics, especially its line of robust laptops and desktops that cater to both ga…", "url": "https://www.asiaone.com/digital/top-lenovo-laptop-deals-everyone-1111", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211101_laptop_lenovo.jpg?h=0429cc9e&itok=QJSJWr2-", "publishedAt": "2021-11-01T02:27:17Z", "content": "When it comes to technology companies synonymous with high-end computing devices known throughout the world, few come to the level of Lenovo, known for its range of reliable electronics, especially i… [+6371 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Singapore's Kevin Wong wows with 'hawker' inspired duck at S. Pellegrino Young Chef awards - CNA", "description": "The 27-year-old head chef of Meta placed among the top three at the global finale competition in Milan after showcasing how he incorporated Southeast Asian flavours, techniques and materials into his dish.", "url": "https://cnalifestyle.channelnewsasia.com/dining/s-pellegrino-young-chef-award-kevin-wong-meta-286646", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--CVoTWtDv--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/cna/image/2021/10/31/dish_presentation_judging_-_chef_kevin_wong_2.png?itok=9PcL1-Eu", "publishedAt": "2021-10-31T07:49:00Z", "content": "Upon tasting, judge Bartolini said, I am very sorry for these ladies and gentlemen (in the audience) because they cannot try this dish.\r\nBuffara said she was super impressed, adding that the flavours… [+1327 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What’s Causing the Mysterious Radio Waves Coming From the Heart of the Milky Way? - SciTechDaily", "description": "The center of the Milky Way is a mysterious place. Astronomers think there’s a supermassive black hole there, though it could be dark matter instead. The region is densely packed with stars, dominated by red giants. And because of all the dust between Earth a…", "url": "https://scitechdaily.com/whats-causing-the-mysterious-radio-waves-coming-from-the-heart-of-the-milky-way/", "urlToImage": "https://scitechdaily.com/images/Strange-Radio-Waves-Emerge.gif", "publishedAt": "2021-10-31T02:44:50Z", "content": "ByEvan Gough, Universe TodayOctober 28, 2021\r\nArtist’s impression of the oscillating, variable radio signal ASKAP J173608.2-321635 arriving at Earth from towards the center of the Milky Way. Credit: … [+7891 chars]"}]}