{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "Google Pixel Watch leak hints at the most stunning smartwatch yet - TechRadar", "description": "A round Pixel Watch with a physical crown? Hmm.", "url": "https://www.techradar.com/news/google-pixel-watch-leak-hints-at-the-most-stunning-smartwatch-yet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/6Ewe2erwvpCzFRDyvpFR3Y-1200-80.jpg", "publishedAt": "2021-04-09T18:11:55Z", "content": "The Google Pixel Watch may indeed be a round smartwatch with a crown, if a new batch of leaked renders are to be believed and it could come out in October. \r\nThe images come courtesy of render maker … [+2188 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "Elon Musk's Neuralink shows monkey with brain-chip playing videogame by thinking - Reuters", "description": "Billionaire entrepreneur Elon Musk's brain-chip startup released footage on Friday appearing to show a monkey playing a simple videogame after getting implants of the new technology.", "url": "https://www.reuters.com/article/us-tech-neuralink-monkey-idUSKBN2BW2H2", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210409&t=2&i=1557895648&r=LYNXMPEH3818Y&w=800", "publishedAt": "2021-04-09T18:10:00Z", "content": "By Reuters Staff\r\n(Reuters) - Billionaire entrepreneur Elon Musks brain-chip startup released footage on Friday appearing to show a monkey playing a simple videogame after getting implants of the new… [+1698 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "First Exploration of Ocean Currents Beneath the “Doomsday Glacier” Triggers Concerns - SciTechDaily", "description": "For the first time, researchers have been able to obtain data from underneath Thwaites Glacier, also known as the \"Doomsday Glacier.\" They find that the supply of warm water to the glacier is larger than previously thought, triggering concerns of faster melti…", "url": "https://scitechdaily.com/first-exploration-of-ocean-currents-beneath-the-doomsday-glacier-triggers-concerns/", "urlToImage": "https://scitechdaily.com/images/Melting-Ice.gif", "publishedAt": "2021-04-09T18:00:15Z", "content": "For the first time, researchers have been able to obtain data from underneath Thwaites Glacier, also known as the “Doomsday Glacier.” They find that the supply of warm water to the glacier is larger … [+5220 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "HMD Global unveils new Nokia C, G, and X Series - TechCabal", "description": "HMD Global, makers of Nokia phones, have announced six new Nokia Android phones in a live stream. Florian Seiche, CEO of HMD Global, began the event by addressing the brand’s new identity. Why would you buy a Nokia phone? “Our fans are clearly telling us that…", "url": "https://techcabal.com/2021/04/09/hmd-global-unveils-new-nokia-android-phones/", "urlToImage": "https://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2021/04/Nokia-C10.jpg", "publishedAt": "2021-04-09T16:21:53Z", "content": "HMD Global, makers of Nokia phones, have announced six new Nokia Android phones in a live stream.\r\nFlorian Seiche, CEO of HMD Global, began the event by addressing the brands new identity.\r\nWhy would… [+2008 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Sieeka Khan", "title": "Nokia Lite Earbuds Prides Itself with 36-Hour Battery Life, Voice Control Support and Affordable Price - Tech Times", "description": "The Nokia Lite Earbuds last for 36 hours, has Bluetooth and voice control support. Gobal rollout of the product is set to follow.", "url": "https://www.techtimes.com/articles/258920/20210409/nokia-lite-earbuds-prides-itself-36-hour-battery-life-voice.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/383307/earbuds.png", "publishedAt": "2021-04-09T14:20:00Z", "content": "HMD Global has officially launched Nokia Lite Earbuds. The true wireless stereo or TWS earbuds have a similar design to OnePlus Buds Z.\r\nThe Nokia earbuds can offer up to 36 hours of total battery li… [+3169 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Henry Kwan", "title": "HONOR to bring high-end Digital series smartphones besides the Magic series - TechNave", "description": "Earlier,&nbsp;HONOR&nbsp;has&nbsp;claimed&nbsp;that the upcoming&nbsp;Magic series&nbsp;will surpass the likes of HUAWEI's P and MATE series. With that statemen", "url": "https://technave.com/gadget/HONOR-to-bring-high-end-Digital-series-smartphones-besides-the-Magic-series-24244.html", "urlToImage": "https://technave.com/data/files/mall/article/202104091252156451.jpg", "publishedAt": "2021-04-09T13:01:38Z", "content": "Photo courtesy of feat.ws\r\nEarlier, HONOR has claimed that the upcoming Magic series will surpass the likes of HUAWEI's P and MATE series. With that statement, it makes us wonder even more about what… [+1147 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Fermilab Experiment Hints at New Fundamental Force of Nature - ExtremeTech", "description": "The team working on Fermilab's Muon g−2 experiment has reported a tantalizing hint of a new type of physics. If confirmed, this would become the fifth fundamental force in the universe.", "url": "https://www.extremetech.com/extreme/321663-fermilab-experiment-hints-at-new-fundamental-force-of-nature", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2021/04/Fermilab_g-2_E989_ring.jpg", "publishedAt": "2021-04-09T11:30:53Z", "content": "Scientists working at Fermilab in Batavia, Illinois have made some of the most important discoveries in physics over the years, including the existence of the top quark and characterizing the neutrin… [+2409 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Shomik Sen Bhattacharjee", "title": "Samsung May Collaborate With Olympus To Develop Camera Tech On Future Flagships - Mashable India", "description": "Samsung is looking to partner up with the Japanese camera brand, to develop camera modules for their upcoming smartphones capable of producing high-quality pictures.", "url": "https://in.mashable.com/tech/21477/samsung-may-collaborate-with-olympus-to-develop-camera-tech-on-future-flagships", "urlToImage": "https://sm.mashable.com/t/mashable_in/news/f/first-look/first-look-at-samsungs-new-galaxy-s21-line_4heb.1200.jpg", "publishedAt": "2021-04-09T10:25:46Z", "content": "Samsung may partner with Olympus to produce camera modules for the next generation of Galaxy smartphones, as per a report.\r\nWhile there is no confirmation from either company on the development, it i… [+1684 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Macrotech Developers IPO final day: Issue subscribed 86%, QIB portion fully booked - Moneycontrol.com", "description": "To get fully subscribed main board public issues have to receive at least 90 percent subscription from the qualified institutional buyers", "url": "https://www.moneycontrol.com/news/business/ipo/macrotech-developers-ipo-final-day-issue-subscribed-37-qib-portion-booked-66-6748311.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/02/Lodha-sample-flat-770x433.jpeg", "publishedAt": "2021-04-09T07:07:26Z", "content": "The maiden public offer of real estate firm Macrotech Developers has been subscribed 86 percent so far on April 9, the final day of bidding. The issue has received bids for 3.14 crore equity shares a… [+2866 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "Korean firm sets PH vaccine clinical trial - Manila Bulletin", "description": "Eubiologics, the South Korean vaccine manufacturer and joint venture partner of Filipino pharmaceutical Glovax Biotech Corp., is targeting to start clinical trial in the country this month for its EuCorVac-19 Covid vaccine. \n\n\n\nPhoto credit: http://eubiologic…", "url": "https://mb.com.ph/2021/04/09/korean-firm-sets-ph-vaccine-clinical-trial/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/04/EUBIO.jpg", "publishedAt": "2021-04-08T22:00:37Z", "content": "Eubiologics, the South Korean vaccine manufacturer and joint venture partner of Filipino pharmaceutical Glovax Biotech Corp., is targeting to start clinical trial in the country this month for its Eu… [+4244 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Tage Kene-Okafor", "title": "Nigeria's SEC warns investment platforms to stop trading 'unregistered' foreign securities - Yahoo Tech", "description": "In a circular released by Nigeria’s capital market regulator SEC today, investment platforms providing access to foreign securities might be treading on dangerous grounds. According to the SEC regulations that have just been brought to light, these platforms …", "url": "http://techcrunch.com/2021/04/08/nigerias-sec-warns-investment-platforms-to-stop-trading-unregistered-foreign-securities/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/04/gettyimages-494453692-594x594-2.jpg?w=594", "publishedAt": "2021-04-08T21:25:41Z", "content": "In a circular released by Nigeria’s capital market regulator SEC today, investment platforms providing access to foreign securities might be treading on dangerous grounds.\r\nAccording to the SEC regul… [+4342 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Epic cries monopoly as Apple details secret ‘Project Liberty’ effort to provoke ‘Fortnite’ ban - TechCrunch", "description": "The Epic v. Apple lawsuit alleging monopolistic practices by the latter will begin next month, and today the main arguments of each company were published, having been trimmed down somewhat at the court’s discretion. With the basic facts agreed upon, the two …", "url": "http://techcrunch.com/2021/04/08/epic-cries-monopoly-as-apple-details-secret-project-liberty-effort-to-provoke-fortnite-ban/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/08/Screen-Shot-2020-08-13-at-1.18.02-PM.jpg?w=608", "publishedAt": "2021-04-08T21:00:25Z", "content": "The Epic v. Apple lawsuit alleging monopolistic practices by the latter will begin next month, and today the main arguments of each company were published, having been trimmed down somewhat at the co… [+4452 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Peckham", "title": "6 new cheap Nokia phones were just revealed - here’s what you need to know - TechRadar", "description": "A new series of smartphones from HMD Global", "url": "https://www.techradar.com/news/6-new-cheap-nokia-phones-were-just-revealed-heres-what-you-need-to-know", "urlToImage": "https://cdn.mos.cms.futurecdn.net/z6bU7To79LFNSQrW9k3aJF-1200-80.jpg", "publishedAt": "2021-04-08T14:30:24Z", "content": "Theres no Nokia 10 yet, but the company has just revealed six new affordable phones that are designed to offer top experiences at lower prices than their flagship competition.\r\nUnlike previous Nokia … [+4092 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Researchers Explore the Effect of Solar Climate Interventions on Ecology - AZoCleantech", "description": "Scientists in the Climate Intervention Biology Working Group, which includes Jessica Hellmann from the University of Minnesota (U of M) Institute on the Environment, examined the impact of solar climate interventions on ecology.", "url": "https://www.azocleantech.com/news.aspx?newsID=29206", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_29206_16178833166539002.jpg", "publishedAt": "2021-04-08T13:44:00Z", "content": "Written by AZoCleantechApr 8 2021\r\nScientists in the Climate Intervention Biology Working Group, which includes Jessica Hellmann from the University of Minnesota (U of M) Institute on the Environment… [+3907 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Alex Webb", "title": "Bob van Dijk's big challenge: Convincing investors of his strategy for Prosus - TechCentral", "description": "Prosus suffers from the same problem as Manchester City Football Club: Because everyone knows it has access to vast amounts of capital, it’s always at risk of overpaying for acquisitions.", "url": "https://techcentral.co.za/bob-van-dijks-big-challenge-convincing-investors-of-his-strategy-for-prosus/106330/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2019/09/bob-van-dijk-2156-1120.jpg", "publishedAt": "2021-04-08T07:23:24Z", "content": "Prosus CEO Bob van Dijk\r\nProsus suffers from the same problem as Manchester City Football Club¹: Because everyone knows it has access to vast amounts of capital, its always at risk of overpaying for … [+3861 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Ciara O'Brien", "title": "Tech Tools: Smart TV replicates how you see and hear - The Irish Times", "description": "Sony’s Bravia analyses colour, contrast and detail to offer a more immersive experience", "url": "https://www.irishtimes.com/business/technology/tech-tools-smart-tv-replicates-how-you-see-and-hear-1.4530117", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4530115&origw=1440", "publishedAt": "2021-04-08T04:54:44Z", "content": "Sony Bravia XR X90J\r\n(From 1,349)\r\nHow smart does your TV really need to be? Sonys new Bravia TV, the XR X90J, has a smart processor that is designed to replicate how humans see and hear. The aim is … [+611 chars]"}]}