{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "AWESOME! NASA will let you engrave your name on the historic Europa Clipper spacecraft for FREE - HT Tech", "description": "Grab an amazing opportunity to have your name engraved on a NASA spacecraft heading to Jupiter’s Europa moon as part of the Message in a Bottle project. Here’s how.", "url": "https://tech.hindustantimes.com/tech/news/awesome-nasa-will-let-you-engrave-your-name-on-the-historic-europa-clipper-spacecraft-for-free-71688626883804.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/space_exploratory_missions_1688627236743_1688627236978.jpeg", "publishedAt": "2023-07-06T07:09:42Z", "content": "NASA has several space exploratory missions to planets such as Mars and Jupiter in place, and now the space agency is offering a unique opportunity for the public to have their name etched on a NASA … [+2504 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for July 6: Grab Golden Bebop bundle NOW! - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for July 6: Garena Free Fire MAX players have a limited opportunity to grab the Golden Bebop bundle through the July Top-Up event. The latest Garena Free Fire MAX redeem codes have also been issued.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-july-6-grab-golden-bebop-bundle-now-71688606432286.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/b5f992f0bc6924b442aac34d1c0bc9cfjpg_1_1688606470439_1688606470622.jpg", "publishedAt": "2023-07-06T01:23:38Z", "content": "Garena Free Fire MAX Redeem Codes for July 6: The new Top-Up event is now live in Garena Free Fire MAX and players can grab this opportunity to get their hands on exclusive in-game rewards! Items suc… [+2081 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mario Aguilera", "title": "New genetic technology developed to halt malaria-spreading mosquitoes - Phys.org", "description": "Malaria remains one of the world's deadliest diseases. Each year malaria infections result in hundreds of thousands of deaths, with the majority of fatalities occurring in children under five. The Centers for Disease Control and Prevention recently announced …", "url": "https://phys.org/news/2023-07-genetic-technology-halt-malaria-spreading-mosquitoes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-genetic-technology.jpg", "publishedAt": "2023-07-05T20:57:03Z", "content": "Malaria remains one of the world's deadliest diseases. Each year malaria infections result in hundreds of thousands of deaths, with the majority of fatalities occurring in children under five. The Ce… [+5128 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "Fairphone’s repairable smartphone goes on sale in US for the first time — in a ‘deGoogled’ Murena e/OS variant - TechCrunch", "description": "It will be interesting to see how much U.S. interest there is in an iPhone and (Google) Android alternative that packs sustainable and ethical smarts.", "url": "https://techcrunch.com/2023/07/05/fairphones-repairable-smartphone-goes-on-sale-in-us-for-the-first-time-in-a-degoogled-murena-e-os-variant/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/09/FP4-Speckled-Nine-Grass.jpg?resize=1200,800", "publishedAt": "2023-07-05T16:29:15Z", "content": "European sustainable smartphone brand Fairphone is dipping a toe in the U.S. market by making its flagship repairable handset available to buy there for the first time via another collaboration with … [+3362 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers discover unique blood plasma protein patterns in patients with long COVID - Medical Xpress", "description": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID that could improve patient outcomes. This research, which used…", "url": "https://medicalxpress.com/news/2023-07-unique-blood-plasma-protein-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fatigue-1.jpg", "publishedAt": "2023-07-05T14:07:50Z", "content": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID th… [+4047 chars]"}, {"source": {"id": null, "name": "Exchange4Media"}, "author": "Shantanu David", "title": "Motorola doesn’t want to leverage nostalgia but focus on disruptive tech: Shivam Ranjan - Exchange4Media", "description": "In light of Razr series launch, Ranjan, Head of Marketing at Motorola - Asia Pacific, speaks about disrupting markets, changing advertising strategies and working closely with influencers", "url": "https://www.exchange4media.com/marketing-news/motorola-doesnt-want-to-leverage-nostalgia-shivam-ranjan-128385.html", "urlToImage": "https://www.exchange4media.com/news-photo/128385-big25.jpg", "publishedAt": "2023-07-05T03:30:27Z", "content": "Anuradha Sehgal, the CMO of Coforge, a global digital services and solutions provider, speaks to us about the company achieving achieved a revenue milestone of $1bn in FY 23. She also sheds light on … [+7262 chars]"}]}