{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Insightsonindia.com"}, "author": "Insights Editor", "title": "The Webb telescope is just getting started - INSIGHTSIAS - Insights IAS", "description": "GS Paper 3 Syllabus: Space Technology Source: Indian Express   Context: It was launched one year ago on a mission to observe the universe in wavelengths no human eye can see. With a primary mirror 21 feet wide, the Webb is seven times as powerful as the Hubbl…", "url": "https://www.insightsonindia.com/2022/12/30/the-webb-telescope-is-just-getting-started/", "urlToImage": "https://www.insightsonindia.com/wp-content/uploads/2022/12/james_web-1024x490.jpg", "publishedAt": "2022-12-30T11:51:44Z", "content": null}, {"source": {"id": null, "name": "Techpp.com"}, "author": "Suman Chakraborty", "title": "4 Best Free Note-Taking Apps for Chromebook [2023] - TechPP", "description": "Take notes like a pro with these best free note-taking apps for Chromebook users! We've picked out the best options based on factors like stylus support, handwriting recognition, and more.", "url": "https://techpp.com/2022/12/30/best-free-note-taking-apps-for-chromebook/", "urlToImage": "https://techpp.com/wp-content/uploads/2022/12/Best-Note-Taking-Apps.jpg", "publishedAt": "2022-12-30T10:42:05Z", "content": "Do you want to get organized and increase your productivity? Taking notes is one of the most important steps in achieving this goal. Today we will look at some of the best note-taking apps for Chrome… [+6222 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Daniel Adeyemi", "title": "22 things that happened for the first time in 2022 in the African tech scene - TechCabal", "description": "Here’s a list of 22 things that happened for the first time in the African tech scene in 2022", "url": "http://techcabal.com/2022/12/30/22-things-first-time-in-2022-in-the-african-tech-scene/", "urlToImage": "http://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2022/12/Africa-tech-.png", "publishedAt": "2022-12-30T10:00:34Z", "content": "2022 was a different year for the African tech ecosystem as the effects of the economic downturn shook the ecosystem. The year was filled with stories of triumph, failures, and progress. Heres a list… [+16624 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple to do a FIRST, launch iPhone Fold, says report! Samsung Galaxy Z Fold to get rival - HT Tech", "description": "After Samsung Galaxy Z Fold, Apple is expected to launch the iPhone Fold, says a report.", "url": "https://tech.hindustantimes.com/mobile/news/apple-to-do-a-first-launch-iphone-fold-says-report-samsung-galaxy-z-fold-to-get-rival-71672394012861.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/30/1600x900/onur-binay--WJQYRbgRLk-unsplash_1672394312148_1672394327564_1672394327564.jpg", "publishedAt": "2022-12-30T10:00:05Z", "content": "After Samsung, Oppo, Motorola and Huawei launches grabbed the mind space around foldable phones, it is being reported that Apple too is planning to bring its own iPhone Fold! So far, Samsung has been… [+1672 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Lim Tuang Liang appointed as first Government Chief Sustainability Officer from Jan 1 - CNA", "description": "He will step down from his current position as Chief Science and Technology Officer (CSTO) at the Ministry of Sustainability and the Environment (MSE) when his replacement is appointed.", "url": "https://www.channelnewsasia.com/singapore/lim-tuang-liang-appointed-first-government-chief-sustainability-officer-jan-1-3174681", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--H31z3Q8u--/c_crop,h_619,w_1101,x_4,y_29/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/12/30/mse.png?itok=ucZKsQAC", "publishedAt": "2022-12-30T04:44:20Z", "content": "SINGAPORE: The Ministry of Sustainability and the Environment (MSE) announced on Friday (Dec 30) that the position of Government Chief Sustainability Officer (GCSO) will be established to drive the G… [+791 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Saiful Ridzaimi", "title": "Apple releases limited-edition Year of the Rabbit AirPods Pro in celebration of Chinese New Year - TechNave", "description": "With the Chinese New Year celebrations less than a month away, Apple has released a Chinese New Year gift guide in China, Taiwan, Hong Kong and Macau with vario", "url": "https://technave.com/gadget/Apple-releases-limited-edition-Year-of-the-Rabbit-AirPods-Pro-in-celebration-of-Chinese-New-Year-32945.html", "urlToImage": "https://technave.com/data/files/article/202212300432189350.jpg", "publishedAt": "2022-12-30T04:36:59Z", "content": "With the Chinese New Year celebrations less than a month away, Apple has released a Chinese New Year gift guide in China, Taiwan, Hong Kong and Macau with various discounts as well as limited-time pr… [+1595 chars]"}, {"source": {"id": null, "name": "Nasilemaktech.com"}, "author": "https://www.facebook.com/NasiLemakTech", "title": "The PICO 4 promotion is practically long term as the same bonus package is available yet again thanks to CNY 2023 - Nasi Lemak Tech", "description": "It seems that the PICO 4 promotion will pop up whenever there's a celebratory festival or event as PICO Malaysia is once again offering its latest all-in-one VR headset with loads of freebies.", "url": "https://nasilemaktech.com/pico-4-cny-2023-promo/", "urlToImage": "https://i0.wp.com/nasilemaktech.com/wp-content/uploads/2022/12/PICO-4-CNY-2023-Promo.jpg", "publishedAt": "2022-12-29T04:00:52Z", "content": "It seems that the PICO 4 promotion will pop up whenever there’s a celebratory festival or event as PICO Malaysia is once again offering its latest all-in-one VR headset with loads of freebies.\r\nIn te… [+1105 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists uncover a novel cellular mechanism that regulates aging and fertility - Phys.org", "description": "Research at the Institute of Molecular Biology and Biotechnology (IMBB) of the Foundation for Research and Technology-Hellas (FORTH), published today in the journal Nature Aging, reveals a fundamental quality control mechanism that operates in cells to safegu…", "url": "https://phys.org/news/2022-12-scientists-uncover-cellular-mechanism-aging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/forth-imbb-scientists.jpg", "publishedAt": "2022-12-28T16:45:03Z", "content": "Research at the Institute of Molecular Biology and Biotechnology (IMBB) of the Foundation for Research and Technology-Hellas (FORTH), published today in the journal Nature Aging, reveals a fundamenta… [+7167 chars]"}]}