{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Zomato writes down investment in fintech arm; surrenders PA, wallet licence to RBI - Moneycontrol", "description": "Zomato, via its fintech arm Zomato Payment, has surrendered its recently-secured online payment aggregator (PA) and prepaid payment instrument (PPI) licences to the Reserve Bank of India (RBI), the filings show.", "url": "https://www.moneycontrol.com/technology/zomato-writes-down-investment-in-fintech-arm-surrenders-pa-wallet-licence-to-rbi-article-12720961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/Zomato.jpg", "publishedAt": "2024-05-13T14:10:22Z", "content": "Foodtech major Zomato wrote down Rs 39 crore investment in its fintech subsidiary Zomato Payment Private Limited (ZPPL) during the March quarter.\r\nFurther, the filings showed that the fintech arm sur… [+1857 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Mystery Solved – Scientists Shed Light on Perplexing High-Temperature Superconductors - SciTechDaily", "description": "Flatiron Institute senior research scientist Shiwei Zhang and his team have utilized the Hubbard model to computationally re-create key features of the superconductivity in materials called cuprates that have puzzled scientists for decades. Superfast hovering…", "url": "https://scitechdaily.com/quantum-mystery-solved-scientists-shed-light-on-perplexing-high-temperature-superconductors/", "urlToImage": "https://scitechdaily.com/images/Superconductor-Illustration.jpg", "publishedAt": "2024-05-13T12:28:42Z", "content": "A recent study has advanced the understanding of high-temperature superconductivity in ‘cuprates’ using an enhanced Hubbard model, paving the way for potential technological breakthroughs and demonst… [+9310 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 7 breathtaking images of celestial wonders shared by NASA Hubble Space Telescope - HT Tech", "description": "Top 7 breathtaking images of celestial wonders shared by NASA Hubble Space Telescope Spiral Galaxy A mesmerising spiral galaxy glowing yellow at its core surrounded by reddishbrown dust trails and blue star clouds. Bright blue stars adorn its outer edges whil…", "url": "https://tech.hindustantimes.com/web-stories/nasa-hubble-space-telescope-71715597182598.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/13/1600x900/NASA_Hubble_Space_Telescope_1715597232804_1715597276069.jpg/", "publishedAt": "2024-05-13T11:04:23Z", "content": "Photo Credit: NASA\r\n Spiral Galaxy: A mesmerising spiral galaxy, glowing yellow at its core, surrounded by reddish-brown dust trails and blue star clouds. Bright blue stars adorn its outer edges, whi… [+1395 chars]"}, {"source": {"id": null, "name": "FXStreet"}, "author": "Ekta Mourya", "title": "Top AI tokens bleed despite reports of Apple closing deal to use OpenAI features - FXStreet", "description": "Technology giant Apple Inc. has reportedly reached an agreement with Artificial Intelligence (AI) firm OpenAI to include the latter’s tech in the next iPhone.", "url": "https://www.fxstreet.com/cryptocurrencies/news/top-ai-tokens-bleed-despite-reports-of-apple-closing-deal-to-use-openai-features-202405130855", "urlToImage": "https://editorial.fxstreet.com/images/Resources/CryptoWorldSEO2_Large.jpg", "publishedAt": "2024-05-13T08:55:33Z", "content": "<ul><li>Apple has closed a deal with OpenAI to use the latter’s technology in its new iPhone, Bloomberg reports.</li><li>The giant’s iOS 18 could come packed with ChatGPT features, per the report.</l… [+3412 chars]"}]}