{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "150-foot asteroid to pass Earth by a narrow margin today, says NASA; Check details - HT Tech", "description": "Yet another asteroid has been observed by NASA and it is expected to pass Earth today, March 27, by a narrow margin. From speed and size to distance of approach, check all the details.", "url": "https://tech.hindustantimes.com/tech/news/150foot-asteroid-to-pass-earth-by-a-narrow-margin-today-says-nasa-check-details-71711517940227.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/27/1600x900/cosmos-7051165_1280_1675313973292_1711518494683.jpg", "publishedAt": "2024-03-27T05:56:09Z", "content": "Earth has been impacted by multiple celestial phenomena in the last few weeks. Along with the vernal equinox, the peak of the solar cycle 25 is approaching which has led to increased solar activity. … [+2061 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IIT Madras Graduate Pavan Davuluri To Head Microsoft Windows - NDTV", "description": "Pavan Davuluri, an IIT Madras alumni, was appointed the new head of Microsoft Windows and Surface, making him the latest Indian to take on a leadership role at a Big Tech company much like Google's Sundar Pichai and Microsoft's Satya Nadella.", "url": "https://www.ndtv.com/world-news/iit-madras-graduate-pavan-davuluri-to-head-microsoft-windows-5318388", "urlToImage": "https://c.ndtvimg.com/2024-03/m4itojuo_pavan-davuluri_625x300_27_March_24.jpg", "publishedAt": "2024-03-27T04:57:48Z", "content": "New Delhi: Pavan Davuluri, an IIT Madras alumni, was appointed the new head of Microsoft Windows and Surface, making him the latest Indian to take on a leadership role at a Big Tech company much like… [+1858 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple iPhone 14 Plus is now available at a 25% discount on Amazon! Grab it now before it's gone - HT Tech", "description": "The Apple iPhone 14 Plus is now within reach for tech enthusiasts, with a substantial 25% discount on its original price, offering top-notch features at an unbeatable value.", "url": "https://tech.hindustantimes.com/mobile/news/apple-iphone-14-plus-is-now-available-at-a-25-discount-on-amazon-grab-it-now-before-its-gone-71710942601797.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/20/1600x900/ipho_1710942809690_1710942812134.jpg", "publishedAt": "2024-03-27T04:53:41Z", "content": "The Apple iPhone 14 Plus is now available at a discounted price of 25% off the original retail price of Rs. 89,900, making it accessible for Rs. 66,999 on Amazon. This significant price reduction off… [+1907 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Donald Trump’s social media company soars in Wall Street debut - Al Jazeera English", "description": "Trump Media & Technology Group closes 16 percent higher, giving the company a market capitalisation of nearly $8bn.", "url": "https://www.aljazeera.com/economy/2024/3/27/donald-trumps-social-media-company-soars-in-wall-street-debut", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2024/03/AP24085591446779-1711506371.jpg?resize=1920%2C1440", "publishedAt": "2024-03-27T03:08:35Z", "content": "Shares of former Donald Trumps social media company soared by as much as 59 percent on the first day of trading on Wall Street, boosting the former United States presidents expected windfall as he fa… [+1645 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Cows in Texas and Kansas test positive for highly pathogenic bird flu - Ars Technica", "description": "The risk to the public is low, and the milk supply is safe.", "url": "https://arstechnica.com/science/2024/03/cows-in-texas-and-kansas-test-positive-for-highly-pathogenic-bird-flu/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/01/GettyImages-90790890-760x380.jpg", "publishedAt": "2024-03-26T22:50:29Z", "content": "17\r\nWild migratory birds likely spread a deadly strain of bird flu to dairy cows in Texas and Kansas, state and federal officials announced this week.\r\nIt is believed to be the first time the virus, … [+2699 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking Physics: How Solitons Bend Time, Space, and Rules - SciTechDaily", "description": "If it walks like a particle, and talks like a particle… it may still not be a particle. A topological soliton is a special type of wave or dislocation that behaves like a particle: it can move around but cannot spread out and disappear like you would expect f…", "url": "https://scitechdaily.com/breaking-physics-how-solitons-bend-time-space-and-rules/", "urlToImage": "https://scitechdaily.com/images/Particle-Physics-Line-Concept.jpg", "publishedAt": "2024-03-25T19:06:17Z", "content": "Topological solitons, integral to various natural and technological processes, are being harnessed through non-reciprocal interactions to innovate in materials science and robotics, offering new poss… [+6425 chars]"}]}