{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Alex Druce, Lucy Battersby, Colin Kruger", "title": "ASX set to rise; Sonic booms; Latitude profit jumps 81% - The Sydney Morning Herald", "description": "The ASX opened 0.3% higher on Monday with strong gains in information technology, healthcare, and materials. Energy and industrials lagged.", "url": "https://www.smh.com.au/business/markets/asx-set-to-chase-wall-street-gains-ampol-altium-report-results-20210822-p58kz2.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1936%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_live_no_age_social_wm/69e87044b730b1f98b1436915d7a149f59237a50", "publishedAt": "2021-08-23T00:18:12Z", "content": "Global plumbing, heating and piping firm Reliance Worldwide has nearly tripled its final payout after heightened home building and renovation activity during the pandemic helped it beat sales expecta… [+1799 chars]"}, {"source": {"id": null, "name": "Illinoisnewstoday.com"}, "author": "danielkuhn", "title": "New discoveries remove important design barriers - Illinoisnewstoday.com", "description": "There are many obstacles that must be overcome before quantum computers become commonplace. However, UNSW in Sydney A new technology for controlling millions of spin qubits takes that step one step fu", "url": "https://illinoisnewstoday.com/new-discoveries-remove-important-design-barriers/352818/", "urlToImage": "https://www.redsharknews.com/hubfs/NNSW_quantum_computing.jpg#keepProtocol", "publishedAt": "2021-08-22T21:49:56Z", "content": "There are many obstacles that must be overcome before quantum computers become commonplace. However, UNSW in Sydney A new technology for controlling millions of spin qubits takes that step one step f… [+2872 chars]"}, {"source": {"id": null, "name": "CleanTechnica"}, "author": "Jennifer Sensiba", "title": "Really Bad News: GM Expands Chevy Bolt EV Recall To Include 2020-2022 Vehicles - CleanTechnica", "description": "Today's news is very bad for General Motors. Before now, fire problems were thought to be limited to the 2017-2019 model years of the Chevrolet Bolt EV, and that problem was almost solved. Now, Chevrolet", "url": "https://cleantechnica.com/2021/08/22/really-bad-news-gm-expands-chevy-bolt-ev-recall-to-include-2020-2022-vehicles/", "urlToImage": "https://cleantechnica.com/files/2021/02/2022-Chevrolet-BoltEUV-005-Chevy-OFFICIAL.jpg", "publishedAt": "2021-08-22T18:47:30Z", "content": "Today’s news is very bad for General Motors. Before now, fire problems were thought to be limited to the 2017-2019 model years of the Chevrolet Bolt EV, and that problem was almost solved. Now, Chevr… [+6099 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mackenzie Frazier", "title": "Amazon's huge device sale ends today: deals on Fire TV Stick, Kindle, tablets and more - TechRadar", "description": "Score epic deals on Amazon's best-selling devices", "url": "https://www.techradar.com/news/amazon-huge-device-sale-deals-fire-tv-stick-kindle-tablets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Axkrw5BubuXSe5LBpCSsRD-1200-80.jpg", "publishedAt": "2021-08-22T18:21:30Z", "content": "Amazon's latest sale is blowing out its best-selling devices, including Fire TV Sticks, Blink security cameras, Fire tablets, Kindles, and more. You'll have to hurry though, these incredible device d… [+5873 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jacob Bunge", "title": "How a Billion-Dollar Farm-Tech Startup Stumbled, Then Revamped - The Wall Street Journal", "description": "Operational missteps put Indigo Agriculture on the outs with farmers in its early days. It is revising its offerings, and now old-line giants are implementing their own tech products for grain and carbon trading.", "url": "https://www.wsj.com/articles/how-a-billion-dollar-farm-tech-startup-indigo-stumbled-then-revamped-11629656437", "urlToImage": "https://images.wsj.net/im-385640/social", "publishedAt": "2021-08-22T18:21:00Z", "content": "When a Boston-based tech startup showed John Creighton one of the best prices for his corn hed seen in years, the farmer signed up to sell 75,000 bushels through its network.\r\nWhat followed were mont… [+1136 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don’t Miss: Rare Seasonal “Blue Moon” Rises Tonight - SciTechDaily", "description": "This month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. The name was given to the Moon because the large sturgeon fish of the Great Lakes, and other major …", "url": "https://scitechdaily.com/dont-miss-rare-seasonal-blue-moon-rises-tonight/", "urlToImage": "https://scitechdaily.com/images/Blue-Moon.jpg", "publishedAt": "2021-08-22T18:01:45Z", "content": "ByLance D. Davis, NASAAugust 22, 2021\r\nThis month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. … [+2883 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "iOS 15 beta still hasn't fixed decade-old bug - Techradar", "description": "Sending a photo in Messages? Nope, can’t, sorry.", "url": "https://www.techradar.com/news/ios-15-beta-still-hasnt-fixed-decade-old-bug", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NbVBT9bpcScQ9KAVx2EWgW-1200-80.jpg", "publishedAt": "2021-08-22T18:00:04Z", "content": "Ive been really enjoying the iOS 15 public beta for weeks now, and the new features like Live Text and UX refinements like clustered notifications already make it a better experience\r\n than iOS 14. B… [+2789 chars]"}, {"source": {"id": null, "name": "Illinoisnewstoday.com"}, "author": "danielkuhn", "title": "Qubit’s “jigsaw piece” brings quantum computers one step closer - Illinoisnewstoday.com", "description": "UNSW Sydney's quantum engineers have removed the major obstacles that have hindered the realization of quantum computers. They have discovered a new technology that they say can control millions of sp", "url": "https://illinoisnewstoday.com/qubits-jigsaw-piece-brings-quantum-computers-one-step-closer/352560/", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/qubit-jigsaw-piece-brings-quantum-computers-a-step-closer-352072.jpg?cb=20210816", "publishedAt": "2021-08-22T16:46:14Z", "content": "UNSW Sydney’s quantum engineers have removed the major obstacles that have hindered the realization of quantum computers. They have discovered a new technology that they say can control millions of s… [+5449 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Idris Shehu", "title": "Awabah accepted into Techstars London accelerator programme - TheCable", "description": "Awabah, the Nigeria-based startup providing pension access to Africa's informal sector, has been accepted into the Techstars London accelerator programme.", "url": "https://www.thecable.ng/awabah-accepted-into-techstars-london-accelerator-programme", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2021/08/Awabah-3.png", "publishedAt": "2021-08-22T15:17:00Z", "content": "Awabah, the Nigeria-based startup providing pension access to Africa’s informal sector, has been accepted into the Techstars London accelerator programme.\r\nThe company broke the news in a press state… [+1717 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Japan’s Martian Moons eXploration Mission Will Return a Sample From Mars’ Moon Phobos - SciTechDaily", "description": "The role of the Martian Moons eXploration (MMX) mission in the new era of Martian life exploration. The surface of the Martian moon, Phobos, is covered with a variety of material that was excavated and ejected via numerous meteorite impacts from over the enti…", "url": "https://scitechdaily.com/japans-martian-moons-exploration-mission-will-return-a-sample-from-mars-moon-phobos/", "urlToImage": "https://scitechdaily.com/images/Moons-of-Mars.jpg", "publishedAt": "2021-08-22T14:39:02Z", "content": "ByJAXAAugust 22, 2021\r\nMars is kept company by two cratered moons—an inner moon named Phobos and an outer moon named Deimos. Credit: NASA/JPL-Caltech/University of Arizona\r\nThe role of the Martian Mo… [+9133 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Genshin Impact 2.1 update announced with new characters, islands and fishing; get free Primogem redeem codes too - HT Tech", "description": "Genshin Impact 2.1 update. The game is set to receive new and updated in-game content as part of the upcoming version 2.1 update. Here’s everything you need to know and how to claim free Primogem rewards right away.", "url": "https://tech.hindustantimes.com/gaming/news/genshin-impact-2-1-update-announced-with-new-characters-islands-and-fishing-get-free-primogem-redeem-codes-too-71629609515370.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/08/22/1600x900/2021082119245498236_1629609486920_1629609512602.jpg", "publishedAt": "2021-08-22T05:18:35Z", "content": "Genshin Impact 2.1 update has just been announced. Popular online action roleplaying game Genshin Impact will receive an update to version 2.1 which will bring important changes to the game, develope… [+2675 chars]"}, {"source": {"id": null, "name": "bdnews24.com"}, "author": null, "title": "Is an exoskeleton suit in your future? - bdnews24.com", "description": "Those of us who are slow or reluctant runners or walkers might soon be able to slip on a lightweight, lower-body exoskeleton and up the speed and ease of our exercise, according to several new studies examining the effects of these high-tech robotic devices. …", "url": "https://bdnews24.com/science/2021/08/22/is-an-exoskeleton-suit-in-your-future", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2021/08/22/exoskeleton-220821-01.jpg/ALTERNATES/w640/exoskeleton-220821-01.jpg", "publishedAt": "2021-08-22T04:08:35Z", "content": "But the latest exoskeleton research also raises provocative questions about what we want from exercise and whether making it easier necessarily makes it better.\r\nExoskeletons have been staples of sci… [+5189 chars]"}, {"source": {"id": null, "name": "Globalriskinsights.com"}, "author": "by  Jordan Dobney", "title": "Technological pull or competitive drive? China’s rover landing sends a message to the United States - Global Risk Insights", "description": "On Friday 14th May, China’s Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hopes their Zhurong rover will give them 90 days of service as…", "url": "https://globalriskinsights.com/2021/08/technological-pull-or-competitive-drive-chinas-rover-landing-sends-a-message-to-the-united-states/", "urlToImage": "https://i0.wp.com/globalriskinsights.com/wp-content/uploads/2021/08/50144550853_9e78484352_b.jpg?fit=800%2C440&ssl=1", "publishedAt": "2021-08-21T15:12:13Z", "content": "On Friday 14th May, Chinas Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hop… [+5400 chars]"}, {"source": {"id": null, "name": "Themarketwriteup.com"}, "author": null, "title": "Lung Cancer Screening Software Market is Booming Worldwide | PenRad Technologies, Thynk Health, ProVation Medical - The Market Writeuo - The Market Writeuo", "description": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Market research report shows the latest market insights; curren…", "url": "https://themarketwriteup.com/lung-cancer-screening-software-market-is-booming-worldwide-penrad-technologies-thynk-health-provation-medical/", "urlToImage": null, "publishedAt": "2021-08-21T13:38:58Z", "content": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Mar… [+5073 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Tim Schiesser", "title": "GPU Availability and Pricing Update: August 2021 - TechSpot", "description": "Graphics cards are still quite difficult to purchase at reasonable prices in most regions, but the month of August in particular has seen a number of developments that are worth talking about.", "url": "https://www.techspot.com/article/2311-gpu-pricing-2021-update/", "urlToImage": "https://static.techspot.com/articles-info/2311/images/2021-08-20-image.jpg", "publishedAt": "2021-08-21T12:18:00Z", "content": "Its time for our monthly update into graphics card pricing and availability, a series that weve been running since March, giving us a ton of useful insight into the current state of the GPU market. G… [+19323 chars]"}]}