{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikhil Agarwal", "title": "Sensex plunges 800 points, smallcaps bleed most. 6 factors behind Rs 6 lakh crore crash - The Economic Times", "description": "Nifty and Sensex fell below key levels. Technical analysts believe a breakout below 22,000 could trigger a downward move. FIIs have turned buyers despite high US bond yields. Sebi asks mutual funds to disclose risks and liquidity measures. Traders await US PC…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-plunges-800-points-smallcaps-bleed-most-top-factors-behind-rs-6-lakh-crore-crash/articleshow/108068281.cms", "urlToImage": "https://img.etimg.com/thumb/msid-108068278,width-1200,height-630,imgsize-88652,overlay-etmarkets/photo.jpg", "publishedAt": "2024-02-28T10:24:12Z", "content": "Just ahead of the monthly derivative expiry, Nifty gave up its hold over the 22,000 level while Sensex ended the day 790 points or 1% weaker. The sell-off was deeper in the broader market where midca… [+3825 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "MWC 2024 Day 2: From wearable AI to smartphones, here are major announcements | Mint - Mint", "description": "MWC 2024 showcases groundbreaking gadgets like Humane AI Pin, Nothing's Phone 2a, TCL's budget-friendly 50 series models, Techno's Dynamic1 robot dog, and Tecno's Pocket Go AR gaming set. These innovations promise to revolutionize daily tech interactions.", "url": "https://www.livemint.com/technology/tech-news/mwc-2024-day-2-from-wearable-ai-to-smartphones-here-are-major-announcements-11709114812116.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/02/28/1600x900/frrrrrrr_1704885783169_1709115045481.jpg", "publishedAt": "2024-02-28T10:11:08Z", "content": "The Mobile World Congress (MWC) 2024 continues to captivate tech enthusiasts with a flurry of groundbreaking announcements and innovative gadgets. From wearable AI to affordable smartphones and even … [+2770 chars]"}, {"source": {"id": null, "name": "ESPN India"}, "author": null, "title": "Texas' win in Lubbock marred as Texas Tech fans throw bottles - ESPN - ESPN India", "description": "An ugly scene in Texas' road win over Texas Tech saw angry fans throw objects onto the floor, forcing Red Raiders coach Grant McCaslan to take the microphone to implore the crowd to stop.", "url": "https://www.espn.in/mens-college-basketball/story/_/id/39613551/texas-win-lubbock-marred-texas-tech-fans-throw-bottles", "urlToImage": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0228%2Fr1297268_1296x729_16%2D9.jpg", "publishedAt": "2024-02-28T05:13:00Z", "content": "LUBBOCK, Texas -- Dylan Disu scored 21 points, Max Abmas added 18 and Texas rode a big first half to a 81-69 victory over Texas Tech on Tuesday night in a game that included a significant delay after… [+3891 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says 120-foot asteroid will pass Earth by just 5.2 mn km; Know how fast it is moving - HT Tech", "description": "A Near-Earth Asteroid has been tracked in its orbit and it will come as close as 5.2 million kilometers to Earth today, February 28, NASA has revealed. Know all about this close encounter with the asteroid.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-120-foot-asteroid-will-pass-earth-by-just-5-2-mn-km-know-how-fast-it-is-moving-71709091967514.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/28/1600x900/space-1422642_1280_1697709461480_1709092040592.jpg", "publishedAt": "2024-02-28T03:52:38Z", "content": "Like previous months, February has witnessed multiple asteroid approaches. While an asteroid did not pass Earth yesterday, NASA says that two asteroids will come close to the planet today, February 2… [+1954 chars]"}]}