{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple WWDC 2023: iOS 17 may bring THESE benefits to your iPhone - HT Tech", "description": "iOS 17 is coming soon! What new will this big software update bring to your iPhone?", "url": "https://tech.hindustantimes.com/tech/news/apple-wwdc-2023-ios-17-may-bring-these-benefits-to-your-iphone-71684649704973.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/21/1600x900/4_1679576345619_1684649941628.jpg", "publishedAt": "2023-05-21T06:19:38Z", "content": "iOS 17 is coming! Apple WWDC 2023 event is just around the corner and Apple is expected to announce the next big software update the iOS 17. All the latest iPhones, including iPhone 14, iPhone 13, iP… [+2191 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid Alert app: a journey through the cosmos - HT Tech", "description": "Asteroid Alert app a journey through the cosmos Asteroid Alert app an innovative application developed by PhoneScience immerses users in the intricate world of space dynamics. Asteroid Alert app an innovative application developed by PhoneScience immerses use…", "url": "https://tech.hindustantimes.com/web-stories/asteroid-alert-app-a-journey-through-the-cosmos-71684638750898.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/21/1600x900/Asteroid_alert_app_1684639056784_1684639056979.jpg/", "publishedAt": "2023-05-21T03:40:10Z", "content": "Photo Credit: PhoneScience\r\n Asteroid Alert app, an innovative application developed by PhoneScience, immerses users in the intricate world of space dynamics. \r\nAsteroid Alert app, an innovative appl… [+1108 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Double asteroid whammy! NASA telescopes track two 120-foot space rocks hurtling towards Earth - HT Tech", "description": "NASA’s telescope has observed two airplane-sized asteroids approaching Earth at a fiery speed. Know what the space agency said.", "url": "https://tech.hindustantimes.com/tech/news/double-asteroid-whammy-nasa-telescopes-track-two-120-foot-space-rocks-hurtling-towards-earth-71684638820370.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/21/1600x900/asteroid-6096994_640_1683023408159_1684638967129.jpg", "publishedAt": "2023-05-21T03:16:18Z", "content": "Asteroids are remnants from the early formation of our solar system. They revolve mainly in the asteroid belt, a region located between the orbits of Mars and Jupiter. But these space rocks can also … [+2134 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT GENUS: 40 Hz Vibrations Reduce Alzheimer's Disease Symptoms - SciTechDaily", "description": "Tactile stimulation improved motor performance, reduced phosphorylated tau, preserved neurons and synapses, and reduced DNA damage, a new study shows. MIT researchers have found that sensory stimulation of 40 Hz gamma frequency brain rhythms using tactile sti…", "url": "https://scitechdaily.com/mit-genus-40-hz-vibrations-reduce-alzheimers-disease-symptoms/", "urlToImage": "https://scitechdaily.com/images/Brain-Boost-Healing-Vibrations-Concept.jpg", "publishedAt": "2023-05-21T02:27:51Z", "content": "ByPicower Institute at MITMay 20, 2023\r\nAn MIT study shows that 40 Hz gamma frequency brain rhythm tactile stimulation may reduce Alzheimers disease pathology and symptoms. This extends previous find… [+9573 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Join the Hunt: Astronomers Need Help Finding Asteroids Hurtling Through Our Solar System - SciTechDaily", "description": "Anyone with an internet connection can now join University of Arizona researchers as they work to discover asteroids hurtling through our solar system. Anyone can become an asteroid hunter thanks to a new program launched by astronomers at the University of A…", "url": "https://scitechdaily.com/?p=279521", "urlToImage": "https://scitechdaily.com/images/Near-Earth-Asteroid-Illustration.jpg", "publishedAt": "2023-05-20T21:09:02Z", "content": "ByKylianne Chadwick, University of ArizonaMay 20, 2023\r\nThe University of Arizona Lunar and Planetary Laboratory has created an online portal as part of the NASA-funded Catalina Sky Survey, allowing … [+6016 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "AI goes to space! New planet discovered outside solar system - HT Tech", "description": "AI is now helping in finding new planets outside our solar system! Here is how.", "url": "https://tech.hindustantimes.com/tech/news/ai-goes-to-space-new-planet-discovered-outside-solar-system-71684603911918.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/20/1600x900/exoplanet_1684604246137_1684604260516.png", "publishedAt": "2023-05-20T17:38:39Z", "content": "AI is the biggest buzzword these days courtesy ChatGPT. And guess what? AI is now helping scientists to discover planets out there in space! A recent study conducted by a research team from the Unive… [+2242 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "SpaceX launches OneWeb Gen 2 technology demonstrator - SpaceNews", "description": "SpaceX launched a technology demonstration satellite for OneWeb’s second-generation broadband constellation May 20, along with spares for the British firm’s current low Earth orbit network and another that U.S.-based Iridium Communications operates.", "url": "https://spacenews.com/spacex-launches-oneweb-gen-2-technology-demonstrator/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/05/JoeySat-pair-separates-scaled.jpg", "publishedAt": "2023-05-20T15:12:37Z", "content": "TAMPA, Fla. SpaceX launched a technology demonstration satellite for OneWebs second-generation broadband constellation May 20, along with spares for the British firms current low Earth orbit (LEO) ne… [+2727 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bridging Quantum Theory and Relativity: Curved Spacetime in a Quantum Simulator - SciTechDaily", "description": "New techniques can answer questions that were previously inaccessible experimentally — including questions about the relationship between quantum mechanics and relativity. Scientists at TU Wien and other institutions have developed a \"quantum simulator\" using…", "url": "https://scitechdaily.com/bridging-quantum-theory-and-relativity-curved-spacetime-in-a-quantum-simulator/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Lens-EffectQuantum-Particles.jpg", "publishedAt": "2023-05-20T11:39:04Z", "content": "ByTU WienMay 20, 2023\r\nIn the background: the gravitational lens effect, an example of an effect explained by relativity. With quantum particles, analogous effects can be studied. Credit: NASA / TU W… [+6777 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "The all-new Nokia 105 & 106 4G now available with built-in UPI apps- first budget smartphones to be loaded with UPI feature - The Tech Outlook", "description": "Payments with UPI have become the default payment mode nowadays, especially in the past few years. Though the UPI payments were only possible after app installation only on smartphones. But now this has been changed by Nokia as the company has made U", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/the-all-new-nokia-105-106-4g-now-available-with-built-in-upi-apps-first-budget-smartphones-to-be-loaded-with-upi-feature/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/05/jpg_20230520_153234_00001.jpg", "publishedAt": "2023-05-20T10:40:11Z", "content": "Payments with UPI have become the default payment mode nowadays, especially in the past few years. Though the UPI payments were only possible after app installation only on smartphones. But now this … [+1379 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Marc McLaren", "title": "Quordle today - hints and answers for Saturday, May 20 (game #481) - TechRadar", "description": "Our clues will help you solve Quordle today and keep that streak going", "url": "https://www.techradar.com/news/quordle-today-answers-clues-20-may-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4XP9iNbdvkijJyZnzx3WoL-1200-80.jpg", "publishedAt": "2023-05-20T06:22:04Z", "content": "Quordle needs to be approached in a different way to Wordle. With four puzzles to solve in nine guesses, you can't blindly throw letters at it and expect to win - you'll stand a far better chance if … [+1813 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! Earth suffers blackouts as sun spews solar flares, NOAA satellite shows - HT Tech", "description": "A sunspot duo has been exploding non-stop, producing a barrage of M-class solar flares on the Sun. The ultraviolet radiation has resulted in a rolling series of blackouts across the planet. More solar storm trouble coming?", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-earth-suffers-blackouts-as-sun-spews-solar-flares-noaa-satellite-shows-71684555583290.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/20/1600x900/Sun_1677738983844_1684555628446.jpg", "publishedAt": "2023-05-20T04:12:22Z", "content": "The Geostationary Operational Environmental Satellite-16 (GOES-16), operated by the National Oceanic and Atmospheric Administration (NOAA) has picked up some really concerning data. According to its … [+2464 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "https://www.facebook.com/kslcom/", "title": "ChatGPT makes its debut as a smartphone app on iPhones - KSL.com", "description": "ChatGPT is now a smartphone app. That could be good news for people who like to use the artificial intelligence chatbot. But it might be bad news for all the clone apps that have tried to profit off the technology.", "url": "https://www.ksl.com/article/50648097/chatgpt-makes-its-debut-as-a-smartphone-app-on-iphones", "urlToImage": "https://img.ksl.com/slc/2930/293059/29305989.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2023-05-19T15:16:47Z", "content": "Estimated read time: 3-4\r\n minutes\r\nSAN FRANCISCO ChatGPT is now a smartphone app, which could be good news for people who like to use the artificial intelligence chatbot and bad news for all the clo… [+3303 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Breakthrough: First-Ever Measurement of a Quantum Paradox - SciTechDaily", "description": "How do quantum particles exchange information? An intriguing hypothesis regarding quantum information has recently been validated through experimental verification conducted at TU Wien. If you were to randomly pick an individual from a crowd who stands remark…", "url": "https://scitechdaily.com/physics-breakthrough-first-ever-measurement-of-a-quantum-paradox/", "urlToImage": "https://scitechdaily.com/images/Vacuum-Chamber-Containing-Atom-Chip-scaled.jpg", "publishedAt": "2023-05-19T09:49:49Z", "content": "ByVienna University of TechnologyMay 19, 2023\r\nVacuum chamber containing the atom chip. Credit: Thomas Schweigler, TU Wien\r\nHow do quantum particles exchange information? An intriguing hypothesis reg… [+3401 chars]"}]}