{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Google will no longer back up the Internet: Cached webpages are dead - Ars Technica", "description": "Google Search will no longer make site backups while crawling the web.", "url": "https://arstechnica.com/gadgets/2024/02/google-search-kills-off-cached-webpages/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2017/05/google-760x380.jpg", "publishedAt": "2024-02-02T21:09:05Z", "content": "67\r\nView more stories\r\nGoogle will no longer be keeping a backup of the entire Internet. Google Search's \"cached\" links have long been an alternative way to load a website that was down or had change… [+2350 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Byju’s says investors don’t have voting right to remove founder from edtech group - TechCrunch", "description": "Following months of behind-the-scenes conflict, Byju's and some of its biggest investors are now publicly airing their complaints about one another. Following months of behind-the-scenes conflict, Byju's and some of its biggest investors are now airing their …", "url": "https://techcrunch.com/2024/02/02/byjus-says-investors-dont-have-voting-right-to-remove-founder-from-edtech-group/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/GettyImages-1133907439.jpg?resize=1200,801", "publishedAt": "2024-02-02T15:11:18Z", "content": "Following months of behind-the-scenes conflict, Byju’s and some of its biggest investors are now publicly airing their complaints about one another.\r\nByju’s, once India’s most valuable startup, said … [+3726 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cygnus Cargo Craft Arrives at Space Station As Private Astronauts Prepare for Return to Earth - SciTechDaily", "description": "As part of NASA’s commercial resupply services, Northrop Grumman’s Cygnus cargo craft arrived at the International Space Station (ISS) today packed with science and supplies for the Expedition 70 crew. The seven orbital outpost residents now turn their attent…", "url": "https://scitechdaily.com/cygnus-cargo-craft-arrives-at-space-station-as-private-astronauts-prepare-for-return-to-earth/", "urlToImage": "https://scitechdaily.com/images/Canadarm2-Robotic-Arm-Reaches-Out-Toward-Cygnus-Space-Freighter-February-2024-scaled.jpg", "publishedAt": "2024-02-02T04:07:20Z", "content": "The Canadarm2 robotic arm reaches out toward Northrop Grumman’s Cygnus space freighter, packed with more than 8,200 pounds of science experiments, crew supplies, and station hardware, for capture and… [+4090 chars]"}]}