{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar flare eruptions likely soon, but solar storms not seen hitting Earth over the weekend - HT Tech", "description": "Prepare for an undisturbed weekend in space as Earth gets relief from solar storms. However, new sunspot AR3451 hints at a rise in solar flare activity thereafter.", "url": "https://tech.hindustantimes.com/tech/news/solar-flare-eruptions-likely-soon-but-solar-storms-not-seen-hitting-earth-over-the-weekend-71696146915747.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/01/1600x900/Solar_flare__1696147079552_1696147079783.jpg", "publishedAt": "2023-10-01T08:00:01Z", "content": "This weekend promises a stark contrast to the geomagnetic fireworks we witnessed last week. Unlike the previous weekend, there are no looming Coronal Mass Ejections (CMEs) threatening Earth's magneti… [+2440 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "Some iPhone 15 Pro, iPhone 15 Pro Max Case Makers Thought Apple Would Not Bring The Action Button To The Newer Models, Forcing A Design Revamp - Wccftech", "description": "Some case makers made the wrong on Apple not bringing the Action button to the iPhone 15 Pro and iPhone 15 Pro Max", "url": "https://wccftech.com/case-makers-thought-no-action-button-on-iphone-15-pro-max/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/09/Nomad-case-for-the-iPhone-15-Pro.jpg", "publishedAt": "2023-09-30T08:32:00Z", "content": "Apple introduced an Action button for the first time on the iPhone 15 Pro and iPhone 15 Pro Max, effectively replacing the mute switch but giving users an extra layer of functionality. However, some … [+2701 chars]"}, {"source": {"id": null, "name": "TechRepublic"}, "author": null, "title": "Video Encoding Library Leaves Chrome, Firefox and More Open to Zero-Day Attack - TechRepublic", "description": "Google and Mozilla have patched the zero-day vulnerability, which originates in the libvpx library.", "url": "https://www.techrepublic.com/article/google-zero-day-firefox-others/", "urlToImage": "https://www.techrepublic.com/wp-content/uploads/2017/05/tr71023-zero-day.jpeg", "publishedAt": "2023-09-29T19:12:00Z", "content": "Image: profit_image/Adobe Stock\r\nGoogle and Mozilla have patched a zero-day exploit in Chrome and Firefox, respectively. The zero-day exploit was being used by a commercial spyware vendor. The zero-d… [+3650 chars]"}]}