{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Missing Link in Cognitive Processing? Scientists Discover Swirling Spirals in the Brain - SciTechDaily", "description": "The findings have the potential to advance both computing and understanding of the brain. Scientists from the University of Sydney and Fudan University have found human brain signals traveling across the outer layer of neural tissue that naturally arrange the…", "url": "https://scitechdaily.com/the-missing-link-in-cognitive-processing-scientists-discover-swirling-spirals-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Spiral-Numbers.jpg", "publishedAt": "2023-09-04T21:32:58Z", "content": "Scientists have discovered that human brain signals form swirling spirals on the outer layer of neural tissue, which play a crucial role in organizing brain activity and cognitive processes. This dis… [+4033 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Long-term cognitive advantages found in infant formula with milk addition - Tech Explorist", "description": "Enhanced Neurodevelopmental outcomes in kids with special infant formula.", "url": "https://www.techexplorist.com/long-term-cognitive-advantages-infant-formula-milk-addition/68776/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/09/mother-feeds-baby-from-bottle.jpg", "publishedAt": "2023-09-04T10:06:57Z", "content": "Breast milk is known to be the best nutrition for babies, but not all families can breastfeed for various reasons. In the U.S., only 45% of babies are exclusively breastfed for the first three months… [+2698 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "59-foot Apollo group asteroid to buzz Earth soon, NASA reveals - HT Tech", "description": "An Apollo group asteroid is on its way towards Earth and may make a close approach to the planet soon, according to NASA. Know its speed, distance, size and other details.", "url": "https://tech.hindustantimes.com/tech/news/59foot-apollo-group-asteroid-to-buzz-earth-soon-nasa-reveals-71693797861056.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/orbit-viewer-snapshot_1693798026215_1693798033966.jpg", "publishedAt": "2023-09-04T03:27:53Z", "content": "NASA has issued details about an asteroid that is expected to fly past Earth at a close distance. The asteroid, given the designation of Asteroid 2021 JA5, is on its way towards Earth and will make i… [+2299 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dazzling auroras delight social media as solar storm strikes Earth - HT Tech", "description": "A dazzling Northern Lights show lit up the sky due to an unexpected solar storm, surprising skygazers and electrifying social media.", "url": "https://tech.hindustantimes.com/tech/news/dazzling-auroras-delight-social-media-as-solar-storm-strikes-earth-71693795107161.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/04/1600x900/Solar_Storm_1693795301579_1693795301852.jpg", "publishedAt": "2023-09-04T02:43:12Z", "content": "A spectacular northern lights show lit up the sky early on Sunday morning, delighting people and filling social media with stunning pictures. This amazing display was caused by a solar storm that was… [+1696 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rewriting the Rules of Longevity: Scientists Propose Alternative Connection Between Diet and Aging - SciTechDaily", "description": "Is it possible to achieve healthy aging through eating? Yeast research points the way to securing better health in our golden years. Scientists from the Babraham Institute suggest an alternative connection between diet and aging, based on studies in yeast. Dr…", "url": "https://scitechdaily.com/rewriting-the-rules-of-longevity-scientists-propose-alternative-connection-between-diet-and-aging/", "urlToImage": "https://scitechdaily.com/images/Gold-Particles-Glowing-Human-Lifespan-Longevity.jpg", "publishedAt": "2023-09-04T01:51:12Z", "content": "Researchers have found that dietary changes in yeast can lead to healthy aging without calorie restriction. By switching the yeasts diet from glucose to galactose at an early age, the team was able t… [+3175 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Puzzles: Unraveling the Cosmic Origins of Life in the Lab - SciTechDaily", "description": "Scientists are pushing to understand life's chemical origins and potential development in cosmic environments, investigating scenarios like hydrothermal vents, meteorites, potential exotic life on Saturn's moon, and lab-based Darwinian evolution. Research inv…", "url": "https://scitechdaily.com/primordial-puzzles-unraveling-the-cosmic-origins-of-life-in-the-lab/", "urlToImage": "https://scitechdaily.com/images/Life-in-Lab-Art-Concept.jpg", "publishedAt": "2023-09-03T08:13:21Z", "content": "ByPat Brennan, NASA's Exoplanet Exploration ProgramSeptember 3, 2023\r\nNASA scientists, along with a global team, are pushing the boundaries to understand how life might originate and evolve in divers… [+20166 chars]"}]}