{"articles": [{"author": "HT Tech", "content": "Since Holi is the festival of colours, one is bound to whip out a camera and click some really incredible, colour-filled shots. However, whats the next best thing after DSLR these days - a smartphone… [+3829 chars]", "description": "Not all of us know the tricks to click good images. So, here are some tips before you go out there and try take some really good images.", "publishedAt": "2021-03-29T04:22:47Z", "source": {"id": null, "name": "Hindustan Times"}, "title": "Smartphone photography during Holi 2021: Tips to take better pictures - HT Tech", "url": "https://tech.hindustantimes.com/mobile/news/smartphone-photography-during-holi-2021-tips-to-take-better-pictures-71616991767542.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/03/29/600x338/vishnu-nishad-1f9Lj3Et8A8-unsplash_1616991984342_1616991998794.jpg"}, {"author": "David Carrigg", "content": "Article content\r\nOn Sunday the Integrated Homicide Investigation Team (IHIT) reported Yannick Bandaogo, 28, had been charged with second-degree murder in the stabbing attack outside the Lynn Valley l… [+12396 chars]", "description": "Short film that featured a man named Yannick Bandaogo training at the Techno-Boxe boxing club in Longueuil, Quebec, was removed from YouTube late Sunday.", "publishedAt": "2021-03-29T03:47:04Z", "source": {"id": null, "name": "Vancouver Sun"}, "title": "Here's what we know about the man charged in the fatal North Vancouver stabbing attack - Vancouver Sun", "url": "https://vancouversun.com/news/local-news/heres-what-we-know-about-the-man-charged-in-the-fatal-north-vancouver-stabbing-attack", "urlToImage": "https://smartcdn.prod.postmedia.digital/vancouversun/wp-content/uploads/2021/03/north-vancouver-incident-20210327-1.jpg"}, {"author": "Matt Swider", "content": "Our Nvidia GeForce RTX 3080 stock tracker with live Twitter updates is going to help you buy the GPU, and so far we've found it back in stock at Amazon, Best Buy and even GameStop, with Newegg occasi… [+2329 chars]", "description": "Our RTX 3080 stock Twitter tracker will send you alerts when there's a restock at Amazon, Newegg, Best Buy or GameStop", "publishedAt": "2021-03-28T22:18:10Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "RTX 3080 stock tracker: buy the Nvidia GPU with our live Twitter updates - TechRadar", "url": "https://www.techradar.com/news/rtx-3080-stock-tracker", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mmQdLWrV8vR9mLW8ZDmVRd-1200-80.jpg"}, {"author": "CLARA CHONG", "content": "Covid-19 vaccines that use mRNA technology have been found to be the best at preventing symptomatic infection against variant strains, a comparison of the efficacy levels of different vaccines agains… [+2387 chars]", "description": "Covid-19 vaccines that use mRNA technology have been found to be the best at preventing symptomatic infection against variant strains, a comparison of the efficacy levels of different vaccines against the variants has shown. mRNA vaccines, notably the ones de…", "publishedAt": "2021-03-28T22:00:00Z", "source": {"id": null, "name": "Www.tnp.sg"}, "title": "mRNA vaccines top at blocking symptomatic infection against variants - The New Paper", "url": "https://www.tnp.sg/news/singapore/mrna-vaccines-top-blocking-symptomatic-infection-against-variants", "urlToImage": "https://www.tnp.sg/sites/default/files/styles/rl680/public/articles/2021/03/29/NP_20210329_CCCOVID29_6430992.jpg?itok=LpEu53Cp"}, {"author": null, "content": "Artist’s rendering showing a cutaway view into the interior of Saturn’s moon Enceladus. A plume of ice particles, water vapor, and organic molecules sprays from fractures in the moon’s south polar re… [+4087 chars]", "description": "Buried beneath 20 kilometers of ice, the subsurface ocean of Enceladus—one of Saturn's moons—appears to be churning with currents akin to those on Earth. The theory, derived from the shape of Enceladus's ice shell, challenges the current thinking that the moo…", "publishedAt": "2021-03-28T18:13:22Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "Encased in an Icy Shell, the Ocean on Saturn’s Moon Enceladus Appears to Be Churning - SciTechDaily", "url": "https://scitechdaily.com/encased-in-an-icy-shell-the-ocean-on-saturns-moon-enceladus-appears-to-be-churning/", "urlToImage": "https://scitechdaily.com/images/Enceladus-Plume.jpg"}, {"author": "Staff", "content": "As COVID-19 vaccine supplies ramp up across the country, most provinces and territories have released details of who can expect to receive a shot in the coming weeks.\r\nThe military commander handling… [+12483 chars]", "description": "Health Canada anticipates a total of 36.5 million doses from Pfizer-BioNTech, Moderna and the AstraZeneca vaccine from the Serum Institute of India by June 30.", "publishedAt": "2021-03-28T13:21:07Z", "source": {"id": null, "name": "Global News"}, "title": "A look at who’s set to receive COVID 19 vaccines in the coming weeks in each province - Global News", "url": "https://globalnews.ca/news/7724427/coronavirus-vaccine-eligibility-per-province/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/03/GettyImages-1231612572.jpg?quality=85&strip=all&w=720&h=379&crop=1"}, {"author": "Gregor Chappelle", "content": "Complaints about VAR are usually related to players being millimetres offside or how it's \"killing the game\" and should be taken away, however Saturday night's World Cup qualifier between Portugal an… [+2063 chars]", "description": "Complaints about VAR are usually related to players being millimetres offside or how it&apos;s &quot;killing the game&quot; and should be taken away,...", "publishedAt": "2021-03-28T11:03:44Z", "source": {"id": "marca", "name": "Marca"}, "title": "Why is there no VAR or goal-line technology in World Cup qualifiers? - MARCA.com", "url": "https://www.marca.com/en/football/international-football/2021/03/28/6060627ce2704e0a218b4647.html", "urlToImage": "https://phantom-marca.unidadeditorial.es/faf4193dff7807b95157149bf62d975b/f/jpg/assets/multimedia/imagenes/2021/03/28/16169291508075.jpg"}, {"author": "CNA", "content": "HONG KONG: Hong Kong's government said an initial investigation by Germany's BioNTech and Fosun Industrial into its coronavirus vaccine did not show any \"obvious systemic factors\" during packaging af… [+1871 chars]", "description": "Hong Kong's government said an initial investigation by Germany's BioNTech and Fosun Industrial into its coronavirus vaccine did not show any \"obvious systemic factors\" during packaging after use of the vaccine was suspended in the city and neighbouring Macau…", "publishedAt": "2021-03-28T00:55:14Z", "source": {"id": null, "name": "CNA"}, "title": "Hong Kong says initial investigation of BioNTech vaccines shows no 'obvious systemic factors' - CNA", "url": "https://www.channelnewsasia.com/news/asia/hong-kong-initial-investigation-biontech-vaccines-14509130", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14479990/16x9/991/557/1e6e461fccfc6c0f3bad4f89348ea062/Qn/covid-19-vaccinations-in-hong-kong-5.jpg"}], "message": "Successful api call", "number_of_news": 8, "status": 200, "topic": "tech"}