{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Dana Kennedy", "title": "Pava LaPere's suspected killer Jason Billingsley got out of prison early thanks to liberal 'good behavior' credits - New York Post ", "description": "The suspect in the murder of a Baltimore tech entrepreneur had a 30-year sentence in prison in 2015 but got out in 2022, not as a result of parole but due to an earned credit system for good behavi…", "url": "https://nypost.com/2023/09/30/jason-billingsley-released-early-due-to-liberal-good-behavior-credits/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/09/NYPICHPDPICT000049225367-1.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-09-30T23:15:00Z", "content": "The suspect in last week’s vicious murder of a young Baltimore tech entrepreneur was sentenced to serve a 30-year sentence in prison in 2015 but got out in 2022 — not as a result of parole but becaus… [+4774 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "Sébastian SEIBT", "title": "'Counterfeit people': The dangers posed by Meta's AI celebrity lookalike chatbots - FRANCE 24 English", "description": "Meta announced on Wednesday the arrival of chatbots with personalities similar to certain celebrities, with whom it will be possible to chat. Presented as an entertaining evolution of ChatGPT and other forms of AI, this latest technological development could …", "url": "https://www.france24.com/en/technology/20230930-counterfeit-people-the-dangers-posed-by-meta-s-ai-celebrity-lookalike-chatbots", "urlToImage": "https://s.france24.com/media/display/fa812c06-5ed5-11ee-aa02-005056bfb2b6/w:1280/p:16x9/human-ia-3.jpg", "publishedAt": "2023-09-30T15:27:41Z", "content": "Meta announced on Wednesday the arrival of chatbots with personalities similar to certain celebrities, with whom it will be possible to chat. Presented as an entertaining evolution of ChatGPT and oth… [+6896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Develop Incredibly Lightweight Material 4 Times Stronger Than Steel - SciTechDaily", "description": "Researchers developed a light yet strong material by combining two unexpected ingredients—DNA and glass. Working at the nanoscale provides scientists with a deep understanding and precision in crafting and analyzing materials. In broader-scale production, and…", "url": "https://scitechdaily.com/scientists-develop-incredibly-lightweight-material-4-times-stronger-than-steel/", "urlToImage": "https://scitechdaily.com/images/DNA-Inside-Glass.jpg", "publishedAt": "2023-09-30T14:51:06Z", "content": "ByBrookhaven National LaboratorySeptember 30, 2023\r\nResearchers have created a novel material by coating DNA with a pure form of glass, resulting in a substance that is lighter and stronger than stee… [+12096 chars]"}]}