{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Worst solar storm of the century DESTROYED power grids; Know if it can strike us again in 2023 - HT Tech", "description": "In 1989, a solar storm struck the Earth that was so powerful that it caused a 9-hour-long power outage and sparked a massive radio blackout. Know all about it.", "url": "https://tech.hindustantimes.com/tech/news/worst-solar-storm-of-the-century-destroyed-power-grids-know-if-it-can-strike-us-again-in-2023-71685422151912.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/30/1600x900/sun-4444454_1920_1651753999330_1685422196930.jpg", "publishedAt": "2023-05-30T05:00:26Z", "content": "The Carrington event is the most intense solar storm event in our recorded history, but it occurred 164 years ago in 1859, and back then, humans had rudimentary communications technology, but even th… [+2632 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo asteroid set for Earth encounter today! NASA tech reveals speed, size, and more - HT Tech", "description": "A Near-Earth Asteroid (NEA) is hurtling towards Earth and could make its closest approach to Earth today, NASA has revealed. Know details", "url": "https://tech.hindustantimes.com/tech/news/apollo-asteroid-set-for-earth-encounter-today-nasa-tech-reveals-speed-size-and-more-71685421233462.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/30/1600x900/asteroid_1681212528521_1685421316966.jpg", "publishedAt": "2023-05-30T04:35:38Z", "content": "NASA, with the aid of the Pan-STARRS survey telescope, has recently discovered an asteroid that has been orbiting Earth and acting as a \"quasi-moon\" of our planet. It is also called the 2nd moon of E… [+1833 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study: Even Mild COVID-19 Can Have Long-Term Detrimental Effects on Heart Health - SciTechDaily", "description": "A groundbreaking study conducted a comparison of arterial stiffness between participants before and after contracting COVID-19. New research indicates that even mild instances of COVID-19 can lead to lasting harm to cardiovascular health. The study is the fir…", "url": "https://scitechdaily.com/?p=281066", "urlToImage": "https://scitechdaily.com/images/COVID-19-Omicron-Mutation.jpg", "publishedAt": "2023-05-30T03:16:31Z", "content": "ByUniversity of PortsmouthMay 29, 2023\r\nA recent study has found that even mild cases of COVID-19 can have lasting negative effects on cardiovascular health.\r\nA groundbreaking study conducted a compa… [+5153 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Dia Rekhi and Aashish Aryan", "title": "Exclusive: Need solid reason to take down banned betting apps, says Apple - Economic Times", "description": "While the iPhone maker has not outright refused to comply with the February order by the ministry of electronics and information technology, Apple has made it clear that it cannot “arbitrarily” remove the betting apps.", "url": "https://economictimes.indiatimes.com/tech/technology/apple-need-solid-reason-to-take-down-betting-apps/articleshow/100602180.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100602175,width-1070,height-580,imgsize-1323004,overlay-ettech/photo.jpg", "publishedAt": "2023-05-30T00:30:00Z", "content": "Apple has told Indian officials that it needs a concrete reason or a legal requirement to fully comply with the Centres directive to take down betting apps from its App Store, according to people dir… [+5278 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genes Don't Lie: DNA Reveals a New Twist in Human Origin Story - SciTechDaily", "description": "Contemporary DNA evidence suggests that humans emerged from the interaction of multiple populations living across the continent. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations acros…", "url": "https://scitechdaily.com/genes-dont-lie-dna-reveals-a-new-twist-in-human-origin-story/", "urlToImage": "https://scitechdaily.com/images/DNA-Human-Origins.jpg", "publishedAt": "2023-05-29T21:33:28Z", "content": "ByMcGill UniversityMay 29, 2023\r\nA study published in the journal Nature has proposed a new model for human evolution, asserting that modern Homo sapiens stemmed from multiple genetically diverse pop… [+4847 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Lunar Orbiter Captures Impact Site of Failed HAKUTO-R Moon Lander - SciTechDaily", "description": "The HAKUTO-R Mission 1 lunar lander, launched by ispace in December 2022, failed to land safely on the Moon. In April 2023, NASA's Lunar Reconnaissance Orbiter detected unusual surface changes and debris near the intended landing site, suggesting potential re…", "url": "https://scitechdaily.com/nasas-lunar-orbiter-captures-impact-site-of-failed-hakuto-r-moon-lander/", "urlToImage": "https://scitechdaily.com/images/HAKUTO-R-Mission-1.jpg", "publishedAt": "2023-05-29T18:42:44Z", "content": "ByNASA's Goddard Space Flight CenterMay 29, 2023\r\nThe Series 1 Lander was optimized for light weight, small size and reliability. Although the lander did not complete a soft landing, the cause has be… [+4543 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exploring Quantum Gravity: Physicists Tune In to the Cosmic Ring of Black Holes - SciTechDaily", "description": "New methods will allow for better tests of Einstein's general theory of relativity using LIGO data. Albert Einstein's general theory of relativity describes how the fabric of space and time, or spacetime, is curved in response to mass. Our sun, for example, w…", "url": "https://scitechdaily.com/exploring-quantum-gravity-physicists-tune-in-to-the-cosmic-ring-of-black-holes/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Accetion-Disc-Art-Illustration.jpg", "publishedAt": "2023-05-29T16:15:32Z", "content": "ByWhitney Clavin, CaltechMay 29, 2023\r\nCaltech-led studies propose new, stringent tests for Einsteins general theory of relativity, seeking signs of quantum gravity in the ripples of spacetime genera… [+9781 chars]"}, {"source": {"id": null, "name": "Longevity.technology"}, "author": "Roselle Espina", "title": "Brisk walking and jogging for your health and wellbeing - Longevity.Technology", "description": "Brisk walking or jogging outdoors are some examples of physical activity that boost the body’s vitamin D levels.", "url": "https://longevity.technology/lifestyle/brisk-walking-and-jogging-for-your-health-and-wellbeing/", "urlToImage": "https://longevity.technology/lifestyle/wp-content/uploads/2023/05/person-jogging-with-rainbow-colored-wall-in-background.jpg", "publishedAt": "2023-05-29T13:17:42Z", "content": "Physical activities like regular brisk walking and jogging may seem simple for some people, but these two cardio workouts can actually add more years to your life. \r\nWhen you exercise for just 30 min… [+9066 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Private Astronaut Mission, Autonomous Snake-Like Robot Explorer, TROPICS Launch - SciTechDaily", "description": "The second all-private astronaut mission to the space station … Completing the set of tiny severe weather trackers … And a robotic explorer – with a twist … A few of the stories to tell you about – This Week at NASA! https://youtu.be/lCxuWNoYFwQ Second Privat…", "url": "https://scitechdaily.com/this-week-nasa-private-astronaut-mission-autonomous-snake-like-robot-explorer-tropics-launch/", "urlToImage": "https://scitechdaily.com/images/Exobiology-Extant-Life-Surveyor-EELS-scaled.jpg", "publishedAt": "2023-05-28T19:14:43Z", "content": "ByNASAMay 28, 2023\r\nIllustration of the Exobiology Extant Life Surveyor (EELS) concept. Credit NASA/JPL-CalTech\r\nThe second all-private astronaut mission to the space station \r\nCompleting the set of … [+3436 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Forges Ahead in Crucial Test Series: Moon Rocket Engine Hot Fire - SciTechDaily", "description": "NASA has successfully completed a full-length hot fire test of the RS-25 engine, marking a crucial step in the Artemis missions that aim to return humans to the Moon and ultimately Mars. NASA completed a full-duration hot fire of the RS-25 certification engin…", "url": "https://scitechdaily.com/nasa-forges-ahead-in-crucial-test-series-moon-rocket-engine-hot-fire/", "urlToImage": "https://scitechdaily.com/images/RS-25-Certification-Engine-Hot-Fire-Test-scaled.jpg", "publishedAt": "2023-05-28T17:16:32Z", "content": "ByNASA's Stennis Space CenterMay 28, 2023\r\nOn May 23, NASA completed a significant full duration hot fire of the RS-25 certification engine at the Stennis Space Center in Mississippi. This was the ei… [+4981 chars]"}]}