{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Ahead of MWC 2024, new photo-centric Xiaomi 14 Ultra smartphone launched - HT Tech", "description": "Xiaomi unveiled AI-enhanced 14 Series smartphone with quad-camera setup developed with Leica and new wearable gadgets at MWC 2024. The phones integrate large AI models for diverse applications and feature unique design elements like nano-tech vegan leather an…", "url": "https://tech.hindustantimes.com/mobile/news/ahead-of-mwc-2024-new-photo-centric-xiaomi-14-ultra-smartphone-launched-71708880196499.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/26/1600x900/X14_1708912631647_1708912661852.png", "publishedAt": "2024-02-26T02:00:49Z", "content": "Ahead of the MWC 2024, Chinese consumer electronics maker Xiaomi on Sunday launched for international markets its new AI-enhanced and photography-geared 14 Series smartphone, along with other wearabl… [+3009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "A hot pink Barbie flip phone, Xiaomi 14 Ultra with Leica camera grab attention at Europe’s biggest tech show - The Indian Express", "description": "HMD Global’s Barbie flip phone was the star of the show, but the Xiaomi 14 Ultra and its new camera system also grabbed attention at the Mobile World Congress in Barcelona.", "url": "https://indianexpress.com/article/technology/a-hot-pink-barbie-flip-phone-xiaomi-14-ultra-with-leica-camera-grab-attention-at-europes-biggest-tech-show-9180819/", "urlToImage": "https://images.indianexpress.com/2024/02/Xiaomi-14-Ultra.-1jpg.jpeg", "publishedAt": "2024-02-26T00:06:09Z", "content": "Soon, a Barbie flip phone will make its way to the market, courtesy of HMD, short for Human Mobile Devices, and toy maker Mattel. During the Mobile World Congress on Sunday, HMD Global and Mattel ann… [+4421 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Arjun Kharpal", "title": "Chinese tech firm Lenovo shows off a laptop with a see-through screen - CNBC", "description": "Chinese tech giant Lenovo showed off a prototype laptop on Monday that has a see-through screen.", "url": "https://www.cnbc.com/2024/02/25/chinas-lenovo-shows-off-a-laptop-with-a-see-through-screen.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107377936-1708794513442-Lenovo_Transparent_Laptop_Main_Pic.jpg?v=1708794929&w=1920&h=1080", "publishedAt": "2024-02-25T23:00:01Z", "content": "Lenovo's concept laptop has a see-through screen.\r\nChinese tech giant Lenovo showed off a prototype laptop on Monday that has a see-through screen, underscoring how the world's largest PC maker is tr… [+1626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I Continue To Remain CEO\": Byju Raveendran Day After Shareholders' Move - NDTV", "description": "Amidst growing trouble in the edtech firm Byju's, the company's CEO Byju Raveendran told employees that he continues to remain the chief executive officer of the company.", "url": "https://www.ndtv.com/india-news/byjus-i-continue-to-remain-ceo-byju-raveendran-day-after-shareholders-move-5123237", "urlToImage": "https://c.ndtvimg.com/2022-11/mh11kjs8_byju-raveendran-afp-650_625x300_01_November_22.jpg", "publishedAt": "2024-02-25T06:46:57Z", "content": "Amidst growing trouble in the edtech firm Byju's, company's CEO Byju Raveendran told employees that he continues to remain the chief executive officer of the company. On Saturday, Mr Raveendran wrote… [+2009 chars]"}, {"source": {"id": null, "name": "Modern Diplomacy"}, "author": "Newsroom", "title": "Sora: OpenAI unveils A.I. that instantly generates eye-popping videos - Modern Diplomacy", "description": "In April, a New York start-up called Runway AI unveiled technology that let people generate videos, like a cow at a birthday party or a dog chatting", "url": "https://moderndiplomacy.eu/2024/02/24/sora-openai-unveils-a-i-that-instantly-generates-eye-popping-videos/", "urlToImage": "https://moderndiplomacy.eu/wp-content/uploads/2024/02/openai-sora.jpg", "publishedAt": "2024-02-24T15:08:19Z", "content": "In April, a New York start-up called Runway AI unveiled technology that let people generate videos, like a cow at a birthday party or a dog chatting on a smartphone, simply by typing a sentence into … [+3427 chars]"}]}