{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Stock market today: Day trading guide for Nifty 50 to Sensex; six stocks to buy or sell today — 11th March | Mint - Mint", "description": "Stocks to buy today: Experts have recommended six day trading stocks for today — Zensar Tech, Blue Star, Hero Motocorp, Raymond, Tata Power, and Chambal Fertilisers", "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-day-trading-guide-for-nifty-50-to-sensex-six-stocks-to-buy-or-sell-today-11th-march-11710123530997.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/03/11/1600x900/Stock_market_today_Nifty_50_Stocks_to_Buy_or_sell_1710123733483_1710123733669.png", "publishedAt": "2024-03-11T02:53:21Z", "content": "Stock market today: Despite strong global cues on a possible US Fed rate cut buzz, the Indian stock market remained range-bound on Thursday last week. The Nifty 50 index added 19 points and closed at… [+7330 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Clement Tan", "title": "Japan averts technical recession as revised fourth-quarter data shows economy grew 0.4% - CNBC", "description": "A GDP contraction for a second straight quarter may have muddled the case for interest rate normalization for Bank of Japan Governor Kazuo Ueda.", "url": "https://www.cnbc.com/2024/03/11/japan-revised-final-4q-gdp-2023.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107384611-1709872484208-gettyimages-1282657378-20181117_0614__8104991.jpeg?v=1709882747&w=1920&h=1080", "publishedAt": "2024-03-10T23:56:12Z", "content": "Japan averted a technical recession as revised official data on Monday showed the economy returned to growth in the October-December period last year, bolstered by strong capital expenditure.\r\nThe up… [+2253 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's astronauts aboard International Space Station set to return to Earth on SpaceX Dragon - HT Tech", "description": "NASA's Crew 7, after a six-month stint on the International Space Station (ISS), is gearing up to return to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasas-astronauts-aboard-international-space-station-set-to-return-to-earth-on-spacex-dragon-71710078806646.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/10/1600x900/Ukraine-Tensions-Space-3_1645814351869_1710079067470.jpg", "publishedAt": "2024-03-10T13:59:09Z", "content": "NASA's Crew 7 mission is poised to conclude its six-month residency aboard the International Space Station (ISS), with seven astronauts preparing to return to Earth. Throughout their extended stay, t… [+2312 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Historic Discovery: The Farthest Active Supermassive Black Hole Ever Found - SciTechDaily", "description": "The enigmatic galaxy GN-z11 is one of the youngest ever observed. Delivering on its promise to transform our understanding of the early universe, the James Webb Space Telescope is probing galaxies near the dawn of time. One of these is the exceptionally lumin…", "url": "https://scitechdaily.com/webbs-historic-discovery-the-farthest-active-supermassive-black-hole-ever-found/", "urlToImage": "https://scitechdaily.com/images/Wispy-Galaxy-Concept.jpg", "publishedAt": "2024-03-10T10:34:08Z", "content": "Researchers using the James Webb Space Telescope have made groundbreaking discoveries in galaxy GN-z11, which is one of the most distant and luminous galaxies known. They identified a supermassive bl… [+5930 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering the Dark: The Accelerating Universe and the Quest for Dark Energy - SciTechDaily", "description": "Dark energy's role in propelling the universe's accelerated expansion presents a pivotal challenge in astrophysics, driving ongoing research and space missions dedicated to uncovering the nature of this mysterious force. Some 13.8 billion years ago, the unive…", "url": "https://scitechdaily.com/deciphering-the-dark-the-accelerating-universe-and-the-quest-for-dark-energy/", "urlToImage": "https://scitechdaily.com/images/History-Universe-Infographic-scaled.jpg", "publishedAt": "2024-03-10T08:32:48Z", "content": "The history of the universe is outlined in this infographic. Credit: NASA\r\nDark energy’s role in propelling the universe’s accelerated expansion presents a pivotal challenge in astrophysics, driving … [+14562 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "An engine that can conjure thrust from thin air? We speak to the designer - The Register", "description": "Chatting to Anmol Taploo about the race to develop tech for satellites", "url": "https://www.theregister.com/2024/03/09/darpa_abep_project_interview/", "urlToImage": "https://regmedia.co.uk/2019/12/03/earth_atmosphere.jpg", "publishedAt": "2024-03-09T10:34:00Z", "content": "Interview Will satellites be capable of generating their own thrust with propellant created out of thin air one day? Scientists at the George Washington University (GWU) and Princeton Plasma Physics … [+4678 chars]"}]}