{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "TechNave"}, "author": null, "title": "Redmi K50 Gaming Pro review - TechNave", "description": "", "url": "https://technave.com/tag/Redmi-K50-Gaming-Pro-review", "urlToImage": "/data/files/mall/settings/site_logo.jpg", "publishedAt": "2021-11-22T05:36:46Z", "content": "Rumours of the Redmi K50 series first popped up in July. Since then, there hasn't been that many details about it, but a K50 Pro+ model with a 108MP camera is allegedly part of the series. Sources no… [+59 chars]"}, {"source": {"id": null, "name": "Klgadgetguy.com"}, "author": "Daniel", "title": "Pre-Order the Sony Xperia 5 III and get free wireless earbuds worth RM549! - KLGadgetGuy - Explore, Educate, Smartphones, Computers, Automotive Tech", "description": "A few days ago, Sony made their Xperia 5 III smartphone available for pre-order", "url": "https://klgadgetguy.com/pre-order-sony-xperia-5-iii-free-wireless-earbuds/", "urlToImage": "https://klgadgetguy.com/wp-content/uploads/2021/11/Sony-Feat-Img.jpg", "publishedAt": "2021-11-22T04:06:06Z", "content": "A few days ago, Sony made their Xperia 5 III smartphone available for pre-order in Malaysia, which was released back in July. For a limited time, consumers can get gifts with the phone such as a scre… [+1246 chars]"}, {"source": {"id": null, "name": "Nasilemaktech.com"}, "author": "https://www.facebook.com/KokiYaps, https://www.facebook.com/KokiYaps", "title": "Quick review - ASUS Marshmellow Mouse MD100: Compact, silent, multi-connectivity - Nasi Lemak Tech", "description": "Here's a quick review for you guys - the ASUS Marshmellow Mouse MD100, or just the ASUS Mouse MD100 for short. While the \"Marshmellow\" is a part of the official name, I don't see ASUS printing that name on the mouse packaging itself.", "url": "https://nasilemaktech.com/quick-review-asus-marshmellow-mouse-md100/", "urlToImage": "https://i1.wp.com/nasilemaktech.com/wp-content/uploads/2021/11/ASUS-Marshmellow-Mouse-MD100-1.jpg", "publishedAt": "2021-11-22T04:00:35Z", "content": "Here’s a quick review for you guys – the ASUS Marshmellow Mouse MD100, or just the ASUS Mouse MD100 for short. While the “Marshmellow” is a part of the official name, I don’t see ASUS printing that n… [+2875 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising New Information on How Salt Affects Blood Flow in the Brain - SciTechDaily", "description": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the brain is affected by salt consumption. When neurons are activa…", "url": "https://scitechdaily.com/surprising-new-information-on-how-salt-affects-blood-flow-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Blood-Flow-MRI.jpg", "publishedAt": "2021-11-22T01:33:02Z", "content": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the br… [+4912 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Matt Bird", "title": "Ferrari announces 840hp V12 Daytona SP3 - Pistonheads.com", "description": "Most powerful Ferrari V12 ever, Can-Am inspired styling, LaFerrari tech - and you thought the 812 Comp was bold...", "url": "https://www.pistonheads.com/news/ph-eurocars/ferrari-announces-840hp-v12-daytona-sp3/44964", "urlToImage": "https://images.pistonheads.com/nimg/44964/Daytona_SP3_01.jpg", "publishedAt": "2021-11-21T20:05:44Z", "content": "The bar was set extremely high for the Ferrari Icona cars after the Monza SP1 and SP2. They looked sensational and were powered by arguably the greatest V12 in production, which was more than enough.… [+4962 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clever Physics Experiment That Produces “Something From Nothing” - SciTechDaily", "description": "New theory ‘detects’ light in the darkness of a vacuum. Black holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundaries of these massive objects, including light. The precise natu…", "url": "https://scitechdaily.com/clever-physics-experiment-that-produces-something-from-nothing/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Event-Horizon.gif", "publishedAt": "2021-11-21T18:27:40Z", "content": "New theory ‘detects’ light in the darkness of a vacuum.\r\nBlack holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundarie… [+5968 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Telephoto Snapshot of an Almost Total Lunar Eclipse - SciTechDaily", "description": "Predawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the lunar disk is not quite entirely immersed in Earth's dark umbral shadow during a long partial lunar eclipse. The partial eclipse w…", "url": "https://scitechdaily.com/stunning-telephoto-snapshot-of-an-almost-total-lunar-eclipse/", "urlToImage": "https://scitechdaily.com/images/Almost-Total-Lunar-Eclipse-Crop.jpg", "publishedAt": "2021-11-21T12:10:17Z", "content": "An Almost Total Lunar Eclipse. Credit &amp; Copyright: Robert Fedez\r\nPredawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the l… [+517 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Evidence of Eskom being destroyed from the inside: report - BusinessTech", "description": "Independent analysts have backed Eskom chief executive André de Ruyter’s claims of sabotage at the embattled power utility, with multiple incidents of malicious damage seen across the group’s operations.", "url": "https://businesstech.co.za/news/energy/539754/evidence-of-eskom-being-destroyed-from-the-inside-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Eskom-fire.png", "publishedAt": "2021-11-21T06:04:33Z", "content": "Independent analysts have backed Eskom chief executive André de Ruyter’s claims of sabotage at the embattled power utility, with multiple incidents of malicious damage seen across the group’s operati… [+2997 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Chukwuemeka Fred Agbata Jnr", "title": "Deploying technology to address food insecurity - The Punch", "description": null, "url": "https://punchng.com/deploying-technology-to-address-food-insecurity/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2020/05/31173538/Chukwuemeka-Fred-Agbata1.jpg", "publishedAt": "2021-11-20T23:20:28Z", "content": "Extreme poverty and hunger continue to fuel increases in food thefts and other petty crimes. If this ugly development is left unaddressed, the situation could become volatile causing an uprising agai… [+6426 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa faces a massive car problem, analysts warn - BusinessTech", "description": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030 which means there is an urgent need for added investment to shift to electric vehicle (EV) manufacturin…", "url": "https://businesstech.co.za/news/motoring/533744/south-africa-faces-a-massive-car-problem-analysts-warn/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/03/I-pace-electric-car.png", "publishedAt": "2021-11-20T10:01:14Z", "content": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030, which means there is an urgent need for ad… [+4181 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Alex Whitelock", "title": "Best Samsung Black Friday deals: save on QLED TVs, Galaxy S21, and more today - TechRadar", "description": "Huge discounts on some of the best tech in the business", "url": "https://www.techradar.com/news/best-samsung-black-friday-deals-save-on-qled-tvs-galaxy-s21-and-more-today", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZQeUxYt5KUDXHR6wenbttA-1200-80.jpg", "publishedAt": "2021-11-19T23:00:55Z", "content": "We may be a week away from the big day itself, but you don't have to wait if you're looking for Samsung Black Friday deals - there are already a ton of excellent early discounts available on the main… [+1628 chars]"}]}