{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Lim Hui Jie", "title": "Japan's Nikkei tumbles 2% as Asia markets fall ahead of Powell's Jackson Hole speech - CNBC", "description": "Markets also declined as the tech fuel rally on Wall Street ended.", "url": "https://www.cnbc.com/2023/08/25/asia-markets.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107190608-1675813831098-gettyimages-1245884991-hyajjuy00w2JPG.jpeg?v=1692921167&w=1920&h=1080", "publishedAt": "2023-08-25T07:57:00Z", "content": "All of the S&amp;P sectors were in the red on Thursday, with information technology, consumer discretionary and communication services being the biggest laggards of the market. Financials made a shor… [+933 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "ISS Fires Engines To Dodge Space Debris While Awaiting Cargo Delivery - SciTechDaily", "description": "The Expedition 69 crew will receive a space delivery late Thursday night and a new crew will soon launch to the International Space Station (ISS). While the orbital residents were getting ready for both missions there was still some time for gene therapy rese…", "url": "https://scitechdaily.com/iss-fires-engines-to-dodge-space-debris-while-awaiting-cargo-delivery/", "urlToImage": "https://scitechdaily.com/images/Earth-From-Space-Station-scaled.jpg", "publishedAt": "2023-08-25T07:07:54Z", "content": "ByNASAAugust 25, 2023\r\nThe Expedition 69 crew at the ISS awaits cargo delivery from Roscosmos and the SpaceX Crew-7 mission launch. Amid these events, the crew engaged in gene therapy research and pr… [+8887 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists uncovered a previously unknown mechanism for protein degradation in cells - Tech Explorist", "description": "The mechanism degrades short-lived proteins that support brain and immune functions.", "url": "https://www.techexplorist.com/previously-unknown-mechanism-protein-degradation-cells/67853/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/08/cells-bg.jpg", "publishedAt": "2023-08-25T06:38:28Z", "content": "Short-lived proteins regulate gene expression in cells to carry out various crucial functions. These proteins are created in the nucleus and, after performing their function, are promptly eliminated.… [+4631 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Building-sized asteroid racing towards Earth, warns NASA; check speed and close approach - HT Tech", "description": "NASA has revealed details of a close encounter with an asteroid that is nearly the size of the Tunguska space rock that caused catastrophic damage in 1908. Know details of the close approach.", "url": "https://tech.hindustantimes.com/tech/news/buildingsized-asteroid-racing-towards-earth-warns-nasa-check-speed-and-close-approach-71692934312875.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/25/1600x900/Gallery_1687692475811_1692934802526.jpg", "publishedAt": "2023-08-25T05:38:41Z", "content": "In the past decade, there have been several close calls with asteroids. While none of them have caused enough damage to wipe out life on Earth, they have impacted the surface and given us a stern ind… [+2177 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Sony is buying gaming headphone maker, Audeze - TechCrunch", "description": "Sony Interactive Entertainment (basically the PlayStation wing) today announced plans to acquire Audeze.", "url": "https://techcrunch.com/2023/08/24/sony-is-buying-gaming-headphone-maker-audeze/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/08/Screenshot-2023-08-24-at-12.23.09 PM.jpg?resize=1200,608", "publishedAt": "2023-08-24T16:30:00Z", "content": "Sony Interactive Entertainment (basically the PlayStation wing) today announced plans to acquire Audeze, the company has confirmed with TechCrunch. The Orange Country, California-based firm is best k… [+1850 chars]"}]}