{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Asteroid Sample Capsule Lands on Earth, Record Ride in Space, Artemis II Mission - SciTechDaily", "description": "NASA’s first asteroid sample return mission is back on Earth... A record ride in space for a NASA astronaut... And NASA’s Artemis II mission is making prelaunch progress... A few of the stories to tell you about – This Week at NASA! https://youtu.be/ct1Y0B1wm…", "url": "https://scitechdaily.com/?p=313738", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Sample-Return-Landing-5-scaled.jpg", "publishedAt": "2023-10-01T15:03:50Z", "content": "ByNASAOctober 1, 2023\r\nThe sample return capsule from NASAs OSIRIS-REx mission is seen shortly after touching down in the desert on September 24, 2023, at the Department of Defenses Utah Test and Tra… [+4974 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Codes for October 1: New FF MAX update coming soon with exciting in-game rewards - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for September 30: Players can earn amazing in-game items for free with the help of Garena Free Fire MAX redeem codes! Check them out below.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-codes-for-october-1-new-ff-max-update-coming-soon-with-exciting-in-game-rewards-71696125032345.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/01/1600x900/FSBQdE1UYAI31IA_1651799976574_1696125181569.png", "publishedAt": "2023-10-01T01:55:24Z", "content": "Garena Free Fire MAX Redeem Codes for October 1: There's a big update called OB42 coming to Garena Free Fire Max, and before it arrives, the game makers are giving players a chance to try it out earl… [+2407 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "1000x More Precise: Breakthrough for Next Generation Atomic Clocks - SciTechDaily", "description": "X-ray laser shows a possible route to substantially increased precision time measurement. An international research team has taken a decisive step toward a new generation of atomic clocks. At the European XFEL X-ray laser, the researchers have created a much …", "url": "https://scitechdaily.com/1000x-more-precise-breakthrough-for-next-generation-atomic-clocks/", "urlToImage": "https://scitechdaily.com/images/Scandium-Nuclear-Clock.jpg", "publishedAt": "2023-09-30T10:08:27Z", "content": "ByGerman Electron Synchrotron DESYSeptember 30, 2023\r\nAn artists rendition of the scandium nuclear clock: scientists used the X-ray pulses of the European XFEL to excite in the atomic nucleus of scan… [+7077 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "Some iPhone 15 Pro, iPhone 15 Pro Max Case Makers Thought Apple Would Not Bring The Action Button To The Newer Models, Forcing A Design Revamp - Wccftech", "description": "Some case makers made the wrong on Apple not bringing the Action button to the iPhone 15 Pro and iPhone 15 Pro Max", "url": "https://wccftech.com/case-makers-thought-no-action-button-on-iphone-15-pro-max/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/09/Nomad-case-for-the-iPhone-15-Pro.jpg", "publishedAt": "2023-09-30T08:32:00Z", "content": "Apple introduced an Action button for the first time on the iPhone 15 Pro and iPhone 15 Pro Max, effectively replacing the mute switch but giving users an extra layer of functionality. However, some … [+2701 chars]"}]}