{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Drash", "title": "Can flickering lights and sound slow Alzheimer’s? A researcher seeks that answer - CNN", "description": "A Georgia Tech researcher is turning flickering light and sound into a new tool in the fight against Alzheimer’s, using rhythmic sensory stimulation to “tune” brain waves, boost memory, and potentially slow the disease’s progression. Her hope is that this non…", "url": "https://www.cnn.com/health/flickering-lights-sound-slow-alzheimers-annabelle-singer-spc", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/singer-flickerdevice-closeup.jpeg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-02-16T09:53:42Z", "content": "Can Alzheimers disease be slowed by flickering lights and sound?\r\nThat is the question that drives Annabelle Singer, an associate professor and biomedical engineer at Georgia Institute of Technology … [+8154 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Henry Ren", "title": "Fund Beating 99% of Peers Sees Few Software Firms Surviving AI - Yahoo Finance", "description": "“We think application software faces an existential threat from AI,” said Evans, whose $12 billion global technology fund beat 99% of peers over one year and...", "url": "https://finance.yahoo.com/news/fund-beating-99-peers-sees-090000453.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/zgOOMF.IaWS32BFoBY.tXg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_holding_pen_162/f9fea30ca76a7394bdc04b232f8b18cd", "publishedAt": "2026-02-16T09:00:00Z", "content": "(Bloomberg) -- Selling software stocks before the crowd paid off for Nick Evans, a Polar Capital fund manager. His warning to potential bargain hunters: most shares are still toxic and few firms will… [+3720 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Rampant AI Demand for Memory Is Fueling a Growing Chip Crisis - Bloomberg.com", "description": "A growing procession of tech industry leaders including Elon Musk and Tim Cook are warning about a global crisis in the making: A shortage of memory chips is beginning to hammer profits, derail corporate plans and inflate price tags on everything from laptops…", "url": "https://www.bloomberg.com/news/articles/2026-02-15/rampant-ai-demand-for-memory-is-fueling-a-growing-chip-crisis", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i5vZVghtMFUU/v0/-1x-1.webp", "publishedAt": "2026-02-15T22:30:00Z", "content": "A growing procession of tech industry leaders including Elon Musk and Tim Cook are warning about a global crisis in the making: A shortage of memory chips is beginning to hammer profits, derail corpo… [+631 chars]"}]}