{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 stunning space images captured by NASA James Webb Space Telescope [June 2024] - HT Tech", "description": "5 stunning space images captured by NASA James Webb Space Telescope June 2024 Check out the breathtaking images of space and its objects captured by NASA James Webb Space Telescope. NASA James Webb Space Telescope is one of the newest and most powerful space …", "url": "https://tech.hindustantimes.com/web-stories/5-stunning-space-images-captured-by-nasa-james-webb-space-telescope-june-2024-71719195746431.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/24/1600x900/53495930003_5f20_1719196220214_1719196223033.jpg/", "publishedAt": "2024-06-24T02:30:27Z", "content": "Photo Credit: Pixabay Check out the breathtaking images of space and its objects captured by NASA James Webb Space Telescope. \r\nPhoto Credit: Pixabay NASA James Webb Space Telescope is one of the new… [+1149 chars]"}, {"source": {"id": null, "name": "Investopedia"}, "author": "Timothy Smith", "title": "Nvidia Stock in Spotlight After Drop From Record High - Investopedia", "description": "AI chipmaker Nvidia remains in focus after shares dropped from a record high reached Thursday and news that it will supply Middle Eastern telecommunications giant Ooredoo with its technology. Monitor these important chart levels.", "url": "https://www.investopedia.com/nvidia-stock-in-spotlight-after-drop-from-record-high-8667927", "urlToImage": "https://www.investopedia.com/thmb/gl3B24NHnc7Fj-mPtdeb_Dg0lT8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/NVDAChart-728c2c909550441cbb7d78311e8a1009.GIF", "publishedAt": "2024-06-24T01:58:00Z", "content": "<ul><li>AI chipmaker Nvidia remains in the spotlight after shares dropped from a record high reached Thursday and news that it will supply Middle Eastern telecommunications giant Ooredoo with its tec… [+2728 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Meta makes its AI chatbot available to all users in India - TechCrunch", "description": "After a few months of testing during the general elections, Meta is making its Llama-3-powered AI chatbot available to all users in India. However, Meta", "url": "https://techcrunch.com/2024/06/23/meta-makes-its-ai-chatbot-available-to-all-users-in-india/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Meta-AI.jpg?resize=1200,675", "publishedAt": "2024-06-24T00:30:00Z", "content": "After a few months of testing during the general elections, Meta is making its Llama-3-powered AI chatbot available to all users in India. However, Meta AI currently only supports English and no othe… [+2768 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Systematic Review Unveils the Best Way To Lose Weight - SciTechDaily", "description": "Systematic reviews of scientific data reveal significant differences in weight-loss outcomes among various methods. Systematic reviews of medical literature from 2020 to 2024 indicate that bariatric surgery, also referred to as metabolic or weight-loss surger…", "url": "https://scitechdaily.com/new-systematic-review-unveils-the-best-way-to-lose-weight/", "urlToImage": "https://scitechdaily.com/images/Bariatric-Surgery-Weight-Loss.jpg", "publishedAt": "2024-06-21T12:33:57Z", "content": "Systematic reviews from 2020 to 2024 indicate that bariatric surgery provides the most sustained and substantial weight loss compared to other treatments, maintaining about 25% weight loss for up to … [+4159 chars]"}]}