{"articles": [{"author": null, "content": "This cartoon shows a subducting oceanic plate traveling like a conveyor belt from the surface down to the lower mantle. The white arrows show the comparatively well-established shallow recycling path… [+4750 chars]", "description": "Findings allow us to trace how minerals from the surface are drawn down into the mantle. Diamonds that formed deep in the Earth's mantle contain evidence of chemical reactions that occurred on the seafloor. Probing these gems can help geoscientists understand…", "publishedAt": "2021-03-31T18:00:49Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "Diamonds That Formed Deep in the Earth’s Mantle Contain Evidence of Deep-Earth Recycling Processes - SciTechDaily", "url": "https://scitechdaily.com/diamonds-that-formed-deep-in-the-earths-mantle-contain-evidence-of-deep-earth-recycling-processes/", "urlToImage": "https://scitechdaily.com/images/Deep-Earth-Recycling.jpg"}, {"author": "Taylor Hatmaker", "content": "Everyone is scrambling to build a Clubhousecloneright now, but for Discord it makes perfect sense.\r\nWith everyone stuck at home searching for safe ways to rekindle their social lives over the last ye… [+2678 chars]", "description": "Everyone is scrambling to build a Clubhouse clone right now, but for Discord it makes perfect sense. With everyone stuck at home searching for safe ways to rekindle their social lives over the last year, Discord’s appeal exploded. The company cites new behavi…", "publishedAt": "2021-03-31T18:00:25Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "Discord is launching new Clubhouse-like channels for audio events - TechCrunch", "url": "http://techcrunch.com/2021/03/31/discord-stage-channels-voice-events/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/discord-stages.jpg?w=663"}, {"author": "Matthew Panzarino", "content": "Apple is adding two new voices to Siri’s English offerings, and eliminating the default ‘female voice’ selection in the latest beta version of iOS. This means that every person setting up Siri will c… [+2915 chars]", "description": "Apple is adding two new voices to Siri’s English offerings, and eliminating the default ‘female voice’ selection in the latest beta version of iOS. This means that every person setting up Siri will choose a voice for themselves and it will no longer default t…", "publishedAt": "2021-03-31T17:23:56Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "Apple adds two brand new Siri voices and will no longer default to a female or male voice in iOS - TechCrunch", "url": "http://techcrunch.com/2021/03/31/apple-adds-two-siri-voices/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/06/siri.png?w=682"}, {"author": "Hamish Hector", "content": "The latest Fortnite update on the Nintendo Switch has given players a performance boost, enhancing the games visuals and giving Fortnite a more consistent framerate. Fortnites total file size has als… [+1229 chars]", "description": "You might still lose, but at least it looks prettier", "publishedAt": "2021-03-31T16:36:37Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Fortnite gets performance boost on Nintendo Switch - Techradar", "url": "https://www.techradar.com/news/fortnite-gets-performance-boost-on-nintendo-switch", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fdURHi6mMEtfnXpChbxoS-1200-80.jpg"}, {"author": "The Irish Times", "content": "Shares in Deliveroo plunged by as much as 30 per cent in their trading debut on Wednesday, slicing more than £2 billion (2.35 bn) off the companys valuation in a blow to Britains ambitions to attract… [+4081 chars]", "description": "Pressure mounts on City’s efforts to boost profile as tech and listings hub post-Brexit", "publishedAt": "2021-03-31T14:37:30Z", "source": {"id": "the-irish-times", "name": "The Irish Times"}, "title": "Deliveroo shares sink 30% in London debut - The Irish Times", "url": "https://www.irishtimes.com/business/markets/deliveroo-shares-sink-30-in-london-debut-1.4524870", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4524869&origw=1440"}, {"author": "Samuel Tolbert", "content": "Genshin Impact is a popular anime-inspired free-to-play game available on mobile devices, PC and on PS4. While it can be played on the PS5 through backward compatibility, it doesn't take advantage of… [+1142 chars]", "description": "Ready to grind out even more heroes but with increased quality and performance?", "publishedAt": "2021-03-31T13:51:04Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Genshin Impact on PS5 is coming soon with faster loading and DualSense features - TechRadar", "url": "https://www.techradar.com/news/genshin-impact-ps5-version-is-coming-soon-with-faster-loading-and-dualsense-features", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4xeHSMcNLx9KEEYBwoNZCZ-1200-80.jpg"}, {"author": "Nick Statt", "content": "Arizona House Bill 2005, a hotly contested piece of legislation that would have imposed developer-friendly changes to Apple and Googles mobile app stores, is now on deaths door. The bill, which would… [+8625 chars]", "description": "Arizona’s controversial app store bill, HB2005, is on death’s door after it was mysteriously pulled at the last minute before a state senate vote last weekend. Here’s what happened, and how Big Tech lobbying factored into its failure before senators even vote…", "publishedAt": "2021-03-31T12:00:00Z", "source": {"id": "the-verge", "name": "The Verge"}, "title": "It’s game over for Arizona’s controversial App Store bill - The Verge", "url": "https://www.theverge.com/2021/3/31/22357121/arizona-hb2005-app-store-bill-dead-apple-google-big-tech-lobbying", "urlToImage": "https://cdn.vox-cdn.com/thumbor/N6UGM3ce3LDK2egJ7VT2nvMGZYA=/0x312:4608x2725/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/21903921/0420DD31_1DBC_4C2C_B4BF_1368A98D1E2D.jpeg"}, {"author": "Investor's Business Daily", "content": "Dow Jones futures fell slightly early Wednesday, while S&amp;P 500 futures edged higher and Nasdaq futures rose modestly as the stock market rally awaits President Biden's big infrastructure spending… [+13097 chars]", "description": "The Biden infrastructure plan is on tap with the stock market rally still choppy. Boeing, GM and U.S. Steel are above buy points.", "publishedAt": "2021-03-31T11:59:00Z", "source": {"id": null, "name": "Investor's Business Daily"}, "title": "Dow Jones Futures Fall, Tech Futures Rise: Market Rally Awaits Biden Infrastructure Plan; GM Leads 7 Stocks In Buy Range - Investor's Business Daily", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-stock-market-rally-awaits-biden-infrastructure-plan-gm-stock-buy-range/", "urlToImage": "https://www.investors.com/wp-content/uploads/2021/02/Stock-PresBiden-01-shutt.jpg"}, {"author": "Al Jazeera", "content": "Pfizer-BioNTech said on Wednesday their vaccine showed 100 percent efficacy against the coronavirus in 12 to 15-year-olds, as they eye approval for adolescents to get the jabs before the next school … [+2119 chars]", "description": "Pfizer-BioNTech said their vaccine showed 100 percent efficacy against the coronavirus in children between 12-15 years.", "publishedAt": "2021-03-31T11:52:18Z", "source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "title": "Pfizer-BioNTech says its COVID vaccine 100% effective in teens - Al Jazeera English", "url": "https://www.aljazeera.com/economy/2021/3/31/pfizer-says-its-covid-19-vaccine-protects-younger-teens", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/GettyImages-1308019499.jpg?resize=1200%2C630"}, {"author": "Gerald Lynch", "content": "Sky is continuing with its now-regular update drop of features coming to its Sky Q and Sky Go TV and streaming platforms. And if youre looking for more accessibility features from the TV viewing expe… [+2935 chars]", "description": "Accessibility is high on the Sky Q agenda", "publishedAt": "2021-03-31T10:53:30Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Sky Q adds Voice Guidance and dark mode accessibility features - TechRadar", "url": "https://www.techradar.com/uk/news/sky-q-is-getting-a-voice-guidance-option-in-addition-to-dark-mode-accessibility-features", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vaN3c5govEjG4yqPMqUvrE-1200-80.png"}, {"author": "Will Goodbody", "content": "150 jobs are to be created in counties Galway and Kildare by technology services and equipment producer Hewlett Packard Enterprise. \r\nThe new roles will be in research and development, cybersecurity,… [+2873 chars]", "description": "150 jobs are to be created in Galway and Kildare by technology services and equipment producer Hewlett Packard Enterprise.", "publishedAt": "2021-03-31T08:56:30Z", "source": {"id": "rte", "name": "RTE"}, "title": "150 new Hewlett Packard jobs for Galway and Kildare - RTE.ie", "url": "https://www.rte.ie/news/business/2021/0331/1207120-150-new-jobs-at-hewlett-packard-enterprise/", "urlToImage": "https://img.rasset.ie/0016809a-1600.jpg"}, {"author": null, "content": "In the past, we had something called butt-dialling where you ended up accidentally calling someone.\r\nBut with the evolution of technology, butt-dialling no longer only results in accidental calls. So… [+1688 chars]", "description": "In the past, we had something called butt-dialling where you ended up accidentally calling someone. But with the evolution of technology, butt-dialling no longer only results in accidental calls. Sometimes people go live on their social media unintentionally,…", "publishedAt": "2021-03-31T03:59:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Oopsie! Over 800 fans tune in to Rebecca Lim's accidental livestream that featured (almost) nothing - AsiaOne", "url": "https://www.asiaone.com/entertainment/oopsie-over-800-fans-tune-rebecca-lims-accidental-livestream-featured-almost-nothing", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210331_rebecca.jpg?h=c9e0d402&itok=MEf6DDeB"}, {"author": "Harry Domanski", "content": "Around the world, it's become second nature for people to navigate their way through cities and streets via Google Maps, but now the tech giant has announced you'll soon be able to bring some of that… [+3409 chars]", "description": "Indoor Live View is available now", "publishedAt": "2021-03-31T01:10:02Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Google Maps is getting a heap of new AI-driven features - TechRadar", "url": "https://www.techradar.com/news/google-maps-is-getting-a-heap-of-new-ai-driven-features", "urlToImage": "https://cdn.mos.cms.futurecdn.net/RZfuZEvdafPH6aeVaL6H94-1200-80.jpg"}, {"author": "Science X staff", "content": "With shark bites increasing in countries like Australiascientists say the use of personal electronic deterrents is an effective way to prevent future deaths and injuries which could save the lives of… [+4284 chars]", "description": "With shark bites increasing in countries like Australia—scientists say the use of personal electronic deterrents is an effective way to prevent future deaths and injuries which could save the lives of up to 1063 Australians along the coastline over the next 5…", "publishedAt": "2021-03-30T23:10:01Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Scientists show technology can save people from shark bites - Phys.org", "url": "https://phys.org/news/2021-03-scientists-technology-people-shark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/6-scientistssh.jpg"}, {"author": null, "content": "ByKelso Harper, MIT Kavli Institute for Astrophysics and Space ResearchMarch 30, 2021The newly discovered galaxy cluster CHIPS1911+4455 has a unique twisted shape compared to other rapidly cooling ga… [+5767 chars]", "description": "Lesson learned from the CHiPS survey must inform future cluster searches, researchers say. MIT astronomers have discovered new and unusual galactic neighborhoods that previous studies overlooked. Their results, published on March 26, 2021, in The Astrophysica…", "publishedAt": "2021-03-30T17:09:36Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "CHiPS: MIT Astronomers Discover New Galaxy Clusters Hiding in Plain Sight - SciTechDaily", "url": "https://scitechdaily.com/chips-mit-astronomers-discover-new-galaxy-clusters-hiding-in-plain-sight/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Cluster-CHIPS1911-4455.jpg"}], "message": "Successful api call", "number_of_news": 15, "status": 200, "topic": "tech"}