{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Double Danger for Young Women: High Risk of Rehospitalization After Heart Attack - SciTechDaily", "description": "NIH-supported findings identify risk factors in women and suggest the need for closer monitoring. A study funded by the National Institutes of Health shows that women aged 55 and younger are nearly twice as likely to be rehospitalized within a year of a heart…", "url": "https://scitechdaily.com/?p=273871", "urlToImage": "https://scitechdaily.com/images/Woman-Heart-Attack.jpg", "publishedAt": "2023-05-03T08:23:40Z", "content": "Women aged 55 and younger face nearly twice the risk of rehospitalization in the year following a heart attack compared to similarly aged men, as per a study supported by the National Institutes of H… [+6262 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Scientists discover 'surge of activity in the dying brain - Tech Explorist", "description": "Amplification of gamma oscillations & neurophysiological synchronization in the human brain.", "url": "https://www.techexplorist.com/scientists-discover-surge-activity-dying-brain/59798/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/human-brain-in-3D.jpg", "publishedAt": "2023-05-03T08:08:21Z", "content": "Near-death experiences are deeply embedded in our culture, often including reports of white light, visits from departed loved ones and hearing voices. These shared elements raise the question of whet… [+4786 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "Apple Rumored To Have Delayed The M3 Launch, No New MacBook Models Expected This Year - Wccftech", "description": "Due to continuous production problems with the M3, Apple is rumored to have delayed the SoC launch to next year", "url": "https://wccftech.com/apple-m3-launch-delayed/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/05/Apple-M3-2.jpg", "publishedAt": "2023-05-03T08:02:00Z", "content": "A disappointing rumor is claiming that Apple does not plan to unveil the M3 later this year. The successor to the M2 would be the first chipset from the company to be mass produced on TSMCs 3nm proce… [+2237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Korn", "title": "Why the 'Godfather of AI' decided he had to 'blow the whistle' on the technology - CNN", "description": "Geoffrey Hinton, also known as the \"Godfather of AI,\" decided he had to \"blow the whistle\" on the technology he helped develop after worrying about how smart it was becoming, he told CNN on Tuesday.", "url": "https://www.cnn.com/2023/05/02/tech/hinton-tapper-wozniak-ai-fears/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230502172638-geoffrey-hinton-the-lead-0502.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-03T03:23:00Z", "content": "Geoffrey Hinton, also known as the Godfather of AI, decided he had to blow the whistle on the technology he helped develop after worrying about how smart it was becoming, he told CNN on Tuesday.\r\nIm … [+2915 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Carolyn Collins Petersen", "title": "ESA Can't Deploy JUICE's Radar Antenna. It Needs It to Scan Under the Ice at Callisto, Europa, and Ganymede - Universe Today", "description": "ESA technicians are still working to free the stuck RIME antenna on the JUICE spacecraft. So far, they've only moved it a little.", "url": "https://www.universetoday.com/161180/esa-cant-deploy-juices-radar-antenna-it-needs-it-to-scan-under-the-ice-at-callisto-europa-and-ganymede/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/Juices_longest_antenna_awaits_deployment_ESA24834789.jpg", "publishedAt": "2023-05-03T03:02:00Z", "content": "In a scene eerily reminiscent of the Galileo spacecraft’s antenna issues, ESA’s Jupiter Icy Moons Explorer (JUICE) is having a problem with an antenna. The 16-meter-long radar Radar for Icy Moons Exp… [+2701 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Steamy Space Mystery: Webb Telescope Finds Water Vapor, But From a Rocky Planet or Its Star? - SciTechDaily", "description": "More observations will be needed to determine if exoplanet GJ 486 b has an atmosphere. GJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just…", "url": "https://scitechdaily.com/?p=273388", "urlToImage": "https://scitechdaily.com/images/Exoplanet-GJ-486-b-scaled.jpg", "publishedAt": "2023-05-03T02:48:17Z", "content": "BySpace Telescope Science InstituteMay 2, 2023\r\nThis artists concept represents the rocky exoplanet GJ 486 b, which orbits a red dwarf star that is only 26 light-years away in the constellation Virgo… [+11290 chars]"}, {"source": {"id": null, "name": "ArchDaily"}, "author": "Jon Astbury", "title": "The Best of Both Worlds: Ray Tracing and Rasterization - ArchDaily", "description": "The new version of Lumion 2023 gives users the best of both worlds: technological control and ease of use, with the power to create stunning project images.", "url": "https://www.archdaily.com/1000095/the-best-of-both-worlds-ray-tracing-and-rasterization", "urlToImage": "https://images.adsttc.com/media/images/6449/3ee4/59da/0d61/14e2/2a53/large_jpg/the-best-of-both-worlds-ray-tracing-and-rasterization_1.jpg?1682521850", "publishedAt": "2023-05-02T05:30:00Z", "content": "Courtesy of Lumion\r\nVisualization and technology have long gone hand in hand. It is, after all, a means of representing architecture that has relied on technological developments to keep up with the … [+5225 chars]"}]}