{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Bar & Bench - Indian Legal News"}, "author": "Debayan Roy", "title": "Supreme Court issues contempt of court notice to NCLAT members, orders personal presence - Bar & Bench - Indian Legal News", "description": "The Supreme Court on Wednesday issued contempt of court notices to National Company Law Appellate Tribunal (NCLAT) judicial member Justice Rakesh Kumar and tech", "url": "https://www.barandbench.com/news/supreme-court-issues-contempt-of-court-notice-nclat-members-orders-personal-presence", "urlToImage": "https://gumlet.assettype.com/barandbench%2F2021-04%2F911b2d9f-d2dd-4795-a39c-b75be42407b4%2F2e3ed3d2_bfe4_474c_b413_dec600f06d3f.jpg?w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2023-10-18T07:40:59Z", "content": "In response, the CJI discussed the NCLAT's conduct and expressed his dissatisfaction. He stated that if the scrutinizer had sought opinions from a former CJI in defiance of the Supreme Court's order,… [+903 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Magnetic filament eruption on the Sun may spark solar storm tomorrow, says NASA - HT Tech", "description": "A magnetic filament has erupted on an active sunspot, shooting out a CME. While not entirely Earth-directed, NASA models have shown that it is likely to spark a solar storm and deliver a glancing blow to the Earth.", "url": "https://tech.hindustantimes.com/tech/news/magnetic-filament-eruption-on-the-sun-may-spark-solar-storm-tomorrow-says-nasa-71697610104271.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/Solar_storm_1697177201358_1697610177566.jpg", "publishedAt": "2023-10-18T06:27:10Z", "content": "On Monday, October 16, a powerful magnetic filament erupted on the Sun. In particular, the explosion of plasma took place on the active sunspot AR3467, which was earlier reported to have displayed si… [+2205 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo group asteroid to come closer than the Moon; Know details of approach - HT Tech", "description": "An Apollo group Near-Earth Asteroid could pass Earth on October 20, NASA has revealed. It will reportedly come closer than the Moon during its approach.", "url": "https://tech.hindustantimes.com/tech/news/apollo-group-asteroid-to-come-closer-than-the-moon-know-details-of-approach-71697608683281.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/asteroid_1681966013956_1697608794485.jpg", "publishedAt": "2023-10-18T06:00:30Z", "content": "NASA has recently issued details about an asteroid designated as Asteroid 2023 TK15 that is expected to make its closest approach to Earth on October 20. This asteroid has been discovered and tracked… [+2175 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Hyperactivity to Memory Loss: The Shocking ADHD Link to Dementia - SciTechDaily", "description": "Rutgers researcher explores ADHD’s link to dementia and if risks can be mitigated with ADHD treatment. Adults with attention-deficit/hyperactivity disorder (ADHD) are nearly three times more likely to develop dementia than adults without ADHD, according to a …", "url": "https://scitechdaily.com/?p=318927", "urlToImage": "https://scitechdaily.com/images/ADHD-Dementia-Link.jpg", "publishedAt": "2023-10-18T02:24:34Z", "content": "ByRutgers UniversityOctober 17, 2023\r\nA shocking Rutgers study reveals that adults with ADHD face a nearly threefold increased risk of developing dementia. The research calls for more attention to AD… [+4609 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Kat Bailey", "title": "Diablo 4 Season 2 Delayed at Last Second as Blizzard Scrambles to Address Technical Issues - IGN", "description": "Blizzard delayed the release of Diablo IV Season 2 as it worked to address technical issues. Now that Season of Blood is available, fans are complaining about broken progression, battle pass issues, and other problems.", "url": "https://www.ign.com/articles/diablo-4-season-2-delayed-blizzard", "urlToImage": "https://assets-prd.ignimgs.com/2023/10/06/diablo-4-season-2-1696605044398.jpg?width=1280", "publishedAt": "2023-10-17T18:04:10Z", "content": "Diablo IV fans had to wait longer than expect to dig into Season of Blood, which launched earlier today. Blizzard said that technical issues forced it to delay the new vampire-driven season's release… [+1754 chars]"}]}