{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 20 March 2023: M1 Crab Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is the Crab Nebula, also known as Messier 1, located towards the constellation of Taurus.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-20-march-2023-m1-crab-nebula-71679291106227.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/20/1600x900/crab_nebula_1679291162365_1679291171317_1679291171317.png", "publishedAt": "2023-03-20T05:47:21Z", "content": "French astronomer Charles Messier has been one of the most influential figures in the history of astronomy with major contributions in finding and studying comets, nebulae and more. Although Messier … [+1692 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 11 price cut to just 14499 with this Flipkart exchange offer! - HT Tech", "description": "Grab iPhone 11 at just Rs. 14499, by taking advantage of this amazing deal on Flipkart. Check offer details here.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-11-price-cut-to-just-14499-with-this-flipkart-exchange-offer-71679285802407.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/20/1600x900/iphone_11_1595589845338_1595589856542_1679285908517_1679285908517.png", "publishedAt": "2023-03-20T04:19:16Z", "content": "Although the iPhone is quite a few years old now, it can still hold up against today's mid-range smartphones. It was launched back in 2019 and turned into an instant hit, becoming the best-selling sm… [+1688 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble's Neighborhood Watch: Exploring Every Known Nearby Galaxy - SciTechDaily", "description": "UGCA 307 is a small irregular galaxy located approximately 26 million light-years away from Earth in the constellation Corvus. It is part of the Local Group of galaxies that includes our Milky Way, and it is notable for its diffuse band of stars and red bubbl…", "url": "https://scitechdaily.com/hubbles-neighborhood-watch-exploring-every-known-nearby-galaxy/", "urlToImage": "https://scitechdaily.com/images/Hubble-UGCA-307.jpg", "publishedAt": "2023-03-20T04:11:33Z", "content": "ByESA/HubbleMarch 19, 2023\r\nIn this Hubble Space Telescope, UGCA 307 hangs against an irregular backdrop of distant galaxies. Located in the constellation Corvus, approximately 26 million light-years… [+3312 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sun hurls out CME towards Earth! G1-class Geomagnetic Storm to hit soon - HT Tech", "description": "A CME hurled out towards Earth could spark a Geomagnetic Storm on March 20-21.", "url": "https://tech.hindustantimes.com/tech/news/sun-hurls-out-cme-towards-earth-g1-class-geomagnetic-storm-to-hit-soonuntitled-story-71679283288194.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/20/1600x900/explosion-1497200_1920_1631362627318_1679283405339_1679283405339.jpg", "publishedAt": "2023-03-20T03:37:21Z", "content": "NASA and ESA's Solar and Heliospheric Observatory observes and reports any unusal solar activity occuring on the Sun's surface. Just recently, a group of Sunspots were observed emerging from a Southw… [+1858 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Japan PM Fumio Kishida Arrives In India, Defence And Trade On Agenda - NDTV", "description": "Japanese Prime Minister Fumio Kishida arrived in New Delhi Monday morning to explore ways to boost bilateral ties in a range of areas, including defence and security, trade and investment, and high technologies.", "url": "https://www.ndtv.com/india-news/japan-pm-fumio-kishida-arrives-in-india-defence-and-trade-on-agenda-3875628", "urlToImage": "https://c.ndtvimg.com/2023-03/953sgpf_kishida_625x300_20_March_23.jpg", "publishedAt": "2023-03-20T03:26:45Z", "content": "The Japanese prime minister's visit is expected to last around 27 hours.\r\nNew Delhi: Japanese Prime Minister Fumio Kishida arrived in New Delhi Monday morning to explore ways to boost bilateral ties … [+1920 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss Eclipses: NASA Releases New Map of Upcoming Solar Eclipses - SciTechDaily", "description": "Where will you be for the 2023 and 2024 solar eclipses in the United States? NASA has released a new map that could help you decide. Based on observations from several NASA missions, the map details the path of the Moon’s shadow as it crosses the contiguous U…", "url": "https://scitechdaily.com/?p=261604", "urlToImage": "https://scitechdaily.com/images/Moon-Appearance-November-2022-Total-Lunar-Eclipse.gif", "publishedAt": "2023-03-19T21:22:28Z", "content": "ByVanessa Thomas, NASAs Goddard Space Flight CenterMarch 19, 2023\r\nThe appearance of the Moon during the November 2022 total lunar eclipse. NASA has released a new map that details the 2023 and 2024 … [+9845 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Unpopular Windows 11 Start menu change could be back in the cards - TechRadar", "description": "Recommended websites feature set to return to test builds?", "url": "https://www.techradar.com/news/unpopular-windows-11-start-menu-change-could-be-back-in-the-cards", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Nf39nYXRo56QP7sn2G5kz7-1200-80.png", "publishedAt": "2023-03-19T19:30:09Z", "content": "Windows 11 speculation has once again turned to the topic of personalized recommendations within the Start menu, and it seems that a feature which Microsoft discarded may be back on the drawing board… [+2676 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lance Ulanoff", "title": "Siri can't beat ChatGPT unless Apple breaks its own rules - TechRadar", "description": "Opinion: The one thing that's most important to Apple", "url": "https://www.techradar.com/opinion/siri-cant-beat-chatgpt-unless-apple-breaks-its-own-rules", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cQN5rxJTRtg46QzL7fhuHg-1200-80.jpg", "publishedAt": "2023-03-19T17:00:46Z", "content": "I''ve known Siri, Apple's voice assistant, for almost a dozen years, and yet I still can't recall a single meaningful conversation we've had. Conversely, ChatGPT and I have known each other for six m… [+4838 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iOS 16.4 update is on the way! Check benefits for your iPhone! - HT Tech", "description": "iOS 16.4 update is on the way Check benefits for your iPhone iOS 16.4 update release date has still not been declared but iPhone users have been anticipating this update for quite some time and it is likely very soon. Unsplash The expected iOS 16.4 release da…", "url": "https://tech.hindustantimes.com/web-stories/ios-16-4-update-is-on-the-way-check-benefits-for-your-iphone-71679224511678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/HT_Tech_1679225023193_1679225056883_1679225056883.jpg/", "publishedAt": "2023-03-19T11:30:51Z", "content": "iOS 16.4 update release date has still not been declared, but iPhone users have been anticipating this update for quite some time and it is likely very soon. (Unsplash)\r\nThe expected iOS 16.4 release… [+1468 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Madeline Coggins", "title": "CEO explains how a 'leapfrog in technology' can help companies catering to the blind community - Fox Business", "description": "Be My Eyes CEO Mike Buckley highlights the opportunity artificial intelligence presents to businesses, noting his own company has adopted new Chat GPT-4 tech to better help customers.", "url": "https://www.foxbusiness.com/technology/ceo-explains-leapfrog-technology-help-companies-catering-blind-community", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/02/0/0/2023-02-11T001737Z_2_LYNXMPEJ1A002_RTROPTP_4_OPENAI-CHATGPT.jpg?ve=1&tl=1", "publishedAt": "2023-03-19T11:07:42Z", "content": "The growth of artificial intelligence (AI) has prompted numerous companies to invest in and utilize technology to enhance their products and services. \r\nOne CEO outlined how this \"leapfrog in technol… [+4405 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study Shows Healthy Dogs and Cats Can Transmit Dangerous Microbes to Humans – And Vice Versa - SciTechDaily", "description": "Multi-drug-resistant organisms can be transmitted between healthy dogs and cats and their hospitalized owners. Fortunately, only a small number of cases were found suggesting pets are not a major source of antibiotic-resistant infections in hospital patients.…", "url": "https://scitechdaily.com/study-shows-healthy-dogs-and-cats-can-transmit-dangerous-microbes-to-humans-and-vice-versa/", "urlToImage": "https://scitechdaily.com/images/Veterinarians-Masks-Checking-Dog.jpg", "publishedAt": "2023-03-19T09:57:56Z", "content": "BySciTechDailyMarch 19, 2023\r\nHealthy dogs and cats may be transmitting multidrug-resistant organisms (MDROs) to their hospitalized owners, while humans could also be passing these microbes to their … [+5888 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dangerous? 44-foot asteroid comes calling on Earth today; NASA reveals how close it will get - HT Tech", "description": "A 44-foot asteroid is zooming towards planet Earth today along with a small 15-foot car-sized rock. Here is what NASA informs.", "url": "https://tech.hindustantimes.com/tech/news/dangerous-44-foot-asteroid-comes-calling-on-earth-today-nasa-reveals-how-close-it-will-get-71679203279753.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/asteroid_1677040099276_1679203459536_1679203459536.jpg", "publishedAt": "2023-03-19T05:26:48Z", "content": "Do dinosaurs fascinate you? Do you know how they got extinct? Well, it is believed that a gigantic asteroid's collision with planet Earth was the reason behind the same. Imagine what will happen, if … [+1636 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "Mirai Solar harnesses green energy to power greenhouses - The Rahnuma Daily", "description": "(RAHNUMA):Mirai Solar, a solar technology startup of King Abdullah University of Science and Technology, is disrupting the greenhouse market by developing foldable roof shades that not only prevent fruits, vegetables and flowers from extreme sunlight but also…", "url": "https://www.therahnuma.com/mirai-solar-harnesses-green-energy-to-power-greenhouses/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2023/03/16-20.jpg", "publishedAt": "2023-03-18T13:58:14Z", "content": "Founding team of Mirai Solar, from left, inside the KAUST Solar Center labs: Emmanuel Van Kerschaver, Michael Salvador, Tom Allen, Michele de Bastiani, Ahmed Balawi.\r\n(RAHNUMA):Mirai Solar, a solar t… [+5605 chars]"}]}