{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Popular Sugar-Free Sweetener Linked to Heart Attacks and Strokes - SciTechDaily", "description": "High xylitol levels may increase cardiovascular risks by promoting clotting, according to Cleveland Clinic research. Xylitol is a common zero-calorie sweetener found in sugar-free candy and toothpaste. Cleveland Clinic researchers discovered that higher amoun…", "url": "https://scitechdaily.com/warning-popular-sugar-free-sweetener-linked-to-heart-attacks-and-strokes/", "urlToImage": "https://scitechdaily.com/images/Woman-Chewing-Gum.jpg", "publishedAt": "2024-06-08T15:28:02Z", "content": "A recent study by Cleveland Clinic has linked high xylitol levels to increased cardiovascular risk, including heart attacks and strokes. The study suggests that xylitol enhances clotting abilities, l… [+4492 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Uncovers a Mysterious Carbon Treasure Trove Around Young Star - SciTechDaily", "description": "Using the James Webb Space Telescope, scientists have discovered a rich variety of carbon molecules in a protoplanetary disk around a low-mass star, suggesting a unique type of planet-forming environment that could lead to the creation of carbon-poor planets.…", "url": "https://scitechdaily.com/webb-telescope-uncovers-a-mysterious-carbon-treasure-trove-around-young-star/", "urlToImage": "https://scitechdaily.com/images/Artists-Impression-of-Protoplanetary-Disc-scaled.jpg", "publishedAt": "2024-06-08T10:31:49Z", "content": "This is an artist’s impression of a young star surrounded by a disk of gas and dust. An international team of astronomers has used NASA’s James Webb Space Telescope to study the disk around a young a… [+6524 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "Trump touts Silicon Valley support, says tech leaders can't relate to 'low IQ' Biden: 'I have a high IQ' - Fox News", "description": "Trump said Silicon Valley support is a 'great testament' to his accomplishments and that tech leaders appreciate his 'high IQ'", "url": "https://www.foxnews.com/politics/trump-touts-silicon-valley-support-says-tech-leaders-cant-relate-stupid-biden-i-have-high-iq", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/05/GettyImages-2154368105.jpg", "publishedAt": "2024-06-07T18:07:00Z", "content": "EXCLUSIVE: Former President Trump touted the success of a San Francisco fundraiser Thursday evening as a major shift in support and a \"great testament\" to his accomplishments after raising $12 millio… [+3726 chars]"}]}