{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Stock market today: Trade setup for Nifty 50 to global cues, five stocks to buy or sell on Friday — June 14 | Stock Market News - Mint", "description": "Stocks to buy today: Experts have recommmended buying these five buy or sell stocks — Usha Martin, Grasim Industries, IGL, HCL Tech, and M&M", "url": "https://www.livemint.com/market/stock-market-news/stock-market-today-trade-setup-for-nifty-50-to-global-cues-five-stocks-to-buy-or-sell-on-friday-june-14-11718330062977.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/06/14/1600x900/Stock_market_today_Stocks_to_Buy_or_sell_Nifty_50_1718330821376_1718330821618.jpg", "publishedAt": "2024-06-14T02:18:03Z", "content": "Stock market today: Despite weak global market sentiments on the hawkish US Fed meeting outcome, the Indian stock market ended higher for the third straight session. The Nifty 50 index finished 75 po… [+5140 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Captures Massive Asteroid Collision in Neighboring Star System - SciTechDaily", "description": "New observations spotlight the volatile processes that shape star systems like our own, offering a unique glimpse into the primordial stages of planetary formation. Astronomers have captured a snapshot of a giant asteroid collision in Beta Pictoris, revealing…", "url": "https://scitechdaily.com/webb-telescope-captures-massive-asteroid-collision-in-neighboring-star-system/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Collision-Concept-Illustration-Art.jpg", "publishedAt": "2024-06-13T21:27:11Z", "content": "Astronomers observed a giant asteroid collision in Beta Pictoris, using data from the Webb and Spitzer telescopes. The event, occurring 20 years ago, offers new insights into early planetary formatio… [+6947 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Christine Hall", "title": "Here’s everything Apple announced at the WWDC 2024 keynote, including Apple Intelligence, Siri makeover - TechCrunch", "description": "The TechCrunch the team runs down all of the biggest news from the Apple WWDC 2024 keynote in an easy-to-skim digest.", "url": "https://techcrunch.com/2024/06/13/everything-apple-announced-wwdc-2024/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Tim-Cook-Apple-WWDC.png?resize=1200,678", "publishedAt": "2024-06-13T19:00:00Z", "content": "Its WWDC 2024 keynote time! Each year Apple kicks off its Worldwide Developers Conference with a few hours of just straight announcements, like the long-awaited Apple Intelligence and a makeover for … [+14109 chars]"}]}