{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mesmerizing Cetus Constellation Galaxy: A Cosmic Dance of Stars Through Time - SciTechDaily", "description": "New and old stars alike twinkle in the dusty spiral arms of galaxy NGC 1087, as seen in this breathtaking image from NASA’s Hubble Space Telescope. Located 80 million light-years away in the constellation Cetus, NGC 1087 is a barred spiral galaxy. It has a di…", "url": "https://scitechdaily.com/?p=315111", "urlToImage": "https://scitechdaily.com/images/Hubble-NGC-1087.jpg", "publishedAt": "2023-10-08T20:22:48Z", "content": "NGC 1087, an 80-million-light-year distant galaxy in Cetus, showcases both old and new stars. Discovered in 1785, it had a supernova sighting in 1995. Recent Hubble images like this one provide insig… [+2133 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rapid “Collective Motion” of Iron Atoms Discovered in Earth's Solid Inner Core - SciTechDaily", "description": "A new study discovered rapid \"collective motion\" of iron atoms in Earth's inner core. This movement may explain the core's unexpected softness in seismic data and has implications for understanding Earth's magnetic field generation. The iron atoms that make u…", "url": "https://scitechdaily.com/rapid-collective-motion-of-iron-atoms-discovered-in-earths-solid-inner-core/", "urlToImage": "https://scitechdaily.com/images/Aurora-Australis-Southern-Lights-From-Space.jpg", "publishedAt": "2023-10-08T10:11:56Z", "content": "ByUniversity of Texas at AustinOctober 8, 2023\r\nCharged ions interacting with the Earths magnetic field often create auroras near the planets poles. The aurora australis or the southern lights, are c… [+5650 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 622 answer for October 8: Another double trouble! Check Quordle hints, clues, solutions today - HT Tech", "description": "Quordle 622 answer for October 8: Today’s puzzle is filled with words that have repeated letters within them. It is a very tricky puzzle. Solve it using our Quordle hints, clues, and solutions.", "url": "https://tech.hindustantimes.com/how-to/quordle-622-answer-for-october-8-another-double-trouble-check-quordle-hints-clues-solutions-today-71696728713710.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/08/1600x900/H_1696729000420_1696729000771.jpg", "publishedAt": "2023-10-08T01:38:02Z", "content": "Quordle 622 answer for October 8: After a long time, Quordle has come out all guns blazing. We have not seen a puzzle this difficult in weeks and it sure threw us off-guard at first. We predict a lot… [+2039 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Survival Strategies for BGMI: 5 Tips to stay alive and win the Chicken Dinner - HT Tech", "description": "Surviving in BGMI can be tough, but with these 5 simple tips, you can avoid early deaths and stay competitive for a much longer period and perhaps even go as far as to win the Chicken Dinner.", "url": "https://tech.hindustantimes.com/how-to/survival-strategies-for-bgmi-5-tips-to-stay-alive-and-win-the-chicken-dinner-71696728250973.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/08/1600x900/bgmi_1688345159608_1696728442109.png", "publishedAt": "2023-10-08T01:29:56Z", "content": "In BGMI, the game is all about being the last player standing or winning the Chicken Dinner. But, dying early in the game can mess up your rank, so staying alive is super important if you want to cli… [+1863 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "COVID-19 vulnerability tied to past infections and vaccination - Tech Explorist", "description": "Mapping antigenic connections in SARS-CoV-2 and serological reactions.", "url": "https://www.techexplorist.com/covid-19-vulnerability-tied-past-infections-vaccination/75064/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/10/virus-spike.jpg", "publishedAt": "2023-10-07T10:50:02Z", "content": "People’s immune responses to different variants of the COVID-19 virus, SARS-CoV-2, depend on their past exposures. This new research from the University of Cambridge shows that understanding these di… [+3416 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "ICYMI: the 8 biggest tech stories of the week, from smart tags to the Pixel 8 Pro - TechRadar", "description": "Get caught up in no time at all", "url": "https://www.techradar.com/tech/icymi-the-8-biggest-tech-stories-of-the-week-from-smart-tags-to-the-pixel-8-pro", "urlToImage": "https://cdn.mos.cms.futurecdn.net/iX49krz5EKXLQLhFeZS8Md-1200-80.jpg", "publishedAt": "2023-10-07T06:30:35Z", "content": "Gather round, gather round, because we've got some tales to tell you – tales from the last seven days in the land of technology. It's been another busy week in a run of busy weeks, with a host of new… [+7277 chars]"}]}