{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Dan Goodin", "title": "What we know about the xz Utils backdoor that almost infected the world - Ars Technica", "description": "Malicious updates made to a ubiquitous tool were a few weeks away from going mainstream.", "url": "https://arstechnica.com/security/2024/04/what-we-know-about-the-xz-utils-backdoor-that-almost-infected-the-world/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/04/malware-760x380.jpg", "publishedAt": "2024-04-01T06:55:22Z", "content": "Enlarge/ Malware Detected Warning Screen with abstract binary code 3d digital concept\r\n44\r\nOn Friday, researchers revealed the discovery of a backdoor that was intentionally planted in xz Utils, an o… [+9452 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid to pass Earth by just 721,000 km today, reveals NASA; Know how big it is - HT Tech", "description": "NASA has revealed details about an asteroid that is expected to pass Earth by a close margin today, April 1. From its size to the speed at which it is approaching the planet, know all about it.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-to-pass-earth-by-just-721-000-km-today-reveals-nasa-know-how-big-it-is-71711944460216.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid_1683002420925_1683002421133.jpg", "publishedAt": "2024-04-01T05:20:53Z", "content": "The first day of April is set to get a celestial visitor in the form of an asteroid. With the help of its advanced ground and space-based telescopes, NASA has shed light on an asteroid that has been … [+2008 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Cosmic Lighthouses” – Webb Unlocks the Secrets of the Universe's First Light - SciTechDaily", "description": "Groundbreaking JWST observations reveal the pivotal role of low-mass galaxies in the early universe's reionization, challenging existing cosmic evolution theories. Scientists working with data from NASA's James Webb Space Telescope (JWST) have obtained the fi…", "url": "https://scitechdaily.com/cosmic-lighthouses-webb-unlocks-the-secrets-of-the-universes-first-light/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Cosmic-Wonder-Concept-Art.jpg", "publishedAt": "2024-04-01T00:44:57Z", "content": "Utilizing data from NASA’s James Webb Space Telescope, scientists have unveiled the earliest starlight spectra, revealing low-mass galaxies’ central role in the universe’s dawn. Credit: SciTechDaily.… [+6861 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "10 images of Earth captured from the International Space Station that will amaze you - HT Tech", "description": "10 images of Earth captured from the International Space Station that will amaze you Check out these beautiful images of Earth captured from the International Space Station. The first image was captured from the International Space Stations window to the worl…", "url": "https://tech.hindustantimes.com/web-stories/10-images-of-earth-captured-from-the-international-space-station-that-will-amaze-you-71711950260860.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/04/01/1600x900/53572553927_95cc236501_o_1711950993962_1711950999735.jpg/", "publishedAt": "2024-04-01T00:27:16Z", "content": "Photo Credit: Pixabay\r\n Check out these beautiful images of Earth captured from the International Space Station. \r\nPhoto Credit: NASA\r\n The first image was captured from the International Space Stati… [+1265 chars]"}]}