{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI bans over 45000 accounts in India! Check full list here - HT Tech", "description": "Battlegrounds Mobile India (BGMI) has banned 47,624 accounts in India within a week! Know what are the reasons. Check the full list too.", "url": "https://tech.hindustantimes.com/gaming/news/bgmi-bans-over-45000-accounts-in-india-check-full-list-here-71657443132650.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/10/1600x900/BGMI_1657443423132_1657443439748.PNG", "publishedAt": "2022-07-10T08:57:46Z", "content": "Battlegrounds Mobile India (BGMI) has taken the most extreme step of banning a huge number of accounts in India. BGMI developer Krafton took this strict action against the gamers who were found to be… [+2284 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sohini Das", "title": "Bharat Biotechs Zika vaccine set to go to Phase 2 clinical trials soon - Business Standard", "description": "Doctors point out to lack of testing tools even as they attend to suspected Zika cases", "url": "https://www.business-standard.com/article/companies/bharat-biotech-s-zika-vaccine-set-to-go-to-phase-2-clinical-trials-soon-122071000223_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-06/03/full/1496504981-1795.jpg", "publishedAt": "2022-07-10T07:56:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Tanmay Kadam", "title": "With Over 8000 Satellites In Space, Chinese Scientists Use ‘New Technique’ To Clean Up Threatening Space Junk - EurAsian Times", "description": "Chinese space scientists used an enormous space sail to deorbit a recently launched Long March 2 rocket, China’s state-owned Global Times reported on July 6. This was the first such experiment ever performed on a rocket. Russia ‘Smokescreens’ $3.7B Kerch Brid…", "url": "https://eurasiantimes.com/with-over-8000-satellites-in-space-chinese-scientists-use-new/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/06/Space-Junk.jpg", "publishedAt": "2022-07-10T07:25:30Z", "content": "Chinese space scientists used an enormous space sail to deorbit a recently launched Long March 2 rocket, China’s state-owned Global Times reported on July 6. This was the first such experiment ever p… [+4401 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "I Really Wanted the Technics EAH-AZ40 Earbuds to Live Up to The Hype - Gizmodo Australia", "description": "Technics EAH-AZ40 earbuds are billed as delivering sound with amazing range. It's a bold claim, one that isn't quite accurate.", "url": "https://www.gizmodo.com.au/2022/07/technics-eah-az40-earbuds-review/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/07/06/technics-copy.png?quality=80&resize=1280,720", "publishedAt": "2022-07-10T02:00:00Z", "content": "At Gizmodo, we independently select and write about stuff we love and think you'll like too. We have affiliate and advertising partnerships, which means we may collect a share of sales or other compe… [+7973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Healthy Plant-Based Diet Can Reduce Cancer Risk for Middle Aged Women - SciTechDaily", "description": "Research shows that diet quality is important in the prevention of breast cancer There is evidence that the foods we eat can affect how likely we are to develop cancer, but it's not always clear which foods or dietary habits are most effective in lowering can…", "url": "https://scitechdaily.com/a-healthy-plant-based-diet-can-reduce-cancer-risk-for-middle-aged-women/", "urlToImage": "https://scitechdaily.com/images/Woman-Cooking-Vegetables.jpg", "publishedAt": "2022-07-09T23:22:51Z", "content": "The study found that a healthy plant-based diet could reduce breast cancer risk by 14%.\r\nResearch shows that diet quality is important in the prevention of breast cancer\r\nThere is evidence that the f… [+3240 chars]"}, {"source": {"id": null, "name": "Hype.my"}, "author": "Ai Jia Tah", "title": "Logitech Lift Vertical Ergonomic Mouse Review: Curbing Wrist Fatigue At Work - Hype.MY", "description": "We’ve all heard of Logitech and their large array of desktop mice and keyboards. Whether it be for gaming or for work, there always seems to be a Logitech mouse available to suit your needs. But with long hours spent at a desk job, using a mouse nonstop can s…", "url": "https://hype.my/2022/281253/logitech-lift-vertical-ergonomic-mouse-review-curbing-wrist-fatigue-at-work/", "urlToImage": "https://hype.my/wp-content/uploads/2022/07/DSC04870.jpg", "publishedAt": "2022-07-09T19:09:44Z", "content": "Weve all heard of Logitech and their large array of desktop mice and keyboards. Whether it be for gaming or for work, there always seems to be a Logitech mouse available to suit your needs. But with … [+3447 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Space Telescopes First Full Color Images, Important Mission to the Moon - SciTechDaily", "description": "Ready to showcase the Webb space telescope’s first full-color images … Back in touch with a spacecraft on an important mission to the Moon …. And our Artemis I Moon rocket and spacecraft move a step closer to launch … a few of the stories to tell you about – …", "url": "https://scitechdaily.com/this-week-nasa-webb-space-telescopes-first-full-color-images-important-mission-to-the-moon/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Webb-First-Full-Color-Images.gif", "publishedAt": "2022-07-09T14:37:33Z", "content": "ByNASAJuly 9, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisory… [+2452 chars]"}, {"source": {"id": null, "name": "Technologytimes.pk"}, "author": "Ghulam din", "title": "Africa: There's No Cure for Sickle Cell Disease, but Spotting It Early Can Improve Treatment - Technology Times Pakistan", "description": "Sickle cell disease is a genetic disorder that causes misshapen red blood cells to clog blood vessels. The condition can cause...", "url": "https://technologytimes.pk/2022/07/09/africa-theres-no-cure-for-sickle-cell-disease-but-spotting-it-early-can-improve-treatment/", "urlToImage": "https://technologytimes.pk/wp-content/uploads/2022/07/Africa-Theres-No-Cure-for-Sickle-Cell-Disease-but-Spotting-It-Early-Can-Improve-Treatment.jpg", "publishedAt": "2022-07-09T11:57:15Z", "content": "Sickle cell disease is a genetic disorder that causes misshapen red blood cells to clog blood vessels. The condition can cause extreme pain. People with sickle cell disease are at risk of life-threat… [+4002 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Do you have these iPhones? Beware! You are at a Major risk from hackers - HT Tech", "description": "Millions of iPhone devices are going to become the favorite destination for hackers in just a couple of months. Find out if your device is part of it.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-6s-iphone-7-iphone-se-apple-iphones-hackers-risk-71657361006558.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/09/1600x900/IMG_3208_1648264949329_1657361074391.jpg", "publishedAt": "2022-07-09T10:08:51Z", "content": "In just a couple of months, millions of iPhone devices across the world are going to become vulnerable and dangerous to their users. This will happen because once the iOS 16 update rolls out, older m… [+2093 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africans are still semigrating to these coastal towns - BusinessTech", "description": "Meridian Realty reveals two coastal towns to the new semigration hotspot.", "url": "https://businesstech.co.za/news/property/601816/south-africans-are-semigrating-to-this-coastal-town/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/06/Screenshot-2022-06-30-120128-e1656583329410.png", "publishedAt": "2022-07-09T08:01:51Z", "content": "South Africans are increasingly moving to the Garden Route, pushing asking prices in the region sharply upwards, says Antonie Goosen, principal and founder of Meridian Realty.\r\nDomestic semigration p… [+4989 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The rand is being tested as fears of a US recession mount - BusinessTech", "description": "The rand’s 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportive.", "url": "https://businesstech.co.za/news/finance/604862/the-rand-is-being-tested-as-fears-of-a-us-recession-mount/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2022-07-09T06:20:18Z", "content": "The rands 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportiv… [+4123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Creatures Fill Puzzling Gap in the Fossil Record - SciTechDaily", "description": "Research reveals yunnanozoans as the oldest known stem vertebrates. New findings answer questions in the fossil record. The puzzling gap in the fossil record that would explain the evolution of invertebrates to vertebrates has long perplexed scientists. Verte…", "url": "https://scitechdaily.com/extinct-creatures-fill-puzzling-gap-in-the-fossil-record/", "urlToImage": "https://scitechdaily.com/images/Yunnanozoan-Artistic-Reconstruction-scaled.jpg", "publishedAt": "2022-07-09T03:36:51Z", "content": "Artistic reconstruction of the yunnanozoan from the Cambrian Chengjiang biota shows basket-like pharyngeal skeletons. Credit: Dinghua Yang\r\nResearch reveals yunnanozoans as the oldest known stem vert… [+4848 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "April Fowell", "title": "Japan Plans to Create a Laser Beam to Eliminate Satellite Debris in Space - Tech Times", "description": "Japan Aerospace Exploration Agency is experimenting with a laser beam to deal with space junk.", "url": "https://www.techtimes.com/articles/277825/20220708/japan-plans-to-create-a-laser-beam-to-eliminate-satellite-debris-in-space.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/407955/textures-with-negative-space.jpg", "publishedAt": "2022-07-09T03:00:00Z", "content": "Japan is looking for ways to deal with space debris. Ever since the space age began, space junk that consists of satellites, rocket parts, and wreckage from collisions has been piling up. It is even … [+2821 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa will need to change laws to introduce a 4-day work week - BusinessTech", "description": "While a growing number of companies in South Africa and around the world are considering the adoption of a four-day workweek, the plan focuses a few speedhumps.", "url": "https://businesstech.co.za/news/business/604748/south-africa-will-need-to-change-laws-to-introduce-a-4-day-work-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/05/shutterstock_116458489-e1653463731824.jpg", "publishedAt": "2022-07-08T14:01:41Z", "content": "While a growing number of companies in South Africa and around the world are considering the adoption of a four-day workweek, the country’s labour laws will likely need amending to permanently accomm… [+2757 chars]"}]}