{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fire-Ice Time Bomb Discovered: Climate Change's Deep Ocean Threat - SciTechDaily", "description": "Research indicates that oceanic fire-ice, or frozen methane, is vulnerable to melting from climate change, posing a significant threat of methane release into the atmosphere. An international team of researchers led by Newcastle University found that as froze…", "url": "https://scitechdaily.com/fire-ice-time-bomb-discovered-climate-changes-deep-ocean-threat/", "urlToImage": "https://scitechdaily.com/images/Gas-Bubbles-Deep-Ocean-Concept.jpg", "publishedAt": "2023-12-11T03:13:28Z", "content": "New research reveals that fire-ice, or frozen methane which is trapped as a solid under our oceans, is at risk of melting due to climate change, potentially releasing large amounts of methane into th… [+4492 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Aircraft-sized asteroid to pass Earth by a close margin today, reveals NASA - HT Tech", "description": "In a new development, NASA has revealed that an aircraft-sized asteroid is expected to pass Earth by a close margin today, December 11. Know its speed, size, distance of approach, and more.", "url": "https://tech.hindustantimes.com/tech/news/aircraftsized-asteroid-to-pass-earth-by-a-close-margin-today-reveals-nasa-71702262410088.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/11/1600x900/2_1702029576807_1702262493208.png", "publishedAt": "2023-12-11T02:45:30Z", "content": "NASA has a suite of advanced tech equipment used for observing and monitoring Near-Earth Objects (NEOs) such as asteroids, comets, and more. The month of November was filled with numerous asteroid ap… [+1720 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Senator Warren calls out Apple for shutting down Beeper’s ‘iMessage to Android’ solution - TechCrunch", "description": "U.S. Senator Elizabeth Warren (D-Mass.) is throwing her weight behind Beeper, the app that allowed Android users to message iPhone users via iMessage,", "url": "https://techcrunch.com/2023/12/10/senator-warren-calls-out-apple-for-shutting-down-beepers-imessage-to-android-solution/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/Beeper_Mini_UI.jpg?resize=1200,675", "publishedAt": "2023-12-10T22:51:23Z", "content": "U.S. Senator Elizabeth Warren (D-Mass.) is throwing her weight behind Beeper, the app that allowed Android users to message iPhone users via iMessage, until Apple shut it down. Warren, an advocate fo… [+3418 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Best gaming console: Sony PlayStation 5 to Nintendo Switch OLED, check the top 11 - HT Tech", "description": "Explore the gaming universe with our guide to the best gaming console! From Sony PlayStation 5 to Nintendo Switch OLED, discover immersive gaming experiences for all ages and preferences.", "url": "https://tech.hindustantimes.com/gaming/news/best-gaming-console-sony-playstation-5-to-nintendo-switch-oled-check-the-top-11-71702217042585.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/10/1600x900/gaming_console_1702217277492_1702217277760.JPG", "publishedAt": "2023-12-10T14:22:58Z", "content": "In the world of high-class entertainment, gaming has become more than just a pastime; it's a portal to new dimensions, a realm where you can be the hero or explore fantastical landscapes. While high-… [+13076 chars]"}]}