{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Arjun Kharpal", "title": "Huawei 2024 revenue surges to near-record high as China smartphone comeback takes hold - CNBC", "description": "Huawei has been trying to adapt its business to deal with U.S. sanctions that have restricted its access to key technologies like semiconductors.", "url": "https://www.cnbc.com/2025/03/31/huawei-2024-revenue-surges-to-near-record-high-on-smartphone-comeback.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/108103282-1739812417168-gettyimages-2173508992-HUAWEI_MATE_XT.jpeg?v=1743408262&w=1920&h=1080", "publishedAt": "2025-03-31T08:00:46Z", "content": "The Huawei booth at the Mobile World Congress in Barcelona, 2025.\r\nHuawei on Monday reported a sharp jump in 2024 revenue as its core telecommunications and consumer businesses accelerated.\r\nHuawei r… [+3664 chars]"}, {"source": {"id": null, "name": "The Seattle Times"}, "author": "Alex Halverson", "title": "Microsoft turns 50: 4 employees recall their early years - The Seattle Times", "description": "Microsoft built things. It broke things. It created opportunities for people who never thought they’d work in the tech industry, and gave them stories to tell.", "url": "https://www.seattletimes.com/business/microsoft/microsoft-turns-50-4-employees-recall-their-early-years/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2025/03/03262025_tzr_tzr_105746.jpg?d=1200x630", "publishedAt": "2025-03-30T13:00:00Z", "content": "Fifty years ago, two kids from Seattle flipped the tech industry on its head.\r\nWhile all the big brains in personal computing were focused on machines “microcomputer” hardware Bill Gates and Paul All… [+12798 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Snapdragon 8 Elite Gen 2 Gets Its First Benchmark Result On AnTuTu, Posting An Unbelievable 40.7 Percent Higher Score Than The Fastest Snapdragon 8 Elite In The Leaderboards - Wccftech", "description": "The first AnTuTu result of the upcoming Snapdragon 8 Elite Gen 2 is here, allegedly scoring 40.7 percent higher than the Snapdragon 8 Elite", "url": "https://wccftech.com/snapdragon-8-elite-gen-2-antutu-result-40-percent-higher-than-snapdragon-8-elite/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/03/Snapdragon-8-Elite-Gen-2-2-1.jpg", "publishedAt": "2025-03-29T11:23:00Z", "content": "Qualcomm might stick with the same cluster for the Snapdragon 8 Elite Gen 2 as it has with its Snapdragon 8 Elite, but that does not mean the company does not intend to use faster in-house Oryon core… [+1866 chars]"}]}