{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Engineers Design an Electrical Microgrid for a Lunar Base - Universe Today", "description": "Sandia National Laboratories is developing microgrid technology that will power the Artemis Base Camp and operations on the Moon!", "url": "https://www.universetoday.com/155906/engineers-design-an-electrical-microgrid-for-a-lunar-base/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/12/artemis_basecamp.jpg", "publishedAt": "2022-05-16T19:01:35Z", "content": "For seventy years, Albuquerque-based Sandia National Laboratories has been developing electrical microgrids that increase community resilience and ensure energy security. Applications include the Sma… [+8739 chars]"}, {"source": {"id": null, "name": "TechHive"}, "author": "Ben Patterson", "title": "New Ecobee thermostat with air quality monitor and onboard Siri leaks online - TechHive", "description": "The leaked Ecobee Smart Thermostat Premium appears to have a new design and a built-in air quality monitor, as well as Alexa and Siri.", "url": "https://www.techhive.com/article/701798/new-ecobee-thermostat-with-air-quality-monitor-and-onboard-siri-leaks-online.html", "urlToImage": "https://www.techhive.com/wp-content/uploads/2022/05/Ecobee-Smart-Thermostat-Premuim-1.jpeg?quality=50&strip=all&w=1024", "publishedAt": "2022-05-16T17:50:08Z", "content": "Skip to contentType your search and hit enter\r\nSmart home manufacturer Ecobee appears to be prepping a new and fancier version of its Smart Thermostat, complete with built-in Siri, an integrated air … [+2367 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "CRISPR now possible in cockroaches - Science Daily", "description": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a new study. The simple and efficient technique, named 'direct parental' CRISPR (DIPA-CRISPR), involves the injection of materials into female adults where e…", "url": "https://www.sciencedaily.com/releases/2022/05/220516123952.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-16T17:35:15Z", "content": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a study published by Cell Press on May 16th in the journal Cell Reports Methods.The simple and ef… [+3316 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Forget iPhone 15, Apple co-founder Steve Jobs did not want first iPhone to have a SIM card - HT Tech", "description": "iPhone 15 will be SIM-free, but it has been revealed that Steve Jobs didn’t want the first-ever iPhone to have a SIM. Know why?", "url": "https://tech.hindustantimes.com/tech/news/forget-iphone-15-apple-co-founder-steve-jobs-did-not-want-first-iphone-to-have-a-sim-card-71652722144854.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/16/1600x900/_021a5b48-d62c-11e6-a260-7aa04c68bc63_1652722316105.JPG", "publishedAt": "2022-05-16T17:33:57Z", "content": "Though the first iPhone without a physical SIM card slot is expected to be the iPhone 15 Pro model, Steve Jobs, Apple's iconic co-founder, wanted the first iPhone to be SIM-free. Yes! The shocking re… [+1738 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Retired tactical officer calls RCMP 'broken organization' at N.S. mass shooting inquiry - CBC.ca", "description": "Two RCMP tactical officers testifying at the inquiry examining the 2020 Nova Scotia mass shooting say the response was made more challenging by not having an adequately staffed team, overnight air support or the technology to pinpoint locations.", "url": "https://www.cbc.ca/news/canada/nova-scotia/emergency-response-team-tim-mills-trent-milton-testimony-1.6454106", "urlToImage": "https://i.cbc.ca/1.6454959.1652714954!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/ns-mass-shooting-inquiry-20220516.jpg", "publishedAt": "2022-05-16T17:22:14Z", "content": "Two RCMP tactical officers testifying Monday at the inquiry examining the 2020 Nova Scotia mass shooting say responding was made more challenging by not having an adequately staffed team, overnight a… [+6609 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apex Legends Mobile: 18 Minutes of Fade Gameplay - IGN", "description": "Apex Legends Mobile features a platform exclusive Legend for the first time on mobile. Fade is an aggressive Legend who utilizes movement and void tech. Apex...", "url": "https://www.youtube.com/watch?v=cDTufyQ8_W0", "urlToImage": "https://i.ytimg.com/vi/cDTufyQ8_W0/hqdefault.jpg", "publishedAt": "2022-05-16T16:00:19Z", "content": null}, {"source": {"id": null, "name": "Dot Esports"}, "author": "Emily Morrow", "title": "Apex Legends Mobile introduces Fade, the first mobile legend - Dot Esports", "description": "He gives Wraith a run for her money with his void tech.", "url": "https://dotesports.com/news/apex-legends-mobile-introduces-fade-the-first-mobile-legend/", "urlToImage": "https://cdn1.dotesports.com/wp-content/uploads/2022/05/16105011/Apex-Legends-Mobile-Fade-1-768x353.png", "publishedAt": "2022-05-16T15:37:48Z", "content": "Apex Legends Mobile has introduced Fade, its first exclusive legend.\r\nFade, also known as the Phasing Punisher, is a highly mobile fighter who boosts his own movement potential while decreasing enemi… [+1957 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "We’ve got to give up on the government running the country: Magda Wierzycka - BusinessTech", "description": "At a recent Franschoek Literary Festival, South Africa’s wealthiest woman discusses her thoughts on the state of the nation.", "url": "https://businesstech.co.za/news/business/586870/weve-got-to-give-up-on-the-government-running-the-country-magda-wierzycka/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/09/Magda-e1599637040359.png", "publishedAt": "2022-05-16T15:20:08Z", "content": "Right now, South Africa is not a land of opportunity – but that is not to say that in five years’ time it can’t be, says chief executive officer of Sygnia and one of South Africa’s wealthiest women, … [+3041 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Apple Podcasts gains storage clean-up tools, support for annual subscriptions, and a new distribution system - TechCrunch", "description": "As the battle for podcaster talent and distribution heats up among providers, Apple this morning announced the launch of several new features for its Apple Podcasts service arriving alongside the latest software updates for iPhone, iPad, and Mac. Key among th…", "url": "https://techcrunch.com/2022/05/16/apple-podcasts-gains-storage-clean-up-tools-support-for-annual-subscriptions-and-a-new-distribution-system/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/06/ios-podcasts-app-icon.jpg?w=712", "publishedAt": "2022-05-16T15:01:51Z", "content": "As the battle for podcaster talent and distribution heats up among providers, Apple this morning announced the launch of several new features for its Apple Podcasts service arriving alongside the lat… [+6610 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Converting CO2 to formic acid using an alumina-supported, iron-based compound - Phys.org", "description": "Photoreduction of CO2 into transportable fuel like formic acid (HCOOH) is a great way of dealing with CO2's rising levels in the atmosphere. To aid in this mission, a research team from Tokyo Tech chose an easily available iron-based mineral and loaded it ont…", "url": "https://phys.org/news/2022-05-co2-formic-acid-alumina-supported-iron-based.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/lights-catalyst-reacti.jpg", "publishedAt": "2022-05-16T14:47:11Z", "content": "Photoreduction of CO2 into transportable fuel like formic acid (HCOOH) is a great way of dealing with CO2's rising levels in the atmosphere. To aid in this mission, a research team from Tokyo Tech ch… [+4401 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Technical partnership between Peugeot Sport and Marelli aimed at the 9X8 Hypercar hybrid powertrain system - PR Newswire", "description": "/PRNewswire/ -- Peugeot Sport has signed a multi-year partnership with Marelli, a leading global automotive supplier with a long-standing and extensive...", "url": "https://www.prnewswire.com/news-releases/technical-partnership-between-peugeot-sport-and-marelli-aimed-at-the-9x8-hypercar-hybrid-powertrain-system-301547929.html", "urlToImage": "https://mma.prnewswire.com/media/1818606/Marelli_and_Peugeot_partnership.jpg?p=facebook", "publishedAt": "2022-05-16T13:55:00Z", "content": "Specifically, Marelli is providing the engineering and the supply of bespoke, high-performance electric motor and Silicon Carbide-based inverter, which are part of the front axle electric traction sy… [+4229 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp Tips and Tricks: How to change WhatsApp chat wallpaper - HT Tech", "description": "Users can change WhatsApp chat wallpaper either for all or for a specific chat. Here is a step-by-step guide for the same.", "url": "https://tech.hindustantimes.com/how-to/whatsapp-tips-and-tricks-how-to-change-whatsapp-chat-wallpaper-71652696997246.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/16/1600x900/WhatsApp_1643269476629_1652697086112.jpg", "publishedAt": "2022-05-16T10:35:00Z", "content": "WhatsApp, one of the most widely used applications for chatting, allows its users to change the chat wallpaper. Android users who are using WhatsApp on their devices can change the chat wallpaper for… [+1302 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "New Study Discovers That Sea Ice Can Control Stability of Antarctic Ice Sheet - AZoCleantech", "description": "Regardless of the fast melting of ice in several parts of Antarctica, which was witnessed in the late 20th century, scientists have discovered that the floating ice shelves that skirt the eastern Antarctic Peninsula have experienced sustained advance througho…", "url": "https://www.azocleantech.com/news.aspx?newsID=31696", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31696_16526973734915178.png", "publishedAt": "2022-05-16T10:33:00Z", "content": "Regardless of the fast melting of ice in several parts of Antarctica, scientists have discovered that the floating ice shelves that skirt the eastern Antarctic Peninsula have experienced sustained ad… [+5017 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Economists predict big rate hike for South Africa this week – here’s what to expect - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger than at previous meetings.", "url": "https://businesstech.co.za/news/finance/586648/economists-predict-big-rate-hike-for-south-africa-this-week-heres-what-to-expect/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand-e1606294594929.jpg", "publishedAt": "2022-05-16T07:19:40Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger tha… [+3907 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "You’ve Seen the New Image of the Milky Way’s Black Hole – Now Hear It! - SciTechDaily", "description": "This is a sonification — translation into sound — of the latest image from the Event Horizon Telescope (EHT) of the supermassive black hole at the center of the Milky Way called Sagittarius A* (Sgr A*). Using a radar-like scan, the sonification begins at the …", "url": "https://scitechdaily.com/youve-seen-the-new-image-of-the-milky-ways-black-hole-now-hear-it/", "urlToImage": "https://scitechdaily.com/images/EHT-Sagittarius-A-Black-Hole-Sonification.gif", "publishedAt": "2022-05-15T20:17:25Z", "content": "ByChandra X-ray ObservatoryMay 15, 2022\r\nThis is a sonification translation into sound of the latest image from the Event Horizon Telescope (EHT) of the supermassive black hole at the center of the M… [+1761 chars]"}]}