{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moths to a Flame: Millennia-Old Mystery About Insects and Light at Night Solved at Last - SciTechDaily", "description": "Scientists discovered that insects keep their backs to light sources at night, a behavior that suggests artificial lights disrupt their natural navigation. This finding, based on high-speed camera footage, challenges long-held beliefs and highlights the impac…", "url": "https://scitechdaily.com/moths-to-a-flame-millennia-old-mystery-about-insects-and-light-at-night-solved-at-last/", "urlToImage": "https://scitechdaily.com/images/Lights-Disrupt-Insect-Behavior.jpg", "publishedAt": "2024-02-04T22:28:40Z", "content": "Since humans first began using fire, we’ve wondered why insects seem to have an irresistible attraction to light. With the modern use of electricity, the mystery has taken on new importance, as our l… [+7127 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ashwin Rajagopalan", "title": "6 coolest tech launches from Oppo, Redmi, BenQ, OnePlus and other consumer tech companies so far this... - Moneycontrol", "description": "India launches: Smartphones with 6,67 inch curved displays, a smart projector with Netflix integrated, new Bluetooth TWS earbuds with good active noise cancellation and a sub-35K slim notebook laptop.", "url": "https://www.moneycontrol.com/news/trends/lifestyle/6-coolest-tech-launches-from-oppo-redmi-benq-oneplus-and-other-consumer-tech-companies-so-far-this-year-12190061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/redmi-1-770x433.jpg", "publishedAt": "2024-02-04T13:34:52Z", "content": "Thirty-five days into 2024, weve already seen a flurry of launches from all the big consumer tech brands. OPPO and Redmi unveiled their first major smartphones for 2024 while BenQ launched an aggress… [+4512 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Saumya Nigam", "title": "Apple's upcoming Vision Pro Headset: The fusion of Mac and TV technology - India TV News", "description": "Apple has had mixed results courting developers. Netflix, one of the most popular consumer video apps, said late Friday it is not making a new app for the Vision Pro, though consumers can watch movies and series on the device's web browser.", "url": "https://www.indiatvnews.com/technology/news/apple-s-upcoming-vision-pro-headset-the-fusion-of-mac-and-tv-technology-2024-02-04-915208", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/02/apple-vision-pro-1707045586.jpg", "publishedAt": "2024-02-04T11:28:38Z", "content": "Apple's Vision Pro has the potential to revolutionize home entertainment and work technology by redefining how people watch television and use computers. Positioned as a potential successor to both t… [+4844 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "iPhone 15 Pro Max Beats The Galaxy S24 By The Skin Of Its Teeth In The Latest Competitive Speed Test - Wccftech", "description": "The iPhone 15 Pro Max remains the speed test champion by beating the Galaxy S24 Ultra, but it was a close call this time", "url": "https://wccftech.com/iphone-15-pro-max-narrowly-beats-the-galaxy-s24-ultra-in-speed-test/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/02/iPhone-15-Pro-Max-vs-Galaxy-S24-Ultra-speed-test.jpg", "publishedAt": "2024-02-04T08:51:00Z", "content": "The Galaxy S24 Ultra might have been able to last longer than the iPhone 15 Pro Max in a previous battery drain test, but Apples top-end flagship retains its title of being the speed test king by bea… [+1847 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Apple launches the Vision Pro, Taylor Swift fans strike back and Palworld comes under fire - TechCrunch", "description": "In this edition of Week in Review (WiR), we cover Apple launching the Vision Pro, Taylor Swift fans striking back and Palworld coming under fire.", "url": "https://techcrunch.com/2024/02/03/apple-launches-the-vision-pro-taylor-swift-fans-strike-back-and-palworld-comes-under-fire/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/02/DSC00078.jpeg?resize=1200,802", "publishedAt": "2024-02-03T21:15:45Z", "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunch’s regular newsletter that recaps the week in tech that was. And, boy, was it a week. Lots happened — let’s dig in.\r\nAs layoffs in tech picked u… [+3593 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysics in Crisis? Mystery Object Discovered That Could Change Everything - SciTechDaily", "description": "Astronomers discover a celestial object that defies classification, possibly uncovering a new type of cosmic entity at the edge of known physics. Sometimes astronomers come across objects in the sky that we can’t easily explain. In our new research, published…", "url": "https://scitechdaily.com/astrophysics-in-crisis-mystery-object-discovered-that-could-change-everything/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Mystery-Object-Art-Concept.jpg", "publishedAt": "2024-02-03T15:26:13Z", "content": "ByEwan D. Barr, Arunima Dutta, and Benjamin StappersFebruary 3, 2024Researchers have identified an enigmatic cosmic system that might contain an object bridging the gap between neutron stars and blac… [+6851 chars]"}]}