{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 113 answer for May 17, 2022: Double letter mayhem! Check Quordle hints, clues and solution - HT Tech", "description": "Quordle 113 answer for May 17, 2022: Another day and another Quordle headache. But you know what to do. Check these Quordle hints and clues and turn your day brighter with the solution.", "url": "https://tech.hindustantimes.com/how-to/quordle-113-answer-for-may-17-2022-double-letter-mayhem-check-quordle-hints-clues-and-solution-71652753059914.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/17/1600x900/HT_Tech_(25)_1651471185343_1652753237065.jpg", "publishedAt": "2022-05-17T02:10:18Z", "content": "Quordle 113 answer for May 17, 2022: One important factor on how well you will perform in Quordle is your vocabulary. Unlike Wordle, this game has a vast word library and does not only use common wor… [+1818 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Georgia State researchers find CRISPR-Cas9 gene editing approach can alter the social behavior of animals - EurekAlert", "description": "New gene-editing techniques are shedding light on how hormones impact social behavior in animals and possibly, humans. The research was led by Dr. Elliott Albers, Director of the Georgia State Center for Behavioral Neuroscience.", "url": "https://www.eurekalert.org/news-releases/952802", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-05-17T02:06:39Z", "content": "ATLANTA –Georgia State University scientists have created gene-edited hamsters for studies of social neuroscience and have found that the biology behind social behavior may be more complex than previ… [+3546 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "Engineers Design an Electrical Microgrid for a Lunar Base - Universe Today", "description": "Sandia National Laboratories is developing microgrid technology that will power the Artemis Base Camp and operations on the Moon!", "url": "https://www.universetoday.com/155906/engineers-design-an-electrical-microgrid-for-a-lunar-base/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2020/12/artemis_basecamp.jpg", "publishedAt": "2022-05-16T19:01:35Z", "content": "For seventy years, Albuquerque-based Sandia National Laboratories has been developing electrical microgrids that increase community resilience and ensure energy security. Applications include the Sma… [+8739 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "CRISPR now possible in cockroaches - Science Daily", "description": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a new study. The simple and efficient technique, named 'direct parental' CRISPR (DIPA-CRISPR), involves the injection of materials into female adults where e…", "url": "https://www.sciencedaily.com/releases/2022/05/220516123952.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-05-16T17:35:15Z", "content": "Researchers have developed a CRISPR-Cas9 approach to enable gene editing in cockroaches, according to a study published by Cell Press on May 16th in the journal Cell Reports Methods.The simple and ef… [+3316 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp Tips and Tricks: How to change WhatsApp chat wallpaper - HT Tech", "description": "Users can change WhatsApp chat wallpaper either for all or for a specific chat. Here is a step-by-step guide for the same.", "url": "https://tech.hindustantimes.com/how-to/whatsapp-tips-and-tricks-how-to-change-whatsapp-chat-wallpaper-71652696997246.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/16/1600x900/WhatsApp_1643269476629_1652697086112.jpg", "publishedAt": "2022-05-16T10:35:00Z", "content": "WhatsApp, one of the most widely used applications for chatting, allows its users to change the chat wallpaper. Android users who are using WhatsApp on their devices can change the chat wallpaper for… [+1302 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Economists predict big rate hike for South Africa this week – here’s what to expect - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger than at previous meetings.", "url": "https://businesstech.co.za/news/finance/586648/economists-predict-big-rate-hike-for-south-africa-this-week-heres-what-to-expect/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand-e1606294594929.jpg", "publishedAt": "2022-05-16T07:19:40Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to increase the repo rate this week – with consensus among most analysts and economists that the hike will be larger tha… [+3907 chars]"}]}