{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "Aishwarya Paliwal", "title": "US firm Micron breaks ground for $2.75 billion semiconductor plant in Gujarat - India Today", "description": "Micron Technology has commenced the construction of a $2.75 billion semiconductor testing and assembly plant in Gujarat's Sanand.", "url": "https://www.indiatoday.in/business/story/micron-technology-semiconductor-plant-chip-manufacturing-gujarat-sanand-ashwini-vaishnaw-2439941-2023-09-24", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/media_bank/202309/micron-semiconductor-plant-242407287-16x9.png?VersionId=X.zBRr7oTbhQMZJGP0VjVX8yOY8XtNJi", "publishedAt": "2023-09-24T14:43:07Z", "content": "Micron Technology, a leading American semiconductor manufacturer, has begun construction of a $2.75 billion semiconductor testing and assembly plant in Gujarat’s Sanand, marking a significant step in… [+2196 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Successfully Genetically Modify Individual Cells in Living Animals - SciTechDaily", "description": "One proven method for tracking down the genetic origins of diseases is to knock out a single gene in animals and study the consequences this has for the organism. The problem is that for many diseases, the pathology is determined by multiple genes, complicati…", "url": "https://scitechdaily.com/scientists-successfully-genetically-modify-individual-cells-in-living-animals/", "urlToImage": "https://scitechdaily.com/images/Mosaic-Mouse.jpg", "publishedAt": "2023-09-24T09:34:16Z", "content": "ByETH ZurichSeptember 24, 2023\r\nResearchers have developed a technique using CRISPR-Cas to simultaneously modify multiple genes in the cells of adult animals, creating a mosaic-like pattern that simp… [+8613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "VIR-1388: Clinical Trial of Preventive HIV Vaccine Begins - SciTechDaily", "description": "Novel vaccine includes NIH-funded technology in development since 2004. A trial of a preventive HIV vaccine candidate has begun enrollment in the United States and South Africa. The Phase 1 trial will evaluate a novel vaccine known as VIR-1388 for its safety …", "url": "https://scitechdaily.com/?p=311063", "urlToImage": "https://scitechdaily.com/images/HIV-1-Virus-Particle.jpg", "publishedAt": "2023-09-24T04:46:00Z", "content": "ByNational Institutes of Health (NIH)September 23, 2023\r\nColorized transmission electron micrograph of an HIV-1 virus particle (yellow/gold) budding from the plasma membrane of an infected H9 T cell … [+6817 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 608 answer for September 24: Few obscure words! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 608 answer for September 24: Win today's Quordle game with the help of the hints and clues given here.", "url": "https://tech.hindustantimes.com/how-to/quordle-608-answer-for-september-24-few-obscure-words-check-quordle-hints-clues-solutions-71695518164150.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/24/1600x900/HT_1695518328970_1695518329221.jpg", "publishedAt": "2023-09-24T01:20:39Z", "content": "Quordle 608 answer for September 24: Compared to Wordle, Quordle gives you more attempts to crack the answers. However, the thing that you need to note is you have 4 words to find, and that too today… [+1470 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists regenerate neurons that restore walking in mice after paralysis from spinal cord injury - Phys.org", "description": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after spinal cord injury. The neuroscientists have shown that re-gr…", "url": "https://phys.org/news/2023-09-scientists-regenerate-neurons-mice-paralysis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spinalcord.jpg", "publishedAt": "2023-09-23T18:09:33Z", "content": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after s… [+3605 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Thinner Than the Photon Itself – Scientists Invent Smallest Known Way To Guide Light - SciTechDaily", "description": "2D optical waveguides could pave the way for innovative technology. Channeling light from one location to another is the backbone of our modern world. Across deep oceans and vast continents, fiber optic cables transport light containing data ranging from YouT…", "url": "https://scitechdaily.com/thinner-than-the-photon-itself-scientists-invent-smallest-known-way-to-guide-light/", "urlToImage": "https://scitechdaily.com/images/Hanyu-Hong-Holding-Material.jpg", "publishedAt": "2023-09-23T13:21:11Z", "content": "ByUniversity of ChicagoSeptember 23, 2023\r\nScientists at the University of Chicago found a glass crystal just a few atoms thick can trap and carry lightand could be used for applications. The materia… [+5552 chars]"}]}