{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "i-Shock! Foldable iPhone to be destruct-proof? Know what just got tipped - HT Tech", "description": "The foldable Apple iPhone may well be shock-proof! Check what this miracle tech is about.", "url": "https://tech.hindustantimes.com/mobile/news/ishock-foldable-iphone-to-be-destruct-proof-know-what-just-got-tipped-71679232771765.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/foldable_iPhone_unsplash_1679233089277_1679233095826_1679233095826.jpg", "publishedAt": "2023-03-19T13:39:42Z", "content": "After the Samsung Galaxy Z Fold and Motorola Razr, several other brands have stepped into the foldable market Oppo Find N2 Flip, Xiaomi Mi MIX Fold, and Tecno Phantom V Fold, to name just a few. Now,… [+1775 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Firefly Aerospace selected by NASA for Robotic Delivery to Far Side of Moon - SciTechDaily", "description": "To carry multiple payloads to the far side of the Moon including a satellite to orbit that area, NASA has selected Firefly Aerospace of Cedar Park, Texas. The commercial lander will deliver two agency payloads, as well as a communication and data relay satell…", "url": "https://scitechdaily.com/firefly-aerospace-selected-by-nasa-for-robotic-delivery-to-far-side-of-moon/", "urlToImage": "https://scitechdaily.com/images/Firefly-Blue-Ghost-Transfer-Vehicle.jpg", "publishedAt": "2023-03-19T13:34:59Z", "content": "ByNASAMarch 19, 2023\r\nRendering of Fireflys Blue Ghost transfer vehicle deploying the European Space Agencys Lunar Pathfinder satellite to lunar orbit. ESAs Lunar Pathfinder is designed and developed… [+5356 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iOS 16.4 update is on the way! Check benefits for your iPhone! - HT Tech", "description": "iOS 16.4 update is on the way Check benefits for your iPhone iOS 16.4 update release date has still not been declared but iPhone users have been anticipating this update for quite some time and it is likely very soon. Unsplash The expected iOS 16.4 release da…", "url": "https://tech.hindustantimes.com/web-stories/ios-16-4-update-is-on-the-way-check-benefits-for-your-iphone-71679224511678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/HT_Tech_1679225023193_1679225056883_1679225056883.jpg/", "publishedAt": "2023-03-19T11:30:51Z", "content": "iOS 16.4 update release date has still not been declared, but iPhone users have been anticipating this update for quite some time and it is likely very soon. (Unsplash)\r\nThe expected iOS 16.4 release… [+1468 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Madeline Coggins", "title": "CEO explains how a 'leapfrog in technology' can help companies catering to the blind community - Fox Business", "description": "Be My Eyes CEO Mike Buckley highlights the opportunity artificial intelligence presents to businesses, noting his own company has adopted new Chat GPT-4 tech to better help customers.", "url": "https://www.foxbusiness.com/technology/ceo-explains-leapfrog-technology-help-companies-catering-blind-community", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/02/0/0/2023-02-11T001737Z_2_LYNXMPEJ1A002_RTROPTP_4_OPENAI-CHATGPT.jpg?ve=1&tl=1", "publishedAt": "2023-03-19T11:07:42Z", "content": "The growth of artificial intelligence (AI) has prompted numerous companies to invest in and utilize technology to enhance their products and services. \r\nOne CEO outlined how this \"leapfrog in technol… [+4405 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Mumbai: Tech firm CEO dies after being hit by car while jogging at Worli sea face - Economic Times", "description": "Rajalaxmi was known to be a fitness enthusiast and a regular jogger, often jogging with a group from Shivaji Park on Sundays. ​As per reports in the media, upon receiving a call from the police and his wife's colleague that his wife had met with an accident, …", "url": "https://economictimes.indiatimes.com/news/india/mumbai-tech-firm-ceo-dies-after-being-hit-by-car-while-jogging-at-worli-sea-face/articleshow/98772126.cms", "urlToImage": "https://img.etimg.com/thumb/msid-98772215,width-1070,height-580,imgsize-63740,overlay-economictimes/photo.jpg", "publishedAt": "2023-03-19T10:03:00Z", "content": "A tragic incident occurred at Worli Sea Face early on Sunday morning, where a speeding car hit a 42-year-old woman while she was jogging, resulting in her death at the spot. The accident happened nea… [+1880 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study Shows Healthy Dogs and Cats Can Transmit Dangerous Microbes to Humans – And Vice Versa - SciTechDaily", "description": "Multi-drug-resistant organisms can be transmitted between healthy dogs and cats and their hospitalized owners. Fortunately, only a small number of cases were found suggesting pets are not a major source of antibiotic-resistant infections in hospital patients.…", "url": "https://scitechdaily.com/study-shows-healthy-dogs-and-cats-can-transmit-dangerous-microbes-to-humans-and-vice-versa/", "urlToImage": "https://scitechdaily.com/images/Veterinarians-Masks-Checking-Dog.jpg", "publishedAt": "2023-03-19T09:57:56Z", "content": "BySciTechDailyMarch 19, 2023\r\nHealthy dogs and cats may be transmitting multidrug-resistant organisms (MDROs) to their hospitalized owners, while humans could also be passing these microbes to their … [+5888 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Silicon Valley Bank fallout likely to hit big tech, strategist says - Yahoo Finance", "description": "#siliconvalleybank #youtube #stockmarket This segment originally aired on March 14, 2023.The sudden failure of Silicon Valley Bank not only hit the banking s...", "url": "https://www.youtube.com/watch?v=RmOnVZMwQ2Y", "urlToImage": "https://i.ytimg.com/vi/RmOnVZMwQ2Y/maxresdefault.jpg", "publishedAt": "2023-03-18T14:30:05Z", "content": null}, {"source": {"id": null, "name": "Videocardz.com"}, "author": null, "title": "Crucial T700 PCIe Gen5 NVMe SSD teased reaching 12.4 GB/s read and 11.9 GB/s write speeds - VideoCardz.com", "description": "Crucial T700 PCIe Gen5 SSD Crucial is working on a next-gen storage solution based on the PCIe Gen5 standard. Crucial T700 SSD, Source: LinusTechTips The adoption of PCIe 5.0 technology is much slower than most enthusiasts would have expected. Storage compani…", "url": "https://videocardz.com/newz/crucial-t700-pcie-gen5-nvme-ssd-teased-reaching-12-4-gb-s-read-and-11-9-gb-s-write-speeds", "urlToImage": "https://cdn.videocardz.com/1/2023/03/CRUCIAL-T700-GEN5.jpg", "publishedAt": "2023-03-18T07:25:00Z", "content": "Crucial is working on a next-gen storage solution based on the PCIe Gen5 standard.\r\nCrucial T700 SSD, Source: LinusTechTips\r\nThe adoption of PCIe 5.0 technology is much slower than most enthusiasts w… [+1506 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA delegation and Minister Verrall meet UC researchers using space technology - India Education Diary", "description": "Environmental projects, Indigenous cultures and values, international partnerships, and student engagement were at the centre of the delegation’s visit to Aotearoa New Zealand with particular interest in climate change and partnerships between Aotear", "url": "https://indiaeducationdiary.in/nasa-delegation-and-minister-verrall-meet-uc-researchers-using-space-technology/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png?fit=534%2C462&ssl=1", "publishedAt": "2023-03-18T05:03:45Z", "content": "Environmental projects, Indigenous cultures and values, international partnerships, and student engagement were at the centre of the delegations visit to Aotearoa New Zealand with particular interest… [+2297 chars]"}]}