{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Eva Rothenberg", "title": "AI fears overblown? Theoretical physicist calls chatbots ‘glorified tape recorders’ - CNN", "description": "The public’s anxiety over new AI technology is misguided, according to theoretical physicist Michio Kaku.", "url": "https://www.cnn.com/2023/08/13/business/ai-quantum-computer-kaku/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230812093412-02-michio-kaku-ai-interview.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-08-13T15:51:00Z", "content": "The publics anxiety over new AI technology is misguided, according to theoretical physicist Michio Kaku.\r\nIn an interview with CNNs Fareed Zakaria on Sunday, the futurologist said chatbots like OpenA… [+2280 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking Physics: Muon G-2 Experiment Reinforces Surprise Result, Setting Up “Ultimate Showdown” - SciTechDaily", "description": "Findings at Fermilab show discrepancy between theory and experiment, which may lead to new physics beyond the Standard Model. Physicists now have a brand-new measurement of a property of the muon called the anomalous magnetic moment that improves the precisio…", "url": "https://scitechdaily.com/breaking-physics-muon-g-2-experiment-reinforces-surprise-result-setting-up-ultimate-showdown/", "urlToImage": "https://scitechdaily.com/images/Sub-Atomic-Particle-Quantum-Physics-Art-Illustration.jpg", "publishedAt": "2023-08-13T15:33:40Z", "content": "ByFermi National Accelerator LaboratoryAugust 13, 2023\r\nFermilabs Muon g-2 experiment has unveiled a new precision measurement of the muons magnetic property, hinting at undiscovered particles and a … [+10610 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Govind Choudhary", "title": "Tech Recap: Tecno Pova 5 series unveiled, Slack redesigns UI and other important news | Mint - Mint", "description": "This week in tech: Tecno Pova 5 series launch, Xiaomi Mi Mix Fold 3 date confirmed, Slack redesign, Netflix Game Controller app, Apple's M3-powered Mac Mini testing.", "url": "https://www.livemint.com/technology/tech-news/tech-recap-tecno-pova-5-series-unveiled-slack-redesigns-ui-and-other-important-news-11691921495822.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/08/13/600x338/tecno_pova_5_1691822266697_1691924156906.png", "publishedAt": "2023-08-13T10:56:05Z", "content": "This week in technology, we saw multiple devices unveiled from brands Xiaomi, Tecno and others. Report about Apple's M3-powered Mac Mini under testing also made headlines. Heres a recapTecno Pova 5 a… [+3568 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI Independence Day event: New update, dragon ball collab, and exciting in-game rewards - HT Tech", "description": "Battlegrounds Mobile India (BGMI) celebrates Independence Day with exciting updates, Dragon Ball Super collaboration, new modes, and enticing rewards. Let's dive into the action.", "url": "https://tech.hindustantimes.com/gaming/news/bgmi-independence-day-event-new-update-dragon-ball-collab-and-exciting-in-game-rewards-71691900615668.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/13/1600x900/Battlegrounds_mobile_India_1691900938361_1691900938540.png", "publishedAt": "2023-08-13T04:30:32Z", "content": "Battlegrounds Mobile India (BGMI) has unveiled its 2.7 update along with a fresh collaboration featuring Dragon Ball Super. As India's Independence Day on August 15 draws near, Krafton has introduced… [+2306 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "IANS", "title": "Copilot AI: Microsoft Brings Generative AI to Frontline Field Workers - LatestLY", "description": "Copilot will be added to the Dynamics 365 service, which will be used by field workers such as cable technicians and electricians, as well as a wide range of other jobs in facilities, manufacturing and healthcare, according to The Verge.", "url": "https://www.latestly.com/technology/copilot-ai-microsoft-brings-generative-ai-to-frontline-field-workers-5336289.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2023/05/IMG_0620-784x441.jpeg", "publishedAt": "2023-08-12T15:00:28Z", "content": "San Francisco, August 12: Microsoft is bringing generative AI to frontline field workers by incorporating its Copilot AI assistant into its field services platform, which not only streamlines workflo… [+2167 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "Julia Simon", "title": "Why lasers could help utilities make the electrical grids greener - WUSF Public Media", "description": "With thousands of renewable projects waiting to connect to the grid, some tech companies have quicker solutions than new transmission lines.", "url": "https://wusfnews.wusf.usf.edu/2023-08-11/why-lasers-could-help-utilities-make-the-electrical-grids-greener", "urlToImage": null, "publishedAt": "2023-08-11T09:17:00Z", "content": "SARAH MCCAMMON, HOST:\r\nThe U.S. needs a lot more wind and solar power to reduce its giant carbon footprint. But the country's transmission system isn't big enough yet to move all that newly generated… [+4099 chars]"}]}