{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA, DOE Telescope on Far Side of the Moon Will Reveal the Dark Ages of the Universe - SciTechDaily", "description": "NASA and the Department of Energy (DOE) are working together to develop a science instrument that will survive the harsh and unforgiving environment of the lunar surface at night on the far side of the Moon to attempt first-of-its-kind measurements of the Dar…", "url": "https://scitechdaily.com/nasa-doe-telescope-on-far-side-of-the-moon-will-reveal-the-dark-ages-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Commercial-Lunar-Lander.jpg", "publishedAt": "2023-03-14T08:23:11Z", "content": "ByNASAMarch 14, 2023\r\nNASA and the Department of Energy are collaborating to create an instrument called the Lunar Surface Electromagnetics Experiment Night (LuSEE-Night), which can withstand the har… [+7803 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid danger! Menacing 590-foot Asteroid 2023 CM dashing towards Earth - HT Tech", "description": "NASA expects mammoth Asteroid 2023 CM to make an extremely close approach to the planet as soon as today, March 14.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-danger-menacing-590-foot-asteroid-2023-cm-dashing-towards-earth-71678765782233.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/14/1600x900/asteroid-7836952_640_1678765861944_1678765872650_1678765872650.jpg", "publishedAt": "2023-03-14T03:52:15Z", "content": "A warning has been issued about an asteroid which will pass Earth at an alarmingly close distance. Although scientists have determined that there is no risk of impact as of yet, the asteroid's close … [+1732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sea Monster From Age of Dinosaurs Found on Remote Arctic Island - SciTechDaily", "description": "For nearly 190 years, scientists have searched for the origins of ancient sea-going reptiles from the Age of Dinosaurs. Now a team of Swedish and Norwegian palaeontologists has discovered remains of the earliest known ichthyosaur or ‘fish-lizard’ on the remot…", "url": "https://scitechdaily.com/?p=260349", "urlToImage": "https://scitechdaily.com/images/Reconstruction-of-Earliest-Ichthyosaur.jpg", "publishedAt": "2023-03-14T03:15:22Z", "content": "Reconstruction of the earliest ichthyosaur and the 250-million-year-old ecosystem found on Spitsbergen. Credit: Illustration by Esther van Hulsen\r\nFor nearly 190 years, scientists have searched for t… [+3444 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan", "title": "'Absolutely idiotic'. SVB insider says employees are angry with CEO - CNN", "description": "The blame game is on for who caused Silicon Valley Bank's collapse, and the tech sector is pointing the finger at SVB CEO Greg Becker for allowing his company to go down in history as the second-biggest US banking failure on record.", "url": "https://www.cnn.com/2023/03/13/business/svb-employees-angry-at-ceo/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230313130109-01-svb-silicon-valley-bank-0313.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-13T19:45:00Z", "content": "The blame game is on for who caused Silicon Valley Banks collapse, and the tech sector is pointing the finger at SVB CEO Greg Becker for allowing his company to go down in history as the second-bigge… [+4343 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Apple’s AR/VR headset reportedly being pushed out due to ‘huge pressure to ship’ - TechCrunch", "description": "Apple's mixed reality headset appears to be a given for a 2023 launch, but are the company and industry ready?", "url": "https://techcrunch.com/2023/03/13/apples-ar-vr-headset-reportedly-being-pushed-out-due-to-huge-pressure-to-ship/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1153510742.jpg?resize=1200,675", "publishedAt": "2023-03-13T19:10:24Z", "content": "Stop me if youve heard this one before: Apple is building a mixed reality headset thats set to ship this year. The companys MR (AR+VR) hardware ranks among its longest-lasting rumor cycles. Some (App… [+5676 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "Nokia to go all out with launch of high-end flagship level smartphone Nokia Magic Max - The Tech Outlook", "description": "Last month Nokia debuted a new logo for the company and since then it is speculated that it has something new and special in store for consumers this year. We all know that Nokia has always introduced devices that are entry-level or mid-range but now", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/nokia-to-go-all-out-with-launch-of-high-end-flagship-level-smartphone-nokia-magic-max/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/03/20230313_152909_00001.jpg", "publishedAt": "2023-03-13T10:45:45Z", "content": "Last month Nokia debuted a new logo for the company and since then it is speculated that it has something new and special in store for consumers this year. We all know that Nokia has always introduce… [+2327 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Up to 1,000,000 Times Faster: A Switch Made From a Single Molecule - SciTechDaily", "description": "A unique carbon molecule has been found to possess the ability to operate as multiple high-speed switches at once. An international team of researchers, including those from the University of Tokyo's Institute for Solid State Physics, has made a groundbreakin…", "url": "https://scitechdaily.com/up-to-1000000-times-faster-a-switch-made-from-a-single-molecule/", "urlToImage": "https://scitechdaily.com/images/Fullerene-Switch-scaled.jpg", "publishedAt": "2023-03-13T05:01:54Z", "content": "An artists rendering of a fullerene switch with incoming electron and incident red laser light pulses. Credit: 2023 Yanagisawa et al.\r\nA unique carbon molecule has been found to possess the ability t… [+4549 chars]"}]}