{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Vivid Display of Climate Change: Study Reveals Startling Changes in Ocean Hues - SciTechDaily", "description": "Ocean color changes reflect significant shifts in essential marine ecosystems. The ocean’s color has changed significantly over the last 20 years, and the global trend is likely a consequence of human-induced climate change, report scientists at MIT, the Nati…", "url": "https://scitechdaily.com/a-vivid-display-of-climate-change-study-reveals-startling-changes-in-ocean-hues/", "urlToImage": "https://scitechdaily.com/images/Ocean-Color-Changes-Illustration.jpg", "publishedAt": "2023-07-16T20:57:14Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 16, 2023\r\nScientists from MIT and the National Oceanography Center in the U.K. have discovered that 56% of the worlds oceans have changed col… [+8402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of Vortex Rings: Paving the Way to Efficient Nuclear Fusion - SciTechDaily", "description": "Engineers could gain better control over the behavior of vortices in power generation and other applications with a mathematical model linking these vortices with more pedestrian types, like smoke rings. Gaining deeper insight into the formation of vortex rin…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-vortex-rings-paving-the-way-to-efficient-nuclear-fusion/", "urlToImage": "https://scitechdaily.com/images/Nuclear-Fusion-Physics-scaled.jpg", "publishedAt": "2023-07-16T19:46:46Z", "content": "ByUniversity of MichiganJuly 16, 2023\r\nUniversity of Michigan researchers have developed a model to better understand the formation of vortex rings, which could aid in efficient fuel compression for … [+6745 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Netweb Technologies IPO to open tomorrow | 10 key things to read before applying for offer - Moneycontrol", "description": "The trading in equity shares of Netweb Technologies will start from July 27, as per the IPO schedule.", "url": "https://www.moneycontrol.com/news/business/ipo/netweb-technologies-ipo-to-open-tomorrow-10-key-things-to-read-before-applying-for-offer-10968711.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/IPO-3-770x433.jpg", "publishedAt": "2023-07-16T14:23:52Z", "content": "High-end computing solutions provider Netweb Technologies is set to launch its maiden public issue for subscription next week. This would be the third offering in the current month after Senco Gold, … [+7790 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 vs iPhone 15 Pro: How these two iPhones are likely to differ - HT Tech", "description": "Which iPhone will make more sense this year, the vanilla iPhone 15 or the premium iPhone 15 Pro? Know how these two iPhones stack up against each other.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-vs-iphone-15-pro-how-these-two-iphones-are-likely-to-differ-71689514411952.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/16/1600x900/iPhone_14_Plus_1665584024887_1689514540806.jpg", "publishedAt": "2023-07-16T13:36:14Z", "content": "If Apple sticks to the trend of launching iPhones in September, then iPhone 15 series is just 2 months away! Although leaks and rumours have already revealed a lot about the forthcoming flagship seri… [+2536 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Celebrates First Year, NASA Humanoid Robot, Low Altitude Flights - SciTechDaily", "description": "Celebrating the Webb Space Telescope’s first year of science … Testing remote possibilities of a NASA humanoid robot … And a fleet of clean new rides for Artemis astronauts … A few of the stories to tell you about – This Week at NASA! https://youtu.be/isLhOu_…", "url": "https://scitechdaily.com/this-week-nasa-webb-celebrates-first-year-nasa-humanoid-robot-low-altitude-flights/", "urlToImage": "https://scitechdaily.com/images/Webb-Interstellar-Clouds-Art-Concept.jpg", "publishedAt": "2023-07-16T03:27:58Z", "content": "ByNASAJuly 15, 2023\r\nNASAs James Webb Space Telescope marks its first year of operations, delivering a detailed image of the nearest star-forming region to Earth, the Rho Ophiuchi cloud complex. This… [+4114 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Alert! NASA telescopes find colossal 910-foot asteroid heading towards Earth today - HT Tech", "description": "NASA has warned about a gigantic asteroid heading towards Earth today! Is it potentially hazardous for Earth? Know what NASA revealed.", "url": "https://tech.hindustantimes.com/tech/news/alert-nasa-telescopes-find-colossal-910-foot-asteroid-heading-towards-earth-today-71689477165187.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/16/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1683132681194_1689477299600.jpg", "publishedAt": "2023-07-16T03:15:25Z", "content": "A majority of asteroids can be found in the region of space situated between the orbits of Jupiter and Mars. These celestial bodies follow elliptical paths around the Sun, exhibiting irregular moveme… [+2085 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beating Parkinson's: Intense Exercise Regimen Helps Slow Disease Progression - SciTechDaily", "description": "Intensive exercise can slow the progression of Parkinson's disease by improving brain plasticity and neuronal survival, according to a study from the Catholic University, Rome Campus, and A. Gemelli IRCCS Polyclinic Foundation. The findings may guide the deve…", "url": "https://scitechdaily.com/beating-parkinsons-intense-exercise-regimen-helps-slow-disease-progression/", "urlToImage": "https://scitechdaily.com/images/People-Running-on-Treadmills.jpg", "publishedAt": "2023-07-16T02:16:04Z", "content": "ByUniversita Cattolica del Sacro CuoreJuly 15, 2023\r\nNeuroscientists have discovered that intensive exercise can slow the progression of Parkinsons disease. The research unveils a previously unobserv… [+6344 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "Congress Prepares To Continue Throwing Money At NASA's Space Launch System - Slashdot - Slashdot", "description": "Congress will pour billions more dollars into the Space Launch System (SLS) rocket and its associated architecture, even as NASA science missions remain vulnerable to cuts. TechCrunch reports:  Both the House and Senate Appropriations Committees recommend ear…", "url": "https://science.slashdot.org/story/23/07/14/239257/congress-prepares-to-continue-throwing-money-at-nasas-space-launch-system", "urlToImage": "https://a.fsdn.com/sd/topics/nasa_64.png", "publishedAt": "2023-07-15T20:03:45Z", "content": "Because NASA has a proven track record of being able to be trusted with nothing and should be disbanded???\r\nThis is about SLS so let's start there. SLS... is a money pit and nothing more. They took t… [+4674 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Naima Syed", "title": "Kidney Cells Rejuvenation: A Novel Breakthrough - Asiana Times", "description": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnology. A previously unknown phenomenon of housekeeping, in which…", "url": "https://asianatimes.com/kidney-cells-rejuvenation-a-novel-breakthrough/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/07/USC-News-University-of-Southern-California.jpg", "publishedAt": "2023-07-15T08:37:27Z", "content": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnolog… [+3725 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shining Light on Cosmic Secrets: Scientists Test a Controversial Theory of Blazar Emissions - SciTechDaily", "description": "Penn State researchers have recently characterized over a hundred blazars - far-off, dynamic galaxies hosting a central supermassive black hole that propels potent jets - from a catalog of previously unclassified high-energy cosmic emissions. The newly recogn…", "url": "https://scitechdaily.com/shining-light-on-cosmic-secrets-scientists-test-a-controversial-theory-of-blazar-emissions/", "urlToImage": "https://scitechdaily.com/images/VERITAS-Supplies-Critical-Piece-to-Neutrino-Discovery.jpg", "publishedAt": "2023-07-15T02:55:44Z", "content": "ByPenn StateJuly 14, 2023\r\nThis artists conception shows a blazar the core of an active galaxy powered by a supermassive black hole. Credit: M. Weiss/CfA\r\nPenn State researchers have recently charact… [+8516 chars]"}]}