{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "33 Billion Light Years Away: Webb Space Telescope Finds Galaxies That Challenge Astronomical Theories - SciTechDaily", "description": "Follow-up observations in Pandora’s cluster confirmed the second- and fourth-most distant galaxies ever seen, which are larger than other galaxies at such extreme distances. The second- and fourth-most distant galaxies ever observed have been discovered in a …", "url": "https://scitechdaily.com/?p=327881", "urlToImage": "https://scitechdaily.com/images/Pandoras-Cluster-With-Distant-Galaxies.jpg", "publishedAt": "2023-11-14T03:37:48Z", "content": "ByPenn State UniversityNovember 13, 2023\r\nThe second- and fourth-most distant galaxies ever seen (UNCOVER z-13 and UNCOVER z-12) have been confirmed using the James Webb Space Telescopes Near-Infrare… [+13991 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Tata Technologies IPO to open for subscription on November 22. Details here | Mint - Mint", "description": "Tata Technologies IPO: Tata Motors' subsidiary Tata Technologies is planning to launch its IPO, offering up to 60,850,278 equity shares. The IPO will be open for subscription from November 22 to November 24", "url": "https://www.livemint.com/market/ipo/tata-technologies-ipo-to-open-for-subscription-on-november-22-details-here-11699925789916.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/14/1600x900/Tata_Technologies_IPO_1699926504733_1699926512088.JPG", "publishedAt": "2023-11-14T01:52:29Z", "content": "Tata Technologies IPO: After a gap of nearly two decades, Tata Group is going to launch its initial public offer (IPO) in the primary market. The company plans to float its public issue on November 2… [+2325 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jesse Jenkins", "title": "Scientists uncover aurora-like radio emission above a sunspot - Phys.org", "description": "In a study published in Nature Astronomy, astronomers from New Jersey Institute of Technology's Center for Solar-Terrestrial Research (NJIT-CSTR) have detailed radio observations of an extraordinary aurora-like display occurring 40,000 km above a relatively d…", "url": "https://phys.org/news/2023-11-scientists-uncover-aurora-like-radio-emission.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/njit-scientists-uncove.jpg", "publishedAt": "2023-11-13T21:49:04Z", "content": "In a study published in Nature Astronomy, astronomers from New Jersey Institute of Technology's Center for Solar-Terrestrial Research (NJIT-CSTR) have detailed radio observations of an extraordinary … [+5894 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling the Mysteries: New Insights on Why Marine Predators Dive Into the Dark, Deep Sea - SciTechDaily", "description": "Data from over 300 tags on large marine predators, along with shipboard sonar, point to the ecological importance of the ocean’s twilight zone. If you’ve ever witnessed a shark breach the water—whether in person or somewhere on the Internet—that fleeting but …", "url": "https://scitechdaily.com/unveiling-the-mysteries-new-insights-on-why-marine-predators-dive-into-the-dark-deep-sea/", "urlToImage": "https://scitechdaily.com/images/Deep-Sea-Predators-Art-Concept.jpg", "publishedAt": "2023-11-12T10:27:30Z", "content": "ByWoods Hole Oceanographic InstitutionNovember 12, 2023\r\nNew research using electronic tags and sonar data shows that large marine predators like sharks and tunas often dive into the deep mesopelagic… [+10576 chars]"}]}