{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Google details its protein-folding software, academics offer an alternative - Ars Technica", "description": "Once computationally impossible, AIs now translate protein sequence to structure.", "url": "https://arstechnica.com/science/2021/07/google-details-its-protein-folding-software-academics-offer-an-alternative/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/07/T0806-768x391-760x380.png", "publishedAt": "2021-07-18T13:45:29Z", "content": "8 with 6 posters participating\r\nThanks to the development of DNA-sequencing technology, it has become trivial to obtain the sequence of bases that encode a protein and translate that to the sequence … [+7437 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Africa House empowers 10 startups with $1M entrepreneurial support - Guardian", "description": "Startup accelerator Africa House, in partnership with the Platform Capital Group, is set to invest in 10 enterprises with an aggregated $1 million in funding, technical and business assistance, and in-kind benefits that will propel them towards entrepreneuria…", "url": "https://guardian.ng/business-services/africa-house-empowers-10-startups-with-1m-entrepreneurial-support/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/07/Africa-House-pix-1-e1626614305638.jpg", "publishedAt": "2021-07-18T13:19:10Z", "content": "L-R: Dr. Akintoye Akindele, Chairman, Atlantic and Dupont Midstream, Platform Capital and Africa House; Bishop TD Jakes, Senior Pastor, Potters House, Dallas, Texas; Olakunle Soriyan, futurist/global… [+3605 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Samsung Galaxy Watch 4 series expected to come with huge storage upgrade - TechNave", "description": "By now, you probably know what the&nbsp;Samsung Galaxy Watch 4&nbsp;would look like. Renders of the device have appeared recently, along with details on the new", "url": "https://technave.com/gadget/Samsung-Galaxy-Watch-4-series-expected-to-come-with-huge-storage-upgrade-25833.html", "urlToImage": "https://technave.com/data/files/article/202107181031094851.jpg", "publishedAt": "2021-07-18T10:34:06Z", "content": "By now, you probably know what the Samsung Galaxy Watch 4would look like. Renders of the device have appeared recently, along with details on the new WearOS-based One UI Watch. But we've also got som… [+989 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Technology News Highlights: Windows 11 beta, Xbox controller, PUBG, Galaxy Buds 2, Pokemon GO Fest - take a look - HT Tech", "description": "Mobile Phones, Apps, TV, Wearables, Gadgets and Tech News Updates 12-07-2021: Microsoft Windows 11 beta, Xbox controller, PUBG, Samsung Galaxy Buds 2, Google Doodle for Kadambini Ganguly, Pokemon GO Fest and more are in the news today. Here's what you need to…", "url": "https://tech.hindustantimes.com/tech/news/technology-news-highlights-windows-11-beta-xbox-controller-pubg-galaxy-buds-2-pokemon-go-fest-take-a-look-71626603294632.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/07/18/1600x900/albert-vincent-wu-TwPtq2Av79Q-unsplash_1622482459158_1626603456857.jpg", "publishedAt": "2021-07-18T10:14:54Z", "content": "Tech News Highlights Today: It has been an interesting Sunday in the world of technology, from news of Windows 11 beta arriving in the coming days to Google honouring the first female doctor trained … [+2844 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sneak Peek Into Test Chamber for NASA’s X-59 Quiet SuperSonic Technology Aircraft - SciTechDaily", "description": "Safety is paramount for NASA’s quiet supersonic flight team who are making great strides in preparing for future flight testing with the X-59 Quiet SuperSonic Technology (QueSST) aircraft. To achieve the safest possible environment and aircraft for our pilots…", "url": "https://scitechdaily.com/sneak-peek-into-test-chamber-for-nasas-x-59-quiet-supersonic-technology-aircraft/", "urlToImage": "https://scitechdaily.com/images/NASA-X-59-Test-Chamber.jpg", "publishedAt": "2021-07-18T09:36:18Z", "content": "Credit: KBR, Brooks in San Antonio, Texas\r\nSafety is paramount for NASAs quiet supersonic flight team who are making great strides in preparing for future flight testing with the X-59 Quiet SuperSoni… [+3097 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "The PS5 and Switch OLED are disappointments, so I’m glad I stuck with PC gaming this gen - Techradar", "description": "The Steam Deck could sway me", "url": "https://www.techradar.com/news/the-ps5-and-switch-oled-are-disappointments-so-im-glad-i-stuck-with-pc-gaming-this-gen", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Ms2R7jvTkvKASyiKetLBEU-1200-80.jpg", "publishedAt": "2021-07-18T09:00:27Z", "content": "I was ready to give Sony and Nintendo my money, I really was, but both the PS5 and recently-revealed Nintendo Switch OLED have left me unimpressed, further convincing me that the PC is by far the bes… [+10834 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Andrew Williams", "title": "Canon EOS R7 release date, price, rumors and what we want to see - TechRadar", "description": "The latest whispers about the rumored Canon EOS R7", "url": "https://www.techradar.com/news/canon-eos-r7", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hvbgzhzS5is9jTnKjAJnMf-1200-80.jpg", "publishedAt": "2021-07-18T08:00:00Z", "content": "The Canon EOS R7 is expected to be an important camera. It's rumored to be the first, or among the first, of a new wave of RF-mount mirrorless cameras with APS-C sensors. If the speculation is correc… [+10079 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The businesses that will likely close for good after the looting in South Africa - BusinessTech", "description": "While the last week of violence and looting saw major retailers such as Makro and Pick n Pay take significant damage, experts have warned that it will ultimately be smaller and medium-sized businesses that likely won’t reopen their doors in South Africa again.", "url": "https://businesstech.co.za/news/business/506866/the-businesses-that-will-likely-close-for-good-after-the-looting-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Closed-store.jpg", "publishedAt": "2021-07-18T06:16:52Z", "content": "While the last week of violence and looting saw major retailers such as Makro and Pick n Pay suffer significant damage, experts have warned that it will ultimately be smaller and medium-sized busines… [+3377 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now", "title": "WhatsApp bans 20 lakh accounts; New phones from Oppo, Vivo, Realme; Fake Amazon call centre scam and more tech - Gadgets Now", "description": "This has been an exciting week in the world of technology news with new phones from Vivo, Oppo and Realme while Ola introducing its new electric scooter. In another news, WhatsApp banned 20 lakh accounts in India, on the other hand, you can now track buses in…", "url": "https://www.gadgetsnow.com/slideshows/whatsapp-bans-20-lakh-accounts-new-phones-from-oppo-vivo-realme-fake-amazon-call-centre-scam-and-more-tech-news/photolist/84517560.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-84517574,width-800,resizemode-4,imgsize-25146/share.jpg", "publishedAt": "2021-07-18T04:57:00Z", "content": "The Delhi Police has busted a fake call centre and arrested 26 employees, including five women, for allegedly duping people based in the US by impersonating Amazon customer service providers, officia… [+29 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Saritha Rai", "title": "Flush With Unicorns, India's Tech Moment Arrives - Bloomberg", "description": "Last week marked a watershed for technology startups in India, as a record bout of fundraising shifted attention to the world’s second-most populous market, just as investors were becoming spooked by a crackdown on internet companies in China.", "url": "https://www.bloomberg.com/news/articles/2021-07-17/flush-with-unicorns-india-s-tech-moment-arrives", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i_6CHkAyJMhY/v0/1200x800.jpg", "publishedAt": "2021-07-17T23:30:00Z", "content": "Last week marked a watershed for technology startups in India, as a record bout of fundraising shifted attention to the world’s second-most populous market, just as investors were becoming spooked by… [+6926 chars]"}, {"source": {"id": null, "name": "WindowsLatest"}, "author": null, "title": "Microsoft: Some Windows 11 SKUs will ship in dark mode by default - WindowsLatest", "description": "Tech companies are slowly migrating to dark modes on both mobile and desktop, and Microsoft now wants to enable dark mode in Windows 11 by default. According to Microsoft officials, some SKUs of Windows 11 will now ship in dark mode by default, but users can …", "url": "https://www.windowslatest.com/2021/07/18/microsoft-some-windows-11-skus-will-ship-in-dark-mode-by-default/", "urlToImage": "https://www.windowslatest.com/wp-content/uploads/2021/07/Windows-11-dark-mode.jpg", "publishedAt": "2021-07-17T23:18:47Z", "content": "Tech companies are slowly migrating to dark modes on both mobile and desktop, and Microsoft now wants to enable dark mode in Windows 11 by default. According to Microsoft officials, some SKUs of Wind… [+2176 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRozina Sabur,", "title": "Out of this world: Why humans could one day be living on other planets - Telegraph.co.uk", "description": "Technological advances could one day allow people to engineer their bodies to survive extraterrestrial conditions", "url": "https://www.telegraph.co.uk/news/2021/07/17/world-humans-could-one-day-living-planets/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2019/08/20/TELEMMGLPICT000206862918_trans_NvBQzQNjv4Bq_cocs2IiTVYg8jYnDvW-yFVse9JsN00kzbUr3IXHaGo.jpeg?impolicy=logo-overlay", "publishedAt": "2021-07-17T20:00:00Z", "content": "DNA editing could allow humans to live on new planets within 500 years, a genetic engineering expert who has worked with Nasa has suggested.\r\nChris Mason, a professor of physiology and biophysics at … [+2320 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Joe White", "title": "Disable Windows print spooler or you could be hacked, says Microsoft - TechSpot", "description": "This is the third print spooler vulnerability to emerge in just five weeks. While a critical flaw was originally identified and patched in June, a similar flaw...", "url": "https://www.techspot.com/news/90459-disable-windows-print-spooler-or-you-could-hacked.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/07/2021-07-02-image-4.png", "publishedAt": "2021-07-17T16:10:00Z", "content": "Facepalm: Microsoft is once again advising its customers to disable Windows print spooler, after a new vulnerability that allows hackers to execute malicious code on machines has emerged. While a pat… [+1564 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "ISABELLE LIEW", "title": "SCDF rescues lift technician from bottom of a lift shaft at Paragon mall - The Straits Times", "description": "It took about six hours to extricate the Bangladeshi worker, SCDF said.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/community/scdf-rescued-lift-technician-from-bottom-of-a-lift-shaft-at-paragon-mall", "urlToImage": "https://www.straitstimes.com/s3/files/styles/x_large/public/articles/2021/07/17/rk_lift-technician_170721.jpg?itok=cfVRZXa-", "publishedAt": "2021-07-17T13:32:33Z", "content": "SINGAPORE - A lift technician was injured after an incident in a lift shaft at Paragon Shopping Centre on Saturday (July 17).\r\nThe Singapore Civil Defence Force (SCDF) said in a Facebook post that it… [+951 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ", "title": "Dr Tara Shirvani on the environmental cost of crypto: 'We have to find solutions' - RNZ", "description": "<p>Bitcoin mining is a way people can acquire cryptocurrency without buying it. While the process may be lucrative, it is also hugely energy intensive. Dr Tara Shirvani is an infrastructure specialist passionate about leveraging technology and finance to driv…", "url": "https://www.rnz.co.nz/national/programmes/saturday/audio/2018804363/dr-tara-shirvani-on-the-environmental-cost-of-crypto-we-have-to-find-solutions", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/126461/eight_col_Tara_Shivani.jpg?1626414767", "publishedAt": "2021-07-16T20:56:03Z", "content": "The environmental cost of cryptocurrencies is too high to make them a good choice for anyone who cares about the planet, says disruptive technologies expert Dr Tara Shirvani. \r\nBitcoin mining has a h… [+3701 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Japan sets new world record with Internet speed of 319 terabits per second - TechSpot", "description": "To achieve this feat, the researchers (led by led by Benjamin J. Puttnam) built a transmission system that fully utilizes wavelength division multiplexing technology by combining different...", "url": "https://www.techspot.com/news/90452-japan-sets-new-world-record-internet-speed-319.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/07/2021-07-16-image-9.jpg", "publishedAt": "2021-07-16T20:02:00Z", "content": "Editor's take: A team of researchers from the National Institute of Information and Communication Technology (NICT) in Japan have blown the old Internet speed record of 178 terabits a second out of t… [+1406 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Nathan Birch", "title": "PlayStation Images Found in Netflix App Code, Igniting Speculation About a Big Partnership - Wccftech", "description": "Netflix has made it clear they’re preparing the enter the world of gaming, recently hiring Mike Verdu, a veteran of EA, Zynga, and Oculus, to head up their gaming division. Word is, Netflix may begin offering video games to their subscribers as early as next …", "url": "https://wccftech.com/playstation-netflix-partnership-rumor/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2021/07/WCCFplaystationnetflix.jpg", "publishedAt": "2021-07-16T15:38:10Z", "content": "Netflix has made it clear theyre preparing the enter the world of gaming, recently hiring Mike Verdu, a veteran of EA, Zynga, and Oculus, to head up their gaming division. Word is, Netflix may begin … [+1764 chars]"}]}