{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mediterranean Diet Linked With 23% Lower Risk of Dementia - SciTechDaily", "description": "Eating a traditional Mediterranean-type diet – rich in foods such as seafood, fruit, and nuts – may help reduce the risk of dementia by almost a quarter, a new study has revealed. Experts at Newcastle University found that individuals who ate a Mediterranean-…", "url": "https://scitechdaily.com/?p=260727", "urlToImage": "https://scitechdaily.com/images/Healthy-Mediterranean-Diet-Food-Concept-Illustration.jpg", "publishedAt": "2023-03-15T21:31:52Z", "content": "According to a study by Newcastle University, consuming a traditional Mediterranean diet consisting of foods such as seafood, fruit, and nuts may decrease the risk of developing dementia by up to 23%… [+4797 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Poco X5 5G launched; Gets Snapdragon 695 chipset- Check price, specifications - HT Tech", "description": "The Poco X5 5G smartphone has been launched in India. The smartphone features a Snapdragon 695 chipset and gets a 48MP primary camera. Check out its price, availability and specifications.", "url": "https://tech.hindustantimes.com/mobile/news/poco-x5-5g-launched-gets-snapdragon-695-chipset-check-price-specifications-71678869894963.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/15/1600x900/Screenshot_2023-03-15_141838_1678870137523_1678870151271_1678870151271.png", "publishedAt": "2023-03-15T08:51:16Z", "content": "After the Poco X5 Pro, which was launched last month in India, the company has now unveiled its base version, Poco X5 5G. Both the smartphones are part of the Poco X5 series and were globally launche… [+1785 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Microsoft-backed OpenAI starts release of powerful AI known as GPT-4 - Arab News", "description": "CALIFORNIA: The startup OpenAI on Tuesday said it is beginning to release a powerful artificial intelligence model known as GPT-4, setting the stage for human-like technology to proliferate and more competition between its backer Microsoft Corp. and Alphabet …", "url": "https://www.arabnews.com/node/2268816", "urlToImage": "https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2023/03/15/3725551-617208987.jpg?itok=C6fxXFML", "publishedAt": "2023-03-14T22:18:14Z", "content": "King Abdullah University of Science and Technology has launched Dear AI, an International Womens Day campaign and hackathon to tackle gender bias and the under-representation of women in artificial i… [+2871 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Comet C/2023 A3 to visit Earth in 2024; was mistaken for an asteroid - HT Tech", "description": "Comet C2023 A3 to visit Earth in 2024 was mistaken for an asteroid Know all about the new bright new comet that is to visit Earth in 2024.Pixabay On February 1 the world witnessed the passing of the Comet C2022 E3 ZTF popularly known as the Green comet due to…", "url": "https://tech.hindustantimes.com/web-stories/comet-c-2023-a3-to-visit-earth-in-2024-was-mistaken-for-an-asteroid-71678773120292.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/14/1600x900/comet-3999308__480_1678775995349_1678776167237_1678776167237.jpg/", "publishedAt": "2023-03-14T06:43:22Z", "content": "Know all about the new bright new comet that is to visit Earth in 2024. (Pixabay)\r\nOn February 1, the world witnessed the passing of the Comet C/2022 E3 (ZTF), popularly known as the Green comet due … [+1353 chars]"}]}