{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering the Dark: The Accelerating Universe and the Quest for Dark Energy - SciTechDaily", "description": "Dark energy's role in propelling the universe's accelerated expansion presents a pivotal challenge in astrophysics, driving ongoing research and space missions dedicated to uncovering the nature of this mysterious force. Some 13.8 billion years ago, the unive…", "url": "https://scitechdaily.com/deciphering-the-dark-the-accelerating-universe-and-the-quest-for-dark-energy/", "urlToImage": "https://scitechdaily.com/images/History-Universe-Infographic-scaled.jpg", "publishedAt": "2024-03-10T08:32:48Z", "content": "The history of the universe is outlined in this infographic. Credit: NASA\r\nDark energy’s role in propelling the universe’s accelerated expansion presents a pivotal challenge in astrophysics, driving … [+14562 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Saumya Nigam", "title": "NASA's Crew 7 aims returning to Earth on March 12: Details - India TV News", "description": "During their six months on the ISS, the Crew-7 conducted science experiments and technology demonstrations to benefit people on Earth and prepare humans for future space missions.", "url": "https://www.indiatvnews.com/science/nasa-s-crew-7-aims-returning-to-earth-on-march-12-details-2024-03-10-920773", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/03/pixabay-space-1710059133.jpg", "publishedAt": "2024-03-10T08:27:33Z", "content": "NASAs 7 astronauts crew which is onboard the International Space Station (ISS) are preparing to return to Earth, after a 6-month stay in the orbiting lab, the US space agency has said. \r\nIn an offici… [+1451 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Apple terminates Epic’s account, Meta platforms get knocked offline and former Twitter execs sue Elon Musk - TechCrunch", "description": "In this edition of TC's Week in Review (WiR) newsletter, we cover Apple terminating Epic's dev account, former Twitter execs suing Elon Musk and more.", "url": "https://techcrunch.com/2024/03/09/apple-terminates-epics-account-meta-platforms-get-knocked-offline-and-former-twitter-execs-sue-elon-musk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/fortnite-epic-games.jpg?w=1024", "publishedAt": "2024-03-09T21:15:56Z", "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunchs newsletter covering all of — or at least the bulk of! — noteworthy happenings around the tech-o-sphere.\r\nThis week, Roku played hardball with … [+3625 chars]"}]}