{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Foundation of All Known Life: Webb Telescope Makes First Detection of Crucial Carbon Molecule - SciTechDaily", "description": "This molecule, never before seen in space, is believed to be a cornerstone of interstellar organic chemistry. Carbon compounds form the foundations of all known life, and as such are of particular interest to scientists working to understand both how life dev…", "url": "https://scitechdaily.com/foundation-of-all-known-life-webb-telescope-makes-first-detection-of-crucial-carbon-molecule/", "urlToImage": "https://scitechdaily.com/images/Webb-Space-Telescope-Organic-Molecule-Discovery-Concept-Art.jpg", "publishedAt": "2023-06-27T08:33:57Z", "content": "BySpace Telescope Science InstituteJune 27, 2023\r\nScientists have detected a new carbon compound, methyl cation, in space for the first time using NASAs James Webb Space Telescope. This compound, cru… [+9248 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After Google Pixel battery drain issue pops up, frustrated users take to Reddit to complain - HT Tech", "description": "Many users are complaining about a problem in Google Pixel phones where the battery is draining faster than usual. The issue has emerged after a June update.", "url": "https://tech.hindustantimes.com/mobile/news/after-google-pixel-battery-drain-issue-pops-up-frustrated-users-take-to-reddit-to-complain-71687849616266.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/battery_1686654536299_1687849817217.jpg", "publishedAt": "2023-06-27T07:17:20Z", "content": "Earlier this month, Google released a new update for Pixel smartphones where new features were added to the supported devices. The features brought the macro focus mode to videos for Pixel 7 Pro as w… [+2034 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Space miracle or dud? Comet Tsuchinshan-ATLAS to fly by Earth; know when to watch - HT Tech", "description": "Comet C/2023 A3 is set to pass Earth in 2024 and it will outshine the night sky, as per astronomers", "url": "https://tech.hindustantimes.com/tech/news/space-miracle-or-dud-comet-tsuchinshan-atlas-to-fly-by-earth-know-when-to-watch-71687842295935.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/comet_1_1677992934323_1687842371518.jpg", "publishedAt": "2023-06-27T05:09:11Z", "content": "While asteroids pass by Earth virtually every day and some small ones crash into it, Comets are a rarity and when they come calling, it is exciting time not just for the astronomers, but also for the… [+2108 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Press Trust Of India", "title": "UN chief Guterres appoints Indian-origin satellite expert as Director of UN Office for Outer Space Affairs - Republic World", "description": "UNOOSA works to promote international cooperation in the peaceful use and exploration of space and in utilisation of space science and technology for sustainable economic and social development", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/un-chief-guterres-appoints-indian-origin-satellite-expert-as-director-of-un-office-for-outer-space-affairs-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/qvrdmgbpvlssnaaj_1687841453.jpeg", "publishedAt": "2023-06-27T04:54:00Z", "content": "UN Secretary-General Antonio Guterres has appointed Indian-origin satellite industry expert Aarti Holla-Maini as Director of the United Nations Office for Outer Space Affairs (UNOOSA) in Vienna. Holl… [+1697 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar system sends another asteroid shooting towards Earth; this aircraft-sized rock expected today - HT Tech", "description": "Yet another asteroid is expected to make its closest approach to Earth, and NASA has revealed details of this shocking close encounter.", "url": "https://tech.hindustantimes.com/tech/news/solar-system-sends-another-asteroid-shooting-towards-earth-this-aircraft-sized-rock-expected-today-71687840689211.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/27/1600x900/orbit-viewer-snapshot_1687840794176_1687840798949.jpg", "publishedAt": "2023-06-27T04:45:34Z", "content": "Even though there are millions of asteroids in our solar system, only a handful of them have been observed. As per NASA, the current known asteroid count is roughly 1,298,148. But why is studying the… [+2101 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can't Take Statin Side Effects? Bempedoic Acid Lowers LDL Cholesterol and Reduces Cardiovascular Risks - SciTechDaily", "description": "Drug lowers LDL cholesterol and reduces the risk of serious cardiovascular outcomes in a large trial. The cholesterol-lowering drug bempedoic acid reduced the combined rate of major adverse cardiovascular events by 13%, meeting its primary endpoint in a large…", "url": "https://scitechdaily.com/cant-take-statin-side-effects-bempedoic-acid-lowers-ldl-cholesterol-and-reduces-cardiovascular-risks/", "urlToImage": "https://scitechdaily.com/images/Heart-Health-Boost-Concept-Art.jpg", "publishedAt": "2023-06-26T20:55:19Z", "content": "ByAmerican College of CardiologyJune 26, 2023\r\nBempedoic acid, a cholesterol-lowering drug, has shown positive results in a large trial, reducing major adverse cardiovascular events by 13% in patient… [+6383 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unseen Intruders: Ancient Viruses Discovered in Coral Symbionts' DNA - SciTechDaily", "description": "Researchers surprised to find fragments of RNA viruses in coral partners’ genomes. Scientists have discovered ancient RNA virus remnants in the DNA of organisms living within reef-building corals. This unexpected find, detailed in Communications Biology, coul…", "url": "https://scitechdaily.com/unseen-intruders-ancient-viruses-discovered-in-coral-symbionts-dna/", "urlToImage": "https://scitechdaily.com/images/Ancient-Viruses-DNA-Illustration.jpg", "publishedAt": "2023-06-26T16:39:15Z", "content": "ByRice UniversityJune 26, 2023\r\nAn international team of scientists has uncovered remnants of ancient RNA viruses in the DNA of symbiotic organisms within reef-building corals. This surprising discov… [+10077 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Carrie Marshall", "title": "OnePlus' new wireless earbuds could be an even better bargain buy than Sony's WF-C500 - TechRadar", "description": "If you thought the Nord Buds 2 were good value, the new version should be an even bigger bargain", "url": "https://www.techradar.com/audio/wireless-headphones/oneplus-new-wireless-earbuds-could-be-an-even-better-bargain-buy-than-sonys-wf-c500", "urlToImage": "https://cdn.mos.cms.futurecdn.net/YbLxMEGMLLNYXu2KmoD7zb-1200-80.jpg", "publishedAt": "2023-06-26T14:48:42Z", "content": "OnePlus is set to launch a new more budget friendly pair of earbuds on July 5. The OnePlus Nord Buds 2r will officially be announced on June 27, but leaks have surfaced online already and the price l… [+2247 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Unlocks Hidden Secrets of Primate Evolution - SciTechDaily", "description": "Analyses of 50 primate genomes through comparative genomics unveil essential genetic processes involved in primate speciation, adaptive phenotypic changes, and the evolution of social systems. A series of publications from the first phase program of the Prima…", "url": "https://scitechdaily.com/new-research-unlocks-hidden-secrets-of-primate-evolution/", "urlToImage": "https://scitechdaily.com/images/Rainbow-Monkey-Evolution-Primate.jpg", "publishedAt": "2023-06-26T14:11:38Z", "content": "ByBGI GroupJune 26, 2023\r\nAn international research consortium co-led by scientists from multiple universities has released a series of studies detailing new high-quality reference genomes from 50 pr… [+17021 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Francesco De Meo", "title": "Dark Souls Unreal Engine 5 Tribute Is a Sight to Behold Thanks to Great Usage of Lumen - Wccftech", "description": "A Dark Souls tribute made in Unreal Engine 5 was shared online a few days ago, making us hunger for a proper remake even more", "url": "https://wccftech.com/dark-souls-unreal-engine-5-lumen/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/Dark-Souls-UE5-scaled.jpg", "publishedAt": "2023-06-26T09:59:00Z", "content": "A new Dark Souls short tribute video made in Unreal Engine 5 was shared online a few days ago, making us hunger for an official remake of the now-classic action role-playing game even more.\r\nThe trib… [+1008 chars]"}]}