{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "iPhone 15 Pro Max smartphone may feature thinnest screen bezels to date - Business Standard", "description": "Tech giant Apples upcoming iPhone 15 Pro Max smartphone will reportedly  break record  of the thinnest screen bezels to date", "url": "https://www.business-standard.com/article/companies/iphone-15-pro-max-smartphone-may-feature-thinnest-screen-bezels-to-date-123031800553_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-10/26/full/1666757430-6891.jpg", "publishedAt": "2023-03-18T12:32:00Z", "content": "Tech giant Apple's upcoming iPhone 15 Pro Max smartphone will reportedly \"break record\" of the thinnest screen bezels to date.\r\nTipster Ice Universe tweeted on Friday: \"iPhone 15 Pro Max will break t… [+977 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Pawan Rai", "title": "Apple`s Foldable iPhone May Protect Itself From Drops - Zee News", "description": "Tech giant Apple is reportedly working on a new technology that will enable iPhones and iPads with flexible screens to sense drops and automatically fold up on the way to the ground to minimise damage.", "url": "https://zeenews.india.com/technology/apples-foldable-iphone-may-protect-itself-from-drops-2585102.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/03/18/1169431-untitled-design-2023-03-18t170551.907.jpg", "publishedAt": "2023-03-18T11:36:31Z", "content": "New Delhi: Tech giant Apple is reportedly working on a new technology that will enable iPhones and iPads with flexible screens to sense drops and automatically fold up on the way to the ground to min… [+1613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Discovery: Equatorial Relict Glacier Uncovered on Mars - SciTechDaily", "description": "The preservation of water ice at shallow depths and low latitudes on Mars would have significant implications for both scientific research and human exploration. During the 54th Lunar and Planetary Science Conference that took place in The Woodlands, Texas, s…", "url": "https://scitechdaily.com/stunning-discovery-equatorial-relict-glacier-uncovered-on-mars/", "urlToImage": "https://scitechdaily.com/images/Relict-Glacier.jpg", "publishedAt": "2023-03-18T10:30:46Z", "content": "BySETI InstituteMarch 18, 2023\r\nA Relict Glacier near Mars Equator. (NASA MRO HiRISE and CRISM false color composite). Credit: Pascal Lee\r\nThe preservation of water ice at shallow depths and low lati… [+6509 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 18 March 2023: Wolf-Rayet 124 star-30x BIGGER than Sun - HT Tech", "description": "NASA Astronomy Picture of the Day is one of the most luminous stars - the Wolf-Rayet 124. NASA shares details.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-18-march-2023-wolf-rayet-124-star-30x-bigger-than-sun-71679130751407.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/18/1600x900/WR124_Webb1024_1679130818660_1679130833475_1679130833475.png", "publishedAt": "2023-03-18T09:14:52Z", "content": "One of the most luminous and massive stars, known as Wolf-Rayet 124, has been snapped by NASA. The US space agency has shared it as its Astronomy Picture of the Day on March 18. It was first observed… [+1855 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 Pro Max to MAKE a new record! Could bring THINNEST bezels on a smartphone - HT Tech", "description": "Apple's iPhone 15 Pro Max is all set to break the record of smartphone having thinnest bezel. Here is what the latest leak informs.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-pro-max-to-make-a-new-record-could-bring-thinnest-bezels-on-a-smartphone-71679127568269.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/18/1600x900/IMG_5094_1665651473562_1679127642055_1679127642055.jpg", "publishedAt": "2023-03-18T08:24:49Z", "content": "With so many new features and specifications, Apple's upcoming iPhone 15 Pro Max is already one of the most awaited phones of the year. And now it is being said that the iPhone 15 Pro Max is all set … [+1725 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": "Priya Pathak", "title": "Samsung Galaxy A54 launch, ChatGPT Plus, Oppo Find N2 Flip price reveal and more l FE Tech Bytes top news of the week - The Financial Express", "description": "With life often being fast and hectic, it can be challenging to keep up with every news story. To help you stay informed, here’s a brief rundown of the most significant events from this week.", "url": "https://www.financialexpress.com/life/technology-samsung-galaxy-a54-launch-chatgpt-plus-oppo-find-n2-flip-price-reveal-and-more-l-fe-tech-bytes-top-news-of-the-week-3014100/", "urlToImage": "https://www.financialexpress.com/wp-content/uploads/2023/03/OPPO-FIND-N2-FLIP-INDIA-PRICE.webp", "publishedAt": "2023-03-18T06:41:39Z", "content": "Samsung launched new Galaxy A series phones this week- Galaxy A54 and Galaxy A34. Both the phones have a design similar to Galaxy S23 including the floating cameras, glass back and more.\r\nOpenAI, the… [+3029 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Quantum sensing in outer space: New NASA-funded research will build next-gen tech to better measure climate - EurekAlert", "description": "Texas Engineers are leading a multi-university research team that will build technology and tools to improve measurement of important climate factors by observing atoms in outer space. \n\nThey will focus on the concept of quantum sensing, which use quantum phy…", "url": "https://www.eurekalert.org/news-releases/983161", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/b9850279-7958-4293-b12c-321c9401d2b7/Rendition/thumbnail/Content/Public", "publishedAt": "2023-03-18T02:02:50Z", "content": "image: The Perito Moreno Glacier in Argentina is seen from the International Space Station on Feb. 21, 2012. A new NASA Space Technology Research Institute will specialize in advancing quantum sensin… [+4885 chars]"}]}