{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Biology: Unlocking the Mysteries of How Life Works - SciTechDaily", "description": "Quantum biology explores how quantum effects influence biological processes, potentially leading to breakthroughs in medicine and biotechnology. Despite the assumption that quantum effects rapidly disappear in biological systems, research suggests these effec…", "url": "https://scitechdaily.com/quantum-biology-unlocking-the-mysteries-of-how-life-works/", "urlToImage": "https://scitechdaily.com/images/DNA-3D-Molecular-Model-Illustration.jpg", "publishedAt": "2023-05-21T16:11:15Z", "content": "ByClarice D. Aiello, University of California, Los AngelesMay 21, 2023\r\nLooking at life at the atomic scale offers a more comprehensive understanding of the macroscopic world.\r\nQuantum biology explor… [+10126 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Akram M", "title": "Bengaluru techie dead after car enters flooded K R Circle underpass - The Indian Express", "description": "Bhanurekha was rushed to the nearby St Martha's Hospital, but was declared dead by doctors. Chief Minister Siddaramaiah visited the hospital and declared an ex-gratia of Rs five lakh to the kin of the victim.", "url": "https://indianexpress.com/article/cities/bangalore/techie-dead-car-enters-flooded-k-r-circle-underpass-8621450/", "urlToImage": "https://images.indianexpress.com/2023/05/flooded-underpass-1.jpg", "publishedAt": "2023-05-21T13:13:34Z", "content": "A techie died after the car she was travelling in entered a flooded underpass at K R Circle in the heart of Bengaluru Sunday.The deceased has been identified as Bhanurekha, 22, who was employed at In… [+1533 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Divya", "title": "iPhone 15 may get several new upgrades, but this one will be the BIGGEST one - HT Tech", "description": "iPhone 15 is tipped to get a bunch of exciting upgrades this year, and here is one of the biggest ones.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-may-get-several-new-upgrades-but-this-one-will-be-the-biggest-one-71684673078425.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/21/1600x900/IMG_5080_1665815577561_1684673176437.jpg", "publishedAt": "2023-05-21T12:46:58Z", "content": "iPhone 15 Pro and Pro Max will get some notable upgrades. That is a given. But the standard iPhone 15 is surely going to be worth paying attention to because it will get several important features to… [+1684 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "PM Modi meets Rishi Sunak, Brazil's Lula at G7; review strategic ties - Hindustan Times", "description": "Modi and Sunak also agreed to deepen cooperation in a range of areas, including trade, investment, science and technology, and higher education. | Latest News India", "url": "https://www.hindustantimes.com/india-news/modi-and-sunak-review-india-uk-fta-negotiations-discuss-g20-presidency-and-deepen-cooperation-in-various-areas-101684672208524.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/21/1600x900/Prime-minister-Narendra-Modi-and-British-PM-Rishi-_1684672199356.jpg", "publishedAt": "2023-05-21T12:30:08Z", "content": "Prime Minister Narendra Modi and his British counterpart Rishi Sunak on Sunday reviewed the comprehensive strategic partnership between the two countries and took stock of progress in negotiations fo… [+2859 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Gene Marks", "title": "How Google Will Soon Write Emails For You, And Other Small Biz Tech News This Week - Forbes", "description": "Google announced \"help me write\" a soon-to-be added feature in Gmail and Microsoft is leveraging ChatGPT in some of its apps.", "url": "https://www.forbes.com/sites/quickerbettertech/2023/05/21/how-google-will-soon-write-emails-for-you-and-other-small-biz-tech-news-this-week/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6467b8af6fd7eb31e814265b/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-05-21T11:00:00Z", "content": "Side view of female hand typing on laptop keyboard. Freelancer working with laptop at cafe. ... [+] Technology and flexible working.\r\ngetty\r\nHere are five things in tech that happened this week and h… [+4034 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Divyanshi Sharma", "title": "Google employee fired after 15 years of service, says company will always have a special place in her heart - India Today", "description": "A Google employee, who was among the 12,000 people who were fired from the tech giant, took to LinkedIn and shared her layoff story. She was with the company for 15 years.", "url": "https://www.indiatoday.in/technology/news/story/google-employee-fired-after-15-years-of-service-says-company-will-always-have-a-special-place-in-her-heart-2382212-2023-05-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202305/google_1-sixteen_nine.jpeg?VersionId=JGnR63CB9U3iJI8Wo7_JVY17JhJip8wT", "publishedAt": "2023-05-21T10:31:57Z", "content": "By Divyanshi Sharma: Tech layoffs brutally shook up the industry in January this year when tech giants like Google and Amazon announced large-scale layoffs. In a short span of time, thousands of empl… [+2271 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Join the Hunt: Astronomers Need Help Finding Asteroids Hurtling Through Our Solar System - SciTechDaily", "description": "Anyone with an internet connection can now join University of Arizona researchers as they work to discover asteroids hurtling through our solar system. Anyone can become an asteroid hunter thanks to a new program launched by astronomers at the University of A…", "url": "https://scitechdaily.com/?p=279521", "urlToImage": "https://scitechdaily.com/images/Near-Earth-Asteroid-Illustration.jpg", "publishedAt": "2023-05-20T21:09:02Z", "content": "ByKylianne Chadwick, University of ArizonaMay 20, 2023\r\nThe University of Arizona Lunar and Planetary Laboratory has created an online portal as part of the NASA-funded Catalina Sky Survey, allowing … [+6016 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "SpaceX launches OneWeb Gen 2 technology demonstrator - SpaceNews", "description": "SpaceX launched a technology demonstration satellite for OneWeb’s second-generation broadband constellation May 20, along with spares for the British firm’s current low Earth orbit network and another that U.S.-based Iridium Communications operates.", "url": "https://spacenews.com/spacex-launches-oneweb-gen-2-technology-demonstrator/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/05/JoeySat-pair-separates-scaled.jpg", "publishedAt": "2023-05-20T15:12:37Z", "content": "TAMPA, Fla. SpaceX launched a technology demonstration satellite for OneWebs second-generation broadband constellation May 20, along with spares for the British firms current low Earth orbit (LEO) ne… [+2727 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bridging Quantum Theory and Relativity: Curved Spacetime in a Quantum Simulator - SciTechDaily", "description": "New techniques can answer questions that were previously inaccessible experimentally — including questions about the relationship between quantum mechanics and relativity. Scientists at TU Wien and other institutions have developed a \"quantum simulator\" using…", "url": "https://scitechdaily.com/bridging-quantum-theory-and-relativity-curved-spacetime-in-a-quantum-simulator/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Lens-EffectQuantum-Particles.jpg", "publishedAt": "2023-05-20T11:39:04Z", "content": "ByTU WienMay 20, 2023\r\nIn the background: the gravitational lens effect, an example of an effect explained by relativity. With quantum particles, analogous effects can be studied. Credit: NASA / TU W… [+6777 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "The all-new Nokia 105 & 106 4G now available with built-in UPI apps- first budget smartphones to be loaded with UPI feature - The Tech Outlook", "description": "Payments with UPI have become the default payment mode nowadays, especially in the past few years. Though the UPI payments were only possible after app installation only on smartphones. But now this has been changed by Nokia as the company has made U", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/the-all-new-nokia-105-106-4g-now-available-with-built-in-upi-apps-first-budget-smartphones-to-be-loaded-with-upi-feature/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/05/jpg_20230520_153234_00001.jpg", "publishedAt": "2023-05-20T10:40:11Z", "content": "Payments with UPI have become the default payment mode nowadays, especially in the past few years. Though the UPI payments were only possible after app installation only on smartphones. But now this … [+1379 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 20 May 2023: STUNNING view of Jupiter's Moon Europa - HT Tech", "description": "NASA Astronomy Picture of the Day 20th May snaps Galileo's Europa moon which holds the possibility of life beyond Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-20-may-2023-stunning-view-of-jupiters-moon-europa-71684564144900.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/20/1600x900/PIA19048europa1024_1684564229079_1684564238576.jpg", "publishedAt": "2023-05-20T06:31:20Z", "content": "Jupiter is the second planet in our solar system with the most number of moons at 95! Among these, the smallest of Jupiter's four Galilean moons is Europa which is the sixth closest to the planet. Eu… [+2068 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Marc McLaren", "title": "Quordle today - hints and answers for Saturday, May 20 (game #481) - TechRadar", "description": "Our clues will help you solve Quordle today and keep that streak going", "url": "https://www.techradar.com/news/quordle-today-answers-clues-20-may-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4XP9iNbdvkijJyZnzx3WoL-1200-80.jpg", "publishedAt": "2023-05-20T06:22:04Z", "content": "Quordle needs to be approached in a different way to Wordle. With four puzzles to solve in nine guesses, you can't blindly throw letters at it and expect to win - you'll stand a far better chance if … [+1813 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! Earth suffers blackouts as sun spews solar flares, NOAA satellite shows - HT Tech", "description": "A sunspot duo has been exploding non-stop, producing a barrage of M-class solar flares on the Sun. The ultraviolet radiation has resulted in a rolling series of blackouts across the planet. More solar storm trouble coming?", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-earth-suffers-blackouts-as-sun-spews-solar-flares-noaa-satellite-shows-71684555583290.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/20/1600x900/Sun_1677738983844_1684555628446.jpg", "publishedAt": "2023-05-20T04:12:22Z", "content": "The Geostationary Operational Environmental Satellite-16 (GOES-16), operated by the National Oceanic and Atmospheric Administration (NOAA) has picked up some really concerning data. According to its … [+2464 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "High-Quality 2D Films Could Be One-Drop Away - Eurasia Review", "description": "A research group led by Professor Minoru Osada and postdoctoral researcher Yue Shi at the Institute for Future Materials and Systems (IMaSS), Nagoya University in Japan, has developed a new technol…", "url": "https://www.eurasiareview.com/20052023-high-quality-2d-films-could-be-one-drop-away/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2023/05/a-116.png?fit=800%2C450&ssl=1", "publishedAt": "2023-05-19T23:28:18Z", "content": "A research group led by Professor Minoru Osada and postdoctoral researcher Yue Shi at the Institute for Future Materials and Systems (IMaSS), Nagoya University in Japan, has developed a new technolog… [+2980 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The “Rosetta Stone” of Paleontology: 400 Million-Year-Old Fossil Cache Unveils Early Life - SciTechDaily", "description": "Cutting-edge technology has revealed new insights about a globally famous fossil treasure trove, which may provide critical evidence concerning early life on Earth. Scientists investigating the 400 million-year-old fossil cache, discovered in the remote north…", "url": "https://scitechdaily.com/the-rosetta-stone-of-paleontology-400-million-year-old-fossil-cache-unveils-early-life/", "urlToImage": "https://scitechdaily.com/images/Rhynie-Fossil-Plant-With-Fossil-Fungi-scaled.jpg", "publishedAt": "2023-05-19T21:07:58Z", "content": "ByUniversity of EdinburghMay 19, 2023\r\nA small piece of Rhynie fossil plant with fossil fungi colonizing the ends, viewed through a microscope. Credit: Loron et al.\r\nCutting-edge technology has revea… [+3536 chars]"}]}