{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Pokémon Company will “investigate” Palworld in light of plagiarism accusations - Ars Technica", "description": "Palworld has sold 8 million copies and is currently Steam's most-played game.", "url": "https://arstechnica.com/gaming/2024/01/pokemon-company-will-investigate-palworld-in-light-of-plagiarism-accusations/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/palworld-02-760x380.jpeg", "publishedAt": "2024-01-25T15:29:11Z", "content": "Enlarge/ Everyone is focused on the Pals that look a lot like Pokémon; meanwhile, this guy is just a Totoro painted yellow. \r\n87\r\nThis past weekend, a monster-catching survival game called Palworldto… [+3500 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Bob Yirka", "title": "A method for extracting iron from aluminum production waste - Tech Xplore", "description": "A team of metallurgists in Germany has developed a technique for extracting iron from aluminum production waste. In their paper published in the journal Nature, the group outlines their process and its degree of efficiency. Chenna Rao Borra, with the Indian I…", "url": "https://techxplore.com/news/2024-01-method-iron-aluminum-production.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/a-method-for-extractin.jpg", "publishedAt": "2024-01-25T14:57:06Z", "content": "A team of metallurgists in Germany has developed a technique for extracting iron from aluminum production waste. In their paper published in the journal Nature, the group outlines their process and i… [+2599 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shivendra Kumar", "title": "Tech Mahindra shares plunge 6% on Q3 earnings. Here's what brokerages recommend - The Economic Times", "description": "Shares of Tech Mahindra fell more than 6% following disappointing Q3 results. Kotak Institutional Equities and Nuvama retained their 'Reduce' ratings. Kotak highlighted the long turnaround journey for Tech Mahindra despite healthy revenue growth, citing macro…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/tech-mahindra-shares-plunge-6-on-q3-earnings-heres-what-brokerages-recommend/articleshow/107131388.cms", "urlToImage": "https://img.etimg.com/thumb/msid-107131373,width-1200,height-630,imgsize-8704,overlay-etmarkets/photo.jpg", "publishedAt": "2024-01-25T04:06:23Z", "content": "Shares of Tech Mahindra fell more than 6% in Thursdays trade to the day's low of Rs 1,320.05 on the NSE following a disappointing set of numbers posted by the company for the December quarter. A coup… [+2293 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Salad Dilemma: Study Raises Health Concerns for Astronauts - SciTechDaily", "description": "Research team finds lettuce and other plants are more susceptible to bacterial infections in space than on Earth. Lettuce and other leafy green vegetables are part of a healthy, balanced diet — even for astronauts on a mission. It’s been more than three years…", "url": "https://scitechdaily.com/space-salad-dilemma-study-raises-health-concerns-for-astronauts/", "urlToImage": "https://scitechdaily.com/images/Space-Plant.jpg", "publishedAt": "2024-01-25T03:43:24Z", "content": "Researchers at the University of Delaware are looking at how plants grown in space are more prone to infections of Salmonella compared to plants not grown in space or grown under gravity simulations.… [+8251 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anna Heim", "title": "As the Mac turns 40, a tip of the hat to Mr. Macintosh - TechCrunch", "description": "Steve Jobs once commissioned Belgian artist Jean-Michel Folon to come up with an illustrated character that would \"live\" in every Mac machine and surprise the owner: Mr. Macintosh, aka Mac Man.", "url": "https://techcrunch.com/2024/01/24/apple-mac-man/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/01/Apple-Macintosh-image-credits-ApicGetty-Images.jpg?resize=1200,675", "publishedAt": "2024-01-24T22:03:17Z", "content": "The Apple Macintosh was first released on January 24, 1984 40 years ago today. Wishing the Mac a happy birthday, the Folon Foundation shared a little-known anecdote: That Steve Jobs once commissioned… [+2011 chars]"}]}