{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Astrophysical Study Probes X-Ray Bursts From Low-Mass X-Ray Binaries - SciTechDaily", "description": "An international research team has performed a new measurement of an important astrophysical reaction, 22Mg(a, p)25Al, providing essential experimental data for understanding the light curve of X-ray bursts and the astrophysical environment in low-mass X-ray …", "url": "https://scitechdaily.com/new-astrophysical-study-probes-x-ray-bursts-from-low-mass-x-ray-binaries/", "urlToImage": "https://scitechdaily.com/images/Wind-Emission-Eruption-Black-Hole-X-ray-Binary.jpg", "publishedAt": "2021-12-19T13:38:37Z", "content": "Artistic representation of a neutron star accreting matter from its companion’s envelope. Credit: Gabriel Pérez Díaz, SMM (IAC)\r\nAn international research team has performed a new measurement of an i… [+4192 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Daryl Baxter", "title": "We try gaming in Parallels Desktop again with an M1 Pro MacBook - TechRadar", "description": "Parallels and an M1 Pro sitting in a tree", "url": "https://www.techradar.com/news/we-try-gaming-in-parallels-desktop-again-with-an-m1-pro-macbook", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7Ura8LE9r32nPCJUjDmTN7-1200-80.png", "publishedAt": "2021-12-19T12:00:00Z", "content": "Gaming through virtualization on an Apple Silicon Mac is getting better with every M1 Mac release from the company.\r\nBack in August\r\n, we tested games in Parallels Desktop, a popular virtualization s… [+4949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID Variants Like Omicron and Delta Aren’t the Only Reason NIH Scientists Urge Pursuit of Universal Coronavirus Vaccine - SciTechDaily", "description": "A growing body of scientific evidence, considered together with ecological reality, strongly suggest that novel coronaviruses will continue to infect bats and other animal reservoirs and potentially emerge to pose a pandemic threat to humans. To counter futur…", "url": "https://scitechdaily.com/covid-variants-like-omicron-and-delta-arent-the-only-reason-nih-scientists-urge-pursuit-of-universal-coronavirus-vaccine/", "urlToImage": "https://scitechdaily.com/images/SARS-CoV-2-Virus-Particles-Within-Endosomes-scaled.jpg", "publishedAt": "2021-12-19T11:14:26Z", "content": "Transmission electron micrograph of SARS-CoV-2 virus particles (gold) within endosomes of a heavily infected nasal Olfactory Epithelial Cell. Credit: NIAID\r\nA growing body of scientific evidence, con… [+2930 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jamie Phillips", "title": "Rishi Sunak weighs up VAT cut and cash boost for pubs and restaurants after jetting back to UK - Daily Mail", "description": "The Chancellor is under fire from hospitality firms having only just returned from a 'long planned' trip to California to meet tech bosses, despite the Omicron variant spreading rapidly across the UK.", "url": "https://www.dailymail.co.uk/news/article-10325807/Rishi-Sunak-weighs-VAT-cut-cash-boost-pubs-restaurants-jetting-UK.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/12/19/09/51979539-0-image-a-5_1639905428447.jpg", "publishedAt": "2021-12-19T09:38:53Z", "content": "Rishi Sunak is weighing up a VAT cut and cash boost for ailing pubs and restaurants suffering from the spread of Omicron after jetting back to the UK from a 'long planned' California break.\r\nThe Chan… [+4893 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Instagram Reels: Here is how to record and delete- Step-by-step guide - HT Tech", "description": "Instagram users can create Reels, that is, short, entertaining videos on the application and we show you how to record and delete them.", "url": "https://tech.hindustantimes.com/tech/news/instagram-reels-here-is-how-to-record-and-delete-step-by-step-guide-71639900918599.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/12/19/1600x900/FWTM5XJBSNJ4RLHS433A2ZMPFM_1637322862911_1639900975972.jpg", "publishedAt": "2021-12-19T08:01:58Z", "content": "Instagram Reels was introduced in August, 2020 and most people who have used it are liking this feature. By using Instagram Reels, users can create and discover short, entertaining videos on the appl… [+2484 chars]"}, {"source": {"id": null, "name": "Techgamingreport.com"}, "author": "Ebenezer Robbins", "title": "Take a closer look at the current features of the POCO M3 Pro 5G - Tech Gaming Report", "description": "charging… Poco, it presents useful functions, as in Poco M3 Pro 5G .. PHOTO /...", "url": "https://www.techgamingreport.com/take-a-closer-look-at-the-current-features-of-the-poco-m3-pro-5g/", "urlToImage": null, "publishedAt": "2021-12-18T23:10:30Z", "content": "Poco, it presents useful functions, as in Poco M3 Pro 5G .. PHOTO / ISTJAKARTA – Little bit,It features useful features, just like on the Poco M3 Pro 5G. This more affordable 5G smartphone not only h… [+2900 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Huawei patent for motion planning technology in field of autonomous driving - HC Newsroom", "description": "On December 17, Huawei has published a new patent for motion planning in the field of autonomous driving. As per the China Intellectual Property database, this patent was submitted on May 29, 2020, and is now announced with the number CN1138055724 in China. H…", "url": "https://www.huaweicentral.com/huawei-patent-for-motion-planning-technology-in-field-of-autonomous-driving/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2021/08/Huawei-smart-car-brand-image-1000x576.jpg", "publishedAt": "2021-12-18T09:05:23Z", "content": "On December 17, Huawei has announced a new patent for the ECG detection device with publication number CN113796872A. According to the China Intellectual Property database, this patent was filed on Ju… [+1578 chars]"}, {"source": {"id": null, "name": "Techzimo"}, "author": "Megha Gupta", "title": "Big feature coming for Instagram users, will be able to post 60 second video in Stories - Techzimo", "description": "HIGHLIGHTS : Videos longer than 15 seconds are split into separate stories on Instagram right now With the new update, this problem will be over The new update may be an attempt to beat the competitors like Tiktok. According to Matt Navara, a well-known socia…", "url": "https://www.techzimo.com/big-feature-coming-for-instagram-users-will-be-able-to-post-60-second-video-in-stories/", "urlToImage": "https://www.techzimo.com/wp-content/uploads/2021/07/insta.jpg", "publishedAt": "2021-12-18T08:23:04Z", "content": "HIGHLIGHTS :\r\n<ul><li>Videos longer than 15 seconds are split into separate stories on Instagram right now</li><li>With the new update, this problem will be over</li><li>The new update may be an atte… [+2252 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Joburg and foreign buyers are flocking to these areas in South Africa - BusinessTech", "description": "While 2021 has been a great year for property, the story of the year is the significant uptick in the R20 million-plus sector and sales to foreign buyers which is at the highest level in over three years, says Samuel Seeff, chairman of the Seeff Property Grou…", "url": "https://businesstech.co.za/news/trending/546606/what-to-expect-in-south-africas-housing-market-in-2022/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/Franschoek-e1639474183858.png", "publishedAt": "2021-12-18T06:33:03Z", "content": "While 2021 has been a great year for property, the story of the year is the significant uptick in the R20 million-plus sector and sales to foreign buyers which is at the highest level in over three y… [+5096 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "The Canadian Press", "title": "Experts call for N-95 masks to become the standard to curb Omicron - The Globe and Mail", "description": "Respirators offer far more protection than a surgical mask to both the wearer and others around them, says Virginia Tech engineering professor Linsey Marr", "url": "https://www.theglobeandmail.com/canada/article-experts-call-for-n-95-masks-to-become-the-masking-standard-to-curb/", "urlToImage": "https://www.theglobeandmail.com/resizer/trtJJ2GgeqsGuAmwvYaxGcSnmMs=/1200x800/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/QRRNHIFR7BP47J7RGP222VXO3Q.JPG", "publishedAt": "2021-12-17T20:51:20Z", "content": "Masks that meet the N-95 filtration standard in a storeroom at a hospital in Sarasota, Fla., on March 10, 2020. Experts are calling for respirators, such as N-95s, to become the new masking standard … [+1475 chars]"}]}