{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shocking space! SpaceX Starlink satellites face huge threat up in the sky - HT Tech", "description": "Shocking data has revealed that the SpaceX Starlink satellites were forced to dodge objects as many as 25000 times in six months, highlighting the big problem of crowded lower orbits of Earth.", "url": "https://tech.hindustantimes.com/tech/news/shocking-space-spacex-starlink-satellites-face-huge-threat-up-in-the-sky-71689066144216.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/SpaceX-0_1689066191917_1689066218880.jpg", "publishedAt": "2023-07-11T09:08:29Z", "content": "The low Earth orbit is becoming a dangerous playing field. At present, there are 4,411 SpaceX Starlink satellites that roam there and CEO Elon Musk plans to launch many more of them in the near futur… [+3135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shiny Surprise: Cheops Discovers Scorching Hot Exoplanet Acting Like a Mirror - SciTechDaily", "description": "ESA's Cheops mission has found LTT9779 b, the shiniest known exoplanet with an 80% reflectivity due to its metallic clouds. This ultra-hot Neptune is a unique entity due to its size and unusually close orbit to its star, prompting further studies to understan…", "url": "https://scitechdaily.com/shiny-surprise-cheops-discovers-scorching-hot-exoplanet-acting-like-a-mirror/", "urlToImage": "https://scitechdaily.com/images/Shiny-Exoplanet-in-Space-Concept-Close.jpg", "publishedAt": "2023-07-11T08:21:04Z", "content": "ByEuropean Space Agency (ESA)July 11, 2023\r\nESAs Cheops mission has discovered an ultra-hot exoplanet, LTT9779 b, with an albedo (reflectivity) of 80%, making it the shiniest exoplanet ever found. Th… [+9598 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Clement Tan", "title": "Singapore state investor Temasek posts negative annual return, its first since 2020 - CNBC", "description": "Its global direct investments, particularly in technology, health care and payments, saw \"a reversal of gains\" in the 12 months ending March 31 this year.", "url": "https://www.cnbc.com/2023/07/11/singapore-temasek-2023-report.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107269378-1689060305322-gettyimages-90048570-Hkg2679584.jpeg?v=1689062432&w=1920&h=1080", "publishedAt": "2023-07-11T08:00:32Z", "content": "Singapore's state investment company Temasek recorded in 2023 its worst returns in seven years, weighed by a challenging macroeconomic and geopolitical environment.\r\nTemasek posted a 5.07% decline in… [+3612 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm to strike Earth as huge CME clouds approaching fast; NASA reveals details - HT Tech", "description": "A coronal mass ejection (CME) is headed towards the Earth and can spark a solar storm on July 13, reveals a NASA. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-to-strike-earth-as-huge-cme-clouds-approaching-fast-nasa-reveals-details-71689054846948.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/faintyoung_2_1689054884449_1689054884634.jpg", "publishedAt": "2023-07-11T05:58:09Z", "content": "Last week, panic spread among people as reports of an internet apocalypse' began doing the rounds on social media platforms. The reports suggested that a massive solar storm will strike the Earth in … [+2098 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "150-foot asteroid racing towards Earth at breakneck speed; close approach today - HT Tech", "description": "An aircraft-sized asteroid could come very close to Earth today, NASA has revealed. While this space rock is not a planet killer, it could still cause potential damage if it crashes. Know details.", "url": "https://tech.hindustantimes.com/tech/news/150foot-asteroid-racing-towards-earth-at-breakneck-speed-close-approach-today-71689054344767.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/orbit-viewer-snapshot_1689054573973_1689054583106.jpg", "publishedAt": "2023-07-11T05:51:09Z", "content": "NASA keeps an eye on asteroids, comets, and other Near-Earth Objects (NEOs) for potential close approaches that could threaten Earth. The space agency has issued a warning against an asteroid that wi… [+2008 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Starlink satellites are dodging objects in orbit thousands of times every month - TechCrunch", "description": "Starlink satellites are making thousands of avoidance maneuvers as low Earth orbit becomes more crowded, feeding worries that a catastrophic impact is inevitable. SpaceX’s orbital communication satellites performed maneuvers just over 25,000 times in the six-…", "url": "https://techcrunch.com/2023/07/10/starlink-satellites-are-dodging-objects-in-orbit-thousands-of-times-every-month/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/starlink-trails-iau.jpg?resize=1200,720", "publishedAt": "2023-07-10T20:49:16Z", "content": "Starlink satellites are making thousands of avoidance maneuvers as low Earth orbit becomes more crowded, feeding worries that a catastrophic impact is inevitable.\r\nSpaceX’s orbital communication sate… [+2873 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "A new technique uses remote images to gauge the strength of ancient and active rivers beyond Earth - Phys.org", "description": "Rivers have flowed on two other worlds in the solar system besides Earth: Mars, where dry tracks and craters are all that's left of ancient rivers and lakes, and Titan, Saturn's largest moon, where rivers of liquid methane still flow today.", "url": "https://phys.org/news/2023-07-technique-remote-images-gauge-strength.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/going-with-the-flow.jpg", "publishedAt": "2023-07-10T19:00:02Z", "content": "Rivers have flowed on two other worlds in the solar system besides Earth: Mars, where dry tracks and craters are all that's left of ancient rivers and lakes, and Titan, Saturn's largest moon, where r… [+6833 chars]"}]}