{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Financial Times"}, "author": null, "title": "Apple shares rise as sales fall less than feared despite China decline - Financial Times", "description": "Tech giant announces $110bn in share buybacks and raises quarterly dividend by 4%", "url": "https://www.ft.com/content/935fcc5e-d8e4-4620-927d-ae7e1dfcfda1", "urlToImage": null, "publishedAt": "2024-05-02T21:26:36Z", "content": null}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Paolo Confino", "title": "A 2019 email from Microsoft's CTO to CEO Satya Nadella and Bill Gates shows how spooked the company was by AI rivals Google and OpenAI - Yahoo Finance", "description": "“I was highly dismissive of their efforts. That was a mistake,” Microsoft chief technology officer Kevin Scott said at the time.", "url": "https://finance.yahoo.com/news/2019-email-microsoft-cto-ceo-164033779.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/8vy_hZJJcjPvlL_oQ98sCg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03ODI-/https://media.zenfs.com/en/fortune_175/7d9e40a9a23cd1d2a201b67c5a15467a", "publishedAt": "2024-05-02T16:40:33Z", "content": "In 2019, Microsoft executives at the highest level had an anxious email exchange about AI that would ultimately kick-start its AI investment.\r\nBack then, chief technology officer Kevin Scott sent a f… [+4390 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "Apple adds more carve-outs to its EU core tech fee after criticism from devs - TechCrunch", "description": "Apple is tweaking how it applies a new fee that can affect iOS developers in the European Union as it continues to configure its approach to the bloc's Apple is tweaking how it applies a new fee on iOS developers in the European Union as it continues to confi…", "url": "https://techcrunch.com/2024/05/02/apple-adds-more-carve-outs-to-its-eu-core-tech-fee-after-criticism-from-devs/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/01/app-store-2024-v3.jpg?resize=1200,675", "publishedAt": "2024-05-02T15:00:22Z", "content": "Apple is tweaking how it applies a new fee that can affect iOS developers in the European Union as it continues to configure its approach to the bloc’s Digital Markets Act (DMA): Developers of free a… [+3917 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Technical View: Nifty may consolidate further with support at 22,500, India VIX up 32% in 6 days - Moneycontrol", "description": "The volatility maintained northward journey for sixth consecutive session, which may put the bulls at uncomfortable position. The India VIX, the fear gauge, rallied 4.5 percent to 13.45 levels, taking total six-day gains to 32 percent.", "url": "https://www.moneycontrol.com/news/business/markets/technical-view-nifty-may-consolidate-further-with-support-at-22500-india-vix-up-32-in-6-days-12713245.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/04/sensex_nifty_sensex_market.jpg", "publishedAt": "2024-05-02T11:36:29Z", "content": "The Nifty 50 has seen consolidation throughout session after the US Federal Reserve, as expected, maintained benchmark interest rates at 5.25-5.5 percent, and closed moderately higher on May 2. The c… [+2865 chars]"}]}