{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Magnetic filament eruption on the Sun may spark solar storm tomorrow, says NASA - HT Tech", "description": "A magnetic filament has erupted on an active sunspot, shooting out a CME. While not entirely Earth-directed, NASA models have shown that it is likely to spark a solar storm and deliver a glancing blow to the Earth.", "url": "https://tech.hindustantimes.com/tech/news/magnetic-filament-eruption-on-the-sun-may-spark-solar-storm-tomorrow-says-nasa-71697610104271.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/Solar_storm_1697177201358_1697610177566.jpg", "publishedAt": "2023-10-18T06:27:10Z", "content": "On Monday, October 16, a powerful magnetic filament erupted on the Sun. In particular, the explosion of plasma took place on the active sunspot AR3467, which was earlier reported to have displayed si… [+2205 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "350-Year-Old Theorem Reveals New Properties of Light - SciTechDaily", "description": "Researchers at the Stevens Institute of Technology have applied a 350-year-old theorem, originally used to describe the behavior of pendulums and planets to reveal new properties of light waves. Ever since the 17th-century debates between Isaac Newton and Chr…", "url": "https://scitechdaily.com/?p=318944", "urlToImage": "https://scitechdaily.com/images/Physics-Color-Light-Waves.jpg", "publishedAt": "2023-10-18T06:09:14Z", "content": "Researchers have used a 350-year-old mechanical theorem, typically applied to tangible objects, to uncover new insights about lights nature. By interpreting lights intensity as an equivalent to physi… [+5205 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo group asteroid to come closer than the Moon; Know details of approach - HT Tech", "description": "An Apollo group Near-Earth Asteroid could pass Earth on October 20, NASA has revealed. It will reportedly come closer than the Moon during its approach.", "url": "https://tech.hindustantimes.com/tech/news/apollo-group-asteroid-to-come-closer-than-the-moon-know-details-of-approach-71697608683281.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/asteroid_1681966013956_1697608794485.jpg", "publishedAt": "2023-10-18T06:00:30Z", "content": "NASA has recently issued details about an asteroid designated as Asteroid 2023 TK15 that is expected to make its closest approach to Earth on October 20. This asteroid has been discovered and tracked… [+2175 chars]"}]}