{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Filip Timotija", "title": "NASA chief calls for reported Musk-Putin talks to be investigated - The Hill", "description": "NASA Administrator Bill Nelson called for The Wall Street Journal’s recent report on “secret” conversations between tech billionaire Elon Musk and Russian President Vladimir Putin to be investigated.  Nelson first emphasized that NASA is “non-partisan politic…", "url": "https://thehill.com/policy/defense/4954550-musk-putin-alleged-conversations-nasa/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/08/nasa_kennedy_center_11132008_AP_AP081113013742.jpg?w=1280", "publishedAt": "2024-10-25T23:09:00Z", "content": "Skip to content\r\nNASA Administrator Bill Nelson called for The Wall Street Journal’s recent report on “secret” conversations between tech billionaire Elon Musk and Russian President Vladimir Putin to… [+1854 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Perry Stein, Trisha Thadani, Amy B Wang", "title": "Elon Musk’s pro-Trump PAC awards more $1 million prizes despite DOJ warning - The Washington Post", "description": "The Justice Department had sent a letter to the tech billionaire’s political group warning that its contest awarding voters $1 million for signing a petition could run afoul of election laws.", "url": "https://www.washingtonpost.com/elections/2024/10/25/elon-musk-awards-justice/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M6H2UZ3YA46MQ53TU63YUFYJE4.JPG&w=1440", "publishedAt": "2024-10-25T17:47:11Z", "content": "Tech billionaire Elon Musks pro-Trump political group awarded two additional $1 million prizes to swing-state voters Thursday night, despite warnings from the Justice Department that the daily giveaw… [+264 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Apple adds a menu in iOS 18.2 to change default apps including messages and calls - TechCrunch", "description": "Apple released iOS 18.2 as a developer beta users earlier this week. While there was a bunch of AI goodie shipped with this version — including Gemmoji,", "url": "https://techcrunch.com/2024/10/25/apple-adds-a-menu-in-ios-18-2-to-change-default-apps-including-messages-and-calls/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/alexander-shatov-PEJtZfT6C1Q-unsplash.jpg?resize=1200,900", "publishedAt": "2024-10-25T13:17:21Z", "content": "Apple released iOS 18.2 as a developer beta users earlier this week. While there was a bunch of AI goodie shipped with this version including Gemmoji, Image Playground, and ChatGPT integration the co… [+1530 chars]"}]}