{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Janko Roettgers", "title": "Casting is dead. Long live casting! - The Verge", "description": "Netflix laid the groundwork for casting. Now, it’s pulled the plug on the technology. Is there still life left in second-screen playback control?", "url": "https://www.theverge.com/column/861948/casting-netflix-dead", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/23923974/acastro_STK072_04.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "publishedAt": "2026-01-16T04:30:00Z", "content": "<ul><li></li><li></li><li></li></ul>\r\nFifteen years after laying the groundwork for casting, Netflix has pulled the plug on the technology, but theres still life left in second-screen playback contro… [+7451 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Jennifer A Dlouhy, Naureen S Malik", "title": "Trump to Direct Key US Grid Operator to Hold Emergency Auction - Bloomberg.com", "description": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new power plants.", "url": "https://www.bloomberg.com/news/articles/2026-01-15/trump-to-direct-key-us-grid-operator-to-hold-emergency-auction", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/irwttyF9qDTk/v1/1200x800.jpg", "publishedAt": "2026-01-16T00:10:00Z", "content": "President Donald Trump and the governors of several US Northeastern states agreed to push for an emergency wholesale electricity auction that would compel technology companies to effectively fund new… [+299 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Drug ring's \"monkey\" technique used young swimmers to stash cocaine on ships at sea, Spanish police say - CBS News", "description": "Police said they had busted a network that saw smugglers swim on the high seas to help stash Colombian cocaine on container ships and hijack vessels.", "url": "https://www.cbsnews.com/news/drug-ring-monkey-technique-swimmers-stash-cocaine-ships-spain-police/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2026/01/15/39f2822a-02b8-4baf-99e6-65608ffc1eec/thumbnail/1200x630/aa7c57873b3a46c56f9ca5f7c0f3a89f/spain-screenshot-2026-01-15-135129.png", "publishedAt": "2026-01-15T19:11:00Z", "content": "Spanish police on Thursday said they had busted a network that saw smugglers swim on the high seas to help stash Colombian cocaine on Europe-bound container ships and hijack vessels. The bust was rev… [+2721 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "University of Colorado at Boulder", "title": "An earthquake on a chip: New tech could make smartphones smaller, faster - Tech Xplore", "description": "A team of engineers has made major strides in generating the tiniest earthquakes imaginable. The team's device, known as a surface acoustic wave phonon laser, could one day help scientists make more sophisticated versions of chips in cellphones and other wire…", "url": "https://techxplore.com/news/2026-01-earthquake-chip-tech-smartphones-smaller.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2026/an-earthquake-on-a-chi.jpg", "publishedAt": "2026-01-14T16:00:14Z", "content": "A team of engineers has made major strides in generating the tiniest earthquakes imaginable. The team's device, known as a surface acoustic wave phonon laser, could one day help scientists make more … [+6279 chars]"}]}