{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Akash Podishetti", "title": "LIC increases stake in this Nifty bluechip stock through open market - Economic Times", "description": "Life Insurance Corp (LIC) has raised its stake in Indian IT services firm Tech Mahindra to 8.8% from 6.8%, having added 1.96 crore shares through open market transactions. LIC saw its income from investments increase slightly to INR67,846 crore ($10.5bn) for …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/lic-increases-stake-in-this-nifty-bluechip-stock-through-open-market/articleshow/100827245.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100827376,width-1070,height-580,imgsize-61496,overlay-etmarkets/photo.jpg", "publishedAt": "2023-06-07T14:32:00Z", "content": "Life Insurance Corp (LIC), one of the biggest domestic institutional investors in India, has increased stake in IT services company Tech Mahindra.The state-owned insurer has freshly added 1.96 crore … [+1914 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Paul Tassi", "title": "What Apple, Meta And Sony Don’t Get About AR And VR - Forbes", "description": "Sometimes chasing science fiction tech ignores the reality of whether people actually want it.", "url": "https://www.forbes.com/sites/paultassi/2023/06/07/what-apple-meta-and-sony-dont-get-about-ar-and-vr/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64809201771cb9d6c4d235e2/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-06-07T14:27:41Z", "content": "CUPERTINO, CALIFORNIA - JUNE 05: The new Apple Vision Pro headset is displayed during the Apple ... [+] Worldwide Developers Conference on June 05, 2023 in Cupertino, California. Apple CEO Tim Cook k… [+5245 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Psyche Asteroid Mission Back on Stellar Track – Extraordinary Turnaround Wows Review Board - SciTechDaily", "description": "Review Board: NASA-JPL Psyche Progress Outstanding, Launch on Track An independent review board praised the \"world-class\" efforts of NASA's Jet Propulsion Laboratory and Caltech in addressing issues that caused a delay in the Psyche mission's launch, original…", "url": "https://scitechdaily.com/?p=284390", "urlToImage": "https://scitechdaily.com/images/NASA-Psyche-Asteroid-Mission.gif", "publishedAt": "2023-06-07T12:46:04Z", "content": "ByNASAJune 7, 2023\r\nAn independent review board has given a positive assessment of NASAs Jet Propulsion Laboratory (JPL) and Caltechs efforts to put the Psyche mission back on track for a launch in O… [+7791 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Demonstrates Superior Performance in Predicting Breast Cancer - SciTechDaily", "description": "AI algorithms outperformed traditional clinical risk models in a large-scale study, predicting five-year breast cancer risk more accurately. These models use mammograms as the single data source, offering potential advantages in individualizing patient care a…", "url": "https://scitechdaily.com/ai-demonstrates-superior-performance-in-predicting-breast-cancer/", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-AI-Success-Art.jpg", "publishedAt": "2023-06-07T08:22:40Z", "content": "In a comprehensive study published in the journal Radiology, artificial intelligence (AI) algorithms demonstrated superior performance to the standard clinical risk model in predicting the five-year … [+6132 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "We asked AI chatbot Google Bard about the next big solar storm; The answer was TERRIFYING - HT Tech", "description": "We asked Google Bard, the AI chatbot, about the possibility of a major solar storm in 2023. The answer was quite terrifying. Find out what it revealed.", "url": "https://tech.hindustantimes.com/tech/news/we-asked-ai-chatbot-google-bard-about-the-next-big-solar-storm-the-answer-was-terrifying-71686111925622.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/07/1600x900/NOAA_1632590234307_1686111980087.JPG", "publishedAt": "2023-06-07T04:28:45Z", "content": "The Earth continues to wait for the big cloud of coronal mass ejections (CME) that is expected to hit between June 7-8 and spark a minor solar storm. In the last couple of weeks, our planet has witne… [+2602 chars]"}]}