{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Happy Valentines Day gifts for husband: 5 tech gift ideas to make his day special - HT Tech", "description": "Happy Valentine's Day gifts for husband: Make your partner's day special by gifting him tech gadgets that he can play with or use. Check out GoPro, Samsung Galaxy Watch 3, and more.", "url": "https://tech.hindustantimes.com/tech/news/happy-valentines-day-gifts-for-husband-5-tech-gift-ideas-to-make-his-day-special-71644805653880.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/14/1600x900/gift-box-635778_960_720_1644805676413_1644805699809.jpg", "publishedAt": "2022-02-14T02:31:58Z", "content": "Happy Valentine's Day gifts for husband: Valentine's Day 2022, the day of love is here and couples are already celebrating. The day is all about making each other feel special and important. From flo… [+2598 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Zainab Iwayemi", "title": "How to apply for NAICOM’s BimaLab insurtech innovative solution program - Nairametrics", "description": "The National Insurance Commission of Nigeria (NAICOM), recently partnered with FSD Africa, to launch BimaLab insurtech program in Nigeria and", "url": "https://nairametrics.com/2022/02/13/insurance-industry-needs-insurtech-solutions-here-is-how-to-apply-for-bimalab-nigeria-insurtech-innovative-solution/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/01/Insurance-.jpg", "publishedAt": "2022-02-13T20:30:54Z", "content": "The National Insurance Commission of Nigeria (NAICOM), recently partnered with FSD Africa, to launch BimaLab insurtech program in Nigeria and provide opportunities to actualise ideation on how to imp… [+3453 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moderate Calorie Restriction Rewires Metabolism, Immunity for Longer Health Span - SciTechDaily", "description": "Calorie restriction improves metabolic and immune responses that help determine both how long a person lives and how many years of good health they enjoy, a new study shows. “Two years of modest calorie restriction reprogrammed the pathways in fat cells that …", "url": "https://scitechdaily.com/moderate-calorie-restriction-rewires-metabolism-immunity-for-longer-health-span/", "urlToImage": "https://scitechdaily.com/images/Calorie-Restriction-Weight-Loss-Diet-Plan.jpg", "publishedAt": "2022-02-13T20:13:04Z", "content": "Calorie restriction improves metabolic and immune responses that help determine both how long a person lives and how many years of good health they enjoy, a new study shows.\r\n“Two years of modest cal… [+4144 chars]"}, {"source": {"id": null, "name": "Nintendoeverything.com"}, "author": "Brian", "title": "Nintendo says component shortages involving Switch starting to impact its gross profit - Nintendo Everything", "description": "It’s no secret that there have been component shortages for all sorts of technology, including Switch. Nintendo president Shuntaro Furukawa has now said that the situation is starting to impact the company’s gross profit due to increased costs. During Nintend…", "url": "https://nintendoeverything.com/nintendo-says-component-shortages-involving-switch-starting-to-impact-its-gross-profit/", "urlToImage": "https://nintendoeverything.com/wp-content/uploads/swi-1.jpg", "publishedAt": "2022-02-13T16:02:44Z", "content": "It’s no secret that there have been component shortages for all sorts of technology, including Switch. Nintendo president Shuntaro Furukawa has now said that the situation is starting to impact the c… [+2898 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Woman raises Apple Watch WARNING! Do this, or you will be seriously ill - HT Tech", "description": "An Australian woman has shared how her Apple Watch detected a serious illness, but she failed to do something and it could have caused her death.", "url": "https://tech.hindustantimes.com/how-to/woman-raises-apple-watch-warning-do-this-or-you-will-be-seriously-ill-71644764634131.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/13/1600x900/2021-05-26T181352Z_1_LYNXNPEH4P1DU_RTROPTP_3_APPLE-ALIVECOR_1623736795599_1644764988246.JPG", "publishedAt": "2022-02-13T15:10:07Z", "content": "Apple Watch saves lives. Yes, it does. However, 21 year old Lauren from Sydney, Australia has an Apple Watch warning to share with you. Lauren says her Apple Watch noticed a critical fall in her heal… [+2497 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "These South Africans are not going back to the office full-time: FNB - BusinessTech", "description": "Barring the emergence of some far more lethal strain of Covid-19, it would appear that South Africa, and the rest of the world, are set to get back to far more ‘normal’ economic life, relatively unrestricted by lockdown regulations.", "url": "https://businesstech.co.za/news/business/557540/these-south-africans-are-not-going-back-to-the-office-full-time-fnb/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/OfficeWork-e1634824350842.jpeg", "publishedAt": "2022-02-13T11:00:56Z", "content": "Barring the emergence of some far more lethal strain of Covid-19, it would appear that South Africa, and the rest of the world, are set to get back to far more ‘normal’ economic life, relatively unre… [+3588 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Common Over-the-Counter Medication May Provide Relief for People With Long COVID-19 Symptoms - SciTechDaily", "description": "Widely available, over-the-counter antihistamines have the potential to restore daily function. Antihistamines may provide relief for the millions of people suffering from the painful, debilitating symptoms of long COVID-19 that impair daily functioning. That…", "url": "https://scitechdaily.com/common-over-the-counter-medication-may-provide-relief-for-people-with-long-covid-19-symptoms/", "urlToImage": "https://scitechdaily.com/images/White-Pills-and-Water-Glass.jpg", "publishedAt": "2022-02-12T15:29:53Z", "content": "Widely available, over-the-counter antihistamines have the potential to restore daily function.\r\nAntihistamines may provide relief for the millions of people suffering from the painful, debilitating … [+5064 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "IBM emails show millennial workers favoured over ‘dinobabies’ - BusinessTech", "description": "IBM executives discussed in emails how to force out older workers and derided them as “dinobabies” who should be made an “extinct species,” according to a court filing in an age discrimination case against the company.", "url": "https://businesstech.co.za/news/business/557732/ibm-emails-show-millennial-workers-favoured-over-dinobabies/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/IBM-e1644658636803.jpg", "publishedAt": "2022-02-12T09:39:11Z", "content": "IBM executives discussed in emails how to force out older workers and derided them as dinobabies who should be made an extinct species, according to a court filing in an age discrimination case again… [+2445 chars]"}]}