{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 2 May 2023: Flat Martian rocks shot by Curiosity Rover - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Flat rock hills on the surface of Mars, captured by the Curiosity Rover.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-2-may-2023-flat-martian-rocks-shot-by-curiosity-rover-71683010410398.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/mars_1683010589607_1683010598261.jpg", "publishedAt": "2023-05-02T06:57:41Z", "content": "Mars, popularly known as the Red Planet, has captured the attention of astronomers, scientists and sci-fi geeks for decades. This is mainly due to its fascinating geographical features such as myster… [+1906 chars]"}, {"source": {"id": null, "name": "Adda247.com"}, "author": "piyush", "title": "IIT Madras researchers develop machine learning tool to detect tumour in brain, spinal cord - Adda247", "description": "IIT-Madras Researchers Develop Computational Tool to Detect Cancer-Causing Tumours in the Brain and Spinal Cord: Researchers at the Indian Institute of Technology Madras have developed a machine learning-based computational tool called GBMDriver to improve th…", "url": "https://currentaffairs.adda247.com/iit-madras-researchers-develop-machine-learning-tool-to-detect-tumour-in-brain-spinal-cord/", "urlToImage": "https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/05/02115517/IIT-Madras-researchers-1-e1682924113277.jpg", "publishedAt": "2023-05-02T06:34:49Z", "content": "Researchers at the Indian Institute of Technology Madras have developed a machine learning-based computational tool called GBMDriver to improve the detection of cancer-causing tumours in the brain an… [+1798 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Webb finds water vapor around a rocky exoplanet - Tech Explorist", "description": "Water vapor in an atmosphere on a hot rocky planet would represent a major breakthrough for exoplanet science.", "url": "https://www.techexplorist.com/webb-finds-water-vapor-around-a-rocky-exoplanet/59715/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/GJ-486-b.jpg", "publishedAt": "2023-05-02T06:25:44Z", "content": "While studying a rocky exoplanet known as GJ 486 b, NASA‘s James Webb Space Telescope- using its Webb’s Near-Infrared Spectrograph (NIRSpec)- detected signals of water vapor. GJ 486 b is too close to… [+4179 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Godfather Of AI' Quits Google To Warn Of The Tech's Dangers - NDTV", "description": "A computer scientist often dubbed \"the godfather of artificial intelligence\" has quit his job at Google to speak out about the dangers of the technology, US media reported Monday.", "url": "https://www.ndtv.com/world-news/godfather-of-ai-quits-google-to-warn-of-the-techs-dangers-3997117", "urlToImage": "https://c.ndtvimg.com/2023-05/tuehc2fo_geoffrey-hinton_625x300_02_May_23.jpg", "publishedAt": "2023-05-02T05:56:38Z", "content": "Mr Hinton said the average person will not be able to know what is true anymore. (File)\r\nWashington, United States: A computer scientist often dubbed \"the godfather of artificial intelligence\" has qu… [+2585 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid 2023 HV5 to come as close to Earth as the Moon! NASA issues alert - HT Tech", "description": "The asteroid will approach Earth for its closest approach tomorrow, May 3. Know all details such as speed, distance and more, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2023-hv5-to-come-as-close-to-earth-as-the-moon-nasa-issues-alert-71683002033980.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid_1683002420925_1683002421133.jpg", "publishedAt": "2023-05-02T04:40:53Z", "content": "Whenever an asteroid's orbit brings it near a planet, the planet's gravitational pull can sometimes force it to go astray. When these space rocks come near Earth for close approach, most of them burn… [+1909 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm DANGER! Intense solar flare explosion sparks blackouts on Earth, NASA says - HT Tech", "description": "In the evening hours of May 1, NASA recorded a solar flare eruption on the Sun. The explosion occurred on the unstable sunspot AR3288. Is a solar storm on its way to the Earth now?", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-danger-intense-solar-flare-explosion-sparks-blackouts-on-earth-nasa-says-71682998801145.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/25937026477_4b7949e87d_o_1660042849056_1682999001988.jpg", "publishedAt": "2023-05-02T03:46:48Z", "content": "On April 30, the forecasters from the National Oceanic and Atmospheric Administration (NOAA) warned about a sunspot, named AR3288, which was growing at an exponential rate and contained unstable delt… [+2371 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How A.I. is making brain cancer diagnosis faster than before - NBC News", "description": "New A.I. technology can find biomarkers of a cancerous tumor in just three minutes compared to three weeks with normal technology.» Subscribe to NBC News: ht...", "url": "https://www.youtube.com/watch?v=Bcgms_xkpSg", "urlToImage": "https://i.ytimg.com/vi/Bcgms_xkpSg/maxresdefault.jpg", "publishedAt": "2023-05-02T03:30:02Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Not Science Fiction: Brain Activity Decoder Transforms Thoughts Into Text - SciTechDaily", "description": "A semantic decoder that turns brain activity into text has been developed by researchers at The University of Texas at Austin. This AI system, which is non-invasive and does not require surgical implants, could provide a new means of communication for individ…", "url": "https://scitechdaily.com/not-science-fiction-brain-activity-decoder-transforms-thoughts-into-text/", "urlToImage": "https://scitechdaily.com/images/Cybermind-AI-Brain-Technology-Illustration.jpg", "publishedAt": "2023-05-02T02:40:36Z", "content": "ByUniversity of Texas at AustinMay 1, 2023\r\nResearchers at The University of Texas at Austin have developed a semantic decoder that converts brain activity into a continuous text stream, according to… [+8049 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in news: Kotak Bank, Ultratech Cement, Varun Beverages, Tata Steel, Ambuja Cements, Bank of Barod - Economic Times", "description": "UltraTech Cement's consolidated net profit fell 36% to Rs 1,666 crore for the fourth quarter ended March. Revenue from operations during the fourth quarter rose 18% to Rs 18,562 crore.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-news-kotak-bank-ultratech-cement-varun-beverages-tata-steel-ambuja-cements-bank-of-baroda-ndtv/articleshow/99920092.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99920111,width-1070,height-580,imgsize-41512,overlay-etmarkets/photo.jpg", "publishedAt": "2023-05-02T02:03:00Z", "content": "Nifty futures on the Singapore Exchange traded lower by 40 points or 0.22% at 18,233, signalling a negative start for Dalal Street on Tuesday. Here are the top stocks that are likely to be in focus t… [+3668 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iOS 17 to bring BIG CHANGES to your iPhone; Apps to wallpapers, take a sneak peek - HT Tech", "description": "iOS 17 is expected to bring big changes to Apple' apps and wallpapers along with other updates. Check what the latest leak reveals.", "url": "https://tech.hindustantimes.com/mobile/news/ios-17-to-bring-big-changes-to-your-iphone-apps-to-wallpapers-take-a-sneak-peek-71682988957438.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/Unsplash_iOS_16_1677505760398_1682989006984.jpg", "publishedAt": "2023-05-02T01:03:23Z", "content": "Apple Worldwide Developers Conference (WWDC) 2023 is all set to start on June 5 and the company is expected to announce the iOS 17 at the event. As per the latest leaks, iOS 17, which will be the lat… [+2567 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Theory to Reality: A Groundbreaking Manifestation of Interdependent Networks in a Physics Lab - SciTechDaily", "description": "New findings enable experimental studies to control and further develop the multiscale phenomena of complex interdependent materials. Bar-Ilan University researchers Havlin and Frydman have demonstrated the \"network of networks\" theory using a controlled syst…", "url": "https://scitechdaily.com/from-theory-to-reality-a-groundbreaking-manifestation-of-interdependent-networks-in-a-physics-lab/", "urlToImage": "https://scitechdaily.com/images/Interdependent-Superconducting-Networks-scaled.jpg", "publishedAt": "2023-05-01T15:00:17Z", "content": "ByBar-Ilan UniversityMay 1, 2023\r\nTwo network layers, characterized by intra-network connectivity interactions (electric conductivity), are interdependent via dependency interactions (thermal heating… [+3956 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 1 May 2023: The Great Carina Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is NGC 3372, also known as the Great Carina Nebula which is located in the constellation of Carina.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-1-may-2023-the-great-carina-nebula-71682931600468.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/carina_nebula_1682931649743_1682931649948.jpg", "publishedAt": "2023-05-01T09:02:52Z", "content": "A Nebula can contain as few as ten stars or as many as millions of stars, according to NASA. Although most nebulae belong to just three types - spherical, elliptical and bipolar, some of them might b… [+1811 chars]"}]}