{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar flare erupts on Sun, detects NASA; blackouts over Australia, Solar storm likely - HT Tech", "description": "A solar flare erupted on the Sun and sparked radio blackouts over the region of Australia and New Zealand. It also raised fears of a solar storm. NASA’s Solar Dynamics Observatory has taken images of this chaotic event.", "url": "https://tech.hindustantimes.com/tech/news/solar-flare-erupts-on-sun-detects-nasa-blackouts-over-australia-solar-storm-likely-71696916113211.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/10/1600x900/m73-flare-rotated_0_1680256680821_1696916153472.jpeg", "publishedAt": "2023-10-10T05:48:06Z", "content": "Despite multiple close calls, we have been quite lucky when it comes to solar storms. Even as multiple solar flares have erupted over the last 10 days, only one released a coronal mass ejection (CME)… [+2413 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Dark Side of Weight Loss Drugs: Startling New Risks Revealed - SciTechDaily", "description": "They’re being hailed as an effective way to lose weight, but diabetes drugs like Ozempic may come with a heightened risk of severe gastrointestinal problems. That’s according to new research from the University of British Columbia showing that medications kno…", "url": "https://scitechdaily.com/the-dark-side-of-weight-loss-drugs-startling-new-risks-revealed/", "urlToImage": "https://scitechdaily.com/images/Weight-Loss-Drugs-Scale.jpg", "publishedAt": "2023-10-09T20:12:52Z", "content": "Recent research from the University of British Columbia has found that GLP-1 agonists, a type of diabetes medication used off-label for weight loss, carry heightened risks of severe gastrointestinal … [+5466 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Vela pulsar emits the most energetic gamma ray beams ever discovered - TechSpot", "description": "An international team of scientists working with the High Energy Stereoscopic System (H.E.S.S.) telescopes has made a groundbreaking discovery: pulsars can be even more energetic than previously...", "url": "https://www.techspot.com/news/100427-vela-pulsar-emits-most-energetic-gamma-ray-beams.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/10/2023-10-09-image-11.jpg", "publishedAt": "2023-10-09T16:33:24Z", "content": "In context: Pulsars are rotating neutron stars formed from the remnants of supergiant stars that have undergone supernova explosions. These celestial objects emit beams of highly energetic electromag… [+2724 chars]"}, {"source": {"id": null, "name": "ksltv.com"}, "author": ", Ken Fall", "title": "Technology advances in breast cancer screenings lead to early diagnosis - KSL.com", "description": "Intermountain Health offers mammograms each Saturday in October to be available to women on the weekends and to get ahead of cancer diagnoses.", "url": "https://ksltv.com/592000/technology-advances-in-breast-cancer-screenings-lead-to-early-diagnosis/", "urlToImage": "https://ksltv.com/wp-content/uploads/2023/10/Linda-entering-MRI-room.jpg", "publishedAt": "2023-10-09T14:20:36Z", "content": "MURRAY I never thought it would be me. It was kind of ironic and surreal, recalls Intermountain Health manager Linda Campbell.\r\nThe surreal turned to serendipity when Campbells breast abnormality was… [+2830 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tracing Footprints: Humans Got to America 7,000 Years Earlier Than Thought - SciTechDaily", "description": "New research, supported by advanced dating techniques, suggests that humans settled in the Americas around 23,000 years ago, challenging earlier beliefs of a 14,000-year timeline. When and how humans first settled in the Americas is a subject of considerable …", "url": "https://scitechdaily.com/tracing-footprints-humans-got-to-america-7000-years-earlier-than-thought/", "urlToImage": "https://scitechdaily.com/images/White-Sands-National-Park-Fossilized-Footprints.jpg", "publishedAt": "2023-10-09T10:33:03Z", "content": "The footprints come from a group of people of different ages. Credit: National Park Service\r\nNew research, supported by advanced dating techniques, suggests that humans settled in the Americas around… [+6325 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission in spotlight after ISRO logs massive success with Chandrayaan-3 mission - HT Tech", "description": "Chandrayaan-4 mission has grabbed the spotlight as ISRO winds down the Chandrayaan-3 mission again. ISRO is preparing for the LUPEX mission in collaboration with JAXA.", "url": "https://tech.hindustantimes.com/photos/chandrayaan4-mission-in-spotlight-after-isro-logs-massive-success-with-chandrayaan-3-mission-71696828326646.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/09/1600x900/Pragyan_Rover_1695307024483_1696828373126.jpg", "publishedAt": "2023-10-09T05:16:12Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}]}