{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Pigmented Rice Enhancements Could Help To Combat Malnutrition - Technology Networks", "description": "Scientists have shown that desirable agronomic traits of shorter stem length and early maturity can be introduced into black rice, which is known to be more nutritious than white rice.", "url": "https://www.technologynetworks.com/applied-sciences/news/pigmented-rice-enhancements-could-help-to-combat-malnutrition-374284", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374284/pigmented-rice-enhancements-could-help-to-combat-malnutrition-374284-640x360.jpg?cb=20230606", "publishedAt": "2023-06-06T08:20:49Z", "content": "Pigmented rice is known to be much more nutritious than white rice and could be an important resource to improve human health and combat malnutrition. However, improved yield and agronomic traits are… [+3395 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Kakoli Mukherjee", "title": "After Hyderabad’s Success, Telangana is Now Scripting New IT Story in Its Tier-2 Cities - News18", "description": "Telangana IT minister KT Rama Rao said the government will set up IT Towers in Warangal, Khammam, Karimnagar and Mahabubnagar… Warangal, which is 146 km away from Hyderabad, was chosen to be developed as the second hi-tech hub after the capital city", "url": "https://www.news18.com/india/after-hyderabads-success-telangana-is-now-scripting-new-it-story-in-its-tier-2-cities-8009773.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/06/kt-rama-rao-168602708316x9.jpg", "publishedAt": "2023-06-06T04:53:29Z", "content": "The IT success story in Telangana is not only about its capital, Hyderabad, but also about its Tier-2 cities. State IT minister KT Rama Rao, on the sidelines of releasing the annual IT progress repor… [+2593 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Potentially Hazardous 1500-foot asteroid hurtling towards Earth at fearsome pace! - HT Tech", "description": "NASA has issued an alert that a bridge-sized asteroid is on course to approach Earth soon! Check out its speed, distance, and other details, as revealed by the space agency.", "url": "https://tech.hindustantimes.com/tech/news/potentially-hazardous-1500-foot-asteroid-hurtling-towards-earth-at-fearsome-pace-71686026534327.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/06/1600x900/space-1728186_640_1685508037976_1686026611347.jpg", "publishedAt": "2023-06-06T04:43:56Z", "content": "NASA uses telescopes, such as Pans-STARRS1 in Maui, Hawaii, and Catalina Sky Survey near Tucson, Arizona, to detect near-Earth objects like asteroids and comets. To collect accurate information about… [+2154 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Vikas Yadav", "title": "WWDC 2023: Apple Shows The World 'Most Powerful Macs Ever Made'; Check Specs, Price In India - Jagran English", "description": "Apple WWDC 2023 Among a bunch of products the Cupertino-based tech giant announced today include Mac Studio and Mac Pro which Apple claims are the most powerful Macs to date", "url": "https://english.jagran.com/technology/wwdc-2023-apple-mac-studio-price-in-india-mac-pro-m2-max-ultra-most-powerful-macs-ever-made-specifications-10081294", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/apple-mac-studio-mac-pro1686003519331.jpg", "publishedAt": "2023-06-05T22:02:00Z", "content": "WWDC 2023: Among a bunch of products the Cupertino-based tech giant announced today include Mac Studio and Mac Pro, which Apple claims are the \"most powerful Macs\" to date. The new Mac Studio comes i… [+1861 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Defying the Aging Process: Groundbreaking Research Reveals That Our Muscles Reverse to an “Early-Life” State - SciTechDaily", "description": "New groundbreaking research on African killifish demonstrates that during the late stages of life, our muscles exhibit a remarkable reversal to an \"early-life\" state, providing valuable insights into combatting muscle wasting. As we get older, our muscles beg…", "url": "https://scitechdaily.com/?p=279679", "urlToImage": "https://scitechdaily.com/images/Glowing-Muscles.jpg", "publishedAt": "2023-06-05T20:25:48Z", "content": "ByMonash UniversityJune 5, 2023\r\nResearchers from the Australian Regenerative Medicine Institute at Monash University have discovered that as organisms, including humans, age, their muscles revert to… [+7090 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Review Board: NASA-JPL Psyche Progress Outstanding, Launch on Track - NASA", "description": "Steps taken by NASA, the agency’s Jet Propulsion Laboratory (JPL) in Southern California, and Caltech, to put the Psyche mission on track for an October 2023 launch have been outstanding, according to an independently appointed review board. NASA and JPL conv…", "url": "https://www.nasa.gov/press-release/review-board-nasa-jpl-psyche-progress-outstanding-launch-on-track", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/52561820396_8d2dbe4d59_o.jpg", "publishedAt": "2023-06-05T20:15:47Z", "content": null}, {"source": {"id": null, "name": "ThePrint"}, "author": "Snehesh Alex Philip", "title": "Rajnath-Austin meet sets stage for mega jet engine deal when Modi visits US. Focus now on emerging tech - ThePrint", "description": "India and US to initiate negotiations on 'Security of Supply Arrangement and a Reciprocal Defence Procurement Agreement' to promote long-term supply chain stability.", "url": "https://theprint.in/defence/rajnath-austin-meet-sets-stage-for-mega-jet-engine-deal-when-modi-visits-us-focus-now-on-emerging-tech/1612729/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/06/Rajnath-Singh-Llyod-Austin.jpg", "publishedAt": "2023-06-05T11:52:23Z", "content": "New Delhi: After finalising a mega jet engine deal for Prime Minister Narendra Modi’s US visit later this month, both countries are working on a security supply and reciprocal agreement, and focusing… [+4077 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The 'breath' between atoms is a key building block for quantum technology - Tech Explorist", "description": "Vibration between two layers of atoms can be used to engineer quantum technologies.", "url": "https://www.techexplorist.com/breath-atoms-key-building-block-quantum-technology/61356/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Onpage-quantum-emitters-illustration.jpg", "publishedAt": "2023-06-05T10:33:05Z", "content": "A team led by UW ECE and Physics Professor Mo Li discovered a technique to use the “breathing” between two layers of atoms, creating a new building block for quantum technologies. \r\nBreathing is a pr… [+6056 chars]"}, {"source": {"id": null, "name": "Inverse"}, "author": "Evan Gough, Universe Today", "title": "This Underground Lab Is Preparing For Human Mars Missions We Might Actually Survive - Inverse", "description": "An underground lab is testing 3D printing and other futuristic tech for medical care on future Mars missions.", "url": "https://www.inverse.com/science/mars-missions-medical-experiments", "urlToImage": "https://imgix.bustle.com/uploads/getty/2023/5/31/738b6b40-cd33-4fe1-a178-533c0f3672c0-getty-1124672067.jpg?w=1200&h=630&fit=crop&crop=faces&fm=jpg", "publishedAt": "2023-06-04T10:00:25Z", "content": "In the early days of spaceflight, just getting a satellite into Earths orbit was an accomplishment. In our era, landing rovers on other planets and bringing samples home from asteroids is the cutting… [+10726 chars]"}]}