{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "CT Scans Projected to Result in 100,000 New Cancers in The US - ScienceAlert", "description": "More Americans are receiving computed tomography (CT) scans than ever before, and while this technology can save lives, some scientists are concerned about the potential for low doses of ionizing radiation to increase cancer risks.", "url": "https://www.sciencealert.com/ct-scans-projected-to-result-in-100000-new-cancers-in-the-us", "urlToImage": "https://www.sciencealert.com/images/2025/04/CTScan.jpg", "publishedAt": "2025-04-14T15:01:39Z", "content": "More Americans are receiving computed tomography (CT) scans than ever before, and while this technology can save lives, some scientists are concerned about the potential for low doses of ionizing rad… [+4728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "Technology use may be associated with a lower risk for dementia, study finds - CNN", "description": "Using technology may be linked with a lower risk of developing cognitive decline later in life, a new study has found.", "url": "https://www.cnn.com/2025/04/14/health/technology-use-lowers-dementia-risk-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1254621518.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-14T15:00:00Z", "content": "Get inspired by a weekly roundup on living well, made simple. Sign up for CNNs Life, But Better newsletter for information and tools designed to improve your well-being.\r\nWith the first generation of… [+6803 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sleeping Black Hole Erupts in Real Time – Blasting Out Record-Breaking X-Rays - SciTechDaily", "description": "A mysterious black hole in a distant galaxy just woke up after decades of silence—and it’s putting on a cosmic light show! ESA’s XMM-Newton and other X-ray telescopes are capturing massive bursts of energy known as quasiperiodic eruptions (QPEs) that defy cur…", "url": "https://scitechdaily.com/?p=469487", "urlToImage": "https://scitechdaily.com/images/Giant-Black-Hole-Awakens-With-Repetitive-X-Ray-Bursts-scaled.jpg", "publishedAt": "2025-04-14T08:23:28Z", "content": "This artist’s impression illustrates the mechanism that could be at the origin of the powerful bursts of X-ray light seen from a newly awakened black hole named Ansky. Credit: ESA\r\nA mysterious black… [+7486 chars]"}]}