{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "160-foot asteroid approaching Earth at fiery speed for a close approach, NASA data reveals - HT Tech", "description": "A huge asteroid could pass Earth at a very close distance and NASA has revealed information such as its speed, size, and more. Check details.", "url": "https://tech.hindustantimes.com/tech/news/160foot-asteroid-approaching-earth-at-fiery-speed-for-a-close-approach-nasa-data-reveals-71686198785604.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/08/1600x900/orbit-viewer-snapshot_1686198865955_1686198870089.jpg", "publishedAt": "2023-06-08T04:38:39Z", "content": "The three primary classifications of asteroids are C-type, S-type, and M-type. C-type asteroids, which are composed primarily of carbon-rich substances, are the most frequent, while S-type asteroids,… [+2028 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Unstable sunspot explodes, sparks BLACKOUTS on Earth; Solar storm in the offing? - HT Tech", "description": "An unstable sunspot, AR3327, has exploded producing a solar flare that triggered radio blackouts over Africa. More solar flares are expected to erupt in the days to come. Will a major solar storm hit the Earth soon?", "url": "https://tech.hindustantimes.com/tech/news/unstable-sunspot-explodes-sparks-blackouts-on-earth-solar-storm-in-the-offing-71686197049683.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/08/1600x900/sun-2224937_1280_1677654423439_1686197093584.jpg", "publishedAt": "2023-06-08T04:08:29Z", "content": "The National Oceanic and Atmospheric Administration (NOAA) reported on Monday that the high number of sunspots on the Earth-facing side of the Sun can become a concern as some of them could go unstab… [+2741 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "AI system devises first optimizations to sorting code in over a decade - Ars Technica", "description": "Writing efficient code was turned into a game, and the AI played to win.", "url": "https://arstechnica.com/science/2023/06/googles-deepmind-develops-a-system-that-writes-efficient-algorithms/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1403644222-760x380.jpg", "publishedAt": "2023-06-07T21:44:22Z", "content": "59 with \r\nAnyone who has taken a basic computer science class has undoubtedly spent time devising a sorting algorithmcode that will take an unordered list of items and put them in ascending or descen… [+3869 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Ruairi J Mackenzie", "title": "Coos and Snooze: Scientists Decode Pigeons' Dreams - Technology Networks", "description": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a technique called functional magnetic resonance imaging (fMRI) to…", "url": "https://www.technologynetworks.com/neuroscience/news/coos-and-snooze-scientists-decode-pigeons-dreams-374412", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374412/coos-and-snooze-scientists-decode-pigeons-dreams-374412-640x360.jpg?cb=20230607", "publishedAt": "2023-06-07T15:54:53Z", "content": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a tech… [+5189 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Revolutionizes Antibiotic Discovery: A New Hope Against Evasive Hospital Superbugs - SciTechDaily", "description": "New process could speed the discovery of other much-needed antibiotics. Scientists at McMaster University and the Massachusetts Institute of Technology have used artificial intelligence to discover a new antibiotic that could be used to fight a deadly, drug-r…", "url": "https://scitechdaily.com/ai-revolutionizes-antibiotic-discovery-a-new-hope-against-evasive-hospital-superbugs/", "urlToImage": "https://scitechdaily.com/images/Antibiotic-Destroying-Bacteria-Illustration.jpg", "publishedAt": "2023-06-07T04:35:35Z", "content": "ByMcMaster UniversityJune 6, 2023\r\nUsing artificial intelligence, scientists have discovered a new antibiotic, abaucin, aimed at tackling the dangerous, drug-resistant bacteria Acinetobacter baumanni… [+7253 chars]"}]}