{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Seedworld.com"}, "author": "Compiled by Staff", "title": "Plant Stress Sensors Could Revolutionize Crop Management - Seed World", "description": "Researchers from the Massachusetts Institute of Technology (MIT) and the Singapore-MIT Alliance for Research and Technology (SMART) have introduced a pioneering pair of sensors crafted from carbon nanotubes in a recent news release. The nanotubes are designed…", "url": "https://www.seedworld.com/us/2024/04/19/plant-stress-sensors-could-revolutionize-crop-management/", "urlToImage": "https://seedworld.com/cdn/wp-content/uploads/20240419133132/MIT-Plant-Sensor-01-press_0.jpg", "publishedAt": "2024-04-19T18:33:59Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "Manjiri Joshi, News Desk", "title": "‘Personal Reasons’: Karnataka Govt Reacts To Campus Killing Of First-Year MCA Student After Love Jihad Char - News18", "description": "Neha, a first-year MCA student at BVB College of Engineering and Technology in Hubballi and daughter of Hubballi Dharwad Municipal Corporation (HDMC) councillor Niranjan Hiremath, was stabbed to death by Fayaz, a dropout from the same institute whose advances…", "url": "https://www.news18.com/india/personal-reasons-karnataka-govt-reacts-to-campus-killing-of-first-year-student-after-love-jihad-charge-8858621.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/04/untitled-design-3-2024-04-6c9d738ce6217cb9237cb227d8199d53-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-04-19T13:55:09Z", "content": "Dismissing the political attack and claims of love jihad, Karnataka CM Siddaramaiah on Friday said the murder of daughter of a Congress corporator on a Hubballi college campus was due to personal rea… [+4480 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Study suggests Io's volcanoes have been active for 4.5 billion years - Phys.org", "description": "A team of geologists and planetary scientists from the California Institute of Technology, the University of California Santa Cruz, New York University, and NASA Goddard Space Flight Center reports evidence that Io's volcanic activity has been ongoing since t…", "url": "https://phys.org/news/2024-04-io-volcanoes-billion-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/study-suggests-ios-vol.jpg", "publishedAt": "2024-04-19T12:22:14Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+535 chars]"}, {"source": {"id": null, "name": "TechNode"}, "author": "Jessie Wu", "title": "Huawei launches Pura 70 series equipped with Kirin 9010 chip · TechNode - TechNode", "description": "On Thursday, Huawei unveiled a letter on the Chinese X-like social media platform Weibo to announce the Pura 70 Series Pioneer Program, a scheme for people to purchase devices from its latest mobile phone series without holding a launch event.", "url": "http://technode.com/2024/04/19/huawei-launches-new-pura-70-series-phones-equipped-with-self-developed-kirin-9010-chip/", "urlToImage": "https://technode.com/wp-content/uploads/2024/04/huawei-pura.png", "publishedAt": "2024-04-19T10:48:04Z", "content": "Every Wednesday and Friday, TechNodes Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\r\nOn Thursday, Huawei unveiled a letter on the Chinese X-… [+4050 chars]"}]}