{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Massive Asteroid Impact Crater in Greenland Occurred a Few Million Years After Dinosaurs Went Extinct - SciTechDaily", "description": "Danish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater buried under a kilometer of Greenlandic ice. The dating ends speculation that the meteorite impacted after the appearance of humans and opens up a new…", "url": "https://scitechdaily.com/massive-asteroid-impact-crater-in-greenland-occurred-a-few-million-years-after-dinosaurs-went-extinct/", "urlToImage": "https://scitechdaily.com/images/Fieldwork-Edge-of-Greenland-Ice-Sheet-in-2019-scaled.jpg", "publishedAt": "2022-03-10T04:47:56Z", "content": "Photo from fieldwork at the edge of the Greenland Ice Sheet in 2019. Credit: Pierre Beck\r\nDanish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater … [+5564 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "UQ and Moderna partner to research and develop vaccines against global public health threats - News-Medical.Net", "description": "The University of Queensland has been selected as one of the first launch institutions in the world to partner with biotechnology company Moderna to research and develop vaccines to tackle the world's greatest global public health threats.", "url": "https://www.news-medical.net/news/20220309/UQ-and-Moderna-partner-to-research-and-develop-vaccines-against-global-public-health-threats.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/134984011-620x480.jpg", "publishedAt": "2022-03-10T03:33:00Z", "content": "The University of Queensland has been selected as one of the first launch institutions in the world to partner with biotechnology company Moderna to research and develop vaccines to tackle the world'… [+2942 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "Carl Pei could announce a new Nothing phone on an upcoming livestream event - TechNave", "description": "So just a few hours ago, the&nbsp;Nothing&nbsp;brand has released a short teaser and it will be about&nbsp;a new livestream event. In the clip, it seems that Ca", "url": "https://technave.com/gadget/Carl-Pei-could-announce-a-new-Nothing-phone-on-an-upcoming-livestream-event-29022.html", "urlToImage": "https://technave.com/data/files/article/202203100243586951.jpg", "publishedAt": "2022-03-10T02:50:58Z", "content": "So just a few hours ago, the Nothing brand has released a short teaser and it will be about a new livestream event. In the clip, it seems that Carl Pei himself will be hosting the show and quite poss… [+969 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Tech, financials lead resurgent Wall Street as oil plunges - Moneycontrol", "description": "The S&P 500 posted its biggest one-day percentage gain since June 2020, while the Nasdaq tallied its biggest rise since March 2021.", "url": "https://www.moneycontrol.com/news/business/markets/tech-financials-lead-resurgent-wall-street-as-oil-plunges-8214091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/08/wall-street-770x433.jpg", "publishedAt": "2022-03-10T00:39:01Z", "content": "U.S. stocks surged on Wednesday led by financial and tech shares, rebounding from several down days as oil prices pulled back sharply after fanning inflationary fears and investors gauged development… [+2557 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New research sheds light on nature of friction in multi-layered graphene: New study provides insights into how surface structures influence nanoscale friction in this promising 2D material - Science Daily", "description": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely clear. Now, in a recent study, scientists analyze how surface s…", "url": "https://www.sciencedaily.com/releases/2022/03/220309104411.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T21:48:29Z", "content": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely cle… [+3335 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists plan to bring back extinct Christmas Island rat by gene-editing DNA - Daily Mail", "description": "It could be possible to bring back the extinct Christmas Island rat using the CRISPR gene editing technique, according to Dr Tom Gilbert at the University of Copenhagen.", "url": "https://www.dailymail.co.uk/sciencetech/article-10594185/Scientists-plan-bring-extinct-Christmas-Island-rat.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/16/55144063-0-image-a-20_1646843199986.jpg", "publishedAt": "2022-03-09T16:37:57Z", "content": "Scientists have revealed plans to bring back the extinct Christmas Island rat, 119 years after it was wiped out. \r\nIn a new paper, an international team of academics outline how the use of CRISPR a g… [+9348 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "China's Yutu 2 Rover Sends Back Image After 3 Years On Moon's Far Side | Science & Tech - Ommcom News", "description": "Beijing:  China's Yutu 2 rover, traversing the harsh environment of the moon's far side, has returned a view of its path over the last three years.Yutu 2 touched down on the lunar far side in January 2019 atop the Chang'e 4 lander, making the pair th", "url": "https://ommcomnews.com/science-tech/chinas-yutu-2-rover-sends-back-image-after-3-years-on-moons-far-side", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/03/09200938/112b32f60ead923c97d3111bf99f9abb.jpg", "publishedAt": "2022-03-09T14:39:59Z", "content": "Beijing:  China’s Yutu 2 rover, traversing the harsh environment of the moon’s far side, has returned a view of its path over the last three years.\r\nYutu 2 touched down on the lunar far side in Janua… [+1659 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Even Mild COVID Can Cause Brain Shrinkage and Disrupt Mental Function - SciTechDaily", "description": "Most of what we know about how COVID can affect the brain has come from studies of severe infection. In people with severe COVID, inflammatory cells from outside the brain can enter brain tissue and spread inflammation. There may be changes to blood vessels. …", "url": "https://scitechdaily.com/even-mild-covid-can-cause-brain-shrinkage-and-disrupt-mental-function/", "urlToImage": "https://scitechdaily.com/images/Brain-Glitch-Stress-Disorder-Concept.jpg", "publishedAt": "2022-03-09T13:14:51Z", "content": "Most of what we know about how COVID can affect the brain has come from studies of severe infection. In people with severe COVID, inflammatory cells from outside the brain can enter brain tissue and … [+6029 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gigantic Bubbles at Center of Milky Way Caused by Powerful Jet of Energy From Supermassive Black Hole - SciTechDaily", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy. Since then, astronomers have debated their origin. Now, a study including University of Michigan research suggests the bubbles are…", "url": "https://scitechdaily.com/gigantic-bubbles-at-center-of-milky-way-caused-by-powerful-jet-of-energy-from-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Gigantic-Bubbles.jpg", "publishedAt": "2022-03-09T10:42:06Z", "content": "The NASA visualization team created a superposition of an image of the Milky Way, taken by the European Space Agency’s Gaia space observatory, and a visualization of the simulations of the eRosita an… [+6681 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa has driven into a R200 billion-plus pothole - BusinessTech", "description": "Transport minister Fikile Mbalula was asked how many potholes the country has.", "url": "https://businesstech.co.za/news/motoring/566184/south-africa-has-driven-into-a-r200-billion-plus-pothole/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/08/Mbalula-e1598280950219.jpg", "publishedAt": "2022-03-09T07:30:00Z", "content": "Transport minister Fikile Mbalula says South Africa is facing a significant roads maintenance backlog which has continued to grow over the last decade.\r\nAsked about how many potholes the country has … [+3181 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How government can stop a R2/litre petrol price hike in South Africa next month - BusinessTech", "description": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says Investec chief economist Annabel Bishop.", "url": "https://businesstech.co.za/news/finance/565806/how-government-can-stop-a-r2-litre-petrol-price-hike-in-south-africa-next-month/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/03/South-Africa-Rand-Money-Notes-Coins.jpg", "publishedAt": "2022-03-08T14:01:12Z", "content": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says I… [+2216 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "This extinct ten-armed fossil may be earliest known ancestor of vampire squid - Ars Technica", "description": "Syllipsimopodi bideni named to honor US President Joe Biden's commitment to science.", "url": "https://arstechnica.com/science/2022/03/this-extinct-ten-armed-fossil-may-be-earliest-known-ancestor-of-vampire-squid/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/squid1ROTATE-760x380.jpg", "publishedAt": "2022-03-08T13:43:49Z", "content": "Enlarge/ An artistic reconstruction of the newly described 328-million-year-old vampyropod, Syllipsimopodi bideni.\r\n31 with 23 posters participating\r\nPaleontologists believe they have discovered a ne… [+4819 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "realme 9 Pro+ 5G - Worth buying?! | TechNave Unboxing and Hands-On Video - TechNave", "description": "Here is the latest realme 9 Pro series 🔥You may check out the video to find out more about the device😉 Of course, don't forget to let us know which variant...", "url": "https://www.youtube.com/watch?v=A5gzAFVapC0", "urlToImage": "https://i.ytimg.com/vi/A5gzAFVapC0/hqdefault.jpg", "publishedAt": "2022-03-08T10:00:03Z", "content": null}]}