{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "DIDI TANG", "title": "Many Americans have come to rely on Chinese-made drones. Now lawmakers want to ban them - The Associated Press", "description": "The economic and technological rivalry between the U.S. and China has come to the drone market, where Chinese-made flying devices are a dominant player in America. Lawmakers in Washington are seeking to ban new sales of Chinese-made drones, arguing they could…", "url": "https://apnews.com/article/china-drones-congress-ban-f69836c63b6e90956464f68c429f2724", "urlToImage": "https://dims.apnews.com/dims4/default/5536c32/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fde%2Fcb%2Faaaf7266a22797ec457cd00511ca%2F579cefddafcc4becb77b2ff071ad7e80", "publishedAt": "2024-12-23T05:11:00Z", "content": "WASHINGTON (AP) Russell Hedrick, a North Carolina farmer, flies drones to spray fertilizers on his corn, soybean and wheat fields at a fraction of what it would cost him to use a conventional ground … [+10377 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Did Earth’s Gravity Give the Moon a Volcanic Makeover? - SciTechDaily", "description": "The Moon, our ancient companion, might be older than we think. While lunar rocks suggest an age of 4.35 billion years, new research hints at a hidden past obscured by tidal heating — a cosmic event that \"remelted\" its surface and reset its geological clock. T…", "url": "https://scitechdaily.com/did-earths-gravity-give-the-moon-a-volcanic-makeover/", "urlToImage": "https://scitechdaily.com/images/Volcanic-Moon-scaled.jpg", "publishedAt": "2024-12-22T22:48:48Z", "content": "The Moon, our ancient companion, might be older than we think. While lunar rocks suggest an age of 4.35 billion years, new research hints at a hidden past obscured by tidal heating — a cosmic event t… [+6849 chars]"}, {"source": {"id": null, "name": "WKMG News 6 & ClickOrlando"}, "author": "Jacob Langston", "title": "WILD VIDEO: Drones fall from Orlando sky at Lake Eola holiday show into crowd, possibly striking attendees - WKMG News 6 & ClickOrlando", "description": "The second of two planned holiday drone shows at Lake Eola Park in downtown Orlando was canceled after what the city described as “technical difficulties,” but one viewer who was at the show said he could see multiple drones crashing into each other before fa…", "url": "https://www.clickorlando.com/news/local/2024/12/22/wild-video-drones-fall-from-sky-at-lake-eola-holiday-show-possibly-striking-attendees/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/anyclip/xaak7JMBS_Xf9GRiYk-F/1734842084461_1920x1080_thumbnail.jpg?_a=DATAdtfiZAA0", "publishedAt": "2024-12-22T02:27:02Z", "content": "ORLANDO, Fla. The second of two planned holiday drone shows at Lake Eola Park in downtown Orlando was canceled after what the city described as technical difficulties, but one viewer who was at the s… [+4291 chars]"}]}