{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "IIT Madras Scientists Unlock the Secrets of Organ Communication with Innovative Computational Approach - Transcontinental Times", "description": "INDIA: Scientists at the Indian Institute of Technology (IIT) Madras have made a significant breakthrough in understanding how organs communicate with one another within the human body.  Their innovative computational approach, known as MultiCens (Multilayer/…", "url": "https://www.transcontinentaltimes.com/iit-madras-scientists-unlock-organ/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/07/IIT-MADRAS.jpg", "publishedAt": "2023-07-26T05:13:00Z", "content": "INDIA: Scientists at the Indian Institute of Technology (IIT) Madras have made a significant breakthrough in understanding how organs communicate with one another within the human body. \r\nTheir innov… [+3473 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for July 26: Skins, diamonds, bundles and more, grab the freebies now! - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for July 26: Grab the chance to win exciting freebies including free skins, diamonds, accessories, and bundles. Know how to claim free rewards.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-july-26-skins-diamonds-bundles-and-more-grab-the-freebies-now-71690333872718.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/26/1600x900/pop02_1652576476202_1690333929717.jpg", "publishedAt": "2023-07-26T01:16:03Z", "content": "Garena Free Fire MAX Redeem Codes for July 26: Garena Free Fire MAX is an immensely populated game in India, especially due to the ongoing ban of its sibling, Garena Free Fire. The game is a more spe… [+2357 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Improving recyclable waste classification with laser-induced breakdown spectroscopy: Coupling spectroscopy with sorting algorithms paves the way for more efficient and reliable waste segregation in the future - Science Daily", "description": "Delving into the intricacies of waste management, researchers explore the application of laser-induced breakdown spectroscopy technology for the identification and classification of recyclable waste. They collected and analyzed the spectra of 80 recyclable wa…", "url": "https://www.sciencedaily.com/releases/2023/07/230725122952.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-25T21:35:10Z", "content": "Managing and classifying waste accurately for reuse is a growing challenge in environmental protection. Addressing this issue, researchers at Hefei University of Technology in China have embarked on … [+2720 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Taylor Lyles", "title": "ESRB Blasts Reports That It's Using Facial Recognition Technology to Verify Ages of Children - IGN", "description": "The Entertainment Software Ratings Board (ESRB) is debunking recent reports that imply the company wants to use facial recognition tech for children, adding that it has no intention of storing or using \"selfies\" of its users.", "url": "https://www.ign.com/articles/esrb-facial-age-recognition-tech-response", "urlToImage": "https://assets-prd.ignimgs.com/2023/07/25/facial-recognition-1690310751182.png?width=1280", "publishedAt": "2023-07-25T19:18:21Z", "content": "The Entertainment Software Ratings Board (ESRB) is blasting recent reports that suggest the organization is planning to use facial recognition tech on children, adding that it has no intention of usi… [+6068 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta and Sarah Perez", "title": "Meta’s Threads app is rolling out a Following feed - TechCrunch", "description": "Meta's text-based social network Threads is rolling out one of the most requested features after its launch — a following feed.", "url": "https://techcrunch.com/2023/07/25/metas-threads-app-is-rolling-out-a-following-feed/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/Threads-GettyImages-1524134312.jpg?resize=1200,800", "publishedAt": "2023-07-25T16:13:52Z", "content": "Meta’s text-based social network Threads is rolling out one of the most requested features after its launch a Following feed. The company has also announced the ability to see posts youve liked in yo… [+3919 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "European Southern Observatory", "title": "New image offers clues on massive planet birth - Tech Explorist", "description": "A spectacular new image released today by the European Southern Observatory gives us clues about how planets as massive as Jupiter could form. Using ESO’s", "url": "https://www.techexplorist.com/new-image-offers-clues-massive-planet-birth/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/material-orbiting-V960-Mon.jpeg", "publishedAt": "2023-07-25T13:00:00Z", "content": "A spectacular new image released today by the European Southern Observatory gives us clues about how planets as massive as Jupiter could form. Using ESOs Very Large Telescope (VLT) and the Atacama La… [+4200 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Brain networks use electric fields to store memories - Tech Explorist", "description": "Electric fields coordinate brain networks to encode memories.", "url": "https://www.techexplorist.com/electric-fields-coordinate-brain-networks-encode-memories/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/brain-1.jpg", "publishedAt": "2023-07-25T10:26:14Z", "content": "The human brain’s remarkable capacity to store and retrieve memories has long fascinated neuroscientists. Decades of research have elucidated the key brain regions involved in memory processing. Howe… [+4888 chars]"}]}