{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm to strike Earth as huge CME clouds approaching fast; NASA reveals details - HT Tech", "description": "A coronal mass ejection (CME) is headed towards the Earth and can spark a solar storm on July 13, reveals a NASA. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-to-strike-earth-as-huge-cme-clouds-approaching-fast-nasa-reveals-details-71689054846948.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/faintyoung_2_1689054884449_1689054884634.jpg", "publishedAt": "2023-07-11T05:58:09Z", "content": "Last week, panic spread among people as reports of an internet apocalypse' began doing the rounds on social media platforms. The reports suggested that a massive solar storm will strike the Earth in … [+2098 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "150-foot asteroid racing towards Earth at breakneck speed; close approach today - HT Tech", "description": "An aircraft-sized asteroid could come very close to Earth today, NASA has revealed. While this space rock is not a planet killer, it could still cause potential damage if it crashes. Know details.", "url": "https://tech.hindustantimes.com/tech/news/150foot-asteroid-racing-towards-earth-at-breakneck-speed-close-approach-today-71689054344767.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/orbit-viewer-snapshot_1689054573973_1689054583106.jpg", "publishedAt": "2023-07-11T05:51:09Z", "content": "NASA keeps an eye on asteroids, comets, and other Near-Earth Objects (NEOs) for potential close approaches that could threaten Earth. The space agency has issued a warning against an asteroid that wi… [+2008 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple issues urgent iOS 16 security update for iPhone, iPad, Mac users, but RECALLS it! - HT Tech", "description": "Apple rolled out a crucial iOS 16 security update for its devices to fix a vulnerability, but it has caused problems for users, and Apple has now recalled it.", "url": "https://tech.hindustantimes.com/tech/news/apple-issues-urgent-ios-16-security-update-for-iphone-ipad-mac-users-but-recalls-it-71689052939498.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/11/1600x900/azamat-e-cH7vFoUxF9w-unsplash_1689053164767_1689053170468.jpg", "publishedAt": "2023-07-11T05:26:46Z", "content": "There's a reason for Apple users to be cautious as exploits have been found in the latest iOS 16 software on iPhones, iPads, and Macs. On Monday, the Cupertino-based tech giant released an urgent sec… [+2085 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Physics in a Leaf? Scientists Discover Link Between Photosynthesis and the “Fifth State of Matter” - SciTechDaily", "description": "UChicago researchers hope \"islands\" of exciton condensation could pave the way for new discoveries. Inside a lab, scientists marvel at a strange state that forms when they cool down atoms to nearly absolute zero. Meanwhile, just outside their window, trees ar…", "url": "https://scitechdaily.com/quantum-physics-in-a-leaf-scientists-discover-link-between-photosynthesis-and-the-fifth-state-of-matter/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis.jpg", "publishedAt": "2023-07-11T02:20:46Z", "content": "ByUniversity of ChicagoJuly 10, 2023\r\nScientists found that natural photosynthesis exhibits similar characteristics to exciton condensatesa frictionless energy state, typically requiring extremely lo… [+6677 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Starlink satellites are dodging objects in orbit thousands of times every month - TechCrunch", "description": "Starlink satellites are making thousands of avoidance maneuvers as low Earth orbit becomes more crowded, feeding worries that a catastrophic impact is inevitable. SpaceX’s orbital communication satellites performed maneuvers just over 25,000 times in the six-…", "url": "https://techcrunch.com/2023/07/10/starlink-satellites-are-dodging-objects-in-orbit-thousands-of-times-every-month/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/02/starlink-trails-iau.jpg?resize=1200,720", "publishedAt": "2023-07-10T20:49:16Z", "content": "Starlink satellites are making thousands of avoidance maneuvers as low Earth orbit becomes more crowded, feeding worries that a catastrophic impact is inevitable.\r\nSpaceX’s orbital communication sate… [+2873 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Universe Revelation: Webb Detects Most Distant Active Supermassive Black Hole - SciTechDaily", "description": "With Webb, a slew of other distant black holes and early galaxies also popped into view for the first time. It’s a bonanza! The universe is absolutely teeming with black holes. Researchers have long known this, but less massive black holes that existed in the…", "url": "https://scitechdaily.com/early-universe-revelation-webb-detects-most-distant-active-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Distant-Black-Hole-Concept.jpg", "publishedAt": "2023-07-10T08:25:27Z", "content": "BySpace Telescope Science InstituteJuly 10, 2023\r\nThe James Webb Space Telescopes CEERS Survey has uncovered the most distant active supermassive black hole ever found, existing just over 570 million… [+17367 chars]"}]}