{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Scott Bauer, Thomas Beaumont", "title": "Elon Musk hands out $1 million payments after Wisconsin Supreme Court declines request to stop him - The Associated Press", "description": "Elon Musk has given out $1 million checks to two Wisconsin voters, declaring them spokespeople for his political group. That's ahead of a Wisconsin Supreme Court election that the tech billionaire cast as critical to President Donald Trump’s agenda and “the f…", "url": "https://apnews.com/article/wisconsin-supreme-court-musk-million-dollar-giveaway-cdea66e0dcbaa53dd183e1d10bee2b35", "urlToImage": "https://dims.apnews.com/dims4/default/cd217a4/2147483647/strip/true/crop/5736x3227+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F83%2Ffc%2F372974b84943e25909f97c6b3094%2F22819244996841f8919eea304b119693", "publishedAt": "2025-03-31T03:40:00Z", "content": "GREEN BAY, Wis. (AP) Elon Musk gave out $1 million checks on Sunday to two Wisconsin voters, declaring them spokespeople for his political group, ahead of a Wisconsin Supreme Court election that the … [+5362 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Colorectal Cancer Is on the Rise: Mayo Clinic Doctor Reveals 4 Keys Symptoms You Should Know - SciTechDaily", "description": "Colorectal cancer is rising in younger adults, and early signs shouldn't be ignored. Healthy habits and timely screening are key. Colorectal cancer, the third most common cancer in the U.S., has been steadily increasing among younger adults over the past 20 y…", "url": "https://scitechdaily.com/colorectal-cancer-is-on-the-rise-mayo-clinic-doctor-reveals-4-keys-symptoms-you-should-know/", "urlToImage": "https://scitechdaily.com/images/Man-Colon-Cancer.jpg", "publishedAt": "2025-03-30T21:33:03Z", "content": "Colorectal cancer is rising among younger people, especially rectal cancer, with key warning signs including abdominal pain, diarrhea, blood in stool, and iron deficiency anemia. Early screening and … [+2587 chars]"}]}