{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Rocket Lab targets Venus for pioneering private space mission in search of life beyond Earth - HT Tech", "description": "Rocket Lab pioneers private space exploration, challenging norms with a cost-effective mission to study Venus for signs of life, marking a significant shift in planetary science.", "url": "https://tech.hindustantimes.com/tech/news/rocket-lab-targets-venus-for-pioneering-private-space-mission-in-search-of-life-beyond-earth-71700131350863.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/16/1600x900/Venus_1700131486296_1700131486601.jpg", "publishedAt": "2023-11-16T10:47:30Z", "content": "In a paradigm-shifting move, Rocket Lab, a private aerospace company, is breaking new ground in planetary exploration. Departing from traditional government-led endeavours through NASA and other agen… [+2339 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ravi Shankar", "title": "From Aryabhata to Chandrayaan-3: ISRO's 10 Space Inventions - IndiaTimes", "description": "​The Indian Space Research Organisation (ISRO) has been involved in various groundbreaking inventions and achievements in the field of space exploration and satellite technology. Some notable inventions and accomplishments include:​", "url": "https://timesofindia.indiatimes.com/education/news/from-aryabhata-to-chandrayaan-3-isros-8-space-inventions/photostory/105260597.cms", "urlToImage": "https://static.toiimg.com/photo/105260608.cms", "publishedAt": "2023-11-16T10:19:07Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Alarming Diabetes Danger: Insufficient Sleep Raises Insulin Resistance in Women - SciTechDaily", "description": "Findings highlight insufficient sleep as a modifiable risk factor for type 2 diabetes. Chronic insufficient sleep can increase insulin resistance in otherwise healthy women, with more marked effects in postmenopausal women, according to a study funded by the …", "url": "https://scitechdaily.com/?p=328602", "urlToImage": "https://scitechdaily.com/images/Woman-Insomnia-Sleep-Deficiency-Art-Concept.jpg", "publishedAt": "2023-11-16T09:26:46Z", "content": "ByNational Heart, Lung, and Blood Institute (NHLBI)November 16, 2023\r\nResearch funded by the NIH demonstrates that insufficient sleep heightens insulin resistance in women, especially postmenopausal … [+8127 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Aircraft-sized asteroid to pass Earth today, reveals NASA - HT Tech", "description": "NASA has revealed details about an upcoming close encounter with an Aten-group asteroid that will pass by Earth today, November 16. Check details such as its speed, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/aircraftsized-asteroid-to-pass-earth-today-reveals-nasa-71700113240438.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/16/1600x900/asteroid-6149674_640_1686902438536_1700113502145.jpg", "publishedAt": "2023-11-16T05:46:17Z", "content": "With its vast number of ground and space-based telescopes and observatories, NASA has discovered as many as 1298148 to date, and one of them is predicted to pass Earth by a close margin today, Novemb… [+2167 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Dhanya Nagasundaram", "title": "Tata Technologies IPO opens on November 22, price band set at ₹475-500 per share | Mint - Mint", "description": "Tata Technologies IPO price band fixed at  ₹475-500 per share, subscription opens on Nov 22 and closes on Nov 24. Tata Technologies IPO lot size is 30 shares, basis of allotment to be finalised on Nov 30, shares likely to be listed on BSE and NSE on Dec 5.", "url": "https://www.livemint.com/market/ipo/tata-technologies-ipo-opens-on-november-22-price-band-set-at-rs-475-500-per-share-11700101188683.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/16/1600x900/Tata_Technologies_IPO_1699926504733_1700101213113.JPG", "publishedAt": "2023-11-16T02:28:23Z", "content": "Tata Tech IPO news: Tata Technologies IPO price band has been fixed in the range of 475 to 500 per equity share of face value of 2. Tata Technologies IPO date of subscription is scheduled on Wednesda… [+3989 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "India, US sign deal to boost startups | Mint - Mint", "description": "Under the agreement, the two countries will share information and best practices for startup fundraising and promoting innovation and job growth, particularly in critical and emerging technologies", "url": "https://www.livemint.com/news/india/india-us-sign-deal-to-boost-startups-11700057026447.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/15/1600x900/PTI11-15-2023-000053B-0_1700057501112_1700057541188.jpg", "publishedAt": "2023-11-15T14:15:47Z", "content": "New Delhi: India has signed a deal with the US to boost its startup ecosystem through greater cooperation in critical technologies, the ministry of commerce said on Wednesday. The agreement was signe… [+1399 chars]"}]}