{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "Arcade, a new AI product creation platform, designed this necklace - TechCrunch", "description": "Mariam Naficy, the founder of cosmetics retailer Eve and design marketplace Minted, has a long history of supporting independent artists and helping them Arcade AI is a new generative AI platform that puts creative control directly into the hands of users, al…", "url": "https://techcrunch.com/2024/10/27/arcade-a-new-ai-product-creation-platform-designed-this-necklace/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/10/ArcadeAI-design.png?w=1046", "publishedAt": "2024-10-27T14:00:00Z", "content": "Mariam Naficy, the founder of cosmetics retailer Eve and design marketplace Minted, has a long history of supporting independent artists and helping them sell their products. Her latest venture, Arca… [+6748 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Jeran Wittenstein, Ryan Vlastelica", "title": "Big Tech Stocks Lose Some of Their Aura as Earnings Growth Slows - Bloomberg", "description": "Slowing profit growth is removing some of the invincibility surrounding the stock market’s technology giants as they prepare to report earnings this week. Whether they can reverse that trend will go a long way to determining if the rally in equities can keep …", "url": "https://www.bloomberg.com/news/articles/2024-10-27/big-tech-stocks-lose-some-of-their-aura-as-earnings-growth-slows", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ixaUd50QZAO0/v1/1200x800.jpg", "publishedAt": "2024-10-27T13:00:00Z", "content": "Slowing profit growth is removing some of the invincibility surrounding the stock markets technology giants as they prepare to report earnings this week. Whether they can reverse that trend will go a… [+520 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Alzheimer’s Breakthrough: Popular Diabetes Drug Ozempic Linked to Much Lower Risk - SciTechDaily", "description": "Semaglutide may reduce Alzheimer's risk in type 2 diabetes patients, with research suggesting significant protective benefits compared to other diabetes drugs. Researchers at Case Western Reserve School of Medicine have found that semaglutide, a popular drug …", "url": "https://scitechdaily.com/alzheimers-breakthrough-popular-diabetes-drug-ozempic-linked-to-much-lower-risk/", "urlToImage": "https://scitechdaily.com/images/Alzheimers-Dementia-Brain-Disease-Concept.jpg", "publishedAt": "2024-10-27T10:34:16Z", "content": "Researchers have discovered that semaglutide, a diabetes and weight-loss medication sold under the brand names Wegovy and Ozempic, might significantly reduce the risk of Alzheimer’s in type 2 diabete… [+3673 chars]"}]}