{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Aditya-L1 mission: ISRO spacecraft heads towards centre of solar system to spy on the sun - HT Tech", "description": "Aditya-L1 mission: India's Sun-monitoring spacecraft has crossed a landmark point on its journey.", "url": "https://tech.hindustantimes.com/tech/news/adityal1-mission-isro-spacecraft-heads-towards-centre-of-solar-system-to-spy-on-the-sun-71696158354234.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/02/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1696210813378.jpg", "publishedAt": "2023-10-02T01:43:44Z", "content": "Aditya-L1 mission: India's Sun-monitoring spacecraft has crossed a landmark point on its journey to escape \"the sphere of Earth's influence\", its space agency said, days after the disappointment of i… [+1980 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Asteroid Sample Capsule Lands on Earth, Record Ride in Space, Artemis II Mission - SciTechDaily", "description": "NASA’s first asteroid sample return mission is back on Earth... A record ride in space for a NASA astronaut... And NASA’s Artemis II mission is making prelaunch progress... A few of the stories to tell you about – This Week at NASA! https://youtu.be/ct1Y0B1wm…", "url": "https://scitechdaily.com/?p=313738", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Sample-Return-Landing-5-scaled.jpg", "publishedAt": "2023-10-01T15:03:50Z", "content": "ByNASAOctober 1, 2023\r\nThe sample return capsule from NASAs OSIRIS-REx mission is seen shortly after touching down in the desert on September 24, 2023, at the Department of Defenses Utah Test and Tra… [+4974 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "UltraTech Cement Q2 sales up 15% to 26.69 MT - Moneycontrol", "description": "The company produced 23.10 MT cement in July-September period a year ago, the Aditya Birla Group firm said in a sales volume data filed on bourses.", "url": "https://www.moneycontrol.com/news/business/ultratech-cement-q2-sales-up-15-to-26-69-mt-11461261.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/02/ultratech-cement-770x433.jpg", "publishedAt": "2023-10-01T14:37:40Z", "content": "UltraTech Cement's consolidated sales rose 15.54 per cent to 26.69 million tonne (MT) year-on-year in the second quarter ended September 30, 2023. The company produced 23.10 MT cement in July-Septemb… [+817 chars]"}, {"source": {"id": null, "name": "CTech"}, "author": "Lital Samet", "title": "Space tourism is growing, but only for the rich - CTech", "description": "Commercial flights into space are becoming more routine, and despite the very high prices, it is estimated that the value of the space tourism industry will reach $3 billion by 2030", "url": "https://www.calcalistech.com/ctechnews/article/hjcqqy7et", "urlToImage": "https://pic1.calcalist.co.il/picserver3/crop_images/2020/11/16/1036478/1036478_0_0_566_319_0_large.jpg", "publishedAt": "2023-10-01T06:08:00Z", "content": "09:08, 01.10.23 \r\nAn American, a Brit, and a South African board a spacecraft. No, this isnt the opening of a joke, but the third tourist space flight launched by Virgin Galactic last month. This fli… [+7719 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "1000x More Precise: Breakthrough for Next Generation Atomic Clocks - SciTechDaily", "description": "X-ray laser shows a possible route to substantially increased precision time measurement. An international research team has taken a decisive step toward a new generation of atomic clocks. At the European XFEL X-ray laser, the researchers have created a much …", "url": "https://scitechdaily.com/1000x-more-precise-breakthrough-for-next-generation-atomic-clocks/", "urlToImage": "https://scitechdaily.com/images/Scandium-Nuclear-Clock.jpg", "publishedAt": "2023-09-30T10:08:27Z", "content": "ByGerman Electron Synchrotron DESYSeptember 30, 2023\r\nAn artists rendition of the scandium nuclear clock: scientists used the X-ray pulses of the European XFEL to excite in the atomic nucleus of scan… [+7077 chars]"}]}