{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Godfather of AI' leaves Google and warns of dangers | DW News - DW News", "description": "As AI technology advances at an unprecedented pace, experts and policymakers are becoming increasingly concerned about its potential impact on society. From ...", "url": "https://www.youtube.com/watch?v=R26W_7aLdRA", "urlToImage": "https://i.ytimg.com/vi/R26W_7aLdRA/maxresdefault.jpg", "publishedAt": "2023-05-02T21:38:06Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: “Peak Venus” and Jupiter Occultation - SciTechDaily", "description": "What are some skywatching highlights in May 2023? Venus reaches its highest point in the evening sky for the year, while Jupiter disappears behind the Moon for some U.S. observers. Plus, some key differences in the Southern Hemisphere's skies compared to thos…", "url": "https://scitechdaily.com/?p=273594", "urlToImage": "https://scitechdaily.com/images/Jupiter-Occultation.jpg", "publishedAt": "2023-05-02T21:06:52Z", "content": "ByNASA's Jet Propulsion LaboratoryMay 2, 2023\r\nAn occultation is a celestial event that occurs when one object is hidden by another object that passes between it and the observer. In this Jupiter occ… [+8778 chars]"}, {"source": {"id": null, "name": "Caltech.edu"}, "author": null, "title": "Quantum Entanglement of Photons Doubles Microscope Resolution - Caltech", "description": "Lihong Wang’s lab has succeeded in using “biphotons” to image microscopic objects in an entirely new way.", "url": "https://www.caltech.edu/about/news/quantum-entanglement-of-photons-doubles-microscope-resolution", "urlToImage": "https://caltech-prod.s3.amazonaws.com/main/images/Wang_Lihong-Lab-Quantum_Microscopy-4712-WEB.width-600.jpg", "publishedAt": "2023-05-01T23:50:30Z", "content": "Using a \"spooky\" phenomenon of quantum physics, Caltech researchers have discovered a way to double the resolution of light microscopes.\r\nIn a paper appearing in the journal Nature Communications, a … [+2186 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Feeding the Future: Artificial Photosynthesis Transforms CO2 Into Food - SciTechDaily", "description": "Researchers produce important amino acid from greenhouse gas CO2 Growing demand for food in the world Biotechnological process via methanol as intermediate product Less ground required than for plant cultivation Ensuring the supply of food to the constantly g…", "url": "https://scitechdaily.com/feeding-the-future-artificial-photosynthesis-transforms-co2-into-food/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-05-01T18:13:47Z", "content": "ByTechnical University of Munich (TUM)May 1, 2023\r\nResearchers at the Technical University of Munich have developed a sustainable method to create the essential amino acid L-alanine from CO2. This pr… [+3363 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA warns of close approach by Asteroid 2023 HY3 TODAY - HT Tech", "description": "NASA has issued a warning against an asteroid designated as Asteroid 2023 HY3, which will make its closest approach to Earth today, May 1.", "url": "https://tech.hindustantimes.com/tech/news/nasa-warns-of-close-approach-by-asteroid-2023-hy3-today-71682903750942.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/asteroid_1681212528521_1681718818919_1681719004344_1682903856586.jpg", "publishedAt": "2023-05-01T01:18:08Z", "content": "While NASA, ESA and other space agencies have developed advanced technologies to locate, track and monitor asteroids in space, the first ever asteroid discovery happened accidentally! Astronomer Gius… [+1925 chars]"}]}