{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Einstein Telescope: Unlocking a New Era in Astronomy From 250 Meters Underground - SciTechDaily", "description": "The Einstein Telescope, set to begin observations in 2035, will expand our capability to detect gravitational waves, offering new insights into the universe's most dramatic events, including neutron star collisions that form elements like gold. It’s still jus…", "url": "https://scitechdaily.com/einstein-telescope-unlocking-a-new-era-in-astronomy-from-250-meters-underground/", "urlToImage": "https://scitechdaily.com/images/Einstein-Telescope-Illustration.jpg", "publishedAt": "2024-06-16T03:23:27Z", "content": "The Einstein Telescope is being built around 250 meters underground. With interferometers in the three tunnels, each ten kilometers long, it will measure collisions of black holes in the early univer… [+12570 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung Galaxy Z Fold 6: Check out expected specs, features, more ahead of launch - HT Tech", "description": "Samsung Galaxy Z Fold 6 Check out expected specs features more ahead of launch The Samsung Galaxy Z Fold 6 is launching next month know what is expected from the new generation of foldable smartphones.  The Samsung Galaxy Z Fold 6 is expected to be announced …", "url": "https://tech.hindustantimes.com/web-stories/samsung-galaxy-z-fold-6-check-out-expected-specs-features-more-ahead-of-launch-71718437153142.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/15/1600x900/galaxy-z-fold5-highlights-accessories_1690375755406_1718437746855.jpg/", "publishedAt": "2024-06-16T01:30:21Z", "content": "Photo Credit: Samsung The Samsung Galaxy Z Fold 6 is launching next month, know what is expected from the new generation of foldable smartphones. \r\nPhoto Credit: Samsung The Samsung Galaxy Z Fold 6 i… [+1120 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Apple joins the race to find an AI icon that makes sense - TechCrunch", "description": "No one knows what AI looks like, or even is supposed to look like. It does everything, but looks like nothing.", "url": "https://techcrunch.com/2024/06/15/apple-joins-the-race-to-find-an-ai-icon-that-makes-sense/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/ai-logos-v2.jpg?resize=1200,675", "publishedAt": "2024-06-15T18:01:00Z", "content": "This week was an exciting one for the AI community, as Apple joined Google, OpenAI, Anthropic, Meta and others in the long-running competition to find an icon that even remotely suggests AI to users.… [+6035 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Flares” and “Echoes” – Unveiling the Monster Black Hole at Our Galaxy's Core - SciTechDaily", "description": "Michigan State University researchers have made important discoveries about the supermassive black hole at our galaxy's center, presenting their findings based on NuSTAR X-ray data. Researchers led by Shuo Zhang have presented new findings that will help scie…", "url": "https://scitechdaily.com/flares-and-echoes-unveiling-the-monster-black-hole-at-our-galaxys-core/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Flare-From-Sagittarius-A.jpg", "publishedAt": "2024-06-15T15:06:53Z", "content": "Michigan State University researcher Grace Sanger-Johnson found nine previously undiscovered X-ray flares from Sagittarius A*, the Milky Way’s central supermassive black hole, by sifting through a de… [+6522 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "How much does ChatGPT cost? Everything you need to know about OpenAI's pricing plans - TechCrunch", "description": "How much does it cost to use OpenAI's ChatGPT? Do you even need a subscription? Our comprehensive article dives in.", "url": "https://techcrunch.com/2024/06/15/how-much-does-chatgpt-cost-everything-you-need-to-know-about-openais-pricing-plans/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/05/OpenAI-and-ChatGPT.jpeg?resize=1200,676", "publishedAt": "2024-06-15T15:00:00Z", "content": "OpenAI’s AI-powered chatbot platform ChatGPT keeps expanding with new features. It now offers a store the GPT Store for AI-powered applications and services. The recently introduced memories feature … [+5661 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Marina Temkin", "title": "Tempus rises 9% on the first day of trading, demonstrating investor appetite for a health tech with a promise of AI - TechCrunch", "description": "Tempus, a genomic testing and data analysis company started by Eric Lefkofsky, who previously founded Groupon, debuted on Nasdaq on Friday, rising about", "url": "https://techcrunch.com/2024/06/14/tempus-soars-15-on-the-first-day-of-trading-demonstrating-investor-appetite-for-a-health-tech-with-a-promise-of-ai/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/05/Eric-Lefkofsky-1.jpg?resize=1200,800", "publishedAt": "2024-06-14T19:29:26Z", "content": "Tempus, a genomic testing and data analysis company started by Eric Lefkofsky, who previously founded Groupon, debuted on Nasdaq on Friday, rising about 15% on the opening. \r\nThe company priced its I… [+2150 chars]"}]}