{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Pranav Dixit", "title": "Big Tech and finance companies are telling H-1B employees to get to the US in under 24 hours - Business Insider", "description": "Amazon, Microsoft, JPMorgan, and Meta employees on H-1B visas were told to stay put, per employees and communications reviewed by Business Insider.", "url": "https://www.businessinsider.com/big-tech-employees-h-1b-visa-travel-return-trump-eo-2025-9", "urlToImage": "https://i.insider.com/68ce4c03183847aa39d72ceb?width=1200&format=jpeg", "publishedAt": "2025-09-20T07:09:00Z", "content": "Employees at major tech and financial companies on H-1B visas were told to stay in the US following President Donald Trump's surprise executive order that makes it far more expensive and potentially … [+3986 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Kyle Barr", "title": "Would You Use a Mouse With a Fake ‘Click?’ - Gizmodo", "description": "Logitech’s new ultra-customizable gamer mouse doesn't feel like anything else.", "url": "https://gizmodo.com/would-you-use-a-mouse-with-a-fake-click-2000660238", "urlToImage": "https://gizmodo.com/app/uploads/2025/09/Logitech-G-Pro-X2-Superstrike-1-1-1200x675.jpg", "publishedAt": "2025-09-19T14:03:56Z", "content": "Logitechs race to offer an esports mouse with the fastest response time has led us to a mouse that’s completely different than any I’ve used before. Mice have relied on the same type of microswitches… [+3678 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA’s Deep Space Communications Demo Exceeds Project Expectations - NASA Jet Propulsion Laboratory (JPL) (.gov)", "description": "The project has exceeded all of its technical goals after two years, setting up the foundations of high-speed communications for NASA’s future human missions to Mars.", "url": "https://www.jpl.nasa.gov/news/nasas-deep-space-communications-demo-exceeds-project-expectations/", "urlToImage": "https://d2pn8kiwq2w21t.cloudfront.net/original_images/1_PIA26662_DSC4667-Enhanced-NR.jpg", "publishedAt": "2025-09-18T19:48:50Z", "content": "Both Psyche and Earth are moving through space at tremendous speeds, and they are so distant from each other that the laser signal which travels at the speed of light can take several minutes to reac… [+3153 chars]"}]}