{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "India's Asmi Jain wins Apple Swift Student challenge with healthcare app - HT Tech", "description": "Apple has announced the winners of its Swift Student challenge. Among the winners, Asmi Jain from India has built a healthcare app that can help users strengthen their eye muscles.", "url": "https://tech.hindustantimes.com/tech/news/indias-asmi-jain-wins-apple-swift-student-challenge-with-healthcare-app-71685521964765.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/31/1600x900/WWDC_swift_challenge_1685523072440_1685523080743.jpg", "publishedAt": "2023-05-31T08:53:36Z", "content": "As part of Apple's yearly tradition, during its Worldwide Developers Conference (WWDC), it issues a challenge to students across the globe to create an original app playground using the Swift coding … [+1938 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 31 May 2023: The history of our Universe - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is the computer simulation of our Universe as it developed throughout history.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-31-may-2023-the-history-of-our-universe-71685519900855.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/31/1600x900/Untitled_design_1685520170254_1685520175262.jpg", "publishedAt": "2023-05-31T08:04:15Z", "content": "The Universe is around 13.8 billion years old, although the exact age remains unknown. But how do experts calculate the age? According to NASA, astronomers can calculate the age of the Universe by lo… [+2059 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid 2012 KP24 on its way for close encounter with Earth, says NASA - HT Tech", "description": "A house-sized asteroid is hurtling towards Earth and could make a close approach as soon as today. NASA has revealed its details such as speed, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2012-kp24-on-its-way-for-close-encounter-with-earth-says-nasa-71685507896387.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/31/1600x900/space-1728186_640_1685508037976_1685508045492.jpg", "publishedAt": "2023-05-31T04:41:13Z", "content": "Did you know that scientists study asteroids to learn more about the early solar system and the conditions that existed when the planets were forming? Asteroids can also provide valuable resources su… [+2259 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Erin Hale", "title": "AI poses ‘risk of extinction’, tech CEOs warn - Al Jazeera English", "description": "Warning follows open letter earlier this year that called for a six-month pause on AI development.", "url": "https://www.aljazeera.com/economy/2023/5/31/ai-poses-risk-of-extinction-tech-ceos-warn", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/04/2023-04-25T170403Z_687053410_RC2K7Z9LSK5U_RTRMADP_3_USA-AI-DISCRIMINATION-1682494232.jpg?resize=1920%2C1440", "publishedAt": "2023-05-31T04:02:53Z", "content": "Taipei, Taiwan Artificial intelligence poses a risk of extinction that calls for global action, leading computer scientists and technologists have warned.\r\nMitigating the risk of extinction from AI s… [+2570 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Detects 6000-Mile Water Plume Jetting From Saturn's Moon Enceladus - SciTechDaily", "description": "Interaction between moon’s plumes and Saturn’s ring system explored with Webb Enceladus—a tiny, icy moon of Saturn—is one of the most intriguing objects in the search for signs of life beyond our own planet. Under a crust of ice lies a global ocean of salty w…", "url": "https://scitechdaily.com/webb-space-telescope-detects-6000-mile-water-plume-jetting-from-saturns-moon-enceladus/", "urlToImage": "https://scitechdaily.com/images/Cassini-Flying-Through-Plumes-on-Enceladus.jpg", "publishedAt": "2023-05-31T03:13:11Z", "content": "BySpace Telescope Science InstituteMay 30, 2023\r\nArtists impression of the Cassini spacecraft flying through plumes erupting from the south pole of Saturns moon Enceladus. These plumes are much like … [+12425 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Justin Jackson", "title": "Study finds Neanderthals manufactured synthetic material with underground distillation - Phys.org", "description": "Researchers at the Eberhard Karls University of Tübingen and colleagues in Germany have taken a closer look at the birch tar used to affix Neanderthal tools and found a much more complex technique for creating the adhesive than previously considered.", "url": "https://phys.org/news/2023-05-neanderthals-synthetic-material-underground-distillation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/neanderthals-manufactu.jpg", "publishedAt": "2023-05-30T15:30:01Z", "content": "Researchers at the Eberhard Karls University of Tübingen and colleagues in Germany have taken a closer look at the birch tar used to affix Neanderthal tools and found a much more complex technique fo… [+4549 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Computex 2023: From NVIDIA AI Supercomputer to MSI laptops, check highlights - HT Tech", "description": "From the NVIDIA Supercomputer to Acer and MSI laptops, there was a lot on show during Day 1 of Computex 2023. Check out the 5 major announcements during the first day of the world’s largest PC and technology expo.", "url": "https://tech.hindustantimes.com/tech/news/computex-2023-from-nvidia-ai-supercomputer-to-msi-laptops-check-highlights-71685452903626.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/30/1600x900/TAIWAN-COMPUTEX-18_1685453005894_1685453026738.jpg", "publishedAt": "2023-05-30T13:24:13Z", "content": "Computex 2023, one of the world's largest computer and technology expos, kicked off today, May 30. After a three-year online-only show, the event is back to its in-person format this time around. Tak… [+2216 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study: Even Mild COVID-19 Can Have Long-Term Detrimental Effects on Heart Health - SciTechDaily", "description": "A groundbreaking study conducted a comparison of arterial stiffness between participants before and after contracting COVID-19. New research indicates that even mild instances of COVID-19 can lead to lasting harm to cardiovascular health. The study is the fir…", "url": "https://scitechdaily.com/new-study-even-mild-covid-19-can-have-long-term-detrimental-effects-on-heart-health/", "urlToImage": "https://scitechdaily.com/images/COVID-19-Omicron-Mutation.jpg", "publishedAt": "2023-05-30T03:16:31Z", "content": "ByUniversity of PortsmouthMay 29, 2023\r\nA recent study has found that even mild cases of COVID-19 can have lasting negative effects on cardiovascular health.\r\nA groundbreaking study conducted a compa… [+5153 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Genes Don't Lie: DNA Reveals a New Twist in Human Origin Story - SciTechDaily", "description": "Contemporary DNA evidence suggests that humans emerged from the interaction of multiple populations living across the continent. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations acros…", "url": "https://scitechdaily.com/genes-dont-lie-dna-reveals-a-new-twist-in-human-origin-story/", "urlToImage": "https://scitechdaily.com/images/DNA-Human-Origins.jpg", "publishedAt": "2023-05-29T21:33:28Z", "content": "ByMcGill UniversityMay 29, 2023\r\nA study published in the journal Nature has proposed a new model for human evolution, asserting that modern Homo sapiens stemmed from multiple genetically diverse pop… [+4847 chars]"}]}