{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Semafor.com"}, "author": "Reed Albergotti", "title": "Exclusive / White House floats compromise with China to export Nvidia H200 chips - https-//www.semafor.com", "description": "The decision will open up a huge market for the chipmaker while ensuring US technology remains the standard worldwide.", "url": "https://www.semafor.com/article/12/09/2025/trump-says-nvidia-can-sell-h200-ai-chips-to-china", "urlToImage": "https://img.semafor.com/330e3915449ed752b3c834eda9d1fc53d2373ccd-6500x4326.jpg?rect=0,457,6500,3413&w=1200&h=630&q=75&auto=format", "publishedAt": "2025-12-09T09:52:00Z", "content": "US President Donald Trump on Monday announced that Nvidia will be allowed to sell its powerful H200 chips to China as first reported by Semafor in exchange for a 25% surcharge, a move that will open … [+1565 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Google’s AI try-on app Doppl adds a shoppable discovery feed - TechCrunch", "description": "The tech giant says the idea behind the new feed is to display recommendations so users can discover and virtually try on items. Nearly everything in the feed is shoppable, with direct links to merchants.", "url": "https://techcrunch.com/2025/12/08/googles-ai-try-on-app-doppl-adds-a-shoppable-discovery-feed/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/12/doppl.png?resize=1200,665", "publishedAt": "2025-12-08T21:29:03Z", "content": "Google announced on Monday that it’s introducing a shoppable discovery feed in Doppl, its experimental app that uses AI to visualize how different outfits might look on you.\r\nThe tech giant says the … [+1774 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": "Mara Johnson-Groh, Simons Foundation", "title": "Scientists Finally Explain Mysterious “Impossible” Merger of Two Massive Black Holes - SciTechDaily", "description": "A detailed suite of simulations conducted by astrophysicists at the Flatiron Institute and their collaborators showed that magnetic fields can produce black holes with masses that were previously believed to be mostly unattainable. In 2023, astronomers record…", "url": "https://scitechdaily.com/scientists-finally-explain-mysterious-impossible-merger-of-two-massive-black-holes/", "urlToImage": "https://scitechdaily.com/images/Two-Black-Holes-Binary-Merger.jpg", "publishedAt": "2025-12-07T22:11:02Z", "content": "Astronomers have finally uncovered a surprising mechanism behind a record-setting black hole collision detected in 2023, revealing that powerful magnetic fields may shape the birth and spin of unusua… [+7321 chars]"}]}