{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 images of black holes and galaxies captured by NASA Hubble Space Telescope - HT Tech", "description": "5 images of black holes and galaxies captured by NASA Hubble Space Telescope Check out the images of supermassive black holes captured by the powerful NASAs Hubble Space Telescope Experts reported that our Milky Way consists of over 100 million black holes ho…", "url": "https://tech.hindustantimes.com/web-stories/5-images-of-black-holes-and-galaxies-captured-by-nasa-hubble-space-telescope-71720060160120.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/04/1600x900/heic1507b_1720062789587_1720062793887.jpg/", "publishedAt": "2024-07-03T21:43:18Z", "content": "Photo Credit: Pixabay Check out the images of supermassive black holes captured by the powerful NASAs Hubble Space Telescope \r\nPhoto Credit: Pixabay Experts reported that our Milky Way consists of ov… [+1461 chars]"}, {"source": {"id": null, "name": "Techtarget.com"}, "author": "Will Kelly", "title": "A short guide to managing generative AI hallucinations - TechTarget", "description": "Generative AI hallucinations cause major problems in the enterprise. Mitigation strategies like retrieval-augmented generation, data validation and continuous monitoring can help.", "url": "https://www.techtarget.com/searchenterpriseai/tip/A-short-guide-to-managing-generative-AI-hallucinations", "urlToImage": "https://cdn.ttgtmedia.com/rms/onlineimages/arvr_g1226063726.jpg", "publishedAt": "2024-07-02T21:26:41Z", "content": "Generative AI systems occasionally produce false or misleading information, a phenomenon known as hallucination. This issue is becoming more significant as enterprises increasingly rely on AI for the… [+6163 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Figma disables its AI design feature that appeared to be ripping off Apple's Weather app - TechCrunch", "description": "The Make Design feature is available within Figma's software and will generate UI (user interface) layouts and components from text prompts.", "url": "https://techcrunch.com/2024/07/02/figma-disables-its-ai-design-feature-that-appeared-to-be-ripping-off-apples-weather-app/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/10/TechCrunch-Disrupt-Haje-Kamps-777.jpg?resize=1200,800", "publishedAt": "2024-07-02T14:48:20Z", "content": "Figma CEO Dylan Field says the company will temporarily disable its “Make Design” AI feature that was said to be ripping off the designs of Apple’s own Weather app. The problem was first spotted by A… [+3589 chars]"}]}