{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's astronauts aboard International Space Station set to return to Earth on SpaceX Dragon - HT Tech", "description": "NASA's Crew 7, after a six-month stint on the International Space Station (ISS), is gearing up to return to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasas-astronauts-aboard-international-space-station-set-to-return-to-earth-on-spacex-dragon-71710078806646.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/10/1600x900/Ukraine-Tensions-Space-3_1645814351869_1710079067470.jpg", "publishedAt": "2024-03-10T13:59:09Z", "content": "NASA's Crew 7 mission is poised to conclude its six-month residency aboard the International Space Station (ISS), with seven astronauts preparing to return to Earth. Throughout their extended stay, t… [+2312 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Historic Discovery: The Farthest Active Supermassive Black Hole Ever Found - SciTechDaily", "description": "The enigmatic galaxy GN-z11 is one of the youngest ever observed. Delivering on its promise to transform our understanding of the early universe, the James Webb Space Telescope is probing galaxies near the dawn of time. One of these is the exceptionally lumin…", "url": "https://scitechdaily.com/webbs-historic-discovery-the-farthest-active-supermassive-black-hole-ever-found/", "urlToImage": "https://scitechdaily.com/images/Wispy-Galaxy-Concept.jpg", "publishedAt": "2024-03-10T10:34:08Z", "content": "Researchers using the James Webb Space Telescope have made groundbreaking discoveries in galaxy GN-z11, which is one of the most distant and luminous galaxies known. They identified a supermassive bl… [+5930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Tech News of the week: Smartphone launch spree, Apple-Epic Games battle, and more - The Indian Express", "description": "Tech News of the week (Second week of March 2024): The first week of March was pretty busy in the world of smartphones, with new devices launching almost every day.", "url": "https://indianexpress.com/article/technology/tech-news-technology/tech-news-of-the-week-2-march-apple-meta-epic-games-9206002/", "urlToImage": "https://images.indianexpress.com/2024/03/apple-macbook-air-m3_18fba5.jpg", "publishedAt": "2024-03-10T07:33:22Z", "content": "Last week, we witnessed the launch of over five new smartphones in India, including the Xiaomi 14 Ultra, the first smartphone from the company that costs almost a lakh rupees. Similarly, Vivo also in… [+622 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Apple terminates Epic’s account, Meta platforms get knocked offline and former Twitter execs sue Elon Musk - TechCrunch", "description": "In this edition of TC's Week in Review (WiR) newsletter, we cover Apple terminating Epic's dev account, former Twitter execs suing Elon Musk and more.", "url": "https://techcrunch.com/2024/03/09/apple-terminates-epics-account-meta-platforms-get-knocked-offline-and-former-twitter-execs-sue-elon-musk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/fortnite-epic-games.jpg?w=1024", "publishedAt": "2024-03-09T21:15:56Z", "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunchs newsletter covering all of — or at least the bulk of! — noteworthy happenings around the tech-o-sphere.\r\nThis week, Roku played hardball with … [+3625 chars]"}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}]}