{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Opposites Attract, Likes Repel? Scientists Overturn Fundamental Principle of Physics - SciTechDaily", "description": "\"Opposites charges attract; like charges repel\" is a fundamental principle of basic physics. However, a new study from Oxford University, recently published in the journal Nature Nanotechnology, has demonstrated that similarly charged particles in solution ca…", "url": "https://scitechdaily.com/opposites-attract-likes-repel-scientists-overturn-fundamental-principle-of-physics/", "urlToImage": "https://scitechdaily.com/images/Hexagonal-Cluster-Formation-scaled.jpg", "publishedAt": "2024-03-09T23:01:57Z", "content": "A new study has overturned a fundamental principle of physics by demonstrating that similarly charged particles can attract each other in a solution, with the effect varying between positive and nega… [+4247 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Apple terminates Epic’s account, Meta platforms get knocked offline and former Twitter execs sue Elon Musk - TechCrunch", "description": "In this edition of TC's Week in Review (WiR) newsletter, we cover Apple terminating Epic's dev account, former Twitter execs suing Elon Musk and more.", "url": "https://techcrunch.com/2024/03/09/apple-terminates-epics-account-meta-platforms-get-knocked-offline-and-former-twitter-execs-sue-elon-musk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/fortnite-epic-games.jpg?w=1024", "publishedAt": "2024-03-09T21:15:56Z", "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunchs newsletter covering all of — or at least the bulk of! — noteworthy happenings around the tech-o-sphere.\r\nThis week, Roku played hardball with … [+3625 chars]"}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}]}