{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Deadline"}, "author": "Armando Tinoco", "title": "Former Yahoo CEO Marissa Mayer Regrets Buying Tumblr Instead Of Netflix Or Hulu As It “Would Have Been A Better Acquisition” - Deadline", "description": "Marissa Mayer, the former CEO of Yahoo, is recalling her time at the tech company and opening up about some regrets. During Mayer’s tenure at the top of Yahoo, the company bought the microblo…", "url": "https://deadline.com/2023/05/former-yahoo-ceo-marissa-mayer-regrets-buying-tumblr-instead-netflix-hulu-would-have-been-a-better-acquisition-1235358501/", "urlToImage": "https://deadline.com/wp-content/uploads/2023/05/marissa-mayer-yahoo-tumblr.jpg?w=1024", "publishedAt": "2023-05-07T00:58:00Z", "content": "Marissa Mayer, the former CEO of Yahoo, is recalling her time at the tech company and opening up about some regrets.\r\nDuring Mayer’s tenure at the top of Yahoo, the company bought the microblogging p… [+1419 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for May 7 released; Check rewards and freebies to claim today - HT Tech", "description": "The latest set of Garena Free Fire MAX redeem codes are out and can help you win several in-game items for free. Here is all you need to know.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-may-7-released-check-rewards-and-freebies-to-claim-today-71683420307721.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/005_1627814162698_1683420683617.jpg", "publishedAt": "2023-05-07T00:51:59Z", "content": "Garena Free Fire MAX redeem codes for May 7, 2023: Want rewards? There are two ways to claim the same. Garena Free Fire Max players can either participate in the latest events or can simply use the r… [+2367 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nanoscale Breakthrough – A Single-Molecule Valve - SciTechDaily", "description": "A revolutionary paradigm shift that will transform chemical and biochemical synthesis is on the horizon. The scientific community envisions utilizing minute molecules as foundational elements to construct objects, similar to how we assemble things with mechan…", "url": "https://scitechdaily.com/nanoscale-breakthrough-a-single-molecule-valve/", "urlToImage": "https://scitechdaily.com/images/Revolutionary-Nanovalve-Enables-Active-Control-of-Single-Molecule-Flows.jpg", "publishedAt": "2023-05-06T22:39:10Z", "content": "Schematic drawing of the working principle of the single-molecule valve. Credit: Yan Xu, Osaka Metropolitan University\r\nA revolutionary paradigm shift that will transform chemical and biochemical syn… [+3274 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unearthing the Amazon's Dark Secret: How Ancient Soil Can Boost Forest Restoration Across the Globe - SciTechDaily", "description": "Adding Amazonian dark earth to soils boosts plant growth, shows study. Adding Amazonian dark earth (ADE) to soils can significantly boost plant growth, according to a study by Brazilian scientists published in Frontiers in Soil Science. ADE, also known as ter…", "url": "https://scitechdaily.com/unearthing-the-amazons-dark-secret-how-ancient-soil-can-boost-forest-restoration-across-the-globe/", "urlToImage": "https://scitechdaily.com/images/Amazonian-Dark-Earth.jpg", "publishedAt": "2023-05-06T20:26:12Z", "content": "ByFrontiersMay 6, 2023\r\nAmazonian dark earth (ADE) soil profile. Note that there is a black and a yellow layer. ADE corresponds only to the black layer. Credit: Luís Felipe Guandalin Zagatto\r\nAdding … [+7910 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "It's clear Bengaluru wants BJP, says Modi after 26-km road show in tech capital - Economic Times", "description": "Tens of thousands of people thronged the streets, throwing flowers and greeting the PM as the motorcade passed through the streets of about a dozen assembly constituencies.", "url": "https://economictimes.indiatimes.com/news/elections/assembly-elections/karnataka/its-clear-bengaluru-wants-bjp-says-modi-after-26-km-road-show-in-tech-capital/articleshow/100039477.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100039462,width-1070,height-580,imgsize-147468,overlay-economictimes/photo.jpg", "publishedAt": "2023-05-06T14:08:00Z", "content": "Prime Minister Narendra Modi held a mega road show in Bengaluru on Saturday travelling a distance of 26-km in an open vehicle, leading the BJP's efforts to turn in a stellar show in the city with 28 … [+2421 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "NASA Alert! Asteroid heading towards Earth at great pace - HT Tech", "description": "NASA Alert Asteroid heading towards Earth at great pace A massive Asteroid is racing towards Earth and it is set to come mighty close reveals NASA. The Asteroid that is racing towards a close encounter with Earth is290foot wide. NASA has warned about the giga…", "url": "https://tech.hindustantimes.com/web-stories/nasa-alert-asteroid-heading-towards-earth-at-great-pace-71683371881870.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/06/1600x900/asteroids-101766_1683372320831_1683372513685.jpg/", "publishedAt": "2023-05-06T11:29:11Z", "content": "Photo Credit: Pixabay\r\n A massive Asteroid is racing towards Earth and it is set to come mighty close, reveals NASA. The Asteroid that is racing towards a close encounter with Earth is 290-foot wide.… [+1142 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Boost: Special Omega-3 Fatty Acid Lipid's Key Role in Aging Uncovered - SciTechDaily", "description": "Researchers have discovered that the transporter protein Mfsd2a is critical for regulating brain cells that maintain myelin sheaths, which protect nerves. This discovery could help reduce the effects of aging on the brain and lead to therapies for neurologica…", "url": "https://scitechdaily.com/brain-boost-special-omega-3-fatty-acid-lipids-key-role-in-aging-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-With-Myelinated-Axons.jpg", "publishedAt": "2023-05-06T10:38:59Z", "content": "ByDuke-NUS Medical SchoolMay 6, 2023\r\nThe developing preclinical models brain with myelinated axons (shown in green color). Scientists from Singapore have discovered the crucial role of a transporter… [+6250 chars]"}, {"source": {"id": null, "name": "NASASpaceflight.com"}, "author": "Haygen Warren", "title": "With help from NEOWISE, astronomers observe giant star destroying planet for the first time - NASASpaceFlight.com - NASASpaceflight.com", "description": "Using the California Institute of Technology’s (Caltech) Zwicky Transient Facility (ZTF) and NASA’s Near-Earth Object…", "url": "https://www.nasaspaceflight.com/2023/05/star-destroys-planet/", "urlToImage": "https://www.nasaspaceflight.com/wp-content/uploads/2023/05/1-star-eats-planet-16.jpg", "publishedAt": "2023-05-06T08:30:01Z", "content": "12Using the California Institute of Technology’s (Caltech) Zwicky Transient Facility (ZTF) and NASA’s Near-Earth Object Wide Field Infrared Survey Explorer (NEOWISE) observatory, a group of scientist… [+6819 chars]"}]}