{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:15:13Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "Marcos says release of health workers' COVID-19 allowances to continue - Philstar.com", "description": "Marcos did not extend the state of calamity declaration because, according to him, the country was “not in a state of calamity anymore, technically speaking.”", "url": "https://www.philstar.com/headlines/2023/01/31/2241811/marcos-says-release-health-workers-covid-19-allowances-continue", "urlToImage": "https://media.philstar.com/photos/2023/02/01/medical-workers2020-04-2218-00-56-2_2023-02-01_16-30-04.jpg", "publishedAt": "2023-02-01T08:32:27Z", "content": "MANILA, Philippines — Healthcare workers will continue to receive allowances even after the expiration of the state of calamity over COVID-19 in the country, President Ferdinand Marcos Jr. said on We… [+1480 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Focused ultrasound technique leads to release of neurodegenerative disorders biomarkers - EurekAlert", "description": "New research from Washington University in St. Louis found that using focused-ultrasound-mediated liquid biopsy in a mouse model released more tau proteins and another biomarker into the blood than without the intervention. This noninvasive method could facil…", "url": "https://www.eurekalert.org/news-releases/977998", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/3b743428-820e-442d-b5d2-f37b8467d1af/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-01T02:01:39Z", "content": "image: Hong Chen and her collaborators found that using focused-ultrasound-mediated liquid biopsy in a mouse model released more tau proteins and another biomarker for neurodegenerative disorders int… [+5584 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UCF researchers uncover key mechanisms for sustainable ammonia production - EurekAlert", "description": "A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing sustainable fertilizer research and thus aiding global food safety efforts.\nAmmonia, a…", "url": "https://www.eurekalert.org/news-releases/978297", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-31T19:54:28Z", "content": "ORLANDO, Jan. 31, 2022 — A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing s… [+4796 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "ChromeOS and Microsoft 365 will start playing nicer with each other this year - Ars Technica", "description": "Microsoft and Google balance working together and competing with one another.", "url": "https://arstechnica.com/gadgets/2023/01/chromeos-and-microsoft-365-will-start-playing-nicer-with-each-other-this-year/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/01/chrome-microsoft365-760x380.png", "publishedAt": "2023-01-31T18:40:50Z", "content": "Enlarge/ ChromeOS will feature better OneDrive and Microsoft 365 support \"later this year.\"\r\n16 with 0 posters participating\r\nGoogle and Microsoft don't always take pains to make sure their products … [+2036 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ogaga Ariemu", "title": "Google unveils first startup accelerator for African women entrepreneurs - Daily Post Nigeria", "description": "Global tech giant Google on Tuesday launched a programme that would provide resources and opportunities for women founders in Africa. The programme is tagged “First Google for Startups Accelerator: Women Founders in Africa” and will facilitate women's inclusi…", "url": "https://dailypost.ng/2023/01/31/google-unveils-first-startup-accelerator-for-african-women-entrepreneurs/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/06/jpg.jpeg", "publishedAt": "2023-01-31T17:07:31Z", "content": "Global tech giant Google on Tuesday launched a programme that would provide resources and opportunities for women founders in Africa.\r\nThe programme is tagged First Google for Startups Accelerator: W… [+2491 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "These 74 Huawei devices installed HarmonyOS 3 [List] - HC Newsroom", "description": "Today, Huawei shared details about 74 devices that installed HarmonyOS 3 operating system via OTA update. On the other hand, the tech maker also shared a lineup of models that will grab this major software version in 2023. As of January 31, 2023, Huawei has u…", "url": "https://www.huaweicentral.com/these-74-huawei-devices-installed-harmonyos-3-list/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2023/01/HarmonyOS-3-phone-image-1000x576.jpg", "publishedAt": "2023-01-31T15:41:25Z", "content": "Today, Huawei shared details about 74 devices that installed HarmonyOS 3 operating system via OTA update. On the other hand, the tech maker also shared a lineup of models that will grab this major so… [+3209 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "Singapore researchers use old drug as new leukemia treatment - Labiotech.eu", "description": "A team of researchers in Singapore has revisited an existing drug to combat a type of blood cancer, T-cell acute lymphoblastic leukemia.", "url": "https://www.labiotech.eu/trends-news/singapore-researchers-old-drug-new-leukemia-treatment/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2023/01/shutterstock-738913009.jpg", "publishedAt": "2023-01-31T09:56:38Z", "content": "A team of researchers from the Cancer Science Institute of Singapore (CSI Singapore) at the National University of Singapore, has revisited an existing drug to combat a type of blood cancer called T-… [+3894 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "Acer Nitro VG240YE & VG270E monitors Malaysia release - up to a 100Hz FHD IPS and more - TechNave", "description": "Today,&nbsp;Acer Malaysia&nbsp;just announced the arrival of the&nbsp;Nitro VG240YE&nbsp;and&nbsp;Nitro VG270E&nbsp;monitors. The prices are RM459 and RM549 res", "url": "https://technave.com/gadget/Acer-Nitro-VG240YE-VG270E-monitors-Malaysia-release-up-to-a-100Hz-FHD-IPS-and-more-33304.html", "urlToImage": "https://technave.com/data/files/article/202301310822444332.jpg", "publishedAt": "2023-01-31T08:26:49Z", "content": "Today, Acer Malaysia just announced the arrival of the Nitro VG240YE and Nitro VG270E monitors. The prices are RM459 and RM549 respectively and are available on the Acer eStore, as well as the Acer o… [+892 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Tragic Toll: COVID-19 Is a Leading Cause of Death in Children and Young People in the U.S. - SciTechDaily", "description": "Between August 2021 and July 2022, COVID-19 was a leading cause of death in children and young people in the US, ranking eighth overall. COVID-19 was the top cause of death in children from an infectious disease, in the same period. Deaths in children from CO…", "url": "https://scitechdaily.com/the-tragic-toll-covid-19-is-a-leading-cause-of-death-in-children-and-young-people-in-the-u-s/", "urlToImage": "https://scitechdaily.com/images/COVID-19-Deaths-Timeseries.png", "publishedAt": "2023-01-31T03:32:40Z", "content": "ByUniversity of OxfordJanuary 30, 2023\r\nMonthly number of deaths in the US of children and young people (aged 0-19), where COVID-19 was listed as the cause of death on the death certificate. Credit: … [+9187 chars]"}]}