{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fourier Transformations Reveal How AI Learns Complex Physics - SciTechDaily", "description": "Scientific AI’s “Black Box” Is No Match for 200-Year-Old Method Fourier transformations reveal how deep neural network learns complex physics. One of the oldest tools in computational physics — a 200-year-old mathematical technique known as Fourier analysis —…", "url": "https://scitechdaily.com/?p=254417", "urlToImage": "https://scitechdaily.com/images/Android-Robot-AI-Concept.jpg", "publishedAt": "2023-03-21T00:23:29Z", "content": "ByRice UniversityMarch 20, 2023\r\nA new study has found that Fourier analysis, a mathematical technique that has been around for 200 years, can be used to reveal important information about how deep n… [+9625 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DART VADAR harnesses the force of enzymes for better RNA drugs: New, easy-to-design RNA-based sensor can detect and automatically respond to molecular triggers within cells - Science Daily", "description": "Gene therapy has been heralded as the new frontier of medicine, but there are still many limitations to current technologies; among them, how to deliver therapeutic genes to specific cells, and only activate them in the right context. A team has created a new…", "url": "https://www.sciencedaily.com/releases/2023/03/230320101933.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-03-20T16:02:07Z", "content": "More than twelve billion doses of mRNA vaccines have been administered globally since the start of the COVID pandemic, saving millions of lives. But RNA-based therapies for other diseases have so far… [+9973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deep Impact: Heat Waves Happen at the Bottom of the Ocean Too - SciTechDaily", "description": "First assessment of bottom marine heat waves opens a window on the deep. The 2013-2016 marine heat wave known as “The Blob” warmed a vast expanse of surface waters across the northeastern Pacific, disrupting West Coast marine ecosystems, depressing salmon ret…", "url": "https://scitechdaily.com/deep-impact-heat-waves-happen-at-the-bottom-of-the-ocean-too/", "urlToImage": "https://scitechdaily.com/images/Bathymetric-Features-Western-Atlantic-Ocean-Basin.jpg", "publishedAt": "2023-03-20T12:33:39Z", "content": "ByNational Oceanic and Atmospheric Administration (NOAA)March 20, 2023\r\nThis visualization depicts bathymetric features of the western Atlantic Ocean Basin, including the continental shelf, captured … [+9286 chars]"}]}