{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "The latest Samsung Galaxy Ring leak hints at an eye-watering price – and the next model could get a display - TechRadar", "description": "Samsung's smart ring might already be evolving", "url": "https://www.techradar.com/health-fitness/the-latest-samsung-galaxy-ring-leak-hints-at-an-eye-watering-price-and-the-next-model-could-get-a-display", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mW2LUfhjZJc9uQ2WWTwGyS-1200-80.jpg", "publishedAt": "2024-07-05T10:12:52Z", "content": "Having been teased in January and again in February, the Samsung Galaxy Ring will get its full launch on July 10, when we'll hear all the details about it. Those details should include a price – and … [+2261 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Last Stand of the Woolly Mammoths: Secrets of Survival and Mysterious Extinction on Wrangel Island - SciTechDaily", "description": "Genetic analysis of the last woolly mammoths on Wrangel Island has revealed a population that managed to survive 6,000 years despite severe inbreeding and low genetic diversity. Initially descended from no more than eight individuals, this group expanded to 2…", "url": "https://scitechdaily.com/the-last-stand-of-the-woolly-mammoths-secrets-of-survival-and-mysterious-extinction-on-wrangel-island/", "urlToImage": "https://scitechdaily.com/images/Last-Wrangel-Mammoth-scaled.jpg", "publishedAt": "2024-07-05T08:21:22Z", "content": "The woolly mammoths on Wrangel Island, derived from a very small initial population, sustained themselves for 6,000 years despite genetic hurdles. Their sudden extinction remains a mystery, providing… [+5103 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "Shayak Majumder", "title": "Weekly Tech Wrap: CMF Phone 1 Price Creates Buzz Around Rumour Mill, Google Pixel 9 Leaks Surface, More - ABP Live", "description": "From Pixel 9 rumours starting to surface a month before the anticipated launch to Threads celebrating its 1st birthday, here are the biggest tech headlines from the week that was.", "url": "https://news.abplive.com/technology/top-technology-news-july-1-7-nothing-cmf-phone-1-price-google-pixel-9-meta-threads-youtube-whatsapp-1700435", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2024/07/05/1ef3e3d7c0db396a6809cfbdd860c8091720165568956402_original.jpg?impolicy=abp_cdn&imwidth=1200", "publishedAt": "2024-07-05T07:59:21Z", "content": "Weekly Tech Wrap: CMF Phone 1 sets tech tongues wagging. YouTube and WhatsApp lead trust among newsreaders in India. The world of technology was dominated by these headlines in the week that was. Tak… [+4920 chars]"}]}