{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AHA Rates 10 Popular Diets: What's Best for Heart-Healthy Eating – And What Misses the Mark - SciTechDaily", "description": "A new American Heart Association scientific statement rates how closely several popular eating patterns align with the Association’s guidance for heart-healthy eating. A new American Heart Association scientific statement assesses and scores the heart healthi…", "url": "https://scitechdaily.com/?p=273545", "urlToImage": "https://scitechdaily.com/images/Heart-Healthy-Food.jpg", "publishedAt": "2023-05-02T12:36:39Z", "content": "ByAmerican Heart AssociationMay 2, 2023\r\nThe American Heart Associations new scientific statement assesses popular diets and their alignment with heart-healthy guidelines. Top ratings were given to t… [+17341 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Webb finds water vapor around a rocky exoplanet - Tech Explorist", "description": "Water vapor in an atmosphere on a hot rocky planet would represent a major breakthrough for exoplanet science.", "url": "https://www.techexplorist.com/webb-finds-water-vapor-around-a-rocky-exoplanet/59715/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/GJ-486-b.jpg", "publishedAt": "2023-05-02T06:25:44Z", "content": "While studying a rocky exoplanet known as GJ 486 b, NASA‘s James Webb Space Telescope- using its Webb’s Near-Infrared Spectrograph (NIRSpec)- detected signals of water vapor. GJ 486 b is too close to… [+4179 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid 2023 HV5 to come as close to Earth as the Moon! NASA issues alert - HT Tech", "description": "The asteroid will approach Earth for its closest approach tomorrow, May 3. Know all details such as speed, distance and more, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2023-hv5-to-come-as-close-to-earth-as-the-moon-nasa-issues-alert-71683002033980.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid_1683002420925_1683002421133.jpg", "publishedAt": "2023-05-02T04:40:53Z", "content": "Whenever an asteroid's orbit brings it near a planet, the planet's gravitational pull can sometimes force it to go astray. When these space rocks come near Earth for close approach, most of them burn… [+1909 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 1 May 2023: The Great Carina Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is NGC 3372, also known as the Great Carina Nebula which is located in the constellation of Carina.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-1-may-2023-the-great-carina-nebula-71682931600468.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/carina_nebula_1682931649743_1682931649948.jpg", "publishedAt": "2023-05-01T09:02:52Z", "content": "A Nebula can contain as few as ten stars or as many as millions of stars, according to NASA. Although most nebulae belong to just three types - spherical, elliptical and bipolar, some of them might b… [+1811 chars]"}]}