{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "Firstpost"}, "author": "Mehul Reuben Das, Mehul Reuben Das", "title": "NASA plans to set up ‘lunar lighthouse’ soon, to partner with private space tech companies - Firstpost", "description": "NASA is planning to set up a lunar lighthouse soon and has already started experiments. In the lead up to the landing of Intuitive Machines’ Odysseus lunar lander, NASA deployed Lunar Node-1 or LN-1 on the Moon, marking a significant step in lunar navigation …", "url": "https://www.firstpost.com/tech/nasa-plans-to-set-up-lunar-lighthouse-soon-to-partner-with-private-space-tech-companies-13749904.html", "urlToImage": "https://images.firstpost.com/uploads/2024/03/NASA-plans-to-set-up-lunar-lighthouse-soon-to-partner-with-private-space-tech-companies-2024-03-70de2d04f5a99ae1d1b19d9e8dc189ad-1200x675.jpg?im=FitAndFill=(1200,675)", "publishedAt": "2024-03-18T04:45:23Z", "content": "Navigating the lunar surface has long posed challenges for astronauts. The solution to this problem according to NASA? Build a lunar lighthouse that would help astronauts to guide their spacecraft.\r\n… [+2562 chars]"}, {"source": {"id": null, "name": "Asia Times"}, "author": "Gabriel Honrada", "title": "China building giant hypersonic railgun for space launches - Asia Times", "description": "In a hypersonic race for rapid-fire satellite-launching supremacy, China and the US are unveiling dueling futuristic technologies that could be crucial in", "url": "http://asiatimes.com/2024/03/china-building-giant-hypersonic-railgun-for-space-launches/", "urlToImage": "https://asiatimes.com/wp-content/uploads/2024/03/Spaceplane-China.jpg", "publishedAt": "2024-03-18T04:39:21Z", "content": "In a hypersonic race for rapid-fire satellite-launching supremacy, China and the US are unveiling dueling futuristic technologies that could be crucial in a war scenario where satellites are targeted… [+6922 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "140-foot asteroid to pass Earth at a close distance today, reveals NASA; Know how fast it is approaching - HT Tech", "description": "The orbit of a 140-foot asteroid is predicted to bring it to the closest point to Earth today, March 18. From size, speed to distance of approach, know all about this upcoming asteroid.", "url": "https://tech.hindustantimes.com/tech/news/140foot-asteroid-to-pass-earth-at-a-close-distance-today-reveals-nasa-know-how-fast-it-is-approaching-71710735745242.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/18/1600x900/g1b69efea58486d7510946e54_1708083615031_1710735929409.jpg", "publishedAt": "2024-03-18T04:35:36Z", "content": "Two asteroids passed Earth yesterday at the closest points in their orbit. Now, NASA has revealed that four more asteroids are expected to pass by Earth today, March 18. These space rocks often come … [+2013 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "xAI open-sources base model of Grok, but without any training code - TechCrunch", "description": "Elon Musk's xAI has open-sourced the base code of Grok AI model, but without any training code.", "url": "https://techcrunch.com/2024/03/17/xai-open-sources-base-model-of-grok-but-without-any-training-code/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/11/xAI-Grok-GettyImages-1765893916.jpeg?resize=1200,800", "publishedAt": "2024-03-18T04:07:30Z", "content": "Elon Musk’s xAI has open-sourced the base code of Grok AI model, but without any training code. The company described it as the “314 billion parameter Mixture-of-Expert model” on GitHub.\r\nIn a blog p… [+1500 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "The Conversation", "title": "Excessive Sitting Raises Risk of Early Death: Now We Know How Much - ScienceAlert", "description": "Advances in technology in recent decades have obviated the need and desire for humans to move.", "url": "https://www.sciencealert.com/excessive-sitting-raises-risk-of-early-death-now-we-know-how-much", "urlToImage": "https://www.sciencealert.com/images/2024/03/man_standing_stretching.jpg", "publishedAt": "2024-03-17T10:31:11Z", "content": "Advances in technology in recent decades have obviated the need and desire for humans to move. Many of the world's population sit for long periods throughout the day, whether in front of a computer a… [+3409 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "WhatsApp update set to enhance your experience, allow you to pin multiple chats and messages - HT Tech", "description": "WhatsApp is rolling out a new feature allowing users to pin multiple chats and messages to streamline the organization and enhance accessibility for important conversations. This WhatsApp update is available to some beta testers now.", "url": "https://tech.hindustantimes.com/tech/news/whatsapp-update-set-to-enhance-your-experience-allow-you-to-pin-multiple-chats-and-messages-71710661827725.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/17/1600x900/WhatsApp_1710662154217_1710662154419.jpg", "publishedAt": "2024-03-17T07:58:58Z", "content": "WhatsApp, under Meta's umbrella, is testingout a new feature that will allow users to pin multiple chats and messages simultaneously. This functionality is currently in the testing phase and is avail… [+1732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Leap in Material Science: Researchers Unveil AI-Powered Atomic Fabrication Technique - SciTechDaily", "description": "Researchers at the National University of Singapore (NUS) have developed an innovative method for creating carbon-based quantum materials atom by atom. This method combines the use of scanning probe microscopy with advanced deep neural networks. The achieveme…", "url": "https://scitechdaily.com/quantum-leap-in-material-science-researchers-unveil-ai-powered-atomic-fabrication-technique/", "urlToImage": "https://scitechdaily.com/images/Quantum-Material-Manufacturing.jpg", "publishedAt": "2024-03-17T05:38:15Z", "content": "This allows for precise engineering of their -electron topology and spin configurations in an automated manner, mirroring the capabilities of human chemists.very goodPlease consider:1. Can spin creat… [+4596 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extensive Research Reveals 32 Health Risks Linked to Ultra-Processed Foods - SciTechDaily", "description": "Findings underscore need for urgent research to understand how ultra-processed foods affect health and measures to target and reduce exposure. Consistent evidence shows that higher exposure to ultra-processed foods is associated with an increased risk of 32 d…", "url": "https://scitechdaily.com/extensive-research-reveals-32-health-risks-linked-to-ultra-processed-foods/", "urlToImage": "https://scitechdaily.com/images/Assorted-Unhealthy-Junk-Food.jpg", "publishedAt": "2024-03-16T13:34:33Z", "content": "A new study highlights the link between high consumption of ultra-processed foods and an increased risk of various health issues, including cancer, heart and lung diseases, mental health problems, an… [+5798 chars]"}]}