{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity's New Discovery: Ancient Riverbeds on Mars and the Potential for Life - SciTechDaily", "description": "Curiosity rover findings indicate numerous craters on Mars may have once been flowing rivers, hinting at possible ancient life conditions. New analysis of data from the Curiosity rover reveals that much of the craters on Mars today could have once been habita…", "url": "https://scitechdaily.com/curiositys-new-discovery-ancient-riverbeds-on-mars-and-the-potential-for-life/", "urlToImage": "https://scitechdaily.com/images/NASA-Curiosity-Mars-Rover-Mont-Mercou-Selfie-scaled.jpg", "publishedAt": "2023-10-26T01:54:17Z", "content": "ByPenn State UniversityOctober 25, 2023\r\nNASAs Curiosity Mars rover used two cameras to create this selfie in front of Mont Mercou, a rock outcrop that stands 20 feet (6 meters) tall. New analysis by… [+4413 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Hinduja Group aims for value creation of $35-40 bn in BFSI sector, confident of acquiring Reliance Capital by Nov-end | Mint - Mint", "description": "Ashok P. Hinduja says the group is diversifying and has plans to get into the new tech, digital and fintech as part of its new phase of growth", "url": "https://www.livemint.com/industry/banking/hinduja-group-aims-for-value-creation-of-35-40-bn-in-bfsi-sector-confident-of-acquiring-reliance-capital-by-novend-11698254764011.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/25/1600x900/hinduja_1585246646449_1698259139657.jpg", "publishedAt": "2023-10-25T18:48:12Z", "content": "Hinduja Group is aiming for a value creation of $35-40 billion in the banking, financial services, and insurance (BFSI) sector in the next five to seven years by adding more verticals to fill up the … [+2100 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "Apple Finally Released iOS 17.1 and iPadOS 17.1 With AirDrop Over Internet, Major Bug Fixes, More – Changelog - Wccftech", "description": "Apple has finally released iOS 17.1 and iPadOS 17.1 for all compatible iPhone and iPad models with new features and bug fixes.", "url": "https://wccftech.com/ios-17-1-and-ipados-17-1-released-changelog/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/10/iOS-17-Changelog-1-e1698255709678.jpg", "publishedAt": "2023-10-25T17:47:00Z", "content": "Today, Apple has seen fit to release iOS 17.1 and iPadOS 17.1 for all compatible iPhone and iPad devices. The latest update brings a plethora of new additions to the table, including AirDrop over the… [+3224 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Unraveled: Accelerating Waves and the Mysteries of Time and Relativity - SciTechDaily", "description": "Researchers have derived a new wave equation, linking wave mechanics with the general theory of relativity and the arrow of time, offering solutions to long-standing physics debates and introducing applications for novel materials. Researchers at Tampere Univ…", "url": "https://scitechdaily.com/physics-unraveled-accelerating-waves-and-the-mysteries-of-time-and-relativity/", "urlToImage": "https://scitechdaily.com/images/Artistic-Depiction-of-Exponentially-Curved-Spacetime.jpg", "publishedAt": "2023-10-25T13:11:13Z", "content": "An artistic depiction of a wave encountering an exponentially curved spacetime. Credit: Matias Koivurova, University of Eastern Finland\r\nResearchers have derived a new wave equation, linking wave mec… [+6323 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "NEWLY-LAUNCHED AMAZFIT ACTIVE AND AMAZFIT ACTIVE EDGE INTRODUCE A STYLISH WAY TO STAY ACTIVE & STAY HEALTHY - PR Newswire", "description": "/PRNewswire/ -- Amazfit, a leading global smart wearables brand owned by Zepp Health (NYSE: ZEPP), a health technology company, has today unveiled two new...", "url": "https://www.prnewswire.com/news-releases/newly-launched-amazfit-active-and-amazfit-active-edge-introduce-a-stylish-way-to-stay-active--stay-healthy-301966602.html", "urlToImage": "https://mma.prnewswire.com/media/2255723/image_1.jpg?p=facebook", "publishedAt": "2023-10-25T12:00:00Z", "content": "Tailored for the modern-day city consumer, the Amazfit Active and Amazfit Active Edge seamlessly blend style, functionality, and health, redefining what it means to live an active lifestyle.\r\nMILPITA… [+5886 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Abhishek Sahu", "title": "Maharashtra government issues notice to TCS over onboarding delay - Moneycontrol", "description": "In July, Nascent Information Technology Employees Senate (NITES) filed a complaint with the Ministry of Labour &amp; Employment highlighting the “delayed onboarding of over 200 lateral recruits by TCS”. Later, the complaint was transferred to the Maharashtra …", "url": "https://www.moneycontrol.com/news/business/maharashtra-government-issues-notice-to-tcs-over-onboarding-delay-11596271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/tcs-bbo-770x433.jpg", "publishedAt": "2023-10-25T10:20:09Z", "content": "The Ministry of Labour and Employment of Maharashtra has issued a notice to information technology major Tata Consultancy Services (TCS) over a complaint of delaying onboarding of 200 lateral recruit… [+1980 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}]}