{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jagmeet Singh", "title": "Exclusive: Google Maps is rolling out speedometer, speed limits on iPhone and CarPlay globally - TechCrunch", "description": "When people start navigation on Google Maps, the vehicle's speed is shown in miles or kilometers, depending on the region.", "url": "https://techcrunch.com/2024/07/09/google-maps-is-rolling-out-speedometer-speed-limits-on-iphone-and-carplay-globally/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/07/google-maps-speedometer-iphone.jpg?w=1200", "publishedAt": "2024-07-09T14:33:57Z", "content": "Google Maps has introduced speedometer and speed limits on iOS and CarPlay more than five years after their debut on Android to help iPhone users avoid speed ticketing while driving.\r\nTechCrunch has … [+1100 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Planetary Defense: NASA Radar Captures Two Large Asteroids Zooming Past Earth - SciTechDaily", "description": "The Deep Space Network’s Goldstone planetary radar had a busy few days observing asteroids 2024 MK and 2011 UL21 as they safely passed Earth. Researchers at NASA’s Jet Propulsion Laboratory (JPL) in Southern California recently tracked two asteroids as they f…", "url": "https://scitechdaily.com/planetary-defense-nasa-radar-captures-two-large-asteroids-zooming-past-earth/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Earth-Atmosphere-Art.jpg", "publishedAt": "2024-07-09T12:28:12Z", "content": "NASA tracked two near-Earth asteroids, capturing important data about their trajectories and physical characteristics using radar technology, which supports ongoing planetary defense efforts. (Artist… [+5852 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Technical View | Nifty at record high; may rally towards 24,520-24,600 - Moneycontrol", "description": "On the sectoral front, the information technology index ended with marginal losses, while all other sectoral indices ended in the green with auto, FMCG, healthcare, and realty up 1-2 percent.", "url": "https://www.moneycontrol.com/news/business/markets/technical-view-nifty-at-record-high-may-rally-towards-24520-24600-12765317.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/07/20240709102224_marketup_sensexup-Niftyup.jpg", "publishedAt": "2024-07-09T10:30:28Z", "content": "After closing flat for the previous three sessions, the bulls were back in action on Dalal Street with the Nifty50 index hitting a fresh all-time high amid buying across sectors.\r\nAfter a positive st… [+2039 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "From Dr. Oz to heart valves: A tiny device charted a contentious path through the FDA - CBS News", "description": "The story of MitraClip, a device Dr. Oz helped invent to treat faulty heart valves, is a cautionary tale about the science, business and regulation of medical technology.", "url": "https://www.cbsnews.com/news/mitraclip-fda-dr-mehmet-oz-heart-valve-device/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/07/08/98594f24-d4a7-4ae1-972d-775098e05c63/thumbnail/1200x630/1de47ea9d2de34aac101d9c620b648dc/mitraclip-fda-02.jpg?v=2287029998c5246c93d6dd038eb30603", "publishedAt": "2024-07-09T09:00:05Z", "content": "In 2013, the FDA approved an implantable device to treat leaky heart valves. Among its inventors was Mehmet Oz, the former television personality and former U.S. Senate candidate widely known as \"Dr.… [+13870 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Indian game firms want to distance themselves from fantasy sports - TechCrunch", "description": "For over a decade, real-money gaming companies and fantasy sports startups have marketed themselves as video game companies. But as these businesses face Indian gaming firms seek distinction from real money games to spur growth and attract investment.", "url": "https://techcrunch.com/2024/07/08/indian-game-firms-want-to-distance-themselves-from-fantasy-sports/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-1244987792.jpg?resize=1200,800", "publishedAt": "2024-07-09T03:32:36Z", "content": "For over a decade, real-money gaming companies and fantasy sports startups have marketed themselves as video game companies. But as these businesses face increasing regulatory scrutiny, a coalition o… [+3733 chars]"}]}