{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "Apple Ditches Repairability Of Its Devices In Favor Of Durability, Says It’s ‘Better For Customers To Have That Reliability’ - Wccftech", "description": "Apple stands by enhancing the durability of its iPhone and other devices, even if repairability becomes expensive and harder for users.", "url": "https://wccftech.com/apple-ditches-repairability-in-favor-of-durability/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/05/iPhone-Durability.jpg", "publishedAt": "2024-05-30T09:45:00Z", "content": "If you do not have AppleCare, it would cost you a fortune to fix the broken glass or any other component on your iPhone or other Apple products. Repairability on the iPhone has been a major concern o… [+3390 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Nithya P Nair, David Delima", "title": "Realme GT 6 India Launch Confirmed, Likely to Be a Rebranded Realme GT Neo 6 - Gadgets 360", "description": "Realme GT 6 will be the next offering from the brand, the Chinese tech company announced on Thursday (May 30). It is confirmed to be launched in India alongside other global markets. The latest announcement comes a few days after Realme unveiled its GT 6T in …", "url": "https://www.gadgets360.com/mobiles/news/realme-gt-6-india-launch-teaser-announcement-specifications-expected-5777930", "urlToImage": "https://i.gadgets360cdn.com/large/realme_gt_neo_6_1715245450576.jpg", "publishedAt": "2024-05-30T09:38:58Z", "content": "Realme GT 6 will be the next GT series smartphone to be launched in the country, according to the company. It is confirmed to be launched in global markets, including India. The latest announcement c… [+1672 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi's Shoutout As Chennai Start-Up Scripts Rocket History On 5th Try - NDTV", "description": "Agnikul Cosmos, India's private space start-up, today test-fired its rocket named Agnibaan SOrTeD (Suborbital Tech Demonstrator), which is powered by an engine that the Indian Space Research Organisation (ISRO) is still trying to master.", "url": "https://www.ndtv.com/india-news/isros-backing-dogged-will-how-chennai-start-up-scripted-rocket-history-5776205", "urlToImage": "https://c.ndtvimg.com/2024-05/6nb97148_agnikul_625x300_30_May_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08", "publishedAt": "2024-05-30T08:56:00Z", "content": "The young team of engineers from the Chennai start-up has showed remarkable patience\r\nAgnikul Cosmos, India's private space start-up, today test-fired its rocket named Agnibaan SOrTeD (Suborbital Tec… [+7362 chars]"}]}