{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "India.com"}, "author": null, "title": "LIVE Updates | IND VS WI, 3rd T20 Cricket Match Live Score: West Indies Look To Seal Series - Zee News", "description": "Zee News brings latest news from India and World on breaking news, today news headlines, politics, business, technology, bollywood, entertainment, sports and others. Find exclusive news stories on Indian politics, current affairs, cricket matches, festivals a…", "url": "https://zeenews.india.com", "urlToImage": "https://english.cdn.zeenews.com/images/logo/placeholder_image.jpg", "publishedAt": "2023-08-08T10:09:08Z", "content": "By clicking Accept All Cookies, you agree to the storing of cookies on your device and the processing of information obtained via those cookies (including about your preferences, device and online ac… [+357 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple’s genius deal will keep iPhone 15 Pro’s 3nm A17 Bionic SoC ahead of rivals - HT Tech", "description": "Apple is benefitting from a deal it had struck with chipmaker TSMC that will make the latter an exclusive supplier of the 3nm A17 Bionic chipset for the iPhone 15 Pro. A clause in the deal is now minting money for Apple.", "url": "https://tech.hindustantimes.com/mobile/news/apples-genius-deal-will-keep-iphone-15-pro-s-3nm-a17-bionic-soc-ahead-of-rivals-71691485970884.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/08/1600x900/david-svihovec-jz9zEXfuyQ8-unsplash_1678725252575_1691487029085.jpg", "publishedAt": "2023-08-08T09:33:27Z", "content": "Among many new updates and features coming to the upcoming iPhone 15 Pro, one, in particular, will make it the world's most powerful smartphone for quite some time. That tag will be given to it by it… [+2395 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "IIT scientist unearth ancient Indian dinosaur; here's what they discovered about the earliest dinosaur, Th - The Economic Times", "description": "Scientists from the Indian Institute of Technology and the Geological Survey of India have discovered a new species of long-necked dicraeosaurid dinosaur, Tharosaurus Indicus, in the Thar desert region of Jaisalmer. These ancient fragments are believed to dat…", "url": "https://economictimes.indiatimes.com/news/india/iit-scientist-unearth-ancient-indian-dinosaur-heres-what-they-discovered-about-the-earliest-dinosaur-tharosaurus-indicus/articleshow/102523489.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102523802,width-1070,height-580,imgsize-51596,overlay-economictimes/photo.jpg", "publishedAt": "2023-08-08T06:20:00Z", "content": "A team of scientists from the Indian Institute of Technology (IIT)-Roorkee and the Geological Survey of India (GSI) have journeyed back through time to unearth the enigmatic remains of an ancient, lo… [+3637 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Report: Apple buys every 3 nm chip that TSMC can make for next-gen iPhones and Macs - Ars Technica", "description": "TSMC is said to eat the cost of defective chips so it can keep Apple's business.", "url": "https://arstechnica.com/gadgets/2023/08/report-apple-is-saving-billions-on-chips-thanks-to-unique-deal-with-tsmc/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/08/waferr008_2520_hU4L_0-740x380.jpg", "publishedAt": "2023-08-07T20:35:52Z", "content": "Enlarge/ Silicon wafers from a TSMC factory.\r\n52 with \r\nIt's been rumored for several months now that Apple will be using a new 3 nm manufacturing process from Taiwan Semiconductor (TSMC) for its nex… [+3375 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Crew-7 Countdown: NASA and SpaceX Set New Launch Date - SciTechDaily", "description": "NASA and SpaceX rescheduled the Crew-7 mission launch for August 21 to allow additional launch site preparation. The mission will carry a crew of four astronauts aboard the SpaceX Dragon spacecraft, Endurance, to the International Space Station. NASA and Spac…", "url": "https://scitechdaily.com/crew-7-countdown-nasa-and-spacex-set-new-launch-date/", "urlToImage": "https://scitechdaily.com/images/NASA-Crew-7-Mission-Members-Inside-SpaceX-Hangar-X-scaled.jpg", "publishedAt": "2023-08-07T12:22:11Z", "content": "ByNASAAugust 7, 2023\r\nNASAs SpaceX Crew-7 crew in training at SpaceX before their mission to the International Space Station. Andreas Mogensen is photographed here. Credit: SpaceX\r\nNASA\r\nEstablished … [+7133 chars]"}]}