{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NPR"}, "author": "", "title": "Trump mulls semiconductor levies after lifting reciprocal tariffs on electronics - NPR", "description": "Trump targets Chinese technology with 20% fentanyl tariff and eyes semiconductors in a \"National Security Tariff Investigation\" over coming months.", "url": "https://www.npr.org/2025/04/13/g-s1-60086/semiconduct-tariffs-trump", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8640x4860+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa5%2F08%2F2ae41ef04e83ba6c851a0aa6204d%2Fap24325331205728.jpg", "publishedAt": "2025-04-13T22:23:46Z", "content": "The Trump administration is considering new semiconductor tariffs, after the White House exempted certain electronics from reciprocal tariffs.\r\n\"We are taking a look at Semiconductors and the WHOLE E… [+2406 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Matthew Burgess", "title": "Dollar Finds Support For Now as Trump Pauses Electronics Levies - Bloomberg", "description": "The dollar saw a modest reprieve from its recent rout after the US paused tariffs on popular consumer electronics, though the recovery was restrained by President Donald Trump downplaying his exemption for the technology sector.", "url": "https://www.bloomberg.com/news/articles/2025-04-13/dollar-finds-support-for-now-as-trump-pauses-electronics-levies", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iB0xJETYyjWE/v0/1200x800.jpg", "publishedAt": "2025-04-13T21:09:18Z", "content": "The dollar saw a modest reprieve from its recent rout after the US paused tariffs on popular consumer electronics, though the recovery was restrained by President Donald Trump downplaying his exempti… [+355 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Spherules on Mars: NASA’s Perseverance Rover Finds a Rock That Defies Explanation - SciTechDaily", "description": "Perseverance just stumbled upon one of Mars’ weirdest rocks yet—a formation covered in dark, spherical shapes with mysterious textures that have scientists buzzing. While similar Martian spheres have been seen before, this one, dubbed “St. Pauls Bay,” stands …", "url": "https://scitechdaily.com/shocking-spherules-on-mars-nasas-perseverance-rover-finds-a-rock-that-defies-explanation/", "urlToImage": "https://scitechdaily.com/images/St-Pauls-Bay-Target-Rock-Spherical-Objects.jpg", "publishedAt": "2025-04-13T17:01:27Z", "content": "This image from NASA’s Mars Perseverance rover, a fusion-processed SuperCam Remote Micro Imager (RMI) mosaic, shows part of the “St. Pauls Bay” target, acquired from the lower Witch Hazel Hill area o… [+4207 chars]"}]}