{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Glacial Pathfinders: Tracing North America's First Migrants via the Sea Ice Highway - SciTechDaily", "description": "New research suggests some early Americans may have traveled on winter sea ice down the coast from Beringia as long as 24,000 years ago. One of the hottest debates in archeology is how and when humans first arrived in North America. Archaeologists have tradit…", "url": "https://scitechdaily.com/glacial-pathfinders-tracing-north-americas-first-migrants-via-the-sea-ice-highway/", "urlToImage": "https://scitechdaily.com/images/People-Walking-on-Ice-Concept-Art.jpg", "publishedAt": "2023-12-17T16:24:06Z", "content": "New findings suggest early humans arrived in North America earlier than 13,000 years ago, possibly using a “sea ice highway” along the Pacific Coast. This theory, supported by paleoclimate data, chal… [+4677 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Think That Volcano Is Asleep? Think Again: Explosive Secrets Unveiled - SciTechDaily", "description": "Even in a quiet dormant phase, a volcano can rapidly become active and its eruption can pose a previously unknown threat to the surrounding area. Can a volcano erupt after tens of thousands of years of dormancy? If so, how can this be explained and what makes…", "url": "https://scitechdaily.com/think-that-volcano-is-asleep-think-again-explosive-secrets-unveiled/", "urlToImage": "https://scitechdaily.com/images/Dormant-Volcano-Explosive-Eruption-Art-Concept.jpg", "publishedAt": "2023-12-17T11:41:30Z", "content": "Researchers have studied the Ciomadul volcano to understand how long-dormant volcanoes can suddenly erupt. Their findings on the chemical and mineral composition of the magma provide valuable insight… [+6970 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Lenovo unveils AI-powered ThinkPad X1 Carbon, ThinkPad X1, IdeaPad Pro 5i laptops at CES 2024 - HT Tech", "description": "Lenovo's latest laptops lineup, featuring Intel Evo technology, promises an AI revolution with enhanced productivity and accessibility. These include Lenovo unveils AI-powered ThinkPad X1 Carbon, ThinkPad X1, and IdeaPad Pro 5i laptops.", "url": "https://tech.hindustantimes.com/photos/lenovo-unveils-ai-powered-thinkpad-x1-carbon-thinkpad-x1-ideapad-pro-5i-laptops-at-ces-2024-71702653964933.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/16/1600x900/image002_1702654614470_1702713496809.jpg", "publishedAt": "2023-12-16T18:29:43Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Google moves to end geofence warrants, a surveillance problem it largely created - TechCrunch", "description": "The practice of law enforcement tapping Google and other tech giants' banks of users' location data was first revealed in 2019.", "url": "https://techcrunch.com/2023/12/16/google-geofence-warrants-law-enforcement-privacy/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/06/cityscape-location-data.jpg?resize=1200,675", "publishedAt": "2023-12-16T16:34:53Z", "content": "Google will soon allow users to store their location data on their devices rather than on Google’s servers, effectively ending a long-running surveillance practice that allowed police and law enforce… [+5232 chars]"}]}