{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Spots a Titanic Stellar Collision That Rattles Space and Time - SciTechDaily", "description": "Over 299,000,000 meters a second — an ultra-fast jet blasting from a star crash. Neutron stars are the surviving \"trash-compacted\" cores of massive stars that exploded. Despite weighing more than our Sun, they would fit inside New York City. At this unimagina…", "url": "https://scitechdaily.com/hubble-spots-a-titanic-stellar-collision-that-rattles-space-and-time/", "urlToImage": "https://scitechdaily.com/images/Two-Neutron-Stars-Colliding.jpg", "publishedAt": "2022-11-21T02:01:20Z", "content": "ByNASA/Goddard Space Flight CenterNovember 20, 2022\r\nThis is an artists impression of two neutron stars colliding. The smashup between two dense stellar remnants unleashes the energy of 1,000 standar… [+10722 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "Coca-Cola PH enables lasting change for micro-entrepreneurs, celebrates over a thousand graduates of training program - The Manila Times", "description": "Over 1,500 micro-entrepreneurs from Davao del Norte were awarded Certificates of Completion for completing the iSTAR Program implemented by Coca-Cola Philippines, the Technical...", "url": "https://www.manilatimes.net/2022/11/21/supplements/coca-cola-ph-enables-lasting-change-for-micro-entrepreneurs-celebrates-over-a-thousand-graduates-of-training-program/1867186", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/11/21/128622.jpg", "publishedAt": "2022-11-21T01:58:52Z", "content": "Over 1,500 micro-entrepreneurs from Davao del Norte were awarded Certificates of Completion for completing the iSTAR Program implemented by Coca-Cola Philippines, the Technical Education and Skills D… [+2488 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for November 21: Get some thrilling freebies now - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for November 21: Grab free skins, weapons, loot and more! Check out our step by step guide here.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-november-21-get-some-thrilling-freebies-now-71668992563660.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/21/1600x900/039_1653700282077_1668992740652_1668992740652.jpg", "publishedAt": "2022-11-21T01:06:18Z", "content": "Garena Free Fire MAX Redeem Codes for November 21: Garena Free Fire MAX is the higher-quality version of Garena Free Fire. On Free Fire MAX, players can get an optimized Free Fire experience with enh… [+1617 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Considered Impossible – New Study of 5 Million People Reveals Genetic Links to Height - SciTechDaily", "description": "The research was the largest-ever genome-wide association study. The study, which was recently published in the journal Nature, is the largest genome-wide association study ever conducted, using the DNA of nearly 5 million individuals from 281 contributing st…", "url": "https://scitechdaily.com/considered-impossible-new-study-of-5-million-people-reveals-genetic-links-to-height/", "urlToImage": "https://scitechdaily.com/images/Human-Body-DNA-Genetics-Concept.jpg", "publishedAt": "2022-11-21T00:27:49Z", "content": "ByQueen Mary University of LondonNovember 20, 2022\r\nThe results of the research may help doctors identify patients who are unable to grow to their genetically projected height, which may subsequently… [+7560 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "The Big Read: Post-pandemic, life isn't as different as predicted but some changes — big and small — have stuck - CNA", "description": "SINGAPORE: For a few months in 2020, Ms Ethel Chang missed out on the joys of being a polytechnic student, as COVID-19 raged around the island. “My seniors from secondary school would talk about the school camps, co-curricular activities and events where you …", "url": "https://www.channelnewsasia.com/singapore/big-read-post-covid-19-pandemic-life-changes-remote-working-masks-e-commerce-3086086", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--mxxKSVbE--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:mediacorp,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/11/19/the big read.jpg?itok=z1YRF0Bq", "publishedAt": "2022-11-21T00:20:00Z", "content": "Given the magnitude of COVID-19's devastation, affecting millions of lives and livelihoods around the world, it is inevitable that the pandemic caused some behavioural changes among people, experts t… [+2174 chars]"}, {"source": {"id": null, "name": "The Irish Sun"}, "author": "Adrian Zorzut", "title": "People are only just realising you can unlock your iPhone with your voice and they’re baffled... - The Irish Sun", "description": "A TECH wizz has revealed how to unlock iPhones using voice commands – and everyone’s baffled. The tech guru shared how Siri will unlock your iPhone for you in a clip on TikTok. The tech…", "url": "https://www.thesun.ie/tech/9765146/siri-unlock-iphone-hack/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2022/11/newspress-collage-20490043-1668981298454.jpg?1668983411&strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2022-11-20T22:24:09Z", "content": "A TECH wizz has revealed how to unlock iPhones using voice commands - and everyone's baffled.\r\nThe tech guru shared how Siri will unlock your iPhone for you in a clip on TikTok.\r\nA tech whiz has reve… [+2439 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "NASA Moon mission 'exceeding' expectations - HT Tech", "description": "The spacecraft is to take astronauts to the Moon in the coming years -- the first to set foot on its surface since the last Apollo mission in 1972.", "url": "https://tech.hindustantimes.com/tech/news/nasa-moon-mission-exceeding-expectations-71668929084084.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/20/1600x900/NASA-Moon-Rocket-33_1668930346497_1668930346497_1668930358020_1668930358020.jpg", "publishedAt": "2022-11-20T19:48:58Z", "content": "On the third day after lifting off from Florida bound for the Moon, the Orion spacecraft is \"exceeding performance expectations,\" NASA officials said on Friday.\r\nThe spacecraft is to take astronauts … [+2281 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Apple's watch OS 9 brings proper battery-saving mode - Times of India", "description": "American tech giant Apple is introducing a true power-saving mode for the Apple Watch in the latest watchOS 9 update, extending the watch’s battery life when necessary. According to GSM Arena, this mode can be activated manually through the Control centre or …", "url": "https://timesofindia.indiatimes.com/videos/tech/apples-watch-os-9-brings-proper-battery-saving-mode/videoshow/95645956.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-95645956,imgsize-44074.cms", "publishedAt": "2022-11-20T18:15:57Z", "content": "Nov 20, 2022, 11:45PM ISTSource: ANIAmerican tech giant Apple is introducing a true power-saving mode for the Apple Watch in the latest watchOS 9 update, extending the watchs battery life when necess… [+1015 chars]"}, {"source": {"id": null, "name": "MobileSyrup"}, "author": "Dean Daley", "title": "What tech items are you buying this Black Friday? - MobileSyrup", "description": "Tech products like TVs, smartphones, phone plans, audio equipment, video games and more are all on sale.", "url": "https://mobilesyrup.com/2022/11/20/what-black-friday-products-are-you-buying-2/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2021/11/black-friday-1-scaled.jpg", "publishedAt": "2022-11-20T16:04:00Z", "content": "This upcoming Friday is the post-American Thanksgiving shopping holiday, ‘Black Friday,’ which, over the last few years, has become a major sale event in Canada.\r\nAs always, this is the ultimate shop… [+1232 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Urvi Gupte", "title": "Samsung 2.1 Channel Soundbar with Wireless Subwoofer and Dolby Audio: Check the best deal on Best Buy - The Tech Outlook", "description": "Currently, Best Buy is offering the best deals in the American market. And guess what? It is offering cool deals on Samsung products too. Let's have a look at the offer on Best Buy on the SAMSUNG 2.1 channel soundbar with wireless subwoofer and Dolby", "url": "https://www.thetechoutlook.com/offers/samsung-2-1-channel-soundbar-with-wireless-subwoofer-and-dolby-audio-check-the-best-deal-on-best-buy/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/11/Untitled-design-2022-11-20T205936.191.jpg", "publishedAt": "2022-11-20T15:51:29Z", "content": "Currently, Best Buy is offering the best deals in the American market. And guess what? It is offering cool deals on Samsung products too. Let’s have a look at the offer on Best Buy on the SAMSUNG 2.1… [+1358 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Microsoft plans to bring back its SwiftKey iOS keyboard with new features | Mint - Mint", "description": "The technology company plans to announce that it will bring back Swiftkey for iOS devices. Recently, the company told The Verge that Microsoft’s Caitlin Roulston said, “Based on customer feedback, Swiftkey iOS has been relisted on the Apple App Store.”", "url": "https://www.livemint.com/technology/tech-news/microsoft-plans-to-bring-back-its-swiftkey-ios-keyboard-with-new-features-11668941839224.html", "urlToImage": "https://images.livemint.com/img/2022/11/20/600x338/US-MICROSOFT-PHONES-0_1639047811612_1668943457998_1668943457998.JPG", "publishedAt": "2022-11-20T11:24:42Z", "content": "In the previous month, Microsoft stated that it will discontinue the iOS version of the Swiftkey. The technology giant wanted to focus on the Android version of the application. Afterwards, Microsoft… [+2140 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Map of the Universe Displays Span of Entire Cosmos With Pinpoint Accuracy and Sweeping Beauty - SciTechDaily", "description": "The map charts a broad expanse of the universe, from the Milky Way to 'the edge of what can be seen.' A new map of the universe displays the span of the entire known cosmos for the first time with pinpoint accuracy and sweeping beauty. Compiled from data mine…", "url": "https://scitechdaily.com/new-map-of-the-universe-displays-span-of-entire-cosmos-with-pinpoint-accuracy-and-sweeping-beauty/", "urlToImage": "https://scitechdaily.com/images/New-Interactive-Map-Offers-Scroll-Through-Universe-scaled.jpg", "publishedAt": "2022-11-20T10:23:28Z", "content": "ByJohns Hopkins UniversityNovember 20, 2022\r\nBrice Ménard (left) and Nikita Shtarkman examine the map of the observable universe. Credit: Will Kirk / Johns Hopkins University\r\nThe map charts a broad … [+3433 chars]"}, {"source": {"id": null, "name": "Livelaw.in"}, "author": "Manu Sebastian", "title": "Digital Personal Data Protection Bill Proposes To Amend RTI Act To Completely Bar Disclosure Of Personal... - Live Law - Indian Legal News", "description": "The draft of the Digital Personal Data Protection Bill, which was released by the Ministry of Electronics and Information Technology on November 18 for public comments, has a provision which...", "url": "https://www.livelaw.in/news-updates/digital-personal-data-protection-bill-proposes-to-amend-rti-act-to-completely-bar-disclosure-of-personal-information-214573", "urlToImage": "https://www.livelaw.in/h-upload/images/personal-data.jpg", "publishedAt": "2022-11-20T06:42:35Z", "content": "The draft of the Digital Personal Data Protection Bill, which was released by the Ministry of Electronics and Information Technology on November 18 for public comments, has a provision which proposes… [+2949 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Bad news for home loans in South Africa - BusinessTech", "description": "MyProperty has published its most recent Home Loan Report for October 2022 showing the average interest rate as well as its effect on buyers in South Africa – especially those who are looking for homes for the first time.", "url": "https://businesstech.co.za/news/property/643591/bad-news-for-home-loans-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Screenshot-2022-11-16-113445-e1668591327641.png", "publishedAt": "2022-11-20T05:19:03Z", "content": "Recent data from MyProperty shows that most South Africans are currently getting higher interest rates for their home loans.\r\nThe group’s most recent Home Loan Report for October 2022 showed that whi… [+3809 chars]"}, {"source": {"id": null, "name": "Techeconomy.ng"}, "author": "Admin", "title": "Introducing ASUS Extraordinary Vivobook 13 Slate OLED Limited Artist Editions - TechEconomy.ng", "description": "ASUS has launched Vivobook 13 Slate OLED Philip Colbert Edition and the Vivobook 13 Slate OLED Steven Harrington Edition, two extraordinary", "url": "https://techeconomy.ng/introducing-asus-extraordinary-vivobook-13-slate-oled-limited-artist-editions/", "urlToImage": null, "publishedAt": "2022-11-19T18:36:28Z", "content": "ASUS has launched Vivobook 13 Slate OLED Philip Colbert Edition and the Vivobook 13 Slate OLED Steven Harrington Edition, two extraordinary limited edition versions of the vivaciously versatile 2-in-… [+5878 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The biggest threats to business in South Africa right now - BusinessTech", "description": "The latest KPMG CEO Outlook Report for South Africa surveyed 50 top CEOs from a range of industries between July and August of this year about what they are most concerned about.", "url": "https://businesstech.co.za/news/business-opinion/643065/the-biggest-threats-to-business-in-south-africa-right-now/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/city-skyline-cape-town.jpg", "publishedAt": "2022-11-19T13:08:40Z", "content": "Top CEOs say supply chain constraints, emerging technologies and regulatory risks pose the greatest threats to organisational growth in South Africa.\r\nThis is according to new data from the African d… [+4826 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "There are now 8 billion people in the world – here’s what that means for the future - BusinessTech", "description": "There are 8 billion people in the world. That’s a fact. It’s a thing we can’t deny. Like the fact that", "url": "https://businesstech.co.za/news/lifestyle/643463/there-are-now-8-billion-people-in-the-world-heres-what-that-means-for-the-future/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Large-crowd.jpg", "publishedAt": "2022-11-19T11:09:16Z", "content": "The worlds population reached 8 billion Tuesday (15 November), according to estimates from the United Nations, even as the international body said that a surge in births in lower-income countries is … [+2563 chars]"}]}