{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "This USB-C mouthpiece turns your phone into a musical instrument - TechCrunch", "description": "Artinoise, the Italian startup behind re.corder -- a smart device reimagining the traditional plastic recorder we all played in school -- has introduced Zefiro is a new musical tool that can be plugged into any device with a USB-C port.", "url": "https://techcrunch.com/2024/11/12/this-usb-c-mouthpiece-turns-your-phone-into-a-woodwind-instrument/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/11/artinoise-recorder-guy.jpg?resize=1200,655", "publishedAt": "2024-11-12T15:00:00Z", "content": "Artinoise, the Italian startup behind re.corder — a smart device reimagining the traditional plastic recorder we all played in school — has introduced its latest product: Zefiro.\r\nThe portable device… [+3018 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Paresh Dave", "title": "Two Upstart Search Engines Are Teaming Up to Take on Google - WIRED", "description": "Generative AI and new rules targeting tech giants are giving Ecosia and Qwant fuel to challenge Google and Microsoft and develop a web index for Europe.", "url": "https://www.wired.com/story/ecosia-qwant-eusp-take-on-google-search-index/", "urlToImage": "https://media.wired.com/photos/67327521c2322b2028295115/191:100/w_1280,c_limit/Qwant-Ecosie-Search-Engine-Business-1519732762.jpg", "publishedAt": "2024-11-12T05:00:00Z", "content": "The companies are open to both raising outside funding for EUSP and licensing its index to other companies, including those that might want to use the data to train AI systems. Were bringing together… [+2590 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Alzheimer’s Damage Found To Happen Quietly, Long Before Symptoms Appear - SciTechDaily", "description": "A brain mapping study funded by the NIH reveals which cell types may be the first to be affected. New research funded by the National Institutes of Health (NIH) suggests that Alzheimer’s disease may impact the brain in two distinct stages. Using advanced brai…", "url": "https://scitechdaily.com/early-alzheimers-damage-found-to-happen-quietly-long-before-symptoms-appear/", "urlToImage": "https://scitechdaily.com/images/Alzheimer-Disease-Neurons-With-Amyloid-Plaques.jpg", "publishedAt": "2024-11-11T03:41:39Z", "content": "New NIH-funded research indicates that Alzheimer’s disease damages the brain in two distinct phases. The first phase is gradual, affecting only specific cell types before symptoms arise, while the se… [+7800 chars]"}]}