{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Ishaan Mital", "title": "Stocks to Watch: Adani Enterprises, Mindtree, PNB Housing, Reliance Infra - Mint", "description": "Infosys and  L&T Technology Services, Tinplate Company of India, Dodla Dairy, Hatsun Agro, among other stocks are set to share their Q1FY22 earnings reports on Wednesday.", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-adani-enterprises-mindtree-pnb-housing-reliance-infra-11626228250284.html", "urlToImage": "https://images.livemint.com/img/2021/07/14/600x338/stock-kItE--621x414@LiveMint_1626228481725.jpg", "publishedAt": "2021-07-14T02:20:59Z", "content": "NEW DELHI: Here are top 10 stocks that may be in the news today.Adani Enterprises: The group-owned unit Adani Airport Holdings Ltd (AAHL) has taken over the management control of Mumbai International… [+3551 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Liam Mannix", "title": "Cutting up COVID: Doherty, Peter Mac working on new anti-viral technique - Sydney Morning Herald", "description": "Melbourne-based scientists have developed a new anti-viral technique that can be quickly tweaked to target viruses including COVID-19 - an important step on the path toward new pandemic defences.", "url": "https://www.smh.com.au/national/cutting-up-covid-doherty-peter-mac-working-on-new-anti-viral-technique-20210714-p589ip.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.6659%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/7172e3f440e3f9c0be693f97fb0dbedd217b9056", "publishedAt": "2021-07-14T01:57:08Z", "content": "With its blueprint shredded, the virus cannot reproduce.\r\nBy changing the target, the anti-viral technique could theoretically be used against a broad range of different viruses - including ones that… [+1938 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Preventing Oxygen Release Leads to Safer High-Energy-Density Lithium-Ion Batteries - SciTechDaily", "description": "A research group has produced fresh insights about the release of oxygen in lithium-ion batteries, paving the way for more robust and safer high-energy-density batteries. Next-generation batteries that store more energy are critical if society is to achieve t…", "url": "https://scitechdaily.com/preventing-oxygen-release-leads-to-safer-high-energy-density-lithium-ion-batteries/", "urlToImage": "https://scitechdaily.com/images/Oxygen-Release-From-Battery-Materials.jpg", "publishedAt": "2021-07-14T01:44:26Z", "content": "Oxygen release from battery materials can cause thermal runaway. Credit: Takashi Nakamura\r\nA research group has produced fresh insights about the release of oxygen in lithium-ion batteries, paving th… [+2814 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "AFP", "title": "CRISPR Breakthrough Blocks SARS-CoV-2 Virus Replication in Early Lab Tests - ScienceAlert", "description": "Scientists have used CRISPR gene-editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells, according to research released Tuesday that could pave the way for COVID-19 treatments.", "url": "https://www.sciencealert.com/cell-study-suggests-we-might-be-able-to-stop-sars-cov-2-from-replicating", "urlToImage": "https://www.sciencealert.com/images/2021-07/processed/GettyImages-1131214642-cropped_1024.jpg", "publishedAt": "2021-07-14T00:28:34Z", "content": "Scientists have used CRISPR gene-editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells, according to research released Tuesday that could pave the … [+2611 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Gene editing ‘blocks virus transmission’ in human cells, say scientists - Malay Mail", "description": "PARIS, July 14 — Scientists have used CRISPR gene-editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells, according to research released yesterday that could pave the way for Covid-19 treatments. Writing in t…", "url": "https://www.malaymail.com/news/life/2021/07/14/gene-editing-blocks-virus-transmission-in-human-cells-say-scientists/1989686", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-07/20210714_DNA_Gene_Generic_Istock_ETX-seo.jpg", "publishedAt": "2021-07-14T00:18:46Z", "content": "CRISPR, which allows scientists to alter DNA sequences and modify gene function, has already shown promise in eliminating the genetic coding that drives the development of childrens cancer. Istock pi… [+2825 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Turkish Technic signs deals with Malaysia, mulls investments in Asia-Pacific, - The Star Online", "description": "ISTANBUL: Turkish Technic, Turkish Airlines' aircraft maintenance, repair and overhaul company, said on Tuesday it was mulling investment opportunities in the Asia-Pacific region and had signed a series of agreements with companies in Malaysia.", "url": "https://www.thestar.com.my/business/business-news/2021/07/14/turkish-technic--signs-deals-with-malaysia-mulls-investments-in-asia-pacific", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/14/1219765.jpg", "publishedAt": "2021-07-13T22:23:00Z", "content": "ISTANBUL: Turkish Technic, Turkish Airlines' aircraft maintenance, repair and overhaul company, said on Tuesday it was mulling investment opportunities in the Asia-Pacific region and had signed a ser… [+883 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "If we want to look for life on Europa, we’d better bring a drill - Ars Technica", "description": "Impacts and radiation ensure any interesting chemicals won't last at the surface.", "url": "https://arstechnica.com/science/2021/07/if-we-want-to-look-for-life-on-europa-we-better-bring-a-drill/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2015/06/europa_atomic_clock-640x215.jpg", "publishedAt": "2021-07-13T19:25:44Z", "content": "20 with 17 posters participating\r\nJupiter's moon Europa, a large world with a vast sub-ice ocean, is thought to be one of the best candidates for hosting life elsewhere in the Solar System. NASA has … [+4919 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm to hit Earth today, your mobile phone signals, GPS can be affected - HT Tech", "description": "A solar storm is approaching the Earth at a phenomenal speed and it may knowck out mobile phone signals, GSP and even electricity.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-to-hit-earth-today-your-mobile-phone-signals-gps-can-be-affected-71626198689308.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/07/13/1600x900/sun-11579_1626176707824_1626198796259.jpg", "publishedAt": "2021-07-13T17:51:28Z", "content": "A solar storm generated by the Sun is speeding towards Earth and it will hit anytime today. A solar storm has the power of impacting mobile phone signals, GPS and even cutting off electricity. Nation… [+1513 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Hamish Hector", "title": "2021 is the year we’re all finally getting an OLED TV - Techradar", "description": "OLED TVs hit major milestone in fight against LCD dominance", "url": "https://www.techradar.com/news/2021-is-the-year-were-all-finally-getting-an-oled-tv", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oQWGxWxRtx3xM6rFGaKbQ6-1200-80.jpg", "publishedAt": "2021-07-13T16:32:30Z", "content": "If youve bought an OLED TV so far this year, you arent alone. Even though TV sales have generally slowed, market analysts are predicting 2021 will be the year of the OLED, with shipments of OLED scre… [+2426 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Frederic Lardinois", "title": "Javier Soltero, Google’s head of Workspace, will join us at TC Sessions: SaaS - TechCrunch", "description": "When it comes to big SaaS products, few are bigger than Google Workspace (formerly known as GSuite). So it’s maybe no surprise that one of the first people we contacted to speak at our SaaS conference on October 27 was Google’s Javier Soltero. Today, Puerto R…", "url": "http://techcrunch.com/2021/07/13/javier-soltero-googles-head-of-workspace-will-join-us-at-tc-sessions-saas/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/07/javier_wp.png?w=711", "publishedAt": "2021-07-13T16:11:38Z", "content": "When it comes to big SaaS products, few are bigger than Google Workspace (formerly known as GSuite). So it’s maybe no surprise that one of the first people we contacted to speak at our SaaS conferenc… [+1939 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Gene editing 'blocks virus transmission' in human cells - Guardian", "description": "Scientists have used CRISPR gene-editing technology to successfully block the transmission of the SARS-CoV-2 virus in infected human cells, according to research released Tuesday that could pave the way for Covid-19 treatments.", "url": "https://guardian.ng/features/gene-editing-blocks-virus-transmission-in-human-cells/", "urlToImage": "https://guardian.ng/wp-content/uploads/2020/06/Coronavirus-8.jpg", "publishedAt": "2021-07-13T15:47:19Z", "content": "An illustration of SARS-CoV-2 surrounded by antibodies PHOTO: Getty Images\r\nScientists have used CRISPR gene-editing technology to successfully block the transmission of the SARS-CoV-2 virus in infec… [+2690 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Impending Supernova Doom: Astronomers Rare Sighting of a Teardrop-Shaped Star - SciTechDaily", "description": "International team led by University of Warwick makes rare sighting of a binary star system heading towards supernova Star system’s fate was identified from its unusual light variations, a sign that one star has been distorted into a teardrop shape by a massi…", "url": "https://scitechdaily.com/impending-supernova-doom-astronomers-rare-sighting-of-a-teardrop-shaped-star/", "urlToImage": "https://scitechdaily.com/images/HD265435-System-Cover-scaled.jpg", "publishedAt": "2021-07-13T14:12:30Z", "content": "Artist’s impression of the HD265435 system at around 30 million years from now, with the smaller white dwarf distorting the hot subdwarf into a distinct ‘teardrop’ shape. Credit: University of Warwic… [+6096 chars]"}, {"source": {"id": null, "name": "SYFY WIRE"}, "author": "Phil Plait", "title": "Mars 'copter Ingenuity still flying high, spots hazards for the Perseverance rover - SYFY WIRE", "description": "Last week, engineers at the NASA/Caltech Jet Propulsion Laboratory let the Mars Ingenuity helicopter fly for the ninth time, an amazing achievement that means the semi-autonomous drone has now made four flights past its mission's nominal five. Images it took …", "url": "https://www.syfy.com/syfywire/mars-copter-ingenuity-still-flying-high-spots-hazards-for-the-perseverance-rover", "urlToImage": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/art_perseverance.jpg", "publishedAt": "2021-07-13T13:00:00Z", "content": "Last week, engineers at the NASA/Caltech Jet Propulsion Laboratory let the Mars Ingenuity helicopter fly for the ninth time, an amazing achievement that means the semi-autonomous drone has now made f… [+3990 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Hanson", "title": "The future of Windows could be Microsoft’s Cloud PC – not Windows 11 - TechRadar", "description": "New glimpse of Microsoft’s upcoming Cloud PC product leaks", "url": "https://www.techradar.com/news/the-future-of-windows-could-be-microsofts-cloud-pc-not-windows-11", "urlToImage": "https://cdn.mos.cms.futurecdn.net/hkwvjVHfvVszcYUDPgzzaH-1200-80.jpg", "publishedAt": "2021-07-13T11:41:42Z", "content": "Windows 11 may feel like the next evolution for Windows, but Microsoft is working on something even more revolutionary, with another leak hitting the internet that shows off the companys Cloud PC ser… [+1296 chars]"}, {"source": {"id": null, "name": "Technext.ng"}, "author": "https://www.facebook.com/technextdotng/", "title": "WhatsApp and Telegram top list of preferred social apps for phishing scammers - Technext", "description": "WhatsApp and Telegram top list of preferred social apps for phishing scammers according to research by Kaspersky Internet Security", "url": "https://technext.ng/2021/07/13/whatsapp-and-telegram-top-list-of-preferred-social-apps-for-phishing-scammers/", "urlToImage": "https://technext.ng/wp-content/uploads/2021/07/whatsapp-e-telegram-768x432-1.jpg", "publishedAt": "2021-07-13T10:45:18Z", "content": "Phishing has become one of the most popular tools for scammers. So popular that in 2020, Google detected 2.1 million phishing sites, indicating an outrageous 25% increase from about 1.5 million recor… [+3720 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "[Interview] Neo QLED 8K Engineers Discuss Packing the TVs' Ultra-Slim Frames With Powerful Sound Technologies - Samsung Newsroom South Africa", "description": "JOHANNESBURG, South Africa – 12 July 2021 –  On a rainy night, a family gathers in their living room to watch a horror movie. Snuggling up together under a", "url": "https://news.samsung.com/za/interview-neo-qled-8k-engineers-discuss-packing-the-tvs-ultra-slim-frames-with-powerful-sound-technologies", "urlToImage": "https://img.global.news.samsung.com/za/wp-content/uploads/2021/07/Sound_Engineer_main1-768x511.jpg", "publishedAt": "2021-07-12T11:10:51Z", "content": "JOHANNESBURG, South Africa 12 July 2021  On a rainy night, a family gathers in their living room to watch a horror movie. Snuggling up together under a big blanket, they push the sofa closer to the T… [+10985 chars]"}]}