{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "Ripplesnigeria.com"}, "author": "Ripples Nigeria", "title": "WhatsApp to tweak interface on Android beta. 2 other stories and a trivia - Ripples Nigeria", "description": "This line-up of stories will help you discover the latest happenings around the tech world, today 1. WhatsApp to tweak interface on Android beta Popular messaging app, WhatsApp, has announced intent to roll out minor tweaks to its app’s interface on Android b…", "url": "https://www.ripplesnigeria.com/whatsapp-to-tweak-interface-on-android-beta-2-other-stories-and-a-trivia/", "urlToImage": "https://i0.wp.com/www.ripplesnigeria.com/wp-content/uploads/2022/10/images-1_copy_650x366-1.jpeg?resize=650%2C366&ssl=1", "publishedAt": "2022-10-18T13:05:54Z", "content": "This line-up of stories will help you discover the latest happenings around the tech world, today\r\n1. WhatsApp to tweak interface on Android beta\r\nPopular messaging app, WhatsApp, has announced inten… [+3743 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "Biggest PC wholesalers in South Africa - MyBroadband", "description": "These six wholesalers play an essential role in ensuring that retailers have quick access to copious amounts of PC hardware and other tech.", "url": "https://mybroadband.co.za/news/business/464223-biggest-pc-wholesalers-in-south-africa.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/10/Tarsus-Warehouse-headline-new-.jpg", "publishedAt": "2022-10-18T11:02:11Z", "content": "South Africans have six major computer wholesalers to thank for the wide selection of PC hardware and other tech readily available to buy from retailers.\r\nTech stores rely on a consistent flow of sto… [+5616 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Planet Hunter TESS Resumes Normal Operations - SciTechDaily", "description": "On Thursday, October 13, at around 6:30 p.m. EDT NASA’s Transiting Exoplanet Survey (TESS) began its return to normal operations. Engineers successfully powered up the instrument, and the spacecraft resumed its regular fine-pointing mode. TESS resumed science…", "url": "https://scitechdaily.com/nasas-planet-hunter-tess-resumes-normal-operations/", "urlToImage": "https://scitechdaily.com/images/TESS-Observing-M-Dwarf-Star-scaled.jpg", "publishedAt": "2022-10-18T10:23:41Z", "content": "ByNASAOctober 18, 2022\r\nArtist concept of TESS observing an M dwarf star with orbiting planets. Credit: NASAs Goddard Space Flight Center\r\nOn Thursday, October 13, at around 6:30 p.m. EDT NASA\r\nEstab… [+2214 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Axel Metz", "title": "Sky Stream brings the best of Sky Glass to any TV – and it looks great - TechRadar", "description": "Get the Sky Glass experience without replacing your TV", "url": "https://www.techradar.com/news/sky-stream-brings-the-best-of-sky-glass-to-any-tv-and-it-looks-great", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MJzvVsaaL5n2cScpsrTodF-1200-80.jpg", "publishedAt": "2022-10-18T08:08:42Z", "content": "It’s been a whole year since Sky launched its long-awaited, satellite-free TV offering, Sky Glass, in the UK – and now the company is bringing the streaming-based benefits of Glass to those who’d rat… [+4785 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lisa Steyn", "title": "Sasol, ArcelorMittal launch carbon capture, 'green steel' plans for Vanderbijlpark, Saldanha | Fin24 - News24", "description": "The two companies will work to develop technologies desperately needed to kickstart their decarbonisation plans.", "url": "https://www.news24.com/fin24/companies/sasol-arcelormittal-launch-carbon-capture-green-steel-plans-for-vanderbijlpark-saldanha-20221018", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10476/5c4f94ecdf384236bc7ec1f2fd372b0c.jpg", "publishedAt": "2022-10-18T08:04:25Z", "content": "<ul><li>Sasol and ArcelorMittal SA have partnered to develop carbon capture and green hydrogen technologies.</li><li>It is hoped the plans will kick-start the two companies' decarbonisation ambitions… [+3679 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "SDC22 Keynote: Samsung Electronics Shares its Vision for the Homes and Devices of Tomorrow - Samsung", "description": "This month in San Francisco, the 2022 Samsung Developer Conference (SDC) spotlighted some of Samsung’s best and brightest minds across tech, marketing and", "url": "https://news.samsung.com/my/sdc22-keynote-samsung-electronics-shares-its-vision-for-the-homes-and-devices-of-tomorrow", "urlToImage": "https://img.global.news.samsung.com/my/wp-content/uploads/2022/10/SDC_Keynote_Sketch_thumb728.jpg", "publishedAt": "2022-10-18T06:23:33Z", "content": "This month in San Francisco, the 2022 Samsung Developer Conference (SDC) spotlighted some of Samsungs best and brightest minds across tech, marketing and product fields, sharing a compelling vision o… [+13992 chars]"}, {"source": {"id": null, "name": "Nus.edu.sg"}, "author": "National University of Singapore", "title": "NUS and NRF launch National Synchrotron Programme and International Synchrotron Access initiative to foster collaboration in scientific research - NUS News", "description": "NUS and the National Research Foundation, Singapore (NRF) have launched the National Synchrotron Programme (NSP) today to promote and anchor synchrotron research in the country. As part of the launch, NUS and the Australian Nuclear Science and Technology Orga…", "url": "https://news.nus.edu.sg/nus-and-nrf-launch-national-synchrotron-programme-and-international-synchrotron-access-initiative-to-foster-collaboration-in-scientific-research/", "urlToImage": "https://content.presspage.com/uploads/2580/1920_nsplaunch-groupshot.jpg?10000", "publishedAt": "2022-10-18T03:02:00Z", "content": "NUS and the National Research Foundation, Singapore (NRF) have launched the National Synchrotron Programme (NSP) today to promote and anchor synchrotron research in the country. As part of the launch… [+2327 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "于小明", "title": "China forging ahead as innovation powerhouse - Chinadaily.com.cn - China Daily", "description": "From a rover mission to Mars to diving to the bottom of the deepest place on Earth, Chinese scientists are exploring far beyond the horizon, evidence that the country is becoming a key contributor to global science and technology.", "url": "https://www.chinadaily.com.cn/a/202210/18/WS634ddd3fa310fd2b29e7d032.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202210/18/634e0aa2a310fd2beca753f2.jpeg", "publishedAt": "2022-10-17T22:54:00Z", "content": "Farmers tend cucumbers planted in an AI-controlled greenhouse in Yuanqu village, Longli county, Guizhou province, on May 25. YANG WENBIN/XINHUA \r\nRise as global scientific heavyweight is the fruit of… [+2231 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Advanced genomic approaches hold promise for marine conservation - Phys.org", "description": "Genetic and genomic technologies have tremendous potential for protecting marine life, but are currently being underutilized, argue Madeleine van Oppen of the Australian Institute of Marine Science and the University of Melbourne and Melinda Coleman with the …", "url": "https://phys.org/news/2022-10-advanced-genomic-approaches-marine.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/advanced-genomic-appro.jpg", "publishedAt": "2022-10-17T18:00:03Z", "content": "Genetic and genomic technologies have tremendous potential for protecting marine life, but are currently being underutilized, argue Madeleine van Oppen of the Australian Institute of Marine Science a… [+3086 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s EMIT: Dust Detective Delivers First Maps From Space for Climate Science - SciTechDaily", "description": "Measurements from EMIT, the Earth Surface Mineral Dust Source Investigation, will improve computer simulations scientists use to understand climate change. NASA’s Earth Surface Mineral Dust Source Investigation (EMIT) mission aboard the International Space St…", "url": "https://scitechdaily.com/nasas-emit-dust-detective-delivers-first-maps-from-space-for-climate-science/", "urlToImage": "https://scitechdaily.com/images/EMIT-Southwestern-Libya.jpg", "publishedAt": "2022-10-17T17:47:51Z", "content": "ByJet Propulsion LaboratoryOctober 17, 2022\r\nInstalled on the space station in July 2022, EMIT orbits Earth about once every 90 minutes, to map the worlds mineral-dust sources. This includes the Saha… [+10962 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Gauteng gets urgent water allocation amid shortages and breakdowns - BusinessTech", "description": "Water and Sanitation Minister, Senzo Mchunu, has committed to increasing the bulk water allocation to the Rand Water system.", "url": "https://businesstech.co.za/news/government/635111/gauteng-gets-urgent-water-allocation-amid-shortages-and-breakdowns/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/08/shutterstock_90089527-e1660117748967.jpg", "publishedAt": "2022-10-17T14:43:02Z", "content": "Water and Sanitation Minister, Senzo Mchunu, has committed to increasing the bulk water allocation to the Rand Water system.\r\nThis is part of emergency measures to address water shortages in Gauteng … [+2476 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Vijainder K Thakur", "title": "DECODED: Why Is Russia Buying Ballistic Missiles From Iran When Its Own Technology Is Decades Ahead Of Tehran? - EurAsian Times", "description": "Russia's purchase of drones & missiles from Iran is linked with NASAMS & IRIS-T for Ukraine than depletion of cruise or ballistic missiles.", "url": "https://eurasiantimes.com/decoded-why-is-russia-buying-ballistic-missile-from-iran/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/10/Iran-Russia.jpg", "publishedAt": "2022-10-17T12:56:48Z", "content": "Russia’s reported purchase of ballistic missiles from Iran likely has more to do with the US supply of NASAMS &amp; Germany’s IRIS-T to Ukraine than any alarming depletion of its cruise or ballistic … [+5434 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major worry over petrol and diesel prices in South Africa - BusinessTech", "description": "Rising oil prices and a weaker rand are expected to lead to higher petrol and diesel prices at the pumps in November, with the government expressing concerns over South Africa’s lack of refining capabilities to give the country enough of a buffer.", "url": "https://businesstech.co.za/news/energy/634853/major-worry-over-petrol-and-diesel-prices-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/04/Sasol1-e1656330467639.jpg", "publishedAt": "2022-10-17T10:00:26Z", "content": "Rising oil prices and a weaker rand are expected to lead to higher petrol and diesel prices at the pumps in November, with the government expressing concerns over South Africa’s lack of refining capa… [+4060 chars]"}, {"source": {"id": null, "name": "Futurefive.co.nz"}, "author": "Nadine Rogers", "title": "Google introduces My Ads Center to increase safety on the web - FutureFive New Zealand", "description": "Google keeps people’s data safe and secure through security technology, automatic built-in protections, and ongoing vulnerability research and detection.", "url": "https://futurefive.co.nz/story/google-introduces-my-ads-center-to-increase-safety-on-the-web", "urlToImage": "https://futurefive.co.nz/uploads/story/2022/10/17/compatible_google_ads.jpg", "publishedAt": "2022-10-16T21:39:00Z", "content": "More cyberattacks than ever are happening on a broader, global scale. The targets of these attacks are not only large companies or government agencies but hospitals, energy providers, banks, schools … [+3194 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Jimmy Pezzone", "title": "Minecraft player recreates the entire known universe - TechSpot", "description": "Minecraft players have been creating enormous, complex creations for years, but Christopher Slayton's latest project may have just earned him the crown as the new king of...", "url": "https://www.techspot.com/news/96334-minecraft-player-recreates-entire-known-universe.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/10/2022-10-16-image-16.jpg", "publishedAt": "2022-10-16T18:35:00Z", "content": "The big picture: Minecraft players have built everything from well-known architectural designs to functioning supercomputers. But Minecraft aficionado Christopher Slayton decided it was time to go bi… [+2606 chars]"}]}