{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble at 35: Unveiling a Universe of Dazzling Images and Deep Discoveries - SciTechDaily", "description": "Hubble’s 35-year journey showcases humanity’s boldest space achievements, capturing everything from new stars forming to ancient galaxies. Its discoveries revolutionized our understanding of black holes, dark energy, and distant worlds, while its stunning ima…", "url": "https://scitechdaily.com/hubble-at-35-unveiling-a-universe-of-dazzling-images-and-deep-discoveries/", "urlToImage": "https://scitechdaily.com/images/Hubble-Celebrates-35-Years-scaled.jpg", "publishedAt": "2025-04-27T10:31:06Z", "content": "In celebration of the NASA/ESA Hubble Space Telescope’s 35 years in Earth orbit, an assortment of compelling images have been released that were recently taken by Hubble. Credit: NASA, ESA, STScI\r\nHu… [+14835 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Adam Corsetti", "title": "Tech analysis slams The Elder Scrolls IV: Oblivion Remastered performance for frame rate drops on top hardware - Notebookcheck", "description": "Digital Foundry gave a shockingly poor review of The Elder Scrolls IV: Oblivion performance. The analysis found frequent stutters, even with the best CPUs and GPUs. Reducing graphical settings helps, but only patches can boost the game's lackluster optimizati…", "url": "https://www.notebookcheck.net/Tech-analysis-slams-The-Elder-Scrolls-IV-Oblivion-Remastered-performance-for-frame-rate-drops-on-top-hardware.1005870.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc4/TheElderScrollsOblivionIVRemasteredLogo.jpg", "publishedAt": "2025-04-26T16:24:00Z", "content": "The original The Elder Scrolls IV: Oblivion taxed consoles and PCs when released in 2006. However, a Digital Foundry tech analysis revealed that the remastered edition doesn't fare much better. Const… [+1668 chars]"}]}