{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Update: Cash App founder, MobileCoin CPO Bob Lee stabbed to death in San Francisco's Rincon Hill neighborhood - CBS San Francisco", "description": "Bob Lee, founder of Cash App and the former chief technology officer of Square, was identified as the man stabbed to death Tuesday near downtown San Francisco, according to his current employer, cryptocurrency startup MobileCoin.", "url": "https://www.cbsnews.com/sanfrancisco/news/fatal-stabbing-bob-lee-mobile-coin-san-francisco-main-street-rincon-hill/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/04/05/f1db00dd-1bbe-4d0c-9700-965eb1ddca66/thumbnail/1200x630/822d48a2c00f34f066fba6d5f01f5543/bob-lee.jpg", "publishedAt": "2023-04-05T18:19:00Z", "content": "SAN FRANCISCO -- Bob Lee, founder of Cash App and the former chief technology officer of Square, was identified as the man stabbed to death early Tuesday morning near downtown San Francisco, accordin… [+3736 chars]"}, {"source": {"id": null, "name": "AnandTech"}, "author": "Anton Shilov", "title": "Asus Preps ROG Ally: A Portable Windows Game Console with Custom Zen 4 + RDNA 3 APU - AnandTech", "description": "Asus has begun teasing its own portable game console, the ROG Ally, which the company is positioning as a high-end offering for the handheld...", "url": "https://www.anandtech.com/show/18801/asus-preps-rog-ally-a-portable-console-with-custom-zen-4-rdna-3-apu-and-secret-sauce", "urlToImage": "https://images.anandtech.com/doci/18801/asus-rog-ally-678_678x452.png", "publishedAt": "2023-04-05T18:00:00Z", "content": "Asus has begun teasing its own portable game console, the ROG Ally, which the company is positioning as a high-end offering for the handheld PC gaming market. With its ROG Ally, Asus is certainly try… [+4798 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Amygdala Unveiled: How Our Brains Process Threats, Rewards, and Dopamine - SciTechDaily", "description": "Neuroscientist Bo Li at Cold Spring Harbor Laboratory has made significant discoveries about the role of somatostatin-expressing (Sst+) central amygdala (CeA) neurons in learning about threats and rewards, and their relation to dopamine. By training mice to a…", "url": "https://scitechdaily.com/?p=266236", "urlToImage": "https://scitechdaily.com/images/Brain-Signals-Activity-Technology-Concept.jpg", "publishedAt": "2023-04-05T15:00:38Z", "content": "Research at Cold Spring Harbor Laboratory has revealed that specific neurons in the central amygdala are crucial for learning about threats and rewards, and are directly connected to dopamine neurons… [+4430 chars]"}, {"source": {"id": null, "name": "Gearrice.com"}, "author": "Julian Solanki", "title": "The MacBook Pro will adopt OLED technology from 2026 - Gearrice", "description": "join the conversation", "url": "https://www.gearrice.com/update/the-macbook-pro-will-adopt-oled-technology-from-2026/", "urlToImage": "https://ipadizate.com/hero/2022/12/Etk_bmDXYAQtLI4.jpg", "publishedAt": "2023-04-05T10:12:06Z", "content": "A MacBook Pro concept with a large screen\r\nOne of the latest news circulating on the Internet warned us that Samsung had received 3,000 million dollars from the government to invest in OLED productio… [+1838 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "All you need to know about ‘Apple BKC’, India's first Apple store in Mumbai - Hindustan Times", "description": "On Wednesday, the tech giant shared a ‘teaser’ of the retail outlet, which is inside the Jio World Drive Mall at Bandra Kurla Complex.", "url": "https://www.hindustantimes.com/technology/all-you-need-to-know-about-apple-bkc-india-s-first-apple-store-opening-in-mumbai-101680672895793.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/05/1600x900/BKC_1680673064955_1680673070922_1680673070922.jpg", "publishedAt": "2023-04-05T06:16:10Z", "content": "Apple on Wednesday shared a glimpse of its first-ever retail store for India, thus confirming long-standing reports of the tech giant being in talks to open its maiden outlet in the country. Called B… [+1242 chars]"}]}