{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Not Science Fiction: Methane-Eating “Borgs” Have Been Assimilating Earth’s Microbes - SciTechDaily", "description": "A newly discovered type of transferrable DNA structure with a sci-fi name appears to play a role in balancing atmospheric methane. In Star Trek, the Borg are a ruthless, hive-minded collective that assimilate other beings with the intent of taking over the ga…", "url": "https://scitechdaily.com/not-science-fiction-methane-eating-borgs-have-been-assimilating-earths-microbes/", "urlToImage": "https://scitechdaily.com/images/Borg-Illustration.jpg", "publishedAt": "2022-10-22T15:25:13Z", "content": "ByLawrence Berkeley National LaboratoryOctober 22, 2022\r\nA digital illustration inspired by methane-eating archaea and the Borgs that assimilate them. Credit: Jenny Nuss/Berkeley Lab\r\nA newly discove… [+10078 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Corey Gaskin", "title": "The weekend’s best deals: Google Pixel 7, Apple MacBooks, 4K TVs, and more - Ars Technica", "description": "Dealmaster also has iPads, Nest smart home, and some of our favorite wearables.", "url": "https://arstechnica.com/staff/2022/10/the-weekends-best-deals-google-pixel-7-apple-macbooks-4k-tvs-and-more/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/10/dm102122-760x380.jpg", "publishedAt": "2022-10-22T15:00:21Z", "content": "9 with 7 posters participating\r\nAnother weekend, another roundup of the best tech deals from the week. Today's Dealmaster features generous gift card offers on the best android phones available, the … [+5201 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Bill Curry", "title": "Canada's border agency launches full review after blaming 'human error' in listing wrong company in $1.2 million ArriveCan contract - The Globe and Mail", "description": "Canadian tech firm ThinkOn was listed as having received the contract despite never having worked on the ArriveCan app", "url": "https://www.theglobeandmail.com/politics/article-arrivecan-contract-inaccurate-information-parliament/", "urlToImage": "https://www.theglobeandmail.com/resizer/AkItEtGd91VsvB7I9DP3QqHDHik=/1200x823/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/BYOLAYJP6RK5JDEDUQAKGEP6OA.JPG", "publishedAt": "2022-10-22T14:04:46Z", "content": "The Canada Border Services Agency has acknowledged it provided inaccurate information to Parliament about a $1.2-million ArriveCan contract and is launching a full review of its list of companies tha… [+4183 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Sushant Singh", "title": "Apple AirPods is available for only Rs 8,490 grab this once in a blue moon offer now - The Tech Outlook", "description": "There is a plethora of options is available in market b in terms of AirPods but still required to choose the best. Prolonged usage of earbuds can cause bacterial infection, loss of hearing, and pain in the ears.So it's required that you opt for the b", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/apple-airpods-is-available-for-only-rs-8490-grab-this-once-in-a-blue-moon-offer-now/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2020/12/Airpods-Max-preorders-start-with-a-price-tag-of-549-Launch-date-15th-December.jpg", "publishedAt": "2022-10-22T13:04:56Z", "content": "There is a plethora of options is available in market b in terms of AirPods but still required to choose the best. Prolonged usage of earbuds can cause bacterial infection, loss of hearing, and pain … [+1030 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "赵婷婷", "title": "China to invest in major space programs - Chinadaily.com.cn - China Daily", "description": "China Aerospace Science and Technology Corp, the country's leading space contractor, will continue to invest in major space programs such as the manned lunar missions and the development of a super-heavy carrier rocket, said the company's chairman.", "url": "https://www.chinadaily.com.cn/a/202210/22/WS6353de4da310fd2b29e7df85.html", "urlToImage": "http://img2.chinadaily.com.cn/images/202210/22/6353e562a310fd2beca82f57.jpeg", "publishedAt": "2022-10-22T12:12:00Z", "content": "Wu Yansheng, a delegate to the 20th National Congress of the Communist Party of China, speaks during an interview at the Great Hall of the People in Beijing, capital of China, Oct 22, 2022. The 20th … [+2085 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp working on automatically muting large group chats! Here's how it will benefit you - HT Tech", "description": "WhatsApp is working on a future update under which it will automatically mute large group chats to help reduce notifications. Check details here.", "url": "https://tech.hindustantimes.com/how-to/whatsapp-working-on-automatically-muting-large-group-chats-here-s-how-it-will-benefit-you-71666437303690.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/22/1600x900/Untitled_design_-_2022-02-24T134736418_1666437490045_1666437490182_1666437490182.jpg", "publishedAt": "2022-10-22T11:22:05Z", "content": "On WhatsApp you can create several groups to make for some exciting times with friends and family or perhaps, to communicate with colleagues. The online messaging application also notifies you if you… [+2249 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Marshmallow” World Discovered: Giant Fluffy Planet Orbiting a Cool Red Dwarf Star - SciTechDaily", "description": "Kitt Peak National Observatory telescope helps determines that Jupiter-like Planet is the lowest-density gas giant ever detected around a red dwarf. A gas giant exoplanet with the density of a marshmallow has been detected in orbit around a cool red dwarf sta…", "url": "https://scitechdaily.com/marshmallow-world-discovered-giant-fluffy-planet-orbiting-a-cool-red-dwarf-star/", "urlToImage": "https://scitechdaily.com/images/Ultra-Fluffy-Gas-Giant-Planet-Orbiting-Red-Dwarf-Star-scaled.jpg", "publishedAt": "2022-10-22T10:33:25Z", "content": "ByAssociation of Universities for Research in Astronomy (AURA)October 22, 2022\r\nArtist impression of an ultra fluffy gas giant planet orbiting a red dwarf star. A gas giant exoplanet [right] with the… [+10143 chars]"}, {"source": {"id": null, "name": "Ghacks Technology News"}, "author": null, "title": "Vivaldi gets official support for pinning tab stacks - gHacks Tech News - Ghacks", "description": "Users of the Vivaldi web browser may now pin entire tab stacks, collections of tabs, in the browser to save more space and benefit from other pinning features.", "url": "https://www.ghacks.net/2022/10/22/vivaldi-gets-official-support-for-pinning-tab-stacks/", "urlToImage": "https://www.ghacks.net/wp-content/uploads/2022/10/vivaldi-pin-stacked-tabs.png", "publishedAt": "2022-10-22T05:45:10Z", "content": "One of the Vivaldi web browser's greatest features, if you ask me, is the browser's ability to stack tabs. Just drag one tab on another and you have created a tab stack. Enable the two-rows feature, … [+1991 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The chance to lower interest rates is in government’s hands: Kganyago - BusinessTech", "description": "South Africa’s central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.", "url": "https://businesstech.co.za/news/trending/636989/the-chance-to-lower-interest-rates-is-in-governments-hands-kganyago/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-10-22T05:41:04Z", "content": "South Africas central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.\r\nFiscal c… [+1694 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How South Africa’s tax rates compare to Australia, the UK and other countries - BusinessTech", "description": "Data from the Organisation for Economic Cooperation and Development’s (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with the rest of the world – but the devil’s in the details.", "url": "https://businesstech.co.za/news/business-opinion/635987/how-south-africas-tax-rates-compare-to-australia-the-uk-and-other-countries/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/the-SA-rand.jpg", "publishedAt": "2022-10-22T05:06:35Z", "content": "Data from the Organisation for Economic Cooperation and Developments (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with … [+4511 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "SHIELD: Why NASA Is Trying to Crash Land on Mars - SciTechDaily", "description": "The experimental SHIELD lander is designed to absorb a hard impact like a car’s crumple zone. NASA has successfully landed spacecraft on Mars nine times, using cutting-edge parachutes, massive airbags, and jetpacks to safely touch down on the surface. Now eng…", "url": "https://scitechdaily.com/shield-why-nasa-is-trying-to-crash-land-on-mars/", "urlToImage": "https://scitechdaily.com/images/SHIELD-Mars-Lander.jpg", "publishedAt": "2022-10-22T02:37:06Z", "content": "ByJet Propulsion LaboratoryOctober 21, 2022\r\nAn illustration of SHIELD, a Mars lander concept that would allow lower-cost missions to reach the Red Planets surface by safely crash landing, using a co… [+7391 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold has strong gains as mixed signals emerge about future rate hikes - Kitco NEWS", "description": "Exclusive to Kitco News, technical analyst Gary Wagner provides a daily recap of what happened in the gold market, highlighting important events that captured investors' attention during the U.S. trading session. Wagner's commentary features a mix of fundamen…", "url": "https://www.kitco.com/commentaries/2022-10-21/Gold-has-strong-gains-as-mixed-signals-emerge-about-future-rate-hikes.html", "urlToImage": "https://www.kitco.com/commentaries/2022-10-21/images/Gold-double-bottomT.gif", "publishedAt": "2022-10-21T23:48:00Z", "content": "Gold futures basis the most active December 2022 contract as of 5:05 PM EDT is currently fixed at $1662.50 after factoring in today's net gain of $25.70 or 1.57%. This strong gain was based upon diff… [+4140 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Duncan McLeod", "title": "Boardroom drama at Huge Group as top directors quit - TechCentral", "description": "Leading directors at Huge Group, including its chairman, Duarte da Silva, have resigned amid an apparent boardroom fracas.", "url": "https://techcentral.co.za/boardroom-drama-at-huge-group-as-top-directors-quit/216519/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2022/10/duarte-da-silva-1500-800.jpg", "publishedAt": "2022-10-21T17:20:01Z", "content": "Duarte da Silva, pictured, and two other directors quit the Huge Group board on Friday\r\nLeading directors at Huge Group, including its chairman, Duarte da Silva, have resigned amid an apparent boardr… [+2210 chars]"}, {"source": {"id": null, "name": "Wustl.edu"}, "author": "Brandie Jefferson", "title": "Multi-scale imaging technique may enable objective assessment of myofascial pain - The Source - Washington University in St. Louis - Washington University in St. Louis", "description": "Washington University in St. Louis researchers Song Hu, Yong Wang team up to find quantitative biomarkers for clinical pain management", "url": "https://source.wustl.edu/2022/10/multi-scale-imaging-technique-may-enable-objective-assessment-of-myofascial-pain/", "urlToImage": "https://source.wustl.edu/wp-content/uploads/2022/10/Song-Wang.jpg", "publishedAt": "2022-10-21T16:15:00Z", "content": "About 50 million Americans experience chronic pain. For many, the pain involves the muscle and the fascia surrounding it, creating myofascial pain with trigger points. This chronic pain syndrome sign… [+1332 chars]"}, {"source": {"id": null, "name": "The Age"}, "author": "Josh Gordon", "title": "Andrews backs publicly-owned offshore wind as key renewable technology - The Age", "description": "The Andrews government has ramped up efforts to build massive, publicly owned offshore wind farms as Victoria prepares to end 100-year reliance on brown coal for electricity generation.", "url": "https://www.theage.com.au/politics/victoria/andrews-backs-publicly-owned-offshore-wind-as-key-renewable-technology-20221021-p5brsj.html", "urlToImage": "https://static.ffx.io/images/$zoom_1.7685%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_jpg/t_theage_no_label_no_age_social_wm/96b75fa5a645c0f188d6deefc8f4a09d073d3572", "publishedAt": "2022-10-21T08:50:03Z", "content": "The CSIROs latest GenCost report, released in July, shows renewables are, in a broad sense, by far the cheapest new-build electricity generation option in Australia.\r\nBut it also predicts electricity… [+3045 chars]"}]}