{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "Samsung Galaxy Book 2 Pro series announced ahead of MWC 2022 with 12th Gen Intel Core Processors - TechNave", "description": "As we enter the month of March soon, that also means the coming of the&nbsp;Mobile World Congress 2022. Tech brands would annually come and show off their lates", "url": "https://technave.com/gadget/Samsung-Galaxy-Book-2-Pro-series-announced-ahead-of-MWC-2022-with-12th-Gen-Intel-Core-Processors-28671.html", "urlToImage": "https://technave.com/data/files/article/202202280245313502.jpg", "publishedAt": "2022-02-28T02:49:35Z", "content": "As we enter the month of March soon, that also means the coming of the Mobile World Congress 2022. Tech brands would annually come and show off their latest devices and Samsung is definitely one of t… [+1693 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Mirror Alignment Continues Successfully - SciTechDaily", "description": "Webb continues on its path to becoming a focused observatory. The team has successfully worked through the second and third out of seven total phases of mirror alignment. With the completion of these phases, called Segment Alignment and Image Stacking, the te…", "url": "https://scitechdaily.com/webb-space-telescope-mirror-alignment-continues-successfully/", "urlToImage": "https://scitechdaily.com/images/Webb-Space-Telescope-Mirror-Alignment.gif", "publishedAt": "2022-02-28T02:17:15Z", "content": "Webb continues on its path to becoming a focused observatory. The team has successfully worked through the second and third out of seven total phases of mirror alignment. With the completion of these… [+2789 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Malaysia could be in same shoes as Ukraine, warns former foreign minister Anifah - Malay Mail", "description": "KOTA KINABALU, Feb 28 — As Malaysia prepares for the 5G network technology, the government, while making sure every Malaysian has equitable access to it, must also consider its security aspects. Parti Cinta Sabah president Datuk Seri Anifah Aman expressed con…", "url": "https://www.malaymail.com/news/malaysia/2022/02/28/malaysia-could-be-in-same-shoes-as-ukraine-warns-former-foreign-minister-an/2044338", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2017/2017-11/Anifah_Aman_Bernama_20171118_01-seo.JPG", "publishedAt": "2022-02-28T00:03:00Z", "content": "Datuk Seri Anifah Aman said the Malaysian government should not tolerate any threats to the nations sovereignty and should take all necessary measures to safeguard the countrys borders. Bernama file … [+3192 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Updates on Artemis I Mission, Test Fires RS-25 Rocket Engine [Video] - SciTechDaily", "description": "An update on our Artemis I mission, test firing an Artemis rocket engine, and a resupply mission delivers to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be/tPzByYNUPNE Video Transcript: An update on our Artemi…", "url": "https://scitechdaily.com/nasa-updates-on-artemis-i-mission-test-fires-rs-25-rocket-engine-video/", "urlToImage": "https://scitechdaily.com/images/Artemis-I-Inside-High-Bay-3-VAB.jpg", "publishedAt": "2022-02-27T16:37:27Z", "content": "Inside High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida, the work platforms have been retracted from around the Artemis I Space Launch System. Credit: NASA/Frank … [+3310 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "If a green or orange dot appears at the top of the screen, your device may be hacked - Tech News Inc", "description": "Do you know the meaning of the green or orange dot that sometimes appears at the top of a file Iphone ? If not, this information should be very useful to", "url": "https://technewsinc.com/if-a-green-or-orange-dot-appears-at-the-top-of-the-screen-your-device-may-be-hacked/", "urlToImage": "https://img.20mn.fr/zF_Se0d_Ru2i813wYLiBMyk/648x360_optiques-iphone-13-pro-significativement-plus-grandes-celles-iphone-12-pro.jpg", "publishedAt": "2022-02-27T16:08:51Z", "content": "Do you know the meaning of the green or orange dot that sometimes appears at the top of a file Iphone ? If not, this information should be very useful to you! Since iOS 14, various indicators allow a… [+1451 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA missed dangerous solar flares! But India's Chandrayaan 2 finds it - HT Tech", "description": "In an amazing turn of events, even though NASA missed a dangerous solar flares, India's ISRO detected it, courtesy Chandrayaan 2 orbiter.", "url": "https://tech.hindustantimes.com/tech/news/nasa-missed-dangerous-solar-flares-but-india-s-chandrayaan-2-finds-it-71645949704241.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/27/1600x900/SUn_flares_NASA_pic_1645287521356_1645949771052.jpg", "publishedAt": "2022-02-27T08:17:11Z", "content": "Even as ISRO is preparing for the launch of Chandrayaan 3, its predecessor Chandrayaan 2 is delivering extremely valuable inputs, which can even save the Earth from some dangerous events. This time, … [+2944 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Here’s what a R5 million property looks like in South Africa vs London, the US, Cyprus and Portugal - BusinessTech", "description": "We looked at what a R5 million property looks like in popular cities around the world compared to South Africa.", "url": "https://businesstech.co.za/news/property/561850/heres-what-a-r5-million-property-looks-like-in-south-africa-vs-london-the-us-cyprus-and-portugal/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/Screenshot-2022-02-23-161903.jpg", "publishedAt": "2022-02-27T05:00:55Z", "content": "South Africans are downscaling to adjust to financial pressures; however, according to FNB’s latest property barometer, as many as 8% of people are selling their homes with plans to leave the country… [+2573 chars]"}, {"source": {"id": null, "name": "Tekedia.com"}, "author": null, "title": "Global Smartphone Market Revenue Crossed $448bn in 2021 - Counterpoint - Tekedia", "description": "The year 2021, which was the hardest hit by covid, was a year of growth for the tech industry, with almost every player in the sector making groundbreaking figures in revenue. Though the growth was scuttled by global chip shortage which undermined the product…", "url": "https://www.tekedia.com/global-smartphone-market-revenue-crossed-448bn-in-2021-counterpoint/", "urlToImage": "https://tekedia-website.s3.us-east-2.amazonaws.com/wp-content/uploads/2020/10/13191837/iphone12.jpg", "publishedAt": "2022-02-27T00:29:54Z", "content": "The year 2021, which was the hardest hit by covid, was a year of growth for the tech industry, with almost every player in the sector making groundbreaking figures in revenue.\r\nThough the growth was … [+3906 chars]"}]}