{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "TOM KRISHER", "title": "Tesla is unveiling its long-awaited robotaxi amid doubts about the technology it runs on - The Associated Press", "description": "Expectations are high for Tesla’s long-awaited robotaxi unveiling at a Hollywood studio Thursday night. Too high for some analysts and investors. The company began selling software it calls “Full Self-Driving” nine years ago that still can’t drive itself. Yet…", "url": "https://apnews.com/article/elon-musk-tesla-robotaxi-unveiling-a00d063f2ffc67125889a6635a0a607e", "urlToImage": "https://dims.apnews.com/dims4/default/82b2ebe/2147483647/strip/true/crop/4000x2250+0+2/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2Fdb%2F131998573b29acdc103b7686b9b3%2Fc01d11f367b847b58c9c938cf27be7db", "publishedAt": "2024-10-10T10:00:00Z", "content": "DETROIT (AP) Expectations are high for the long-awaited unveiling of Teslas robotaxi at a Hollywood studio Thursday night. Too high for some analysts and investors.\r\nThe company, which began selling … [+5212 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coffee for Your Heart: The Regenerative Power of Caffeine on Vascular Health - SciTechDaily", "description": "New research indicates that caffeine consumption may boost vascular health by supporting the regeneration of blood vessel linings. This investigation, conducted by Italian scientists on lupus patients, highlights caffeine's potential benefits for those at inc…", "url": "https://scitechdaily.com/coffee-for-your-heart-the-regenerative-power-of-caffeine-on-vascular-health/", "urlToImage": "https://scitechdaily.com/images/Coffee-Heart-Concept.jpg", "publishedAt": "2024-10-10T02:27:44Z", "content": "Caffeine might improve vascular health by assisting in the regeneration of blood vessels, according to recent research with lupus patients, suggesting a potential dietary approach for managing cardio… [+3471 chars]"}]}