{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beware of Keto Diet: May Be Linked to Higher Risk of Heart Attacks and Cardiovascular Disease - SciTechDaily", "description": "Popular weight-loss diet also associated with higher levels of LDL cholesterol. The ketogenic or “keto” diet, which involves consuming very low amounts of carbohydrates and high amounts of fats, has been gaining popularity. However, a new study presented at t…", "url": "https://scitechdaily.com/?p=258471", "urlToImage": "https://scitechdaily.com/images/Keto-Ketogenic-Diet.jpg", "publishedAt": "2023-03-07T04:08:17Z", "content": "A new study presented at a scientific conference warns that a keto-like diet, which involves high amounts of fat and low carbohydrates, may increase the risk of cardiovascular events like chest pain,… [+8106 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Jillian Berman", "title": "SoFi sues over student-loan pause to force borrowers to resume making payments - MarketWatch", "description": "Tens of millions of borrowers have had their student-debt payments paused. But one big fintech company disapproves and wants the payments resumed immediately.", "url": "https://www.marketwatch.com/story/sofi-sues-over-student-loan-pause-to-force-borrowers-to-resume-making-payments-3352c9f8", "urlToImage": "https://images.mktw.net/im-737307/social", "publishedAt": "2023-03-06T22:45:00Z", "content": "Some 40 million people have had their student-debt payments paused because the government thinks they need the help. But one big financial technology company, which refinances student loans, disappro… [+4261 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Surprises: Hubble Captures Stunning Movie of DART Asteroid Impact Debris - SciTechDaily", "description": "Never-Before-Seen Spacecraft Collision Yields Unexpected Surprises In 2022 NASA embarked on a bold experiment to see if they could change an asteroid's velocity by smacking it with a ballistic probe – kind of like hitting it with a hammer. This experiment was…", "url": "https://scitechdaily.com/unexpected-surprises-hubble-captures-stunning-movie-of-dart-asteroid-impact-debris/", "urlToImage": "https://scitechdaily.com/images/NASA-DART-Spacecraft-Prior-to-Impact-scaled.jpg", "publishedAt": "2023-03-05T21:15:37Z", "content": "BySpace Telescope Science InstituteMarch 5, 2023\r\nThis illustration depicts NASAs Double Asteroid Redirection Test (DART) spacecraft prior to impact at the Didymos binary asteroid system. Credit: NAS… [+11339 chars]"}]}