{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "M5 MacBook Pro SSD Read & Write Speeds Run Circles Around The M4 MacBook Pro, New Comparison Shows An Impressive 211% Faster Performance - Wccftech", "description": "Running Blackmagic speed test, the M5 MacBook Pro is shown to be equipped with faster NAND flash, gaining up to 211 percent faster performance than M4 model", "url": "https://wccftech.com/m5-macbook-pro-vs-m4-macbook-pro-ssd-read-and-write-speed-test-comparison/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/10/M5-MacBook-Pro-5-1.jpg", "publishedAt": "2025-10-25T20:40:00Z", "content": "The lack of cosmetic changes on the new MacBook Pro might paint an impression that Apple just incorporated its new M5 chipset and called it a day. Fortunately, there are a ton of upgrades added to th… [+2430 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Maxwell Zeff", "title": "The glaring security risks with AI browser agents - TechCrunch", "description": "New AI browsers from OpenAI and Perplexity promise to increase user productivity, but they also come with increased security risks.", "url": "https://techcrunch.com/2025/10/25/the-glaring-security-risks-with-ai-browser-agents/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/03/GettyImages-1290478576.jpg?resize=1200,846", "publishedAt": "2025-10-25T12:00:00Z", "content": "New AI-powered web browsers such as OpenAI’s ChatGPT Atlas and Perplexity’s Comet are trying to unseat Google Chrome as the front door to the internet for billions of users. A key selling point of th… [+6181 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Instagram’s latest feature lets you go back to see your watched Reels - TechCrunch", "description": "With this new feature, users can go back and find videos they might not have had the chance to save.", "url": "https://techcrunch.com/2025/10/24/instagrams-latest-feature-lets-you-go-back-see-your-watched-reels/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/10/1920x1280.png?resize=1200,800", "publishedAt": "2025-10-24T16:38:02Z", "content": "Instagram announced on Friday that it will now let you go back and see your previously watched Reels thanks to a new “Watch History” feature. Rival TikTok has had a Watch History feature for a few ye… [+1787 chars]"}]}