{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jon Brodkin", "title": "Microsoft wins battle with Sony as UK reverses finding on Activision merger - Ars Technica", "description": "Microsoft/Activision merger closer to approval as UK drops Call of Duty objection.", "url": "https://arstechnica.com/tech-policy/2023/03/microsoft-wins-battle-with-sony-as-uk-reverses-finding-on-activision-merger/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/playstation-5-760x380.jpg", "publishedAt": "2023-03-24T19:37:37Z", "content": "Enlarge/ Sony's PlayStation 5.\r\n69 with \r\nUK regulators reviewing Microsoft's proposed acquisition of Activision Blizzard reversed their stance on a key question today, saying they no longer believe … [+4373 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Meredith Fore", "title": "New experiment translates quantum information between technologies in an important step for the quantum internet - Phys.org", "description": "Researchers have discovered a way to \"translate\" quantum information between different kinds of quantum technologies, with significant implications for quantum computing, communication, and networking.", "url": "https://phys.org/news/2023-03-quantum-technologies-important-internet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-experiment-transla.jpg", "publishedAt": "2023-03-24T18:18:18Z", "content": "Researchers have discovered a way to \"translate\" quantum information between different kinds of quantum technologies, with significant implications for quantum computing, communication, and networkin… [+5289 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Framework refines its laptops and adds a cute way to reuse old parts - TechCrunch", "description": "Framework just showed off some new models, but also a neat case that you can slot old parts into to form a new (ish) desktop PC.", "url": "https://techcrunch.com/2023/03/24/framework-refines-its-laptops-and-adds-a-cute-way-to-reuse-old-parts/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/03/cooler-master-mainboard-case-02.jpg?resize=1200,847", "publishedAt": "2023-03-24T17:56:34Z", "content": "Framework is one of a few companies leading the charge against disposable electronics, in particular laptops. It just showed off some new models, but also a unique case that you can slot your old par… [+1513 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Chaos Unleashed: Surprising Breakthrough in Pursuit of Energy-Efficient Quantum Technologies - SciTechDaily", "description": "Magnetic topological insulators are an exotic class of materials that conduct electrons without any resistance at all and so are regarded as a promising breakthrough in materials science. Researchers from the Cluster of Excellence ct.qmat in Würzburg and Dres…", "url": "https://scitechdaily.com/quantum-chaos-unleashed-surprising-breakthrough-in-pursuit-of-energy-efficient-quantum-technologies/", "urlToImage": "https://scitechdaily.com/images/Ferromagnetic-Topological-Insulator-scaled.jpg", "publishedAt": "2023-03-24T09:31:15Z", "content": "ByUniversity of WürzburgMarch 24, 2023\r\nA team of researchers from the Cluster of Excellence ct.qmat based at the universities JMU Würzburg and TU Dresden has engineered the topological insulator man… [+7399 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Scientists discover easy way to make atomically-thin metal layers for new technology - Phys.org", "description": "The secret to a perfect croissant is the layers—as many as possible, each one interspersed with butter. Similarly, a new material with promise for new applications is made of many extremely thin layers of metal, between which scientists can slip different ion…", "url": "https://phys.org/news/2023-03-scientists-easy-atomically-thin-metal-layers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/uchicago-scientists-di.jpg", "publishedAt": "2023-03-24T07:39:52Z", "content": "The secret to a perfect croissant is the layersas many as possible, each one interspersed with butter. Similarly, a new material with promise for new applications is made of many extremely thin layer… [+4363 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 24 March 2023: Comet ZTF and the stars of Milky Way - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is of Comet ZTF fading away in the sky.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-24-march-2023-comet-ztf-and-the-stars-of-milky-way-71679638100857.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/24/1600x900/comet_1679638274443_1679638282033_1679638282033.jpg", "publishedAt": "2023-03-24T06:13:27Z", "content": "Comets are of great interest to scientists as they are remnants of the early Solar System, providing valuable information about its composition and conditions. One of these is the Rare Green Comet ZT… [+1723 chars]"}]}