{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Jules Bernstein", "title": "Methane from megafires: Novel detection technique raises pollution policy questions - Phys.org", "description": "Using a new detection method, UC Riverside scientists found a massive amount of methane, a super-potent greenhouse gas, coming from wildfires—a source not currently being accounted for by state air quality managers.", "url": "https://phys.org/news/2023-04-methane-megafires-technique-pollution-policy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/methane-from-megafires.jpg", "publishedAt": "2023-04-17T10:08:14Z", "content": "Using a new detection method, UC Riverside scientists found a massive amount of methane, a super-potent greenhouse gas, coming from wildfiresa source not currently being accounted for by state air qu… [+4858 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Galactic Surprise: James Webb Space Telescope Unveils Hidden Companion Galaxy - SciTechDaily", "description": "While analyzing data from the first images of a well-known early galaxy taken by NASA’s James Webb Space Telescope (JWST), Cornell University astronomers discovered a companion galaxy previously hidden behind the light of the foreground galaxy — one that surp…", "url": "https://scitechdaily.com/galactic-surprise-james-webb-space-telescope-unveils-hidden-companion-galaxy/", "urlToImage": "https://scitechdaily.com/images/Distant-Spiral-Galaxy-Art-Illustration.jpg", "publishedAt": "2023-04-17T08:27:16Z", "content": "ByCornell UniversityApril 17, 2023\r\nCornell University astronomers have discovered a companion galaxy while analyzing the first images of an early galaxy taken by NASAs James Webb Space Telescope (JW… [+10265 chars]"}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Forget nuclear weapons, as this technique could save earth from apocalyptic space bodies - IBTimes India", "description": "Earlier, space scientist Natalie Starkey had suggested that a pre-emptive nuclear strike is a perfect way by which planet Earth can be protected", "url": "https://www.ibtimes.co.in/forget-nuclear-weapons-this-technique-could-save-earth-apocalyptic-space-bodies-858314", "urlToImage": "https://data1.ibtimes.co.in/en/full/733985/nasa-working-asteroid-deflecting-machine.jpg", "publishedAt": "2023-04-17T06:35:44Z", "content": "It was around 66 million years back that a giant asteroid hit the Earth with full fury, causing chaos all around the planet. The asteroid impact was so huge, as it resulted in the extinction of dinos… [+1715 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA alert! Car-sized asteroid set to buzz Earth; Will get closer than Moon today - HT Tech", "description": "Asteroid 2023 HB is set to make a close approach to Earth at the blistering speed of 44087 km per hour.", "url": "https://tech.hindustantimes.com/tech/news/nasa-alert-car-sized-asteroid-set-to-buzz-earth-will-get-closer-than-moon-today-71681711433844.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/17/1600x900/asteroid_Flickr_1681711519769_1681711520017_1681711520017.jpg", "publishedAt": "2023-04-17T06:05:34Z", "content": "NASA has identified a small asteroid that has been named as Asteroid 2023 HB, and it is on its way for an unusually close encounter with Earth today. Surprisingly, NASA has only recently discovered t… [+2178 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jennifer Elias", "title": "Google CEO Sundar Pichai warns society to brace for impact of A.I. acceleration, says ‘it’s not for a company to decide' - CNBC", "description": "The executive told \"60 Minutes\" that the technology is moving fast and \"it’s not for a company to decide.\"", "url": "https://www.cnbc.com/2023/04/17/google-ceo-sundar-pichai-warns-society-to-brace-for-impact-of-ai-acceleration.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107073776-1654806510081-gettyimages-1401984578-_m013308_f6033df0-c78b-46fb-89a4-0840d45f458b.jpeg?v=1681708703&w=1920&h=1080", "publishedAt": "2023-04-17T05:18:23Z", "content": "Google CEO Sundar Pichai speaks at a panel at the CEO Summit of the Americas hosted by the U.S. Chamber of Commerce on June 09, 2022 in Los Angeles, California.\r\nGoogle and Alphabet CEO Sundar Pichai… [+4708 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Welcome to Mars! Caltech's Jaw-Dropping, 5.7 Terapixel Virtual Expedition Across the Red Planet - SciTechDaily", "description": "Both scientists and the public can navigate a new global image of the Red Planet that was made at Caltech using data from NASA’s Mars Reconnaissance Orbiter. Caltech has used data from NASA's Mars Reconnaissance Orbiter to create the highest-resolution global…", "url": "https://scitechdaily.com/welcome-to-mars-caltechs-jaw-dropping-5-7-terapixel-virtual-expedition-across-the-red-planet/", "urlToImage": "https://scitechdaily.com/images/Global-CTX-Mosaic-of-Mars.jpg", "publishedAt": "2023-04-16T20:45:08Z", "content": "ByJet Propulsion LaboratoryApril 16, 2023\r\nThe Global CTX Mosaic of Mars allows scientists and the public to explore the planet like never before. It includes different layers of data that can be tur… [+6614 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Paladin Space pioneers tech to hoover dangerous space junk - Interesting Engineering", "description": "Report about Paladin Space, a startup that aims to make space free from junk, with their reusable space debris remover.", "url": "https://interestingengineering.com/science/paladin-space-pioneers-tech-to-hoover-dangerous-space-junk", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/16/image/jpeg/6uDGEj8eyYQ9ZwX0ShBUX7V7MNivwYcW9AdHy0P2.jpg", "publishedAt": "2023-04-16T15:17:00Z", "content": "The problem is of such consequence that space agencies and private space firms have made it their priority to find solutions. \r\nNew low-Earth orbit satellites must prove that they can safely be dispo… [+1119 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Uncovers Secret of Mammals' Evolutionary Success - SciTechDaily", "description": "A recent study has uncovered the secret to the success of one of the most prosperous animal lineages — modern mammals. The key, according to the study, was to start out small and simple. According to the study, the ancestors of modern mammals, over 300 millio…", "url": "https://scitechdaily.com/new-study-uncovers-secret-of-mammals-evolutionary-success/", "urlToImage": "https://scitechdaily.com/images/Artistic-Reconstruction-of-Early-Mammal-Ancestors.jpg", "publishedAt": "2023-04-15T19:25:37Z", "content": "Digital skull model of the small-sized Jurassic mammal ancestor Hadrocodium wui. Credit: Dr. Stephan Lautenschlager, University of Birmingham\r\nA recent study has uncovered the secret to the success o… [+2837 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of the Early Universe: Scientists Double Sensitivity of HERA Radio Telescope - SciTechDaily", "description": "Astronomers have taken a significant step forward in uncovering the mysteries of the cosmic dawn. A collection of 350 radio telescopes located in the Karoo desert of South Africa is rapidly advancing towards the detection of the \"cosmic dawn\" - the period fol…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-the-early-universe-scientists-double-sensitivity-of-hera-radio-telescope/", "urlToImage": "https://scitechdaily.com/images/A-HERA-Antenna-at-Night-in-the-Karoo-South-Africa-scaled.jpg", "publishedAt": "2023-04-15T18:35:33Z", "content": "ByMcGill UniversityApril 15, 2023\r\nThe HERA radio telescope, located in Karoo in South Africa, consists of 350 dishes pointed upward to detect radio waves from the early universe. Credit: Dara Storer… [+6844 chars]"}]}