{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm set to strike Earth in just a few hours, says NASA; Know the danger - HT Tech", "description": "NASA models have shown that a solar storm will strike the Earth in just a few hours. It is being caused by one of the numerous solar flare eruptions that took place recently. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-set-to-strike-earth-in-just-a-few-hours-says-nasa-know-the-danger-71691153736730.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/04/1600x900/m73-flare-rotated_0_1680256680821_1691153773285.jpeg", "publishedAt": "2023-08-04T13:00:16Z", "content": "Recently, the European Space Agency (ESA) revealed details about a 2021 solar storm that was so massive that it struck the Earth, the Moon, and Mars at the same time. Luckily, that event did not impa… [+2402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover a Surprising Link Between Pure Mathematics and Genetics - SciTechDaily", "description": "An interdisciplinary team of mathematicians, engineers, physicists, and medical scientists has discovered a surprising connection between pure mathematics and genetics. This connection sheds light on the structure of neutral mutations and the evolution of org…", "url": "https://scitechdaily.com/scientists-uncover-a-surprising-link-between-pure-mathematics-and-genetics/", "urlToImage": "https://scitechdaily.com/images/Evolution-Genetics-Abstract.jpg", "publishedAt": "2023-08-04T11:24:45Z", "content": "Researchers have discovered an unexpected link between number theory in mathematics and genetics, providing critical insight into the nature of neutral mutations and the evolution of organisms. The t… [+2043 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Perseid Meteor Shower and a Rare Super Blue Moon - SciTechDaily", "description": "Saturn shines brightly all night in August, while the Perseids return for a good show on the 12th/13th, and a Super Blue Moon! What are some skywatching highlights in August 2023? Saturn reaches opposition this month, meaning it's at its biggest and brightest…", "url": "https://scitechdaily.com/dont-miss-perseid-meteor-shower-and-a-rare-super-blue-moon/", "urlToImage": "https://scitechdaily.com/images/Meteor-Shower-Art-Concept.jpg", "publishedAt": "2023-08-04T08:17:10Z", "content": "ByNASA Jet Propulsion LaboratoryAugust 4, 2023\r\nAugust offers a celestial extravaganza with clear views of Saturn at its opposition, the return of the annual Perseid meteor shower, and a rare super b… [+8042 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for August 4: Grab freebies before the update! - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for August 4: If you wish to change your character’s look before the OB41 update arrives, you can do so with Garena Free Fire MAX redeem codes. Know how to claim them.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-august-4-grab-freebies-before-the-update-71691111778891.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/04/1600x900/e550be0c037dcef6cedbfd875a46491ajpg_1_1691111890668_1691111890967.jpg", "publishedAt": "2023-08-04T01:29:01Z", "content": "Garena Free Fire MAX Redeem Codes for August 4: The next update for Garena Free Fire MAX will arrive soon and the release date is now officially announced. The OB41 Advanced Server for Garena Free Fi… [+2200 chars]"}]}