{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Wayne Smith", "title": "NASA solar sail technology passes crucial deployment test - Phys.org", "description": "In his youth, NASA technologist Les Johnson was riveted by the 1974 novel \"The Mote in God's Eye,\" by Jerry Pournelle and Larry Niven, in which an alien spacecraft propelled by solar sails visits humanity. Today, Johnson and a NASA team are preparing to test …", "url": "https://phys.org/news/2024-02-nasa-solar-technology-crucial-deployment.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/nasa-solar-sail-techno.jpg", "publishedAt": "2024-02-13T21:17:28Z", "content": "In his youth, NASA technologist Les Johnson was riveted by the 1974 novel \"The Mote in God's Eye,\" by Jerry Pournelle and Larry Niven, in which an alien spacecraft propelled by solar sails visits hum… [+4529 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "ChatGPT will now remember — and forget — things you tell it to - TechCrunch", "description": "OpenAI's ChatGPT chatbot is getting a new feature that allows it to remember and forget specific facts and details.", "url": "https://techcrunch.com/2024/02/13/chatgpt-will-now-remember-and-forget-things-you-tell-it-to/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/09/GettyImages-1647521480-e1694685235777.jpg?resize=1200,676", "publishedAt": "2024-02-13T19:22:51Z", "content": "You’ll soon be able to tell ChatGPT to forget things — or remember specific things in future conversations.\r\nToday, as part of a test, OpenAI began rolling out new “memory” controls for a small porti… [+3224 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How NASA Uses Simple Technology to Track Lunar Missions - NASA Goddard", "description": "NASA is using a simple but surprisingly effective technology called Laser Retroreflective Arrays (LRAs) to determine the locations of lunar landers more accu...", "url": "https://www.youtube.com/watch?v=L2TMQpw76iQ", "urlToImage": "https://i.ytimg.com/vi/L2TMQpw76iQ/hqdefault.jpg", "publishedAt": "2024-02-13T15:09:14Z", "content": null}]}