{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "SARS-CoV-2 virus variant that showed rapid transmission in Assam, can help predicting local spread of the disease - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/sars-cov-2-virus-variant-showed-rapid-transmission-assam-can-help-predicting-local-spread-disease", "urlToImage": null, "publishedAt": "2023-09-15T11:08:52Z", "content": "A dominant haplotype of the delta variant of A SARS-CoV-2 virus that had been rapidly transmitting in Assam by evading the immune system of humans has revealed the dynamics of viral haplotype transmi… [+2921 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Says No Proof Aliens Exist But Says \"No Reason To Conclude\" - NDTV", "description": "The report said that it is not denying the possibility of \"potential unknown alien technology operating in Earth's atmosphere\"", "url": "https://www.ndtv.com/world-news/nasa-says-no-proof-aliens-exist-but-says-no-reason-to-conclude-4392188", "urlToImage": "https://c.ndtvimg.com/2023-09/r6s25cq8_ufo_625x300_15_September_23.jpg", "publishedAt": "2023-09-15T08:37:52Z", "content": "An independent committee released its report on Thursday.\r\nAmerican space agency NASA gave a platform to an independent committee looking into the reported sightings of unidentified flying objects (U… [+3203 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Tushar Goenka", "title": "Ecosystem, not price play: Why the made in India iPhone costs an arm and a leg in India - Moneycontrol", "description": "The tech giant’s moves to manufacture products, set up stores and partner with resellers are all part of its plan to set up an ecosystem in India. It is unlikely to lower prices and play the volume game.", "url": "https://www.moneycontrol.com/news/business/ecosystem-not-price-play-why-the-made-in-india-iphone-costs-an-arm-and-a-leg-in-india-11373141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/03/Collage-Maker-29-Mar-2023-01-50-PM-3848-770x433.jpg", "publishedAt": "2023-09-15T04:46:32Z", "content": "Apples decision to keep the prices of the latest iPhone elevated may have surprised buyers, but industry experts said that the tech titan was never gearing up to assemble in India to lower prices. Th… [+4415 chars]"}]}