{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Atomic-Scale Window Into Superconductivity Paves Way for Advanced New Quantum Materials - SciTechDaily", "description": "New technique helps researchers understand unconventional superconductors. One of nature's most fascinating quantum phenomena is superconductivity. When a superconducting material is cooled below its critical temperature, electricity can flow without any loss…", "url": "https://scitechdaily.com/atomic-scale-window-into-superconductivity-paves-way-for-advanced-new-quantum-materials/", "urlToImage": "https://scitechdaily.com/images/Andreev-Reflection.jpg", "publishedAt": "2022-06-05T12:49:42Z", "content": "ByAalto UniversityJune 5, 2022\r\nIllustration of Andreev reflection between a superconductor and an atomically sharp metal tip. Credit: Aalto University / Jose Lado\r\nNew technique helps researchers un… [+4068 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Watch Apple WWDC 2022 LIVE Online; Know when and where livestream will be available - HT Tech", "description": "Apple WWDC 2022 event is going to take place on Monday, June 6, 2022. The event can be watched online. Check when and where here.", "url": "https://tech.hindustantimes.com/tech/news/watch-apple-wwdc-2022-live-online-know-when-and-where-livestream-will-be-available-71654430953300.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/05/1600x900/5_1646716415140_1654431530619.jpg", "publishedAt": "2022-06-05T12:20:06Z", "content": "Apple's Worldwide Developer Conference (WWDC) is almost here. The WWDC 2022 event will take place on Monday, June 6. If you want to watch the event live and want to see Apple's CEO Tim Cook speaking,… [+2736 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Turns to Private Sector for New Spacesuits for Exploring the Surface of the Moon - SciTechDaily", "description": "NASA selects Axiom Space and Collins Aerospace for next-generation spacesuit and spacewalk systems. Axiom Space is an American privately funded space infrastructure developer headquartered in Houston, Texas, that has been in the news a lot recently because of…", "url": "https://scitechdaily.com/?p=175542", "urlToImage": "https://scitechdaily.com/images/Astronauts-Working-on-Lunar-Surface-scaled.jpg", "publishedAt": "2022-06-05T11:19:40Z", "content": "ByNASAJune 5, 2022\r\nAn artists illustration of two suited crew members working on the lunar surface. The one in the foreground lifts a rock to examine it while the other photographs the collection si… [+5640 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Counting Galaxies To Solve a Cosmological Puzzle: Putting the Theory of Special Relativity Into Practice - SciTechDaily", "description": "The theory of relativity was developed by Albert Einstein in the early 1900s due to the inability of classical physics to explain certain observations. It has two components, special relativity and general relativity. Special relativity is based on the key co…", "url": "https://scitechdaily.com/counting-galaxies-to-solve-a-cosmological-puzzle-putting-the-theory-of-special-relativity-into-practice/", "urlToImage": "https://scitechdaily.com/images/Spacetime-Special-Relativity-Concept.jpg", "publishedAt": "2022-06-05T09:48:48Z", "content": "ByUniversity of Colorado at BoulderJune 5, 2022\r\nThe theory of relativity usually encompasses two interrelated theories by Albert Einstein: special relativity published in 1905 and general relativity… [+6998 chars]"}, {"source": {"id": null, "name": "Buzz.ie"}, "author": "Mark Kavanagh", "title": "Garmin Instinct Solar review: incredibly durable GPS smartwatch with potentially unlimited battery life - Buzz.ie", "description": "Garmin's Instinct Solar has much of the same tech as the more expensive Fenix 6 model but costs less than €300", "url": "https://www.buzz.ie/tech/gadgets/garmin-instinct-solar-tech-review-27146850", "urlToImage": "https://i2-prod.irishmirror.ie/incoming/article27147112.ece/ALTERNATES/s1200/0_solar4.jpg", "publishedAt": "2022-06-05T08:53:16Z", "content": "Garmin's fitness watch line-up offers wearables to suit every need and budget.\r\nOne of the best value multisport watches in its arsenal is the original Instinct Solar, a GPS running watch with potent… [+3303 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "For Global Tech Landscape, Decades-Long Golden Era Likely Coming To An End - NDTV Profit", "description": "From Seattle to Silicon Valley to Austin, a grim new reality is setting in across the tech landscape: a heady, decades-long era of rapid sales gains, boundless jobs growth and ever-soaring stock prices is coming to an end.", "url": "https://www.ndtv.com/business/techs-grim-new-reality-decades-long-golden-era-is-coming-to-an-end-3039622", "urlToImage": "https://c.ndtvimg.com/2022-06/lq7k97po_image_625x300_05_June_22.jpg", "publishedAt": "2022-06-05T07:18:56Z", "content": "No Longer Sure Bets: Tech Giants Are Dropping Bad News Daily\r\nFrom Seattle to Silicon Valley to Austin, a grim new reality is setting in across the tech landscape: a heady, decades-long era of rapid … [+8769 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Why this European island country is attracting more South Africans - BusinessTech", "description": "With digitization and the global trend of remote working on the rise, this Mediterranean country offers residency through investment programmes as well as a specific scheme for digital nomads.", "url": "https://businesstech.co.za/news/property/586188/why-this-european-island-country-is-attracting-more-south-africans/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/05/shutterstock_1987621631-e1652428563576.jpg", "publishedAt": "2022-06-05T05:07:07Z", "content": "Malta offers a place for South Africans a thriving remote working environment, says Charles Mizzi, the chief executive officer of Residency Malta Agency.\r\nIn a recent interview with Michael Avery on … [+3064 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's DAVINCI Space Probe To Plunge Through Hellish Atmosphere of Venus - SciTechDaily", "description": "Last year, NASA selected the DAVINCI mission as part of its Discovery program. It will investigate the origin, evolution, and present state of Venus in unparalleled detail from near the top of the clouds to the planet’s surface. Venus, the hottest planet in t…", "url": "https://scitechdaily.com/nasas-davinci-space-probe-to-plunge-through-hellish-atmosphere-of-venus/", "urlToImage": "https://scitechdaily.com/images/DAVINCI-Probe-Near-Venus-Surface-scaled.jpg", "publishedAt": "2022-06-04T17:19:36Z", "content": "ByNancy Neal Jones, NASAs Goddard Space Flight CenterJune 4, 2022\r\nNASAs DAVINCI mission will study the origin, evolution, and present state of Venus in unprecedented detail from near the top of the … [+9985 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "Startups, Innovation and Technology in Africa. - Techpoint Africa", "description": "Startups, Innovation and Technology in Africa", "url": "https://techpoint.africa/", "urlToImage": null, "publishedAt": "2022-06-04T03:18:35Z", "content": null}, {"source": {"id": null, "name": "TechSpot"}, "author": "Shawn Knight", "title": "Here's how many daily downloads it takes to hit the top spot in the App Store and Google Play - TechSpot", "description": "It now requires approximately 156,000 downloads on any given day to get a free, non-gaming iPhone app to the number one position in the App Store in...", "url": "https://www.techspot.com/news/94821-here-how-many-daily-downloads-takes-hit-top.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/06/2022-06-03-image-13.jpg", "publishedAt": "2022-06-03T19:02:00Z", "content": "In brief: Developers looking to get their apps to the top spot in a mobile app store now have a pretty good idea of how many downloads it takes thanks to the latest report from analytics firm Sensor … [+1201 chars]"}, {"source": {"id": null, "name": "Ucsb.edu"}, "author": null, "title": "Spotted! Astrophysicists Release the First Ever Image of a Black Hole in the Milky Way - The Bottom Line", "description": "Hailey Hill Science & Tech Editor Despite the dramatic advances in modern technology and space exploration, much about our home galaxy the Milky Way has remained shrouded in mystery. However, recent discoveries have brought astrophysicists a bit closer to bet…", "url": "https://thebottomline.as.ucsb.edu/2022/06/spotted-astrophysicists-release-the-first-ever-image-of-a-black-hole-in-the-milky-way", "urlToImage": null, "publishedAt": "2022-06-03T17:00:00Z", "content": "Hailey Hill\r\nScience &amp; Tech Editor\r\nDespite the dramatic advances in modern technology and space exploration, much about our home galaxy the Milky Way has remained shrouded in mystery. \r\nHowever,… [+3220 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/valentina-palladino", "title": "AirPods Pro drop to $180, plus the rest of the week's best tech deals - Engadget", "description": "This week's best tech deals include Apple's AirPods Pro for $180, Samsung's Galaxy Buds 2 for $95 and iRobot's Roomba 694 for $180..", "url": "https://www.engadget.com/apple-airpods-pro-drop-to-180-best-tech-deals-this-week-154557377.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2020-07/bd13d570-cdc0-11ea-bddb-696b5bd00b0a", "publishedAt": "2022-06-03T16:14:07Z", "content": "Memorial Day may have come and gone, but you can still pick up some of our favorite electronics for less thanks to some holiday deals that are still available now. Apple's third-generation AirPods ar… [+6803 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "The Next GameStop Is a Faded Brand in the Metaverse - HT Tech", "description": "Shares of former high-flying smartphone brand HTC have doubled as investors feed on hope and hype.", "url": "https://tech.hindustantimes.com/tech/news/the-next-gamestop-is-a-faded-brand-in-the-metaverse-71654264549861.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/03/1600x900/GAMESTOP-STOCKS--0_1654268025392_1654268056343.JPG", "publishedAt": "2022-06-03T15:23:26Z", "content": "Its becoming a familiar story: A once-famous brand, beloved by fans but unable to keep up with changing times, loses money hand over fist and its shares get beaten down. Suddenly, retail investors de… [+4232 chars]"}]}