{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Idris Shehu", "title": "Awabah accepted into Techstars London accelerator programme - TheCable", "description": "Awabah, the Nigeria-based startup providing pension access to Africa's informal sector, has been accepted into the Techstars London accelerator programme.", "url": "https://www.thecable.ng/awabah-accepted-into-techstars-london-accelerator-programme", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2021/08/Awabah-3.png", "publishedAt": "2021-08-22T15:17:00Z", "content": "Awabah, the Nigeria-based startup providing pension access to Africa’s informal sector, has been accepted into the Techstars London accelerator programme.\r\nThe company broke the news in a press state… [+1717 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp Desktop app: Know new features and how to download - WhatsApp just launched beta program - HT Tech", "description": "WhatsApp for Desktop app is now open for beta testing. WhatsApp has allowed users to download the new features. Here’s how to start testing the latest beta version of the WhatsApp for Desktop app.", "url": "https://tech.hindustantimes.com/laptops-pc/news/whatsapp-desktop-app-know-new-features-and-how-to-download-whatsapp-just-launched-beta-program-71629637188989.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/08/22/1600x900/2020-08-19T093016Z_1_LYNXNPEG7I0MM_RTROPTP_3_HEALTH-CORONAVIRUS-WHATSAPP_1600102965051_1600102993575_1629637250046.JPG", "publishedAt": "2021-08-22T12:59:48Z", "content": "WhatsApp is facing stiff competition from tough rivals like Telegram, Signal and others. In fact, that is not all, even some unofficial apps like WhatsApp Plus and GB WhatsApp and others, which are r… [+2452 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "realme Pad could launch with 10.4-inch OLED display and quad-speakers - TechNave", "description": "A few weeks back, it was suggested that&nbsp;realme&nbsp;would launch the realme Book and&nbsp;realme Pad&nbsp;soon. Some people were thinking that both would l", "url": "https://technave.com/gadget/realme-Pad-could-launch-with-10-4-inch-OLED-display-and-quad-speakers-26308.html", "urlToImage": "https://technave.com/data/files/article/202108221104478343.jpg", "publishedAt": "2021-08-22T11:16:46Z", "content": "A few weeks back, it was suggested that realme would launch the realme Book and realme Pad soon. Some people were thinking that both would launch together, though that didn't seem to be the case. How… [+851 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "CapitalSage Raises $ 4 Million to Deepen Financial Inclusion - BollyInside - BollyInside", "description": "This makes CapitalSage the first fintech company to be noted on a Private Markets platform and the fintech company which has raised the highest debt", "url": "https://www.bollyinside.com/news/capitalsage-raises-4-million-to-deepen-financial-inclusion", "urlToImage": null, "publishedAt": "2021-08-22T07:01:05Z", "content": "This makes CapitalSage the first fintech company to be noted on a Private Markets platform and the fintech company which has raised the highest debt amount in the Nigerian capital markets. The compan… [+1524 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": "Associated Press", "title": "Yordenis Ugas beats Manny Pacquiao by unanimous decision - Sportsnet.ca", "description": "Yordenis Ugas beat Manny Pacquiao by unanimous decision on Saturday night, putting on an impressive technical performance on 11 days' notice and retaining his WBA welterweight title.", "url": "https://www.sportsnet.ca/more/article/yordenis-ugas-beats-manny-pacquiao-unanimous-decision/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2021/08/pacquiao-boxing-1.jpg", "publishedAt": "2021-08-22T05:24:00Z", "content": "LAS VEGAS — Although Manny Pacquiao hasn’t decided what his future holds, the eight-division world champion realizes his 26-year professional boxing career might have ended Saturday night with a dish… [+5436 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Genshin Impact 2.1 update announced with new characters, islands and fishing; get free Primogem redeem codes too - HT Tech", "description": "Genshin Impact 2.1 update. The game is set to receive new and updated in-game content as part of the upcoming version 2.1 update. Here’s everything you need to know and how to claim free Primogem rewards right away.", "url": "https://tech.hindustantimes.com/gaming/news/genshin-impact-2-1-update-announced-with-new-characters-islands-and-fishing-get-free-primogem-redeem-codes-too-71629609515370.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/08/22/1600x900/2021082119245498236_1629609486920_1629609512602.jpg", "publishedAt": "2021-08-22T05:18:35Z", "content": "Genshin Impact 2.1 update has just been announced. Popular online action roleplaying game Genshin Impact will receive an update to version 2.1 which will bring important changes to the game, develope… [+2675 chars]"}, {"source": {"id": null, "name": "bdnews24.com"}, "author": null, "title": "Is an exoskeleton suit in your future? - bdnews24.com", "description": "Those of us who are slow or reluctant runners or walkers might soon be able to slip on a lightweight, lower-body exoskeleton and up the speed and ease of our exercise, according to several new studies examining the effects of these high-tech robotic devices. …", "url": "https://bdnews24.com/science/2021/08/22/is-an-exoskeleton-suit-in-your-future", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2021/08/22/exoskeleton-220821-01.jpg/ALTERNATES/w640/exoskeleton-220821-01.jpg", "publishedAt": "2021-08-22T04:08:35Z", "content": "But the latest exoskeleton research also raises provocative questions about what we want from exercise and whether making it easier necessarily makes it better.\r\nExoskeletons have been staples of sci… [+5189 chars]"}, {"source": {"id": null, "name": "The Motley Fool Canada"}, "author": null, "title": "Forget Shopify (TSX:SHOP): This E-Commerce Stock Is Much Better - The Motley Fool Canada", "description": "Shopify (TSX:SHOP)(NYSE:SHOP) stock has priced-in most of its future growth, but other tech stocks are undervalued.", "url": "https://www.fool.ca/2021/08/21/forget-shopify-tsxshop-this-e-commerce-stock-is-much-better/", "urlToImage": "https://www.fool.ca/wp-content/uploads/2020/10/grow.jpg", "publishedAt": "2021-08-21T15:41:36Z", "content": "Home » Investing » Forget Shopify (TSX:SHOP): This E-Commerce Stock Is Much BetterShopify(TSX:SHOP)(NYSE:SHOP) is Canada’s biggest tech success story. In under six years, the stock has delivered a 5,… [+2977 chars]"}, {"source": {"id": null, "name": "Globalriskinsights.com"}, "author": "by  Jordan Dobney", "title": "Technological pull or competitive drive? China’s rover landing sends a message to the United States - Global Risk Insights", "description": "On Friday 14th May, China’s Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hopes their Zhurong rover will give them 90 days of service as…", "url": "https://globalriskinsights.com/2021/08/technological-pull-or-competitive-drive-chinas-rover-landing-sends-a-message-to-the-united-states/", "urlToImage": "https://i0.wp.com/globalriskinsights.com/wp-content/uploads/2021/08/50144550853_9e78484352_b.jpg?fit=800%2C440&ssl=1", "publishedAt": "2021-08-21T15:12:13Z", "content": "On Friday 14th May, Chinas Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hop… [+5400 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Daniel Sims", "title": "AMD's upcoming AM5 socket for Raphael processors appears to lack PCIe 5.0 support - TechSpot", "description": "TechPowerUp's sources familiar with the ransomware attack on Gigabyte provided them with a block diagram of the AM5 socket, showing its connections to other components. AM5 is...", "url": "https://www.techspot.com/news/90888-amd-upcoming-am5-socket-raphael-processors-appears-lack.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2020/11/2020-11-06-image-33.jpg", "publishedAt": "2021-08-21T14:07:00Z", "content": "In brief: According to TechPowerUp, the socket for AMD's next generation of CPUs will not support PCIe 5.0. This information reportedly came from the ransomware attack Gigabyte suffered earlier this … [+1459 chars]"}, {"source": {"id": null, "name": "Themarketwriteup.com"}, "author": null, "title": "Lung Cancer Screening Software Market is Booming Worldwide | PenRad Technologies, Thynk Health, ProVation Medical - The Market Writeuo - The Market Writeuo", "description": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Market research report shows the latest market insights; curren…", "url": "https://themarketwriteup.com/lung-cancer-screening-software-market-is-booming-worldwide-penrad-technologies-thynk-health-provation-medical/", "urlToImage": null, "publishedAt": "2021-08-21T13:38:58Z", "content": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Mar… [+5073 chars]"}, {"source": {"id": null, "name": "The Irish News"}, "author": "", "title": "China's Mars rover soldiers on after finishing initial programme - The Irish News", "description": "The National Space Administration said the Zhurong rover completed its 90-day programme on August 15 and was in excellent technical condition.", "url": "https://www.irishnews.com/magazine/science/2021/08/21/news/china-s-mars-rover-soldiers-on-after-finishing-initial-programme-2424556/", "urlToImage": "http://www.irishnews.com/picturesarchive/irishnews/irishnews/2021/08/21/160059862-69c0ddba-0ca5-4281-90c2-568c676933f8.jpg", "publishedAt": "2021-08-21T10:07:03Z", "content": "China’s Mars rover is soldiering on after completing its initial programme to explore the red planet and search for frozen water that could provide clues to whether it once supported life.\r\nThe Natio… [+1762 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "World’s first plasmid DNA vaccine against Covid-19 gets emergency approval in India - RT", "description": "India’s drug regulator has approved a three-dose Covid-19 vaccine which uses plasmid DNA technology developed by indigenous drugmaker Zydus Cadila, after trials indicated it was 66.6% effective.", "url": "https://www.rt.com/news/532650-cadila-india-covid-plasmid-vaccine/", "urlToImage": "https://cdni.rt.com/files/2021.08/article/611fd17385f54058d23e8ae9.JPG", "publishedAt": "2021-08-20T16:01:00Z", "content": "On Friday, the Drug Controller General of India gave the green light to Zydus Cadila’s Covid-19 vaccine. The inoculation, now the sixth such to be approved in India, has received Emergency Use Author… [+2009 chars]"}]}