{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "NASA: Contact lost with $32.7 mn Capstone spacecraft on way to test moon orbit, but hope floats - HT Tech", "description": "NASA said it has lost contact with a $32.7 million spacecraft headed to the moon to test out a lopsided lunar orbit, but agency engineers are hopeful they can fix the problem.", "url": "https://tech.hindustantimes.com/tech/news/nasa-contact-lost-with-32-7-mn-capstone-spacecraft-on-way-to-test-moon-orbit-71657099286254.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/06/1600x900/Rocket-Launch-Moon-0_1657122328548_1657122372389.jpg", "publishedAt": "2022-07-06T15:47:42Z", "content": "NASA said Tuesday it has lost contact with a $32.7 million spacecraft headed to the moon to test out a lopsided lunar orbit, but agency engineers are hopeful they can fix the problem.\r\nAfter one succ… [+960 chars]"}, {"source": {"id": null, "name": "Medtechdive.com"}, "author": "Nick Paul Taylor", "title": "'Little sign' that digital tools are being deployed effectively in fight against COVID outbreak, study finds - MedTech Dive", "description": "To help reduce the spread of the next pandemic, there is “a substantial practical advantage” to integrating the features of multiple smartphone apps, a Scripps Research Translational Institute team found.", "url": "https://www.medtechdive.com/news/little-sign-that-digital-tools-are-being-deployed-effectively-in-fight-ag/626605/", "urlToImage": "https://www.medtechdive.com/imgproxy/6uHeLoacHiwkFYGteO32SFgH-tc-CJxbAWvrsjUqFx8/g:ce/rs:fill:770:364:0/bG9jYWw6Ly8vZGl2ZWltYWdlL0NvdmlkVHJhY2luZ19BcHBfR2V0dHkuanBn.jpg", "publishedAt": "2022-07-06T15:44:52Z", "content": "Dive Brief:\r\n<ul><li>While smartphone applications have been used to track COVID-19 outbreaks, screen patients and trace contacts, a Scripps Research Translational Institute team found a lack of data… [+2368 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Single-Step, Lithography-Free Synthesis of High-Density Nanoribbon Arrays - AZoNano", "description": "New research presents a single-step, lithography-free fabrication technique for producing high-density MoTe2 nanoribbon arrays on a standard SiO2/Si platform directly, without the need for specifically stepped substrates or post-processing methods.", "url": "https://www.azonano.com/news.aspx?newsID=39377", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39377_1657116115958505.jpg", "publishedAt": "2022-07-06T14:03:00Z", "content": "A paper published in the journal Materials Today describes a single-step, lithography-free chemical vapor deposition (CVD) fabrication approach for producing single-crystalline molybdenum ditelluride… [+5392 chars]"}, {"source": {"id": null, "name": "FOX 31 Denver"}, "author": "Kirk Yuhnke", "title": "Tech Junkie – New Samsung Galaxy A53 proves budget phones require few sacrifices - FOX 31 Denver", "description": "There was a time when budget phones were awful. Downright hard to use. Those days are gone and the “budget” options are better than ever before. The newest from Samsung is the Galaxy S53, I took it for a test. The A53 is a budget phone that feels high-end. Th…", "url": "https://kdvr.com/news/technology/tech-junkie-new-samsung-galaxy-a53-proves-budget-phones-require-few-sacrifices/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2022/07/20220706_063300.jpg?w=1280", "publishedAt": "2022-07-06T13:31:47Z", "content": "There was a time when budget phones were awful. Downright hard to use. Those days are gone and the “budget” options are better than ever before. The newest from Samsung is the Galaxy S53, I took it f… [+2250 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "Study sets new constraints on dark photons using a new dielectric optical haloscope - Phys.org", "description": "Researchers at the National Institute of Standards and Technology (NIST), Massachusetts Institute of Technology (MIT) and the Perimeter Institute recently set new constraints on dark photons, which are hypothetical particles and renowned dark matter candidate…", "url": "https://phys.org/news/2022-07-constraints-dark-photons-dielectric-optical.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/study-sets-new-constra.jpg", "publishedAt": "2022-07-06T13:30:02Z", "content": "Researchers at the National Institute of Standards and Technology (NIST), Massachusetts Institute of Technology (MIT) and the Perimeter Institute recently set new constraints on dark photons, which a… [+5045 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Dan Milmo", "title": "UK could force messaging apps to adopt new technology to tackle abuse images - The Guardian", "description": "Home secretary says new powers to require tech firms to remove encrypted abuse material would bring privacy and security", "url": "https://amp.theguardian.com/technology/2022/jul/06/uk-could-force-messaging-apps-to-scan-for-child-sexual-abuse-images", "urlToImage": null, "publishedAt": "2022-07-06T13:29:00Z", "content": "EncryptionAmendment to online safety bill would require tech firms to make their best endeavours to deploy new technology\r\nHeavily encrypted messaging services such as WhatsApp could be required to a… [+4154 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "The Cabal", "title": "The top smartphone apps in Africa - TechCabal", "description": "In June 2020 the article “Africa's most popular apps & the insights they reveal” gave insight into internet use trends in Africa.", "url": "https://techcabal.com/2022/07/06/the-top-smartphone-apps-in-africa/", "urlToImage": "https://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2022/07/smarthone-app.jpg", "publishedAt": "2022-07-06T12:48:59Z", "content": "This insightful op-ed was contributed to TechCabal by Emeka Ajene. Emeka Ajene co-founded Gozem alongside Raphael Dana in 2018.\r\nWhile the African continent is often discussed as a single united enti… [+11707 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Doctors Warn of Vitamin D Supplement “Overdosing” – Man Hospitalized After Losing 28 Pounds - SciTechDaily", "description": "‘Hypervitaminosis D’ is on the rise and linked to a wide range of potentially serious health issues. Doctors are warning that ‘Overdosing’ on vitamin D supplements is both possible and harmful after they treated a man who needed hospital admission for his exc…", "url": "https://scitechdaily.com/doctors-warn-of-vitamin-d-supplement-overdosing-man-hospitalized-after-losing-28-pounds/", "urlToImage": "https://scitechdaily.com/images/Vitamin-D-Softgel-Supplements-Bottle.jpg", "publishedAt": "2022-07-06T12:29:55Z", "content": "Doctors warn that Overdosing on vitamin D supplements is both possible and harmful.\r\nHypervitaminosis D is on the rise and linked to a wide range of potentially serious health issues.\r\nDoctors are wa… [+4582 chars]"}, {"source": {"id": null, "name": "Taproot.news"}, "author": "Karen Unland", "title": "Neuroscience hackathon offers chance to solve real-life problems - Taproot Edmonton", "description": "If you have been thinking about a challenge that might be tackled with neurotechnology, this summer provides an opportunity to get some help from students and recent grads who are looking for real-world problems to solve.", "url": "https://edmonton.taproot.news/news/2022/07/06/neuroscience-hackathon-offers-chance-to-solve-real-life-problems", "urlToImage": "https://mcusercontent.com/cf49a42db023942d337b0dabf/images/1204c37a-0981-bdd2-ab75-de1035984607.jpg", "publishedAt": "2022-07-06T12:00:00Z", "content": "At the heart of neurotechnology is BCI, or brain-computer interface. Translating a person's brain activity into external responses has numerous applications, such as enabling recovery from a stroke o… [+2998 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - How to see Webb's new images - ESA Science & Technology", "description": "As excitement mounts for the unveiling of Webb’s first full-colour images on Tuesday 12 July, here’s how to participate in the global celebration via ESA’s channels. Choose from watching a livestream, attending an in-person event, or joining our social media …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/How_to_see_Webb_s_new_images", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2021/03/artist_s_impression_of_the_james_webb_space_telescope/23231075-5-eng-GB/Artist_s_impression_of_the_James_Webb_Space_Telescope_pillars.jpg", "publishedAt": "2022-07-06T10:16:06Z", "content": "Science &amp; Exploration05/07/202211098 views32 likes\r\nAs excitement mounts for the unveiling of Webbs first full-colour images on Tuesday 12 July, heres how to participate in the global celebration… [+3516 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Warning over pension change for South Africa - BusinessTech", "description": "Retirement funds will have to invest in upskilling trustees to empower them to navigate the complex world of infrastructure investing opened up by the gazetting of the amendments to Regulation 28 of the Pensions Fund Act, says Andrew Davison, chair of the Inv…", "url": "https://businesstech.co.za/news/business/603482/warning-over-pension-change-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/03/Money-e1532513254275.png", "publishedAt": "2022-07-06T08:57:27Z", "content": "Retirement funds will have to invest in upskilling trustees to empower them to navigate the complex world of infrastructure investing opened up by the gazetting of the amendments to Regulation 28 of … [+4705 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Large Hadron Collider Successfully Restarted at Record Energy: Revving Up the Search for Dark Matter - SciTechDaily", "description": "The Large Hadron Collider is once again delivering proton collisions to experiments, this time at an unprecedented energy of 13.6 TeV, marking the start of the accelerator’s third run of data taking for physics. A burst of applause erupted in the CERN Control…", "url": "https://scitechdaily.com/large-hadron-collider-successfully-restarted-at-record-energy-revving-up-the-search-for-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Physics-Particle-Accelerator-Collider-Illustration.jpg", "publishedAt": "2022-07-06T08:39:39Z", "content": "ByCERNJuly 6, 2022\r\nThe Large Hadron Collider detectors started recording high-energy collisions at the unprecedented energy of 13.6 TeV.\r\nThe Large Hadron Collider is once again delivering proton co… [+6138 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Tick-Bite Induced Mammalian Meat Allergy Unraveled - Genetic Engineering & Biotechnology News", "description": "New findings may open up strategies toward antibody therapeutics for alpha-gal syndrome in mammalian meat allergy, malaria, and xenotransplantation.", "url": "https://www.genengnews.com/topics/translational-medicine/infectious-diseases/tick-bite-induced-mammalian-meat-allergy-unraveled/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/07/Low-Res_Daniel-Christ-antibody-screen.jpg.png", "publishedAt": "2022-07-06T08:00:02Z", "content": "Scientists at the Garvan Institute of Medical Research in Australia have gained mechanistic insights on a life-threatening mammalian meat allergy brought on by tick bites that could pave the way for … [+4169 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "COVID was the leading cause of death in Americans aged 45-54 in 2021 - Ars Technica", "description": "About 1 in 8 US deaths were from COVID-19 between March 2020 and October 2021.", "url": "https://arstechnica.com/science/2022/07/covid-was-the-leading-cause-of-death-in-americans-aged-45-54-in-2021/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/05/GettyImages-1341226201-760x380.jpeg", "publishedAt": "2022-07-05T22:38:11Z", "content": "Enlarge/ A woman watches white flags on the National Mall on September 18, 2021 in Washington, DC. Over 660,000 white flags were installed here to honor Americans who have lost their lives to COVID-1… [+2674 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Beautiful Cosmic Creature Accelerates Particles From Head - SciTechDaily", "description": "The European Space Agency’s XMM-Newton spacecraft has X-rayed this beautiful cosmic creature, known as the Manatee Nebula, pinpointing the location of unusual particle acceleration in its ‘head’. The Manatee Nebula, also known as W50, is thought to be a large…", "url": "https://scitechdaily.com/beautiful-cosmic-creature-accelerates-particles-from-head/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Manatee.jpg", "publishedAt": "2022-07-05T21:24:08Z", "content": "ByEuropean Space Agency (ESA)July 5, 2022\r\nManatee Nebula or W50, as captured by the X-ray space observatory XMM-Newton, also known as the High Throughput X-ray Spectroscopy Mission and the X-ray Mul… [+3159 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Nanoparticle vaccine protects against a spectrum of COVID-19-causing variants and related viruses - Phys.org", "description": "A new type of vaccine provides protection against a variety of SARS-like betacoronaviruses, including SARS-CoV-2 variants, in mice and monkeys, according to a study led by researchers in the laboratory of Caltech's Pamela Bjorkman, the David Baltimore Profess…", "url": "https://phys.org/news/2022-07-nanoparticle-vaccine-spectrum-covid-causing-variants.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/nanoparticle-vaccine-p.jpg", "publishedAt": "2022-07-05T16:04:44Z", "content": "A new type of vaccine provides protection against a variety of SARS-like betacoronaviruses, including SARS-CoV-2 variants, in mice and monkeys, according to a study led by researchers in the laborato… [+11034 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cynthia Eller", "title": "What comes after the Higgs boson - Phys.org", "description": "Ten years ago this week, two international collaborations of groups of scientists, including a large contingent from Caltech, confirmed that they had found conclusive evidence for the Higgs boson, an elusive elementary particle, first predicted in a series of…", "url": "https://phys.org/news/2022-07-higgs-boson.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/what-comes-after-the-h.jpg", "publishedAt": "2022-07-05T13:32:55Z", "content": "Ten years ago this week, two international collaborations of groups of scientists, including a large contingent from Caltech, confirmed that they had found conclusive evidence for the Higgs boson, an… [+8928 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Double whammy for consumers in South Africa - BusinessTech", "description": "With South Africa’s petrol price set to reach record levels in July, inflation is expected to surpass the 7% range, says Himal Parbhoo, chief executive of FNB Retail Cash Investments.", "url": "https://businesstech.co.za/news/banking/603022/double-whammy-for-consumers-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/Petrol-e1615886760586.jpg", "publishedAt": "2022-07-05T08:16:05Z", "content": "With South Africa’s petrol price set to reach record levels in July, inflation is expected to surpass the 7% range, says Himal Parbhoo, chief executive of FNB Retail Cash Investments.\r\nThe government… [+6629 chars]"}]}