{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Sean Conlon, Pia Singh", "title": "S&P 500 rises as traders await Big Tech earnings: Live updates - CNBC", "description": "More than 90 S&P 500 companies are slated to report quarterly results this week.", "url": "https://www.cnbc.com/2026/01/26/stock-market-today-live-updates.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/108257164-17694534112026-01-26t165053z_223919374_rc219jau26bi_rtrmadp_0_usa-stocks.jpeg?v=1769453441&w=1920&h=1080", "publishedAt": "2026-01-27T14:33:00Z", "content": "The S&amp;P 500 rose on Tuesday, aided by gains in Big Tech, as traders awaited earnings from companies in the sector. Traders also looked ahead to the Federal Reserve's first policy meeting, due Wed… [+1485 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew", "title": "TikTok users say they can’t upload anti-ICE videos. The company blames tech issues - CNN", "description": "Why are people saying “Delete TikTok”? One reason is that some TikTok users, including comedian Megan Stalter, are accusing the app of censorship after they have attempted and failed to upload videos about ICE. TikTok says the ongoing glitches are related to …", "url": "https://www.cnn.com/2026/01/26/tech/tiktok-ice-censorship-glitch-cec", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2258022749-20260127015621591.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2026-01-27T02:55:00Z", "content": "The comedian Megan Stalter, who posts absurd character skits to an audience in the high hundreds of thousands across Instagram and TikTok, tried sharing a different kind of video on Saturday night. D… [+6953 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "MediaTek Estimated To Be Hit The Hardest Out Of All Chipset Manufacturers Thanks To The Memory Crisis, As More Than 50% Of Its Revenue Comes From SoC Shipments - Wccftech", "description": "Qualcomm has largely been able to diversify its business, but a new report states that the DRAM shortage will strike MediaTek the hardest", "url": "https://wccftech.com/mediatek-hit-hardest-from-memory-crisis-50-percent-of-revenue-comes-from-chipset-sales/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2026/01/MediaTek-Dimensity-9200.jpg", "publishedAt": "2026-01-26T22:04:00Z", "content": "In the smartphone chipset shipments tally, MediaTek leads the pack as the company beat Qualcomm, Apple, and Samsung in recording the highest volume for multiple quarters. Sadly, its biggest strength … [+2360 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": "Tiernan P. Doyle", "title": "NASA Technology Brings Golden Age of Exploration to Earth - NASA (.gov)", "description": "As NASA fosters technologies needed to live and work farther away from home than ever before, the agency’s Technology Transfer program has the sole mission of", "url": "https://www.nasa.gov/news-release/nasa-technology-brings-golden-age-of-exploration-to-earth/", "urlToImage": "https://www.nasa.gov/wp-content/uploads/2026/01/astronaut-cover-web-without-meatball-1.png", "publishedAt": "2026-01-26T18:42:47Z", "content": "As NASA fosters technologies needed to live and work farther away from home than ever before, the agencys Technology Transfer program has the sole mission of getting those innovations into the hands … [+3953 chars]"}]}