{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Extraordinary” 4,000-Year-Old Egyptian Skull Reveals Surgical Attempts at Cancer Care - SciTechDaily", "description": "Scientists were stunned by the discovery of cutmarks around cancerous growths on an ancient Egyptian skull, which allowed them to gain new insights into how the ancient Egyptians may have treated the disease. These findings are unique evidence that ancient so…", "url": "https://scitechdaily.com/extraordinary-4000-year-old-egyptian-skull-reveals-surgical-attempts-at-cancer-care/", "urlToImage": "https://scitechdaily.com/images/Skull-236.jpg", "publishedAt": "2024-05-31T20:16:48Z", "content": "Skull and mandible 236, dating from between 2687 and 2345 BCE, belonged to a male individual aged 30 to 35. Credit: Tondini, Isidro, Camarós, 2024, edited\r\nScientists were stunned by the discovery of… [+5230 chars]"}, {"source": {"id": null, "name": "ReadWrite"}, "author": "Sophie Atkinson", "title": "Apple expected to upgrade Siri with AI technology - ReadWrite", "description": "A Bloomberg report suggests Apple will overhaul Siri with AI in a move that will see users have more control with their voice.", "url": "https://readwrite.com/apple-expected-to-upgrade-siri-with-ai-technology/", "urlToImage": "https://readwrite.com/wp-content/uploads/2024/05/Apple-Siir-scaled.jpg", "publishedAt": "2024-05-31T13:52:04Z", "content": "A Bloomberg report suggests Apple is planning to completely overhaul the Siri that we currently know, in favor of more advanced artificial intelligence.\r\nThe move could let users control app function… [+1907 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Saumya Nigam", "title": "Realme set to launch GT 6 in India, calling it as the ultimate AI Flagship Killer - India TV News", "description": "Realme's introduction of the Realme GT 6 and the anticipated Realme GT 7 Pro reflects the company’s commitment to enhancing its GT series with advanced AI capabilities and cutting-edge technology, aiming to capture a significant share of the flagship smartpho…", "url": "https://www.indiatvnews.com/technology/news/realme-set-to-launch-gt-6-in-india-calling-it-as-the-ultimate-ai-flagship-killer-2024-05-31-934440", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/05/realme-gt-6t-2-1717157102.jpg", "publishedAt": "2024-05-31T12:36:35Z", "content": "It was very recently when Realme announced its next smartphone in India, and now the company has said that they will launch the Realme GT 6- another addition to the GT series. The upcoming device wil… [+3029 chars]"}]}