{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "Neuroscience News", "title": "Novel Schizophrenia Insights from Brain Organoids and Genes - Neuroscience News", "description": "Researchers leveraged cutting-edge technology to gain insights into schizophrenia's neurodevelopmental origins.", "url": "https://neurosciencenews.com/schizophrenia-organoid-genetics-24982/", "urlToImage": "https://neurosciencenews.com/files/2023/10/schizophrenia-genetics-organoids-neuroscience.jpg", "publishedAt": "2023-10-24T21:06:55Z", "content": "Summary: Researchers leveraged cutting-edge technology to gain insights into schizophrenia’s neurodevelopmental origins. The researchers grew brain organoids from patients’ skin cells, finding persis… [+9661 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Apple sends out invites for ‘Scary Fast’ event – new Macs could be on the menu - TechCrunch", "description": "Apple this morning sent out invites for its upcoming ‘Scary Fast’ virtual event, set for October 30 -- the M3 chip arrive soon.", "url": "https://techcrunch.com/2023/10/24/apple-sends-out-invites-for-scary-fast-event-new-macs-could-be-on-the-way/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/10/Screenshot-2023-10-24-at-12.12.42 PM.jpg?resize=1200,605", "publishedAt": "2023-10-24T16:41:15Z", "content": "Apple this morning sent out invites for its upcoming “Scary Fast” virtual event, set for October 30. Along with being scheduled for All Hallows’ Eve-Eve, the tagline could well be a reference to new … [+1236 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Richa Sharma", "title": "Apple Sends Invite For \"Scary Fast\" Event; New iMacs, MacBooks Expected - Gadgets 360", "description": "Apple has started sending out invites for the MacBook and iMac launch event, which is scheduled to take place at the end of this month. According to the invite received by Gadgets360 on Tuesday, the California-based tech giant will hold the special Apple Even…", "url": "https://www.gadgets360.com/laptops/news/apple-october-30-scary-fast-event-new-imacs-macbooks-expected-4510513", "urlToImage": "https://i.gadgets360cdn.com/large/image_1698164869303.jpg", "publishedAt": "2023-10-24T16:30:09Z", "content": "Apple has sent out invites for the \"Scary Fast\" event, expected to be the iMacs and MacBooks launch, which is scheduled to take place at the end of this month. According to the invite received by Gad… [+2145 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“We've Lost Control” – West Antarctic Ice Sheet's Unavoidable Meltdown - SciTechDaily", "description": "The West Antarctic Ice Sheet's melting rate is projected to rise significantly this century, irrespective of fossil fuel cutbacks. While the future looks challenging, reducing fossil fuel reliance is still vital for adaptation and mitigation. The West Antarct…", "url": "https://scitechdaily.com/weve-lost-control-west-antarctic-ice-sheets-unavoidable-meltdown/", "urlToImage": "https://scitechdaily.com/images/Antarctic-Ice-Sheet-Melting-Concept.jpg", "publishedAt": "2023-10-24T13:18:09Z", "content": "ByBritish Antarctic SurveyOctober 24, 2023\r\nThe British Antarctic Surveys recent research suggests that the West Antarctic Ice Sheets melting rate will escalate this century, regardless of fossil fue… [+5474 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Trevor Mogg", "title": "Check out the NASA EV that will drive Artemis crew (partway) to the moon - Digital Trends", "description": "NASA and EV startup Canoo Technologies have shown off the vehicle that will transport the next lunar astronauts to the launchpad at the Kennedy Space Center.", "url": "https://www.digitaltrends.com/space/nasa-shows-off-astronauts-ev-ride-to-artemis-ii-launchpad/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/10/nasa-canoo-EV-interior.jpeg?resize=1200%2C630&p=1", "publishedAt": "2023-10-24T01:50:55Z", "content": "NASA and electric vehicle startup Canoo Technologies have shown off the EV that will transport the next lunar astronauts to the launchpad at the Kennedy Space Center as part of next year’s Artemis II… [+1865 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: What project staffers Inoue Hiroka and Fujioka Natsu revealed - HT Tech", "description": "Chandrayaan4 mission What project staffers Inoue Hiroka and Fujioka Natsu revealed The Chandrayaan4 mission is now under development by JAXA and ISRO. Know what project members Inoue Hiroka andFujiokaNatsu revealed about the lunar mission. Chandrayaan4 missio…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-what-project-staffers-inoue-hiroka-and-fujioka-natsu-revealed-71698120278345.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/24/1600x900/C42_1698120691612_1698120702659.png/", "publishedAt": "2023-10-23T22:42:24Z", "content": "Photo Credit: JAXA\r\n The Chandrayaan-4 mission is now under development by JAXA and ISRO. Know what project members Inoue Hiroka and Fujioka Natsu revealed about the lunar mission.\r\nPhoto Credit: ISR… [+1638 chars]"}]}