{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Once-in-a-2000-Year Event: Study Explains Unprecedented Antarctic Ice Loss Equivalent to 10x the Size of the UK - SciTechDaily", "description": "Antarctic sea ice reached record lows in 2023, with studies indicating that climate change significantly increased the likelihood of this event. The potential long-term reduction in sea ice poses serious consequences for global weather and marine life. In 202…", "url": "https://scitechdaily.com/once-in-a-2000-year-event-study-explains-unprecedented-antarctic-ice-loss-equivalent-to-10x-the-size-of-the-uk/", "urlToImage": "https://scitechdaily.com/images/Melting-Ice-Climate-Change.jpg", "publishedAt": "2024-06-01T08:26:00Z", "content": "In 2023, Antarctic sea ice declined to historically low levels, prompting researchers to use CMIP6 climate models to assess the event’s rarity and its connection to climate change. The study found th… [+4682 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ian Casselberry", "title": "WATCH: Caitlin Clark's third technical foul puts her closer to automatic suspension - Yahoo Sports", "description": "Caitlin Clark received the third technical foul of her rookie WNBA season Thurdsay night. That total puts her nearly halfway to a one-game suspension.", "url": "https://sports.yahoo.com/watch-caitlin-clarks-third-technical-foul-puts-her-closer-to-automatic-suspension-210421068.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/gNsLFzOXuFXklcq2euzYsw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/fdcb3780-1ef1-11ef-bb3f-831164ca71c9", "publishedAt": "2024-05-31T21:48:56Z", "content": "Caitlin Clark drew her third technical foul of the season during the Indiana Fever's 10388 loss to the Seattle Storm on Thursday.\r\nThe infraction occurred midway through the second quarter after Clar… [+2350 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nicolas Posunko", "title": "An outlandish molecule may be lurking inside Uranus and Neptune, affecting their magnetic fields - Phys.org", "description": "Skoltech scientists and their Chinese colleagues have determined the conditions that enable the existence of a very peculiar ion. Dubbed aquodiium, it can be conceptualized as an ordinary neutral molecule of water with two additional protons stuck to it, resu…", "url": "https://phys.org/news/2024-05-outlandish-molecule-lurking-uranus-neptune.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/outlandish-molecule-su-1.jpg", "publishedAt": "2024-05-31T16:13:03Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+5334 chars]"}]}