{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Mark Harris", "title": "Enter the hunter satellites preparing for space war - Ars Technica", "description": "True Anomaly, a startup backed by US senator JD Vance's VC firm, plans to launch prototype pursuit satellites on a SpaceX flight later this year.", "url": "https://www.wired.com/story/true-anomaly-jackal-pursuit-satellites/", "urlToImage": "https://media.wired.com/photos/63d9981ee0c466cd5c195497/191:100/w_1280,c_limit/Sec-spacewar-1201650213.jpg", "publishedAt": "2023-02-02T15:17:46Z", "content": "Rogerss last job for the government was leading teams within US Space Command that planned how and when to deploy defensive and offensive military space systems. He and his cofounders, Dan Brunski, T… [+3797 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "IBM, NASA Join Hands To Research Impact Of Climate Change With AI | Science & Tech - Ommcom News", "description": "New Delhi: Tech major IBM and NASA's Marshall Space Flight Center have announced a collaboration to use IBM's artificial intelligence (AI) technology to", "url": "https://ommcomnews.com/science-tech/ibm-nasa-join-hands-to-research-impact-of-climate-change-with-ai", "urlToImage": "https://ommcomnews.com/wp-content/uploads/2023/02/Nasa.jpg", "publishedAt": "2023-02-02T13:35:48Z", "content": "New Delhi: Tech major IBM and NASA’s Marshall Space Flight Center have announced a collaboration to use IBM’s artificial intelligence (AI) technology to discover new insights in NASA’s massive trove … [+2279 chars]"}, {"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "IBM and NASA Join Hands to Extract Insights from Earth Observations Using AI Technology - AZoRobotics", "description": "IBM and NASA's Marshall Space Flight Center today announce a collaboration to use IBM's artificial intelligence (AI) technology to discover new insights in NASA's massive trove of Earth and geospatial science data.", "url": "https://www.azorobotics.com/News.aspx?newsID=13563", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_13563_16753392927823198.jpg", "publishedAt": "2023-02-02T13:11:00Z", "content": "IBM and NASA's Marshall Space Flight Center today announce a collaboration to use IBM's artificial intelligence (AI) technology to discover new insights in NASA's massive trove of Earth and geospatia… [+3941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "New nanoscience could present a massive leap for photonic quantum computing - The Indian Express", "description": "Researchers have developed a nanoscopic technology that could present a massive leap for \"photonic quantum computing\" — they have successfully managed to get two entangled quantum light sources.", "url": "https://indianexpress.com/article/technology/photonic-quantum-computing-entangled-light-sources-8420399/", "urlToImage": "https://images.indianexpress.com/2023/02/Quantum-entangled-light-20230202.jpg", "publishedAt": "2023-02-02T12:07:14Z", "content": "In a major breakthrough, researchers at the University of Copenhagen and Ruhr University have figured out how to control two quantum light sources rather than one. While a small step up from one to t… [+4127 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Revolutionary New Physics Hypothesis: Three Time Dimensions, One Space Dimension - SciTechDaily", "description": "How would our world be perceived by observers moving faster than light in a vacuum? According to theorists from Warsaw and Oxford universities, such a view would differ from what we encounter daily, with the presence of not only spontaneous phenomena but also…", "url": "https://scitechdaily.com/a-revolutionary-new-physics-hypothesis-three-time-dimensions-one-space-dimension/", "urlToImage": "https://scitechdaily.com/images/Clock-Time-Relativity-Concept-Art.jpg", "publishedAt": "2023-02-02T11:48:01Z", "content": "The researchers hope that their findings will contribute to a better understanding of the phenomenon of spontaneous symmetry breaking associated with the mass of the Higgs particle and other particle… [+6538 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Breakthrough: Accurate New Map of All the Matter in the Universe Released - SciTechDaily", "description": "Analysis combines Dark Energy Survey and South Pole Telescope data to understand evolution of universe. Sometimes to know what the matter is, you have to find it first. When the universe began, matter was flung outward and gradually formed the planets, stars,…", "url": "https://scitechdaily.com/cosmic-breakthrough-accurate-new-map-of-all-the-matter-in-the-universe-released/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Expanding-Universe-Concept.jpg", "publishedAt": "2023-02-02T10:25:30Z", "content": "ByLouise Lerner, University of ChicagoFebruary 2, 2023\r\nA team of scientists, comprising experts from the University of Chicago and Fermi National Accelerator Laboratory, have made a game-changing an… [+6057 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Hyundai launches 2023 Creta & Alcazar with added safety tech - Team-BHP", "description": "Hyundai has announced the launch of the Creta and Alcazar for the 2023 model year. The updated SUVs now come with a host of active and passive safety features as standard. The 2023 Creta and Alcazar get 6 airbags in total, including driver, passenger, side an…", "url": "https://www.team-bhp.com/news/hyundai-launches-2023-creta-alacazar-added-safety-tech", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/01-SUV Key Visual 2x1.jpg", "publishedAt": "2023-02-02T08:34:28Z", "content": "Hyundai has announced the launch of the Creta and Alcazar for the 2023 model year. The updated SUVs now come with a host of active and passive safety features as standard.\r\nThe 2023 Creta and Alcazar… [+956 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Advanced Remote Soil Carbon Sequestration and Emissions Measurement - AZoCleantech", "description": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering, costs, precision, and availability. Carbon sequestration an…", "url": "https://www.azocleantech.com/article.aspx?ArticleID=1655", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/Article_Images/ImageForArticle_1655_16753236478707967.jpg", "publishedAt": "2023-02-02T07:43:00Z", "content": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering,… [+7165 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Tech counters surge on Bursa - The Star Online", "description": "KUALA LUMPUR: Bursa Malaysia's technology sector outperformed the rest of the market as it tracked the Nasdaq Index, which jumped 2% overnight on developments in the US interest rate policy.", "url": "https://www.thestar.com.my/business/business-news/2023/02/02/tech-counters-surge-on-bursa", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2023/02/02/1925152.jpg", "publishedAt": "2023-02-02T05:07:00Z", "content": "Tech counters surge on Bursa\r\nKUALA LUMPUR: Bursa Malaysia's technology sector outperformed the rest of the market as it tracked the Nasdaq Index, which jumped 2% overnight on developments in the US … [+1885 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I tried using a smart lock for a week – here's how it went - AsiaOne", "description": "\"What's the point of all this?\" Those were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\". In the clip, almost everything in her home was powered by technology an…", "url": "https://www.asiaone.com/digital/i-tried-using-smart-door-lock-week-heres-how-it-went-aqara-zigbee-a100", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/20230102_smart_lock_aqara.jpg?h=efed96af&itok=s0FOS7mc", "publishedAt": "2023-02-02T04:00:00Z", "content": "\"What's the point of all this?\"\r\nThose were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\".\r\nIn the cl… [+6893 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:08:55Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Complex Relationship Between Sleep Meds and Dementia Explored in New Study - Technology Networks", "description": "A new study shows that sleep medications increase the risk of dementia for people who are white. But the type and quantity of the medication may be factors in explaining the higher risk.<br /><br />", "url": "https://www.technologynetworks.com/neuroscience/news/complex-relationship-between-sleep-meds-and-dementia-explored-in-new-study-369727", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369727/complex-relationship-between-sleep-meds-and-dementia-explored-in-new-study-369727-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:03:39Z", "content": "A new study shows that sleep medications increase the risk of dementia for people who are white. But the type and quantity of the medication may be factors in explaining the higher risk.\r\nIt follows … [+3133 chars]"}]}