{"articles": [{"author": null, "content": "Rwanda on Wednesday became the first African country to receive the Pfizer-BioNTech coronavirus vaccine, with around 100,000 doses delivered in what the pharmaceutical giant hailed as a “milestone” f… [+3021 chars]", "description": "Rwanda on Wednesday became the first African country to receive the Pfizer-BioNTech coronavirus vaccine, with around 100,000 doses delivered in what the pharmaceutical giant hailed as a “milestone” for the continent. The East African country received nearly 1…", "publishedAt": "2021-03-04T15:51:11Z", "source": {"id": null, "name": "Channels Television"}, "title": "Rwanda First African Nation To Get Pfizer-BioNTech Vaccine - Channels Television", "url": "https://www.channelstv.com/2021/03/04/rwanda-first-african-nation-to-get-pfizer-biontech-vaccine/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/03/Pfizer-BioNTech-Vaccine-in-Rwanda.jpg"}, {"author": "Ricky O'Donnell", "content": "The Philadelphia 76ers and Utah Jazz played a game on Wednesday night that was fitting of their status as the No. 1 seeds in each conference heading into the All-Star break. The Sixers thrilling 131-… [+3598 chars]", "description": "The Jazz accused NBA refs of small market bias after a wild game against the Sixers.", "publishedAt": "2021-03-04T14:48:11Z", "source": {"id": null, "name": "SB Nation"}, "title": "Joel Embiid snitched on Donovan Mitchell and got him a technical - SB Nation", "url": "https://www.sbnation.com/nba/2021/3/4/22312844/joel-embiid-jazz-donovan-mitchell-technical-foul-highlights-quotes", "urlToImage": "https://cdn.vox-cdn.com/thumbor/B6ahQDfdZhMm2IZH3UZ_HqTv8Nc=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22344949/1305226163.jpg"}, {"author": "Darrell Etherington", "content": "SpaceX has launched another batch of its Starlink satellites  the usual complement of 60 of the low Earth orbit spacecraft, which will join the more than 1,000 already making up the existing constell… [+3089 chars]", "description": "SpaceX has launched another batch of its Starlink satellites – the usual complement of 60 of the low Earth orbit spacecraft, which will join the more than 1,000 already making up the existing constellation. This is the fifth launch of Starlink satellites for …", "publishedAt": "2021-03-04T12:32:19Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "SpaceX launches 60 new Starlink satellites, while Starship moves closer to being able to launch up to 400 at a time - TechCrunch", "url": "http://techcrunch.com/2021/03/04/spacex-launches-60-new-starlink-satellites-while-starship-moves-closer-to-being-able-to-launch-up-to-400-at-a-time/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/Launch_Star17_DSC_3680.jpg?w=600"}, {"author": "Ryan Whitwam", "content": "Humans haven’t been great for the health of the planet, but even if we pollute ourselves into extinction, Earth will continue on. It’s survived enormous asteroid impacts and megavolcanoes, after all.… [+2675 chars]", "description": "A new study supported by NASA's exoplanet habitability research lays out how the Sun will eventually bake the planet, turning Earth from a lush, oxygen-rich world to a dried-up husk with no complex life.", "publishedAt": "2021-03-04T12:30:38Z", "source": {"id": null, "name": "ExtremeTech"}, "title": "Earth Will Lose Its Oxygen in a Billion Years, Killing Most Living Organisms - ExtremeTech", "url": "https://www.extremetech.com/extreme/320498-earth-will-lose-its-oxygen-in-a-billion-years-killing-most-living-organisms", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/08/638831main_globe_east_1344.jpg"}, {"author": "Henry Kwan", "content": "POCO will have two smartphones entering the market soon. One of them will be a high-end F series flagship while the other one will be a mid-range device. The latter is the POCO X3 Pro has been showin… [+1455 chars]", "description": "POCO&nbsp;will have two smartphones entering the market soon. One of them will be a high-end F series flagship while the other one will be a mid-range device. T", "publishedAt": "2021-03-04T11:53:49Z", "source": {"id": null, "name": "TechNave"}, "title": "POCO X3 Pro is coming with a custom flagship Snapdragon chipset - TechNave", "url": "https://technave.com/gadget/POCO-X3-Pro-is-coming-with-a-custom-flagship-Snapdragon-chipset-23637.html", "urlToImage": "https://technave.com/data/files/mall/article/202103041148509466.jpg"}, {"author": null, "content": "Jiang Jie Photo: Courtesy of CALT\r\nDevelopment for a fusion version of China's potentially reusable medium-sized launch vehicle, the Long March-8, has been initiated, and it is hoped that the new roc… [+3854 chars]", "description": "Development for a fusion version of China’s potentially reusable medium-sized launch vehicle, the Long March-8, has been initiated, and it is hoped that the new rocket will carry out key technology demonstration tests for vertical take-off and vertical landin…", "publishedAt": "2021-03-04T09:10:00Z", "source": {"id": null, "name": "Global Times"}, "title": "Long March-8 rocket likely to try out vertical landing in 2021: Chinese developer - Global Times", "url": "https://www.globaltimes.cn/page/202103/1217312.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2020/2020-12-16/bd06c840-598e-488e-9d12-5a5e15c8f405.jpeg"}, {"author": "Manish Singh", "content": "WhatsApp is rolling out support for voice and video calling to its desktop app, the Facebook-owned messaging service said Thursday, providing relief to countless people sitting in front of computers … [+2224 chars]", "description": "WhatsApp is rolling out support for voice and video calling to its desktop app.", "publishedAt": "2021-03-04T08:01:35Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "WhatsApp rolls out voice and video call support to desktop app - TechCrunch", "url": "http://techcrunch.com/2021/03/04/whatsapp-rolls-out-voice-and-video-call-support-to-desktop-app/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/whatsapp-desktop-video-call-feature.jpg?w=720"}, {"author": "Duncan McLeod", "content": "The Internet Service Providers’ Association (Ispa) on Thursday called for mediation, rather than litigation, to resolve the stand-off between communications regulator Icasa and telecommunications ope… [+1355 chars]", "description": "The Internet Service Providers' Association has called for mediation, rather than litigation, to resolve the stand-off between communications regulator Icasa and telecommunications operators over the looming spectrum auction.", "publishedAt": "2021-03-04T07:27:48Z", "source": {"id": null, "name": "TechCentral"}, "title": "Ispa urges mediation to resolve spectrum standoff - TechCentral", "url": "https://techcentral.co.za/ispa-urges-mediation-to-resolve-spectrum-standoff/105440/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2018/01/telecoms-tower-2156-1120.jpg"}, {"author": "Motoring South Africa", "content": "If cars could ever lay claim to being household names in South Africa, the Volkswagen Golf GTI would most certainly be among them. \r\nAnd so there will be sighs of relief and many enthusiastic discuss… [+6569 chars]", "description": "The eighth edition of Volkswagen's iconic Golf GTI is on its way in and is packing more digital and more power. See the hot hatch and the specs here.", "publishedAt": "2021-03-04T06:56:15Z", "source": {"id": null, "name": "The South African"}, "title": "Hot hatch to digital dash: New VW Golf GTI gets hi-tech touch, more power - The South African", "url": "https://www.thesouthafrican.com/motoring/vw-golf-8-gti-volkswagen-2021-specs-south-africa/", "urlToImage": "https://www.thesouthafrican.com/wp-content/uploads/2021/03/Volkwagen-Golf-8-GTI-feature.jpg.optimal.jpg"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "South African authorities have seized hundreds of fake Covid-19 vaccines following a global alert issued by Interpol, the international criminal police organisation.\r\nSome 400 vials equivalent to aro… [+2463 chars]", "description": "South African authorities have seized hundreds of fake Covid-19 vaccines following a global alert issued by Interpol.", "publishedAt": "2021-03-04T05:25:23Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "Fake Covid-19 vaccines seized in South Africa - BusinessTech", "url": "https://businesstech.co.za/news/trending/472802/fake-covid-19-vaccines-seized-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/VaccineJJ-e1612503769367.jpg"}, {"author": "Matt Swider", "content": "The Nintendo Switch 2 is poised to launch in 2021, and it will have all of the bells and whistles gamers have been asking for since the Nintendo Switch first launch in 2017.\r\nThis yet-to-be-officiall… [+2130 chars]", "description": "OLED screen and 4K resolution when docked? The Nintendo Switch 2 upgrade you've wanted is reportedly on track", "publishedAt": "2021-03-04T03:27:38Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Nintendo Switch 2 release date poised for 2021 with OLED and 4K support - TechRadar", "url": "https://www.techradar.com/news/nintendo-switch-2-launch-news-and-features", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MdBSLKuhn9AV3LtyHJZUuJ-1200-80.jpg"}, {"author": "ABC News", "content": "Australian shares ended the day in the red as major companies traded without the rights to their dividends and following a tech-led sell-off on Wall Street because of rising bond yields. \r\nKey points… [+7634 chars]", "description": "The Australian share market loses ground as top companies trade ex-dividend following another sell off of overvalued technology giants on Wall Street.", "publishedAt": "2021-03-03T21:14:03Z", "source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "title": "ASX tumbles as major blue chips trade ex-dividend and after Wall Street slumps on rising bond yields - ABC News", "url": "https://www.abc.net.au/news/2021-03-04/us-stocks-mixed-after-tech-sell-off-on-wall-street/13214454", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4a1cf705b5ad36ab1807e920edf30127?impolicy=wcms_crop_resize&cropH=1689&cropW=3000&xPos=0&yPos=145&width=862&height=485"}, {"author": "Agency Staff", "content": "Facebook cannot share any contact information it collects from WhatsApp users with its other properties without first obtaining authorisation from South Africa’s Information Regulator, the agency sai… [+1911 chars]", "description": "Facebook cannot share any contact information it collects from WhatsApp users with its other properties without first obtaining authorisation from South Africa's Information Regulator, the agency has said..", "publishedAt": "2021-03-03T20:18:16Z", "source": {"id": null, "name": "TechCentral"}, "title": "South Africa: WhatsApp may not share user data with Facebook - TechCentral", "url": "https://techcentral.co.za/south-africa-whatsapp-may-not-share-user-data-with-facebook/105434/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2021/01/whatsapp-2156-1120.jpg"}, {"author": null, "content": "In this podcast Melanie Boylan spoke to John Durning, who is the Deputy Project Manager for the James Webb Space Telescope Project, based out of Goddard Space Flight Center, in Greenbelt, Md.\r\nWe hea… [+2412 chars]", "description": "In this podcast Melanie Boylan spoke to John Durning, who is the Deputy Project Manager for the James Webb Space Telescope Project.", "publishedAt": "2021-03-03T14:55:06Z", "source": {"id": null, "name": "Irishtechnews.ie"}, "title": "The Flight of the \"Bumblebee\" - The Upcoming Launch of James Webb Telescope with John Durning - - Irish Tech News", "url": "https://irishtechnews.ie/the-launch-of-james-webb-telescope-john-durning/", "urlToImage": "https://irishtechnews.ie/wp-content/uploads/2021/03/james-weeb-open-pic.jpg"}, {"author": null, "content": "\"Infosys is looking at partnering with health care providers to vaccinate employees,\" the company said.\r\nBengaluru: Information Technology major Infosys Ltd and consulting and outsourcing services pr… [+1267 chars]", "description": "Information Technology major Infosys Ltd and consulting and outsourcing services provider Accenture Plc said on Wednesday they would cover COVID-19 vaccination costs for their employees in India, as the country expands its massive vaccination drive.", "publishedAt": "2021-03-03T13:40:47Z", "source": {"id": null, "name": "NDTV News"}, "title": "Infosys, Accenture To Cover Covid Vaccination Costs For Employees - NDTV", "url": "https://www.ndtv.com/india-news/infosys-accenture-to-cover-covid-vaccination-costs-for-employees-2382965", "urlToImage": "https://c.ndtvimg.com/2021-03/5po4k3io_infosys_625x300_03_March_21.jpg"}, {"author": null, "content": "Sophisticated scanning technology is revealing intriguing secrets about Little Foot, the remarkable fossil of an early human forerunner that inhabited South Africa 3.67 million years ago during a cri… [+1923 chars]", "description": "Sophisticated scanning technology is revealing intriguing secrets about Little Foot, the remarkable fossil of an early human forerunner that inhabited South Africa 3.67 million years ago during a critical juncture in our evolutionary history.", "publishedAt": "2021-03-03T09:28:00Z", "source": {"id": null, "name": "Global Times"}, "title": "Painstaking study of 'Little Foot' fossil sheds light on human origins - Global Times", "url": "https://www.globaltimes.cn/page/202103/1217177.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-03-03/73b69a5f-def5-4d78-9a5b-92e94eea7575.jpeg"}, {"author": null, "content": "An unopened letter that was mailed back in 1697 but never delivered has been read by researchers who have developed a way to virtually “unfold” sealed letter packets without having to actually break … [+5454 chars]", "description": "A signed, sealed but not delivered letter from 1697 has finally been read with the help of a high-tech scan that looked inside without breaking its seal.", "publishedAt": "2021-03-02T22:45:05Z", "source": {"id": null, "name": "Wbhm.org"}, "title": "Reading A Letter That’s Been Sealed For More Than 300 Years — Without Opening It - WBHM", "url": "https://wbhm.org/npr_story_post/2021/reading-a-letter-thats-been-sealed-for-more-than-300-years-without-opening-it/", "urlToImage": "https://wbhm.org/wp-content/uploads/2021/03/unfolding-sequence_wide-1c692c8ceb000176070880441d47fe96961550c0.png"}], "message": "Successful api call", "number_of_news": 17, "status": 200, "topic": "tech"}