{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "It's not how big your laser is, it's how you use it: space law is an important part of the fight against space debris - Stuff.co.nz", "description": "Earth orbit is filling up with satellites and space junk. Technological fixes can only go so far to deal with the problem.", "url": "https://www.stuff.co.nz/science/300277823/its-not-how-big-your-laser-is-its-how-you-use-it-space-law-is-an-important-part-of-the-fight-against-space-debris", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/r/z/u/u/image.related.StuffLandscapeSixteenByNine.1420x800.4yrzun.png/1618447783859.jpg", "publishedAt": "2021-04-15T00:49:00Z", "content": "Space is getting crowded. More than 100 million tiny pieces of debris are spinning in Earth orbit, along with tens of thousands of bigger chunks and around 3300 functioning satellites.\r\n Large satell… [+6993 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Do We Know if an Asteroid Headed Our Way Is a Dangerous Threat? - SciTechDaily", "description": "There are a lot of things that pose a threat to our planet – climate change, natural disasters, and solar flares, for example. But one threat in particular often captures public imagination, finding itself popularised in books and films and regularly generati…", "url": "https://scitechdaily.com/how-do-we-know-if-an-asteroid-headed-our-way-is-a-dangerous-threat/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Impact-Earth-1.jpg", "publishedAt": "2021-04-15T00:34:16Z", "content": "There are a lot of things that pose a threat to our planet – climate change, natural disasters, and solar flares, for example. But one threat in particular often captures public imagination, finding … [+6937 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "From Harvard to Nasdaq listing: Grab CEO's ride to world's biggest SPAC deal - The Edge Markets MY", "description": "SINGAPORE (April 15): The CEO of Grab, a popular app to book taxis, order food and make payments in Southeast Asia, has always been determined to win -- from making his firm the best-funded regional start-up to defeating behemoth Uber Technologies.On Tuesday,…", "url": "https://www.theedgemarkets.com/article/harvard-nasdaq-listing-grab-ceos-ride-worlds-biggest-spac-deal", "urlToImage": "https://assets.theedgemarkets.com/Grab-1_reuters_15042021.jpg?A1eteerKRcTDO4rHtaBZ5QG3FZFh2Nhz", "publishedAt": "2021-04-14T23:52:03Z", "content": "SINGAPORE (April 15): The CEO of Grab, a popular app to book taxis, order food and make payments in Southeast Asia, has always been determined to win -- from making his firm the best-funded regional … [+4513 chars]"}, {"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "MIT scientists translated spider webs into music. It could help us talk to them - CNN Philippines", "description": "Scientists at the Massachusetts Institute of Technology have turned spider webs into music — creating an eerie soundtrack that could help them better understand how the arachnids spin their complex creations and even how they communicate.", "url": "http://cnnphilippines.com/world/2021/4/15/MIT-spider-web-music.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/4/15/Spider-web-music_CNNPH.jpg/jcr:content/Spider-web-music_CNNPH.jpg", "publishedAt": "2021-04-14T23:47:27Z", "content": "(CNN)  Scientists at the Massachusetts Institute of Technology have turned spider webs into music  creating an eerie soundtrack that could help them better understand how the arachnids spin their com… [+3432 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Williams, CNN", "title": "MIT scientists translated spider webs into music. It could help us talk to them - CNN ", "description": "Scientists at the Massachusetts Institute of Technology have turned spider webs into music -- creating an eerie soundtrack that could help them better understand how the arachnids spin their complex creations and even how they communicate.", "url": "https://www.cnn.com/2021/04/14/tech/mit-spider-web-music-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210414150308-spider-web-music-mit-super-tease.jpg", "publishedAt": "2021-04-14T21:14:00Z", "content": "(CNN)Scientists at the Massachusetts Institute of Technology have turned spider webs into music -- creating an eerie soundtrack that could help them better understand how the arachnids spin their com… [+3308 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Archa Fox, Damian Purcell", "title": "3 mRNA vaccines researchers are working on (that aren't COVID) - The Conversation AU", "description": "We have two mRNA COVID-19 vaccines so far. But what else can this technology do?", "url": "https://theconversation.com/3-mrna-vaccines-researchers-are-working-on-that-arent-covid-157858", "urlToImage": "https://images.theconversation.com/files/393919/original/file-20210408-21-8z0f13.jpg?ixlib=rb-1.1.0&rect=1%2C0%2C997%2C498&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-04-14T20:08:45Z", "content": "The worlds first mRNA vaccines the COVID-19 vaccines from Pfizer/BioNTech and Moderna have made it in record time from the laboratory, through successful clinical trials, regulatory approval and into… [+6164 chars]"}, {"source": {"id": null, "name": "DispatchLIVE"}, "author": "Motoring Reporter", "title": "The ultra-frugal Toyota Prius has been upgraded for 2021 - DispatchLIVE", "description": "Toyota SA announced on Wednesday that its fourth-generation Prius has received a raft of safety and technology upgrades. Much like other models within the current Toyota lineup this iconic fuel-saving hybrid now comes equipped with the Toyota Safety Sense (TS…", "url": "https://www.dispatchlive.co.za/lifestyle/motoring/2021-04-14-the-ultra-frugal-toyota-prius-has-been-upgraded-for-2021/", "urlToImage": "https://lh3.googleusercontent.com/YgQDM3mC5nD-lERUb-YzNFeY8V_34aaYq1g0Dag_zutB2hYjYj7F_MkNU9bghkrVtA4bPPQ5VGDfm3I26NTDCoxkSfOXqnZX0Q=s1000", "publishedAt": "2021-04-14T18:09:29Z", "content": "Toyota SA announced on Wednesday that its fourth-generation Prius has received a raft of safety and technology upgrades. Much like other models within the current Toyota line-up this iconic fuel-savi… [+989 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "TECNO launches Spark 7 series; promises speed without compromisesTechnology - Guardian Nigeria", "description": "TECNO Mobile, a global premier mobile phone brand, has announced the launch of the all-new redesigned Spark 7 smartphone. Equipped with significantly upgraded and more powerful functional features, the Spark 7 series is guaranteed to offer everyday users a sw…", "url": "https://guardian.ng/technology/tecno-launches-spark-7-series-promises-speed-without-compromises/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/04/Spark-7-series-a.jpg", "publishedAt": "2021-04-14T17:17:00Z", "content": "TECNO Mobile, a global premier mobile phone brand, has announced the launch of the all-new redesigned Spark 7 smartphone. Equipped with significantly upgraded and more powerful functional features, t… [+3374 chars]"}, {"source": {"id": null, "name": "Orissapost.com"}, "author": "\"Post News Network\"", "title": "NASA again postpones first flight of Mars helicopter - OrissaPOST", "description": "Washington: NASA has again decided to delay the Ingenuity Mars Helicopter’s first experimental flight due to technical concerns. The US space agency, which is yet to declare a new date for the attempt, earlier rescheduled the flight after a test completed ear…", "url": "https://www.orissapost.com/nasa-again-postpones-first-flight-of-mars-helicopter/", "urlToImage": "https://www.orissapost.com/wp-content/uploads/2021/04/TOPSHOT-US-SPACE-AEROSPACE-NASA-MARS-900x506-1.jpg", "publishedAt": "2021-04-14T15:22:21Z", "content": "Washington: NASA has again decided to delay the Ingenuity Mars Helicopter’s first experimental flight due to technical concerns.\r\nThe US space agency, which is yet to declare a new date for the attem… [+1386 chars]"}, {"source": {"id": null, "name": "PetaPixel"}, "author": "https://www.facebook.com/DavidJCrewePhotography/", "title": "DxO PureRaw Review: Bring Old, Noisy Photos Back to Life - PetaPixel", "description": "Today, DxO launched PureRaw, an application that uses \"exclusive technology\" to enhance and improve RAW images by removing digital noise and lens flaws,", "url": "https://petapixel.com/2021/04/14/dxo-pureraw-review-bring-old-noisy-photos-back-to-life/", "urlToImage": "https://petapixel.com/assets/uploads/2021/04/DxO-PureRaw-Review-Bring-Old-Noisy-Photos-Back-to-Life.jpg", "publishedAt": "2021-04-14T13:00:25Z", "content": "Today, DxO launched PureRaw, an application that uses “exclusive technology” to enhance and improve RAW images by removing digital noise and lens flaws, leaving you with a cleaner and more accurate i… [+6452 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Duncan McLeod", "title": "EOH cuts 1 566 jobs, says worst of bloodletting now behind it - TechCentral", "description": "EOH Holdings has reduced its headcount by 1 566 employees in the past six months, mainly through selling or closing non-core and non-performing businesses, as it streamlines its operations and further reduces debt.", "url": "https://techcentral.co.za/eoh-cuts-1-566-jobs-says-worst-of-bloodletting-now-behind-it/106488/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2021/02/stephen-van-coller-2156-1120.jpg", "publishedAt": "2021-04-14T12:20:33Z", "content": "EOH CEO Stephen van Coller\r\nEOH Holdings has reduced its headcount by 1 566 employees in the past six months, mainly through selling or closing non-core and non-performing businesses, as it streamlin… [+3806 chars]"}, {"source": {"id": null, "name": "Mobile World Live"}, "author": null, "title": "Sony focused on camera first in latest flagships - Mobile World Live", "description": "Sony released a trio of Xperias, including two in its flagship range promoted on the inclusion of variable telephoto lens technology it claims as a mobile first, and a mid-tier 5G handset.", "url": "https://www.mobileworldlive.com/featured-content/top-three/sony-focused-on-camera-first-in-latest-flagships", "urlToImage": "https://i0.wp.com/www.mobileworldlive.com/wp-content/uploads/2021/04/MWL_Xperia-10-III_650.jpg?fit=650%2C399&ssl=1", "publishedAt": "2021-04-14T12:13:42Z", "content": "Sony unveiled a trio of Xperia smartphones, including two in its flagship range promoted on the inclusion of variable telephoto lens technology it claimed as a mobile first, along with a 5G handset t… [+1667 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The Covid-19 vaccine you will receive based on where you live – and the jobs that will likely be vaccinated first - BusinessTech", "description": "The Department of Health has provided further detail around its planned Covid-19 vaccine rollout, including how the vaccines will be distributed, and the jobs which are likely to receive the Covid-19 vaccines under phase 2 of the country’s rollout.", "url": "https://businesstech.co.za/news/business/483143/the-covid-19-vaccine-you-will-receive-based-on-where-you-live-and-the-jobs-that-will-likely-be-vaccinated-first/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/Ramaphosa-vaccine.png", "publishedAt": "2021-04-14T11:56:23Z", "content": "The Department of Health has provided further detail around its planned Covid-19 vaccine rollout, including how the vaccines will be distributed, and the jobs which are likely to receive the Covid-19… [+3090 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Microsoft is planning to fix common YouTube audio problems on Edge and Chrome - TechRadar", "description": "Solution for accidental muting (or lowering of volume) is in the works", "url": "https://www.techradar.com/news/microsoft-is-planning-to-fix-common-youtube-audio-problems-on-edge-and-chrome", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fcWXjQViKgfq5qSnLN22PE-1200-80.jpg", "publishedAt": "2021-04-14T11:38:37Z", "content": "Microsoft is working on ways to ensure that Edge or Chrome users (or indeed those with other Chromium-based browsers) dont end up frustrated with potential YouTube audio issues revolving around mutin… [+1775 chars]"}, {"source": {"id": null, "name": "Techcityng.com"}, "author": "Anibe Idajili", "title": "Google Doodle Celebrates Posthumous Birthday of Nigerian Music Legend Oliver De Coque - TechCity", "description": "Today, Google unveils a Doodle to posthumously mark the 74th birthday of Nigerian music legend and highlife maestro Oliver de", "url": "https://www.techcityng.com/google-doodle-celebrates-posthumous-birthday-of-nigerian-music-legend-oliver-de-coque/", "urlToImage": "https://h2g6j3q2.rocketcdn.me/wp-content/uploads/2021/04/Google-Doodle-Oliver-de-Coque.png", "publishedAt": "2021-04-14T11:10:42Z", "content": "Today, Google unveils a Doodle to posthumously mark the 74th birthday of Nigerian music legend and highlife maestro Oliver de Coque, one of Africas most prolific recording artists of all time. \r\nThe … [+2355 chars]"}, {"source": {"id": null, "name": "YourStory"}, "author": "Think Change Global", "title": "Scientists spin music out of spider webs...you can listen too - YourStory", "description": "A group of scientists at the Massachusetts Institute of Technology has converted the structure of the web into frequencies to play music", "url": "https://yourstory.com/socialstory/2021/04/scientists-spin-music-out-of-spider-web-trending", "urlToImage": "https://images.yourstory.com/cs/5/f5a7f3304b1211e9b6645b8ae897d03e/Imagely15-1618395315799.jpg?fm=png&auto=format", "publishedAt": "2021-04-14T10:41:23Z", "content": "Spider webs are some of the most complex natural structures and form an intricate network of 3D structures that they use to hunt and breed. A group of scientists at the Massachusetts Institute of Tec… [+2051 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "NASA Finds Solution for Ingenuity’s Technical Difficulties, but Delays Mars Flight Again - Gizmodo Australia", "description": "In good news and bad news, NASA has found a fix for the Ingenuity helicopter's software issue but has delayed its first flight on Mars once again.", "url": "https://www.gizmodo.com.au/2021/04/nasa-ingenuity-helicopter-flight-delayed-again/", "urlToImage": "https://imgix.gizmodo.com.au/content/uploads/sites/2/2021/04/14/ingenuity.jpg?ar=16%3A9&auto=format&fit=crop&q=65&w=1280", "publishedAt": "2021-04-14T02:06:00Z", "content": "We regret to inform you that the first test flight for NASA’s Ingenuity Helicopter has been delayed. Again.\r\nLook, we get it, space is tricky. But we just want to see a little helicopter achieve its … [+2429 chars]"}]}