{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 13 June 2023: Moons crossing Great Red Spot on Jupiter - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Jupiter’s two Galilean moons, Europa and Io, crossing the gas giant.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-13-june-2023-moons-crossing-great-red-spot-on-jupiter-71686640731737.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/Untitled_design_1686641342391_1686641362391.jpg", "publishedAt": "2023-06-13T07:30:19Z", "content": "Jupiter has been shocking astronomers ever since astronomer Galileo Galilei started recording its mysteries as far back as 1610. Jupiter is also known as the Gas Giant as it has a dense atmosphere of… [+2101 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Divyanshi Sharma", "title": "Apple Vision Pro has a new fan and it is none other than Google CEO Sundar Pichai - India Today", "description": "Google CEO Sundar Pichai said that he is excited about the potential of technology that is seen in Apple's Vision Pro to create more immersive computing experiences.", "url": "https://www.indiatoday.in/technology/news/story/apple-vision-pro-has-a-new-fan-and-it-is-none-other-than-google-ceo-sundar-pichai-2392346-2023-06-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/pichai-sixteen_nine.jpg?VersionId=XV7PBZj6PsGTII4dtKBkLUb8xszzyd6d", "publishedAt": "2023-06-13T05:25:33Z", "content": "By Divyanshi Sharma: While launching the Apple Vision Pro during the recently-held WWDC 2023, CEO Tim Cook called it a 'new type of computer' and unveiled the promising headset in front of the world.… [+2331 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! CME to hit Earth today, says NOAA; NASA sees more trouble ahead - HT Tech", "description": "NOAA forecasters have shown that a coronal mass ejection (CME) cloud will hit the Earth in the late hours of today, June 13. This can spark a dangerous solar storm. Know the details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-cme-to-hit-earth-today-says-noaa-nasa-sees-more-trouble-ahead-71686626183548.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/sun-4444454_1920_1651753999330_1686626223562.jpg", "publishedAt": "2023-06-13T03:21:23Z", "content": "On June 9, an M2.5-class solar flare eruption was spotted by the NASA Solar Dynamics Observatory (SDO). The flare was produced in a particularly unstable sunspot AR3331, which is still in the Earth's… [+2171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover BEBOP-1c: Tatooine-Like Exoplanet Orbits Twin Stars in a Multiplanetary System - SciTechDaily", "description": "An international team of astronomers has announced the second-ever discovery of a multiplanetary circumbinary system. Astronomers at the University of Birmingham have discovered a second planet, named BEBOP-1c, in the rare multiplanetary circumbinary system B…", "url": "https://scitechdaily.com/?p=285657", "urlToImage": "https://scitechdaily.com/images/Planet-With-Two-Suns-Illustration.jpg", "publishedAt": "2023-06-13T03:03:38Z", "content": "ByUniversity of BirminghamJune 12, 2023\r\nAn international team of astronomers has announced the discovery of a second planet in a rare multiplanetary circumbinary system, known as BEBOP-1 or TOI-1338… [+8442 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Astronomers identified a new Tatooine-like multi-planetary system - Tech Explorist", "description": "The second-ever discovery of a multiplanetary circumbinary system.", "url": "https://www.techexplorist.com/new-tatooine-multi-planetary-system/62025/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/multi-planetary-system.jpg", "publishedAt": "2023-06-13T02:53:36Z", "content": "Circumbinary planets that orbit around both stars of a central binary star system challenge our understanding of planet formation. With only 12 binary systems known to host circumbinary planets, iden… [+3151 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Quantum Physics: New Visualization Technique Gives Insight Into Photosynthesis - SciTechDaily", "description": "Researchers have developed coherence maps, a technique to visualize quantum mechanics and understand the mechanisms underpinning photosynthesis. The maps elucidate the complex energy transfer process in photosynthesizing bacteria, providing a clear picture of…", "url": "https://scitechdaily.com/harnessing-quantum-physics-new-visualization-technique-gives-insight-into-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-06-12T23:06:14Z", "content": "ByUniversity of Illinois Grainger College of EngineeringJune 12, 2023\r\nScientists have developed an illustrative method called coherence maps to elucidate quantum phenomena. They used these maps to g… [+4561 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple releases 15-inch Macbook Air, the world's thinnest laptop - Yahoo Finance", "description": "#Apple Macbook #youtube Apple unveiled its new 15-inch MacBook Air at its WWDC event last week. Yahoo Finance Tech Editor Dan Howley gives his review of Appl...", "url": "https://www.youtube.com/watch?v=aCa959eQcdY", "urlToImage": "https://i.ytimg.com/vi/aCa959eQcdY/hqdefault.jpg", "publishedAt": "2023-06-12T18:54:29Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}]}