{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung Galaxy Unpacked: From Galaxy S24 series to Galaxy AI, all the expected announcements - HT Tech", "description": "Samsung will have plenty on offer at the Galaxy Unpacked event, including the Galaxy S24 series, major AI launches namely Galaxy AI, as well as a possibility of the Galaxy Ring. Check out all the expected announcements during the event.", "url": "https://tech.hindustantimes.com/tech/news/samsung-galaxy-unpacked-from-galaxy-s24-series-to-galaxy-ai-all-the-expected-announcements-71705399682653.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/01/16/1600x900/SPAIN-MWC-2023-125_1681728459347_1705399783166.jpg", "publishedAt": "2024-01-16T10:10:30Z", "content": "Samsung Galaxy Unpacked event: Samsung is gearing up for the big launch of its flagship Galaxy S24 series at the Galaxy Unpacked event on January 17. While the last Samsung event was held at the comp… [+4602 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Capturing the Evolution of Life on Earth: Key Moment Revealed in Ancient Fossils - SciTechDaily", "description": "A new study precisely dates ancient multicellular fossils, uncovering key moments in Earth's history and the evolution of complex life after a global ice age. Research led by Curtin University has for the first time precisely dated some of the oldest fossils …", "url": "https://scitechdaily.com/capturing-the-evolution-of-life-on-earth-key-moment-revealed-in-ancient-fossils/", "urlToImage": "https://scitechdaily.com/images/Ancient-Fossil-Evolution-Art-Concept.jpg", "publishedAt": "2024-01-16T09:42:45Z", "content": "Researchers have precisely dated ancient multicellular fossils to 565 million years ago, using volcanic ash layers as time markers. These findings, based on fossils from Wales and similar sites world… [+3128 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid set to pass Earth at a breakneck speed of 51636 kmph; NASA reveals size, other details - HT Tech", "description": "NASA has tracked Asteroid 2021 CZ2 in its orbit which will bring it close to Earth today, January 16. Know details such as its speed, size, distance of approach, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-set-to-pass-earth-at-a-breakneck-speed-of-51636-kmph-nasa-reveals-size-other-details-71705388526950.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/01/16/1600x900/g94259f744c86d345088c6d639b0534f7a1c6a050828e4d658_1705388583871_1705388584073.jpg", "publishedAt": "2024-01-16T07:58:05Z", "content": "NASA says asteroids are ancient space rocks left over from the early formation of our solar system about 4.6 billion years ago. While most space rocks are located in the main asteroid belt between th… [+3090 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI A4 Royale Pass is now live! Check theme, rewards, in-game items, price, and more - HT Tech", "description": "BGMI has rolled out the A4 Royale Pass with a snowfall supreme theme and new exclusive rewards. Check details here.", "url": "https://tech.hindustantimes.com/how-to/bgmi-a4-royale-pass-is-now-live-check-theme-rewards-in-game-items-price-and-more-71705374907340.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/01/16/1600x900/5_1686302615762_1705374947491.jpg", "publishedAt": "2024-01-16T03:17:29Z", "content": "BGMI A4 Royale Pass: Battlegrounds Mobile India (BGMI) is known for bringing exclusive player rewards, events, timely updates, and new features in the game from time to time. This is something that a… [+2984 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Microsoft launches consumer version of Copilot AI assistant. Details here | Mint - Mint", "description": "Microsoft is opening up its AI assistant, Copilot, to customers and making the corporate version available to smaller companies. The company is selling a $20-a-month consumer version of Copilot with access to OpenAI's latest ChatGPT technology and image-creat…", "url": "https://www.livemint.com/companies/news/microsoft-launches-consumer-version-of-copilot-ai-assistant-details-here-11705365673924.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/01/16/1600x900/im-897709_1702034296426_1705367316161.jpg", "publishedAt": "2024-01-16T01:10:35Z", "content": "In this era of artificial intelligence, Microsoft is opening up its AI assistant to customers and making the corporate version available to smaller companies to increase the number of paying customer… [+2601 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "YouTube appears to be reducing video and site performance for ad-block users - Ars Technica", "description": "Latest consensus is that YouTube performance issues seem to be Adblock Plus' fault.", "url": "https://arstechnica.com/gadgets/2024/01/youtube-appears-to-be-reducing-video-and-site-performance-for-ad-block-users/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/youtube-logo-760x380.jpg", "publishedAt": "2024-01-15T21:36:23Z", "content": "272\r\nYouTube appeared to be continuing its war on ad blockers, with users complaining that the company was slowing down the site for users it catches running an ad blocker. 9to5Google spotted this Re… [+2137 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Associated Press", "title": "Lunar lander will burn up in Earth's atmosphere after failed moonshot - New York Post ", "description": "Astrobotic Technology said its lander is now headed back toward Earth from the vicinity of the moon. Company officials expect the mission to end Thursday. Astrobotic is working with NASA to track t…", "url": "https://nypost.com/2024/01/15/business/lunar-lander-will-burn-up-in-earths-atmosphere-after-failed-moonshot/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/01/newspress-collage-lwil7a6dr-1705348253012.jpg?quality=75&strip=all&1705330283&w=1024", "publishedAt": "2024-01-15T19:54:00Z", "content": "A U.S. companys lunar lander will soon burn up in Earths atmosphere after a failed moonshot.\r\nAstrobotic Technology said its lander is now headed back toward Earth from the vicinity of the moon. Comp… [+1625 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says 160-foot asteroid will pass Earth today; Check speed, distance, and more - HT Tech", "description": "NASA has revealed details of a close encounter with an asteroid that has been measured at 160 feet - nearly the size of an aircraft! Know its speed, distance of approach, and more, as per the space agency.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-160-foot-asteroid-will-pass-earth-today-check-speed-distance-and-more-71705292038685.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/01/15/1600x900/wikimedia_commons_1673950232106_1705292102673.jpg", "publishedAt": "2024-01-15T04:17:25Z", "content": "In a new development, NASA's Defense Coordination Office (PDCO), responsible for monitoring the skies and watching various Near-Earth Objects (NEOs), has shed light on an asteroid that will pass Eart… [+2740 chars]"}]}