{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 things about AI you may have missed today: Google to use public info to train AI, tech layoffs, more - HT Tech", "description": "AI Roundup: These are some of the most interesting news about artificial intelligence. Google has updated its privacy policy to suggest that it will be training its AI models on publicly available data.", "url": "https://tech.hindustantimes.com/tech/news/5-things-about-ai-you-may-have-missed-today-google-to-use-public-info-to-train-ai-tech-layoffs-more-71688492443632.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/04/1600x900/AI_1685153373330_1688492522866.JPG", "publishedAt": "2023-07-04T17:46:16Z", "content": "After announcing Gemini, a project by DeepMind aiming to surpass artificial intelligence models like ChatGPT yesterday, Google has now updated its privacy policy and is suggesting that it will only b… [+3614 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Celia Ford, Emily Mullin", "title": "One shot of a kidney protein gave monkeys a brain boost - Ars Technica", "description": "An early experiment in older rhesus macaques suggests that an injection of klotho improves working memory. Could it one day help people?", "url": "https://www.wired.com/story/one-shot-of-a-kidney-protein-gave-monkeys-a-brain-boost/", "urlToImage": "https://media.wired.com/photos/649ecade9ec11a2433532c15/191:100/w_1280,c_limit/brainconcept_science_GettyImages-1359441183.jpg", "publishedAt": "2023-07-04T12:05:42Z", "content": "They then administered a single low dose of klotho under each monkeys skin, raising levels of the protein to those normally present in the animals at birth. Four hours later, researchers had them com… [+2846 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Motorola Razr 40 Launched in India: First Look #gadgets360 #shorts - Gadgets 360", "description": "For the latest in mobile reviews and everything tech, visit http://www.gadgets360.com➥ Twitter:       https://twitter.com/Gadgets360➥ Facebook:  https://www....", "url": "https://www.youtube.com/watch?v=uFlpLtJn77Q", "urlToImage": "https://i.ytimg.com/vi/uFlpLtJn77Q/maxres2.jpg?sqp=-oaymwEoCIAKENAF8quKqQMcGADwAQH4AbYIgAKAD4oCDAgAEAEYNSBSKH8wDw==&rs=AOn4CLA9mZv_43UfTnggBB-juX6pgGKp6Q", "publishedAt": "2023-07-04T11:37:26Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Elusive Ninth Dedekind Number Discovered: Unlocking a Decades-Old Mystery of Mathematics - SciTechDaily", "description": "Scientists from the Universities of Paderborn and Leuven solve long-known problem in mathematics. Making history with 42 digits: Scientists at Paderborn University and KU Leuven have unlocked a decades-old mystery of mathematics with the so-called ninth Dedek…", "url": "https://scitechdaily.com/?p=289258", "urlToImage": "https://scitechdaily.com/images/Mathematics-Problem-Mystery-Concept.jpg", "publishedAt": "2023-07-04T08:25:01Z", "content": "Mathematicians at Paderborn University and KU Leuven, using the Noctua supercomputer and specialized hardware accelerators, have solved a decades-old problem by calculating the ninth Dedekind number,… [+6774 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Parker Solar Probe reveals secrets of the solar wind, which sparks geomagnetic storms on Earth - HT Tech", "description": "The data obtained from Parker Solar Probe has helped scientists to better understand Solar wind speed and this may help in predicting solar eruptions and understanding geomagnetic storms.", "url": "https://tech.hindustantimes.com/tech/news/parker-solar-probe-reveals-secrets-of-the-solar-wind-which-sparks-geomagnetic-storms-on-earth-71688449127327.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/04/1600x900/Parker-Solar-Probe_ObservingSun_1280_1688449981472_1688449997550.jpg", "publishedAt": "2023-07-04T05:57:21Z", "content": "Scientists have made a groundbreaking discovery about the solar wind, revealing how it reaches extraordinary speeds exceeding 1 million miles per hour. The findings, published in the journal Nature, … [+2314 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "The detection of the Universe's background gravitational wave radiation: a scientific triumph - WSWS", "description": "The same confident optimism which organized thousands of scientists towards the successful detection of high-frequency gravitational waves in 2015 now has produced its first fruit with another detector technology and strategy in seeing the background of long-…", "url": "https://www.wsws.org/en/articles/2023/07/04/zxwd-j04.html", "urlToImage": "https://www.wsws.org/asset/71369476-ff16-4582-bedb-684d5cd98315?rendition=1600x900", "publishedAt": "2023-07-04T02:07:48Z", "content": "Count what is countable, measure what is measurable, and what is not measurable, make measurableattributed to Galileo Galilei\r\nThe detection of a predicted universal background of gravitational waves… [+18931 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "As Twitter flounders, Mastodon refreshes its official app for Android users - TechCrunch", "description": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, Mastodon is launching a significant refresh of its Android app.", "url": "https://techcrunch.com/2023/07/03/as-twitter-flounders-mastodon-refreshes-its-official-app-for-android-users/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/mastodon-app-android.png?resize=1200,734", "publishedAt": "2023-07-03T19:48:55Z", "content": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, open source Twitter alternative Mastodon is celebrating the launch of a significant refresh of its Android… [+3300 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Urine tests identify brain tumors by capturing cancer DNA using nanowires - Phys.org", "description": "A group led by researchers at Nagoya University in Japan has developed a technology to capture and release cell-free DNA (cfDNA) on nanowire surfaces from urine. By extracting this DNA, they were able to successfully detect IDH1 mutation, a characteristic gen…", "url": "https://phys.org/news/2023-07-urine-brain-tumors-capturing-cancer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/urine-tests-identify-b.jpg", "publishedAt": "2023-07-03T13:41:32Z", "content": "A group led by researchers at Nagoya University in Japan has developed a technology to capture and release cell-free DNA (cfDNA) on nanowire surfaces from urine. By extracting this DNA, they were abl… [+4490 chars]"}, {"source": {"id": null, "name": "Longevity.technology"}, "author": "Ivy C", "title": "Reversing biological age: Longevity researcher reveals his age-defying morning routine! - Longevity.Technology", "description": "Dr. David Sinclair improved his health through lifestyle changes like a plant-based diet, no alcohol, and a strict morning routine.", "url": "https://longevity.technology/lifestyle/reversing-biological-age-longevity-researcher-reveals-10-year-age-defying-morning-routine/", "urlToImage": "https://longevity.technology/lifestyle/wp-content/uploads/2023/06/closeup-of-green-tea-on-glass-cup-with-teacup-in-background_Cr_antoninavlasova_Envato.jpg", "publishedAt": "2023-06-30T21:13:58Z", "content": "The antiaging researcher David Sinclair says he’s reversed his ‘biological age’ by 10 years.\r\nIn an interview with GQ, the 54-year-old Harvard biologist David Sinclair revealed that, as a result of a… [+4871 chars]"}]}