{"articles": [{"author": "The Irish Times", "content": "Shares in Deliveroo plunged by as much as 30 per cent in their trading debut on Wednesday, slicing more than £2 billion (2.35 bn) off the companys valuation in a blow to Britains ambitions to attract… [+4081 chars]", "description": "Pressure mounts on City’s efforts to boost profile as tech and listings hub post-Brexit", "publishedAt": "2021-03-31T14:37:30Z", "source": {"id": "the-irish-times", "name": "The Irish Times"}, "title": "Deliveroo shares sink 30% in London debut - The Irish Times", "url": "https://www.irishtimes.com/business/markets/deliveroo-shares-sink-30-in-london-debut-1.4524870", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4524869&origw=1440"}, {"author": "Samuel Tolbert", "content": "Super Mario 3D All-Stars on Nintendo Switch includes ports of Super Mario Sunshine, Super Mario Galaxy and Super Mario 64 in one fun package.\r\nHowever, if you haven't bought Super Mario 3D All-Stars … [+1370 chars]", "description": "If you haven't bought these Switch games yet, time is running out", "publishedAt": "2021-03-31T14:20:32Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "PSA: Super Mario 3D All-Stars won't be available on Nintendo Switch after today - Techradar", "url": "https://www.techradar.com/news/psa-super-mario-3d-all-stars-wont-be-available-on-nintendo-switch-after-today", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dPkC4hkhXwfyaBymH5HeG9-1200-80.jpg"}, {"author": "Investor's Business Daily", "content": "The Dow Jones Industrial Average briefly rose 100 points Wednesday ahead of details of President Biden's $2 trillion infrastructure package. Apple, Boeing and Tesla stock rallied, while Lululemon tum… [+6280 chars]", "description": "The Dow Jones Industrial Average turned lower Wednesday ahead of details of President Biden's infrastructure plan. Apple, Boeing and Tesla stock rallied.", "publishedAt": "2021-03-31T13:56:00Z", "source": {"id": null, "name": "Investor's Business Daily"}, "title": "Dow, Tech Stocks Rise Ahead Of Biden Infrastructure Plan; Apple, Boeing, Tesla Rally - Investor's Business Daily", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-stock-market-rally-biden-spending-plan-apple-stock-tesla-stock-lululemon-earnings/", "urlToImage": "https://www.investors.com/wp-content/uploads/2021/01/Stock-biden-08-shutt.jpg"}, {"author": "Samuel Tolbert", "content": "Genshin Impact is a popular anime-inspired free-to-play game available on mobile devices, PC and on PS4. While it can be played on the PS5 through backward compatibility, it doesn't take advantage of… [+1142 chars]", "description": "Ready to grind out even more heroes but with increased quality and performance?", "publishedAt": "2021-03-31T13:51:04Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Genshin Impact on PS5 is coming soon with faster loading and DualSense features - TechRadar", "url": "https://www.techradar.com/news/genshin-impact-ps5-version-is-coming-soon-with-faster-loading-and-dualsense-features", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4xeHSMcNLx9KEEYBwoNZCZ-1200-80.jpg"}, {"author": "Maeve Campbell", "content": "Google will soon use its popular Maps app to direct drivers along more eco-friendly routes to reduce the carbon footprint of car journeys.\r\nThe Alphabet Inc. owned tech giant announced this week that… [+3011 chars]", "description": "The tech giant is using AI to improve its popular maps app to help combat climate change.", "publishedAt": "2021-03-31T12:47:48Z", "source": {"id": null, "name": "Euronews"}, "title": "Google Maps will soon direct drivers to routes with the lowest carbon impact - Euronews", "url": "https://www.euronews.com/living/2021/03/31/google-maps-will-soon-direct-drivers-to-routes-with-the-lowest-carbon-impact", "urlToImage": "https://static.euronews.com/articles/stories/05/51/34/80/1000x563_cmsv2_cebcc233-354e-5374-ab11-6d5f284d4a17-5513480.jpg"}, {"author": "", "content": "New research has shown for the first time that animal DNA can be collected from the air, and the finding could help in the understanding of the transmission of airborne diseases like Covid-19, the st… [+2124 chars]", "description": "The technique could be used to sample air to ‘collect real-world evidence' to support things like social distancing guidelines, the study author said.", "publishedAt": "2021-03-31T12:20:10Z", "source": {"id": null, "name": "The Irish News"}, "title": "Animal DNA can be collected from air, scientists show for first time - The Irish News", "url": "https://www.irishnews.com/magazine/science/2021/03/31/news/animal-dna-can-be-collected-from-air-scientists-show-for-first-time-2274068/", "urlToImage": "http://www.irishnews.com/picturesarchive/irishnews/irishnews/2021/03/31/140109362-e18e9ef9-00f9-415f-a917-96b1e414cc8d.jpg"}, {"author": null, "content": "The new detection test can be performed on crude patient samples without the need for RNA purification, and can provide results in 30 minutes\r\nA team of researchers at Singapore’s Nanyang Technologic… [+1951 chars]", "description": "A team of researchers at Singapore’s Nanyang Technological University (NTU) have recently made a breakthrough by designing a new diagnostic test called Variant Nucleotide Guard (VaNGuard) for detecting mutated variants of Covid-19.", "publishedAt": "2021-03-31T06:48:18Z", "source": {"id": null, "name": "Nwdiamondnotes.com"}, "title": "Researchers in Singapore develop a new Covid-19 detection test - Northwest Diamond Notes", "url": "https://www.nwdiamondnotes.com/researchers-in-singapore-develop-a-new-covid-19-detection-test/", "urlToImage": "https://www.nwdiamondnotes.com/img/health/researchers-in-singapore-develop-a-new-covid-19-detection-test.jpg"}, {"author": null, "content": "It’s no secret that the place to be forS&amp;P/ASX 200 Index(ASX: XJO) gains in 2021 so far has not been the ASX tech sector. Or any ASX shares that can be called a ‘growth share’ for that matter.\r\nF… [+2673 chars]", "description": "ASX tech shares have had a rough month or two. But there's the potential that things could get a lot worse for the tech sector going forward. Here's why.", "publishedAt": "2021-03-31T06:12:11Z", "source": {"id": null, "name": "Motley Fool Australia"}, "title": "Is the ASX tech sector in for more pain? - The Motley Fool Australia", "url": "https://www.fool.com.au/2021/03/31/a-warning-for-all-asx-tech-investors/", "urlToImage": "https://www.fool.com.au/wp-content/uploads/2020/03/Warning-16.9-1.jpg"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "Cooperative Governance and Traditional Affairs (Cogta) minister Nkosazana Dlamini-Zuma has published a new gazette that provides further details around South Africas level 1 lockdown over the Easter … [+5805 chars]", "description": "Cooperative Governance and Traditional Affairs (Cogta) minister Nkosazana Dlamini-Zuma has published a new gazette that provides further details around South Africa’s level 1 lockdown over the Easter period.", "publishedAt": "2021-03-31T06:07:59Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "Dlamini-Zuma details new lockdown rules for South Africa - BusinessTech", "url": "https://businesstech.co.za/news/government/479817/dlamini-zuma-details-new-lockdown-rules-for-south-africa-2/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Nkosazana-Dlamini-Zuma-South-African-Minister-of-Cooperative-Governance-and-Traditional-Affairs-7.jpg"}, {"author": null, "content": "In the past, we had something called butt-dialling where you ended up accidentally calling someone.\r\nBut with the evolution of technology, butt-dialling no longer only results in accidental calls. So… [+1688 chars]", "description": "In the past, we had something called butt-dialling where you ended up accidentally calling someone. But with the evolution of technology, butt-dialling no longer only results in accidental calls. Sometimes people go live on their social media unintentionally,…", "publishedAt": "2021-03-31T03:59:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Oopsie! Over 800 fans tune in to Rebecca Lim's accidental livestream that featured (almost) nothing - AsiaOne", "url": "https://www.asiaone.com/entertainment/oopsie-over-800-fans-tune-rebecca-lims-accidental-livestream-featured-almost-nothing", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210331_rebecca.jpg?h=c9e0d402&itok=MEf6DDeB"}, {"author": "Bennett Cyphers", "content": "Today, Google launched an origin trial of Federated Learning of Cohorts (aka FLoC), its experimental new technology for targeting ads. A switch has silently been flipped in millions of instances of G… [+9676 chars]", "description": "Today, Google launched an “origin trial” of Federated Learning of Cohorts (aka FLoC), its experimental new technology for targeting ads. A switch has silently been flipped in millions of instances of Google Chrome: those browsers will begin sorting their user…", "publishedAt": "2021-03-31T03:35:38Z", "source": {"id": null, "name": "EFF"}, "title": "Google Is Testing Its Controversial New Ad Targeting Tech in Millions of Browsers. Here's What We Know. - EFF", "url": "https://www.eff.org/deeplinks/2021/03/google-testing-its-controversial-new-ad-targeting-tech-millions-browsers-heres", "urlToImage": "https://www.eff.org/files/banner_library/google-spy-eye.png"}, {"author": "Science X staff", "content": "With shark bites increasing in countries like Australiascientists say the use of personal electronic deterrents is an effective way to prevent future deaths and injuries which could save the lives of… [+4284 chars]", "description": "With shark bites increasing in countries like Australia—scientists say the use of personal electronic deterrents is an effective way to prevent future deaths and injuries which could save the lives of up to 1063 Australians along the coastline over the next 5…", "publishedAt": "2021-03-30T23:10:01Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Scientists show technology can save people from shark bites - Phys.org", "url": "https://phys.org/news/2021-03-scientists-technology-people-shark.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/6-scientistssh.jpg"}, {"author": null, "content": "ByKelso Harper, MIT Kavli Institute for Astrophysics and Space ResearchMarch 30, 2021The newly discovered galaxy cluster CHIPS1911+4455 has a unique twisted shape compared to other rapidly cooling ga… [+5767 chars]", "description": "Lesson learned from the CHiPS survey must inform future cluster searches, researchers say. MIT astronomers have discovered new and unusual galactic neighborhoods that previous studies overlooked. Their results, published on March 26, 2021, in The Astrophysica…", "publishedAt": "2021-03-30T17:09:36Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "CHiPS: MIT Astronomers Discover New Galaxy Clusters Hiding in Plain Sight - SciTechDaily", "url": "https://scitechdaily.com/chips-mit-astronomers-discover-new-galaxy-clusters-hiding-in-plain-sight/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Cluster-CHIPS1911-4455.jpg"}], "message": "Successful api call", "number_of_news": 13, "status": 200, "topic": "tech"}