{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14, iPhone 14 Pro, iPhone 14 Plus get huge discounts as Amazon's Apple Day sale goes live - HT Tech", "description": "Good news for Apple fans. If you were looking for price cuts to be announced on iPhone 14, iPhone 14 Pro, iPhone 14 Plus and more, then your wait is over as Amazon’s Apple day sale has gone live", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-iphone-14-pro-iphone-14-plus-get-huge-discounts-as-amazons-apple-day-sale-goes-live-71686659104716.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/APPLE-FAR-OUT-51_1669476928393_1669476928393_1686659362688.jpg", "publishedAt": "2023-06-13T12:32:17Z", "content": "Amazon has just announced its most awaited Apple days sale. Notably, it is rolling out amazing discounts on a number of iPhones. The sale is on and will go on for a week. If you are an Apple fan, gra… [+1290 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Where Did Earth's Water Come From? - SciTechDaily", "description": "Newly discovered exoplanets contribute to the development of a novel model that offers potential explanations for the origin of some of Earth’s signature features, such as its abundance of water. New research from Carnegie Science's Anat Shahar, along with UC…", "url": "https://scitechdaily.com/?p=280872", "urlToImage": "https://scitechdaily.com/images/Sun-Rises-Over-Earth.jpg", "publishedAt": "2023-06-13T11:33:43Z", "content": "ByCarnegie Institution for ScienceJune 13, 2023\r\nResearchers suggest that Earths water may have originated from interactions between the hydrogen-rich atmospheres and magma oceans of early planetary … [+7620 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Some Species Survive Mass Extinctions? Hidden “Whole Genome Duplication” May Be the Secret - SciTechDaily", "description": "Geneticists have made a significant discovery about the ancient history of sturgeons and paddlefish, which carries profound implications for our understanding of evolution. They identified a previously hidden instance of \"whole genome duplication\" (WGD) in th…", "url": "https://scitechdaily.com/?p=283315", "urlToImage": "https://scitechdaily.com/images/Abstract-Genetic-Sequencing-Fail.jpg", "publishedAt": "2023-06-13T10:12:28Z", "content": "ByTrinity College DublinJune 13, 2023\r\nGeneticists discovered a past whole genome duplication (WGD) event in the common ancestor of sturgeons and paddlefish that occurred just before a significant ma… [+4344 chars]"}, {"source": {"id": null, "name": "Mixed-news.com"}, "author": "Benjamin Danneberg", "title": "Google CEO on VR/AR: Excited about the technology - MIXED Reality News", "description": "In an interview with Bloomberg, Google CEO Sundar Pichai is also asked about the Apple Vision Pro VR/AR headset.", "url": "https://mixed-news.com/en/google-ceo-pichai-on-vr-ar/", "urlToImage": "https://mixed-news.com/en/wp-content/uploads/2023/06/Sundar-Pichai_Google-CEO.jpg", "publishedAt": "2023-06-13T08:54:48Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Obesity May Permanently Change the Brain – Yale Study Finds Severely Impaired Response to Nutrients - SciTechDaily", "description": "A new research study reveals a diminished response to nutrients among people with obesity — and that this brain response is not recovered after weight loss. After a person eats, the gut dispatches a series of signals to the brain conveying the presence of nut…", "url": "https://scitechdaily.com/?p=285761", "urlToImage": "https://scitechdaily.com/images/Brain-Signals-Improvement-Concept.jpg", "publishedAt": "2023-06-13T08:34:50Z", "content": "ByMallory Locklear, Yale UniversityJune 13, 2023\r\nResearchers from Yale found that obesity is associated with diminished brain response to nutrient intake, which doesnt recover even after weight loss… [+6056 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! CME to hit Earth today, says NOAA; NASA sees more trouble ahead - HT Tech", "description": "NOAA forecasters have shown that a coronal mass ejection (CME) cloud will hit the Earth in the late hours of today, June 13. This can spark a dangerous solar storm. Know the details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-cme-to-hit-earth-today-says-noaa-nasa-sees-more-trouble-ahead-71686626183548.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/sun-4444454_1920_1651753999330_1686626223562.jpg", "publishedAt": "2023-06-13T03:21:23Z", "content": "On June 9, an M2.5-class solar flare eruption was spotted by the NASA Solar Dynamics Observatory (SDO). The flare was produced in a particularly unstable sunspot AR3331, which is still in the Earth's… [+2171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Quantum Physics: New Visualization Technique Gives Insight Into Photosynthesis - SciTechDaily", "description": "Researchers have developed coherence maps, a technique to visualize quantum mechanics and understand the mechanisms underpinning photosynthesis. The maps elucidate the complex energy transfer process in photosynthesizing bacteria, providing a clear picture of…", "url": "https://scitechdaily.com/harnessing-quantum-physics-new-visualization-technique-gives-insight-into-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-06-12T23:06:14Z", "content": "ByUniversity of Illinois Grainger College of EngineeringJune 12, 2023\r\nScientists have developed an illustrative method called coherence maps to elucidate quantum phenomena. They used these maps to g… [+4561 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Innovative Technology for Capturing Carbon Dioxide From Air Licensed to Holocene - AZoCleantech", "description": "An innovative and sustainable chemistry developed at the Department of Energy's Oak Ridge National Laboratory for capturing carbon dioxide from air has been licensed to Holocene, a Knoxville-based startup focused on designing and building plants that remove c…", "url": "https://www.azocleantech.com/news.aspx?newsID=33546", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/NewsThumbImage_33546.jpg", "publishedAt": "2023-06-12T10:54:00Z", "content": "An innovative and sustainable chemistry developed at the Department of Energy's Oak Ridge National Laboratory for capturing carbon dioxide from air has been licensed to Holocene, a Knoxville-based st… [+6205 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Primordial Life: Scientists Discover “Lost World” of Our Early Ancestors in Billion-Year-Old Rocks - SciTechDaily", "description": "A multinational research team has found ancient protosteroids in rocks, indicating that complex life existed up to 1.6 billion years ago. These molecules offer a novel insight into the evolution of complex life and reconcile the discrepancies between traditio…", "url": "https://scitechdaily.com/?p=284982", "urlToImage": "https://scitechdaily.com/images/Primordial-Eukaryotic-Organisms.jpg", "publishedAt": "2023-06-12T08:32:11Z", "content": "ByMARUM - Center for Marine Environmental Sciences, University of BremenJune 12, 2023\r\nArtists imagination of an assemblage of primordial eukaryotic organisms of the Protosterol Biota inhabiting a ba… [+9001 chars]"}]}