{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ashley Belanger", "title": "Zuckerberg’s 2012 email dubbed “smoking gun” at Meta monopoly trial - Ars Technica", "description": "FTC’s “entire” monopoly case rests on decade-old emails, Meta argued.", "url": "https://arstechnica.com/tech-policy/2025/04/ftcs-monopoly-case-hinges-on-zuckerbergs-damaging-texts-emails/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/04/GettyImages-2209717372-1024x648.jpg", "publishedAt": "2025-04-14T19:11:14Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "University of Vienna", "title": "Sophisticated pyrotechnology in the Ice Age: How humans made fire tens of thousands of years ago - Phys.org", "description": "Whether for cooking, heating, as a light source or for making tools—it is assumed that fire was essential for the survival of people in the Ice Age. However, it is puzzling that hardly any well-preserved evidence of fireplaces from the coldest period of the I…", "url": "https://phys.org/news/2025-04-sophisticated-pyrotechnology-ice-age-humans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/sophisticated-pyrotech.jpg", "publishedAt": "2025-04-14T15:14:03Z", "content": "Whether for cooking, heating, as a light source or for making toolsit is assumed that fire was essential for the survival of people in the Ice Age. However, it is puzzling that hardly any well-preser… [+4469 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Chipolo’s newest AirTag competitor works with both Apple and Google’s finding networks - TechCrunch", "description": "Chipolo, the maker of AirTag-like devices, on Monday introduced the latest version of its product. Now, instead of offering models that only work with", "url": "https://techcrunch.com/2025/04/14/chipolos-newest-airtag-competitor-works-with-both-apple-and-googles-finding-networks/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/04/Chipolo-POP-wallpaper.jpg?resize=1200,800", "publishedAt": "2025-04-14T15:08:33Z", "content": "Chipolo, the maker of AirTag-like devices, on Monday introduced the latest version of its product. Now, instead of offering models that only work with either Apple or Google’s lost-item finding techn… [+1881 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "CT Scans Projected to Result in 100,000 New Cancers in The US - ScienceAlert", "description": "More Americans are receiving computed tomography (CT) scans than ever before, and while this technology can save lives, some scientists are concerned about the potential for low doses of ionizing radiation to increase cancer risks.", "url": "https://www.sciencealert.com/ct-scans-projected-to-result-in-100000-new-cancers-in-the-us", "urlToImage": "https://www.sciencealert.com/images/2025/04/CTScan.jpg", "publishedAt": "2025-04-14T15:01:39Z", "content": "More Americans are receiving computed tomography (CT) scans than ever before, and while this technology can save lives, some scientists are concerned about the potential for low doses of ionizing rad… [+4728 chars]"}]}