{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "What are solar radiation storms and their impact on Earth? - HT Tech", "description": "Know all about solar radiation storms and how it impacts the Earth.", "url": "https://tech.hindustantimes.com/tech/news/what-are-solar-radiation-storms-and-their-impact-on-earth-71689746062826.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/19/1600x900/m73-flare-rotated_0_1680256680821_1689746100317.jpeg", "publishedAt": "2023-07-19T05:57:26Z", "content": "Every now and then we hear about solar storms and solar flares being spewed out by the Sun and the impact it has on Earth including on satellites and power grids. But have you heard about solar radia… [+1961 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers discover origami DNA to control virus assembly - ETHealthWorld", "description": "The worldwide team behind the study, which was reported in Nature Nanotechnology, devised a method to precisely and programmably regulate the building of virus capsids - the protein shell of viruses - in physiological settings.", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-discover-origami-dna-to-control-virus-assembly/101918519", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-101918519,imgsize-42160,width-1200,height=765,overlay-ethealth/industry/researchers-discover-origami-dna-to-control-virus-assembly.jpg", "publishedAt": "2023-07-19T05:31:11Z", "content": "Washington: Griffith University researchers have played a vital role in controlling the way viruses are built by utilizing DNA 'origami' templates.The worldwide team behind the study, which was repor… [+2283 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sergio Ramos Montoya", "title": "Samsung’s Galaxy Unpacked: The most anticipated announcements ahead of next week’s showcase - HT Tech", "description": "With just days to go until the Samsung Galaxy Unpacked 2023 showcase, check out the most anticipated announcements among the likes of Samsung Galaxy Z Fold 5, Galaxy Z Flip 5, Galaxy Watch 6, and more.", "url": "https://tech.hindustantimes.com/tech/news/samsungs-galaxy-unpacked-the-most-anticipated-announcements-ahead-of-next-week-s-showcase-71689743378240.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/19/1600x900/onur-binay-uk5FrhKtr7E-unsplash_1689743854483_1689743864761.jpg", "publishedAt": "2023-07-19T05:19:57Z", "content": "Samsung's Galaxy Unpacked, the biannual event that showcases the technology company's latest devices, has confirmed its second conference in 2023 for 26 July. The internet is already abuzz with specu… [+5499 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "190-foot asteroid rushing towards Earth rapidly; NASA needs your help to track space rocks! - HT Tech", "description": "Asteroid 2023 NE1 will make an extremely close approach to Earth today, and you can help NASA track space rocks like this with the Daily Minor Project.", "url": "https://tech.hindustantimes.com/tech/news/190foot-asteroid-rushing-towards-earth-rapidly-nasa-needs-your-help-to-track-space-rocks-71689741565350.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/19/1600x900/asteroid_1681212528521_1689741958556.jpg", "publishedAt": "2023-07-19T04:47:29Z", "content": "If you're a budding astronomer and asteroid hunter, then you can help NASA discover and track asteroids in space! NASA's new Daily Minor Planet Project allows astronomers and skywatchers to help disc… [+2471 chars]"}, {"source": {"id": null, "name": "Techlusive.in"}, "author": "om.gupta", "title": "Now, you can easily find inspiration for Reels in Instagram: Here's how - Techlusive", "description": "Template Browser will enable users to browse templates by categories based on Recommended Trending and templates or audio that creators have saved.Â", "url": "https://www.techlusive.in/apps/instagram-introduces-template-browser-in-reels-templates-heres-everything-you-need-to-know-1391510/", "urlToImage": "https://st1.techlusive.in/wp-content/uploads/2023/01/instagram-2.jpg", "publishedAt": "2023-07-19T04:22:42Z", "content": "Template Browser will enable users to browse templates by categories based on Recommended, Trending, and templates or audio that creators have saved.Â \r\nMeta has introduced a new feature to its Insta… [+2514 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "CEPI and HMRI partner to accelerate development of pandemic vaccines - News-Medical.Net", "description": "CEPI, the Coalition for Epidemic Preparedness Innovations, and the Houston Methodist Research Institute (HMRI), have today announced a partnership to combine cutting-edge artificial intelligence (AI) technology with established laboratory techniques to speed …", "url": "https://www.news-medical.net/news/20230718/CEPI-and-HMRI-partner-to-accelerate-development-of-pandemic-vaccines.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2023-07-18T17:38:00Z", "content": "CEPI, the Coalition for Epidemic Preparedness Innovations, and the Houston Methodist Research Institute (HMRI), have today announced a partnership to combine cutting-edge artificial intelligence (AI)… [+6331 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Starling CubeSats Deployed: NASA's Swarm Satellite Mission Launches on Electron Rocket - SciTechDaily", "description": "NASA’s Starling mission lifted off from the launch pad aboard Rocket Lab’s Electron rocket from Pad B and Launch Complex 1 in Mahia, New Zealand, at 1:27 p.m. local time. Subsequently, the four Starling CubeSats were confirmed to have deployed from the Rocket…", "url": "https://scitechdaily.com/starling-cubesats-deployed-nasas-swarm-satellite-mission-launches-on-electron-rocket/", "urlToImage": "https://scitechdaily.com/images/NASA-Starling-CubeSats-in-Low-Earth-Orbit-scaled.jpg", "publishedAt": "2023-07-18T07:20:44Z", "content": "NASAs Starling six-month mission will use a team of four CubeSats in low Earth orbit to test technologies that let spacecraft operate in a synchronized manner without resources from the ground. The t… [+1684 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Sarah Steimer", "title": "Human-aware AI helps accelerate scientific discoveries, new research shows - Tech Xplore", "description": "A new study explores how artificial intelligence can not only better predict new scientific discoveries but can also usefully expand them. The researchers, who published their work in Nature Human Behaviour, built models that could predict human inferences an…", "url": "https://techxplore.com/news/2023-07-human-aware-ai-scientific-discoveries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/human-aware-ai-helps-a.jpg", "publishedAt": "2023-07-17T14:33:04Z", "content": "A new study explores how artificial intelligence can not only better predict new scientific discoveries but can also usefully expand them. The researchers, who published their work in Nature Human Be… [+5968 chars]"}]}