{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple M3 chip tipped to launch in 3 variants; Know all about it - HT Tech", "description": "With the launch of the next Apple Silicon chip just around the corner, check out the different variants of the M3 chip and what they could offer.", "url": "https://tech.hindustantimes.com/tech/news/apple-m3-chip-tipped-to-launch-in-3-variants-know-all-about-it-71698632030236.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/mia-baker-ctRgcY-lY8I-unsplash_1698632196568_1698632207266.jpg", "publishedAt": "2023-10-30T02:17:34Z", "content": "Apple event: After months of anticipation, the launch of the next-generation Apple Silicon chip is just around the corner. The Apple event, termed Scary Fast', perhaps a reference to the new M3 chips… [+2104 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "Samsung Electronics Unveils Galaxy Z Flip5 Retro To Celebrate a Legacy of Innovation - Samsung", "description": "Samsung Electronics pays homage to the innovative design and features of SGH-E700 with the release of Galaxy Z Flip5 Retro, marking 20 years of technical advancement", "url": "https://news.samsung.com/global/samsung-electronics-unveils-galaxy-z-flip5-retro-to-celebrate-a-legacy-of-innovation", "urlToImage": "https://img.global.news.samsung.com/global/wp-content/uploads/2023/10/Galaxy-Z-Flip5-Retro_Thumb728.jpg", "publishedAt": "2023-10-30T01:09:09Z", "content": "Samsung Electronics today announced that it is set to release the Galaxy Z Flip5 Retro  a limited edition phone that embodies Samsung’s legacy of innovation  from November 1 in Korea, the U.K., Germa… [+1981 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Mangalyaan-2 mission: How ISRO is paving India's way to Mars - HT Tech", "description": "Mangalyaan2 mission How ISRO is paving Indias way to Mars After 9 years India is looking to make its way back towards Mars with the Mangalyaan2 mission. Know how many space orbiter missions have been done so far before Mars orbital Mission1 ISRO entered Mars …", "url": "https://tech.hindustantimes.com/web-stories/mangalyaan2-mission-how-isro-is-paving-indias-way-to-mars-71698640955353.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/g3944d27f316f3_1698641862900_1698642458277.png/", "publishedAt": "2023-10-29T23:38:15Z", "content": "Photo Credit: Pixabay\r\n  After 9 years, India is looking to make its way back towards Mars with the Mangalyaan-2 mission. Know how many space orbiter missions have been done so far before Mars orbita… [+1800 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: ISRO collaborates with global space agency to study lunar surface - HT Tech", "description": "Chandrayaan4 mission ISRO collaborates with global space agency to study lunar surface ISRO joined hands with the Japanese space agency JAXA for the Chandrayaan4 mission. Know how this collaboration will strengthen its future lunar mission. With the Chandraya…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-isro-collaborates-with-global-space-agency-to-study-lunar-surface-71698639744885.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/C4_1698639998601_1698640000637.png/", "publishedAt": "2023-10-29T22:57:01Z", "content": "Photo Credit: JAXA\r\n  ISRO joined hands with the Japanese space agency JAXA for the Chandrayaan-4 mission. Know how this collaboration will strengthen its future lunar mission.\r\nPhoto Credit: ISRO\r\n … [+1610 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-3 mission: What is ejecta halo that Vikram Lander created on the Moon - HT Tech", "description": "Chandrayaan3 mission What is ejecta halo that Vikram Lander created on the Moon ISRO revealed an awesome event of the Chandrayaan3 mission. Know how the Vikram lander created ejecta halo. Know what the term means. ISRO recently made an announcement that Vikra…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan3-mission-what-is-ejecta-halo-that-vikram-lander-created-on-the-moon-71698637052307.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/CVK_8_1698637568885_1698637575809.png/", "publishedAt": "2023-10-29T22:16:59Z", "content": "Photo Credit: ISRO\r\n  ISRO revealed an awesome event of the Chandrayaan-3 mission. Know how the Vikram lander created ejecta halo. Know what the term means.\r\nPhoto Credit: ISRO\r\n ISRO recently made a… [+1518 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering Uranus' Glow: New Hints for Life on Icy Exoplanets - SciTechDaily", "description": "University of Leicester astronomers confirm the existence of an infrared (IR) aurora on Uranus. The presence of an infrared aurora on the cold, outer planet of Uranus has been confirmed for the first time by University of Leicester astronomers. The discovery …", "url": "https://scitechdaily.com/?p=322736", "urlToImage": "https://scitechdaily.com/images/Uranus-Aurora.jpg", "publishedAt": "2023-10-29T14:31:04Z", "content": "ByUniversity of LeicesterOctober 29, 2023\r\nAn artistic representation of how the northern infrared aurora would have looked in 2006 (marked in red). The darker red locations indicate confirmed aurora… [+7707 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission and ISRO's stellar space odyssey: A glimpse into Venus and beyond - HT Tech", "description": "Shukrayaan1 mission andISROsstellar space odyssey A glimpse into Venus and beyond In 2022 India unveiled its ambitious plan to explore the scorching planet Venus. This groundbreaking mission was discussed in the Indian Parliament. P. Sreekumar from ISROs Spac…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan1-mission-and-isros-stellar-space-odyssey-a-glimpse-into-venus-and-beyond-71698578732538.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/29/1600x900/venus-5556107_1280_1698478789463_1698578805483.jpg/", "publishedAt": "2023-10-29T06:05:46Z", "content": "Photo Credit: Pixabay\r\n In 2022, India unveiled its ambitious plan to explore the scorching planet, Venus. This groundbreaking mission was discussed in the Indian Parliament.\r\nPhoto Credit: Pixabay\r\n… [+1609 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dominate the Game: Strategies to fast-track evo level in BGMI - HT Tech", "description": "Discover the secrets to leveling up your Evo Level in BGMI with these 3 effective strategies, from missions to EXP cards. Dominate the battlefield like a pro!", "url": "https://tech.hindustantimes.com/how-to/dominate-the-game-strategies-to-fast-track-evo-level-in-bgmi-71698542861531.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/29/1600x900/BGMI_Rising_1685629702207_1698543034620.png", "publishedAt": "2023-10-29T01:31:53Z", "content": "Battlegrounds Mobile India (BGMI) has taken India by storm and has become one of the most popular battle royale games. Its user-friendly controls, stunning graphics, and a range of gameplay modes hav… [+2230 chars]"}]}