{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Alex Druce", "title": "ASX rises 0.5% as banks, FMG join broad rally; IRESS leads tech gains - The Age", "description": "The ASX 200 was up 0.5 per cent at the open thanks to gains by healthcare, tech and property stocks. The miners and energy firms were lower.", "url": "https://www.smh.com.au/business/markets/soft-start-ahead-for-asx-el-salvador-adopts-bitcoin-20210610-p57zqh.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5949%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_118%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_live_no_age_social_wm/b049125726ee81bedde2d84506fbbb38751d57fd", "publishedAt": "2021-06-10T04:00:17Z", "content": "Supermarket giant Woolworths has been a prominent figure in the news this week - for both good and bad reasons - but it is rival Coles at the centre of a report from Credit Suisse this morning.\r\nAnal… [+2289 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "CHIME Telescope Detects More Than 500 Mysterious Fast Radio Bursts From Outer Space - SciTechDaily", "description": "Observations in its first year of operation quadruple the number of known radio bursts and reveal two types: one-offs and repeaters. To catch sight of a fast radio burst is to be extremely lucky in where and when you point your radio dish. Fast radio bursts, …", "url": "https://scitechdaily.com/chime-telescope-detects-more-than-500-mysterious-fast-radio-bursts-from-outer-space/", "urlToImage": "https://scitechdaily.com/images/CHIME.jpg", "publishedAt": "2021-06-10T02:40:09Z", "content": "The large radio telescope CHIME, pictured here, has detected more than 500 mysterious fast radio bursts in its first year of operation, MIT researchers report. Credit: CHIME Collaboration\r\nObservatio… [+6517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka: Ministers, expert committee hint at unlock in phases after June 14 - The Indian Express", "description": "The panel of experts in the Covid-19 Technical Advisory Committee appointed by the government has recommended allowing shops, hotels, and malls to operate for a few hours daily, to begin with.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-ministers-expert-committee-hint-at-unlock-in-phases-after-june-14-7351657/", "urlToImage": "https://images.indianexpress.com/2021/06/Karnataka-1.png", "publishedAt": "2021-06-10T02:02:39Z", "content": "With the lockdown in Karnataka scheduled to end on June 14 and with a dip in new infections reported over the past few days, the state is likely to begin its unlock process soon, sources said.\r\nThe p… [+2720 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Centre may renegotiate vaccine prices with SII and Bharat Biotech - The Indian Express", "description": "When the Centre began vaccination in January, it procured 11 million doses of Covishield at Rs 200 each excluding taxes, and about 5.5 million doses of Covaxin at Rs 206 each excluding taxes. However, the prices were later negotiated downwards to Rs 150 per d…", "url": "https://indianexpress.com/article/india/centre-may-renegotiate-covid-vaccine-prices-with-sii-and-bharat-biotech-7351673/", "urlToImage": "https://images.indianexpress.com/2021/06/VACCINATION-3.jpg", "publishedAt": "2021-06-10T01:36:54Z", "content": "AFTER CHANGING its vaccine procurement policy, the Centre is likely to engage in renegotiations on the prices of Bharat Biotechs Covaxin and Serum Institute of Indias Covishield, The Indian Express h… [+3086 chars]"}, {"source": {"id": null, "name": "Qnews.com.au"}, "author": "Facebook", "title": "Apple clarifies it's not banning gay apps Grindr and Scruff after outcry - QNews", "description": "Apple has clarified its new App Store guidelines restricting certain “hookup” apps won’t target gay apps like Grindr and Scruff after outrage and confusion online. This week, the tech giant unveiled its upcoming iOS 15 operating system at its keynote at the W…", "url": "https://qnews.com.au/apple-clarifies-its-not-banning-gay-apps-grindr-and-scruff-after-outrage/", "urlToImage": "https://qnews.com.au/wp-content/uploads/2021/06/21-06-10-apple-store-app-store-grindr.jpg", "publishedAt": "2021-06-10T01:07:45Z", "content": null}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Sinovac CEO complained about anti-China comments in Brazil: Report - CNA", "description": "The chief executive of Sinovac Biotech, the main supplier of COVID-19 vaccines to Brazil, complained last month to Brazilian diplomats in Beijing that anti-China comments in Brasilia were not helping with delayed shipments, two people with knowledge of the ma…", "url": "https://www.channelnewsasia.com/news/world/sinovac-ceo-complained-about-anti-china-comments-in-brazil-14983672", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14983670/16x9/991/557/5a1218179cf1776cdc808fcb18b896b7/NM/media-tour-at-chinese-vaccine-maker-sinovac-biotech-in-beijing-1.jpg", "publishedAt": "2021-06-09T23:07:19Z", "content": "BRASILIA: The chief executive of Sinovac Biotech, the main supplier of COVID-19 vaccines to Brazil, complained last month to Brazilian diplomats in Beijing that anti-China comments in Brasilia were n… [+2286 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Mascarenhas, Connie Loizos", "title": "Does what happens at YC stay at YC? - TechCrunch", "description": "Community has never felt louder in startupland. Bringing people together over a shared interest is innate to human nature, and coming out of a lonely, draining pandemic, every startup is looking to cultivate community, conversation and camaraderie. Last week,…", "url": "http://techcrunch.com/2021/06/09/does-what-happens-at-yc-stay-at-yc/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2015/08/y-combinator-questions.png?w=711", "publishedAt": "2021-06-09T22:52:46Z", "content": "Community has never felt louder in startupland. Bringing people together over a shared interest is innate to human nature, and coming out of a lonely, draining pandemic, every startup is looking to c… [+14767 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "CHERYL TAN", "title": "NTU team's reusable mask can filter 99.9% of bacteria, viruses - The Straits Times", "description": "Scientists from the Nanyang Technological University (NTU) have developed a reusable mask that is able to kill bacteria droplets within 45 seconds and filter 99.9 per cent of bacteria, viruses and haze particles - better than the medical-grade N95 masks used …", "url": "https://www.straitstimes.com/singapore/health/ntu-teams-reusable-mask-can-filter-999-of-bacteria-viruses", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/06/10/ST_20210610_CTNMASK_6605533.jpg?itok=WgsY5B-Z", "publishedAt": "2021-06-09T21:00:00Z", "content": "Scientists from the Nanyang Technological University (NTU) have developed a reusable mask that is able to kill bacteria droplets within 45 seconds and filter 99.9 per cent of bacteria, viruses and ha… [+3173 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Self-Sustaining, Intelligent, Electronic Microsystems Created – Operate Much Like Self-Autonomous Living Organisms - SciTechDaily", "description": "A research team from the University of Massachusetts Amherst has created an electronic microsystem that can intelligently respond to information inputs without any external energy input, much like a self-autonomous living organism. The microsystem is construc…", "url": "https://scitechdaily.com/self-sustaining-intelligent-electronic-microsystems-created-operate-much-like-self-autonomous-living-organisms/", "urlToImage": "https://scitechdaily.com/images/Green-Electronics.jpg", "publishedAt": "2021-06-09T20:25:47Z", "content": "This illustration captures the essence of the newly developed electronic microsystem. Credit: UMass Amherst\r\nA research team from the University of Massachusetts Amherst has created an electronic mic… [+3976 chars]"}, {"source": {"id": null, "name": "Asumetech.com"}, "author": null, "title": "Netflix: #GeekedWeek Day 3 Recap: What We Learnt from Netflix’s “Geeked Week” Today! - asumetech", "description": "We are now halfway through Netflix’s Geeked Week with a number of first looks, interviews and more to celebrate all things genre entertainment at Netflix. Every day from Monday 7th June to Friday 11th June there will be a special episode giving fans a wide ar…", "url": "https://asumetech.com/netflix-geekedweek-day-3-recap-what-we-learnt-from-netflixs-geeked-week-today/", "urlToImage": "https://news.newonnetflix.info/wp-content/uploads/2021/06/geeked-week-poster-crop.jpg", "publishedAt": "2021-06-09T17:52:31Z", "content": "We are now halfway through Netflixs Geeked Week with a number of first looks, interviews and more to celebrate all things genre entertainment at Netflix. Every day from Monday 7th June to Friday 11th… [+3666 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Alibaba Cloud plans to build data center in Manila this year - BusinessWorld Online", "description": "ALIBABA Group’s digital technology and intelligence backbone Alibaba Cloud is set to build its first data center in the Philippines by the end of 2021.", "url": "https://www.bworldonline.com/alibaba-cloud-plans-to-build-data-center-in-manila-this-year/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/06/Alibaba-Cloud-logo-web.jpg", "publishedAt": "2021-06-09T16:04:37Z", "content": "ALIBABA Groups digital technology and intelligence backbone Alibaba Cloud is set to build its first data center in the Philippines by the end of 2021.\r\nWith our first data center in the country, we w… [+1942 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Daryl Baxter", "title": "Why iPadOS 15 means I'm switching to an M2 MacBook - Techradar", "description": "Opinion: Back to the Mac", "url": "https://www.techradar.com/news/why-ipados-15-means-im-switching-to-a-macbook", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bNQbpaS6yN3DSEnjYNyyGY-1200-80.png", "publishedAt": "2021-06-09T14:15:10Z", "content": "Ive been a staunch follower of Apples iPad ever since it was announced back in January of 2010. However, while Ive been using the many iterations of the iPad Pro as my main work machine since 2016, i… [+6176 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Tim Newcomb", "title": "GPS Watch Sales Rising, Companies Exploring New Technology, Styles - Forbes", "description": "When the Suunto 9 Peak GPS multi-sport watch releases this month, it will do so 37% thinner and 36% lighter than the previous version.", "url": "https://www.forbes.com/sites/timnewcomb/2021/06/09/gps-watch-sales-rising-companies-exploring-new-technology-styles/", "urlToImage": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F60bf7b1a1b218bdae941e2eb%2F0x0.jpg", "publishedAt": "2021-06-09T14:00:00Z", "content": "The Garmin Descent Mk2S goes from the sea to land in a multi-sport GPS watch, part of a new wave of ... [+] watches meeting consumer demands. \r\nGarmin\r\nWhen the Suunto 9 Peak GPS multi-sport watch re… [+7650 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Henry Kwan", "title": "realme CEO teases the brand's first laptop - TechNave", "description": "As rumoured,&nbsp;realme&nbsp;is planning to expand its product categories by launching its&nbsp;first laptop. Last month, the brand has released a&nbsp;survey&", "url": "https://technave.com/gadget/realme-CEO-teases-the-brand-s-first-laptop-25183.html", "urlToImage": "https://technave.com/data/files/mall/article/202106091158442079.jpg", "publishedAt": "2021-06-09T11:56:37Z", "content": "As rumoured, realme is planning to expand its product categories by launching its first laptop. Last month, the brand has released a survey by wanting to know if the customers are interested in buyin… [+1544 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Bharat Biotech to make Covaxin's Phase-3 results data public in July - Moneycontrol", "description": "The company added that once the data from final analysis of Phase III studies are available, Bharat Biotech will apply for full licensure for Covaxin", "url": "https://www.moneycontrol.com/news/business/companies/bharat-biotech-to-make-covaxins-phase-3-results-data-public-in-july-7010231.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Covaxin-770x433.jpg", "publishedAt": "2021-06-09T11:30:34Z", "content": "Bharat Biotech said it will make Covaxin Phase-3 results data public in July.\r\nThe company added that once the data from final analysis of Phase III studies are available, Bharat Biotech will apply f… [+1304 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "COVID: Are mix-and-match vaccines the way forward? - Deutsche Welle", "description": "A new German study reports that a combination of the AstraZeneca and BioNTech vaccines triggers a remarkably stronger immune response than sticking with one kind of shot.", "url": "https://www.dw.com/en/mix-and-match-vaccines-biontech-astrazeneca-better-than-one-shot/a-57819127", "urlToImage": "https://static.dw.com/image/57826635_6.jpg", "publishedAt": "2021-06-09T09:37:12Z", "content": "Following its approval from the European Medicines Agency in January, the AstraZeneca vaccine against COVID-19 was administered to all adults in Germany. After discovering that especially younger wom… [+11143 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Claudeth Mocon-Ciriaco", "title": "FDA okays Pfizer's EUA for persons above 12 years old; 4777 new cases logged | Claudeth Mocon-Ciriaco - Business Mirror", "description": "Citing justifiable grounds,  the Food and Drug Administration (FDA) has granted the request for revision of the issued emergency use authorization (EUA) to Pfizer-BioNTech Covid-19 Vaccine to include individuals 12 years of age and older in its indication for…", "url": "https://businessmirror.com.ph/2021/06/09/fda-okays-pfizers-eua-for-persons-above-12-years-old-4777-new-cases-logged/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/05/y2z01a-052321.jpg", "publishedAt": "2021-06-08T16:20:00Z", "content": "Citing justifiable grounds,  the Food and Drug Administration (FDA) has granted the request for revision of the issued emergency use authorization (EUA) to Pfizer-BioNTech Covid-19 Vaccine to include… [+2781 chars]"}]}