{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Hubble Space Telescope shares 5 astonishing images of space - HT Tech", "description": "NASA Hubble Space Telescope shares 5 astonishing images of space Check out these astonishing space images captured by the NASA Hubble Space Telescope. The Hubble Space Telescope is placed about 515 kilometres above the Earths surface which gives the power to …", "url": "https://tech.hindustantimes.com/web-stories/nasa-hubble-space-telescope-shares-5-astonishing-images-of-space-71718850888744.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/20/1600x900/hubble-ugc9684-potw2419a_1718851466621_1718851469089.webp/", "publishedAt": "2024-06-20T02:44:40Z", "content": "Photo Credit: Pixabay Check out these astonishing space images captured by the NASA Hubble Space Telescope. \r\nPhoto Credit: Pixabay The Hubble Space Telescope is placed about 515 kilometres above the… [+1136 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ingrid Lunden", "title": "France leads the pack for Generative AI funding in Europe, London has 3X the number of GenAI startups - TechCrunch", "description": "Like it or hate it, artificial intelligence – especially generative AI – is the technology story of 2024. OpenAI, with its rollouts of viral services like", "url": "https://techcrunch.com/2024/06/19/france-leads-the-pack-for-generative-ai-funding-in-europe-london-has-3x-the-number-of-genai-startups/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-2080972792.jpg?resize=1200,800", "publishedAt": "2024-06-19T23:43:17Z", "content": "Like it or hate it, artificial intelligence especially generative AI is the technology story of 2024. \r\nOpenAI, with its rollouts of viral services like ChatGPT and billions in funding, may have gobb… [+5015 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 13 price drops by 19% on Amazon: Check out deals and exchange offers - HT Tech", "description": "iPhone 13 price drops by 19 on Amazon Check out deals and exchange offers Amazon is offering a great deal on iPhone 13 check out and grab the offer before the product goes out of stock. Planning to switch from Android to iOS but unsure of which device would b…", "url": "https://tech.hindustantimes.com/web-stories/iphone-13-price-drops-by-19-on-amazon-check-out-deals-and-exchange-offers-71718850279444.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/20/1600x900/iphone-13_1702893688780_1718850790164.jfif/", "publishedAt": "2024-06-19T21:03:23Z", "content": "Photo Credit: Apple Amazon is offering a great deal on iPhone 13, check out and grab the offer before the product goes out of stock.\r\nPhoto Credit: Apple Planning to switch from Android to iOS but un… [+1140 chars]"}]}