{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MICHAEL LIEDTKE", "title": "Salesforce CEO shares his predictions for AI and the future of work - The Associated Press", "description": "Salesforce founder Marc Benioff is among the few tech pioneers who is also still CEO at a groundbreaking company born in the 1990s. And the 58-year-old Benioff isn't ready to leave Salesforce yet, even though he has become a billionaire running a company that…", "url": "https://apnews.com/article/salesforce-marc-benioff-artificial-intelligence-layoffs-pandemic-2c5c5f7f6daf50ddcae675b422aa745f", "urlToImage": "https://dims.apnews.com/dims4/default/8638b13/2147483647/strip/true/crop/11250x6328+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F35%2F1374eb38ece372b6fe7bc9bdf197%2F09158d8d79864fd286e71babde93b4be", "publishedAt": "2023-07-24T13:03:00Z", "content": "SAN FRANCISCO (AP) Salesforce founder and CEO Marc Benioff has become something of a vanishing breed during the nearly quarter century he has been running the company that pioneered the concept of se… [+4212 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "What Factors Influence Arsenic Mobilization and Release? - AZoCleantech", "description": "A study was conducted by investigators from the Chinese Research Academy of Environmental Sciences to evaluate the effects of environmental factors and microbial communities on arsenic (As) mobilization.", "url": "https://www.azocleantech.com/news.aspx?newsID=33751", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/SocialSharingImage_33751_16902034934177357.png", "publishedAt": "2023-07-24T13:00:00Z", "content": "A study was conducted by investigators from the Chinese Research Academy of Environmental Sciences to evaluate the effects of environmental factors and microbial communities on arsenic (As) mobilizat… [+3215 chars]"}, {"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "Novel features spotted on radiation emitted from black hole due to atoms falling into it could help understand unification of quantum theory with gravity - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/novel-features-spotted-radiation-emitted-black-hole-due-atoms-falling-it-could-help-understand", "urlToImage": null, "publishedAt": "2023-07-24T11:57:15Z", "content": "Scientists have explored novel quantum effects on the radiation emitted from a black hole due to atoms freely falling into it. This investigation of atoms falling into a black hole could throw new li… [+3815 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Hubble sees what is happening to the asteroid Dimorphos in the aftermath of NASA's DART experiment - Tech Explorist", "description": "Hubble sees boulders escaping from asteroid Dimorphos.", "url": "https://www.techexplorist.com/hubble-sees-happening-asteroid-dimorphos-aftermath-nasa-dart-experiment/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/asteroid-Dimorphos.jpg", "publishedAt": "2023-07-24T10:19:07Z", "content": "NASA’s DART (Double Asteroid Redirection Test) intentionally impacted Dimorphos on September 26, 2022, slightly changing the trajectory of its orbit around the larger asteroid Didymos. The spacecraft… [+4002 chars]"}, {"source": {"id": null, "name": "Techlusive.in"}, "author": "Shweta Ganjoo", "title": "Krafton announces July update for New State Mobile: Here's what's new - Techlusive", "description": "Krafton has announced July updates for New State Mobile. This monthâ\u0080\u0099s update includes Weekly League and new customisation for UMP45 sub-machinegun.", "url": "https://www.techlusive.in/news/krafton-announces-july-update-for-new-state-mobile-heres-whats-new-1392747/", "urlToImage": "https://st1.techlusive.in/wp-content/uploads/2023/07/Krafton.jpg", "publishedAt": "2023-07-24T08:44:15Z", "content": "Krafton has announced July update for its popular battle royale game New State Mobile. The July update brings a host of new features to the game, which includes the introduction of Weekly League, new… [+2957 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unmasking Ancient Aromas: Scientists Identify Composition of 2000-Year-Old Roman Perfume - SciTechDaily", "description": "A small vessel of ointment discovered in a funerary urn from the ancient Roman city of Carmo, present-day Carmona in Seville province, has allowed a research team from the University of Cordoba to chemically unravel the composition of a perfume that dates bac…", "url": "https://scitechdaily.com/unmasking-ancient-aromas-scientists-identify-composition-of-2000-year-old-roman-perfume/", "urlToImage": "https://scitechdaily.com/images/Location-of-Ancient-Roman-Ointment.jpg", "publishedAt": "2023-07-23T05:21:38Z", "content": "Researchers from the University of Cordoba have, for the first time, identified the components of a 2,000-year-old Roman perfume discovered in a sealed vessel in Carmona, Spain. Chemical analysis rev… [+4426 chars]"}]}