{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "OpenAI’s $100M startup fund will make ‘big early bets’ with Microsoft as partner - TechCrunch", "description": "OpenAI is launching a $100 million startup fund, which it calls the OpenAI Startup Fund, though which it and its partners will invest in early-stage AI companies tackling major problems (and productivity). Among those partners and investors in the fund is Mic…", "url": "http://techcrunch.com/2021/05/26/openais-100m-startup-fund-will-make-big-early-bets-with-microsoft-as-partner/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/lp-logo-3.jpg?w=591", "publishedAt": "2021-05-26T17:22:31Z", "content": "OpenAI is launching a $100 million startup fund, which it calls the OpenAI Startup Fund, though which it and its partners will invest in early-stage AI companies tackling major problems (and producti… [+2114 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "A new 'gold standard' compound for generating electricity from heat: Engine made with single material outpowers conventional technology - Science Daily", "description": "Researchers show in a new study that a single material, a layered crystal consisting of the elements rhenium and silicon, turns out to be the gold standard of transverse thermoelectric devices.", "url": "https://www.sciencedaily.com/releases/2021/05/210526115414.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-05-26T16:17:11Z", "content": "Thermoelectric power generators that make electrical power from waste heat would be a useful tool to reduce greenhouse gas emissions if it weren't for a most vexing problem: the need to make electric… [+4901 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Infosys' Former Top Executive Slams WhatsApp, Others Of \"Double Standards\" On Privacy - NDTV", "description": "The Indian government and the country's laws should define and protect the privacy of citizens, information technology industry veteran TV Mohandas Pai said on Wednesday as he accused large social media platforms like WhatsApp of \"double standards\".", "url": "https://www.ndtv.com/india-news/infosys-former-top-executive-mohandas-pai-slams-whatsapp-others-of-double-standards-on-privacy-2449846", "urlToImage": "https://c.ndtvimg.com/2021-01/o99fmm5s_whatsapp-generic-afp_625x300_19_January_21.jpg", "publishedAt": "2021-05-26T15:27:47Z", "content": "Infosys' former top official Mohandas Pai slammed platforms like WhatsApp of \"double standards\".\r\nBengaluru: The Indian government and the country's laws should define and protect the privacy of citi… [+2397 chars]"}, {"source": {"id": null, "name": "Techfinancials.co.za"}, "author": null, "title": "Spotify Premium Launches New Offers For Its Free and First-Time Users - TechFinancials", "description": "As South Africans ease into Winter, more people will seek comfort of indoor entertainment. To carry fans through the chilly season, Spotify", "url": "https://www.techfinancials.co.za/2021/05/26/spotify-premium-launches-new-offers-for-its-free-and-first-time-users/", "urlToImage": "https://n9v2j5d8.rocketcdn.me/wp-content/uploads/2019/07/shutterstock_679388728.jpg", "publishedAt": "2021-05-26T14:49:45Z", "content": "As South Africans ease into Winter, more and more people will seek the comfort of indoor entertainment. To carry fans through the chilly season, Spotify is launching new offers for its free and first… [+1737 chars]"}, {"source": {"id": null, "name": "Techradar247.com"}, "author": "Iva", "title": "SEAL Team Season 4 Episode 16: Finale Episode-One Life To Live! Will Bravo Team Choose The Right Path? - TechRadar247", "description": "There’s only one episode left to wrap SEAL Team Season 4, which soon will set the stage for its fifth season. Through time, the Bravo Team faced several challenging situations but in the epic finale- SEAL Team Season 4 Episode 16, the course man will delve in…", "url": "https://www.techradar247.com/2021/05/26/seal-team-season-4-episode-16-finale-episode-one-life-to-live-will-bravo-team-choose-the-right-path/", "urlToImage": "https://www.techradar247.com/wp-content/uploads/2021/05/seal-team-s4-ep-16-1000x600.jpg", "publishedAt": "2021-05-26T14:26:32Z", "content": "There’s only one episode left to wrap SEAL Team Season 4, which soon will set the stage for its fifth season. Through time, the Bravo Team faced several challenging situations but in the epic finale-… [+2981 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mayank Sharma", "title": "Microsoft Project Reunion update hopes to make developing Windows 10 apps a breeze - TechRadar", "description": "Project Reunion aims to standardize Windows app development", "url": "https://www.techradar.com/news/microsoft-project-reunion-update-hopes-to-make-developing-windows-10-apps-a-breeze", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vZLMcEg5JqfGeXydVkkxhk-1200-80.jpg", "publishedAt": "2021-05-26T10:36:50Z", "content": "Microsofts Project Reunion\r\n initiative to simplify the life of Windows 10\r\n app developers has taken another step towards its first stable release.\r\nFirst announced at the Build 2020 conference by M… [+1354 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Indications are that South Africa’s third wave has started, nationally; push back against planned gun law changes in South Africa; ANC considering further action against Magashule; and delinquent director Dudu Myeni faces criminal complaint over state capture…", "url": "https://businesstech.co.za/news/government/493467/5-important-things-happening-in-south-africa-today-1046/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/09/Dudu-Myeni.png", "publishedAt": "2021-05-26T06:24:04Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: Global Covid-19 infections have hit 168.53 million confirmed, with the death toll reaching 3.5 million. In South Africa, th… [+3470 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "金丹", "title": "Huawei's new mobile OS coming on June 2 - Chinadaily.com.cn - Chinadaily USA", "description": "Chinese technology giant Huawei Technologies Co said on Tuesday that it will launch its self-developed HarmonyOS operating system for smartphones on June 2 as part of its ongoing efforts to cultivate its software prowess after overseas restrictions affected i…", "url": "http://global.chinadaily.com.cn/a/202105/26/WS60ad8f74a31024ad0bac166a.html", "urlToImage": "//img2.chinadaily.com.cn/images/202105/26/60ad9f31a31024adbdca259e.jpeg", "publishedAt": "2021-05-26T00:28:07Z", "content": "A visitor tries Huawei's HarmonyOS operating system on a car dashboard during an auto expo in Shanghai. [Photo by Zhang Hengwei/China News Service] \r\nChinese technology giant Huawei Technologies Co s… [+2587 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "itel P Series Keeps Getting Better: Launches P37, P37 Pro - Channels Television", "description": "As one of itel’s most successful brands, the P series has evolved over the years with new updates and improvements, earning the title, the Max Power series. With the launch of the itel P37 smartphone on May 21, 2021 via a virtual event, the global tech compan…", "url": "https://www.channelstv.com/2021/05/25/itel-p-series-keeps-getting-better-launches-p37-p37-pro/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/05/Untitled-1-Recovered-Recovered-Recovered-Recovered-2.png", "publishedAt": "2021-05-25T19:09:58Z", "content": "As one of itel’s most successful brands, the P series has evolved over the years with new updates and improvements, earning the title, the Max Power series.\r\nWith the launch of the itel P37 smartphon… [+2864 chars]"}, {"source": {"id": null, "name": "WebMD"}, "author": "Ralph  Ellis", "title": "Pfizer and AstraZeneca Vaccines Effective Against Indian Variant, Study Says - WebMD", "description": "A study has found that two doses of the Pfizer/BioNTech or the Astra/Zeneca vaccine protect against the COVID-19 variant first detected in India and the one first found in the United Kingdom.", "url": "https://www.webmd.com/vaccines/covid-19-vaccine/news/20210525/pfizer-astrazeneca-vaccines-indian-variant-study", "urlToImage": "https://img.webmd.com/dtmcms/live/webmd/consumer_assets/site_images/article_thumbnails/other/vaccine_covid19_other/1800x1200_vaccine_2_other.jpg", "publishedAt": "2021-05-25T14:01:32Z", "content": "May 25, 2021 -- A study found that two doses of the Pfizer/BioNTech or the Astra/Zeneca vaccine protect against the COVID-19 variant first detected in India -- as well as the variant first found in t… [+1788 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Wild swings based on Elon Musk tweets takes away crypto legitimacy – analyst - BusinessTech", "description": "Bitcoin held gains Tuesday after Elon Musk’s effort to bolster the token’s green credentials stoked a rally, extending a bout of marked volatility in the wake of last week’s crypto rout.", "url": "https://businesstech.co.za/news/banking/493325/wild-swings-based-on-elon-musk-tweets-takes-away-crypto-legitimacy-analyst/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/02/Musk-e1551266148856.jpg", "publishedAt": "2021-05-25T09:56:02Z", "content": "Bitcoin held gains Tuesday after Elon Musks effort to bolster the tokens green credentials stoked a rally, extending a bout of marked volatility in the wake of last weeks crypto rout.\r\nThe largest di… [+3449 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "Samsung A12 Vs Infinix HOT 10T: Which Is A Better Buy? - TechCabal", "description": "Infinix and Samsung are two major players in the African smartphone market. Both brands have managed to maintain their edge over other competitive brands through the consistent production of exceptional smartphones that meet the varying needs of gadget lovers…", "url": "https://techcabal.com/2021/05/25/samsung-a12-vs-infinix-hot-10t-which-is-a-better-buy/", "urlToImage": "https://cdn.shortpixel.ai/client/to_avif,q_glossy,ret_img,w_1208,h_774/https://techuncode.com/wp-content/uploads/2021/05/FotoJet-1.jpg", "publishedAt": "2021-05-25T09:01:45Z", "content": "Infinix and Samsung are two major players in the African smartphone market. Both brands have managed to maintain their edge over other competitive brands through the consistent production of exceptio… [+5635 chars]"}, {"source": {"id": null, "name": "Theborneopost.com"}, "author": "BP Editor 7", "title": "Sibu and Bintulu to get additional allocations of Pfizer, Sinovac Covid-19 vaccines — Khairy - The Borneo Post", "description": "KUCHING (May 25): Sibu and Bintulu divisions will be allocated more Pfizer-BioNTech and Sinovac Covid-19 vaccines, said National Covid-19 Immunisation Programme Coordinating Minister Khairy Jamaluddin.\r\n\r\nHe said the current AstraZeneca opt-in programme will …", "url": "https://www.theborneopost.com/2021/05/25/sibu-and-bintulu-to-get-additional-allocations-of-pfizer-sinovac-covid-19-vaccines-khairy/", "urlToImage": "https://www.theborneopost.com/newsimages/2021/05/Covid-vaccination.jpeg", "publishedAt": "2021-05-25T07:08:35Z", "content": "Bernama file photo shows a woman receiving the Covid-19 vaccine at a vaccination centre, \r\nKUCHING (May 25): Sibu and Bintulu divisions will be allocated more Pfizer-BioNTech and Sinovac Covid-19 vac… [+1617 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Cormac McQuinn", "title": "‘Steady progress’ in restoring HSE systems expected in coming days - The Irish Times", "description": "May take weeks for full system restoration, but technicians happy with decryption key", "url": "https://www.irishtimes.com/news/politics/hse-cyber-attack-some-services-likely-to-resume-in-48-hours-1.4574071", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4574069&origw=1440", "publishedAt": "2021-05-25T00:00:08Z", "content": "There is expected to be steady progress in restoring Health Service Executive (HSE) systems and services in the coming days following the devastating cyber attack earlier this month. \r\nWhile it may s… [+3798 chars]"}]}