{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Apple Scary Fast Event 2023 Launch Live Updates: MacBook Pro, iMac with new M3 chips announced | Mint - Mint", "description": "Apple Scary Fast Event 2023 Launch Live Updates: Apple is all geared up for the ‘Scary Fast’ event this Halloween. While exact details are undisclosed, the tech giant is expected to bring updated MacBook Pro and iMac models with the new M3 3-nanometer process…", "url": "https://www.livemint.com/technology/tech-news/apple-scary-fast-event-2023-launch-live-updates-updated-macbook-pro-imac-and-everything-expected-11698680993930.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/31/1600x900/fhiahfa_1698711752782_1698711762534.png", "publishedAt": "2023-10-31T00:40:05Z", "content": "Apple Scary Fast Event 2023 Launch Live Updates: Apple has made some important launches at its Scary Fast event today. As anticipated, the event did not feature any news about the iPads but focused e… [+7654 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kyle Orland", "title": "Microsoft issues system-level ban for “unauthorized” Xbox accessories - Ars Technica", "description": "Crackdown limits some cheat devices but also hurts fighting and accessibility hardware.", "url": "https://arstechnica.com/gaming/2023/10/microsoft-issues-system-level-ban-for-unauthorized-xbox-accessories/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/xboxcontrol-760x380.png", "publishedAt": "2023-10-30T17:13:14Z", "content": "Enlarge/ Official controllers like this will have no problem working with the Xbox going forward.\r\n72 with \r\nMicrosoft has begun warning Xbox users that \"unauthorized\" accessories will no longer work… [+5407 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Wireless device makes magnetism appear in non-magnetic materials - Science Daily", "description": "Researchers have succeeded in bringing wireless technology to the fundamental level of magnetic devices. The emergence and control of magnetic properties in cobalt nitride layers (initially non-magnetic) by voltage, without connecting the sample to electrical…", "url": "https://www.sciencedaily.com/releases/2023/10/231030110652.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-10-30T15:56:23Z", "content": "Researchers at the Universitat Autònoma de Barcelona (UAB) and ICMAB have succeeded in bringing wireless technology to the fundamental level of magnetic devices. The emergence and control of magnetic… [+3623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What are the aims and objectives of ISRO's Venus endeavor? - HT Tech", "description": "Shukrayaan1 mission What are the aims and objectives of ISROs Venus endeavor Just a month after Indias historic space achievement in the form of Chandrayaan3 mission ISRO is ready for its next projectShukrayaan1 mission. Aims and ObjectivesShukrayaan1 mission…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan-1-mission-what-are-the-aims-and-objectives-of-isros-venus-endeavor-71698658529678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/Venus_1696761851332_1698658717116.png/", "publishedAt": "2023-10-30T04:17:50Z", "content": "Photo Credit: Pixabay\r\n Just a month after India's historic space achievement in the form of Chandrayaan-3 mission, ISRO is ready for its next project: Shukrayaan-1 mission.\r\nPhoto Credit: NASA\r\n Aim… [+1111 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-3 mission: What is ejecta halo that Vikram Lander created on the Moon - HT Tech", "description": "Chandrayaan3 mission What is ejecta halo that Vikram Lander created on the Moon ISRO revealed an awesome event of the Chandrayaan3 mission. Know how the Vikram lander created ejecta halo. Know what the term means. ISRO recently made an announcement that Vikra…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan3-mission-what-is-ejecta-halo-that-vikram-lander-created-on-the-moon-71698637052307.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/CVK_8_1698637568885_1698637575809.png/", "publishedAt": "2023-10-29T22:16:59Z", "content": "Photo Credit: ISRO\r\n  ISRO revealed an awesome event of the Chandrayaan-3 mission. Know how the Vikram lander created ejecta halo. Know what the term means.\r\nPhoto Credit: ISRO\r\n ISRO recently made a… [+1518 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering Uranus' Glow: New Hints for Life on Icy Exoplanets - SciTechDaily", "description": "University of Leicester astronomers confirm the existence of an infrared (IR) aurora on Uranus. The presence of an infrared aurora on the cold, outer planet of Uranus has been confirmed for the first time by University of Leicester astronomers. The discovery …", "url": "https://scitechdaily.com/?p=322736", "urlToImage": "https://scitechdaily.com/images/Uranus-Aurora.jpg", "publishedAt": "2023-10-29T14:31:04Z", "content": "ByUniversity of LeicesterOctober 29, 2023\r\nAn artistic representation of how the northern infrared aurora would have looked in 2006 (marked in red). The darker red locations indicate confirmed aurora… [+7707 chars]"}, {"source": {"id": null, "name": "Knowablemagazine.org"}, "author": "Viviane Callier, Knowable Magazine", "title": "Where the heck did all those structures inside complex cells come from? - Ars Technica", "description": "There are competing theories about the origin of the nucleus and endoplasmic reticulum.", "url": "https://knowablemagazine.org/article/living-world/2023/how-endomembrane-system-of-eukaryotic-cells-evolved", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1407267429-760x380.jpg", "publishedAt": "2023-10-29T11:07:53Z", "content": "Enlarge/ Computer illustration of mitochondria, membrane-enclosed cellular organelles that produce energy.\r\n8 with \r\nMore than 1.5 billion years ago, a momentous thing happened: Two small, primitive … [+5404 chars]"}]}