{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "NASA Sets Live Launch Coverage for CAPSTONE Mission to Moon - India Education Diary", "description": "NASA will air live launch coverage of the agency’s Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE), the first spacecraft to fly a specific unique lunar orbit ahead of future missions with crew. C", "url": "https://indiaeducationdiary.in/nasa-sets-live-launch-coverage-for-capstone-mission-to-moon/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2020/08/Default-Image-IED.png", "publishedAt": "2022-06-27T12:00:52Z", "content": "NASA will air live launch coverage of the agencys Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE), the first spacecraft to fly a specific unique luna… [+3127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day- Psyche | UPSC Current Affairs News - The Indian Express", "description": "What is 'Psyche'? Questions around key terms of science and technology are very common in UPSC-CSE especially when they are in news. Solve the MCQ given below after reading this article.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essential-one-word-a-day-psyche-7994242/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-37-1.jpg", "publishedAt": "2022-06-27T12:00:44Z", "content": "Take a look at the essential concepts, terms, and phenomena from the static and current parts of the UPSC-CSE. Also, check the answers to previous MCQs.Word: Psyche\r\nSubject: Science (space)\r\nWhy in … [+1540 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14 set to be pricey, just grab iPhone 13 for free! Check out this crazy deal on T Mobile - HT Tech", "description": "iPhone 14 will definitely be quite pricey. So, why pay more when you can get iPhone 13 for free through this crazy T Mobile deal. However, there is a catch. Here's what you have to do.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-set-to-be-pricey-just-grab-iphone-13-for-free-check-out-this-crazy-deal-on-t-mobile-71656328848589.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/27/1600x900/fjhk_1650079256778_1656329126893.PNG", "publishedAt": "2022-06-27T11:29:12Z", "content": "iPhone 13 price cut: Waiting for iPhone 14? Well, this crazy deal on T Mobile may make you change your mind. The deal will in fact let you buy the iPhone 13 for FREE. Yes, wireless service provider, … [+1796 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alisha Rahaman Sarkar", "title": "Nasa makes history with first commercial rocket launch containing ‘mini Hubble’ tech from Australia spaceport - The Independent", "description": "Rocket carries quantum calorimeter that will be used to observe Alpha Centauri A and B", "url": "https://www.independent.co.uk/news/world/australasia/nasa-rocket-launch-australia-commercial-spaceport-b2110071.html", "urlToImage": "https://static.independent.co.uk/2022/06/27/10/AFP_32DA9N8.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-06-27T11:29:04Z", "content": "In a historic move, Nasa has successfully launched a rocket from Australias remote Northern Territory, making it the agencys first commercial launch outside the US.\r\nAfter a delay due to rain and win… [+1995 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "How I Work: Aisha Salaudeen, Multi-platform producer at CNN - Techpoint Africa", "description": "If you have recently watched an African-themed programme on CNN, chances are you have come across Aisha Salaudeen’s work. With a background in finance, Aisha made a bold transition into journalism and has quickly progressed in her career. Here’s how she works", "url": "https://techpoint.africa/2022/06/27/aisha-salaudeen-cnn", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/06/1200-x-800-may-27-.jpg", "publishedAt": "2022-06-27T11:00:00Z", "content": "If you have recently watched an African-themed programme on CNN or read an article on the website, chances are you have come across Aisha Salaudeens work. With a background in finance, Aisha made a b… [+8698 chars]"}, {"source": {"id": null, "name": "Sky Sports"}, "author": null, "title": "Petr Cech will leave his role as Technical and Performance Advisor at Chelsea - Sky Sports", "description": "Petr Cech will leave his role as Technical and Performance Advisor at Chelsea on June 30.", "url": "https://www.skysports.com/football/news/11095/12641030/petr-cech-will-leave-his-role-as-technical-and-performance-advisor-at-chelsea", "urlToImage": "https://e0.365dm.com/22/03/1600x900/skysports-petr-cech-chelsea_5704966.jpg?20220313141131", "publishedAt": "2022-06-27T10:23:39Z", "content": "Petr Cech will leave his role as Technical and Performance Advisor at Chelsea on June 30. \r\nCech is the latest to leave the club following the Todd Boehly-Clearlake takeover after the departures of c… [+4082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Punjab Board 12th Result 2022 Live Updates: Result declaration postponed due to ‘technical issue’ - The Indian Express", "description": "PSEB Punjab Board 12th Result 2022 declared at www.pseb.ac.in, indiaresults.com, Punjab School Education Board Mohali Class 12th Result 2022: The result will be available at the website- pseb.ac.in. The students have to secure at least 20 per cent marks in pr…", "url": "https://indianexpress.com/article/education/pseb-punjab-board-12th-result-2022-live-updates-result-declared-toppers-districts-pseb-ac-in-indiaresults-in-7989211/", "urlToImage": "https://images.indianexpress.com/2022/06/6-211.jpg", "publishedAt": "2022-06-27T09:32:34Z", "content": "PSEB 12th Result 2022, Term 2 Result Live at pseb.ac.in: The Punjab School Education Board (PSEB) was to declare the result for class 12 today via press conference at 3 pm. However, due to some techn… [+955 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Davies", "title": "Anti-ageing: Why living until you're 200 really isn't a pipe dream - Daily Mail", "description": "The idea of living for hundreds of years was once thought to be the pipe dream of billionaires and tech moguls. But scientists at the forefront of anti-ageing say it is a possibility.", "url": "https://www.dailymail.co.uk/health/article-10946839/Anti-ageing-living-youre-200-really-isnt-pipe-dream.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/24/19/59488383-0-image-a-25_1656095175298.jpg", "publishedAt": "2022-06-27T09:04:56Z", "content": "The idea of living for hundreds of years was once thought to be the pipe dream of billionaires and tech moguls. \r\nBut scientists at the forefront of anti-ageing research believe they are on the cusp … [+13808 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s CAPSTONE Launch to Moon Delayed – Spacecraft Will Be First To Fly Unique Lunar Orbit - SciTechDaily", "description": "NASA, Rocket Lab, and Advanced Space are standing down from the June 27 launch attempt for the CAPSTONE mission to the Moon to allow Rocket Lab to perform final systems checks. The mission was slated to launch on Monday, June 27, aboard a Rocket Lab Electron …", "url": "https://scitechdaily.com/nasas-capstone-launch-to-moon-delayed-spacecraft-will-be-first-to-fly-unique-lunar-orbit/", "urlToImage": "https://scitechdaily.com/images/Rocket-Labs-Electron-Rocket.jpg", "publishedAt": "2022-06-27T08:41:02Z", "content": "ByNASAJune 27, 2022\r\nRocket Labs Electron rocket sits on the pad at the companys Launch Complex 1 in New Zealand for wet dress rehearsal ahead of the CAPSTONE launch. Credit: Rocket Lab\r\nNASA\r\nEstabl… [+3130 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Positive Patients at Far Higher Risk of Developing Serious Neurodegenerative Disorders - SciTechDaily", "description": "COVID-19 positive outpatients are at a far increased risk of neurodegenerative disorders compared with individuals who tested negative for the virus, a new study presented today at the 8th European Academy of Neurology (EAN) Congress has shown. The research s…", "url": "https://scitechdaily.com/covid-19-positive-patients-at-far-higher-risk-of-developing-serious-neurodegenerative-disorders/", "urlToImage": "https://scitechdaily.com/images/Brain-Glitch-Stress-Disorder-Concept.jpg", "publishedAt": "2022-06-27T00:00:39Z", "content": "ByEuropean Academy of Neurology (EAN)June 26, 2022\r\nResearchers found that people who tested positive for COVID-19 had a 4.8 times increased risk of intracerebral hemorrhage (bleeding in the brain), … [+4245 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Windows 98 to Mars 2022: Major Upgrade for 19-Year-Old Martian Water-Spotter - SciTechDaily", "description": "The MARSIS instrument on the European Space Agency’s Mars Express spacecraft, famous for its role in the discovery of signs of liquid water on the Red Planet, is receiving a major software upgrade that will allow it to see beneath the surfaces of Mars and its…", "url": "https://scitechdaily.com/from-windows-98-to-mars-2022-major-upgrade-for-19-year-old-martian-water-spotter/", "urlToImage": "https://scitechdaily.com/images/Mars-Express-Spacecraft-scaled.jpg", "publishedAt": "2022-06-26T10:26:00Z", "content": "ByEuropean Space Agency (ESA)June 26, 2022\r\nArtists impression of Mars Express. The background is based on an actual image of Mars taken by the spacecrafts high resolution stereo camera. Credit: Spac… [+5732 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa is seeing a big increase in international travel – here are the visa changes you should know - BusinessTech", "description": "The opening of international borders, relaxation of travel restrictions, resumption of international flights, widespread vaccination and reopening of in-campus classes by overseas universities are the major contributors to the increase in outbound traffic fro…", "url": "https://businesstech.co.za/news/lifestyle/598796/south-africa-is-seeing-a-big-increase-in-international-travel-heres-are-the-visa-changes-you-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/Passport.jpg", "publishedAt": "2022-06-26T05:00:58Z", "content": "The opening of international borders, relaxation of travel restrictions, resumption of international flights, widespread vaccination and reopening of in-campus classes by overseas universities are th… [+4886 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Star Survives a Thermonuclear Supernova Explosion - SciTechDaily", "description": "A Tenacious Star Validates a Revised Model of Supernovae A supernova is the cataclysmic explosion of a star. Thermonuclear supernovae, in particular, signal the complete destruction of a white dwarf star, leaving nothing behind. At least that’s what astrophys…", "url": "https://scitechdaily.com/mysterious-star-survives-a-thermonuclear-supernova-explosion/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-NGC-1309.jpg", "publishedAt": "2022-06-26T04:47:48Z", "content": "ByUniversity of California, Santa BarbaraJune 25, 2022\r\nThe Hubble Space Telescope captured this dramatic spiral galaxy, cataloged as NGC 1309. Credit: NASA, ESA, The Hubble Heritage Team, (STScI/AUR… [+5790 chars]"}, {"source": {"id": null, "name": "Indiannewslink.co.nz"}, "author": "Venkat Raman", "title": "Otago Polytechnic launches another video games-related study - Indian NewsLink", "description": "Supplied Content Dunedin, June 26, 2022  Open to learners from July, the new Game Design pathway sits within the New Zealand Certificate in Digital Media and", "url": "https://indiannewslink.co.nz/otago-polytechnic-launches-another-video-games-related-study/", "urlToImage": "https://indiannewslink.co.nz/wp-content/uploads/2022/06/Otago-Polytechnic-launches-Website-Photo.jpg", "publishedAt": "2022-06-26T03:43:35Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Artificial Photosynthesis Can Produce Food in Complete Darkness - SciTechDaily", "description": "Artificial photosynthesis is being developed by researchers to help make food production more energy-efficient on Earth, and maybe one day on Mars. For millions of years, photosynthesis has evolved in plants to turn water, carbon dioxide, and the energy from …", "url": "https://scitechdaily.com/artificial-photosynthesis-can-produce-food-in-complete-darkness/", "urlToImage": "https://scitechdaily.com/images/Plants-Growing-in-Complete-Darkness.jpg", "publishedAt": "2022-06-26T01:21:33Z", "content": "ByUniversity of California RiversideJune 25, 2022\r\nPlants are growing in complete darkness in an acetate medium that replaces biological photosynthesis. Credit: Marcus Harland-Dunaway/UCR\r\nArtificial… [+6676 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Combine the Power of 64 Telescopes To Observe the Structure of the Universe - SciTechDaily", "description": "An international team of astronomers has combined the power of 64 radio telescope dishes for the first time to detect the faint signatures of neutral hydrogen gas across cosmological scales. The feat was achieved using the South African-based MeerKAT telescop…", "url": "https://scitechdaily.com/astronomers-combine-the-power-of-64-telescopes-to-observe-the-structure-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/MeerKAT-Telescope-scaled.jpg", "publishedAt": "2022-06-25T18:29:38Z", "content": "South Africas MeerKAT telescope. Credit: South African Radio Astronomy Observatory (SARAO)\r\nAn international team of astronomers has combined the power of 64 radio telescope dishes for the first time… [+4492 chars]"}]}