{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Meta To Lay Off 10,000 Employees In Second Round Of Job Cuts - NDTV", "description": "Facebook-parent Meta Platforms said on Tuesday it would cut 10,000 jobs, just four months after it let go 11,000 employees, the first Big Tech company to announce a second round of mass layoffs.", "url": "https://www.ndtv.com/world-news/meta-to-lay-off-10-000-employees-in-second-round-of-job-cuts-3860562", "urlToImage": "https://c.ndtvimg.com/2023-02/9vc5snv_meta-facebook-afp_625x300_02_February_23.jpg", "publishedAt": "2023-03-14T14:22:00Z", "content": "Just four months ago, Meta let go 11,000 employees (Representational)\r\nFacebook-parent Meta Platforms said on Tuesday it would cut 10,000 jobs, the first Big Tech company to announce a second round o… [+1892 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA, DOE Telescope on Far Side of the Moon Will Reveal the Dark Ages of the Universe - SciTechDaily", "description": "NASA and the Department of Energy (DOE) are working together to develop a science instrument that will survive the harsh and unforgiving environment of the lunar surface at night on the far side of the Moon to attempt first-of-its-kind measurements of the Dar…", "url": "https://scitechdaily.com/nasa-doe-telescope-on-far-side-of-the-moon-will-reveal-the-dark-ages-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/Commercial-Lunar-Lander.jpg", "publishedAt": "2023-03-14T08:23:11Z", "content": "ByNASAMarch 14, 2023\r\nNASA and the Department of Energy are collaborating to create an instrument called the Lunar Surface Electromagnetics Experiment Night (LuSEE-Night), which can withstand the har… [+7803 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Pi Day Challenge: Celebrate the Mathematical Marvel With Stellar Math Problems - SciTechDaily", "description": "Pi Day is a day for people to celebrate and appreciate the importance of pi in our lives, and is often marked by various events and activities such as pie-eating contests, pi recitation competitions, and lectures on the history and significance of pi. Some pe…", "url": "https://scitechdaily.com/nasa-pi-day-challenge-celebrate-the-mathematical-marvel-with-stellar-math-problems/", "urlToImage": "https://scitechdaily.com/images/Pi-Number-and-Symbol.jpg", "publishedAt": "2023-03-13T19:46:07Z", "content": "ByJet Propulsion LaboratoryMarch 13, 2023\r\nPi Day is an annual celebration commemorating the mathematical constant (pi). It is observed on March 14th (3/14) since the first three digits of pi are 3.1… [+3870 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Apple’s AR/VR headset reportedly being pushed out due to ‘huge pressure to ship’ - TechCrunch", "description": "Apple's mixed reality headset appears to be a given for a 2023 launch, but are the company and industry ready?", "url": "https://techcrunch.com/2023/03/13/apples-ar-vr-headset-reportedly-being-pushed-out-due-to-huge-pressure-to-ship/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1153510742.jpg?resize=1200,675", "publishedAt": "2023-03-13T19:10:24Z", "content": "Stop me if youve heard this one before: Apple is building a mixed reality headset thats set to ship this year. The companys MR (AR+VR) hardware ranks among its longest-lasting rumor cycles. Some (App… [+5676 chars]"}]}