{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Shethepeople.tv"}, "author": "Tanya Savkoor", "title": "Meet Akshata Krishnamurthy, First Indian Citizen To Operate Mars Rover - SheThePeople", "description": "Krishnamurthy is a PhD holder from the Massachusetts Institute of Technology and now works at NASA. She shared her story on Instagram, proudly stating that she is the first Indian citizen to operate a rover on Mars", "url": "https://www.shethepeople.tv/news/akshata-krishnamurthy-first-indian-citizen-to-operate-mars-rover-1758371", "urlToImage": "https://img-cdn.thepublive.com/fit-in/1200x675/shethepeople/media/media_files/kNArfnzKhVtNqi2TIuZ8.png", "publishedAt": "2023-12-05T06:36:43Z", "content": "\"No dream is ever too big or crazy,\" says Akshata Krishnamurthy, an Indian woman who has scripted history as the first citizen from the country to operate the rover on Mars with the National Aeronaut… [+2644 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem Codes for December 5: Know how to Grab Freedom Sprintstar Bundle - HT Tech", "description": "Garena Free Fire Redeem Codes for December 5: Players can claim the latest rewards including bundles, avatar, and banner through the Booyah with Friends event. Also obtain freebies with Garena Free Fire Redeem Codes.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-december-5-know-how-to-grab-freedom-sprintstar-bundle-71701749600169.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/05/1600x900/bda3ef1394e93d39b36a9aa6305e7c64jpg_1_1701749680696_1701749680869.jpg", "publishedAt": "2023-12-05T04:30:18Z", "content": "Garena Free Fire Redeem Codes for December 5: At the start of the month, the developers of Garena Free Fire introduced the Booyah Pass S12 for December, bringing new items for players to grab. Apart … [+2158 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "India returns Chandrayaan-3 propulsion module to Earth orbit - SpaceNews", "description": "The spacecraft that transported the Chandrayaan-3 lander to the moon has returned to Earth orbit, testing technologies for a lunar sample return mission.", "url": "https://spacenews.com/india-returns-chandrayaan-3-propulsion-module-to-earth-orbit/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/12/cyyan3-propmodule.jpg", "publishedAt": "2023-12-05T03:51:19Z", "content": "WASHINGTON The spacecraft that transported the Chandrayaan-3 lander to the moon has returned to Earth orbit, a demonstration of technologies to support a future Indian lunar sample return mission.\r\nT… [+3943 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Newly discovered exoplanet is too big to exist - TechSpot", "description": "The ever-growing list of planets that shouldn't exist now includes LHS 3154b, a Neptune-sized exoplanet that appears to be too large for its host star. LHS 3154...", "url": "https://www.techspot.com/news/101047-newly-discovered-exoplanet-big-exist.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/12/2023-12-04-image-6.jpg", "publishedAt": "2023-12-04T18:18:53Z", "content": "The big picture: Protoplanetary disks require a sufficient amount of raw material to facilitate the formation of planets around a newborn star. The quantity of material present in the disk plays a cr… [+2333 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Alex Wilhelm", "title": "Spotify’s layoffs make sense when you consider its margins and market - TechCrunch", "description": "Spotify is simply tinkering with its economics so that it is more attractive to investors. That means it needs to pay fewer salaries.", "url": "https://techcrunch.com/2023/12/04/spotifys-layoffs-analysis/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1536251840-1-e1690195503226.jpg?resize=1200,675", "publishedAt": "2023-12-04T16:48:09Z", "content": "Spotify’s decision to lay off 17% of its staff is the leading technology story of the morning, and I wouldn’t fault you if you were a little confused why it is doing so. After all, the music streamin… [+793 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Kishalaya Kundu", "title": "Windows 11 23H2 update is affecting gaming performance, but Microsoft says there's a workaround - TechSpot", "description": "An affected user, Anant Acharya, complained about the reduced performance on the official Microsoft forums. He says the problem cropped up on his 2020 HP Pavilion laptop,...", "url": "https://www.techspot.com/news/101048-windows-11-23h2-update-affecting-gaming-performance-but.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/12/2023-12-04-image.jpg", "publishedAt": "2023-12-04T13:31:00Z", "content": "What just happened? Microsoft rolled out the Windows 11 23H2 update earlier this year, bringing a myriad of new features and fixes. However, some users who installed the update are now complaining th… [+2209 chars]"}]}