{"articles": [{"author": "Gourav Mishra", "content": "In a first, NASA's interplanetary helicopter 'Ingenuity' which flew to Mars tucked into the belly of the Perseverance rover, is set to take flight on April 11. Ingenuity is to date the first controll… [+1822 chars]", "description": "Primary goal of the 'Ingenuity marscopter' is to establish an understanding of how well technology can help NASA in flying a chopper in the atmosphere of Mars", "publishedAt": "2021-04-04T04:03:00Z", "source": {"id": null, "name": "Republic World"}, "title": "NASAs Ingenuity marscopter all set to attempt first powered flight in Martian atmosphere - Republic TV", "url": "https://www.republicworld.com/technology-news/science/nasas-ingenuity-marscopter-all-set-to-attempt-first-powered-flight-in-martian-atmosphere.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xxhdpi/vrzxmgeeopqsdv3w_1617507779.jpeg?tr=f-jpeg"}, {"author": "Derek Strickland", "content": "Insomniac Games is using machine learning to enhance in-game visuals on the PlayStation 5, and the studio could be working alongside Sony's AI division.\r\nInsomniac Games recently turned heads by conf… [+2305 chars]", "description": "Insomniac Games confirms the PS5 is capable of machine learning, and it could be working with Sony's AI divisions on new tech.", "publishedAt": "2021-04-03T23:59:01Z", "source": {"id": null, "name": "TweakTown"}, "title": "Insomniac may be using Sony AI machine learning for Spider-Man on PS5 - TweakTown", "url": "https://www.tweaktown.com/news/78555/insomniac-may-be-using-sony-ai-machine-learning-for-spider-man-on-ps5/index.html", "urlToImage": "https://static.tweaktown.com/news/7/8/78555_34_insomniac-may-be-using-sony-ai-machine-learning-for-spider-man-on-ps5_full.jpg"}, {"author": null, "content": "About 66 million years ago, a huge asteroid crashed into what is now the Yucatan, plunging the Earth into darkness. The impact transformed tropical rainforests, giving rise to the reign of flowers.\r\n… [+9731 chars]", "description": "About 66 million years ago, a huge asteroid crashed into what is now the Yucatan, plunging the Earth into darkness. The impact transformed tropical rainforests, giving rise to the reign of flowers. Tropical rainforests today are biodiversity hotspots and play…", "publishedAt": "2021-04-03T22:53:18Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "How the Giant Asteroid That Wiped Out the Dinosaurs Gave Rise to Modern Rainforests - SciTechDaily", "url": "https://scitechdaily.com/how-the-giant-asteroid-that-wiped-out-the-dinosaurs-gave-rise-to-modern-rainforests/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Planet-Atmosphere-scaled.jpg"}, {"author": "Jennifer Ouellette", "content": "27 with 20 posters participating\r\nThe LA Lakers' LeBron James stars as himself in Space Jam: A New Legacy, a sequel to the 1996 film Space Jam.\r\nNBA basketball star LeBron James and a team of Looney … [+5582 chars]", "description": "LeBron James leads Looney Tunes characters in basketball rematch for the digital age", "publishedAt": "2021-04-03T22:26:26Z", "source": {"id": "ars-technica", "name": "Ars Technica"}, "title": "It's the Tune Squad vs the Goon Squad in Space Jam: A New Legacy trailer - Ars Technica", "url": "https://arstechnica.com/gaming/2021/04/its-the-tune-squad-vs-the-good-squad-in-space-jam-a-new-legacy-trailer/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/04/spacejam19-760x380.jpg"}, {"author": "David Lumb", "content": "Get ready to pour one out: rumor\r\n has it that LG will finally announce that its leaving the phones business entirely in the coming days. Its no secret that the companys smartphone sales havent been … [+4672 chars]", "description": "Before LG closes its phone division, remember a legacy of experiments and innovations", "publishedAt": "2021-04-03T21:00:47Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "5 truly wild LG phone innovations – and why they failed - TechRadar", "url": "https://www.techradar.com/news/5-truly-wild-lg-phone-innovations-and-why-they-failed", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dSWvWxK3hsY9vvM3xvEALk-1200-80.jpg"}, {"author": "Zack Whittaker", "content": "As governments scrambled to lock down their populations after the COVID-19 pandemic was declared last March, some countries had plans underway to reopen. By June, Jamaica became one of the first coun… [+10656 chars]", "description": "Amber Group claimed it faced \"cyberattacks, hacking and mischievous players.\" In reality, the app was just not that secure.", "publishedAt": "2021-04-03T18:00:53Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "How Jamaica failed to handle its JamCOVID scandal - TechCrunch", "url": "http://techcrunch.com/2021/04/03/jamaica-jamcovid-amber-group/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/04/GettyImages-1198716718.jpg?w=606"}, {"author": "Devin Coldewey", "content": "NASA’s SBIR program regularly doles out cash to promising small businesses and research programs, and the lists of awardees is always interesting to sift through. Here are a dozen companies and propo… [+6340 chars]", "description": "NASA’s SBIR program regularly doles out cash to promising small businesses and research programs, and the lists of awardees is always interesting to sift through. Here are a dozen companies and proposals from this batch that are especially compelling or sugge…", "publishedAt": "2021-04-03T16:03:31Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "NASA’s small business picks take on automation in space - TechCrunch", "url": "http://techcrunch.com/2021/04/03/nasa-sbir-march-21/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/06/Space-Perspective-View.jpeg?w=711"}, {"author": "David Nield", "content": "It looks as though the Samsung Galaxy Z Flip 3 has been passing through various regulatory agencies in Asia, which has revealed the sort of battery capacity we can expect from the foldable phone due … [+1700 chars]", "description": "As you were", "publishedAt": "2021-04-03T14:30:56Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Samsung Galaxy Z Flip 3 battery details may have just leaked out - TechRadar", "url": "https://www.techradar.com/news/samsung-galaxy-z-flip-3-battery-details-may-have-just-leaked-out", "urlToImage": "https://cdn.mos.cms.futurecdn.net/BhRXxKLamHWdivaNBd6hNS-1200-80.jpg"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "The process of financial emigration, which is the process that allows a taxpayer to formally place themselves on record as a non-resident for tax purposes with the South African Revenue Service (SARS… [+2959 chars]", "description": "The process of financial emigration, which is the process that allows a taxpayer to formally place themselves on record as a non-resident for tax purposes with the South African Revenue Service (SARS), recently changed and came into effect on 1 March 2021.", "publishedAt": "2021-04-03T13:03:47Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "Financial emigration the cleanest route out of South Africa: tax expert - BusinessTech", "url": "https://businesstech.co.za/news/wealth/478843/financial-emigration-the-cleanest-route-out-of-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/10/Rand-freeze.jpg"}, {"author": "Richard Devine", "content": "Microsofts regular schedule of releases for Windows 10\r\n is expected to drop a major update in the latter stages of 2021. Despite being some way off, the Windows 10 21H2 Update, currently being refer… [+7473 chars]", "description": "The big Windows 10 update scheduled for late 2021", "publishedAt": "2021-04-03T08:00:06Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Windows 10 21H2 Update 'Sun Valley' release date, news, and features - TechRadar", "url": "https://www.techradar.com/news/windows-10-21h2-update", "urlToImage": "https://cdn.mos.cms.futurecdn.net/DcKuYVXQ3qDf6TXZgmkYcS-1200-80.jpg"}, {"author": null, "content": "Xiaomi CEO Le Jun also stated that the company is working on a new tablet. Although the Chinese technology manufacturer does not reveal any concrete information about this device, many leaks have alr… [+1609 chars]", "description": "Xiaomi CEO Le Jun also stated that the company is working on a new tablet. Although the Chinese technology manufacturer does not", "publishedAt": "2021-04-02T21:07:36Z", "source": {"id": null, "name": "Somag News"}, "title": "Xiaomi's new tablet will look like Mi MIX Fold - Somag News", "url": "https://www.somagnews.com/xiaomis-new-tablet-will-look-like-mi-mix-fold/", "urlToImage": "https://www.somagnews.com/wp-content/uploads/2021/04/Mi-Pad-5-e1617397399947.jpg"}, {"author": "NPR", "content": "Video stills from Vick Krishna's viral video.I’ve spent 30 years trying to make complicated science understandable. Explaining how vaccines work can be especially tricky. Explaining the new technolog… [+2567 chars]", "description": "A viral TikTok makes vaccine science understandable and pretty funny (it's a horror film parody). NPR caught up with creator and star Vick Krishna — tech expert by day, videographer by night.", "publishedAt": "2021-04-02T11:01:44Z", "source": {"id": null, "name": "WMFE"}, "title": "The Viral TikTok That Explains Vaccine Science — And Makes You Laugh - WMFE", "url": "https://www.wmfe.org/the-viral-tiktok-that-explains-vaccine-science-and-makes-you-laugh/177670", "urlToImage": "https://wmfeimages.s3.amazonaws.com/wp-content/uploads/2021/04/02020134/vick-tiktok_wide-4a9ab2d3aa4454e9723e9113cb26cf99ab26db13.jpg"}, {"author": "Hanna Ziady, CNN Business", "content": "London (CNN Business)At first glance, Deliveroo's stock market debut should have been a runaway success. The food delivery startup was a darling of the UK tech scene, and growing fast thanks to surgi… [+7040 chars]", "description": "At first glance, Deliveroo's stock market debut should have been a runaway success. The food delivery startup was a darling of the UK tech scene, and growing fast thanks to surging demand during the pandemic. Amazon recently bought 16% of the company in a maj…", "publishedAt": "2021-04-02T10:24:00Z", "source": {"id": "cnn", "name": "CNN"}, "title": "London needed a win. Instead it got its worst IPO in history - CNN ", "url": "https://www.cnn.com/2021/04/02/investing/london-deliveroo-ipo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210401073231-restricted-deliveroo-london-0331-super-tease.jpg"}, {"author": "Pranjal Mehar", "content": "A new study offers essential clues about what should happen next from climate change. Using geological records of past sea levels, scientists shed light on ice sheets responsible for a rapid pulse of… [+2859 chars]", "description": "New research has found that previous ice loss events could have caused sea-level rise at rates of around 3.6 meters per century, offering vital clues as to what lies ahead should climate change continue unabated.", "publishedAt": "2021-04-02T09:32:17Z", "source": {"id": null, "name": "Tech Explorist"}, "title": "Previous ice loss events caused sea levels to rise around 3.6 meters per century - Tech Explorist", "url": "https://www.techexplorist.com/previous-ice-loss-events-caused-sea-levels-rise-3-6-meters-per-century/38547/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2021/04/isolation-lake.jpg"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "Mining giant Anglo American says it will complete a feasibility study to develop a hydrogen valley, anchored in the platinum group metals-rich Bushveld geological area in South Africa.\r\nThe study wil… [+2524 chars]", "description": "Mining giant Anglo American says it will complete a feasibility study to develop a “hydrogen valley” anchored in the platinum group metals-rich Bushveld geological area in South Africa.", "publishedAt": "2021-04-02T09:01:58Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "Government and businesses to look at massive ‘Hydrogen Valley’ project in South Africa - BusinessTech", "url": "https://businesstech.co.za/news/energy/479901/government-and-businesses-to-look-at-massive-hydrogen-valley-project-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/Hydrogen.jpg"}, {"author": null, "content": "<ul><li>Jaxson Demsey saved his sister Layla's life this week when she was choking on a chicken nugget in the car.</li><li>The 8-year-old hero used a CPR technique performed by John Cena in the Nicke… [+1440 chars]", "description": "Jaxson Demsey saved his sister Layla's life when she was choking on a chicken nugget in the car thanks to a technique he learnt watching a TV show starring John Cena.", "publishedAt": "2021-04-02T06:45:57Z", "source": {"id": "news24", "name": "News24"}, "title": "Boy, 8, saves his sister's life after learning CPR from Nickelodeon kids show featuring John Cena - News24", "url": "https://www.news24.com/channel/gossip/news/boy-8-saves-his-sisters-life-after-learning-cpr-from-nickelodeon-kids-show-featuring-john-cena-20210402", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10991/c8553729558e4358968de3c8a4434db5.jpg"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "The South African Revenue Service (SARS) has committed to probing the tax affairs, and information disclosed by high-net-worth individuals (HNWI) on tax returns, to ensure that they are actually comp… [+3427 chars]", "description": "The South African Revenue Service (SARS) has committed to probing the tax affairs, and information disclosed by high-net-worth individuals (HNWI) on tax returns, to ensure that they are actually complying with tax laws.", "publishedAt": "2021-04-02T05:00:57Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "SARS will follow you on Facebook and Twitter to see what you are really spending: analyst - BusinessTech", "url": "https://businesstech.co.za/news/wealth/479869/sars-will-follow-you-on-facebook-or-twitter-to-see-what-you-are-really-spending-analyst/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/ferrari-e1617177269996.jpg"}], "message": "Successful api call", "number_of_news": 17, "status": 200, "topic": "tech"}