{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "WhatsApp is preparing to roll out third-party chat support - TechCrunch", "description": "With a month away from the Digital Markets Act (DMA) deadline, WhatsApp is preparing to allow other messaging networks in its app.", "url": "https://techcrunch.com/2024/02/07/whatsapp-is-preparing-to-roll-out-third-party-chat-support/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/01/whatsapp-logo.jpg?resize=1200,800", "publishedAt": "2024-02-07T11:35:56Z", "content": "With a month away from the Digital Markets Act (DMA) deadline, WhatsApp is preparing to allow other messaging networks in its app.\r\nIn an interview with Wired, Dick Brouwer, an engineering director a… [+2408 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "Apple wins Apple Watch antitrust lawsuit with AliveCor - The Siasat Daily", "description": "San Francisco: Apple has won its ongoing legal battle with the US-based medical device company AliveCor over the Apple Watch's heart monitoring technology. AliveCor had accused Apple of limiting third-party access to specific heart rate data collected by the …", "url": "https://www.siasat.com/apple-wins-apple-watch-antitrust-lawsuit-with-alivecor-2973351/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/09/Apple-Watch-ECG1.jpg", "publishedAt": "2024-02-07T08:46:00Z", "content": "San Francisco: Apple has won its ongoing legal battle with the US-based medical device company AliveCor over the Apple Watch’s heart monitoring technology.\r\nAliveCor had accused Apple of limiting thi… [+2180 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Radio Maps May Reveal the Universe’s Biggest Magnetic Fields - Quanta Magazine", "description": "A controversial technique has produced detailed maps of the magnetic fields in colossal galaxy clusters. If confirmed, the approach could be used to reveal where cosmic magnetic fields come from.", "url": "https://www.quantamagazine.org/radio-maps-may-reveal-the-universes-biggest-magnetic-fields-20240206/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2024/02/MegaMagneticField-byNASA_ESA_CSA-byYueHu-Social.webp", "publishedAt": "2024-02-06T19:20:39Z", "content": "By making maps of the magnetic fields hidden inside massive galaxy clusters, astronomers are getting closer to finding the origin of cosmic magnetism.\r\nThese are the first maps of the detailed struct… [+7128 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Vaccine Effectiveness: Which COVID-19 Shots Offer the Most Protection? - SciTechDaily", "description": "New research highlighted the significant benefits of monovalent and bivalent COVID-19 boosters in preventing hospitalization and death, advocating for the periodic update of vaccines to match circulating virus variants. First boosters, second boosters, monova…", "url": "https://scitechdaily.com/vaccine-effectiveness-which-covid-19-shots-offer-the-most-protection/", "urlToImage": "https://scitechdaily.com/images/COVID-Vaccine-Comparison.jpg", "publishedAt": "2024-02-05T02:58:27Z", "content": "A team of University of Michigan researchers analyzed over 80 studies to assess the effectiveness of COVID-19 vaccine doses beyond the primary series. Their findings, based on 150 million patient obs… [+5595 chars]"}]}