{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Boeing Starliner Launch Date, Gateway Hardware, Event Horizon Visualization - SciTechDaily", "description": "A new target launch date for NASA’s Boeing Crew Flight Test … Making progress on major hardware for Gateway … And presidential honors for helping to advance NASA’s mission … A few of the stories to tell you about – This Week at NASA! https://youtu.be/8CBxxzEy…", "url": "https://scitechdaily.com/this-week-nasa-new-boeing-starliner-launch-date-gateway-hardware-event-horizon-visualization/", "urlToImage": "https://scitechdaily.com/images/Gateway-Habitation-and-Logistics-Outpost.jpg", "publishedAt": "2024-05-12T17:04:17Z", "content": "Illustration showing a close-up of the Habitation and Logistics Outpost (HALO), one of the elements of Gateway. Credit: NASA\r\nA new target launch date for NASA’s Boeing Crew Flight Test …\r\nMaking pro… [+3146 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple's latest iPad Pro with AI-powered chip | WION Tech It Out - WION", "description": "Apple has finally introduced its new lineup of iPads, while cutting-edge defence technology took centre stage at a defence trade show in Malaysia. The past w...", "url": "https://www.youtube.com/watch?v=n8tPgnDXFrA", "urlToImage": "https://i.ytimg.com/vi/n8tPgnDXFrA/maxresdefault.jpg", "publishedAt": "2024-05-12T05:30:21Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Weaker ocean currents lead to decline in nutrients for North Atlantic ocean life during prehistoric climate change - Phys.org", "description": "Researchers at Georgia Institute of Technology have finished investigating how the prehistoric weakening of a major ocean current led to a decline in ocean nutrients and negative impacts on North Atlantic ocean life. The results support predictions about how …", "url": "https://phys.org/news/2024-05-weaker-ocean-currents-decline-nutrients.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/weaker-ocean-currents.jpg", "publishedAt": "2024-05-11T19:01:29Z", "content": "Researchers at Georgia Institute of Technology have finished investigating how the prehistoric weakening of a major ocean current led to a decline in ocean nutrients and negative impacts on North Atl… [+6341 chars]"}]}