{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sex and the Symbiont: Can Algae Hookups Help Corals Survive Climate Change? - SciTechDaily", "description": "Rice biologists’ discovery can be used to help climate-challenged reefs survive for now. A little more sexy time for symbionts could help coral reefs survive the trials of climate change. And that, in turn, could help us all. Researchers at Rice University an…", "url": "https://scitechdaily.com/sex-and-the-symbiont-can-algae-hookups-help-corals-survive-climate-change/", "urlToImage": "https://scitechdaily.com/images/Lauren-Howe-Kerr-and-Adrienne-Correa.jpg", "publishedAt": "2021-11-06T12:15:51Z", "content": "Rice University’s Lauren Howe-Kerr, left, and Adrienne Correa discovered that symbiont algae found on corals in French Polynesia are able to reproduce via mitosis and sex. That could make it easier t… [+5595 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "France to help India in advanced military technologies - Hindustan Times", "description": "France stressed continuing its commitment to the Indo Pacific region and termed its partnership with India as a “major pillar of its Indo Pacific strategy,” the Indian embassy in Paris said. | Latest News India", "url": "https://www.hindustantimes.com/india-news/france-to-help-india-in-advanced-military-technologies-101636198597760.html", "urlToImage": "https://images.hindustantimes.com/img/2021/11/06/1600x900/france_india_ajit_doval_1636198647887_1636198648071.jpeg", "publishedAt": "2021-11-06T11:39:57Z", "content": "France reiterated its commitment to fully support Prime Minister Narendra Modis vision of Atmanirbhar Bharat and defence industrialisation, joint research and technology development in India across a… [+1915 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s SpaceX Crew-2 Astronauts Returning to Earth – Watch It Live - SciTechDaily", "description": "NASA’s SpaceX Crew-2 mission now is targeting a return to Earth no earlier than 7:14 a.m. EST Monday, November 8, with a splashdown off the coast of Florida. The Crew Dragon spacecraft, named Endeavour, is scheduled to undock from the International Space Stat…", "url": "https://scitechdaily.com/nasas-spacex-crew-2-astronauts-returning-to-earth-watch-it-live/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Crew-Dragon-Endeavour-Approaches-ISS-scaled.jpg", "publishedAt": "2021-11-06T09:23:13Z", "content": "ByNASANovember 6, 2021\r\nThe SpaceX Crew Dragon Endeavour is pictured during its approach to the International Space Station less than one day after launching from Kennedy Space Center in Florida. The… [+5849 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Sam Leith", "title": "‘The Every is about an all-powerful monopoly that seeks to eliminate competition’: why Dave Eggers won’t sell his new hardback on US Amazon - The Guardian", "description": "The author on returning to the dystopian world of big tech in his sequel to The Circle, and how he’s taking a stand against Bezos’s empire", "url": "https://amp.theguardian.com/books/2021/nov/06/the-every-is-about-an-all-powerful-monopoly-that-seeks-to-eliminate-competition-why-dave-eggers-wont-sell-his-new-hardback-on-us-amazon", "urlToImage": null, "publishedAt": "2021-11-06T09:00:00Z", "content": "Dave EggersThe author on returning to the dystopian world of big tech in his sequel to The Circle, and how hes taking a stand against Bezoss empire\r\nIn 2013, Dave Eggers techno-dystopian satire The C… [+14345 chars]"}, {"source": {"id": null, "name": "SocialNews.XYZ"}, "author": null, "title": "Covid vax: Suctioning may provide better protection than needles - Social News XYZ", "description": "New York, Nov 6 (SocialNews.XYZ) Delivering Covid-19 vaccines via a suctioning technique may help generate higher antibody levels and provide more protection than traditional needles, suggests a new study. When traditional vaccines are injected into... - Soci…", "url": "https://www.socialnews.xyz/2021/11/06/covid-vax-suctioning-may-provide-better-protection-than-needles/", "urlToImage": "https://i2.wp.com/www.socialnews.xyz/wp-content/uploads/2021/10/29/b1557a67ab2aa22932a34146dd33cade.jpg?fit=929%2C677&quality=80&zoom=1&ssl=1", "publishedAt": "2021-11-06T06:36:25Z", "content": "Home » General » Health » Covid vax: Suctioning may provide better protection than needles\r\nNew York, Nov 6 (SocialNews.XYZ) Delivering Covid-19 vaccines via a suctioning technique may help generate … [+2427 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "DJI Mavic 3 Launched With Improvements in All Areas: Offers Enhanced Battery Life, New Cameras, and More - Wccftech", "description": "Today, DJI has seen fit to announce its latest Mavic 3 drone with a boatload of improvements. The company says that the new model brings improvements in every department. Similar to the Mavic 2, the DJI Mavic 3 is a foldable drone with a dual-camera system. I…", "url": "https://wccftech.com/dji-mavic-3-launched-with-improvements-in-all-areas-offers-enhanced-battery-life-new-cameras-and-more/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2021/11/avic-3.jpg", "publishedAt": "2021-11-05T21:11:40Z", "content": "Today, DJI has seen fit to announce its latest Mavic 3 drone with a boatload of improvements. The company says that the new model brings improvements in every department. Similar to the Mavic 2, the … [+2581 chars]"}, {"source": {"id": null, "name": "Theglobalherald.com"}, "author": "Technology Desk", "title": "Former Google CEO Eric Schmidt on the Rise of AI - The Global Herald - The Global Herald", "description": "Bloomberg Technology published this video item, entitled \"Former Google CEO Eric Schmidt on the Rise of AI\" - below is their description.", "url": "https://theglobalherald.com/technology/former-google-ceo-eric-schmidt-on-the-rise-of-ai/", "urlToImage": "https://theglobalherald.com/wp-content/uploads/2021/11/yTPbHtBOcQk.jpg", "publishedAt": "2021-11-05T15:01:10Z", "content": "Bloomberg Technology published this video item, entitled Former Google CEO Eric Schmidt on the Rise of AI below is their description.Got a comment? Leave your thoughts in the comments section, below.… [+54 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "MTN shares surge as Nigeria nears approval for long-awaited license - BusinessTech", "description": "MTN Group Ltd’s shares surged in Johannesburg after the wireless carrier edged closer to gaining a lucrative mobile-money license in Nigeria, more than two years after submitting an application to the authorities.", "url": "https://businesstech.co.za/news/mobile/535126/mtn-shares-surge-as-nigeria-nears-approval-for-long-awaited-license/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/08/MTN-2-e1628780558637.png", "publishedAt": "2021-11-05T13:51:02Z", "content": "MTN Group Ltds shares surged in Johannesburg after the wireless carrier edged closer to gaining a lucrative mobile-money license in Nigeria, more than two years after submitting an application to the… [+2481 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Grayson Cooke", "title": "Clouds in a new light: Rejected satellite data gives a fresh view of our floating companions - Tech Xplore", "description": "Clouds have been objects of reverie and wonder throughout human history, inspiring art and imagination, and of course warning of extreme weather events.", "url": "https://techxplore.com/news/2021-11-clouds-satellite-fresh-view-companions.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/clouds-in-a-new-light.jpg", "publishedAt": "2021-11-05T12:51:00Z", "content": "Clouds have been objects of reverie and wonder throughout human history, inspiring art and imagination, and of course warning of extreme weather events.\r\nClouds are also central players in Earth's cl… [+5572 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "Five Ways Artificial Intelligence Could Shape Our Lives - Channels Television", "description": "Tech evangelists habitually brim with enthusiasm over artificial intelligence’s potential to transform our lives, and the crowds at this year’s Web Summit were no exception.  Here are five uses for AI showcased at one of the world’s largest technology confere…", "url": "https://www.channelstv.com/2021/11/05/five-ways-artificial-intelligence-could-shape-our-lives/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/11/Untitled-1-25.png", "publishedAt": "2021-11-05T11:44:30Z", "content": "An attendee wearing a Daft Punk helmet and gloves take part in the Web Summit in Lisbon on November 2, 2021. CARLOS COSTA / AFP\r\nTech evangelists habitually brim with enthusiasm over artificial intel… [+3697 chars]"}, {"source": {"id": null, "name": "Manchester Evening News"}, "author": "Stephen Hurrell", "title": "LIVE Currys and Very Black Friday 2021 begins with tech deals and discounts, Amazon latest - Manchester Evening News", "description": "Currys has launched Black Friday weeks early with a host of major deals and discounts", "url": "https://www.manchestereveningnews.co.uk/whats-on/shopping/live-currys-very-black-friday-22074685", "urlToImage": "https://i2-prod.manchestereveningnews.co.uk/incoming/article22046253.ece/ALTERNATES/s1200/0_black-friday-shops.jpg", "publishedAt": "2021-11-05T08:26:21Z", "content": "Currys and Very are the first two major retailers to launch Black Friday.\r\nThe online shopping day is set to take place on Friday 26 November and usually the biggest discounts can be found on Amazon.… [+504 chars]"}, {"source": {"id": null, "name": "Business Day"}, "author": "Emily Chang", "title": "Former Google CEO Eric Schmidt says Facebook ‘went too far’ - Business Day", "description": "Still, Schmidt says he opposes trying to regulate the technology industry", "url": "https://www.businesslive.co.za/bd/companies/2021-11-05-former-google-ceo-eric-schmidt-says-facebook-went-too-far/", "urlToImage": "https://lh3.googleusercontent.com/Fm2tskoDcKzrcMH3BGJZgXLs_8pbjO2uKP_IEoqVbrcLaYGZEYSDJZPUr5mJ0WgNiF1OSwKbF-YgSWPVCWV0EDFtYnTXAymDyg=s1000", "publishedAt": "2021-11-05T07:50:14Z", "content": "Facebooks conduct disclosed in leaked documents is pretty concerning, said former Google CEO Eric Schmidt, who called for companies in the tech industry to show more restraint.\r\nFacebook, now known a… [+2768 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Ramaphosa still ANC’s best bet despite electoral results - BusinessTech", "description": "President Cyril Ramaphosa presided over the African National Congress’s worst electoral performance since the end of apartheid. A top South African ruling party official still thinks he’s its best asset.", "url": "https://businesstech.co.za/news/trending/534748/ramaphosa-still-ancs-best-bet-despite-electoral-results/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/Vote-ANC.png", "publishedAt": "2021-11-05T05:23:04Z", "content": "President Cyril Ramaphosa presided over the African National Congresss worst electoral performance since the end of apartheid. A top South African ruling party official still thinks hes its best asse… [+5276 chars]"}]}