{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Reuters", "title": "Boeing sells small defense surveillance unit to Thales - Yahoo Finance", "description": "Boeing said in a statement that Digital Receiver Technology, which makes wireless equipment used by intelligence services, will be sold to Thales Defense...", "url": "https://finance.yahoo.com/news/boeing-sells-small-defense-surveillance-155236116.html", "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/c2f7c2d4ce3bb5621edee5557e762054", "publishedAt": "2024-10-20T15:52:36Z", "content": "(Reuters) -Boeing closed a deal this month to sell a small defense subsidiary that makes surveillance equipment for the U.S. military, the company said on Sunday, as the planemaker looks to shore up … [+1003 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Matt Rosoff", "title": "I just spent my first week ever with an EV, the Chevy Equinox — here’s what it was like - TechCrunch", "description": "The funnest car I ever drove was the original Tesla Roadster. This was in 2011, back when Elon Musk's EV company was courting press instead of denigrating", "url": "https://techcrunch.com/2024/10/19/i-just-spent-my-first-week-ever-with-an-ev-the-chevy-equinox-heres-what-it-was-like/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/10/equinox-parked.jpg?resize=1200,900", "publishedAt": "2024-10-19T19:30:00Z", "content": "The funnest car I ever drove was the original Tesla Roadster. \r\nThis was in 2011, back when Elon Musk’s EV company was courting press instead of denigrating us, and they offered me a test drive. I to… [+7990 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Amazing New Benefit of Ozempic: Reducing Alcohol and Opioid Addiction - SciTechDaily", "description": "New research shows that Ozempic and similar drugs reduce opioid overdoses by 40% and alcohol intoxication by 50% in people with substance use disorders. These medications, often prescribed for diabetes and weight issues, may help treat addiction by influencin…", "url": "https://scitechdaily.com/scientists-discover-amazing-new-benefit-of-ozempic-reducing-alcohol-and-opioid-addiction/", "urlToImage": "https://scitechdaily.com/images/Obese-Man-Using-Semaglutide-Ozempic.jpg", "publishedAt": "2024-10-18T20:26:52Z", "content": "Ozempic is a medication containing semaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA), primarily used to treat type 2 diabetes by improving blood sugar control and promoting weight lo… [+2806 chars]"}]}