{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Silvia Amaro", "title": "German economy enters recession as first-quarter GDP data is revised lower - CNBC", "description": "The German economy entered a technical recession in the first quarter of this year, after posting a contraction of 0.3% over the three-month period.", "url": "https://www.cnbc.com/2023/05/25/german-economy-enters-recession-as-first-quarter-gdp-data-is-revised-lower.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107172879-1672649012059-gettyimages-1245931519-20090101230102-99-76026.jpeg?v=1684997265&w=1920&h=1080", "publishedAt": "2023-05-25T06:21:52Z", "content": "The German economy entered a technical recession in the first quarter of this year, as households tightened spending.\r\nData from the German statistics office on Thursday showed a downward revision to… [+1516 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Silence before the solar storm? Unstable sunspot yet to explode; Can still blast X-class solar flares - HT Tech", "description": "It has been 48 hours since the sunspot AR3311 came into Earth’s view. NOAA satellites predicted that it can explode resulting in X-class solar flares. However, it has not erupted yet. Could this be the calm before the solar storm hits?", "url": "https://tech.hindustantimes.com/tech/news/silence-before-the-solar-storm-unstable-sunspot-yet-to-explode-can-still-blast-x-class-solar-flares-71684990073547.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/25/1600x900/m73-flare-rotated_0_1680256680821_1684990128377.jpeg", "publishedAt": "2023-05-25T04:52:36Z", "content": "As we enter day three of the unstable giant sunspot AR3311 being in full view of the Earth, scientists are concerned. The sunspot was expected to explode already, erupting solar flares. But as time k… [+2134 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 486 answer for May 25: Step up your game! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 486 answer for May 25: Don't take any stress. Crack the answer with these Quordle hints, clues and solutions.", "url": "https://tech.hindustantimes.com/how-to/quordle-486-answer-for-may-25-step-up-your-game-check-quordle-hints-clues-solutions-71684980339340.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/25/1600x900/Quordle_play_store_2_1678105501030_1684980422549.PNG", "publishedAt": "2023-05-25T02:19:54Z", "content": "Quordle 486 answer for May 25: May it be Wordle or Quordle, if you play the game without referring to the hints and clues, it all depends on your luck and guesses to figure out the answer. With only … [+1783 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA: Saturn's Rings Are Young and Could Quickly Disappear - SciTechDaily", "description": "NASA's Cassini mission data suggests that Saturn's rings are young, possibly only a few hundred million years old, and could disappear in a similar timescale. The rings' mass, purity, and debris accumulation rates indicate their relatively young age and short…", "url": "https://scitechdaily.com/?p=280612", "urlToImage": "https://scitechdaily.com/images/Cassinis-View-From-Orbit-Around-Saturn-2010-scaled.jpg", "publishedAt": "2023-05-25T02:16:22Z", "content": "ByAbby Tabor and Aaron McKinnon, NASA's Ames Research CenterMay 24, 2023\r\nThis was Cassinis view from orbit around Saturn on January 2, 2010. In this image, the rings on the night side of the planet … [+9563 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno,Kit Maher,Gregory Krieg,David Wright", "title": "Florida Gov. Ron DeSantis launches 2024 presidential bid on Twitter with Elon Musk - CNN", "description": "After technical glitches delayed the start by 25 minutes, Florida Gov. Ron DeSantis, on Wednesday announced on Twitter’s audio platform that he is entering the Republican presidential primary, setting up a clash with the current GOP frontrunner, former Presid…", "url": "https://www.cnn.com/2023/05/24/politics/ron-desantis-fec-filing-2024/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230523144506-05-ron-desantis-lead-image-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-25T01:33:00Z", "content": "After technical glitches delayed the start by 25 minutes, Florida Gov. Ron DeSantis, on Wednesday announced on Twitters audio platform that he is entering the Republican presidential primary, setting… [+14860 chars]"}]}