{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Sparrowsnews.com"}, "author": "Kamlesh Bhati", "title": "Introducing The DJI Mini 4 Pro: Elevating Aerial Photography To New Heights | SPARROWS NEWS - Sparrows News", "description": "DJI, the industry leader in drone technology, has officially unveiled its latest masterpiece in aerial photography – the DJI Mini 4 Pro. This remarkable", "url": "https://sparrowsnews.com/2023/09/25/dji-mini-4-pro-introduction/", "urlToImage": "https://i0.wp.com/sparrowsnews.com/wp-content/uploads/2023/09/wp-1695653011782.webp", "publishedAt": "2023-09-25T15:01:50Z", "content": "DJI, the industry leader in drone technology, has officially unveiled its latest masterpiece in aerial photography the DJI Mini 4 Pro. This remarkable addition to the Mini series represents the pinna… [+3033 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Amazon Great Indian Festival Sale 2023 coming soon; Get ready for big discounts - HT Tech", "description": "Prepare for a shopping extravaganza! The Amazon Great Indian Festival Sale 2023 is set to dazzle shoppers with unbeatable deals.", "url": "https://tech.hindustantimes.com/tech/news/amazon-great-indian-festival-sale-2023-coming-soon-get-ready-for-big-discounts-71695649545694.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/25/1600x900/Screenshot_2023-09-25_192151_1695649931544_1695649961613.png", "publishedAt": "2023-09-25T13:54:09Z", "content": "Get ready for a shopping extravaganza as the much-anticipated Amazon Great Indian Festival Sale is slated to kick off on October 10, as revealed by sources. This annual shopping fiesta promises a tre… [+2314 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Huawei unveils new products but keeps quiet on Mate 60 Pro technology - South China Morning Post", "description": "Huawei teases new luxury smartphone and launches a new gold-inlaid smartwatch but makes no comment on the chip behind its Mate 60 Pro handset.", "url": "https://www.scmp.com/tech/big-tech/article/3235742/tech-war-huawei-unveils-slew-new-products-keeps-quiet-breakthrough-mate-60-pro-and-chip-inside", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2023/09/25/063a2beb-17aa-40f6-a758-f860285c49cc_40d6715a.jpg?itok=xunH54g0&v=1695637544", "publishedAt": "2023-09-25T11:00:11Z", "content": "US-sanctioned Huawei Technologies unveiled a slew of new products at a widely-watched release ceremony on Monday but kept quiet on its latest smartphone, which is powered by a home-grown chip that is… [+3041 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists regenerate neurons that restore walking in mice after paralysis from spinal cord injury - Phys.org", "description": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after spinal cord injury. The neuroscientists have shown that re-gr…", "url": "https://phys.org/news/2023-09-scientists-regenerate-neurons-mice-paralysis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spinalcord.jpg", "publishedAt": "2023-09-23T18:00:04Z", "content": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after s… [+3605 chars]"}]}