{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Captures Breathtaking Image of Tempestuous Young Stars in Orion - SciTechDaily", "description": "The bright variable star V 372 Orionis takes center stage in this image from the Hubble Space Telescope, which has also captured a smaller companion star in the upper left of this image. Both stars lie in the Orion Nebula, a colossal region of star formation …", "url": "https://scitechdaily.com/hubble-captures-breathtaking-image-of-tempestuous-young-stars-in-orion/", "urlToImage": "https://scitechdaily.com/images/Bright-Variable-Star-v-372-Orionis.jpg", "publishedAt": "2023-01-23T07:53:57Z", "content": "This Hubble Space Telescope image features the bright variable star V 372 Orionis and its smaller companion in the upper left. Both are located in the Orion Nebula, a massive area of star formation l… [+1667 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom clarifies permanent load shedding for South Africa - BusinessTech", "description": "Eskom clears up confusion around permanent load shedding in South Africa.", "url": "https://businesstech.co.za/news/energy/658345/eskom-clarifies-permanent-load-shedding-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/12/Andre-de-Ruyter.jpg", "publishedAt": "2023-01-23T06:17:56Z", "content": "Power utility Eskom says that it has not announced permanent stage 2 and 3 load shedding in South Africa.\r\nResponding to various reports on Sunday declaring permanent stage 2 and stage 3 load sheddin… [+3961 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "GMA, Wavemaker 360 enter health-tech partnership - Manila Bulletin", "description": "The Nation's Leading Newspaper", "url": "https://mb.com.ph/2023/01/23/gma-wavemaker-360-enter-health-tech-partnership/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2023/01/121801.jpeg", "publishedAt": "2023-01-23T05:30:00Z", "content": "GMA Network, through wholly-owned investment arm GMA Ventures Inc. (GVI), is partnering with leading US-based venture fund Wavemaker Three-Sixty Health (Wavemaker 360 to advance health-tech in the re… [+2577 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Sagar Malviya and Chaitali Chakravarty", "title": "Royalty payments to UK parent in HUL's interest: CEO Sanjiv Mehta - Economic Times", "description": "Royalty grants us the right to use Unilever-owned brands and access to Unilever's cutting-edge technical knowhow, world class R&D and innovation capabilities,  he said.  The service fees enable us to leverage Unilever's global expertise and functional service…", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/royalty-payments-to-uk-parent-in-huls-interest-ceo-sanjiv-mehta/articleshow/97237594.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97237703,width-1070,height-580,imgsize-34860,overlay-economictimes/photo.jpg", "publishedAt": "2023-01-23T01:01:00Z", "content": "Mumbai | New Delhi: Hindustan Unilever Ltd (HUL) managing director and CEO Sanjiv Mehta defended the hike in royalty payments to Unilever. The company gets immense value from its parent and these arr… [+3968 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Nachiket Deuskar", "title": "Explained: What emergency powers has India used to block links of BBC’s Gujarat riots documentary? - Scroll.in", "description": "The Centre exercised a provision under the controversial Information Technology Rules, 2021, to issue takedown orders to YouTube and Twitter.", "url": "https://scroll.in/article/1042366/explained-what-emergency-powers-has-india-used-to-block-links-of-bbcs-gujarat-riots-documentary", "urlToImage": "https://s01.sgp1.cdn.digitaloceanspaces.com/book/185948-jjpvpgknno-1674402568.jpg", "publishedAt": "2023-01-23T01:00:00Z", "content": "The Indian government on Friday invoked its emergency powers to direct YouTube and Twitter to remove links of the BBC documentary that revisits Prime Minister Narendra Modis role in the 2002 Gujarat … [+6428 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research: Eating Grapes Can Protect Against UV Damage to Skin - SciTechDaily", "description": "A recent study highlights the potential of grapes in providing photoprotection. A recent study published in the journal Antioxidants has shown that consuming grapes can protect against UV damage to the skin. The study participants who consumed 2 ¼ cups of gra…", "url": "https://scitechdaily.com/?p=245362", "urlToImage": "https://scitechdaily.com/images/Person-Holding-Grapes.jpg", "publishedAt": "2023-01-22T22:36:26Z", "content": "UV damage to the skin is caused by exposure to ultraviolet radiation from the sun or artificial sources such as tanning beds. UV radiation can cause a variety of skin problems, including sunburn, pre… [+3350 chars]"}, {"source": {"id": null, "name": "Leinsterexpress.ie"}, "author": "Lynda Kiernan", "title": "'Digital Leader' students teaching other students at Laois secondary school - Laois Live", "description": "In a recognition of the skills that many young people have in technology, a new team of Digital Leaders has been chosen at a Laois school, to teach other students. Portlaoise College has developed a digital leadership programme for students, to launch a \"blen…", "url": "https://www.leinsterexpress.ie/news/schools/1016306/digital-leader-students-teaching-other-students-at-laois-secondary-school.html", "urlToImage": "https://www.leinsterexpress.ie/resizer/1200/700/true/2023_01_20/20230118_092957-1674234206252.jpg--_digital_leader__students_teaching_other_students_at_laois_secondary_school.jpg?1674234206981", "publishedAt": "2023-01-22T16:53:10Z", "content": "In a recognition of the skills that many young people have in technology, a new team of Digital Leaders has been chosen at a Laois school, to teach other students.\r\nPortlaoise College has developed a… [+2033 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Temasek-backed Zilingo poised to go into liquidation: Report - CNA", "description": "The board of the Singapore-based fashion technology start-up has appointed EY Corporate Services as its provisional liquidator, sources told Bloomberg.", "url": "https://www.channelnewsasia.com/business/temasek-zilingo-startup-singapore-liquidation-india-3224201", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--Q51Qk3Fw--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2023/01/22/271046541_754595042599872_3922890984799739969_n.jpg?itok=rQObZ5Ql", "publishedAt": "2023-01-22T13:20:00Z", "content": "In 2018, Zilingo reportedly splashed out US$1 million to send a number of social media influencers to Morocco for a three-day extravaganza, including camel rides, a hot-air balloon trip, yoga lessons… [+1138 chars]"}, {"source": {"id": null, "name": "The Sun"}, "author": "Jamie Harris", "title": "Google users warned they must convert gadget now – or risk it going to waste forever... - The Sun", "description": "GOOGLE Stadia closed down this week – but it doesn’t mean the end for your controller. The tech giant is allowing players to convert their Stadia controller so it can be used on other p…", "url": "https://www.thesun.co.uk/tech/21112373/google-stadia-controller-switch-to-bluetooth/", "urlToImage": "https://www.thesun.co.uk/wp-content/uploads/2022/05/NINTCHDBPICT000730751975.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-01-22T07:30:00Z", "content": "GOOGLE Stadia closed down this week - but it doesn't mean the end for your controller.\r\nThe tech giant is allowing players to convert their Stadia controller so it can be used on other platforms.\r\nSt… [+3069 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Could Link Evolution of Complex Life to Genetic “Dark Matter” - SciTechDaily", "description": "New research suggests that microRNAs play a crucial role in the advanced development of the brain, including in humans. Octopuses have fascinated scientists and the public with their remarkable intelligence, from using tools to engaging in creative play, prob…", "url": "https://scitechdaily.com/new-research-could-link-evolution-of-complex-life-to-genetic-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Brain-Learning-Concept.jpg", "publishedAt": "2023-01-22T01:48:49Z", "content": "ByDartmouth CollegeJanuary 21, 2023\r\nThe findings lend support to the theory that microRNAs play an essential role in the evolution of intelligent life.\r\nNew research suggests that microRNAs play a c… [+9732 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Inside Story", "title": "Why are so many jobs being shed in Big Tech? - Al Jazeera English", "description": "Hundreds of thousands of people laid off in just over a year as major tech firms cut back.", "url": "https://www.aljazeera.com/program/inside-story/2023/1/21/why-are-so-many-jobs-being-shed-in-big-tech", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/01/image-40.jpg?resize=1200%2C675", "publishedAt": "2023-01-21T19:32:19Z", "content": "On Friday, 12,000 Google employees opened an email telling them their jobs are gone.\r\nThe cuts follow those at others like Meta the owner of Facebook and Whatsapp as well as Twitter and Microsoft.\r\nM… [+634 chars]"}]}