{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Green Lasers Near Mount Fuji, Japan Have a “Chilling” Explanation - SciTechDaily", "description": "The green light streaking across the cloudy sky was something that Daichi Fujii had never seen before. The museum curator's motion-detecting cameras were set up near Japan’s Mount Fuji to capture meteors, allowing him to calculate their position, brightness, …", "url": "https://scitechdaily.com/mysterious-green-lasers-near-mount-fuji-japan-have-a-chilling-explanation/", "urlToImage": "https://scitechdaily.com/images/Green-Laser-Light-From-NASAs-ICESat-2-Satellite-Near-Mount-Fuji-Japan.jpg", "publishedAt": "2023-04-18T21:20:24Z", "content": "ByKate Ramsayer, NASA's Goddard Space Flight CenterApril 18, 2023\r\nOn September 16, 2022, a homemade motion-detecting camera set up by Daichi Fujii near Mount Fuji, Japan, captured green laser light … [+5395 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Xiaomi’s “Ultra” camera phone has a grip accessory, screw-on lens filters - Ars Technica", "description": "The grip has a shutter button, zoom controls, and standard 67 mm lens-filter support.", "url": "https://arstechnica.com/gadgets/2023/04/xiaomis-ultra-camera-phone-has-a-grip-accessory-screw-on-lens-filters/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/24-760x380.jpg", "publishedAt": "2023-04-18T20:38:25Z", "content": "29 with \r\n<ul><li>\r\n The Xiaomi 13 Ultra in its full camera mode regalia. \r\n</li><li>\r\n Here is just the phone body. \r\n</li><li>\r\n See that shadow to the left of the camera bump? The whole phone gets… [+6110 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Ukraine’s SkyUp Aircraft ‘Erupts In Flames’ During Attempted Coup In Sudan; Nearly 20 Planes Destroyed - EurAsian Times", "description": "Maxar Technologies released satellite images on April 17 that display damaged airplanes at the Sudanese airport where the coup attempt occurred. A Boeing 737 from Ukraine’s SkyUp airline is visible among the aircraft charred at the airport. After days of tens…", "url": "https://eurasiantimes.com/edited-nc-checked-ukraines-skyup-aircraft-goes-up-in-flames/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2023/04/Sudan-destroyed-planes-1.jpg", "publishedAt": "2023-04-18T16:50:01Z", "content": "Maxar Technologies released satellite images on April 17 that display damaged airplanes at the Sudanese airport where the coup attempt occurred. A Boeing 737 from Ukraine’s SkyUp airline is visible a… [+4453 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Instagram takes on Linktree and others with support for up to 5 ‘links in bio’ - TechCrunch", "description": "Instagram today is rolling out a new feature for adding links to user profiles that challenges Linktree, Beacons and numerous other “link in bio” solution providers. The company announced on Tuesday it will now allow users to add up to five links to their Ins…", "url": "https://techcrunch.com/2023/04/18/instagram-takes-on-linktree-and-others-with-support-for-up-to-5-links-in-bio/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/04/Multiple-links-1.png?resize=1200,675", "publishedAt": "2023-04-18T16:04:14Z", "content": "Instagram today is rolling out a new feature for adding links to user profiles that challenges Linktree, Beacons and numerous other “link in bio” solution providers. The company announced on Tuesday … [+3382 chars]"}]}