{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Elon Musk admits he only bought Twitter because he thought he’d be forced to - TechCrunch", "description": "Elon Musk's primary reason for buying Twitter in the end? Because he thought, and his lawyers advised him, that he'd have to anyway.", "url": "https://techcrunch.com/2023/04/12/elon-musk-admits-he-only-bought-twitter-because-he-thought-hed-be-forced-to/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/04/twitter-bird-with-elon-musk-head-tear.jpg?resize=1200,645", "publishedAt": "2023-04-12T10:51:15Z", "content": "Elon Musk gave a rare interview to an actual reporter late on Tuesday, speaking to BBC reporter James Clayton on Twitter Spaces. During the interview, Clayton pressed Musk on whether his purchase of … [+1580 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking New Dark Matter Map Validates Einstein's Theory of General Relativity - SciTechDaily", "description": "Research by the Atacama Cosmology Telescope collaboration has culminated in a significant breakthrough in understanding the evolution of the universe. For millennia, humans have been fascinated by the mysteries of the cosmos. Unlike ancient philosophers imagi…", "url": "https://scitechdaily.com/groundbreaking-new-dark-matter-map-validates-einsteins-theory-of-general-relativity/", "urlToImage": "https://scitechdaily.com/images/ACT-Lensing-Map-scaled.jpg", "publishedAt": "2023-04-12T08:29:55Z", "content": "ByPrinceton UniversityApril 12, 2023\r\nResearchers used the Atacama Cosmology Telescope to create this new map of the dark matter. The orange regions show where there is more mass; purple where there … [+11689 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Yordan", "title": "Kuo: Apple will skip solid-state buttons on iPhone 15 Pro due to technical issues - GSMArena.com", "description": "The company might stick to physical buttons, after all. The iPhone 15 Pro and iPhone 15 Pro Max might skip the solid-state buttons, analyst Ming-Chi Kuo...", "url": "https://www.gsmarena.com/apple_iphone_15_pro_solid_state_buttons-news-58216.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/23/04/apple-no-solid-state-keys-kuo/-952x498w6/gsmarena_001.jpg", "publishedAt": "2023-04-12T07:30:01Z", "content": "The iPhone 15 Pro and iPhone 15 Pro Max might skip the solid-state buttons, analyst Ming-Chi Kuo reveals in his latest report. There are unresolved technical issues, meaning the premium iPhone 15 mod… [+1123 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem codes for April 12, 2023: Win cool bundles, diamonds, and weapons - HT Tech", "description": "Garena Free Fire Redeem codes for April 12: Win exciting rewards in just a couple of steps. Know how to.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-april-12-2023-win-cool-bundles-diamonds-and-weapons-71681263228551.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/12/1600x900/048_1654217194104_1681263287290_1681263287290.jpg", "publishedAt": "2023-04-12T01:46:58Z", "content": "Garena Free Fire Redeem codes for April 12: When it comes to cosmetic enhancements, Free Fire probably boasts one of the largest catalogs of skins and accessories for players. The game releases new o… [+2743 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Baking Soda Saves the World: New Additive in Concrete Mix Could Slash Carbon Emissions - SciTechDaily", "description": "MIT engineers discover new carbonation pathways for creating more environmentally friendly concrete. Concrete's carbon footprint could be reduced by 15% if sodium bicarbonate is introduced during the early stages of mixing, according to MIT researchers. The a…", "url": "https://scitechdaily.com/baking-soda-saves-the-world-new-additive-in-concrete-mix-could-slash-carbon-emissions/", "urlToImage": "https://scitechdaily.com/images/Carbon-Dioxide-CO2-Concrete.jpg", "publishedAt": "2023-04-11T21:10:25Z", "content": "When OPC is mixed with water, sand, and gravel material during the production of concrete, it becomes highly alkaline, creating a seemingly ideal environment for the sequestration and long-term stora… [+3844 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What the Tech: Tips on how to protect your Facebook account from getting hacked - Hawaii News Now", "description": "Every day many Facebook accounts are hacked or cloned, here's how to protect your information and block fake accounts.For more Local News from Hawaii News No...", "url": "https://www.youtube.com/watch?v=jqKNl1Ah3Ko", "urlToImage": "https://i.ytimg.com/vi/jqKNl1Ah3Ko/maxresdefault.jpg", "publishedAt": "2023-04-11T03:26:09Z", "content": null}]}