{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dodging Danger, Embracing Discovery: ISS Crew Unpacks SpaceX Dragon After Debris Evasion - SciTechDaily", "description": "The Expedition 70 crew is unpacking the SpaceX Dragon cargo spacecraft following its arrival early Saturday morning. Meanwhile, the orbital residents are also continuing their research and maintenance activities following the International Space Station’s deb…", "url": "https://scitechdaily.com/dodging-danger-embracing-discovery-iss-crew-unpacks-spacex-dragon-after-debris-evasion/", "urlToImage": "https://scitechdaily.com/images/Soyuz-MS-24-Crew-Ship-Docked-Rassvet-Module-scaled.jpg", "publishedAt": "2023-11-14T08:10:39Z", "content": "ByNASANovember 14, 2023\r\nThe Soyuz MS-24 crew ship is docked to the Rassvet module in this photograph from the International Space Station as it orbited 267 miles above the Tasman Sea in between Aust… [+5721 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "From sparking powerful solar storms to causing forest fires, know the dangers of solar winds - HT Tech", "description": "Solar winds have been associated with solar storms, but recent studies also point out their involvement in large forest fires. Know the threats of this stellar wind and the different ways it impacts us.", "url": "https://tech.hindustantimes.com/tech/news/from-sparking-powerful-solar-storms-to-causing-forest-fires-know-the-dangers-of-solar-winds-71699939928200.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/14/1600x900/NOAA_1632590234307_1699940037820.JPG", "publishedAt": "2023-11-14T05:42:14Z", "content": "Solar winds have been part of the reason behind the recent series of solar storms that have struck the Earth in the last couple of weeks. They either sparked solar storm incidents or amplified an act… [+2785 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Mangalyaan-2 mission: How ISRO’s project is different from NASA’s Mars Reconnaissance Orbiter Mission - HT Tech", "description": "Know how ISRO’s Mars Orbiter mission-2 is different from NASA’s Mars Reconnaissance Orbiter Mission.", "url": "https://tech.hindustantimes.com/photos/mangalyaan2-mission-how-isro-s-project-is-different-from-nasa-s-mars-reconnaissance-orbiter-mission-71699935439705.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/14/1600x900/Last_1687759108971_1699935492344.jpg", "publishedAt": "2023-11-14T04:24:18Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "33 Billion Light Years Away: Webb Space Telescope Finds Galaxies That Challenge Astronomical Theories - SciTechDaily", "description": "Follow-up observations in Pandora’s cluster confirmed the second- and fourth-most distant galaxies ever seen, which are larger than other galaxies at such extreme distances. The second- and fourth-most distant galaxies ever observed have been discovered in a …", "url": "https://scitechdaily.com/?p=327881", "urlToImage": "https://scitechdaily.com/images/Pandoras-Cluster-With-Distant-Galaxies.jpg", "publishedAt": "2023-11-14T03:37:48Z", "content": "ByPenn State UniversityNovember 13, 2023\r\nThe second- and fourth-most distant galaxies ever seen (UNCOVER z-13 and UNCOVER z-12) have been confirmed using the James Webb Space Telescopes Near-Infrare… [+13991 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jesse Jenkins", "title": "Scientists uncover aurora-like radio emission above a sunspot - Phys.org", "description": "In a study published in Nature Astronomy, astronomers from New Jersey Institute of Technology's Center for Solar-Terrestrial Research (NJIT-CSTR) have detailed radio observations of an extraordinary aurora-like display occurring 40,000 km above a relatively d…", "url": "https://phys.org/news/2023-11-scientists-uncover-aurora-like-radio-emission.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/njit-scientists-uncove.jpg", "publishedAt": "2023-11-13T21:49:04Z", "content": "In a study published in Nature Astronomy, astronomers from New Jersey Institute of Technology's Center for Solar-Terrestrial Research (NJIT-CSTR) have detailed radio observations of an extraordinary … [+5894 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "GTA 6 leak: All the tools, weapons in Grand Theft Auto 6 - HT Tech", "description": "Ahead of the arrival of the GTA 6 trailer next month, check out all the weapons and tools that players might have access to and utilize in GTA 6.", "url": "https://tech.hindustantimes.com/gaming/news/gta-6-leak-all-the-tools-weapons-in-grand-theft-auto-6-71699860536847.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/13/1600x900/gta_1698150974444_1699860640663.jpg", "publishedAt": "2023-11-13T07:31:59Z", "content": "After nearly a decade's worth of wait, Rockstar Games last week finally revealed details about Grand Theft Auto 6 or GTA 6, the highly anticipated sequel to GTA 5. The game's trailer will be released… [+2276 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unveiling the Mysteries: New Insights on Why Marine Predators Dive Into the Dark, Deep Sea - SciTechDaily", "description": "Data from over 300 tags on large marine predators, along with shipboard sonar, point to the ecological importance of the ocean’s twilight zone. If you’ve ever witnessed a shark breach the water—whether in person or somewhere on the Internet—that fleeting but …", "url": "https://scitechdaily.com/unveiling-the-mysteries-new-insights-on-why-marine-predators-dive-into-the-dark-deep-sea/", "urlToImage": "https://scitechdaily.com/images/Deep-Sea-Predators-Art-Concept.jpg", "publishedAt": "2023-11-12T10:27:30Z", "content": "ByWoods Hole Oceanographic InstitutionNovember 12, 2023\r\nNew research using electronic tags and sonar data shows that large marine predators like sharks and tunas often dive into the deep mesopelagic… [+10576 chars]"}]}