{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Nitasha Tiku, Aaron Gregg, Mariana Alfaro, Jeff Stein", "title": "Tariffs on chips, phones, laptops still coming, commerce secretary warns - The Washington Post", "description": "Trump officials adjusted their position a little more than one day after the White House announced an exemption from “reciprocal” tariffs for semiconductors and tech products.", "url": "https://www.washingtonpost.com/technology/2025/04/13/tariffs-chips-lutnick/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Z6BOLYXH6GO72PYU2PQXQ7JJZ4.JPG&w=1440", "publishedAt": "2025-04-13T23:27:17Z", "content": "U.S. levies on semiconductor chips, smartphones and laptops which the White House exempted late Friday from a slew of reciprocal tariffs are in fact still in the works, and will be determined in a mo… [+4985 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Spherules on Mars: NASA’s Perseverance Rover Finds a Rock That Defies Explanation - SciTechDaily", "description": "Perseverance just stumbled upon one of Mars’ weirdest rocks yet—a formation covered in dark, spherical shapes with mysterious textures that have scientists buzzing. While similar Martian spheres have been seen before, this one, dubbed “St. Pauls Bay,” stands …", "url": "https://scitechdaily.com/shocking-spherules-on-mars-nasas-perseverance-rover-finds-a-rock-that-defies-explanation/", "urlToImage": "https://scitechdaily.com/images/St-Pauls-Bay-Target-Rock-Spherical-Objects.jpg", "publishedAt": "2025-04-13T17:01:27Z", "content": "This image from NASA’s Mars Perseverance rover, a fusion-processed SuperCam Remote Micro Imager (RMI) mosaic, shows part of the “St. Pauls Bay” target, acquired from the lower Witch Hazel Hill area o… [+4207 chars]"}]}