{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "Premium Times"}, "author": "Mariam Ileyemi", "title": "Strike: ASUU accuses NITDA of peddling lies over UTAS - Premium Times", "description": "The union also threatened that it would demand that the initial NITDA Technical Report on UTAS, where it scored 85 per cent in User...", "url": "https://www.premiumtimesng.com/news/top-news/517078-strike-asuu-accuses-nitda-of-peddling-lies-over-utas.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/03/20220301_151826-scaled-e1646379650750.jpg", "publishedAt": "2022-03-13T21:18:59Z", "content": "Following the controversies over the University Transparency and Accountability Solution (UTAS), the Academic Staff Union of Universities (ASUU) has accused the National Information Technology Develo… [+4001 chars]"}, {"source": {"id": null, "name": "Vrscout.com"}, "author": null, "title": "Holoride In-Car VR Entertainment Heading To Audi Vehicles - VRScout", "description": "Backseat VR technology will arrive on select Audi sedans and SUVs as early as this Summer according to Holoride.", "url": "https://vrscout.com/news/holoride-in-car-vr-entertainment-heading-to-audi-vehicles/", "urlToImage": "https://l3apq3bncl82o596k2d1ydn1-wpengine.netdna-ssl.com/wp-content/uploads/2022/03/HolorideAudi_2-e1647193004394.jpeg", "publishedAt": "2022-03-13T17:44:36Z", "content": "Backseat VR technology will arrive on select Audi sedans and SUVs as soon as this Summer.\r\nLast month HTC Vive announced that it was partnering with in-car VR entertainment company Holoride to bring … [+2138 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Shuts Tech Hub Over 66 Covid Cases. 17 Million People In Lockdown - NDTV", "description": "The southern Chinese tech hub Shenzhen was put under a citywide lockdown Sunday, the local government announced, after it reported 66 new coronavirus cases and sealed off the central business district.", "url": "https://www.ndtv.com/world-news/coronavirus-china-covid-cases-china-covid-news-china-shuts-tech-hub-over-66-covid-cases-17-million-people-in-lockdown-2820383", "urlToImage": "https://c.ndtvimg.com/2022-03/p4i15afo_china-covid-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-03-13T13:53:00Z", "content": "Coronavirus: Fresh COVID-19 cases have been reported in China amid Omicron surge.\r\nBeijing: China placed all 17 million residents in one of its biggest cities under lockdown on Sunday, as virus cases… [+4597 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Regulator suspends Kulula and British Airways flights in South Africa indefinitely - BusinessTech", "description": "South Africa’s Civil Aviation Authority (SACAA) has indefinitely suspended Comair flights in South Africa due to safety concerns.", "url": "https://businesstech.co.za/news/business/567582/regulator-suspends-kulula-and-british-airways-flights-in-south-africa-indefinitely/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/Kulula1-e1614003691782.jpg", "publishedAt": "2022-03-13T10:44:54Z", "content": "South Africa’s Civil Aviation Authority (SACAA) has indefinitely suspended Comair flights in South Africa due to safety concerns.\r\nIn a statement on Saturday (12 March), Comair said its Kulula and Br… [+1815 chars]"}, {"source": {"id": null, "name": "Analytics Insight"}, "author": "Analytics Insight", "title": "Solana (SOL), Cardano (ADA), Avalanche (AVAX) and Bitgert (BRISE) - Which Has the Fastest Blockchain? - Analytics Insight", "description": "Solana, Cardano, Avalanche, and Bitgert are the best cryptocurrencies with outstanding blockchain technology. But there are differences between them in terms of performance, with scaling being one of the major measures.", "url": "https://www.analyticsinsight.net/solana-sol-cardano-ada-avalanche-avax-and-bitgert-brise-which-has-the-fastest-blockchain/", "urlToImage": "https://analyticsinsight.b-cdn.net/wp-content/uploads/2022/03/202201031620-main.jpg", "publishedAt": "2022-03-13T08:43:42Z", "content": "Blockchain technology adoption is growing fast and is also advancing fast. A decade down the line after the launch of Bitcoin, we have thousands of blockchain-based projects competing. Today, the hot… [+3052 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Meteorites Crucial For Earth May Have Formed In Outer Solar System: Study - NDTV", "description": "A new study led by researchers at Tokyo Institute of Technology suggested that these asteroidal materials might have formed very far out in the early Solar System then been transported into  the inner Solar System by chaotic mixing processes.", "url": "https://www.ndtv.com/world-news/meteorites-that-helped-form-earth-may-have-formed-in-outer-solar-system-suggests-study-2819948", "urlToImage": "https://c.ndtvimg.com/2021-06/duklcvi_asteroid-generic_625x300_30_June_21.jpg", "publishedAt": "2022-03-13T07:52:33Z", "content": "The study also examined physical and chemical conditions in outer main-belt asteroids (Representational)\r\nTokyo: A new study led by researchers at the Earth-Life Science Institute (ELSI) at Tokyo Ins… [+5414 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How medical aid prices are shifting in South Africa - BusinessTech", "description": "Traditionally, medical aid schemes implement fee increases from 1 January every year. However, the last two years have seen new trends emerge because of the Covid-19 pandemic, says Lee Callakoppen, principal officer of Bonitas Medical Fund.", "url": "https://businesstech.co.za/news/finance/565888/how-medical-aid-prices-are-shifting-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/07/Hospital-e1532081202820.jpeg", "publishedAt": "2022-03-13T07:00:29Z", "content": "Traditionally, medical aid schemes implement fee increases from 1 January every year. However, the last two years have seen new trends emerge because of the Covid-19 pandemic, says Lee Callakoppen, p… [+3736 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Problems over lifting South Africa’s state of disaster and lockdown: report - BusinessTech", "description": "South Africa’s National Coronavirus Command Council (NCCC) will meet on Monday (14 March) to discuss updated lockdown restrictions for South Africa.", "url": "https://businesstech.co.za/news/government/567566/problems-over-lifting-south-africas-state-of-disaster-and-lockdown-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/PresidentRamaphosa.jpg", "publishedAt": "2022-03-13T05:16:35Z", "content": "South Africa’s National Coronavirus Command Council (NCCC) will meet on Monday (14 March) to discuss updated lockdown restrictions for South Africa. However, it is unlikely to scrap the national stat… [+2471 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid crash on Earth? Check what NASA just did! - HT Tech", "description": "An asteroid crash is a constant threat to Earth. And now a NASA project has been revealed.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-crash-on-earth-check-what-nasa-just-did-71647144057343.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/13/1600x900/asteroid-g5603adab3_1920_1647078503425_1647144225312.jpg", "publishedAt": "2022-03-13T04:09:08Z", "content": "NASA keeps a constant watch for potentially hazardous asteroids which can pose a threat to Earth. NASA is also preparing for the worst case scenario- an asteroid crash. Yes, an asteroid may even cras… [+3476 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Mark Trevelyan", "title": "Meta defends hate speech against Russia | Citypress - News24", "description": "Russian prosecutors asked a court to designate the US technology giant as an “extremist organisation”, and the country’s communications regulator said it would restrict access to Instagram starting on March 14.", "url": "https://www.news24.com/citypress/news/meta-defends-hate-speech-against-russia-20220312", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2519/6b6004c078c847689f67b6b3d0c5764a.jpg", "publishedAt": "2022-03-12T22:08:04Z", "content": "NEWS\r\nFacebook owner Meta Platforms said on Friday that a temporary change in its content policy for Ukraine was needed to let users voice their opposition to Russia’s invasion, as Russia opened a cr… [+110 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Two Massive Blobs in Earth's Mantle Baffle Scientists With Their Surprising Properties - SciTechDaily", "description": "Earth is layered like an onion, with a thin outer crust, a thick viscous mantle, a fluid outer core, and a solid inner core. Within the mantle, there are two massive blob-like structures, roughly on opposite sides of the planet. The blobs, more formally refer…", "url": "https://scitechdaily.com/two-massive-blobs-in-earths-mantle-baffle-scientists-with-their-surprising-properties/", "urlToImage": "https://scitechdaily.com/images/Blob-in-Earths-Mantle.jpg", "publishedAt": "2022-03-12T21:11:02Z", "content": "A 3D view of the blob in Earth’s mantle beneath Africa, shown by the red-yellow-orange colors. The cyan color represents the core-mantle boundary, blue signifies the surface, and the transparent gray… [+3599 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Gigantic Crawler on the Move As Rollout of Mega Moon Rocket Inches Closer - SciTechDaily", "description": "Yesterday, engineers and technicians at NASA’s Kennedy Space Center in Florida drove Crawler Transporter-2, which will carry NASA’s Moon rocket to the launch pad, to the doors of the Vehicle Assembly Building (VAB). Soon, the 6.6-million-pound crawler will go…", "url": "https://scitechdaily.com/nasa-gigantic-crawler-on-the-move-as-rollout-of-mega-moon-rocket-inches-closer/", "urlToImage": "https://scitechdaily.com/images/NASA-Crawler-Transporter-2-Artemis-I.jpg", "publishedAt": "2022-03-12T16:39:41Z", "content": "Engineers and technicians at NASA’s Kennedy Space Center in Florida drove Crawler Transporter-2 on March 11, 2022 to the doors of the Vehicle Assembly Building (VAB). Soon, it will go inside the VAB … [+3594 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Sayak Biswas", "title": "Apple has a game changer in its M1 UltraFusion Chip Interconnect - TechSpot", "description": "Apple recently announced the M1 Ultra, its new flagship SoC that will power the all-new Mac Studio, a compact yet high-performance desktop system. It claims the M1...", "url": "https://www.techspot.com/news/93755-exploring-apple-m1-ultrafusion-chip-interconnect.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-12-image-5.jpg", "publishedAt": "2022-03-12T16:33:00Z", "content": "The big picture: Apple is pushing boundaries with its 114 billion transistor behemoth M1 Ultra. It uses state-of-the-art interconnection technology to connect two discrete chips into a single SoC. Fo… [+2862 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Rogerson", "title": "Xiaomi 12 launch: 4 things we expect and 3 things we don't - TechRadar", "description": "The Xiaomi 12 range could include a lot of members", "url": "https://www.techradar.com/news/xiaomi-12-launch-4-things-we-expect-and-3-things-we-dont", "urlToImage": "https://cdn.mos.cms.futurecdn.net/v9TAt4ttEyiePnBeBQXU24-1200-80.jpg", "publishedAt": "2022-03-12T16:00:23Z", "content": "The Xiaomi 12 is about to go global, with a global launch planned for March 15, and it won’t just be the Xiaomi 12 itself that we see on that date.\r\nA teaser for the event mentions the Xiaomi 12 ‘ser… [+4894 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New crime docudrama adds insights to old cases including Geylang Bahru Tan Children Murders - AsiaOne", "description": "As crime-solving technologies get more advanced, would it help shed some light on old criminal cases? A new Mediacorp docudrama Inside Crime Scene that was released on Friday (March 11) aims to provide new perspectives on six heinous crimes that shook Singapo…", "url": "https://www.asiaone.com/entertainment/new-crime-docudrama-inside-crime-scene-new-insights-old-cases-geylang-bahru-tan-children-murders", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/120322_GeylangBahrhu%20Crime%20DocuDrama_MeWatch.jpg?h=0429cc9e&itok=5mUtv40k", "publishedAt": "2022-03-12T07:48:00Z", "content": "As crime-solving technologies get more advanced, would it help shed some light on old criminal cases? \r\nA new Mediacorp docudrama Inside Crime Scene that was released on Friday (March 11) aims to pro… [+2572 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Nearly 90 small-cap stocks gain over 10% as market ends in black amid volatility - Moneycontrol", "description": "All the sectoral indices ended with gains as the Nifty Media and Pharma indices rise 6 percent each and Information Technology and Realty indices climb 3 percent each", "url": "https://www.moneycontrol.com/news/business/stocks/nearly-90-small-cap-stocks-gain-over-10-as-market-goes-back-in-black-amid-volatility-8223691.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/stocks_sensex_nifty_stock-1-770x433.jpg", "publishedAt": "2022-03-12T04:30:31Z", "content": "Indian benchmark indices witnessed smart recovery, gaining more than 2 percent in the week ended March 11 and broke a four-week losing streak amid volatility due to the ongoing geopolitical tension b… [+5279 chars]"}]}