{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Medha Jha", "title": "Samsung Galaxy Unpacked coming, know how Samsung Galaxy Z Fold 2 made a triumphant debut - HT Tech", "description": "Take a look at the journey of the Samsung Galaxy Z Fold 2 ahead of Samsung Unpacked event.", "url": "https://tech.hindustantimes.com/tech/news/samsung-galaxy-unpacked-coming-know-how-samsung-galaxy-z-fold-2-made-a-triumphant-debut-71690124157166.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/mika-baumeister-vI8_06RmSC0-unsplash_1619328845976_1690124566979.jpg", "publishedAt": "2023-07-23T15:07:18Z", "content": "Samsung Galaxy Unpacked event is just two days away and all the Samsung fans are eagerly waiting for all the premium products to be launched. The highlights of the event are going to be Galaxy Fold 5… [+2864 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DART Impact Aftermath: Hubble Sees Boulders Escaping From Asteroid Dimorphos - SciTechDaily", "description": "The 2022 DART mission impact rattled the asteroid's surface Sorry Chicken Little, the sky is not falling — at least not yet. Wayward asteroids present a real collision hazard to Earth. Scientists estimate that an asteroid measuring several miles across smashe…", "url": "https://scitechdaily.com/dart-impact-aftermath-hubble-sees-boulders-escaping-from-asteroid-dimorphos/", "urlToImage": "https://scitechdaily.com/images/Hubble-Photographs-Boulders-Flung-Off-Asteroid-Dimorphos.jpg", "publishedAt": "2023-07-23T15:03:39Z", "content": "BySpace Telescope Science InstituteJuly 23, 2023\r\nThis Hubble Space Telescope image of the asteroid Dimorphos was taken on December 19, 2022, nearly four months after the asteroid was impacted by NAS… [+10700 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple Watch saves life of Norwegian trail runner after horror fall - HT Tech", "description": "Know how an Apple Watch saved a trail runner's life after a fall. He called the emergency number from his Apple Watch after not being able to reach his iPhone.", "url": "https://tech.hindustantimes.com/wearables/news/apple-watch-saves-life-of-norwegian-trail-runner-after-horror-fall-71690117594854.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/Apple_Watch_1690117777852_1690117778021.jpg", "publishedAt": "2023-07-23T13:12:09Z", "content": "Apple Watch has proved to be a life-saving companion for a trail runner who encountered a serious accident during his run. 59-year-old Robert Naess had a terrifying fall while on a trail run, but tha… [+2053 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fruit Fly Compound Could Lead to New Antibiotics - SciTechDaily", "description": "A new study reports on peptide’s antibacterial mechanism. Researchers from the University of Illinois Chicago have discovered that a peptide derived from fruit flies may pave the way for the development of novel antibiotics. Published in Nature Chemical Biolo…", "url": "https://scitechdaily.com/fruit-fly-compound-could-lead-to-new-antibiotics/", "urlToImage": "https://scitechdaily.com/images/Antibiotic-Bacteria-Target-Illustration.jpg", "publishedAt": "2023-07-23T12:52:32Z", "content": "ByUniversity of Illinois ChicagoJuly 23, 2023\r\nResearchers at the University of Illinois Chicago have discovered that a natural peptide from fruit flies, named drosocin, can bind to bacterias ribosom… [+3228 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ISABELLA O'MALLEY, MICHAEL PHILLIS", "title": "One year old, US climate law is already turbocharging clean energy technology - The Associated Press", "description": "Excessive heat continues to bear down on sections of the United States, a reminder of the impetus for the The Inflation Reduction Act, the significant climate legislation that turns one year old on August 16. Since passage, it has boosted the U.S. transition …", "url": "https://apnews.com/article/inflation-reduction-act-renewable-energy-policy-economy-d5b0a7f15659930c6c15f0d180b193e8", "urlToImage": "https://dims.apnews.com/dims4/default/51c6af6/2147483647/strip/true/crop/5842x3286+0+304/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb3%2F1b%2F43486e46e45c245d3f0608608a63%2F2edaa1f0a8ea472f900e09f6d62da94e", "publishedAt": "2023-07-23T12:11:00Z", "content": "FRANKFORT, Ky. (AP) On a recent day under the July sun, three men heaved solar panels onto the roof of a roomy, two-story house near the banks of the Kentucky River, a few miles upstream from the sta… [+7297 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Nomads: NASA's Roman Space Telescope Could Find 400 Earth-Mass Rogue Planets - SciTechDaily", "description": "New research conducted by scientists from NASA and Japan’s Osaka University suggests that rogue planets, or worlds that drift through space untethered to a star, significantly outnumber planets that orbit stars. The results indicate that NASA’s Nancy Grace Ro…", "url": "https://scitechdaily.com/cosmic-nomads-nasas-roman-space-telescope-could-find-400-earth-mass-rogue-planets/", "urlToImage": "https://scitechdaily.com/images/Nancy-Grace-Roman-Space-Telescope-Illustration.jpg", "publishedAt": "2023-07-23T11:10:11Z", "content": "ByAshley Balzer, NASAs Goddard Space Flight CenterJuly 23, 2023\r\nNASA and Osaka University scientists suggest that rogue planets, which roam space unattached to stars, are far more numerous than star… [+6935 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Price Cut Alert! Get 27% discount on Samsung Galaxy M13 - HT Tech", "description": "Get Samsung Galaxy M13 with an amazing discount on Amazon; Check out the deal now before it closes.", "url": "https://tech.hindustantimes.com/mobile/news/price-cut-alert-get-27-discount-on-samsung-galaxy-m13-71690100005950.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/Untitled_design_-_2022-07-24T154806897_1690100132757_1690100132955.png", "publishedAt": "2023-07-23T08:17:29Z", "content": "If you are looking to buy a smartphone that costs less than Rs. 12000, but don't want to compromise with features and style then this Amazon deal is for you. Yes, you read that right! Amazon brings y… [+1810 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Dhanshree Shripad Shenwai, Dhanshree Shripad Shenwai", "title": "The 'Finding Neurons in a Haystack' Initiative at MIT, Harvard, and Northeastern University Employs Sparse Probing - MarkTechPost", "description": "It is common to think of neural networks as adaptable 'feature extractors' that learn by progressively refining appropriate representations from initial raw inputs. So, the question arises: what characteristics are being represented, and in what way? To bette…", "url": "https://www.marktechpost.com/2023/07/22/the-finding-neurons-in-a-haystack-initiative-at-mit-harvard-and-northeastern-university-employs-sparse-probing/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/05/Screenshot-2023-05-10-at-10.32.25-PM.png", "publishedAt": "2023-07-23T05:00:00Z", "content": "It is common to think of neural networks as adaptable “feature extractors” that learn by progressively refining appropriate representations from initial raw inputs. So, the question arises: what char… [+6216 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Marijuana Use May Alter Your DNA Methylation - SciTechDaily", "description": "Recent and long-term marijuana use is linked to changes in the human epigenome, a new Northwestern Medicine study published in the journal Molecular Psychiatry has found. Marijuana ranks as the most widely used drug in the United States. Data from the Centers…", "url": "https://scitechdaily.com/warning-marijuana-use-may-alter-your-dna-methylation/", "urlToImage": "https://scitechdaily.com/images/Marijuana-Body-Effects-Art-Concept.jpg", "publishedAt": "2023-07-23T02:33:02Z", "content": "ByNorthwestern UniversityJuly 22, 2023\r\nA study by Northwestern Medicine links recent and long-term marijuana use to changes in the human epigenome. The research identified significant epigenetic cha… [+5543 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 545 answers for July 23: Get all green boxes! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 545 answer for July 23: You are going to have to work hard for a win today and we recommend you take the help of Quordle hints, clues and solutions to ensure victory.", "url": "https://tech.hindustantimes.com/how-to/quordle-545-answers-for-july-23-get-all-green-boxes-check-quordle-hints-clues-solutions-71690073910287.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/quordle_1654498442093_1690074080103.webp", "publishedAt": "2023-07-23T01:03:33Z", "content": "Quordle 545 answers for July 23: The last thing any player wants on a Sunday morning is to deal with a tricky puzzle. Sunday is the weekend and a time when people finally relax from the stress of the… [+1730 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Warning: GPS Data Could Detect Large Earthquakes Hours Before They Happen - SciTechDaily", "description": "A systematic global analysis of GPS time-series data from nearly 100 large earthquakes suggests the existence of a precursory phase of fault slip that occurs about two hours before seismic rupture. The analysis of Global Positioning System (GPS) time-series d…", "url": "https://scitechdaily.com/early-warning-gps-data-could-detect-large-earthquakes-hours-before-they-happen/", "urlToImage": "https://scitechdaily.com/images/GPS-Earthquake-Art.jpg", "publishedAt": "2023-07-22T15:41:50Z", "content": "ByWalter Beckwith, American Association for the Advancement of Science (AAAS)July 22, 2023\r\nA comprehensive analysis of GPS time-series data suggests a precursory phase of fault slip occurs two hours… [+3751 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Into the Unknown: NASA's GEDI Space Laser Provides Answers to Rainforest Canopy Mystery - SciTechDaily", "description": "NASA's GEDI, a space laser, has provided a groundbreaking, detailed structural view of the world's rainforests, enabling researchers to further understand these complex ecosystems. Uncovering the Secrets of Rainforest Canopies We know less about the rainfores…", "url": "https://scitechdaily.com/into-the-unknown-nasas-gedi-space-laser-provides-answers-to-rainforest-canopy-mystery/", "urlToImage": "https://scitechdaily.com/images/Lasers-Measuring-Rainforest.jpg", "publishedAt": "2023-07-22T09:12:20Z", "content": "ByNorthern Arizona UniversityJuly 22, 2023\r\nNASAs space laser, GEDI, has revolutionized our understanding of rainforests, revealing a simpler structure with a peak leaf concentration at 15 meters. Th… [+6748 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "ATLAS measured Higgs boson's mass with unprecedented precision - Tech Explorist", "description": "New result from the ATLAS experiment at CERN reaches the unprecedented precision of 0.09%.", "url": "https://www.techexplorist.com/atlas-measured-higgs-bosons-mass-unprecedented-precision/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/Higgs-boson.jpg", "publishedAt": "2023-07-22T08:54:29Z", "content": "Since its discovery, the Higgs boson has become an exciting topic for shedding light on the Universe’s fundamental structure. Since the Standard Model cannot predict the Higgs boson’s mass, it must b… [+2607 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Fungus Among Us: Defying Nature's Anti-Fungal Arsenal - SciTechDaily", "description": "An anti-fungal compound produced by plants doesn’t work on at least one fungus. RIKEN scientists have discovered how a parasitic fungus renders harmless a powerful anti-fungal compound produced by some plants. As well as providing a fascinating glimpse into t…", "url": "https://scitechdaily.com/the-fungus-among-us-defying-natures-anti-fungal-arsenal/", "urlToImage": "https://scitechdaily.com/images/Aglaia-Flower.jpg", "publishedAt": "2023-07-22T04:54:22Z", "content": "ByRIKENJuly 21, 2023\r\nRIKEN researchers found a parasitic fungus immune to plant-produced anti-fungal compounds called rocaglates due to a gene mutation. This discovery could impact the potential use… [+4744 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Mohammad Arshad, Mohammad Arshad", "title": "Decoding Human Intelligence: Stanford's Latest AI Research Questions Innate Number Sense - A Learned Skill or a Natural Gift? - MarkTechPost", "description": "The ability to decipher any quantity is called Number sense. Number sense is key in mathematical cognition. Various activities, such as organizing large amounts into small groups and categorizing numerical quantities like numbers, are performed by our nervous…", "url": "https://www.marktechpost.com/2023/07/21/decoding-human-intelligence-stanfords-latest-ai-research-questions-innate-number-sense-a-learned-skill-or-a-natural-gift/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/07/Screenshot-2023-07-21-at-1.23.45-PM.png", "publishedAt": "2023-07-21T20:30:00Z", "content": "The ability to decipher any quantity is called Number sense. Number sense is key in mathematical cognition. Various activities, such as organizing large amounts into small groups and categorizing num… [+3777 chars]"}]}