{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Decoding Deep Space Mysteries: Researchers Uncover Potential Link Between Two of Astronomy's Most Enigmatic Phenomena - SciTechDaily", "description": "An international group of researchers has identified a potential link between gravitational waves from neutron star mergers and fast radio bursts. This finding could enhance our comprehension of the mechanisms behind certain deep-space burst phenomena. The my…", "url": "https://scitechdaily.com/?p=284622", "urlToImage": "https://scitechdaily.com/images/Gravitational-Waves-Illustration.jpg", "publishedAt": "2023-06-13T19:15:06Z", "content": "ByUniversity of Nevada, Las VegasJune 13, 2023\r\nAn international research team has found a potential link between neutron star mergers and fast radio bursts (FRBs), two of the universes most enigmati… [+7051 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Hi-Fi Rush: Arcade Challenge - Official Reveal Trailer | Xbox Extended Showcase 2023 - IGN", "description": "Return to the Vandelay Technologies campus in this new update for Hi-Fi Rush including new modes and much much more.#IGN #Xbox #SummerofGaming", "url": "https://www.youtube.com/watch?v=FVGT_u9PPUA", "urlToImage": "https://i.ytimg.com/vi/FVGT_u9PPUA/maxresdefault.jpg", "publishedAt": "2023-06-13T17:45:00Z", "content": null}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold, silver sell off as FOMC conclusion looms - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2023-06-13/Gold-silver-sell-off-as-FOMC-conclusion-looms.html", "urlToImage": "https://www.kitco.com/news/2023-06-13/images/goldchart_0613_pm.png", "publishedAt": "2023-06-13T17:12:00Z", "content": "(Kitco News) - Gold and silver prices are lower in midday dealings Tuesday, losing initial gains that were seen following a U.S. inflation report that came in very close to market expectations. Posit… [+2544 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Some Species Survive Mass Extinctions? Hidden “Whole Genome Duplication” May Be the Secret - SciTechDaily", "description": "Geneticists have made a significant discovery about the ancient history of sturgeons and paddlefish, which carries profound implications for our understanding of evolution. They identified a previously hidden instance of \"whole genome duplication\" (WGD) in th…", "url": "https://scitechdaily.com/?p=283315", "urlToImage": "https://scitechdaily.com/images/Abstract-Genetic-Sequencing-Fail.jpg", "publishedAt": "2023-06-13T10:12:28Z", "content": "ByTrinity College DublinJune 13, 2023\r\nGeneticists discovered a past whole genome duplication (WGD) event in the common ancestor of sturgeons and paddlefish that occurred just before a significant ma… [+4344 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "450-foot asteroid, bigger than the Statue of Liberty, rushing towards Earth at fearsome speed - HT Tech", "description": "NASA has revealed key details about a mammoth asteroid that is set to make its closest approach to Earth. Know its speed, size, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/450foot-asteroid-statue-of-liberty-earth-nasa-speed-54272-kmph-71686630599977.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/orbit-viewer-snapshot_1686630862332_1686630865898.jpg", "publishedAt": "2023-06-13T04:35:01Z", "content": "Located at JPL, the Center for Near-Earth Object Studies (CNEOS) works alongside the Planetary Defense Coordination Office at NASA Headquarters in Washington to characterize the orbits of near-Earth … [+1834 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Quantum Physics: New Visualization Technique Gives Insight Into Photosynthesis - SciTechDaily", "description": "Researchers have developed coherence maps, a technique to visualize quantum mechanics and understand the mechanisms underpinning photosynthesis. The maps elucidate the complex energy transfer process in photosynthesizing bacteria, providing a clear picture of…", "url": "https://scitechdaily.com/harnessing-quantum-physics-new-visualization-technique-gives-insight-into-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-06-12T23:06:14Z", "content": "ByUniversity of Illinois Grainger College of EngineeringJune 12, 2023\r\nScientists have developed an illustrative method called coherence maps to elucidate quantum phenomena. They used these maps to g… [+4561 chars]"}]}