{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Geminid Meteor Shower and Asteroid Vesta - SciTechDaily", "description": "What are some skywatching highlights in December 2023? Clear skies will make for ideal viewing of the Geminid meteor shower, and grab your binoculars to search for asteroid Vesta. Vesta at Opposition and Geminid Meteors! The most reliable meteors of the year …", "url": "https://scitechdaily.com/dont-miss-geminid-meteor-shower-and-asteroid-vesta/", "urlToImage": "https://scitechdaily.com/images/Meteor-Shower-Backyard-Art.jpg", "publishedAt": "2023-12-08T09:20:55Z", "content": "This December, skywatchers can enjoy the Geminid meteor shower, peaking on the night of December 13th, and the opportunity to observe asteroid Vesta, especially when it’s at opposition. The Moon will… [+6875 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Tim Vernimmen, Knowable Magazine", "title": "Neanderthals: More Knowable Now Than Ever – The Wire Science - The Wire Science", "description": "They have held our fascination ever since we first identified their remains. Today, thanks to new artifacts and technologies, findings about our closest relatives are coming thick and fast.", "url": "https://science.thewire.in/the-sciences/neanderthals-more-knowable-now-than-ever/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2023/12/08115310/neand.jpg", "publishedAt": "2023-12-08T06:32:29Z", "content": "Soft tissue reconstruction of a male homo neanderthals in the Natural History Museum, Vienna. Photo: By Wolfgang Sauber/Wikimedia Commons, CC BY-SA 4.0Neanderthals are Homo sapienss closest-known rel… [+15132 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA tracks Asteroid 2023 WG; it will come as close as 6.7 million km to Earth today - HT Tech", "description": "NASA has tracked Asteroid 2023 WG in its orbit which will bring it close to Earth today, December 8. Know details such as its speed, size, distance of approach, and more.", "url": "https://tech.hindustantimes.com/tech/news/nasa-tracks-asteroid-2023-wg-it-will-come-as-close-as-6-7-million-km-to-earth-today-71702014558866.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/08/1600x900/wikimedia_commons_1673950232106_1702015200427.jpg", "publishedAt": "2023-12-08T06:00:30Z", "content": "NASA defines asteroids as ancient space rocks left over from the early formation of our solar system about 4.6 billion years ago. Most of them are mainly found in the main asteroid belt located betwe… [+1671 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "FDA considers gene-editing treatment for sickle cell disease - CBS News", "description": "The Food and Drug Administration is set to vote on the use of gene-editing technology to potentially cure sickle cell disease, the painful genetic blood diso...", "url": "https://www.youtube.com/watch?v=18VK6r7lF1U", "urlToImage": "https://i.ytimg.com/vi/18VK6r7lF1U/maxresdefault.jpg", "publishedAt": "2023-12-07T16:37:44Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Step Backward: Wildfires Undo 20 Years of Air Quality Progress in Western U.S. - SciTechDaily", "description": "Study finds that fire-prone areas and downwind regions have seen an increase in premature deaths. You need only to remember last summer’s wildfires in the United States and Canada, which fouled the air from coast to coast, to know the effects these blazes can…", "url": "https://scitechdaily.com/a-step-backward-wildfires-undo-20-years-of-air-quality-progress-in-western-u-s/", "urlToImage": "https://scitechdaily.com/images/United-States-Wildfires-Pollution-Art.jpg", "publishedAt": "2023-12-07T14:16:24Z", "content": "Wildfires over two decades have severely impacted air quality in the western U.S., increasing health risks and negating efforts to reduce pollution, with a conservative estimate of 670 extra prematur… [+5906 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Sarah Whelan, PhD", "title": "139 Genes Set Human Cognitive Ability Apart From Other Primates - Technology Networks", "description": "A group of 139 genes commonly expressed in primate brains – which underwent evolutionary divergence only in human brains – may be the source of our unique cognitive abilities according to a study led by the University of Toronto.", "url": "https://www.technologynetworks.com/genomics/news/139-genes-set-human-cognitive-ability-apart-from-other-primates-381787", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/381787/139-genes-set-human-cognitive-ability-apart-from-other-primates-381787-640x360.jpg?cb=20231207", "publishedAt": "2023-12-07T13:53:00Z", "content": "A group of 139 genes commonly expressed in primate brains which underwent evolutionary divergence only in human brains may be the source of our unique cognitive abilities according to a study led by … [+3320 chars]"}]}