{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Shadows: Revolutionary Method Reveals Images Hidden in Noise - SciTechDaily", "description": "Innovative quantum-inspired imaging technique excels in low-light conditions, offering new prospects in medical imaging and art conservation. Researchers at the University of Warsaw's Faculty of Physics with colleagues from Stanford University and Oklahoma St…", "url": "https://scitechdaily.com/quantum-shadows-revolutionary-method-reveals-images-hidden-in-noise/", "urlToImage": "https://scitechdaily.com/images/Abstract-Quantum-Imaging-Art.jpg", "publishedAt": "2023-12-30T21:29:18Z", "content": "A groundbreaking phase imaging method, resistant to phase noise and effective in dim light, has been developed by international researchers. This technique, detailed in Science Advances, enhances ima… [+7589 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Noah Hunter", "title": "Daily Deals: Persona 5 Royal, JBL Charge 5, Logitech G Pro X - IGN", "description": "Check out our roundup of the best deals for Saturday, December 30", "url": "https://www.ign.com/articles/daily-deals-persona-5-royal-jbl-charge-5-logitech-g-pro-x", "urlToImage": "https://assets-prd.ignimgs.com/2023/12/30/daily-deals-dec-30-1703958969860.png?width=1280", "publishedAt": "2023-12-30T18:38:55Z", "content": "Tomorrow is New Year's Eve, and that means plenty of holiday sales have begun to run down. Discounts are all over each retailer's website, with games, tech, and more receiving deep cuts. The best dea… [+11342 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Goodbye mysterious military space plane, and good luck – wherever you’re going - TechCrunch", "description": "SpaceX's Falcon Heavy rocket delivered a military space plane to orbit last night, though scant details about the mission are known.", "url": "https://techcrunch.com/2023/12/29/goodbye-mysterious-military-space-plane-and-good-luck-wherever-youre-going/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/ussf-52.jpeg?resize=1200,800", "publishedAt": "2023-12-29T19:18:10Z", "content": "SpaceXs Falcon Heavy rocket launched a secretive military spaceplane to orbit last night after weeks of delays, though scant details about the mission have been released to the public.\r\nThe Falcon He… [+2025 chars]"}]}