{"articles": [{"author": "Keith Noonan", "content": "If you invested in Amazon stock 10 years ago and held on to your shares, the value of your position would have grown roughly 1,660%. An investment in Netflix stock would have yielded a 1,720% return … [+4310 chars]", "description": "These industry leaders could help take your portfolio to the next level.", "publishedAt": "2021-03-07T13:15:00Z", "source": {"id": null, "name": "Motley Fool"}, "title": "Got $5,000? 2 Tech Stocks to Buy and Hold for the Long Term - Motley Fool", "url": "https://www.fool.com/investing/2021/03/07/got-5000-2-tech-stocks-buy-hold-for-long-term/", "urlToImage": "https://g.foolcdn.com/editorial/images/616593/gettyimages-1251366801.jpg"}, {"author": "Matthew Yap", "content": "While there are many brands of fitness bands these days, Fitbit remains a top tier choice among the many options. The brand also has a presence in Malaysia too, so news of its products is relevant fo… [+1012 chars]", "description": "While there are many brands of&nbsp;fitness bands&nbsp;these days,&nbsp;Fitbit&nbsp;remains a top tier choice among the many options. The brand also has a prese", "publishedAt": "2021-03-07T11:44:19Z", "source": {"id": null, "name": "TechNave"}, "title": "Fitbit Ace 3 details leaked, could launch on 15 March 2021 - TechNave", "url": "https://technave.com/gadget/Fitbit-Ace-3-details-leaked-could-launch-on-15-March-2021-23671.html", "urlToImage": "https://technave.com/data/files/mall/article/202103071137017668.jpg"}, {"author": "Jeremy Laird", "content": "Mini LED is the next big thing in TV technology. But how does it compare to the current king of premium sets, OLED? Can it really beat OLED for everything from brightness, contrast, HDR performance a… [+8149 chars]", "description": "Can the Mini LED backlight give LCD TVs what it takes to beat OLED?", "publishedAt": "2021-03-07T11:00:41Z", "source": {"id": "techradar", "name": "TechRadar"}, "title": "Mini LED vs OLED: how do the top TV technologies compare? - TechRadar", "url": "https://www.techradar.com/news/mini-led-vs-oled", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AEtajE2AeTC3UVWsmJG4WY-1200-80.jpg"}, {"author": null, "content": "Ozo and Pointeks Managing Director, Emeka Oguchi\r\nBy Muhaimin Olowoporoku\r\nFormer Big brother Naija housemate, Ozoemena Chukwu popularly called Ozo has been unveiled as a brand ambassador for retail … [+783 chars]", "description": "Former Big brother Naija housemate, Ozoemena Chukwu popularly called Ozo has been unveiled as a brand ambassador for retail technology store, Pointek.", "publishedAt": "2021-03-07T06:42:23Z", "source": {"id": null, "name": "P.M. News"}, "title": "BBNaija's Ozo clinches new ambassadorial deal - P.M. News", "url": "https://www.pmnewsnigeria.com/2021/03/07/bbnaijas-ozo-clinches-new-ambassadorial-deal/", "urlToImage": "https://i1.wp.com/www.pmnewsnigeria.com/wp-content/uploads/2021/03/Ozo.png?fit=700%2C400&ssl=1"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "As government continues to drag its feet on providing a “solution” to the failed Gauteng e-tolling system, roads agency Sanral is gearing up for a new legal framework which could see motorists fined,… [+4693 chars]", "description": "As government continues to drag its feet on providing a “solution” to the failed Gauteng e-tolling system, roads agency Sanral is gearing up for a new legal framework which could see motorists fined, or having licence renewals blocked if they don’t pay their …", "publishedAt": "2021-03-07T06:34:16Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "Sanral says it will block your car licence renewals if you don’t pay e-tolls: report - BusinessTech", "url": "https://businesstech.co.za/news/government/473594/sanral-says-it-will-block-your-car-licence-renewals-if-you-dont-pay-e-tolls-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2014/10/E-toll-gantry.png"}, {"author": "MD Bureau", "content": "Sydney: A team of researchers suggests that one dose of the Pfizer-BioNTech vaccine could be sufficient in providing a robust immune response 11 days after inoculation against severe acute respirator… [+1563 chars]", "description": "Sydney: A team of researchers suggests that one dose of the Pfizer-BioNTech vaccine could be...", "publishedAt": "2021-03-07T04:00:11Z", "source": {"id": null, "name": "Medical Dialogues"}, "title": "Pfizer-BioNTech COVID-19 vaccine effective from day 11 post 1st dose, says study - Medical Dialogues", "url": "https://medicaldialogues.in/news/industry/pharma/pfizer-biontech-covid-19-vaccine-effective-from-day-11-post-1st-dose-says-study-75230", "urlToImage": "https://medicaldialogues.in/h-upload/2021/03/04/149462-a75d2a99467f154ac51b9779e32d13da.jpg"}, {"author": null, "content": "It's an intuitive idea: Wouldn't it be best to administer a Covid-19 vaccine in the place it first invades the body?\r\nThat's what Maryland-based biotech startup, Altimmune, is trying to develop - a C… [+5012 chars]", "description": "A company called Altimmune is working on a nasal-spray version of a COVID-19 vaccine. The technology could stem the virus' spread better than shots.", "publishedAt": "2021-03-06T18:11:55Z", "source": {"id": "business-insider", "name": "Business Insider"}, "title": "A future Covid vaccine could be squirted up the nose. The nasal spray could stop transmission, especially in kids - Business Insider South Africa", "url": "https://www.businessinsider.com/intranasal-covid-19-vaccine-spray-could-stem-spread-2021-3", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11023/6223cb2837a446d38cae48e9bc96e8f4.jpg"}, {"author": "Zaynab Khojji", "content": "YANGON: Myanmar security forces fired gunshots as they carried out overnight raids in the main city Yangon after breaking up the latest protests against last months coup with teargas and stun grenade… [+3800 chars]", "description": "LONDON: Vaccitech, a biotechnology company launched by two leaders of the Oxford University COVID-19 vaccine team, is deploying anti-coronavirus technology to revolutionize conventional cancer treatments. The company, founded by professors Sarah Gilbert and A…", "publishedAt": "2021-03-06T15:06:59Z", "source": {"id": null, "name": "Arab News"}, "title": "'Revolutionary' new cancer treatment builds on COVID-19 jab tech - Arab News", "url": "https://www.arabnews.com/node/1820916", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/03/06/2507591-835127520.jpg"}, {"author": null, "content": "This artist’s illustration represents the possible interior dynamics of the super-Earth exoplanet LHS 3844b. The planet’s interior properties and the strong stellar irradiation might lead to a hemisp… [+5033 chars]", "description": "Until now, researchers have found no evidence of global tectonic activity on planets outside our solar system. Under the leadership of the University of Bern and the National Center of Competence in Research NCCR PlanetS, scientists have now found that the ma…", "publishedAt": "2021-03-06T13:44:46Z", "source": {"id": null, "name": "SciTechDaily"}, "title": "Volcanoes Might Light Up the Night Sky of This Super-Earth Exoplanet - SciTechDaily", "url": "https://scitechdaily.com/volcanoes-might-light-up-the-night-sky-of-this-super-earth-exoplanet/", "urlToImage": "https://scitechdaily.com/images/Super-Earth-Exoplanet-LHS-3844b-Crop.jpg"}], "message": "Successful api call", "number_of_news": 9, "status": 200, "topic": "tech"}