{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tim Paradis", "title": "Big Tech wants to rehire you. Should you go back? - Business Insider", "description": "Big Tech wants to bring back some of the workers it laid off. The decision might come down to how a company handled the layoffs.", "url": "https://www.businessinsider.com/salesforce-meta-big-tech-companies-rehire-workers-employees-laid-off-2023-9", "urlToImage": "https://i.insider.com/650dce2319f33e00190487a8?width=1200&format=jpeg", "publishedAt": "2023-09-24T14:14:00Z", "content": "It's not the call you'd expect to get: The company that laid you off wants you back.\r\nDo you go? It's a question that many of us might think we know the answer to: Hell, no! Yet, for some workers, th… [+5580 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Successfully Genetically Modify Individual Cells in Living Animals - SciTechDaily", "description": "One proven method for tracking down the genetic origins of diseases is to knock out a single gene in animals and study the consequences this has for the organism. The problem is that for many diseases, the pathology is determined by multiple genes, complicati…", "url": "https://scitechdaily.com/scientists-successfully-genetically-modify-individual-cells-in-living-animals/", "urlToImage": "https://scitechdaily.com/images/Mosaic-Mouse.jpg", "publishedAt": "2023-09-24T09:34:16Z", "content": "ByETH ZurichSeptember 24, 2023\r\nResearchers have developed a technique using CRISPR-Cas to simultaneously modify multiple genes in the cells of adult animals, creating a mosaic-like pattern that simp… [+8613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "VIR-1388: Clinical Trial of Preventive HIV Vaccine Begins - SciTechDaily", "description": "Novel vaccine includes NIH-funded technology in development since 2004. A trial of a preventive HIV vaccine candidate has begun enrollment in the United States and South Africa. The Phase 1 trial will evaluate a novel vaccine known as VIR-1388 for its safety …", "url": "https://scitechdaily.com/?p=311063", "urlToImage": "https://scitechdaily.com/images/HIV-1-Virus-Particle.jpg", "publishedAt": "2023-09-24T04:46:00Z", "content": "ByNational Institutes of Health (NIH)September 23, 2023\r\nColorized transmission electron micrograph of an HIV-1 virus particle (yellow/gold) budding from the plasma membrane of an infected H9 T cell … [+6817 chars]"}]}