{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": null, "title": "NIMC DG for maiden Tony Blair tech forum - Punch Newspapers", "description": "The Director-General, National Identity Management Commission, Aliyu Aziz, has been scheduled to speak at the inaugural tech forum of the Tony Blair Institute for Global Change, Sunday PUNCH learnt on Saturday.", "url": "https://punchng.com/nimc-dg-for-maiden-tony-blair-tech-forum/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2019/10/16185150/Director-General-CEO-of-NIMC-Aliyu-Aziz-Abubakar.jpg", "publishedAt": "2022-11-20T03:55:33Z", "content": "The Director-General, National Identity Management Commission, Aliyu Aziz, has been scheduled to speak at the inaugural tech forum of the Tony Blair Institute for Global Change, Sunday PUNCH learnt o… [+1110 chars]"}, {"source": {"id": null, "name": "Womenlovetech.com"}, "author": "Emma Crameri", "title": "Review: Logitech MX Keys mini keyboard - Women Love Tech ", "description": "Logitech MX Keys mini keyboard is comfortable to use and a smart way to connect your keyboard with up to three wireless devices.", "url": "https://womenlovetech.com/review-logitech-mx-keys-mini-keyboard/", "urlToImage": "https://womenlovetech.com/wp-content/uploads/2022/11/logitech-MX-keys-mini-keyboard-with-mice.jpg", "publishedAt": "2022-11-20T02:29:38Z", "content": "The Logitech MX Keys mini keyboard has a minimalist design for ultra-fluid typing.\r\nThis mini keyboard is ideal for smaller desk setups, remote working, and anyone who doesnt use the number pad frequ… [+3118 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Major Implications – Scientists Have Created a “Living Blood Vessel” - SciTechDaily", "description": "This is the first time scientists have observed vessels form with such a close resemblance to the complicated structure of naturally occurring blood vessels. An international research collaboration headed by the University of Sydney has created technology tha…", "url": "https://scitechdaily.com/major-implications-scientists-have-created-a-living-blood-vessel/", "urlToImage": "https://scitechdaily.com/images/Living-Blood-Vessel-Concept.jpg", "publishedAt": "2022-11-20T02:10:57Z", "content": "Artists impression of the living blood vessel, featuring the new material Credit: Designed by Ziyu Wang and illustrated by Ella Maru Studio\r\nThis is the first time scientists have observed vessels fo… [+4017 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BestBuy early Black Friday Sale slashes iPhone 14 Pro price by up to $1000! - HT Tech", "description": "Black Friday Sale 2022 is live! And you can grab the iPhone 14 Pro with up to a $1000 discount at BestBuy. Here’s how.", "url": "https://tech.hindustantimes.com/how-to/bestbuy-early-black-friday-sale-slashes-iphone-14-pro-price-by-up-to-1000-71668875911895.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/11/19/1600x900/omar-al-ghosson-gyyeHji1S-w-unsplash_1668876136667_1668876179098_1668876179098.jpg", "publishedAt": "2022-11-19T16:44:35Z", "content": "Many retailers have flooded the market with some of the biggest discounts of the year well ahead of the Black Friday Sale. Some big e-retailers including Amazon, Walmart, Target, and BestBuy have alr… [+1650 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Bruce Haring", "title": "Taylor Swift Ticketing Fiasco Draws Ticketmaster Apology, Political Heat - Deadline", "description": "Ticketmaster feels little Susie’s pain, the corporate giant said Friday. The ducats company issued a statement Friday that apologized for the technical mess that resulted in fans being locked out of purchasing the coveted seats to Taylor Swift’s “The Eras Tou…", "url": "https://deadline.com/2022/11/taylor-swift-ticketing-fiasco-draws-ticketmaster-apology-1235176790/", "urlToImage": "https://deadline.com/wp-content/uploads/2022/10/Taylor-Swift.jpg?w=1024", "publishedAt": "2022-11-19T16:28:00Z", "content": "Ticketmaster feels little Susie’s pain, the corporate giant said Friday.\r\nThe ducats company issued a statement Friday that apologized for the technical mess that resulted in fans being locked out of… [+3022 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Business Desk", "title": "Now, Zomato Starts Layoffs Across Roles; To Reduce Workforce by 4% - News18", "description": "At least 100 employees have already been impacted across functions such as product, tech, catalogue and marketing", "url": "https://www.news18.com/news/business/now-zomato-starts-layoffs-across-roles-to-reduce-workforce-by-4-6423349.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/zomato-166124948016x9.png", "publishedAt": "2022-11-19T11:22:00Z", "content": "Food delivery platform Zomato has started laying off employees this week, as the company looks to cut costs and turn profitable, according to a Moneycontrol report quoting sources. It said that at le… [+2092 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "There are now 8 billion people in the world – here’s what that means for the future - BusinessTech", "description": "There are 8 billion people in the world. That’s a fact. It’s a thing we can’t deny. Like the fact that", "url": "https://businesstech.co.za/news/lifestyle/643463/there-are-now-8-billion-people-in-the-world-heres-what-that-means-for-the-future/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Large-crowd.jpg", "publishedAt": "2022-11-19T11:09:16Z", "content": "The worlds population reached 8 billion Tuesday (15 November), according to estimates from the United Nations, even as the international body said that a surge in births in lower-income countries is … [+2563 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Rebecca Isaacs", "title": "35+ best Amazon Black Friday deals 2022: Save now on Fire TV, iPad, Ring cameras, and more - ZDNet", "description": "Amazon's Black Friday plan involves getting the deals straight to you earlier this year. Shop its deals and score big savings on top tech items and gifts.", "url": "https://www.zdnet.com/article/early-amazon-black-friday-deals-november-18-2022/", "urlToImage": "https://www.zdnet.com/a/img/resize/f7bb0eb76df0df6ecce573b978ee396d1b345f86/2022/11/17/60a61358-377a-41df-a445-181b3b815342/best-amazon-black-friday-deals.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2022-11-18T20:48:45Z", "content": "ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other … [+1152 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Liftoff! Stunning Photos of Successful Launch for JPSS-2, LOFTID - SciTechDaily", "description": "Last week the NOAA’s Joint Polar Satellite System-2 (JPSS-2) satellite, with NASA’s LOFTID technology demonstration along for the ride, lifted off from Space Launch Complex-3 at Vandenberg Space Force Base in California. Powered by 860,000 pounds of thrust fr…", "url": "https://scitechdaily.com/liftoff-stunning-photos-of-successful-launch-for-jpss-2-loftid/", "urlToImage": "https://scitechdaily.com/images/JPSS-2-and-LOFTID-Launch-Moon-scaled.jpg", "publishedAt": "2022-11-18T15:03:19Z", "content": "ByNASANovember 18, 2022\r\nThe Moon makes a stunning backdrop for the successful launch of the third in a series of polar-orbiting weather satellites for the National Oceanic and Atmospheric Administra… [+3595 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom pushes stage 4 load shedding into the weekend – and warns of ‘erratic’ changes ahead - BusinessTech", "description": "Eskom warns that the energy system has lost a buffer – so expect erratic changes to load shedding stage ahead.", "url": "https://businesstech.co.za/news/energy/644369/eskom-pushes-stage-4-load-shedding-into-the-weekend-and-warns-of-erratic-changes-ahead/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Eskom-lightbulb-max.png", "publishedAt": "2022-11-18T13:13:08Z", "content": "Power utility Eskom has warned that load shedding stages will be erratic in the coming days as the group has lost its buffer of diesel generation that usually helps keep things relatively stable.\r\nTh… [+2662 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major headache for new climate laws in South Africa - BusinessTech", "description": "A recent report by the Parliamentary Monitoring Group examined the actions and effectiveness of the country’s Parliament in achieving outcomes in relation to the climate change agenda, with some disturbing findings.", "url": "https://businesstech.co.za/news/government/644195/major-headache-for-new-climate-laws-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Ramaphosa-Green-Earth-Climate-Change-v2.jpg", "publishedAt": "2022-11-18T08:33:39Z", "content": "The Parliamentary Monitoring Group (PMG) has found that critical climate bills are not given enough engagement nor properly understood by people in parliament – stalling progress and creating headach… [+3571 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Royal Ibeh", "title": "Huawei Launches Transformative Fintech Offering To Revolutionise Mobile Money - Leadership News", "description": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial", "url": "https://leadership.ng/huawei-launches-transformative-fintech-offering-to-revolutionise-mobile-money/", "urlToImage": "https://leadership.ng/wp-content/uploads/2022/08/HUAWEI-2.jpg", "publishedAt": "2022-11-18T07:45:50Z", "content": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial inclusion and improve the consumers digital user … [+3073 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Capitec ‘hit squad’ scored millions – and is getting away with it - BusinessTech", "description": "Short sellers that targetted Capitec and other South African companies dodge a massive fine.", "url": "https://businesstech.co.za/news/business/644147/capitec-hit-squad-scored-millions-and-is-getting-away-with-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Capitec-Viceroy.jpg", "publishedAt": "2022-11-18T06:56:01Z", "content": "Short-seller Viceroy, which tanked Capitec’s shares in 2018 with a hit-piece on the bank’s business, has successfully side-stepped a R50 million fine imposed by the Financal Sector Conduct Authority … [+5096 chars]"}]}