{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Unveils Design for Humanity's Message Heading to Jupiter's Moon Europa - SciTechDaily", "description": "When it launches in October, the agency’s Europa Clipper spacecraft will carry a richly layered dispatch that includes more than 2.6 million names submitted by the public. Following in NASA’s storied tradition of sending inspirational messages into space, the…", "url": "https://scitechdaily.com/nasa-unveils-design-for-humanitys-message-heading-to-jupiters-moon-europa/", "urlToImage": "https://scitechdaily.com/images/Jupiter-Moon-Europa-Message.jpg", "publishedAt": "2024-03-10T22:37:05Z", "content": "This side of a commemorative plate mounted on NASA’s Europa Clipper spacecraft features U.S. Poet Laureate Ada Limón’s handwritten “In Praise of Mystery: A Poem for Europa.” It will be affixed with a… [+5679 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Igniting the Future: NASA's RS-25 Engine Test Blazes a Trail for Artemis Moonshots - SciTechDaily", "description": "NASA's recent full-duration RS-25 engine hot fire test at Stennis Space Center marks a significant step in certifying new engines for the SLS rocket, intended for future Artemis missions to the Moon and beyond, showcasing the collaborative efforts between NAS…", "url": "https://scitechdaily.com/igniting-the-future-nasas-rs-25-engine-test-blazes-a-trail-for-artemis-moonshots/", "urlToImage": "https://scitechdaily.com/images/Full-Duration-RS-25-Engine-Hot-Fire-scaled.jpg", "publishedAt": "2024-03-10T21:21:46Z", "content": "At NASA Stennis, a crucial full-duration RS-25 hot fire engine test marks significant progress in the Artemis program, aiming for lunar and Martian exploration. Credit: NASA/Danny Nowlin\r\nNASA’s rece… [+2374 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "James Miller", "title": "Boeing Starliner crewed flight to ISS delayed yet again - TechSpot", "description": "Boeing started developing the Starliner capsule back in 2010 as part of NASA's Commercial Crew Program, a venture aimed at partnering with private firms to bolster NASA's...", "url": "https://www.techspot.com/news/102204-boeing-starliner-crewed-flight-iss-delayed-again.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/03/2024-03-10-image-3.jpg", "publishedAt": "2024-03-10T18:14:00Z", "content": "TL;DR: After years of delays, the first crewed flight of Boeing's Starliner capsule was scheduled for mid-April, but the mission is facing postponement once more this time due to scheduling conflicts… [+2704 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's astronauts aboard International Space Station set to return to Earth on SpaceX Dragon - HT Tech", "description": "NASA's Crew 7, after a six-month stint on the International Space Station (ISS), is gearing up to return to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasas-astronauts-aboard-international-space-station-set-to-return-to-earth-on-spacex-dragon-71710078806646.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/10/1600x900/Ukraine-Tensions-Space-3_1645814351869_1710079067470.jpg", "publishedAt": "2024-03-10T13:59:09Z", "content": "NASA's Crew 7 mission is poised to conclude its six-month residency aboard the International Space Station (ISS), with seven astronauts preparing to return to Earth. Throughout their extended stay, t… [+2312 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Historic Discovery: The Farthest Active Supermassive Black Hole Ever Found - SciTechDaily", "description": "The enigmatic galaxy GN-z11 is one of the youngest ever observed. Delivering on its promise to transform our understanding of the early universe, the James Webb Space Telescope is probing galaxies near the dawn of time. One of these is the exceptionally lumin…", "url": "https://scitechdaily.com/webbs-historic-discovery-the-farthest-active-supermassive-black-hole-ever-found/", "urlToImage": "https://scitechdaily.com/images/Wispy-Galaxy-Concept.jpg", "publishedAt": "2024-03-10T10:34:08Z", "content": "Researchers using the James Webb Space Telescope have made groundbreaking discoveries in galaxy GN-z11, which is one of the most distant and luminous galaxies known. They identified a supermassive bl… [+5930 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering the Dark: The Accelerating Universe and the Quest for Dark Energy - SciTechDaily", "description": "Dark energy's role in propelling the universe's accelerated expansion presents a pivotal challenge in astrophysics, driving ongoing research and space missions dedicated to uncovering the nature of this mysterious force. Some 13.8 billion years ago, the unive…", "url": "https://scitechdaily.com/deciphering-the-dark-the-accelerating-universe-and-the-quest-for-dark-energy/", "urlToImage": "https://scitechdaily.com/images/History-Universe-Infographic-scaled.jpg", "publishedAt": "2024-03-10T08:32:48Z", "content": "The history of the universe is outlined in this infographic. Credit: NASA\r\nDark energy’s role in propelling the universe’s accelerated expansion presents a pivotal challenge in astrophysics, driving … [+14562 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Katyanna Quach", "title": "An engine that can conjure thrust from thin air? We speak to the designer - The Register", "description": "Chatting to Anmol Taploo about the race to develop tech for satellites", "url": "https://www.theregister.com/2024/03/09/darpa_abep_project_interview/", "urlToImage": "https://regmedia.co.uk/2019/12/03/earth_atmosphere.jpg", "publishedAt": "2024-03-09T10:34:00Z", "content": "Interview Will satellites be capable of generating their own thrust with propellant created out of thin air one day? Scientists at the George Washington University (GWU) and Princeton Plasma Physics … [+4678 chars]"}]}