{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Herzindagi.com"}, "author": "Jyoti Sethi", "title": "After iPhone 15, iPhone 16 And 16 Pro Goes Viral: Launch Date, Images And Price In India Leaked - HerZindagi English", "description": "While the iPhone 15 created a buzz in the tech industry last year, recently, images of expected designs of iPhone 16 and 16 Pro were leaked. These pictures and details of Apple’s upcoming release have been going viral, know all about it.", "url": "https://www.herzindagi.com/society-culture/after-iphone-15-iphone-16-and-16-pro-goes-viral-launch-date-images-and-price-in-india-leaked-article-279495", "urlToImage": "https://images.herzindagi.info/image/2024/Apr/after-iphone-15-iphone-16-and-16-pro-goes-viral-launch-date-images-price-in-india.jpg", "publishedAt": "2024-04-30T11:56:33Z", "content": "While the iPhone 15 created a buzz in the tech industry last year, recently, images of expected designs of iPhone 16 and 16 Pro were leaked. These pictures and details of Apple’s upcoming release hav… [+2238 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Here's how setting up trackers on Google's new Find My Device app works - TechRadar", "description": "Quick and easy", "url": "https://www.techradar.com/phones/android/heres-how-setting-up-trackers-on-googles-new-find-my-device-app-works", "urlToImage": "https://cdn.mos.cms.futurecdn.net/EbEZeyxVxRtpbfxZT43sPg-1200-80.jpg", "publishedAt": "2024-04-30T11:25:04Z", "content": "The big upgrade to Google's Find My Device app is rolling out to users in the US and Canada right now, with third-party trackers due to go on sale next month – and we just got a video preview of how … [+2057 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Data From the Void: NASA Receives Laser Communications From 140+ Million Miles Away - SciTechDaily", "description": "NASA’s Deep Space Optical Communications experiment also interfaced with the Psyche spacecraft’s communication system for the first time, transmitting engineering data to Earth. Riding aboard NASA’s Psyche spacecraft, the agency’s Deep Space Optical Communica…", "url": "https://scitechdaily.com/data-from-the-void-nasa-receives-laser-communications-from-140-million-miles-away/", "urlToImage": "https://scitechdaily.com/images/Psyche-Spacecraft-Position-on-April-8-2024.jpg", "publishedAt": "2024-04-30T08:18:58Z", "content": "A team prepares NASA’s Psyche spacecraft for launch inside the Astrotech Space Operations Facility near the agency’s Kennedy Space Center in Florida on December 8, 2022. Psyche will launch atop a Spa… [+7846 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA satellite discovers ancient meteorite impact crater in Gujarat - HT Tech", "description": "NASA satellite discovers ancient meteorite impact crater in Gujarat NASAs Earth Observatory satellite recorded Luna crater in Kutch Gujarat. Geochemical analysis confirms meteorite impact. OLI on Landsat 8 captured Luna crater on February 24. NASA shared zoom…", "url": "https://tech.hindustantimes.com/web-stories/nasa-satellite-discovers-ancient-meteorite-impact-crater-in-gujarat-71714423118705.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/04/29/1600x900/Nasa_bada_1714424166671_1714424170620.jpg/", "publishedAt": "2024-04-29T22:50:17Z", "content": "NASA's Earth Observatory satellite recorded Luna crater in Kutch, Gujarat. Geochemical analysis confirms meteorite impact.\r\nOLI on Landsat 8 captured Luna crater on February 24. NASA shared zoomed im… [+424 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Turning Invisible Dark Matter Into Visible Light - SciTechDaily", "description": "Explorations in dark matter are advancing with new experimental techniques designed to detect axions, leveraging advanced technology and interdisciplinary collaboration to uncover the secrets of this elusive component of the cosmos. A ghost is haunting our un…", "url": "https://scitechdaily.com/turning-invisible-dark-matter-into-visible-light/", "urlToImage": "https://scitechdaily.com/images/Galaxy-Cluster-Cl-0024-17-1.jpg", "publishedAt": "2024-04-28T22:05:54Z", "content": "Galaxy cluster, left, with ring of dark matter visible, right. Credit: NASA, ESA, M. J. Jee and H. Ford (Johns Hopkins University)\r\nExplorations in dark matter are advancing with new experimental tec… [+5901 chars]"}]}