{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Time Reflection of Electromagnetic Waves Demonstrated in a Groundbreaking Experiment - SciTechDaily", "description": "The discovery establishes the foundations for revolutionary applications in wireless communications and optical computing. When we look in a mirror, we are used to seeing our faces looking back at us. The reflected images are produced by electromagnetic light…", "url": "https://scitechdaily.com/?p=260538", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Light-Beams-Time-Space-Curvature-Concept-Art.jpg", "publishedAt": "2023-03-16T13:04:56Z", "content": "ByAdvanced Science Research Center, GC/CUNYMarch 16, 2023\r\nScientists have conducted an experiment that demonstrates the time reflection of electromagnetic waves, which has potential implications for… [+4404 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Nisha Anand", "title": "Reddit user claims Samsung’s ‘space zoom’ Moon shots are ‘fake', company replies - Hindustan Times", "description": "Samsung in its blog has clarified the technology used behind AI deep learning for moon object recognition, in an apparent reply to a Reddit user's viral claim that the company is ‘leveraging the AI model to put craters and other details’.", "url": "https://www.hindustantimes.com/technology/after-reddit-user-claims-samsung-s-space-zoom-moon-shots-are-fake-company-responds-101678970279085.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/16/1600x900/samsung_moon_shots_1678970419933_1678970420117_1678970420117.jpg", "publishedAt": "2023-03-16T12:51:04Z", "content": "Samsung has apparently issued an explanation after a reddit users claim went viral on social media that its Galaxy series space zoom shots, especially those of the Moon, are fake and called its marke… [+2897 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Apple is reportedly experimenting with language-generating AI - TechCrunch", "description": "Multiple teams under Apple are reportedly experimenting with language generating AI models, including the Siri team.", "url": "https://techcrunch.com/2023/03/16/apple-is-reportedly-experimenting-with-language-generating-ai/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/01/GettyImages-1227849474.jpg?w=1024", "publishedAt": "2023-03-16T12:17:18Z", "content": "If not for last week’s Silicon Valley Bank (SVB) collapse almost every conversation in tech seems to be centered around AI and chatbots. In the last few days, Microsoft-backed OpenAI released a new l… [+2737 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Stunning! NASA James Webb Space Telescope snaps RARE sight of a DYING star - HT Tech", "description": "A rare sight of a Wolf-Rayet star has been captured by NASA's James Webb Space Telescope. Here is what the US Space agency explains.", "url": "https://tech.hindustantimes.com/tech/news/stunning-nasa-james-webb-space-telescope-snaps-rare-sight-of-a-dying-star-71678965782771.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/16/1600x900/stsci-01gtyana7snwzaftfrdhqb8chd_1678965839591_1678965858386_1678965858386.png", "publishedAt": "2023-03-16T11:30:15Z", "content": "NASA's James Webb Space Telescope is known for capturing amazing glimpses of the objects in space. Revealing one of the first observations made by the James Webb Telescope, NASA informed that the tel… [+2105 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "African Amphibians Threatened by Surge in Lethal Contagious Fungus - Technology Networks", "description": "A contagious and lethal fungus, Batrachochytrium dendrobatidis, has driven hundreds of amphibian species worldwide to extinction. Only amphibian species in Africa had so far escaped, but the present study shows that this reprieve is now likely over.", "url": "https://www.technologynetworks.com/immunology/news/african-amphibians-threatened-by-surge-in-lethal-contagious-fungus-371205", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/371205/african-amphibians-threatened-by-surge-in-lethal-contagious-fungus-371205-640x360.jpg?cb=20230316", "publishedAt": "2023-03-16T10:09:36Z", "content": "Researchers studied the prevalence of the fungus Batrachochytrium dendrobatidis (Bd) in a total of 16,900 historical and recent museum specimens, wild-living individuals, and literature records of am… [+6548 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Bing said to remove waitlist for its GPT-4 powered chat - TechCrunch", "description": "Microsoft has seemingly lifted the waitlist restrictions on Bing search engine's new GPT-4 powered chatbot experience.", "url": "https://techcrunch.com/2023/03/16/bing-said-to-remove-waitlist-for-its-gpt-4-powered-chat/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/02/chatgpt-bing.jpg?resize=1200,727", "publishedAt": "2023-03-16T07:00:59Z", "content": "Microsoft’s Bing is enjoying the spotlight for the first time in a decade after it released a GPT-powered interface last month. But the tech giant has so far been cautious about the pace at which it … [+1897 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Khushboo Gupta, Khushboo Gupta", "title": "Google Integrates Generative AI Features To Gmail And Docs In Google Workspace - MarkTechPost", "description": "Imagine traveling to some unknown destination without the help of Google Maps. Or not having access to your emails on Gmail when the workday begins. Yes, it seems improbable just to consider this concept! There is barely any aspect of our everyday lives that …", "url": "https://www.marktechpost.com/2023/03/15/google-integrates-generative-ai-features-to-gmail-and-docs-in-google-workspace/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/03/221-scaled.jpg", "publishedAt": "2023-03-16T06:37:55Z", "content": "Imagine traveling to some unknown destination without the help of Google Maps. Or not having access to your emails on Gmail when the workday begins. Yes, it seems improbable just to consider this con… [+5531 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Cesar Cadenas", "title": "ChatGPT lands on the Apple Watch and Siri should be worried - TechRadar", "description": "Petey can answer your tough questions in up to 14 languages", "url": "https://www.techradar.com/news/chatgpt-lands-on-the-apple-watch-and-siri-should-be-worried", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VWyyNXvU8gZKPjNh66K3Ng-1200-80.jpg", "publishedAt": "2023-03-16T05:00:28Z", "content": "Just a few months after its integration into Bing, ChatGPT has made the leap to iOS as a third-party app exclusively for the Apple Watch.\r\nIt’s called Petey - AI Assistant (opens in new tab) and it w… [+2564 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Microsoft-backed OpenAI starts release of powerful AI known as GPT-4 - Arab News", "description": "CALIFORNIA: The startup OpenAI on Tuesday said it is beginning to release a powerful artificial intelligence model known as GPT-4, setting the stage for human-like technology to proliferate and more competition between its backer Microsoft Corp. and Alphabet …", "url": "https://www.arabnews.com/node/2268816", "urlToImage": "https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2023/03/15/3725551-617208987.jpg?itok=C6fxXFML", "publishedAt": "2023-03-14T22:18:14Z", "content": "King Abdullah University of Science and Technology has launched Dear AI, an International Womens Day campaign and hackathon to tackle gender bias and the under-representation of women in artificial i… [+2871 chars]"}]}