{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Battles Superbugs: Helps Find New Antibiotic Drug To Combat Drug-Resistant Infections - SciTechDaily", "description": "The machine-learning algorithm identified a compound that kills Acinetobacter baumannii, a bacterium that lurks in many hospital settings. Using an artificial intelligence algorithm, researchers at MIT and McMaster University have identified a new antibiotic …", "url": "https://scitechdaily.com/ai-battles-superbugs-helps-find-new-antibiotic-drug-to-combat-drug-resistant-infections/", "urlToImage": "https://scitechdaily.com/images/Antibiotic-Destroying-Bacteria-Concept-Illustration.jpg", "publishedAt": "2023-05-27T16:03:13Z", "content": "ByAnne Trafton, Massachusetts Institute of TechnologyMay 27, 2023\r\nAI technology has helped MIT and McMaster University researchers identify a new antibiotic named abaucin, effective against Acinetob… [+9942 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Alchemy: Cellular Waste Transformed Into Essential Chemicals - SciTechDaily", "description": "A recent study uncovers a biochemical recycling process in animals that uses cellular waste to create vital chemicals, revolutionizing our understanding of animal and human functioning. This discovery opens up new research avenues for exploring over 100,000 u…", "url": "https://scitechdaily.com/natures-alchemy-cellular-waste-transformed-into-essential-chemicals/", "urlToImage": "https://scitechdaily.com/images/Natures-Biochemical-Recycling-Secrets.jpg", "publishedAt": "2023-05-27T14:44:26Z", "content": "In a recent Nature Chemical Biology article, researchers revealed a previously unknown biochemical recycling process in animals that uses cellular waste to produce new, vital chemicals. These chemica… [+2796 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Emergence of solvated dielectrons observed for the first time - Tech Explorist", "description": "Team generates low-energy electrons using ultraviolet light.", "url": "https://www.techexplorist.com/emergence-solvated-dielectrons-observed-first-time/60703/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/solvated-electrons.jpg", "publishedAt": "2023-05-27T11:00:03Z", "content": "Scientists have several theories about solvated dielectrons, but they have never made a direct observation of one. They are a pair of dissolved electrons in liquids like water or liquid ammonia. The … [+2432 chars]"}, {"source": {"id": null, "name": "CleanTechnica"}, "author": "Jennifer Sensiba", "title": "Two Charging Companies Respond To Ford’s Adoption Of The Tesla/NACS Plug - CleanTechnica", "description": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla was using its plug and everyone else was using the CCS1 plug …", "url": "https://cleantechnica.com/2023/05/27/two-charging-companies-respond-to-fords-adoption-of-the-tesla-nacs-plug/", "urlToImage": "http://cleantechnica.com/files/2023/05/Electrify-America-Station-With-Roof-2000x1000-1-800x400.png", "publishedAt": "2023-05-27T04:15:57Z", "content": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla w… [+7691 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Michelle Rae Uy", "title": "5 things I want to see on the rumored MacBook Air - TechRadar", "description": "Apple seriously needs to bring it", "url": "https://www.techradar.com/features/5-things-i-want-to-see-on-the-rumored-macbook-air", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JwXA3L4CdjzF6WUxNMfD9e-1200-80.jpg", "publishedAt": "2023-05-27T00:24:11Z", "content": "It’s kind of hard to get my hopes up about the rumored MacBook Air that Apple is allegedly launching at Apple's June 5 event. Don’t get me wrong; last year’s Air was pretty impressive – enough to ear… [+5014 chars]"}, {"source": {"id": null, "name": "Jwplayer.com"}, "author": null, "title": "Mars Helicopter Ingenuity Spots Perseverance Rover During Flight 51 - msnNOW", "description": "NASA's Mars helicopter Ingenuity flew for the 51st time. The Perseverance rover can be seen in the distance during the flight in an enhanced color image. Credit: Space.com | footage courtesy: NASA/JPL-Caltech | edited by Steve Spaleta", "url": "http://cdn.jwplayer.com/videos/ShiYw8eR-SEwM0BSG.mp4", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bJSoa.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-26T18:00:00Z", "content": "Like us on Facebook to see similar stories\r\nI'm already a fan, don't show this again"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Have Flipped the Script on Autism Genetics - SciTechDaily", "description": "Researchers from Cold Spring Harbor Laboratory (CSHL) have recently revised the commonly held genetic assumptions about autism spectrum disorder (ASD). For many years, scientists believed that siblings diagnosed with ASD tended to inherit more genetic traits …", "url": "https://scitechdaily.com/researchers-have-flipped-the-script-on-autism-genetics/", "urlToImage": "https://scitechdaily.com/images/DNA-Next-Generation-Genetics-Biotechnology.jpg", "publishedAt": "2023-05-26T08:45:49Z", "content": "ByCold Spring Harbor LaboratoryMay 26, 2023\r\nA recent study has found that siblings affected by autism inherit a greater proportion of their genetic material from their father rather than their mothe… [+4511 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "New volatile sunspot grows 4 times bigger than the Earth; Will it unleash a solar storm? - HT Tech", "description": "A new sunspot has emerged on the Sun, which has grown overnight to gain a size four times the size of the Earth. The sunspot likely harbors an unstable magnetic field and can explode, sparking a solar storm.", "url": "https://tech.hindustantimes.com/tech/news/new-volatile-sunspot-grows-4-times-bigger-than-the-earth-will-it-unleash-a-solar-storm-71685072205218.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/faintyoung_1652920721271_1685072261434.jpg", "publishedAt": "2023-05-26T03:42:37Z", "content": "As astronomers continue to monitor the sunspot AR3311 for any signs of eruption, a new sunspot is making a mark on the Sun. This new sunspot was practically invisible to the telescopes of NASA and th… [+2854 chars]"}]}