{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Unable To Pay Salaries, Byju's Founder Takes Loan Against His Home: Report - NDTV", "description": "Byju Raveendran, the eponymous founder of edtech titan Byju's, has pledged his home as well as those owned by his family members to raise money for paying employees as the company battles a cash crunch.", "url": "https://www.ndtv.com/india-news/byjus-crisis-deepens-founder-pledges-home-for-funds-to-pay-staff-salaries-report-4634360", "urlToImage": "https://c.ndtvimg.com/2023-12/l7j3u308_byju-raveendran-bloomberg_625x300_05_December_23.jpeg?ver-20231203.06", "publishedAt": "2023-12-05T02:02:19Z", "content": "Byju Raveendran has raised debts of about $400 million on a personal level. (File)\r\nByju Raveendran, the eponymous founder of edtech titan Byju's, has pledged his home as well as those owned by his f… [+1597 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "Newly discovered exoplanet is too big to exist - TechSpot", "description": "The ever-growing list of planets that shouldn't exist now includes LHS 3154b, a Neptune-sized exoplanet that appears to be too large for its host star. LHS 3154...", "url": "https://www.techspot.com/news/101047-newly-discovered-exoplanet-big-exist.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/12/2023-12-04-image-6.jpg", "publishedAt": "2023-12-04T18:18:53Z", "content": "The big picture: Protoplanetary disks require a sufficient amount of raw material to facilitate the formation of planets around a newborn star. The quantity of material present in the disk plays a cr… [+2333 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Alex Wilhelm", "title": "Spotify’s layoffs make sense when you consider its margins and market - TechCrunch", "description": "Spotify is simply tinkering with its economics so that it is more attractive to investors. That means it needs to pay fewer salaries.", "url": "https://techcrunch.com/2023/12/04/spotifys-layoffs-analysis/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1536251840-1-e1690195503226.jpg?resize=1200,675", "publishedAt": "2023-12-04T16:48:09Z", "content": "Spotify’s decision to lay off 17% of its staff is the leading technology story of the morning, and I wouldn’t fault you if you were a little confused why it is doing so. After all, the music streamin… [+793 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Kishalaya Kundu", "title": "Windows 11 23H2 update is affecting gaming performance, but Microsoft says there's a workaround - TechSpot", "description": "An affected user, Anant Acharya, complained about the reduced performance on the official Microsoft forums. He says the problem cropped up on his 2020 HP Pavilion laptop,...", "url": "https://www.techspot.com/news/101048-windows-11-23h2-update-affecting-gaming-performance-but.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2023/12/2023-12-04-image.jpg", "publishedAt": "2023-12-04T13:31:00Z", "content": "What just happened? Microsoft rolled out the Windows 11 23H2 update earlier this year, bringing a myriad of new features and fixes. However, some users who installed the update are now complaining th… [+2209 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Chill Factor” – The Volcanic Plot Twist in Dinosaur Extinction - SciTechDaily", "description": "McGill researchers challenge the current understanding of dinosaur extinction by unearthing a link between volcanic eruptions and climate change. What wiped out the dinosaurs? A meteorite plummeting to Earth is only part of the story, a new study suggests. Cl…", "url": "https://scitechdaily.com/chill-factor-the-volcanic-plot-twist-in-dinosaur-extinction/", "urlToImage": "https://scitechdaily.com/images/TRex-Dinosaur-Sunset-Extinction-Concept-Art.jpg", "publishedAt": "2023-12-04T02:59:27Z", "content": "Recent research suggests that volcanic eruptions, causing global cooling, significantly contributed to the dinosaurs’ extinction, challenging the long-held belief that a meteorite was the sole cause.… [+3405 chars]"}]}