{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Mysterious Disappearance of an Underwater Explorer in Antarctica - SciTechDaily", "description": "The unmanned underwater vehicle Ran has gone missing under a glacier in Antarctica. The vehicle, owned by the University of Gothenburg, is one of three similar in the whole world that is used for research and has contributed to important knowledge about the s…", "url": "https://scitechdaily.com/the-mysterious-disappearance-of-an-underwater-explorer-in-antarctica/", "urlToImage": "https://scitechdaily.com/images/AUV-Ran.jpg", "publishedAt": "2024-02-04T12:42:23Z", "content": "The AUV is programmed in advance and then sent out on long journeys under the glaciers of Antarctica. Credit: Anna Wåhlin\r\nThe unmanned underwater vehicle Ran has gone missing under a glacier in Anta… [+4377 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Saumya Nigam", "title": "Apple's upcoming Vision Pro Headset: The fusion of Mac and TV technology - India TV News", "description": "Apple has had mixed results courting developers. Netflix, one of the most popular consumer video apps, said late Friday it is not making a new app for the Vision Pro, though consumers can watch movies and series on the device's web browser.", "url": "https://www.indiatvnews.com/technology/news/apple-s-upcoming-vision-pro-headset-the-fusion-of-mac-and-tv-technology-2024-02-04-915208", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/02/apple-vision-pro-1707045586.jpg", "publishedAt": "2024-02-04T11:28:38Z", "content": "Apple's Vision Pro has the potential to revolutionize home entertainment and work technology by redefining how people watch television and use computers. Positioned as a potential successor to both t… [+4844 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Ide", "title": "OnePlus keeps swiping at Apple and Samsung – but is it doing enough itself? - TechRadar", "description": "Banter or bold strategy: OnePlus points out competitors' flaws", "url": "https://www.techradar.com/phones/oneplus-keeps-swiping-at-apple-and-samsung-but-is-it-doing-enough-itself", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bo2w68BGFpSUCzC7PMeuDB-1200-80.jpg", "publishedAt": "2024-02-04T11:01:10Z", "content": "OnePlus could be seen as throwing shade at its pseudo rivals Samsung and Apple after the launch of its new smartphones the OnePlus 12\r\n and OnePlus 12R\r\n. \r\nBut is it all banter or should the one-tim… [+6195 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysics in Crisis? Mystery Object Discovered That Could Change Everything - SciTechDaily", "description": "Astronomers discover a celestial object that defies classification, possibly uncovering a new type of cosmic entity at the edge of known physics. Sometimes astronomers come across objects in the sky that we can’t easily explain. In our new research, published…", "url": "https://scitechdaily.com/astrophysics-in-crisis-mystery-object-discovered-that-could-change-everything/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Mystery-Object-Art-Concept.jpg", "publishedAt": "2024-02-03T15:26:13Z", "content": "ByEwan D. Barr, Arunima Dutta, and Benjamin StappersFebruary 3, 2024Researchers have identified an enigmatic cosmic system that might contain an object bridging the gap between neutron stars and blac… [+6851 chars]"}]}