{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Pill-shaped cutout on iPhone 14 Pro is NOT for aesthetics, it has a BIG purpose - HT Tech", "description": "Apple may bring a major change in the iPhone 14 Pro models’ design with the the pill-shaped cutout. But it may have some useful features too. Here’s what.", "url": "https://tech.hindustantimes.com/mobile/news/pillshaped-cutout-on-iphone-14-pro-is-not-for-aesthetics-it-has-a-big-purpose-71662399858904.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/05/1600x900/Untitled_design_-_2022-09-01T134554.981_1662020898428_1662399994558_1662399994558.png", "publishedAt": "2022-09-05T17:47:25Z", "content": "Since long, the iPhone 14 Pro models have been rumoured to feature a new large pill-shaped cutout that will lead to the abandonment of the age-old notch. However, you will be surprised to know, the n… [+1800 chars]"}, {"source": {"id": null, "name": "BikeRadar.com"}, "author": "Katherine Moore", "title": "Do you need a dropper post on your gravel bike? And 4 of the best - BikeRadar", "description": "An essential for technical off-road riding or an unnecessary gadget?", "url": "https://www.bikeradar.com/advice/buyers-guides/best-gravel-dropper-posts/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/21/2019/07/Vielo-V1-05-0e7f92c.jpg?quality=90&resize=620,413", "publishedAt": "2022-09-05T17:00:35Z", "content": "A dropper post is a seatpost that can be lowered via the actuation of a lever, typically located on the handlebar, to allow you to drop the height of the saddle. This adjustment gives the rider a gre… [+12288 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Andrea E. San Juan", "title": "TMP Tech hosts TVET trainers in Asia-Pacific | Andrea E. San Juan - BusinessMirror", "description": "Toyota Motor Philippines School of Technology (TMP Tech) said it recently hosted a week-long technical training for the representatives of 13 countries, including the Philippines, which aims to upgrade technical-vocational education and training (TVET) system…", "url": "https://businessmirror.com.ph/2022/09/06/tmp-tech-hosts-tvet-trainers-in-asia-pacific/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2022/01/toyota-motor-corp.01.jpg", "publishedAt": "2022-09-05T16:10:20Z", "content": "Toyota Motor Philippines School of Technology (TMP Tech) said it recently hosted a week-long technical training for the representatives of 13 countries, including the Philippines, which aims to upgra… [+2895 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ultra-Processed Foods Linked With Heart Disease, Bowel Cancer and Death - SciTechDaily", "description": "Findings add further evidence in support of policies that limit ultra-processed foods. Two large research studies published by The BMJ last week find links between high consumption of ultra-processed foods and increased risks of cardiovascular disease, bowel …", "url": "https://scitechdaily.com/ultra-processed-foods-linked-with-heart-disease-bowel-cancer-and-death/", "urlToImage": "https://scitechdaily.com/images/Hot-Dog-and-Chips.jpg", "publishedAt": "2022-09-05T14:12:08Z", "content": "Newly published research links high consumption of ultra-processed foods and increased risks of cardiovascular disease, colorectal cancer, and death.\r\nFindings add further evidence in support of poli… [+5981 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s biggest airport closes a runway after fire - BusinessTech", "description": "Johannesburg’s OR Tambo International Airport was forced to close one of its runways after dry grass caught fire and “spilled over from the adjacent community within the airport precinct,” it said via Twitter.", "url": "https://businesstech.co.za/news/business/622883/south-africas-biggest-airport-closes-a-runway-after-fire/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/05/SAA-e1653633139459.jpg", "publishedAt": "2022-09-05T11:52:58Z", "content": "Johannesburgs OR Tambo International Airport was forced to close one of its runways after dry grass caught fire and spilled over from the adjacent community within the airport precinct, it said via T… [+687 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rebecca Whittaker", "title": "The bizarre techniques that could help YOU lose weight - Daily Mail", "description": "For anyone struggling to ditch a dress size, experts claim that there's a plethora of quirky hacks that could be of assistance, such as eating from red and small plates.", "url": "https://www.dailymail.co.uk/health/article-11170261/The-bizarre-techniques-help-lose-weight.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/05/10/62066199-0-image-a-11_1662371631584.jpg", "publishedAt": "2022-09-05T11:17:08Z", "content": "Eating your greens, scrapping takeaways and hitting the gym are the obvious go-to options in the quest to lose weight.\r\nBut for anyone struggling to ditch a dress size, experts claim that there's a p… [+12900 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Diamonds, diamonds everywhere across the universe! Yes, it is raining diamonds out in space - HT Tech", "description": "Research has revealed that it could be raining diamonds on planets throughout the universe. Check details here.", "url": "https://tech.hindustantimes.com/tech/news/diamonds-diamonds-everywhere-across-the-universe-yes-it-is-raining-diamonds-out-in-space-71662374036766.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/05/1600x900/ore-5398849_960_720_1662374101102_1662374128739_1662374128739.jpg", "publishedAt": "2022-09-05T10:38:07Z", "content": "What comes to your mind with the word 'diamonds'? A gem, diamond jewellery, one of the hardest objects around or something else? What if we tell you that diamonds could be raining on planets througho… [+1912 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "One of South Africa’s biggest retailers has major plans to create jobs and open new stores - BusinessTech", "description": "Listed retailer The Foschini Group (TFG) says that the final Competition Commission approval for its acquisition of Tapestry Home Brands will allow it to apply its localisation strategy to furniture manufacturing, with significant job-creation and supply chai…", "url": "https://businesstech.co.za/news/business/622829/one-of-south-africas-biggest-retailers-has-major-plans-to-create-jobs-and-open-new-stores/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/09/FoschiniGroup-e1662371485351.jpg", "publishedAt": "2022-09-05T10:20:25Z", "content": "Listed retailer The Foschini Group (TFG) says that the final Competition Commission approval for its acquisition of Tapestry Home Brands will allow it to apply its localisation strategy to furniture … [+5331 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jupiter's Complex Colors Revealed in Stunning Images From NASA's Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft observed the complex colors and structure of Jupiter’s clouds on July 5, 2022, as it completed its 43rd close flyby of the giant planet. Citizen scientist Björn Jónsson from Iceland created these two images using raw data from the JunoC…", "url": "https://scitechdaily.com/jupiters-complex-colors-revealed-in-stunning-images-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Jupiters-Complex-Colors-Processed.jpg", "publishedAt": "2022-09-05T09:31:54Z", "content": "ByNASASeptember 5, 2022\r\nThe image was processed to portray the approximate colors that the human eye would see from Junos vantage point. Credit: Image data: NASA/JPL-Caltech/SwRI/MSSS, Image process… [+2873 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa has more than load shedding to worry about: economists - BusinessTech", "description": "Weeks of load shedding and the flooding in KwaZulu Natal are expected to be the key drivers behind a decline in economic growth for the second quarter of this year, say economists at the Bureau for Economic Research (BER) – however, the country’s worries exte…", "url": "https://businesstech.co.za/news/finance/622711/south-africa-has-more-than-load-shedding-to-worry-about-economists/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Rand-Bloomberg.jpg", "publishedAt": "2022-09-05T07:19:14Z", "content": "Weeks of load shedding and the flooding in KwaZulu Natal are expected to be the key drivers behind a decline in economic growth for the second quarter of this year, say economists at the Bureau for E… [+3593 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Good news for jobs in South Africa, says Ramaphosa - BusinessTech", "description": "Writing in his weekly letter to the public, Ramaphosa said that South Africa’s economy and society have proven to be resilient, and indications are that the economy is showing encouraging signs of recovery.", "url": "https://businesstech.co.za/news/government/622687/good-news-for-jobs-in-south-africa-says-ramaphosa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Ramaphosa-17.png", "publishedAt": "2022-09-05T06:48:34Z", "content": "Amid formidable challenges facing South Africa, including an energy crisis, the latest employment figures give grounds for cautious hope, says President Cyril Ramaphosa.\r\nWriting in his weekly letter… [+3631 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Covid app that detects virus in your voice 'more accurate than lateral flow tests' - The Telegraph", "description": "Technology could be used to quickly screen people before mass events or in poor countiries that can't afford PCR tests", "url": "https://www.telegraph.co.uk/news/2022/09/04/covid-app-detects-virus-voice-accurate-lateral-flow-tests/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/09/04/TELEMMGLPICT000306133375_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwSX5rhseiWKOo9p9OQ-ymek.jpeg?impolicy=logo-overlay", "publishedAt": "2022-09-04T22:01:00Z", "content": "An app that can detect coronavirus in your voice has been developed in a major scientific breakthrough.\r\nThe AI-powered technology is easier to use and more accurate than a lateral flow test, scienti… [+4352 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Griffin Davis", "title": "Will Earth De-Orbit From Solar System? Aerospace Engineer Shares His Explanation - Tech Times", "description": "An aerospace engineer shares his explanation regarding its possibility.", "url": "https://www.techtimes.com/articles/280070/20220904/will-earth-de-orbit-solar-system-aerospace-engineer-shares-explanation.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/410887/will-earth-de-orbit-from-solar-system-aerospace-engineer-shares-his-explanation.jpg", "publishedAt": "2022-09-04T16:22:36Z", "content": "Will Earth de-orbit from the solar system? This is one of the things that can end the life of the planet. \r\nFor the past few years, many individuals have speculated that Earth can move away from its … [+2971 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Are One Step Closer to Discovering the Origin of the Moon - SciTechDaily", "description": "An additional clue to the Moon's origin. The Moon has always been a topic of interest for humans. But it wasn't until Galileo's time that researchers started to study it seriously. Throughout the course of nearly five hundred years, researchers have proposed …", "url": "https://scitechdaily.com/scientists-are-one-step-closer-to-discovering-the-origin-of-the-moon/", "urlToImage": "https://scitechdaily.com/images/Moon-Earth-Sun.gif", "publishedAt": "2022-09-03T23:41:11Z", "content": "ByETH ZurichSeptember 3, 2022\r\nThe currently most widely accepted theory about the Moons origins is the giant-impact theory. It proposes that the Moon was created by Earth colliding with another plan… [+5495 chars]"}]}