{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Step Backward: Wildfires Undo 20 Years of Air Quality Progress in Western U.S. - SciTechDaily", "description": "Study finds that fire-prone areas and downwind regions have seen an increase in premature deaths. You need only to remember last summer’s wildfires in the United States and Canada, which fouled the air from coast to coast, to know the effects these blazes can…", "url": "https://scitechdaily.com/a-step-backward-wildfires-undo-20-years-of-air-quality-progress-in-western-u-s/", "urlToImage": "https://scitechdaily.com/images/United-States-Wildfires-Pollution-Art.jpg", "publishedAt": "2023-12-07T14:16:24Z", "content": "Wildfires over two decades have severely impacted air quality in the western U.S., increasing health risks and negating efforts to reduce pollution, with a conservative estimate of 670 extra prematur… [+5906 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Sarah Whelan, PhD", "title": "139 Genes Set Human Cognitive Ability Apart From Other Primates - Technology Networks", "description": "A group of 139 genes commonly expressed in primate brains – which underwent evolutionary divergence only in human brains – may be the source of our unique cognitive abilities according to a study led by the University of Toronto.", "url": "https://www.technologynetworks.com/genomics/news/139-genes-set-human-cognitive-ability-apart-from-other-primates-381787", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/381787/139-genes-set-human-cognitive-ability-apart-from-other-primates-381787-640x360.jpg?cb=20231207", "publishedAt": "2023-12-07T13:53:00Z", "content": "A group of 139 genes commonly expressed in primate brains which underwent evolutionary divergence only in human brains may be the source of our unique cognitive abilities according to a study led by … [+3320 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "NASA working with industry to advance inflatable heat shield technology - SpaceNews", "description": "The success of a NASA project last year to demonstrate an inflatable heat shield has attracted interest from several companies.", "url": "https://spacenews.com/nasa-working-with-industry-to-advance-inflatable-heat-shield-technology/", "urlToImage": "https://spacenews.com/wp-content/uploads/2022/11/loftid-ondeck-1.jpg", "publishedAt": "2023-12-07T12:41:08Z", "content": "WASHINGTON The success of a NASA project last year to demonstrate an inflatable heat shield has attracted interest from several companies who are working with the agency to advance the technology.\r\nN… [+2808 chars]"}]}