{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 spectacular images of celestial wonders captured on Hubble Space Telescope shared by NASA - HT Tech", "description": "Top 5 spectacular images of celestial wonders captured on Hubble Space Telescope shared by NASA Explore the cosmos through the lens of the Hubble Space Telescope as NASA shares top 5 images of celestial wonders. From galaxies to auroras each image reveals cap…", "url": "https://tech.hindustantimes.com/web-stories/top-5-spectacular-images-of-celestial-wonders-captured-on-hubble-space-telescope-shared-by-nasa-71716285192689.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/21/1600x900/Top_5_spectacular_images_of_celestial_wonders__1716285350597_1716285350970.jpg/", "publishedAt": "2024-05-21T10:00:50Z", "content": "Photo Credit: Pixabay\r\n Explore the cosmos through the lens of the Hubble Space Telescope as NASA shares top 5 images of celestial wonders. From galaxies to auroras, each image reveals captivating in… [+1675 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Cracks Case of Puffy “Microwaved Marshmallow” Exoplanet - SciTechDaily", "description": "A surprising deficiency of methane suggests that tidal heating has puffed up the atmosphere of the warm gas giant WASP-107 b. Why is the warm gas-giant exoplanet WASP-107 b so, so puffy? With a moderate temperature and an ultra-low density on par with a micro…", "url": "https://scitechdaily.com/webb-space-telescope-cracks-case-of-puffy-microwaved-marshmallow-exoplanet/", "urlToImage": "https://scitechdaily.com/images/Neptune-Like-Exoplanet-Art-Concept.jpg", "publishedAt": "2024-05-21T08:22:31Z", "content": "The warm gas giant WASP-107 b, known for its unusually low density and moderate temperature, may have its puffed-up atmosphere due to tidal heating that warms its interior more than previously though… [+10552 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars in a Flash: How Pulsed Plasma Rockets Are Revolutionizing Space Travel - SciTechDaily", "description": "Howe Industries' PPR could transform space exploration with its high thrust and specific impulse, enabling faster Mars missions and safe transport through enhanced shielding. The future of a space-faring civilization will depend on the ability to move both ca…", "url": "https://scitechdaily.com/mars-in-a-flash-how-pulsed-plasma-rockets-are-revolutionizing-space-travel/", "urlToImage": "https://scitechdaily.com/images/Futuristic-Rocket-Propulsion-Spaceship-Art-Concept.jpg", "publishedAt": "2024-05-21T05:30:28Z", "content": "Howe Industries is developing a Pulsed Plasma Rocket (PPR) capable of producing 100,000 N of thrust with a specific impulse of 5,000 seconds, promising to revolutionize space travel by enabling faste… [+2408 chars]"}, {"source": {"id": null, "name": "Athlon Sports"}, "author": "Athlon Sports", "title": "Caitlin Clark Trending After Picking Up First WNBA Technical Foul - Athlon Sports", "description": null, "url": "https://athlonsports.com/wnba/caitlin-clark-trending-first-wnba-technical-foul-fever-sun", "urlToImage": null, "publishedAt": "2024-05-21T01:05:12Z", "content": null}]}