{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Universe Today"}, "author": "Mark Thompson", "title": "A Fibre Optic Breakthrough Reveals the Universe in Sharper Detail - Universe Today", "description": "Astronomers have discovered a clever way to make a single telescope capture sharper details than should be physically possible. The technique involves feeding starlight through a special optical fibre called a photonic lantern. Anyone else thinking of a certa…", "url": "https://www.universetoday.com/articles/a-fibre-optic-breakthrough-reveals-the-universe-in-sharper-detail", "urlToImage": "https://www.universetoday.com/article_images/asymmetric-disc-around-b-cmi_copy_20251027_082809.jpg", "publishedAt": "2025-10-27T08:28:00Z", "content": "When astronomers want to see the finest details, they typically face a fundamental limitation, the size of their telescope. Bigger telescopes capture more light but also reveal a finer level of detai… [+2934 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Andrew Jones", "title": "HEO’s satellite-to-satellite imaging uncovers secrets of Chinese tech-test spacecraft - SpaceNews", "description": "HEO’s satellite-to-satellite imaging uncovers secrets of Chinese tech-test spacecraft Australian company HEO has imaged and modeled a mystery Chinese satellite prior to its reentry into Earth’s atmosphere, revealing previously unknown details about the spacec…", "url": "http://spacenews.com/heos-satellite-to-satellite-imaging-uncovers-secrets-of-chinese-tech-test-spacecraft/", "urlToImage": "https://i0.wp.com/spacenews.com/wp-content/uploads/2025/10/multispectral_0_10_1950_1000_150_20241105-135441-vectors.png?fit=1000%2C1000&ssl=1", "publishedAt": "2025-10-27T05:03:44Z", "content": "HELSINKI Australian company HEO has imaged and modeled a mystery Chinese satellite prior to its reentry into Earths atmosphere, revealing previously unknown details about the spacecraft.\r\nXinjishu Ya… [+3835 chars]"}]}