{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Are Your Sleep Habits Putting You at Risk for a Stroke? Find Out Now! - SciTechDaily", "description": "Study finds the amount of sleep, snoring, and sleep apnea are linked to higher stroke risk. A new study in Neurology finds an association between sleep problems and an increased risk of stroke. Researchers emphasize the importance of addressing sleep issues f…", "url": "https://scitechdaily.com/?p=266634", "urlToImage": "https://scitechdaily.com/images/Smartphone-Media-Bed-Sleep.jpg", "publishedAt": "2023-04-07T12:39:57Z", "content": "A study published in the scientific journal Neurology suggests that people with sleep problems may be at a higher risk of having a stroke. Sleep problems include getting too much or too little sleep,… [+4732 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "STUNNING! NASA James Webb Space Telescope snaps ice giant Uranus - HT Tech", "description": "An amazing image of the solar system's other ice giant, the planet Uranus has been captured by NASA's James Webb Space Telescope.", "url": "https://tech.hindustantimes.com/tech/news/stunning-nasa-james-webb-space-telescope-snaps-ice-giant-uranus-71680868195355.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/07/1600x900/stsci-01gwqdqcs9rf0dxmrvq49k4k3b_1680868262798_1680868282662_1680868282662.png", "publishedAt": "2023-04-07T11:53:30Z", "content": "Our solar system comprises eight planets and the images of every planet is amazing to look at. Now, following in the footsteps of the Neptune image released in 2022, NASA's James Webb Space Telescope… [+3384 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "301-foot Asteroid 2023 FY13 rushing towards Earth, says NASA; speeding at a scary 42923 kmph - HT Tech", "description": "NASA has revealed information about an asteroid which is expected to pass Earth soon. Know details such as its speed, distance and more.", "url": "https://tech.hindustantimes.com/tech/news/301foot-asteroid-2023-fy13-rushing-towards-earth-says-nasa-speeding-at-a-scary-42923-kmph-71680842707046.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/07/1600x900/asteroid_wiki_media_1679805029207_1680843092281_1680843092281.jpg", "publishedAt": "2023-04-07T04:52:41Z", "content": "Asteroid 2023 FY13 is on way and it is set to have a close encounter with Earth. Apart from tracking asteroids to get early warning about those that pose a threat to earth, scientists also study them… [+1889 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! M3-class solar flare sparks blackouts over Indian Ocean - HT Tech", "description": "A M3-class solar flare erupted on the Sun and it caused radio blackouts over the Indian Ocean region. Astronomers fear that it can also lead to another solar storm in the coming days.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-m3-class-solar-flare-sparks-blackouts-over-indian-ocean-71680839276196.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/07/1600x900/solar-flare-67532_1920_1_1663740280289_1680839304186_1680839304186.jpg", "publishedAt": "2023-04-07T03:52:18Z", "content": "The Earth might have lucked out on Wednesday when it narrowly escaped the incoming wave of a coronal mass ejection (CME) cloud and avoided a solar storm event. However, things took a turn for the wor… [+2308 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Obesity Breakthrough: Biologists Discover How To Counteract Effects of High-Fat Diet - SciTechDaily", "description": "Biologists discover removing a protein inhibitor restores metabolic balance. UC Irvine biologists found that removing the SAPS3 component in mice allowed them to maintain a normal energy balance despite consuming a high-fat diet. This discovery could lead to …", "url": "https://scitechdaily.com/obesity-breakthrough-biologists-discover-how-to-counteract-effects-of-high-fat-diet/", "urlToImage": "https://scitechdaily.com/images/Variety-Unhealthy-Junk-Food.jpg", "publishedAt": "2023-04-07T01:47:01Z", "content": "ByUniversity of California - IrvineApril 6, 2023\r\nUniversity of California, Irvine biologists have discovered that by eliminating the SAPS3 component of the AMPK protein complex, mice were able to ma… [+4434 chars]"}]}