{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Smartwatches under 5000 with calling feature: boAt Watch Primia to Fire-Boltt Tornado, check them out - HT Tech", "description": "A smartwatch with Bluetooth calling and other smart features under 5000? There are several options. The list includes Realme, boAt, to Noise.", "url": "https://tech.hindustantimes.com/wearables/news/smartwatches-under-5000-with-calling-feature-boat-watch-primia-to-fire-boltt-tornado-check-them-out-71656823267682.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/03/1600x900/Untitled_design_(26)_(1)_1656740921392_1656823768156.jpg", "publishedAt": "2022-07-03T04:49:46Z", "content": "Looking for a smartwatch that lets you call and have a budget of under Rs. 5,000? Then you are at the right place! We have collated a list of smartwatches that offer Bluetooth calling feature under R… [+2005 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Ariston goes renewable with water heaters, saves 75% energy cost - Guardian Nigeria", "description": "Considering the power situation in the country, Ariston, an operator in the thermal comfort industry, has introduced new water heater technologies that can save about 75 per cent energy cost...", "url": "https://guardian.ng/business-services/business/ariston-goes-renewable-with-water-heaters-saves-75-energy-cost/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/07/Ariston.jpg", "publishedAt": "2022-07-03T03:39:00Z", "content": "Head of Sales, Central Africa, Ariston Group, Solomon Umoh (left); Director, Central Africa, Ariston Group, Richmond Aguiar and Head of Marketing, Central Africa, Ariston Group, Habeeb Somoye during … [+27 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Developed AI Identifies the Shortest Path to Human Happiness - SciTechDaily", "description": "Deep Longevity, in collaboration with Harvard Medical School, presents a deep learning approach to mental health Deep Longevity has published a paper in Aging-US outlining a machine learning approach to human psychology in collaboration with Nancy Etcoff, Ph.…", "url": "https://scitechdaily.com/harvard-developed-ai-identifies-the-shortest-path-to-human-happiness/", "urlToImage": "https://scitechdaily.com/images/Colorful-Human-Brain-Illustration.jpg", "publishedAt": "2022-07-03T02:26:39Z", "content": "The researchers created a digital model of psychology aimed to improve mental health. The system offers superior personalization and identifies the shortest path toward a cluster of mental stability … [+4096 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Lisa Eadicicco", "title": "The iPhone's Next Breakthrough Features May Depend on These Technologies - CNET", "description": "Apple's smartphone just turned 15. Lidar and AI could play a big role in where the iPhone goes next, experts say.", "url": "https://www.cnet.com/tech/mobile/features/iphones-next-breakthrough-features-may-depend-these-technologies/", "urlToImage": "https://www.cnet.com/a/img/resize/518d49903cdde5377b60cec582d70910305bc6f7/hub/2022/06/27/d54290c3-0635-407e-b421-28214ffa78ef/breakthough-iphone-technologies-static.png?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2022-07-02T23:28:00Z", "content": "For Lucy Edwards, a blind, UK-based journalist and broadcaster, maintaining a social distance in public during the height of the pandemic was challenging. That's why she tried People Detection, a fea… [+10791 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max camera test: why one is my favorite - Techradar", "description": "Only one goes the distance", "url": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-vs-iphone-13-pro-max-camera-test-why-one-is-my-favorite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rAdwiUFK4N9nSPmbKfRonR-1200-80.jpg", "publishedAt": "2022-07-02T15:00:34Z", "content": "If you've got money to burn and want to buy a smartphone that's top of its league for photography, you've basically got two choices.\r\nThe Samsung Galaxy S22 Ultra and iPhone 13 Pro Max are both good … [+8365 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "https://wusfnews.wusf.usf.edu/people/melissa-block", "title": "YouTube Minecraft player Technoblade — now also known as Alex — dies from cancer - WUSF News", "description": "One of the most popular Minecraft players on YouTube, known as \"Technoblade,\" died this week after a battle with cancer. In a farewell message, he finally divulged his first name: Alex.", "url": "https://wusfnews.wusf.usf.edu/2022-07-02/youtube-minecraft-player-technoblade-now-also-known-as-alex-dies-from-cancer", "urlToImage": null, "publishedAt": "2022-07-02T13:43:00Z", "content": "MELISSA BLOCK, HOST:\r\nHe was known to his adoring fans as Technoblade, a young YouTuber who streamed himself playing Minecraft, the world-building fantasy game. He was good at it, winning 1,800 games… [+1373 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom nears record for worst year of load shedding ever – and there’s still 6 months to go - BusinessTech", "description": "South Africa’s crippling power cuts are approaching an annual record, and there are still six months to go.", "url": "https://businesstech.co.za/news/energy/602458/eskom-nears-record-for-worst-year-of-load-shedding-ever-and-theres-still-6-months-to-go/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/05/shutterstock_2087276251-e1652347489408.jpg", "publishedAt": "2022-07-02T06:27:23Z", "content": "South Africas crippling power cuts are approaching an annual record, and there are still six months to go.\r\nSpurred by an illegal strike this week that added to its woes, utility Eskom Holdings SOC L… [+952 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Soft' CRISPR may offer a new fix for genetic defects: Targeted repairs with 'nicks' of single DNA strands provide foundation for novel disease therapies - Science Daily", "description": "Scientists have developed a new CRISPR-based technology that could offer a safer approach to correcting genetic defects. The new 'soft' CRISPR approach makes use of natural DNA repair machinery, providing a foundation for novel gene therapy strategies with th…", "url": "https://www.sciencedaily.com/releases/2022/07/220701143121.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-07-01T19:14:15Z", "content": "Curing debilitating genetic diseases is one of the great challenges of modern medicine. During the past decade, development of CRISPR technologies and advancements in genetics research brought new ho… [+4572 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "How The Top 5 African Wearable Brands Fared In the Ist Quarter Of 2022 - Techpoint Africa", "description": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report", "url": "https://techpoint.africa/2022/07/01/how-the-top-5-african-wearable-brands-fared-in-the-ist-quarter-of-2022", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image.jpeg", "publishedAt": "2022-07-01T13:16:42Z", "content": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report on the Africans wearable market analysis… [+4227 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "Oraimo Watch Pro vs Samsung Galaxy Watch 4 - Techpoint Africa", "description": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart", "url": "https://techpoint.africa/2022/07/01/oraimo-watch-pro-vs-samsung-galaxy-watch-4", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image-1.png", "publishedAt": "2022-07-01T13:11:27Z", "content": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart watches on the market, you may be confused wh… [+3122 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "Simpli ACV Keto Gummies Reviews (Weight Loss 2022) Simply Health ACV Gummies | HIDDEN DANGER Revealed? - The Week", "description": "Latest news from India, World, Entertainment, Science, Health and Technology", "url": "https://www.theweek.in", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-07-01T10:26:47Z", "content": "Punjab Cong MLA Khaira claims tax evasion scam of Rs 44,000 crore"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Following a Fungus From Genes to Tree Disease - a Journey in Science - AllAfrica - Top Africa News", "description": "Analysis - Anyone who reads even a little about science and technology will be familiar by now with the idea of genome sequencing. This process involves breaking an organism's DNA into fragments to study their compositions or sequences. Then the fragments are…", "url": "https://allafrica.com/stories/202207010160.html", "urlToImage": "https://cdn06.allafrica.com/download/pic/main/main/csiid/00610063:c49083765319d180a201976817ab40de:arc614x376:w1200.jpg", "publishedAt": "2022-07-01T07:45:49Z", "content": "Anyone who reads even a little about science and technology will be familiar by now with the idea of genome sequencing. This process involves breaking an organism's DNA into fragments to study their … [+5924 chars]"}]}