{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ashutosh Kumar, Muntazir Abbas, ET Telecom", "title": "Realme banks on new P-series, to hit 50 million smartphone sales mark on Flipkart - ETTelecom", "description": "Das said the smartphone lineup aims to democratise access to modern technology by offering segment-leading performance and display features. “We are targeting tech-savvy users. They look at products with maximum technology and features that are available in t…", "url": "https://telecom.economictimes.indiatimes.com/news/devices/realme-banks-on-new-p-series-to-hit-50-million-smartphone-sales-mark-on-flipkart/109119453", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-109119453,imgsize-315918,width-1200,height=765,overlay-ettelecom/devices/realme-banks-on-new-p-series-to-hit-50-million-smartphone-sales-mark-on-flipkart.jpg", "publishedAt": "2024-04-08T04:30:00Z", "content": "Tarini P Das, Director Sales and Business Development at Realme India.\r\nNEW DELHI: Realme expects its new P-series line-up would help it achieve a cumulative sale of 50 million smartphones on the e-c… [+3280 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Spotify launches personalized AI playlists that you can build using prompts - TechCrunch", "description": "AI playlists will initially become available to users on Android and iOS devices in the U.K. and Australia and will be iterated on in the months ahead.", "url": "https://techcrunch.com/2024/04/07/spotify-launches-personalized-ai-playlists-you-can-build-using-prompts/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/04/FTR-Header-AI-Playlist-1.png?resize=1200,683", "publishedAt": "2024-04-08T04:00:00Z", "content": "Spotify already found success with its popular AI DJ feature, and now the streaming music service is bringing AI to playlist creation. The company on Monday introduced AI playlists into beta, a new o… [+3923 chars]"}, {"source": {"id": null, "name": "Unherd.com"}, "author": "David Swift", "title": "A new culture war is brewing over autism and ADHD - UnHerd", "description": "When the National Health Service was founded in 1948, the then Health Secretary Aneurin Bevan optimistically argued that expenditure would fall over time, as the population grew healthier and technology advanced. Within a few years this early optimism proved …", "url": "http://unherd.com/newsroom/a-new-culture-war-is-brewing-over-autism-and-adhd/", "urlToImage": "https://unherd.com/wp-content/uploads/2024/04/Screenshot-2024-04-07-at-12.21.55.jpeg", "publishedAt": "2024-04-07T13:04:24Z", "content": "When the National Health Service was founded in 1948, the then Health Secretary Aneurin Bevan optimistically argued that expenditure would fall over time, as the population grew healthier and technol… [+2891 chars]"}]}