{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Pharmaceutical Technology"}, "author": "Akosua Mireku", "title": "FDA grants GSK first-ever approval for RSV vaccine - Pharmaceutical Technology", "description": "Amidst steep competition, GSK’s Arexvy becomes the first approved RSV vaccine worldwide for preventing RSV in older adults.", "url": "http://www.pharmaceutical-technology.com/news/fda-grants-gsk-first-ever-approval-for-rsv-vaccine/", "urlToImage": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/24/2023/05/GSK-RSV-Vaccine-Image.jpg", "publishedAt": "2023-05-04T14:02:03Z", "content": "After a winter marked by a rise in hospitalisations due to the RSV, the FDA has granted its first approval for an Respiratory Syncytial Virus (RSV) vaccine to GSKs Arexvy for adults ages 60 years and… [+2291 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Paul Sawers", "title": "Shopify to reduce workforce by 20%, sells logistics business to Flexport for 13% equity - TechCrunch", "description": "Shopify is laying off 20% of its workforce, impacting some 2,000 people, and is selling its logistics business to Flexport for 13% in stock.", "url": "https://techcrunch.com/2023/05/04/shopify-to-reduce-workforce-by-20-sells-logistics-business-to-flexport-for-13-equity/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/ShopifyIPO2.jpg?resize=1200,800", "publishedAt": "2023-05-04T12:32:21Z", "content": "Shopify revealed today that it’s laying off 20% of its workforce, impacting more than 2,000 people, and is selling its logistics business to Flexport for roughly 13% in stock.\r\nThe news comes some 10… [+4235 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Russia's War in Ukraine Latest News Updates: May 4, 2023 - Bloomberg", "description": "The European Union is considering ways to target third countries seen as doing too little to stop Russia evade sanctions, particularly those that can’t explain spikes in trade of key goods or technologies, according to people familiar with the matter.", "url": "https://www.bloomberg.com/news/articles/2023-05-04/ukraine-latest-kyiv-shoots-down-drones-zelenskiy-to-the-hague", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i9KnYXxsIlMc/v1/1200x800.jpg", "publishedAt": "2023-05-04T11:13:45Z", "content": "The European Union is considering ways to target third countries seen as doing too little to stop Russia evade sanctions, particularly those that can’t explain spikes in trade of key goods or technol… [+356 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "COLOSSAL 180-foot asteroid speeding towards Earth at 81907 kmph today, NASA warns - HT Tech", "description": "NASA has issued a warning regarding an asteroid that is rushing towards a very close approach to Earth. This 180-foot wide asteroid has been named 2023 HZ4.", "url": "https://tech.hindustantimes.com/tech/news/colossal-180-foot-asteroid-speeding-towards-earth-at-81907-kmph-today-nasa-warns-71683196191393.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/04/1600x900/asteroid-6155562_640_1683023354133_1683196353840.jpg", "publishedAt": "2023-05-04T10:33:14Z", "content": "An enormous asteroid is currently headed towards Earth, and what's concerning is that it's predicted to come perilously close! According to NASA's Jet Propulsion Laboratory, three asteroids are due t… [+1763 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Eta Aquariid Meteor Shower Outburst Peak – Up to 160 Meteors per Hour - SciTechDaily", "description": "The eta Aquariid meteor shower, peaking on the morning of May 5, promises an outburst year with up to 160 meteors per hour. Despite the full moon, bright fireballs make it worth watching, especially in the Southern Hemisphere between 3-4 a.m. and dawn. The et…", "url": "https://scitechdaily.com/dont-miss-eta-aquariid-meteor-shower-outburst-peak-up-to-160-meteors-per-hour/", "urlToImage": "https://scitechdaily.com/images/Eta-Aquariid-Meteors-NASA-All-Sky-Fireball-Network-Station.jpg", "publishedAt": "2023-05-04T07:33:16Z", "content": "ByNASAMay 4, 2023\r\nThe eta Aquariid meteor shower, active throughout April and May, is set to peak on May 5 with an impressive outburst year, featuring 120-160 meteors per hour. Despite the full moon… [+3768 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Double Danger for Young Women: High Risk of Rehospitalization After Heart Attack - SciTechDaily", "description": "NIH-supported findings identify risk factors in women and suggest the need for closer monitoring. A study funded by the National Institutes of Health shows that women aged 55 and younger are nearly twice as likely to be rehospitalized within a year of a heart…", "url": "https://scitechdaily.com/?p=273871", "urlToImage": "https://scitechdaily.com/images/Woman-Heart-Attack.jpg", "publishedAt": "2023-05-03T08:23:40Z", "content": "Women aged 55 and younger face nearly twice the risk of rehospitalization in the year following a heart attack compared to similarly aged men, as per a study supported by the National Institutes of H… [+6262 chars]"}]}