{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Australia To Buy Up To 5 Nuclear-Powered Submarines From US - NDTV", "description": "Australia has unveiled plans to buy up to five US nuclear-powered submarines, then build a new model with US and British technology under an ambitious plan to bulk up Western muscle across the Asia-Pacific in the face of a rising China.", "url": "https://www.ndtv.com/world-news/australia-to-buy-up-to-5-nuclear-powered-submarines-from-us-3858553", "urlToImage": "https://c.ndtvimg.com/2023-03/8n1apfa_australia_625x300_14_March_23.jpg", "publishedAt": "2023-03-14T05:14:00Z", "content": "US said Australia will buy nuclear submarines in coming years. (Representational)\r\nWashington: Australia has unveiled plans to buy up to five US nuclear-powered submarines, then build a new model wit… [+5238 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid danger! Menacing 590-foot Asteroid 2023 CM dashing towards Earth - HT Tech", "description": "NASA expects mammoth Asteroid 2023 CM to make an extremely close approach to the planet as soon as today, March 14.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-danger-menacing-590-foot-asteroid-2023-cm-dashing-towards-earth-71678765782233.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/14/1600x900/asteroid-7836952_640_1678765861944_1678765872650_1678765872650.jpg", "publishedAt": "2023-03-14T03:52:15Z", "content": "A warning has been issued about an asteroid which will pass Earth at an alarmingly close distance. Although scientists have determined that there is no risk of impact as of yet, the asteroid's close … [+1732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sea Monster From Age of Dinosaurs Found on Remote Arctic Island - SciTechDaily", "description": "For nearly 190 years, scientists have searched for the origins of ancient sea-going reptiles from the Age of Dinosaurs. Now a team of Swedish and Norwegian palaeontologists has discovered remains of the earliest known ichthyosaur or ‘fish-lizard’ on the remot…", "url": "https://scitechdaily.com/?p=260349", "urlToImage": "https://scitechdaily.com/images/Reconstruction-of-Earliest-Ichthyosaur.jpg", "publishedAt": "2023-03-14T03:15:22Z", "content": "Reconstruction of the earliest ichthyosaur and the 250-million-year-old ecosystem found on Spitsbergen. Credit: Illustration by Esther van Hulsen\r\nFor nearly 190 years, scientists have searched for t… [+3444 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Apple’s AR/VR headset reportedly being pushed out due to ‘huge pressure to ship’ - TechCrunch", "description": "Apple's mixed reality headset appears to be a given for a 2023 launch, but are the company and industry ready?", "url": "https://techcrunch.com/2023/03/13/apples-ar-vr-headset-reportedly-being-pushed-out-due-to-huge-pressure-to-ship/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1153510742.jpg?resize=1200,675", "publishedAt": "2023-03-13T19:10:24Z", "content": "Stop me if youve heard this one before: Apple is building a mixed reality headset thats set to ship this year. The companys MR (AR+VR) hardware ranks among its longest-lasting rumor cycles. Some (App… [+5676 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "Chinese scientists use stem cell technology to grow antlers on MICE - Daily Mail", "description": "Scientists from Northwestern Polytechnical University in Xi'an, China have grown antler-like structures on the foreheads of mice by transplanting stem cells from deer.", "url": "https://www.dailymail.co.uk/sciencetech/article-11854197/Chinese-scientists-use-stem-cell-technology-grow-antlers-MICE.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/03/13/16/68652753-0-image-a-22_1678723606193.jpg", "publishedAt": "2023-03-13T16:41:21Z", "content": "Scientists have managed to grow antler-like structures on the foreheads of mice by transplanting stem cells from deer.\r\nDeer antlers fall off and regrow each year during the spring they'll increase i… [+4928 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "Nokia to go all out with launch of high-end flagship level smartphone Nokia Magic Max - The Tech Outlook", "description": "Last month Nokia debuted a new logo for the company and since then it is speculated that it has something new and special in store for consumers this year. We all know that Nokia has always introduced devices that are entry-level or mid-range but now", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/nokia-to-go-all-out-with-launch-of-high-end-flagship-level-smartphone-nokia-magic-max/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/03/20230313_152909_00001.jpg", "publishedAt": "2023-03-13T10:45:45Z", "content": "Last month Nokia debuted a new logo for the company and since then it is speculated that it has something new and special in store for consumers this year. We all know that Nokia has always introduce… [+2327 chars]"}]}