{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anuradha Shukla and Deepshikha Sikarwar", "title": "No more royal treatment for Indian arms of MNCs as govt doubles tax on royalty, fee for technical services - Economic Times", "description": "Apart from hitting companies with parents in jurisdictions that do not have a tax avoidance treaty with India, the move also makes it possible for the government to impose the higher treaty rate of 15% on local arms of companies from the US, UK and other coun…", "url": "https://economictimes.indiatimes.com/news/economy/policy/no-more-royal-treatment-for-indian-arms-of-mncs-as-govt-doubles-tax-on-royalty-fee-for-technical-services/articleshow/98982426.cms", "urlToImage": "https://img.etimg.com/thumb/msid-98982460,width-1070,height-580,imgsize-782314,overlay-economictimes/photo.jpg", "publishedAt": "2023-03-25T00:37:00Z", "content": "New Delhi: The Indian arms of the US- and UK-based multinational companies such as Hindustan Unilever, PepsiCo India, and Coca-Cola India will now be subject to a higher rate of tax on royalty paymen… [+1896 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Perseverance rover camera captures stunning clouds on Mars - HT Tech", "description": "Perseverance rover has added yet another feather to its cap by capturing stunning drifting clouds on Mars.", "url": "https://tech.hindustantimes.com/tech/news/nasa-perseverance-rover-camera-captures-stunning-clouds-on-mars-71679659800924.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/24/1600x900/nasa_1679660072990_1679660082570_1679660082570.jpg", "publishedAt": "2023-03-24T12:16:39Z", "content": "NASA's Perseverance rover has been on a Mars exploratory mission for the last two years. Since its landing in February 2021, the Martian rover has not only captured breathtaking snapshots of the barr… [+1871 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Chaos Unleashed: Surprising Breakthrough in Pursuit of Energy-Efficient Quantum Technologies - SciTechDaily", "description": "Magnetic topological insulators are an exotic class of materials that conduct electrons without any resistance at all and so are regarded as a promising breakthrough in materials science. Researchers from the Cluster of Excellence ct.qmat in Würzburg and Dres…", "url": "https://scitechdaily.com/quantum-chaos-unleashed-surprising-breakthrough-in-pursuit-of-energy-efficient-quantum-technologies/", "urlToImage": "https://scitechdaily.com/images/Ferromagnetic-Topological-Insulator-scaled.jpg", "publishedAt": "2023-03-24T09:31:15Z", "content": "ByUniversity of WürzburgMarch 24, 2023\r\nA team of researchers from the Cluster of Excellence ct.qmat based at the universities JMU Würzburg and TU Dresden has engineered the topological insulator man… [+7399 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 24 March 2023: Comet ZTF and the stars of Milky Way - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is of Comet ZTF fading away in the sky.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-24-march-2023-comet-ztf-and-the-stars-of-milky-way-71679638100857.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/24/1600x900/comet_1679638274443_1679638282033_1679638282033.jpg", "publishedAt": "2023-03-24T06:13:27Z", "content": "Comets are of great interest to scientists as they are remnants of the early Solar System, providing valuable information about its composition and conditions. One of these is the Rare Green Comet ZT… [+1723 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "A robotic beehive to prevent honeybees from dying due to 'chill coma' - Phys.org", "description": "A combined team of roboticists and biologists from École Polytechnique Fédérale de Lausanne, in Switzerland and the University of Graz, in Austria, has developed what they describe as a robotic honeycomb to keep honeybees from dying due to \"chill coma.\"", "url": "https://phys.org/news/2023-03-robotic-beehive-honeybees-dying-due.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/a-robotic-beehive-to-p.jpg", "publishedAt": "2023-03-23T13:53:29Z", "content": "A combined team of roboticists and biologists from École Polytechnique Fédérale de Lausanne, in Switzerland and the University of Graz, in Austria, has developed what they describe as a robotic honey… [+2929 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Ekrem Çetinkaya, Ekrem Çetinkaya", "title": "Think Like this and Answer Me: This AI Approach Uses Active Prompting to Guide Large Language Models - MarkTechPost", "description": "We all got familiar with large language models (LLMs) in recent months with the introduction of ChatGPT, and it quickly became an essential tool in our daily lives. LLms are useful in information retrieval, chat assistance, writing assistance, etc.  Generally…", "url": "https://www.marktechpost.com/2023/03/22/think-like-this-and-answer-me-this-ai-approach-uses-active-prompting-to-guide-large-language-models/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/03/fig1-4.png", "publishedAt": "2023-03-23T04:17:15Z", "content": "We all got familiar with large language models (LLMs) in recent months with the introduction of ChatGPT, and it quickly became an essential tool in our daily lives. LLms are useful in information ret… [+4670 chars]"}]}