{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Justice.gov"}, "author": null, "title": "Justice Department Announces Coordinated, Nationwide Actions to Combat North Korean Remote Information Technology Workers’ Illicit Revenue Generation Schemes - Department of Justice (.gov)", "description": "The Justice Department announced today coordinated actions against the Democratic People’s Republic of North Korea (DPRK) government’s schemes to fund its regime through remote information technology (IT) work for U.S. companies.", "url": "https://www.justice.gov/opa/pr/justice-department-announces-coordinated-nationwide-actions-combat-north-korean-remote", "urlToImage": "https://www.justice.gov/themes/custom/usdoj_uswds/images/metatag-image--press-release.png", "publishedAt": "2025-06-30T18:49:18Z", "content": "The Justice Department announced today coordinated actions against the Democratic Peoples Republic of North Korea (DPRK) governments schemes to fund its regime through remote information technology (… [+14633 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Google embraces AI in the classroom with new Gemini tools for educators, chatbots for students, and more - TechCrunch", "description": "Google will give teachers the ability to create interactive study guides using the AI research tool Notebook LM, along with their classroom materials.", "url": "https://techcrunch.com/2025/06/30/google-embraces-ai-in-the-classroom-with-new-gemini-tools-for-educators-chatbots-for-students-and-more/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/03/students-typing-on-laptops-GettyImages_1513744777.jpeg?resize=1200,800", "publishedAt": "2025-06-30T16:44:28Z", "content": "Google on Monday announced a series of updates intended to bring its Gemini AI and other AI-powered tools deeper into the classroom. At the ISTE edtech conference, the tech giant introduced more than… [+3343 chars]"}]}