{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sky-High Success: Boeing's Starliner Nails Parachute Test Before Astronaut Adventure - SciTechDaily", "description": "Boeing successfully tested Starliner's new parachute system, a key step towards its upcoming crewed mission to the International Space Station. The test confirmed the functionality of critical parachute components, overseen by NASA astronauts. A modified para…", "url": "https://scitechdaily.com/sky-high-success-boeings-starliner-nails-parachute-test-before-astronaut-adventure/", "urlToImage": "https://scitechdaily.com/images/NASA-C-130-Cargo-Aircraft-Releases-Dart-Shaped-Test-Vehicle-scaled.jpg", "publishedAt": "2024-01-13T23:53:37Z", "content": "A NASA C-130 cargo aircraft releases a dart-shaped test vehicle above the U.S. Army’s Yuma Proving Ground on Jan. 9 to begin the testing sequence for a Boeing Starliner parachute system. Credit: U.S.… [+2410 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Holes' Glowing Secrets: New Findings Challenge Existing Theories - SciTechDaily", "description": "Cardiff astronomers, along with international partners, have revealed a novel method to investigate how black holes feast. An international team of astronomers has uncovered an entirely new method to investigate the behavior of active black holes. They observ…", "url": "https://scitechdaily.com/black-holes-glowing-secrets-new-findings-challenge-existing-theories/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Powerful-Jet-Illustration.jpg", "publishedAt": "2024-01-13T20:22:54Z", "content": "Astronomers have discovered a new way to analyze active black holes, revealing that their microwave and X-ray emissions are similar across different consumption rates. This insight, which challenges … [+4573 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Artificial intelligence expected to dominate consumer technology trade show CES in Las Vegas - AP Archive", "description": "(8 Jan 2024) RESTRICTION SUMMARY:ASSOCIATED PRESSLas Vegas - 6 January 20241. Wide of convention locationANNOTATION:  The Consumer Technology Association's a...", "url": "https://www.youtube.com/watch?v=eJB3KdCRTiA", "urlToImage": "https://i.ytimg.com/vi/eJB3KdCRTiA/maxresdefault.jpg", "publishedAt": "2024-01-13T17:52:55Z", "content": null}, {"source": {"id": null, "name": "BusinessLine"}, "author": "BL Research Bureau & Hari Viswanath", "title": "IT stocks rally may be on wobbly legs - BusinessLine", "description": "Tech sector investors saw positive reactions in IT stocks last week, but the sustainability of this rally is questionable due to weak business trends and high valuations.", "url": "https://www.thehindubusinessline.com/portfolio/it-stocks-rally-may-be-on-wobbly-legs/article67738657.ece", "urlToImage": "https://bl-i.thgim.com/public/todays-paper/tp-news/yry149/article67732189.ece/alternates/LANDSCAPE_1200/TCS-and-Infosys%2BG99C8SQ21.4.jpg.jpg", "publishedAt": "2024-01-13T16:16:51Z", "content": "Hope is all around, especially if you were a tech sector investor last week, as IT stocks reacted positively to Infosys and TCS results, while Wipro ADR shot up 16 per cent on Friday (results came in… [+3342 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Jacqueline Thomas", "title": "For Better or Worse, AI Was the Star of CES 2024 - IGN", "description": "It doesn’t take a particularly keen eye to notice that AI is the star of CES 2024 and every single conversation I had at the giant technology show led back to AI and how it’s going to change the way we use our computers and even play our games.", "url": "https://www.ign.com/articles/for-better-or-worse-ai-was-the-star-of-ces-2024", "urlToImage": "https://assets-prd.ignimgs.com/2024/01/13/aiart-blogroll-1705151904653.jpg?width=1280", "publishedAt": "2024-01-13T13:26:31Z", "content": "It doesnt take a particularly keen eye to notice that AI is the star of CES 2024. At a certain point, every single conversation I had at the giant technology show led back to AI and how its going to … [+10293 chars]"}]}