{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "New tidal disruption event discovered by Chinese astronomers - Phys.org", "description": "Astronomers from the University of Science and Technology of China in Hefei report the discovery of a new faint tidal disruption event (TDE). The newfound TDE, designated AT 2023clx is the faintest and closest optical TDE so far detected. The finding was publ…", "url": "https://phys.org/news/2023-07-tidal-disruption-event-chinese-astronomers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-tidal-disruption-e.jpg", "publishedAt": "2023-07-18T14:09:56Z", "content": "Astronomers from the University of Science and Technology of China in Hefei report the discovery of a new faint tidal disruption event (TDE). The newfound TDE, designated AT 2023clx is the faintest a… [+3239 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Rob Thubron", "title": "A 200-foot asteroid that just missed Earth last week wasn't detected until two days later - TechSpot", "description": "Astronomers at the Atlas Observatory in South Africa first spotted 2023 NT1 on July 15, two days after making its closest approach to Earth. The asteroid entered...", "url": "https://www.techspot.com/news/99433-200-foot-asteroid-missed-earth-last-week-wasnt.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2022/12/2022-12-08-image-4.jpg", "publishedAt": "2023-07-18T10:15:00Z", "content": "In brief: If a massive asteroid was going to hit Earth, would it be better not to know about it until the object was lighting up our sky? We almost found out last week when a 200-foot object made a r… [+2563 chars]"}, {"source": {"id": null, "name": "Technext24.com"}, "author": null, "title": "Call of Duty: Sony signs 10-year deal with Microsoft to keep COD on Playstation - Technext", "description": "Microsoft and Sony have signed a 10-year \"binding agreement\" to keep Call of Duty on PlayStation following the Xbox maker’s acquisition of Activision Blizzard as confirmed by Microsoft Gaming CEO Phil Spencer.", "url": "https://technext24.com/2023/07/18/call-of-duty-sony-microsoft-signs-deal/", "urlToImage": "https://technext24.com/wp-content/uploads/2023/07/image-178.png", "publishedAt": "2023-07-18T09:00:00Z", "content": "Microsoft and Sony have signed a 10-year “binding agreement” to keep Call of Duty on PlayStation following the Xbox makers acquisition of Activision Blizzard as confirmed by Microsoft Gaming CEO Phil… [+4328 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": "Adam Clark", "title": "Microsoft Looks to Extend Activision Blizzard Deal Deadline: Report - Barron's", "description": "The tech giant wants to extend the contract for its $69 billion acquisition of the videogame company, which is due to expire on Tuesday, Reuters reported.", "url": "https://www.barrons.com/articles/microsoft-activision-blizzard-deal-deadline-stock-26975150", "urlToImage": "https://images.barrons.com/im-333781/social", "publishedAt": "2023-07-18T08:50:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Starling CubeSats Deployed: NASA's Swarm Satellite Mission Launches on Electron Rocket - SciTechDaily", "description": "NASA’s Starling mission lifted off from the launch pad aboard Rocket Lab’s Electron rocket from Pad B and Launch Complex 1 in Mahia, New Zealand, at 1:27 p.m. local time. Subsequently, the four Starling CubeSats were confirmed to have deployed from the Rocket…", "url": "https://scitechdaily.com/starling-cubesats-deployed-nasas-swarm-satellite-mission-launches-on-electron-rocket/", "urlToImage": "https://scitechdaily.com/images/NASA-Starling-CubeSats-in-Low-Earth-Orbit-scaled.jpg", "publishedAt": "2023-07-18T07:20:44Z", "content": "NASAs Starling six-month mission will use a team of four CubeSats in low Earth orbit to test technologies that let spacecraft operate in a synchronized manner without resources from the ground. The t… [+1684 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "New chemical cocktail can reverse aging, study - Tech Explorist", "description": "Discovery of chemical means to reverse aging and restore cellular function.", "url": "https://www.techexplorist.com/new-chemical-cocktail-reverse-ageing-study/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/woman-face-wrinkles.jpg", "publishedAt": "2023-07-18T05:49:45Z", "content": "A hallmark of eukaryotic aging is a loss of epigenetic information, a process that can be reversed. Previously, it was shown that the ectopic induction of the Yamanaka factors OCT4, SOX2, and KLF4 (O… [+2355 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Successfully Produce Slow Electrons in a Solution - SciTechDaily", "description": "An international group of scientists managed to produce slow electrons in a solution. These electrons could potentially enhance the efficiency of certain chemical reactions in the future. The original aim of this multinational research team was to detect a my…", "url": "https://scitechdaily.com/scientists-successfully-produce-slow-electrons-in-a-solution/", "urlToImage": "https://scitechdaily.com/images/Two-Electrons-Are-Briefly-United-as-a-Dielectron-scaled.jpg", "publishedAt": "2023-07-18T05:30:31Z", "content": "ByETH ZurichJuly 17, 2023\r\nHere, two electrons are briefly united as a dielectron (red) surrounded by solvent molecules. The dielectron cant be localized more precisely. One of the electrons will sub… [+2532 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "MASSIVE solar flare blasts out high-speed CME, NASA satellite shows; Solar storm set to strike soon - HT Tech", "description": "It has finally happened. The notorious sunspot AR3363 has exploded producing a massive solar flare. It has released a large CME component that is moving at a high speed. There is a possibility of an Earth-bound solar storm too.", "url": "https://tech.hindustantimes.com/tech/news/massive-solar-flare-blasts-out-high-speed-cme-nasa-satellite-shows-solar-storm-set-to-strike-soon-71689656688804.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/18/1600x900/faintyoung_1652920721271_1689657007074.jpg", "publishedAt": "2023-07-18T05:17:22Z", "content": "The Earth just experienced a minor solar storm yesterday, July 17, that sparked aurora displays at some locations in high-latitude areas. But just as soon as this solar activity subsided, another, bi… [+2313 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Sarah Steimer", "title": "Human-aware AI helps accelerate scientific discoveries, new research shows - Tech Xplore", "description": "A new study explores how artificial intelligence can not only better predict new scientific discoveries but can also usefully expand them. The researchers, who published their work in Nature Human Behaviour, built models that could predict human inferences an…", "url": "https://techxplore.com/news/2023-07-human-aware-ai-scientific-discoveries.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/human-aware-ai-helps-a.jpg", "publishedAt": "2023-07-17T14:33:04Z", "content": "A new study explores how artificial intelligence can not only better predict new scientific discoveries but can also usefully expand them. The researchers, who published their work in Nature Human Be… [+5968 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Vibrosculpt Reviews: Does Micro Compression Technology Really Your Burn Fat? - Deccan Herald", "description": "Vibrosculpt Reviews: Can a massager really make you lose fat? We were not sure about this, so we did some research. We wanted to know if micro compression technology can help you lose fat. Sometimes, there are new gadgets that say they can help you get fit ea…", "url": "https://www.deccanherald.com/brandspot/sponsored/vibrosculpt-reviews-does-micro-compression-technology-really-your-burn-fat-1237840.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201336-1237840-1689588768.jpg", "publishedAt": "2023-07-17T10:12:48Z", "content": "Vibrosculpt Reviews: Can a massager really make you lose fat? We were not sure about this, so we did some research. We wanted to know if micro compression technology can help you lose fat. Sometimes,… [+29906 chars]"}]}