{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA's astronauts aboard International Space Station set to return to Earth on SpaceX Dragon - HT Tech", "description": "NASA's Crew 7, after a six-month stint on the International Space Station (ISS), is gearing up to return to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasas-astronauts-aboard-international-space-station-set-to-return-to-earth-on-spacex-dragon-71710078806646.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/10/1600x900/Ukraine-Tensions-Space-3_1645814351869_1710079067470.jpg", "publishedAt": "2024-03-10T13:59:09Z", "content": "NASA's Crew 7 mission is poised to conclude its six-month residency aboard the International Space Station (ISS), with seven astronauts preparing to return to Earth. Throughout their extended stay, t… [+2312 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alexandra Semenova and Matt Turner", "title": "Bubble Angst Belied by Big-Tech Weaklings, Broader S&P 500 Gains - Yahoo Finance", "description": "(Bloomberg) -- US stocks’ torrid climb to start 2024 is evoking worrisome comparisons with past boom-and-bust cycles on Wall Street, sparking debate over the...", "url": "https://finance.yahoo.com/news/bubble-angst-belied-big-tech-120000734.html", "urlToImage": "https://media.zenfs.com/en/bloomberg_markets_842/558987d1826f7d396ba771e050a27517", "publishedAt": "2024-03-10T12:00:00Z", "content": "(Bloomberg) -- US stocks torrid climb to start 2024 is evoking worrisome comparisons with past boom-and-bust cycles on Wall Street, sparking debate over the risk that the market is overheating.\r\nMost… [+4997 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kevin Purdy", "title": "Sixty Four is a beautiful system design toy that reveals something rather dark - Ars Technica", "description": "Please do not load up this game if you have real tasks to accomplish, I beg you.", "url": "https://arstechnica.com/gaming/2024/03/sixty-four-is-an-idle-clicker-a-factory-sim-and-a-dark-extractive-journey/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/03/Sixty-Four_Screenshots-11-760x380.png", "publishedAt": "2024-03-10T11:21:42Z", "content": "Enlarge/ Your author is eight hours in and only recognizes roughly 50 percent of the objects and resources in this provided screenshot. It gets deeperand weirder.\r\n30\r\nThere haven't been many times i… [+5140 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Historic Discovery: The Farthest Active Supermassive Black Hole Ever Found - SciTechDaily", "description": "The enigmatic galaxy GN-z11 is one of the youngest ever observed. Delivering on its promise to transform our understanding of the early universe, the James Webb Space Telescope is probing galaxies near the dawn of time. One of these is the exceptionally lumin…", "url": "https://scitechdaily.com/webbs-historic-discovery-the-farthest-active-supermassive-black-hole-ever-found/", "urlToImage": "https://scitechdaily.com/images/Wispy-Galaxy-Concept.jpg", "publishedAt": "2024-03-10T10:34:08Z", "content": "Researchers using the James Webb Space Telescope have made groundbreaking discoveries in galaxy GN-z11, which is one of the most distant and luminous galaxies known. They identified a supermassive bl… [+5930 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deciphering the Dark: The Accelerating Universe and the Quest for Dark Energy - SciTechDaily", "description": "Dark energy's role in propelling the universe's accelerated expansion presents a pivotal challenge in astrophysics, driving ongoing research and space missions dedicated to uncovering the nature of this mysterious force. Some 13.8 billion years ago, the unive…", "url": "https://scitechdaily.com/deciphering-the-dark-the-accelerating-universe-and-the-quest-for-dark-energy/", "urlToImage": "https://scitechdaily.com/images/History-Universe-Infographic-scaled.jpg", "publishedAt": "2024-03-10T08:32:48Z", "content": "The history of the universe is outlined in this infographic. Credit: NASA\r\nDark energy’s role in propelling the universe’s accelerated expansion presents a pivotal challenge in astrophysics, driving … [+14562 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Apple terminates Epic’s account, Meta platforms get knocked offline and former Twitter execs sue Elon Musk - TechCrunch", "description": "In this edition of TC's Week in Review (WiR) newsletter, we cover Apple terminating Epic's dev account, former Twitter execs suing Elon Musk and more.", "url": "https://techcrunch.com/2024/03/09/apple-terminates-epics-account-meta-platforms-get-knocked-offline-and-former-twitter-execs-sue-elon-musk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/fortnite-epic-games.jpg?w=1024", "publishedAt": "2024-03-09T21:15:56Z", "content": "Hey, folks, welcome to Week in Review (WiR), TechCrunchs newsletter covering all of — or at least the bulk of! — noteworthy happenings around the tech-o-sphere.\r\nThis week, Roku played hardball with … [+3625 chars]"}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}]}