{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supercharged T Cells: A New Way To Kill Pancreatic Cancer With Minimal Side Effects - SciTechDaily", "description": "A new immunotherapy releases cancer-killing cytokines only within the tumor. Researchers at the University of California San Francisco (UCSF) have developed a new T cell-based immunotherapy that selectively targets cancer cells, producing a powerful anti-canc…", "url": "https://scitechdaily.com/?p=246482", "urlToImage": "https://scitechdaily.com/images/Cancer-Immunotherapy-T-Cells.jpg", "publishedAt": "2023-01-29T23:38:17Z", "content": "Pancreatic cancer is a type of cancer that develops in the pancreas, an organ located behind the stomach that plays a crucial role in digestion and the regulation of blood sugar. Pancreatic cancer is… [+5434 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "JPL and the Space Age: The Changing Face of Mars (NASA Documentary) - SciTechDaily", "description": "Other than Earth, no planet in the solar system has been so thoroughly or long examined as Mars. For more than two decades now NASA’s Jet Propulsion Laboratory has continuously explored the Red Planet with an array of orbiters, landers, and rovers. What laid …", "url": "https://scitechdaily.com/?p=246826", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-of-Mariner-4-at-Mars.jpg", "publishedAt": "2023-01-29T20:05:29Z", "content": "ByNASAs Jet Propulsion LaboratoryJanuary 29, 2023\r\nThis image of Mariner 4 superimposed on an image of Mars was used to advertise the Mariner 4 mission. Credit: NASA\r\nOther than Earth, no planet in t… [+3931 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Bill Peters", "title": "Apple, Amazon, Facebook and Google face earnings test amid Big Tech layoffs - MarketWatch", "description": "Earnings Watch: One analyst expects Apple to join Amazon, Meta, Alphabet and others in cutting jobs, and the results and forecasts delivered this week could help determine whether even more reductions are on the way", "url": "https://www.marketwatch.com/story/could-big-tech-layoffs-keep-growing-apple-amazon-facebook-and-google-may-give-hints-in-biggest-week-of-earnings-11675022463", "urlToImage": "https://images.mktw.net/im-712302/social", "publishedAt": "2023-01-29T20:00:00Z", "content": "In the biggest week of the holiday-earnings season, Big Tech results will receive the spotlight amid thousands of layoffs that could only be the beginning.See also: Microsoft could be the cloud secto… [+9659 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "China’s aerospace development boosted by excellent young team - Global Times", "description": "A team of top young scientific and technological graduates at the Beijing Aerospace Flight Control Center have played a key role in supporting China’s major space programs in recent years, such as the Tiangong Space Station, the Chang’e lunar probes and the T…", "url": "https://www.globaltimes.cn/page/202301/1284448.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2023/2023-01-05/29f1e94c-9da9-42de-9378-750aea35621c_s.jpeg", "publishedAt": "2023-01-29T19:11:00Z", "content": "Photo: Deng Xiaoci/GT\r\nA team of top young scientific and technological graduates at the Beijing Aerospace Flight Control Center have played a key role in supporting Chinas major space programs in re… [+7329 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Easily Recyclable and Compostable – A New Plastic With Excellent Mechanical Stability - SciTechDaily", "description": "How can plastics be designed so that they maintain their useful properties while also being more easily recyclable? Chemist Stefan Mecking and his research group at the University of Konstanz are focused on studying eco-friendly solutions for plastics. In the…", "url": "https://scitechdaily.com/easily-recyclable-and-compostable-a-new-plastic-with-excellent-mechanical-stability/", "urlToImage": "https://scitechdaily.com/images/Plastic-Recycling-Concept.jpg", "publishedAt": "2023-01-29T15:31:40Z", "content": "ByUniversity of KonstanzJanuary 29, 2023\r\nResearchers at the University of Konstanz have developed a new plastic that is highly stable, biodegradable, and readily recyclable.\r\nHow can plastics be des… [+4213 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This is how much sugar is packed into South Africa’s favourite fizzy drinks - BusinessTech", "description": "We looked at over 50 fizzy drinks that are available in South Africa and compared their sugar contents.", "url": "https://businesstech.co.za/news/lifestyle/658719/this-is-how-much-sugar-is-packed-into-south-africas-favourite-fizzy-drinks/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/soft-drinks.jpg", "publishedAt": "2023-01-29T15:03:15Z", "content": "Fizzy drinks are a popular beverage choice in South Africa, but health concerns regarding their sugar content and the implementation of the health promotion levy (HPL) have changed the soft drink ind… [+6610 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Best mobile postpaid plans for those on a budget as of January 2023 - TechNave", "description": "Those who subscribe to postpaid plans probably have a stable monthly income. Of course, we Malaysians are always on the lookout for the best deal. So with that", "url": "https://technave.com/gadget/Best-mobile-postpaid-plans-for-those-on-a-budget-as-of-January-2023-33267.html", "urlToImage": "https://technave.com/data/files/article/202301270955318606.png", "publishedAt": "2023-01-29T09:10:13Z", "content": "Since 5G is becoming more of a thing, many might feel it's a good time to consider changing their mobile plans. We've already discussed the good-value options for mobile prepaid plans. But what about… [+4095 chars]"}, {"source": {"id": null, "name": "Kilkennypeople.ie"}, "author": "Sian Moloughney", "title": "Students find sweeter way to treat equine parasites - Kilkenny Live", "description": "A project looking at how to reduce parasites in horses has won a Teagasc award at the BT Young Scientist and Technology Exhibition (BTYSTE) 2023. Transition year students Aine Shortall and Kate Whyte from Moate Community School, Co Westmeath, are the winners …", "url": "https://www.kilkennypeople.ie/news/farming-news/1017766/students-find-sweeter-way-to-treat-equine-parasites.html", "urlToImage": "https://www.kilkennypeople.ie/resizer/1200/700/true/2023_01_23/IKIP-W03-2023_BTYSE_horse_parasites-1674469450774.JPG--btyste.JPG?1674469452292", "publishedAt": "2023-01-29T07:01:01Z", "content": "A project looking at how to reduce parasites in horses has won a Teagasc award at the BT Young Scientist and Technology Exhibition (BTYSTE) 2023.\r\nTransition year students Aine Shortall and Kate Whyt… [+1561 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Sabotage at Eskom is rampant: report - BusinessTech", "description": "Eskom is under siege by criminals.", "url": "https://businesstech.co.za/news/energy/660361/sabotage-at-eskom-is-rampant-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/crime-Eskom-coal-theft.jpg", "publishedAt": "2023-01-29T05:18:48Z", "content": "Power station managers say that Eskom’s problems aren’t necessarily a lack of skills and messy operation plans – the main culprit behind the country’s power problems is rampant criminality, including… [+2914 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rotating Detonation Rocket Engine: NASA's Revolutionary Propulsion Design for Deep Space Missions - SciTechDaily", "description": "As NASA takes its first steps toward establishing a long-term presence on the Moon’s surface, a team of propulsion development engineers at NASA have developed and tested NASA’s first full-scale rotating detonation rocket engine, or RDRE, an advanced rocket e…", "url": "https://scitechdaily.com/rotating-detonation-rocket-engine-nasas-revolutionary-propulsion-design-for-deep-space-missions/", "urlToImage": "https://scitechdaily.com/images/Rotating-Detonation-Rocket-Engine-RDRE-Hot-Fire-Test.jpg", "publishedAt": "2023-01-28T16:34:45Z", "content": "ByRay Osorio, Marshall Space Flight CenterJanuary 28, 2023\r\nRotating detonation rocket engine, or RDRE hot fire test at Marshall Space Flight Center. Credit: NASA\r\nAs NASA\r\nEstablished in 1958, the N… [+3796 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The best countries in the world – and where South Africa fits in - BusinessTech", "description": "These are the top 10 countries to live in, according to the Best Countries report.", "url": "https://businesstech.co.za/news/lifestyle/656945/the-best-countries-in-the-world-and-where-south-africa-fits-in/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/Switzerland.jpg", "publishedAt": "2023-01-28T11:01:15Z", "content": "Switzerland held its position as the number one country in the world, according to the 2022 Best Countries report, a rankings and analysis project by US News &amp; World Report, Y&amp;R’s BAV Group a… [+4690 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Vishal Mathur", "title": "Data Privacy Day: Security threats expand, are tech giants stepping up to help? - Hindustan Times", "description": "What are the tech giants doing to improve privacy measures on the software and apps they make, and the phones as well as computing devices they sell?", "url": "https://www.hindustantimes.com/business/data-privacy-day-security-threats-expand-are-tech-giants-stepping-up-to-help-101674895787291.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/28/1600x900/Over-769-million-online-threats-were-blocked-on-co_1674902952160.jpg", "publishedAt": "2023-01-28T08:54:39Z", "content": "We say it every year to mark the annual Data Privacy Day on January 28, and 2023 is no different. The potential of threat to your online data being accessed without your consent is more than it was l… [+6656 chars]"}]}