{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Medical Marvel: Human Cells Transformed Into Tiny Biological Robots - SciTechDaily", "description": "The multicellular bots move around and help heal “wounds” created in cultured neurons. Researchers at Tufts University and Harvard University’s Wyss Institute have created tiny biological robots that they call Anthrobots from human tracheal cells that can mov…", "url": "https://scitechdaily.com/medical-marvel-human-cells-transformed-into-tiny-biological-robots/", "urlToImage": "https://scitechdaily.com/images/Anthrobot.jpg", "publishedAt": "2023-12-01T09:29:36Z", "content": "An Anthrobot is shown, depth colored, with a corona of cilia that provides locomotion for the bot. Credit: Gizem Gumuskaya, Tufts University\r\nThe multicellular bots move around and help heal “wounds”… [+10372 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NISAR mission to astronauts, check out the projects NASA and ISRO are working on - HT Tech", "description": "During his visit to the White House, Prime Minister Narendra Modi announced NASA collaboration on various Space exploration programs with ISRO.", "url": "https://tech.hindustantimes.com/tech/news/nisar-mission-to-astronauts-check-out-the-projects-nasa-and-isro-are-working-on-71701419517426.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/01/1600x900/PTI11-29-2023-000282A-0_1701419595863_1701419618422.jpg", "publishedAt": "2023-12-01T08:41:40Z", "content": "India and the United States are set to embark on a groundbreaking collaboration in space exploration, marking a significant milestone in their space partnership. The announcement came after NASA Chie… [+2416 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Tata Technologies share price: Profit booking triggers. Experts list out 5 reasons to avoid buying rush | Mint - Mint", "description": "Tata Technologies share price: Due to narrow down in valuation gap against peers, newly listed Tata group shares have limited upside possibility, say experts", "url": "https://www.livemint.com/market/stock-market-news/tata-technologies-share-price-profit-booking-triggers-experts-list-out-5-reasons-to-avoid-buying-rush-11701413811177.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/01/1600x900/Tata_Technologies_share_price_stock_market_today_1701414022472_1701414022765.JPG", "publishedAt": "2023-12-01T07:08:36Z", "content": "Tata Technologies share price: After strong debut on Dalal Street, shares of Tata Technologies Ltd witnessed some profit booking during early morning session on Friday. Tata Technologies share price … [+3423 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "David Delima, Siddharth Suvarna", "title": "These Three iPhone Features Make Technology More Accessible for Persons With Disabilities - Gadgets 360", "description": "Apple recently introduced new accessibility features as part of the iOS 17 update, allowing users to utilise on-device machine learning technology to create a copy of their voice or access a much more simplified interface an iPhone or iPad. Ahead of Internati…", "url": "https://www.gadgets360.com/mobiles/features/apple-personal-voice-live-speech-assistive-access-accessibility-features-4623446", "urlToImage": "https://i.gadgets360cdn.com/large/apple_ios_17_accessibility_features_1701410906521.jpg", "publishedAt": "2023-12-01T06:44:11Z", "content": "December 3 is celebrated as the International Day of Persons with Disabilities by the United Nations in order to raise awareness and promote the welfare of persons with disabilities around the world.… [+3078 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Towering Inferno: Mount Erebus' Dramatic Emergence From the Antarctic Clouds - SciTechDaily", "description": "The fiery and icy upper reaches of the Antarctic volcano pierced through a canopy of clouds. On a late spring day in 2023, the summit crater of Mount Erebus, the world's southernmost active volcano, emerged majestically above the clouds. Captured by Landsat 9…", "url": "https://scitechdaily.com/the-towering-inferno-mount-erebus-dramatic-emergence-from-the-antarctic-clouds/", "urlToImage": "https://scitechdaily.com/images/Mount-Erebus-Breaks-Through.jpg", "publishedAt": "2023-11-29T18:13:39Z", "content": "Satellite view of the summit crater of Mount Erebus on November 25, 2023, captured by the Operational Land Imager-2 on Landsat 9.\r\nThe fiery and icy upper reaches of the Antarctic volcano pierced thr… [+1874 chars]"}]}