{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Vitamin D deficiency affects dopaminergic neuron differentiation in schizophrenia - Tech Explorist", "description": "Vitamin D deficiency affects developing neurons in schizophrenia by using new technology.", "url": "https://www.techexplorist.com/vitamin-d-deficiency-affects-dopaminergic-neuron-differentiation-schizophrenia/60725/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/schizophrenia.jpg", "publishedAt": "2023-05-28T08:15:25Z", "content": "Vitamin D has been found as an important element in the development and differentiation of dopaminergic neurons.\r\nThe University of Queensland’s neuroscientists has used cutting-edge technology to re… [+3226 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Tim Cook's 5 key tips for success in a changing world - HT Tech", "description": "Cook's career offers valuable lessons for aspiring young leaders on achieving and sustaining success. Here are four of Cook's key lessons that can help you achieve success like him.", "url": "https://tech.hindustantimes.com/tech/news/tim-cooks-5-key-tips-for-success-in-a-changing-world-71685251742265.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/28/1600x900/Tim_cook_tips_to_success_1685251929234_1685251929571.jpg", "publishedAt": "2023-05-28T05:38:03Z", "content": "Tim Cook, the CEO of Apple since 2011, has successfully carried forward co-founder Steve Jobs' legacy as a leader. Apple, undoubtedly the largest and most influential company in the world, holds a sp… [+3623 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Alchemy: Cellular Waste Transformed Into Essential Chemicals - SciTechDaily", "description": "A recent study uncovers a biochemical recycling process in animals that uses cellular waste to create vital chemicals, revolutionizing our understanding of animal and human functioning. This discovery opens up new research avenues for exploring over 100,000 u…", "url": "https://scitechdaily.com/natures-alchemy-cellular-waste-transformed-into-essential-chemicals/", "urlToImage": "https://scitechdaily.com/images/Natures-Biochemical-Recycling-Secrets.jpg", "publishedAt": "2023-05-27T14:44:26Z", "content": "In a recent Nature Chemical Biology article, researchers revealed a previously unknown biochemical recycling process in animals that uses cellular waste to produce new, vital chemicals. These chemica… [+2796 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Victor", "title": "A new leak suggests iPhone 15 Pro Max will use the same main camera and display tech as the iPhone 14 Pro Max - GSMArena.com", "description": "There might still be the periscope camera to look forward to. If you've been around the rumor mill lately, then you'll probably know that one of the major...", "url": "https://www.gsmarena.com/a_new_leak_suggests_iphone_15_pro_max_will_use_the_same_main_camera_and_display_tech_as_the_iphone_1-news-58698.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/23/05/iphone-15-pro-max-same-camera-display/-952x498w6/gsmarena_001.jpg", "publishedAt": "2023-05-27T14:07:01Z", "content": "If you've been around the rumor mill lately, then you'll probably know that one of the major expected innovations to arrive with the iPhone 15 Pro Max has been a new main camera, likely based on the … [+1414 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Emergence of solvated dielectrons observed for the first time - Tech Explorist", "description": "Team generates low-energy electrons using ultraviolet light.", "url": "https://www.techexplorist.com/emergence-solvated-dielectrons-observed-first-time/60703/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/solvated-electrons.jpg", "publishedAt": "2023-05-27T11:00:03Z", "content": "Scientists have several theories about solvated dielectrons, but they have never made a direct observation of one. They are a pair of dissolved electrons in liquids like water or liquid ammonia. The … [+2432 chars]"}, {"source": {"id": null, "name": "CleanTechnica"}, "author": "Jennifer Sensiba", "title": "Two Charging Companies Respond To Ford’s Adoption Of The Tesla/NACS Plug - CleanTechnica", "description": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla was using its plug and everyone else was using the CCS1 plug …", "url": "https://cleantechnica.com/2023/05/27/two-charging-companies-respond-to-fords-adoption-of-the-tesla-nacs-plug/", "urlToImage": "http://cleantechnica.com/files/2023/05/Electrify-America-Station-With-Roof-2000x1000-1-800x400.png", "publishedAt": "2023-05-27T04:15:57Z", "content": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla w… [+7691 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Edit WhatsApp Messages on iPhone and Android with this simple trick - HT Tech", "description": "Edit WhatsApp Messages on iPhone and Android with this simple trick WhatsApp users have finally got the edit messages option on both iPhones and Android devices. Here is how to use it to your benefit. If you are someone who makes frequent typos and then press…", "url": "https://tech.hindustantimes.com/web-stories/edit-whatsapp-messages-on-iphone-and-android-with-this-simple-trick-71685117425067.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/pixabay_smartphone-5064084_1920_1685119602690_1685119613066.jpg/", "publishedAt": "2023-05-26T16:48:34Z", "content": "Photo Credit: Unsplash\r\n WhatsApp users have finally got the edit messages option on both iPhones and Android devices. Here is how to use it to your benefit.\r\nPhoto Credit: Unsplash\r\n If you are some… [+1396 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Airplane-sized asteroid set to buzz Earth at close quarters, NASA data shows - HT Tech", "description": "Airplanesized asteroid set to buzz Earth at close quarters NASA data shows Various NASA telescopes are tracking this asteroid and the data reveals that it will pass very close to the Earth today. Asteroids pose a significant danger to Earth as is clear from p…", "url": "https://tech.hindustantimes.com/web-stories/airplanesized-asteroid-set-to-buzz-earth-at-close-quarters-nasa-data-shows-71685109678186.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/space-7288750_1920_Pixabay_1685111411411_1685111423780.jpg/", "publishedAt": "2023-05-26T14:34:52Z", "content": "Photo Credit: Pixabay\r\n Various NASA telescopes are tracking this asteroid and the data reveals that it will pass very close to the Earth today.\r\nPhoto Credit: Pixabay\r\n Asteroids pose a significant … [+1571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Chemical Reactions Spark Life Into Self-Folding Micro Origami Machines - SciTechDaily", "description": "Cornell researchers have devised a way to utilize chemical reactions for the self-folding of microscale origami machines, allowing them to work in dry, room-temperature conditions. This breakthrough could pave the way for the creation of tiny, autonomous devi…", "url": "https://scitechdaily.com/chemical-reactions-spark-life-into-self-folding-micro-origami-machines/", "urlToImage": "https://scitechdaily.com/images/Origami-Tetrahedra-Microstructure.jpg", "publishedAt": "2023-05-26T09:59:38Z", "content": "ByCornell UniversityMay 26, 2023\r\nA scanning electron microscope (SEM) image shows an origami tetrahedra microstructure that self-folded after it was exposed to hydrogen. Credit: Cornell University\r\n… [+4012 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Have Flipped the Script on Autism Genetics - SciTechDaily", "description": "Researchers from Cold Spring Harbor Laboratory (CSHL) have recently revised the commonly held genetic assumptions about autism spectrum disorder (ASD). For many years, scientists believed that siblings diagnosed with ASD tended to inherit more genetic traits …", "url": "https://scitechdaily.com/researchers-have-flipped-the-script-on-autism-genetics/", "urlToImage": "https://scitechdaily.com/images/DNA-Next-Generation-Genetics-Biotechnology.jpg", "publishedAt": "2023-05-26T08:45:49Z", "content": "ByCold Spring Harbor LaboratoryMay 26, 2023\r\nA recent study has found that siblings affected by autism inherit a greater proportion of their genetic material from their father rather than their mothe… [+4511 chars]"}]}