{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Novel AI-based approach for more accurate RNA 3D structure prediction - India Education Diary", "description": "A research team from the Cancer Science Institute of Singapore (CSI Singapore) at the National University of Singapore (NUS) has successfully harnessed artificial intelligence (AI) and deep-learning techniques to model atomic-level RNA 3D structures", "url": "https://indiaeducationdiary.in/novel-ai-based-approach-for-more-accurate-rna-3d-structure-prediction/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2024/01/1920_gettyimages-1337415385-1024x576.jpg", "publishedAt": "2024-01-07T17:10:59Z", "content": "A research team from the Cancer Science Institute of Singapore (CSI Singapore) at the National University of Singapore (NUS) has successfully harnessed artificial intelligence (AI) and deep-learning … [+6276 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Sunlight Like Never Before: The Supercrystal Breakthrough - SciTechDaily", "description": "Hydrogen is a building block for the energy transition. To obtain it with the help of solar energy, LMU researchers have developed new high-performance nanostructures. The material holds a world record for green hydrogen production with sunlight. When Emilian…", "url": "https://scitechdaily.com/harnessing-sunlight-like-never-before-the-supercrystal-breakthrough/", "urlToImage": "https://scitechdaily.com/images/Harvesting-Solar-Energy-Crystals-Art.jpg", "publishedAt": "2024-01-07T12:56:48Z", "content": "Professor Emiliano Cortés, at LMU, is revolutionizing solar energy capture through nanotechnology. By developing plasmonic nanostructures, his team creates materials that concentrate solar energy mor… [+6503 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomical Illusions: New Images Reveal What Neptune and Uranus Really Look Like - SciTechDaily", "description": "Recent research led by Professor Patrick Irwin shows that Neptune and Uranus are both a similar shade of greenish-blue, challenging previous perceptions of their colors. The study used modern telescopic data to correct historical color inaccuracies and explai…", "url": "https://scitechdaily.com/astronomical-illusions-new-images-reveal-what-neptune-and-uranus-really-look-like/", "urlToImage": "https://scitechdaily.com/images/Neptune-and-Uranus-True-Colors.jpg", "publishedAt": "2024-01-07T09:42:41Z", "content": "A study reveals Neptune and Uranus are both greenish-blue, not the deep azure and pale cyan previously believed. Modern telescope data was used to correct these historical color misrepresentations. C… [+8848 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The “Dolomite Problem” – Scientists Resolve 200-Year-Old Geology Mystery - SciTechDaily", "description": "To create mountains from dolomite, a common mineral, it must periodically dissolve. This seemingly paradoxical concept could help make new defect-free semiconductors and more. For two centuries, scientists have failed to grow a common mineral in the laborator…", "url": "https://scitechdaily.com/the-dolomite-problem-scientists-resolve-200-year-old-geology-mystery/", "urlToImage": "https://scitechdaily.com/images/Dolomites-Close-Up-scaled.jpg", "publishedAt": "2024-01-07T01:05:50Z", "content": "Professor Wenhao Sun shows off dolomite from his personal rock collection. Sun studies crystal growth of minerals from a materials science perspective. By understanding how atoms come together to for… [+7001 chars]"}]}