{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sixth Mass Extinction of Global Biodiversity Is Already in Progress - SciTechDaily", "description": "The history of life on Earth has been marked five times by events of mass biodiversity extinction caused by extreme natural phenomena. Today, many experts warn that a Sixth Mass Extinction crisis is underway, this time entirely caused by human activities. A c…", "url": "https://scitechdaily.com/sixth-mass-extinction-of-global-biodiversity-is-already-in-progress/", "urlToImage": "https://scitechdaily.com/images/Recently-Extinct-Snails-scaled.jpg", "publishedAt": "2022-01-15T20:40:48Z", "content": "Shells of land snails from Rurutu (Austral Islands, French Polynesia) — recently extinct before they were collected and described scientifically. Credit: O. Gargominy, A. Sartori\r\nThe history of life… [+3710 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Short seller launches assault on tech star Darktrace - Telegraph.co.uk", "description": "ShadowFall bets against the cyber security specialist as it doubts it \"will stand the test of time\"", "url": "https://www.telegraph.co.uk/business/2022/01/15/short-seller-launches-assault-tech-star-darktrace/", "urlToImage": "https://www.telegraph.co.uk/content/dam/technology/2022/01/11/TELEMMGLPICT000275654583_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay", "publishedAt": "2022-01-15T19:00:00Z", "content": "Darktrace has come under attack from the short seller ShadowFall, which has launched a barrage of criticisms of the cyber security specialists performance, accounting and culture. \r\nThe FTSE 250 busi… [+1843 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Adam Vjestica", "title": "Inside Xbox’s backward compatibility journey with Series X development chief, Jason Ronald - TechRadar", "description": "Interview: 'All of a sudden, you believed it was possible'", "url": "https://www.techradar.com/news/inside-xboxs-backward-compatibility-journey-with-series-x-development-chief-jason-ronald", "urlToImage": "https://cdn.mos.cms.futurecdn.net/eQpHunxCZWgReVURVvh86m-1200-80.jpg", "publishedAt": "2022-01-15T15:30:48Z", "content": "When Microsoft ruled out backward compatibility during the Xbox One’s launch in 2013, it just seemed like par for the course. \r\nAt the time, consumers were generally expected to start their gaming co… [+13107 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Major Milestone for the James Webb Space Telescope, a “Mini” Monster Black Hole [Video] - SciTechDaily", "description": "A major milestone for the James Webb Space Telescope, what astronomers could learn from a “mini” monster black hole, and the latest assessment of our planet’s global surface temperature … a few of the stories to tell you about – This Week at NASA! https://you…", "url": "https://scitechdaily.com/a-major-milestone-for-the-james-webb-space-telescope-a-mini-monster-black-hole-video/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-01-15T12:37:43Z", "content": "Video transcript:\r\nA major milestone for the James Webb Space Telescope, what astronomers could learn from a mini monster black hole, and the latest assessment of our planet’s global surface temperat… [+2536 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Seeing Dark Energy's True Colors: DESI Creates Largest 3D Map of the Cosmos - SciTechDaily", "description": "The Dark Energy Spectroscopic Instrument (DESI) has capped off the first seven months of its survey run by smashing through all previous records for three-dimensional galaxy surveys, creating the largest and most detailed map of the universe ever. Yet it’s on…", "url": "https://scitechdaily.com/seeing-dark-energys-true-colors-desi-creates-largest-3d-map-of-the-cosmos/", "urlToImage": "https://scitechdaily.com/images/DESI-3D-Map-of-Universe.gif", "publishedAt": "2022-01-15T10:32:43Z", "content": "ByLawrence Berkeley National LaboratoryJanuary 15, 2022\r\nDESI’s three-dimensional “CT scan” of the Universe. The earth is in the lower left, looking out over 5 billion light years in the direction of… [+12094 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Find out how to use Garena Free Fire Redemption site and get free items! - HT Tech", "description": "Learn how to use Garena Free Fire Redemption site to redeem your codes and receive freebies like outfits, gun skins, emotes and more", "url": "https://tech.hindustantimes.com/how-to/find-out-how-to-use-garena-free-fire-redemption-site-and-get-free-items-71642241152857.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/15/1600x900/3df5e7f6dee326645dd52670bb3745d8jpg_1641517552742_1642241209296.jpg", "publishedAt": "2022-01-15T10:13:12Z", "content": "Garena Free Fire redemption codes have been a way for the developers of the popular game to appreciate and reward the gaming community. The developers regularly post region specific redeemable codes … [+1419 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Earth Isn't 'Super' Because the Sun Had Rings - ExtremeTech", "description": "By modeling our solar system with a supercomputer, astrophysicist André Izidoro and his colleagues have shown that the early formation of rings around the sun influenced the size of the resulting planets.", "url": "https://www.extremetech.com/extreme/330589-earth-isnt-super-because-the-sun-had-rings", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/08/638831main_globe_east_1344-640x360.jpg", "publishedAt": "2022-01-14T20:25:00Z", "content": "As we explore the cosmos, astronomers have spotted a lot of so-called “super-Earths.” These rocky planets may be several times as massive as Earth, and there’s no analog in our solar system. But why … [+2815 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "James Webb Space Telescope: Mirror, Mirror…On Its Way! - SciTechDaily", "description": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the beginning of a several-month phase of aligning the telescop…", "url": "https://scitechdaily.com/james-webb-space-telescope-mirror-mirroron-its-way/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Primary-Mirror-in-Space.gif", "publishedAt": "2022-01-14T12:14:03Z", "content": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the… [+3139 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Changes proposed for traffic fines in South Africa following latest court ruling - BusinessTech", "description": "The Automobile Association (AA) has welcomed the High Court ruling which found that the controversial Administrative Adjudication of Road Traffic Offences Act (Aarto) was unconstitutional, and proposed a way forward for traffic laws and fines in the country.", "url": "https://businesstech.co.za/news/motoring/550706/changes-proposed-for-traffic-fines-in-south-africa-following-latest-court-ruling/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/02/TrafficPolice-e1550147507585.jpg", "publishedAt": "2022-01-14T06:00:00Z", "content": "The Automobile Association (AA) has welcomed the High Court ruling which found that the controversial Administrative Adjudication of Road Traffic Offences Act (Aarto) is unconstitutional, and propose… [+3359 chars]"}, {"source": {"id": null, "name": "Nasilemaktech.com"}, "author": "https://www.facebook.com/KokiYaps, https://www.facebook.com/KokiYaps", "title": "Reasons why you should and (shouldn't) consider the Apple M1 MacBook Air - Nasi Lemak Tech", "description": "The M1 MacBook Air. At this point in time, this laptop is already a year and a 3 months old. And at the end of last year, when Windows 11 was announced, I got so frustrated with Windows that I wanted a way out. Then John brought up an idea - why not get the M…", "url": "https://nasilemaktech.com/reasons-why-apple-m1-macbook-air/", "urlToImage": "https://i0.wp.com/nasilemaktech.com/wp-content/uploads/2022/01/M1-MacBook-Air-20.jpg", "publishedAt": "2022-01-14T04:00:09Z", "content": "The M1 MacBook Air. At this point in time, this laptop is already a year and a 3 months old. And at the end of last year, when Windows 11 was announced, I got so frustrated with Windows that I wanted… [+7128 chars]"}]}