{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "ISRO set to launch Shukrayaan and XPoSat missions to exploring the universe's mysteries - HT Tech", "description": "ISRO, India's space agency, all set for groundbreaking missions to Venus and XPoSat, aiming to unlock cosmic mysteries and explore distant worlds.", "url": "https://tech.hindustantimes.com/tech/news/isro-set-to-launch-shukrayaan-and-xposat-missions-to-exploring-the-universes-mysteries-71696664062649.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/07/1600x900/Shukrayaan_1696664279534_1696664279851.jpg", "publishedAt": "2023-10-07T07:42:08Z", "content": "The Indian Space Research Organisation (ISRO) is all set for its upcoming missions Shukrayaan to Venus and the X-Ray Polarimeter Satellite (XPoSat). These missions come after the successful Chandraya… [+2681 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "US: Indian techie couple, 2 kids found dead at home in New Jersey; police suspect murder-suicide - Times of India", "description": "An Indian techie, his wife and two kids were found dead at home in New Jersey's Plainsboro in the United States. The deceased has been identified as Tej Pratap Singh. According to New Jersey media reports, Tej apparently first murdered his wife and c", "url": "https://timesofindia.indiatimes.com/videos/toi-original/us-indian-techie-couple-2-kids-found-dead-at-home-in-new-jersey-police-suspect-murder-suicide/videoshow/104233739.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-104233739,imgsize-1006992.cms", "publishedAt": "2023-10-07T07:13:34Z", "content": "Oct 07, 2023, 12:43PM ISTSource: TOI.inAn Indian techie, his wife and two kids were found dead at home in New Jersey's Plainsboro in the United States. The deceased has been identified as Tej Pratap … [+395 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Footprints in New Mexico Shift Timeline for Early Human Presence in North America - SciTechDaily", "description": "Two new lines of evidence support the 21,000 to 23,000-year age estimate of the footprints first described and dated in 2021. In 2021, scientific dating results from footprints found at White Sands National Park in New Mexico began a global conversation that …", "url": "https://scitechdaily.com/?p=315130", "urlToImage": "https://scitechdaily.com/images/Fossilized-Footprints-in-White-Sands-National-Park-scaled.jpg", "publishedAt": "2023-10-07T02:14:16Z", "content": "ByU.S. Geological SurveyOctober 6, 2023\r\nFossilized footprints in White Sands National Park sparked a scientific debate. Subsequent research, using different dating methods, consistently supports the… [+4584 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA reveals bus-sized asteroid rushing towards Earth today! Check speed, size, other details - HT Tech", "description": "A bus-sized, Apollo group asteroid is hurtling towards Earth and is expected to make its closest approach to Earth today, October 6. Check details such as its speed, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/nasa-reveals-bus-sized-asteroid-rushing-towards-earth-today-check-speed-size-other-details-71696564225998.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/06/1600x900/Asteroid_2023_QH_1693479044729_1696564353357.jpg", "publishedAt": "2023-10-06T03:54:52Z", "content": "NASA has several space and ground-based telescopes in place to discover, track, and study asteroids. But if you're a budding astronomer, you can help the space agency too! NASA's new Daily Minor Plan… [+1879 chars]"}]}