{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Apple just leaked a dual-port 35W USB-C charger that could clear up the GaN mystery - The Verge", "description": "Apple seems about to replace its 30W USB-C charger with something better — a 35W charger with two ports, likely powered by GaN technology that might make it smaller.", "url": "https://www.theverge.com/2022/4/8/23016867/apple-dual-port-35-watt-usb-c-charger-power-adapter-leak", "urlToImage": "https://cdn.vox-cdn.com/thumbor/WjEtAQ6BMSsoEq22zUcpuduqQRA=/0x58:800x477/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23297627/MY1W2_AV2.jpg", "publishedAt": "2022-04-08T18:31:15Z", "content": "Is this Apples first dual-port charger ever?\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPlease do not pay Apple $50 for this outdated brick.\r… [+2423 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Curiosity Mars Rover Reroutes Away From Knife-Edged “Gator-Back” Rocks - SciTechDaily", "description": "To avoid patches of knife-edged rocks, the mission has taken an alternative path up Mount Sharp. NASA’s Curiosity Mars rover spent most of March climbing the “Greenheugh Pediment” – a gentle slope capped by rubbly sandstone. The rover briefly summited this fe…", "url": "https://scitechdaily.com/nasa-curiosity-mars-rover-reroutes-away-from-knife-edged-gator-back-rocks/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Mars-Rover-Gator-Back-Rocks.gif", "publishedAt": "2022-04-08T16:46:17Z", "content": "To avoid patches of knife-edged rocks, the mission has taken an alternative path up Mount Sharp.\r\nNASA’s Curiosity Mars rover spent most of March climbing the “Greenheugh Pediment” – a gentle slope c… [+5061 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New resource could provide clues on the past, present, and future of clownfish - Science Daily", "description": "Researchers from the Okinawa Institute of Science and Technology Graduate University have produced a comprehensive genome of the false clownfish, which could be used to answer a myriad of biological questions.", "url": "https://www.sciencedaily.com/releases/2022/04/220408083852.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-04-08T14:44:37Z", "content": "Clownfish may have been made famous through the popular film Finding Nemo, but probably only a few people realize that these charismatic orange-and-white fish offer huge potential for scientific rese… [+4050 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "ProtonMail buys email alias startup SimpleLogin - TechCrunch", "description": "Proton, the startup behind the E2E encrypted webmail service ProtonMail, has acquired SimpleLogin, which offers a freemium service for creating email aliases.", "url": "https://techcrunch.com/2022/04/08/proton-buys-simplelogin/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/08/GettyImages-834609032.jpg?w=480", "publishedAt": "2022-04-08T14:05:39Z", "content": "Proton, the Geneva, Switzerland-based startup behind the eponymous E2E encrypted webmail service ProtonMail, has acquired French startup SimpleLogin, which offers a freemium, open-source service for … [+3935 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Particle Physics Shock: Most Precise Ever Measurement of W Boson Mass Differs From Standard Model Prediction - SciTechDaily", "description": "Most precise ever measurement of W boson mass to be in tension with the Standard Model. After 10 years of careful analysis and scrutiny, scientists of the CDF collaboration at the U.S. Department of Energy’s Fermi National Accelerator Laboratory announced on …", "url": "https://scitechdaily.com/particle-physics-shock-most-precise-ever-measurement-of-w-boson-mass-differs-from-standard-model-prediction/", "urlToImage": "https://scitechdaily.com/images/Particle-Collision-Neutrino-Concept.jpg", "publishedAt": "2022-04-08T12:31:27Z", "content": "Most precise ever measurement of W boson mass to be in tension with the Standard Model.\r\nAfter 10 years of careful analysis and scrutiny, scientists of the CDF collaboration at the U.S. Department of… [+8582 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tesla Marks New Texas 'Gigafactory' Opening With Huge Cyber Rodeo Party - NDTV", "description": "Amidst fireworks, carnival games, music and futuristic technology, multi-billionaire Tesla CEO Elon Musk threw a grand invitation-only party for some 15,000 guests at the company's new billion-dollar-plus \"Gigafactory\" in Austin.", "url": "https://www.ndtv.com/world-news/tesla-marks-opening-of-new-texas-gigafactory-with-huge-cyber-rodeo-party-elon-musk-2870827", "urlToImage": "https://c.ndtvimg.com/2022-04/9qe9n1bs_elon-musk-tesla-afp_625x300_08_April_22.jpg", "publishedAt": "2022-04-08T10:34:00Z", "content": "Elon Musk said that plant would build ITS Cybertruck, Semi, Model 3 and Model Y sport utility vehicles.\r\nHouston: Amidst fireworks, carnival games, music and futuristic technology, multi-billionaire … [+3918 chars]"}, {"source": {"id": null, "name": "IT World Canada"}, "author": null, "title": "Hashtag Trending April 8 - Chips shortage cuts into GDP; Activision hires 1,100 employees; right to repair gains traction in Europe - IT World Canada", "description": "The U.S. government once again highlights the need to secure chips supply chains, Activision Blizzard hires 1,100 full-time employees, and the right to repair in Europe continues to gain traction. That’s all the tech news that’s trending right now, welcome to…", "url": "https://www.itworldcanada.com/article/hashtag-trending-april-8-chips-shortage-cuts-into-gdp-activision-hires-1100-employees-right-to-repair-gains-traction-in-europe/479685", "urlToImage": "https://i.itworldcanada.com/wp-content/uploads/2021/03/hashtag-trending-text-middle2.png", "publishedAt": "2022-04-08T09:33:49Z", "content": "The U.S. government once again highlights the need to secure chips supply chains, Activision Blizzard hires 1,100 full-time employees, and the right to repair in Europe continues to gain traction.\r\nT… [+2888 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "You could win a Vivobook Pro 15 OLED from just sharing a photo in the ASUS OLED & Creator Series contest - TechNave", "description": "Back in December 2021,&nbsp;ASUS Malaysia&nbsp;released the new&nbsp;Vivobook Pro 15 OLED&nbsp;and now there's an&nbsp;ASUS OLED &amp; Creator Series&nbsp;givea", "url": "https://technave.com/gadget/You-could-win-a-Vivobook-Pro-15-OLED-from-just-sharing-a-photo-in-the-ASUS-OLED-Creator-Series-contest-29500.html", "urlToImage": "https://technave.com/data/files/article/202204080656345026.jpg", "publishedAt": "2022-04-08T07:08:41Z", "content": "Back in December 2021, ASUS Malaysia released the new Vivobook Pro 15 OLED and now there's an ASUS OLED &amp; Creator Series giveaway contest. If you feel confident to win something, now here's your … [+1117 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "South Africa has abstained from a UN General Assembly resolution to suspend Russia from the Human Rights Council. Over R8 billion is needed to restore South Africa’s sewage and wastewater facilities. Health activists have taken legal action against the govern…", "url": "https://businesstech.co.za/news/government/575534/5-important-things-happening-in-south-africa-today-1257/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Naledi-Pandor-South-African-Minister-of-International-Relations-and-Cooperation-1.jpg", "publishedAt": "2022-04-08T06:14:49Z", "content": "Here’s what is happening in and affecting South Africa today:\r\n<ul><li>Abstained: South Africa has for the third time abstained from voting in a UN resolution on the Russian invasion of Ukraine – thi… [+2541 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Station Crew Preps for Spacewalks and Ax-1 Private Astronaut Mission - SciTechDaily", "description": "The seven-member Expedition 67 crew is gearing up for a pair of spacewalks scheduled for later this month while ensuring the International Space Station orbits Earth in tip-top shape. Meanwhile, the first private astronaut mission is less than one day from la…", "url": "https://scitechdaily.com/space-station-crew-preps-for-spacewalks-and-ax-1-private-astronaut-mission/", "urlToImage": "https://scitechdaily.com/images/Orbital-Sunrise-From-Space-Station-scaled.jpg", "publishedAt": "2022-04-08T04:26:23Z", "content": "An orbital sunrise is pictured from the space station beaming across Earth’s horizon revealing the silhouetted clouds above the South China Sea. Credit: NASA\r\nThe seven-member Expedition 67 crew is g… [+2234 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Abigail Ng", "title": "Chinese tech stocks in Hong Kong slip as investors watch Covid situation in China - CNBC", "description": "Shares in Asia-Pacific mostly declined on Friday after a comeback on Wall Street as investors continued to digest the Fed's plans to fight inflation.", "url": "https://www.cnbc.com/2022/04/08/asia-stocks-federal-reserve-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106816845-1609213716683-gettyimages-1229866474-JAPAN_JPX.jpeg?v=1649319771&w=1920&h=1080", "publishedAt": "2022-04-07T23:41:25Z", "content": "SINGAPORE Shares in Asia-Pacific were mixed on Friday, as Chinese tech shares slipped and investors watched the Covid situation in China.\r\nHong Kong's Hang Seng index fell 0.19%, while the Hang Seng … [+2765 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s NHI is coming – whether you like it or not: government - BusinessTech", "description": "The Department of Health will not back down from plans to introduce a new National Health Insurance (NHI) scheme in South Africa, says director-general Dr Nicholas Crisp.", "url": "https://businesstech.co.za/news/government/575106/south-africas-nhi-is-coming-whether-you-like-it-or-not-government/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/NasrecFiledHospital-e1603263426991.jpg", "publishedAt": "2022-04-07T07:25:32Z", "content": "The Department of Health will not back down from plans to introduce the National Health Insurance (NHI) scheme in South Africa, says director-general Dr Nicholas Crisp.\r\nSpeaking to News24at a confer… [+3576 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom warning for South Africa - BusinessTech", "description": "Credit rating agency Moody’s has maintained its rating of Eskom at Caa1 with a negative outlook, warning that the power utility continues to be in a precarious position despite prolonged financial support.", "url": "https://businesstech.co.za/news/energy/575050/eskom-warning-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/07/Eskom.jpg", "publishedAt": "2022-04-07T05:54:23Z", "content": "Credit rating agency Moody’s has maintained its rating of Eskom at Caa1 with a negative outlook, warning that the power utility continues to be in a precarious position despite prolonged financial su… [+2998 chars]"}]}