{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Motorola launches budget-friendly Moto G14 priced at 9999; Know features, price, and more - HT Tech", "description": "Moto G14 is the latest addition to the company’s lineup of budget-friendly smartphones. Check its features, specifications, pricing, and more.", "url": "https://tech.hindustantimes.com/mobile/news/motorola-launches-budget-friendly-moto-g14-priced-at-9999-know-features-price-and-more-71690872988075.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/01/1600x900/Untitled_design_1690873267146_1690873277896.jpg", "publishedAt": "2023-08-01T07:06:40Z", "content": "Expanding its already vast lineup of budget-friendly smartphones, Motorola has announced the launch of Moto G14. The smartphone's unveiling coincides with the launch of two other budget smartphones t… [+2325 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Deadly solar storm coming towards Earth today; CME clouds approaching fast - HT Tech", "description": "In just a little while from now, the Earth is expected to be hit by a powerful solar storm event as a CME cloud released on July 28 is headed in our direction. Check details.", "url": "https://tech.hindustantimes.com/tech/news/deadly-solar-storm-coming-towards-earth-today-cme-clouds-approaching-fast-71690868022326.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/01/1600x900/faintyoung_2_1690868080559_1690868080828.jpg", "publishedAt": "2023-08-01T05:56:21Z", "content": "The last solar activity in the month of July will finally show consequences in August as the coronal mass ejection (CME) cloud that was released during a magnetic filament eruption on July 28 is expe… [+2118 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US In Crucial Talks With Taliban To Address Afghan Humanitarian Crisis - NDTV", "description": "A group of senior American diplomats met representatives from the Taliban and technocratic professionals during which they discussed critical issues concerning Afghanistan's well-being and humanitarian crisis, the State Department said.", "url": "https://www.ndtv.com/world-news/us-in-crucial-talks-with-taliban-to-address-afghan-humanitarian-crisis-4257513", "urlToImage": "https://c.ndtvimg.com/2022-03/78dt6h54_taliban-generic-reuters_625x300_28_March_22.jpg", "publishedAt": "2023-08-01T03:52:17Z", "content": "The interaction took place in Doha on July 30 and July 31.\r\nDoha: A group of senior American diplomats met representatives from the Taliban and technocratic professionals during which they discussed … [+2958 chars]"}]}