{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "DH Web Desk", "title": "Apple Event September 2022: Here's what to expect at 'Far out' programme - Deccan Herald", "description": "Cupertino-based technology major Apple is all geared up to host the company's flagship fall hardware event later this week on September 7. Apple is slated to kick off the event at 10:00 am PT (10:30 pm IST), Wednesday, at the company's HQ and like the previou…", "url": "https://www.deccanherald.com/business/technology/apple-event-september-2022-heres-what-to-expect-at-far-out-programme-1142642.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/09/06/apple-far-out-event-teaser-1142642-1662452337.jpg", "publishedAt": "2022-09-06T07:29:48Z", "content": "Cupertino-based technology major Apple is all geared up to host the company's flagship fall hardware event later this week on September 7.\r\nApple is slated to kick off the event at 10:00 am PT (10:30… [+3213 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Dynamical Framework for Turbulence Uncovered by Physicists - SciTechDaily", "description": "Findings reveal a new 'roadmap' for turbulence research with a broad range of applications, including more accurate weather forecasts and improving the fuel efficiency of cars and airplanes. Although most people don't think about it, turbulence plays a key ro…", "url": "https://scitechdaily.com/new-dynamical-framework-for-turbulence-uncovered-by-physicists/", "urlToImage": "https://scitechdaily.com/images/New-Dynamical-Framework-for-Turbulence-scaled.jpg", "publishedAt": "2022-09-06T05:37:52Z", "content": "The researchers experiment featured transparent walls to allow full visual access and used a state-of-the-art flow visualization. Credit: Michael Schatz\r\nFindings reveal a new roadmap for turbulence … [+7350 chars]"}, {"source": {"id": null, "name": "Cravingtech.com"}, "author": "Michael Aulia", "title": "New desktop label printers range from Brother - Craving Tech", "description": "Facebook Twitter LinkedIn More Brother International Australia announced three new P-touch desktop label printers for all your labelling needs: PT-D410, PT-D460BT, and PT-D610BT ranging from basic to advance use. The new label printers will support a variety …", "url": "https://www.cravingtech.com/new-desktop-label-printers-range-from-brother.html", "urlToImage": "https://www.cravingtech.com/blog/wp-content/uploads/2022/09/Brother-new-label-printers-2022-scaled.jpg", "publishedAt": "2022-09-06T03:45:34Z", "content": "Brother International Australia announced three new P-touch desktop label printers for all your labelling needs: PT-D410, PT-D460BT, and PT-D610BT ranging from basic to advance use. The new label pri… [+3382 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "New Xiaomi Smart AIoT devices Malaysia release: a smart speaker, electric toothbrush, hair dryer & more from RM199 - TechNave", "description": "Xiaomi Malaysia&nbsp;just introduced a wide array of smart AIoT products and all of them will be arriving for the 9.9 sales. Besides the&nbsp;Xiaomi Smart TV A2", "url": "https://technave.com/gadget/New-Xiaomi-Smart-AIoT-devices-Malaysia-release-a-smart-speaker-electric-toothbrush-hair-dryer-more-from-RM199-31624.html", "urlToImage": "https://technave.com/data/files/article/202209060334549933.jpg", "publishedAt": "2022-09-06T03:39:07Z", "content": "Xiaomi Malaysia just introduced a wide array of smart AIoT products and all of them will be arriving for the 9.9 sales. Besides the Xiaomi Smart TV A2 Series, Redmi Buds 4 Series and the Smart Air Fr… [+2067 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "Stocks in the news: Dreamfolks Services, Dixon Tech, Cipla, Adani Ports and Reliance Power - Economic Times", "description": "The company is pivoting from a prescription manufacturing service to an original device manufacturer (ODM) for smart TVs, having acquired sub-licensing rights for Google TV and Android TV from Google. The rights, announced by Dixon on Monday, will enable the …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/stocks-in-the-news-dreamfolks-services-dixon-tech-cipla-adani-ports-and-reliance-power/articleshow/94015352.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94015394,width-1070,height-580,imgsize-765180,overlay-etmarkets/photo.jpg", "publishedAt": "2022-09-06T02:37:00Z", "content": "NEW DELHI: Nifty futures on the Singapore Exchange traded 47.5 points, or 0.27 per cent, higher at 17,732, signalling that Dalal Street was headed for a positive start on Tuesday. Here are a handful … [+2945 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": "David M. Hale", "title": "Despite Cade Klubnik's star turn late vs. Georgia Tech, DJ Uiagalelei remains Clemson starter, coaches say - ESPN", "description": "Clemson's DJ Uiagalelei overcame a slow start on Monday against Georgia Tech and \"did some good things that he didn't do last year,\" according to OC Brandon Streeter. Meanwhile, freshman Cade Klubnik closed out the win with a thrilling 66-yard TD drive.", "url": "https://www.espn.com/college-football/story/_/id/34532619/despite-cade-klubnik-star-turn-late-win-georgia-tech-dj-uiagalelei-remains-clemson-tigers-starting-qb", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0906%2Fr1057893_1296x729_16%2D9.jpg", "publishedAt": "2022-09-06T02:32:55Z", "content": "ATLANTA -- Clemson closed out an uneven performance on Monday in its opener against Georgia Tech with a thrilling 10-play, 66-yard touchdown drive led by freshman Cade Klubnik, but following the 41-1… [+3782 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Powerful New Antibody Neutralizes All Known COVID Variants - SciTechDaily", "description": "Future vaccine development may be inspired by the findings. Therapeutic antibodies that were effective early in the pandemic have lost their efficacy as SARS-CoV-2 has changed and mutated, and more recent variants, particularly Omicron, have learned how to ci…", "url": "https://scitechdaily.com/powerful-new-antibody-neutralizes-all-known-covid-variants/", "urlToImage": "https://scitechdaily.com/images/Antibodies-Attacking-Coronavirus-Virus-Cell.gif", "publishedAt": "2022-09-06T02:24:01Z", "content": "ByBoston Children's HospitalSeptember 5, 2022\r\nThe antibody could greatly improve our ability to defend against future variants.\r\nFuture vaccine development may be inspired by the findings.\r\nTherapeu… [+5249 chars]"}, {"source": {"id": null, "name": "BikeRadar.com"}, "author": "Katherine Moore", "title": "Do you need a dropper post on your gravel bike? And 4 of the best - BikeRadar", "description": "An essential for technical off-road riding or an unnecessary gadget?", "url": "https://www.bikeradar.com/advice/buyers-guides/best-gravel-dropper-posts/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/21/2019/07/Vielo-V1-05-0e7f92c.jpg?quality=90&resize=620,413", "publishedAt": "2022-09-05T17:00:35Z", "content": "A dropper post is a seatpost that can be lowered via the actuation of a lever, typically located on the handlebar, to allow you to drop the height of the saddle. This adjustment gives the rider a gre… [+12288 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ultra-Processed Foods Linked With Heart Disease, Bowel Cancer and Death - SciTechDaily", "description": "Findings add further evidence in support of policies that limit ultra-processed foods. Two large research studies published by The BMJ last week find links between high consumption of ultra-processed foods and increased risks of cardiovascular disease, bowel …", "url": "https://scitechdaily.com/ultra-processed-foods-linked-with-heart-disease-bowel-cancer-and-death/", "urlToImage": "https://scitechdaily.com/images/Hot-Dog-and-Chips.jpg", "publishedAt": "2022-09-05T14:12:08Z", "content": "Newly published research links high consumption of ultra-processed foods and increased risks of cardiovascular disease, colorectal cancer, and death.\r\nFindings add further evidence in support of poli… [+5981 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jupiter's Complex Colors Revealed in Stunning Images From NASA's Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft observed the complex colors and structure of Jupiter’s clouds on July 5, 2022, as it completed its 43rd close flyby of the giant planet. Citizen scientist Björn Jónsson from Iceland created these two images using raw data from the JunoC…", "url": "https://scitechdaily.com/jupiters-complex-colors-revealed-in-stunning-images-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Jupiters-Complex-Colors-Processed.jpg", "publishedAt": "2022-09-05T09:31:54Z", "content": "ByNASASeptember 5, 2022\r\nThe image was processed to portray the approximate colors that the human eye would see from Junos vantage point. Credit: Image data: NASA/JPL-Caltech/SwRI/MSSS, Image process… [+2873 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa has more than load shedding to worry about: economists - BusinessTech", "description": "Weeks of load shedding and the flooding in KwaZulu Natal are expected to be the key drivers behind a decline in economic growth for the second quarter of this year, say economists at the Bureau for Economic Research (BER) – however, the country’s worries exte…", "url": "https://businesstech.co.za/news/finance/622711/south-africa-has-more-than-load-shedding-to-worry-about-economists/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Rand-Bloomberg.jpg", "publishedAt": "2022-09-05T07:19:14Z", "content": "Weeks of load shedding and the flooding in KwaZulu Natal are expected to be the key drivers behind a decline in economic growth for the second quarter of this year, say economists at the Bureau for E… [+3593 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dangerous asteroid towards Earth at terrifying speed today! NASA reveals details - HT Tech", "description": "A dangerous asteroid is speeding towards the Earth today. It will be coming very close to Earth, but will it hit Earth or miss our planet? This asteroid is massive in size!", "url": "https://tech.hindustantimes.com/tech/news/dangerous-asteroid-towards-earth-at-terrifying-speed-today-nasa-reveals-details-71662357066630.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/05/1600x900/imagesspitzerspitzer-042005-640_1659699188452_1662357128076_1662357128076.jpg", "publishedAt": "2022-09-05T05:57:47Z", "content": "Another day, another asteroid flyby. It's been the same story the past couple of months with more than 40 asteroids passing by Earth quite closely in August alone. Now, a dangerous asteroid is speedi… [+1701 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Covid app that detects virus in your voice 'more accurate than lateral flow tests' - The Telegraph", "description": "Technology could be used to quickly screen people before mass events or in poor countiries that can't afford PCR tests", "url": "https://www.telegraph.co.uk/news/2022/09/04/covid-app-detects-virus-voice-accurate-lateral-flow-tests/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/09/04/TELEMMGLPICT000306133375_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwSX5rhseiWKOo9p9OQ-ymek.jpeg?impolicy=logo-overlay", "publishedAt": "2022-09-04T22:01:00Z", "content": "An app that can detect coronavirus in your voice has been developed in a major scientific breakthrough.\r\nThe AI-powered technology is easier to use and more accurate than a lateral flow test, scienti… [+4352 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Griffin Davis", "title": "Will Earth De-Orbit From Solar System? Aerospace Engineer Shares His Explanation - Tech Times", "description": "An aerospace engineer shares his explanation regarding its possibility.", "url": "https://www.techtimes.com/articles/280070/20220904/will-earth-de-orbit-solar-system-aerospace-engineer-shares-explanation.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/410887/will-earth-de-orbit-from-solar-system-aerospace-engineer-shares-his-explanation.jpg", "publishedAt": "2022-09-04T16:22:36Z", "content": "Will Earth de-orbit from the solar system? This is one of the things that can end the life of the planet. \r\nFor the past few years, many individuals have speculated that Earth can move away from its … [+2971 chars]"}]}