{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "PBS"}, "author": null, "title": "Musk’s backing of far-right AfD party creates uproar in Germany ahead of key elections - PBS NewsHour", "description": "Tech entrepreneur Elon Musk caused uproar after backing Germany’s far-right party in a major newspaper ahead of key parliamentary elections in the Western European country, leading to the resignation of the paper’s opinion editor in protest.", "url": "https://www.pbs.org/newshour/world/musks-backing-of-far-right-afd-party-creates-uproar-in-germany-ahead-of-key-elections", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2024/12/2024-10-27T234112Z_1385168774_RC2BTAAGQA81_RTRMADP_3_USA-ELECTION-TRUMP-1024x695.jpg", "publishedAt": "2024-12-29T20:01:46Z", "content": "BERLIN (AP) Tech entrepreneur Elon Musk caused uproar after backing Germanys far-right party in a major newspaper ahead of key parliamentary elections in the Western European country, leading to the … [+2669 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA’s Parker Solar Probe: The Fastest Human-Made Object Just “Touched” the Sun and Shattered Records - SciTechDaily", "description": "NASA's Parker Solar Probe has shattered records by venturing closer to the Sun than ever before, reaching blazing speeds of 430,000 mph. Equipped with groundbreaking technology, it braved extreme temperatures to collect invaluable data, promising to reshape o…", "url": "https://scitechdaily.com/nasas-parker-solar-probe-the-fastest-human-made-object-just-touched-the-sun-and-shattered-records/", "urlToImage": "https://scitechdaily.com/images/NASA-Parker-Solar-Probe-CME.jpg", "publishedAt": "2024-12-28T15:11:51Z", "content": "After six years of preparation, Parker Solar Probe achieved a historic milestone by “touching” the Sun, unlocking mysteries of the solar atmosphere and revealing the origins of solar wind and energet… [+8168 chars]"}]}