{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Europe's Ancient Freeze: New Study Reveals Ancient Cooling Wiped Out Early Humans - SciTechDaily", "description": "Paleoclimate evidence indicates that roughly 1.1 million years ago, there was a significant drop in temperature in southern Europe. This climate shift likely led to the disappearance of early human populations in the region, according to a new study led by UC…", "url": "https://scitechdaily.com/europes-ancient-freeze-new-study-reveals-ancient-cooling-wiped-out-early-humans/", "urlToImage": "https://scitechdaily.com/images/Homo-Erectus-Cold-Climate.jpg", "publishedAt": "2023-08-12T20:33:02Z", "content": "New research reveals that an extreme glacial cooling around 1.1 million years ago in southern Europe likely led to the extinction of early humans on the continent. This discovery challenges the previ… [+4572 chars]"}, {"source": {"id": null, "name": "Fagenwasanni.com"}, "author": "Chelsea Johnson", "title": "India's Chandrayaan-3 Nears Moon's Surface After Orbit Reduction Manoeuvres - Fagen wasanni", "description": "India's Chandrayaan-3 Nears Moon's Surface After Orbit Reduction Manoeuvres - Fagen Wasanni Technologies", "url": "https://fagenwasanni.com/news/indias-chandrayaan-3-nears-moons-surface-after-orbit-reduction-manoeuvres/189388/", "urlToImage": "https://fagenwasanni.com/wp-content/uploads/2023/07/mfrack_realistic_photo_of_man_reading_internet_news_0fc24a9b-d990-4481-8e41-108d5fa2abfd.jpeg", "publishedAt": "2023-08-12T20:24:22Z", "content": "India’s Chandrayaan-3 spacecraft has moved closer to the Moon’s surface after undergoing an orbit reduction manoeuvre. Launched on July 14, the mission entered lunar orbit on August 5, and the recent… [+1928 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Journey Around the Moon: Artemis II Crew Inspects Orion Spacecraft Ahead of Historic Mission - SciTechDaily", "description": "Artemis II NASA astronauts visited the Orion spacecraft at Kennedy Space Center, in preparation for a 10-day journey around the Moon. The mission aims to test key technologies for human deep space exploration, and it marks an important milestone toward landin…", "url": "https://scitechdaily.com/journey-around-the-moon-artemis-ii-crew-inspects-orion-spacecraft-ahead-of-historic-mission/", "urlToImage": "https://scitechdaily.com/images/Artemis-II-Crew-Visits-Their-Orion-Spacecraft-scaled.jpg", "publishedAt": "2023-08-12T10:53:49Z", "content": "ByNASAAugust 12, 2023\r\nInside the Neil Armstrong Operations and Checkout Building at NASAs Kennedy Space Center, Artemis II NASA astronauts and a CSA astronaut visited the Orion spacecraft, which wil… [+2739 chars]"}]}