{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "301-foot Asteroid 2023 FY13 rushing towards Earth, says NASA; speeding at a scary 42923 kmph - HT Tech", "description": "NASA has revealed information about an asteroid which is expected to pass Earth soon. Know details such as its speed, distance and more.", "url": "https://tech.hindustantimes.com/tech/news/301foot-asteroid-2023-fy13-rushing-towards-earth-says-nasa-speeding-at-a-scary-42923-kmph-71680842707046.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/07/1600x900/asteroid_wiki_media_1679805029207_1680843092281_1680843092281.jpg", "publishedAt": "2023-04-07T04:52:41Z", "content": "Asteroid 2023 FY13 is on way and it is set to have a close encounter with Earth. Apart from tracking asteroids to get early warning about those that pose a threat to earth, scientists also study them… [+1889 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! M3-class solar flare sparks blackouts over Indian Ocean - HT Tech", "description": "A M3-class solar flare erupted on the Sun and it caused radio blackouts over the Indian Ocean region. Astronomers fear that it can also lead to another solar storm in the coming days.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-m3-class-solar-flare-sparks-blackouts-over-indian-ocean-71680839276196.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/07/1600x900/solar-flare-67532_1920_1_1663740280289_1680839304186_1680839304186.jpg", "publishedAt": "2023-04-07T03:52:18Z", "content": "The Earth might have lucked out on Wednesday when it narrowly escaped the incoming wave of a coronal mass ejection (CME) cloud and avoided a solar storm event. However, things took a turn for the wor… [+2308 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "Apple Stores to showcase a new retail experience to Indian customers, hoping to make the right ‘connections’ - The Indian Express", "description": "With Apple opening its first retail store in Mumbai later this month, followed by another store in Delhi, the world's most valuable tech company is digging deeper into the Indian market.", "url": "https://indianexpress.com/article/technology/apple-stores-to-showcase-a-new-retail-experience-to-indian-customers-hoping-to-make-the-right-connections-8543066/", "urlToImage": "https://images.indianexpress.com/2023/04/Apple-Store-Mumbai-India-.jpg", "publishedAt": "2023-04-07T01:22:36Z", "content": "As soon as you enter the flagship Apple Store at Dubai Mall, you get drawn into the vastness of the space. This is less of a retail store and more of a town square, a place where you hang out, gain k… [+6189 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Heike Bräuer", "title": "Researchers make an important step towards the quantum internet using diamond nanostructures - Phys.org", "description": "Diamond material is of great importance for future technologies such as the quantum internet. Special defect centers can be used as quantum bits (qubits) and emit single light particles that are referred to as single photons.", "url": "https://phys.org/news/2023-04-important-quantum-internet-diamond-nanostructures.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/researchers-make-an-im-1.jpg", "publishedAt": "2023-04-06T20:02:04Z", "content": "Diamond material is of great importance for future technologies such as the quantum internet. Special defect centers can be used as quantum bits (qubits) and emit single light particles that are refe… [+3498 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering Inflammation's Achilles Heel: The Breakthrough That Could Change Medicine - SciTechDaily", "description": "Researchers at Kyoto University have found that neutrophils, a type of white blood cell, can induce anti-inflammatory macrophages (M2) within granulomas, which are dense globular structures that form during chronic inflammation. This M2 macrophage polarizatio…", "url": "https://scitechdaily.com/discovering-inflammations-achilles-heel-the-breakthrough-that-could-change-medicine/", "urlToImage": "https://scitechdaily.com/images/Neutrophil-White-Blood-Cell-Illustration.jpg", "publishedAt": "2023-04-05T23:51:59Z", "content": "Kyoto University researchers discovered that neutrophils can induce anti-inflammatory macrophages within granulomas, offering potential insights into chronic inflammation and tumor development. This … [+3832 chars]"}]}