{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Solar Flares to Sahara Skies: RHESSI's Fiery Return to Earth - SciTechDaily", "description": "NASA’s retired Reuven Ramaty High Energy Solar Spectroscopic Imager (RHESSI) spacecraft re-entered Earth’s atmosphere at 8:21 p.m. EDT on Wednesday, April 19, almost 21 years after its launch. From 2002 to its decommissioning in 2018, RHESSI observed solar fl…", "url": "https://scitechdaily.com/from-solar-flares-to-sahara-skies-rhessis-fiery-return-to-earth/", "urlToImage": "https://scitechdaily.com/images/Reuven-Ramaty-High-Energy-Solar-Spectroscopic-Imager-RHESSI.gif", "publishedAt": "2023-04-23T02:24:07Z", "content": "ByNASAApril 22, 2023\r\nNASAs RHESSI spacecraft re-entered Earths atmosphere after nearly 21 years, during which it observed solar flares and provided crucial data on their underlying physics. The data… [+7379 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 454 answer for April 23: Relax, you got this! Check hints, clues, solutions - HT Tech", "description": "Quordle 454 answer for April 23: While the puzzle today is easier than yesterday, it is still filled with tricks that can steal your winning streak. Tread carefully and use these Qurodle hints, clues, solutions.", "url": "https://tech.hindustantimes.com/how-to/quordle-454-answer-for-april-23-relax-you-got-this-check-hints-clues-solutions-71682210975766.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/23/1600x900/HT_Tech_30_1682211095364_1682211095575.jpg", "publishedAt": "2023-04-23T00:52:17Z", "content": "Quordle 454 answer for April 23: Sunday's are supposed to be the day to relax. But the biggest obstacle to that is a Quordle puzzle. Yet, one can simply not solve a puzzle because the winning streak … [+1838 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shivendra Kumar", "title": "Q4 Earnings Decoded: Key takeaways for investors from ICICI Bank, Yes Bank, Macrotech Developers - The Economic Times", "description": "Marcrotech Developers Q4 Results: PAT jumps 40% YoY to Rs 1,769 crore on record pre-sales", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/q4-earnings-decoded-key-takeaways-for-investors-from-icici-bank-yes-bank-macrotech-developers/articleshow/99694657.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99694772,width-1070,height-580,imgsize-73738,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-22T14:25:00Z", "content": "Several listed companies announced their March quarter earnings today. Among them were ICICI Bank, which reported a 30% year-on-year jump in its net profit to Rs 9,121.87 crore. The company also anno… [+5495 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "Xiaomi 13 Ultra Gets The Teardown Treatment, Disassembly Shows Massive Camera Configuration That Dwarfs Competition - Wccftech", "description": "Four 50MP cameras are found at the rear of the Xiaomi 13 Ultra and the latest teardown shows how that limited space was used up", "url": "https://wccftech.com/xiaomi-13-ultra-teardown-reveals-massive-cameras/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/04/Xiaomi-13-Ultra-teardown.jpg", "publishedAt": "2023-04-22T13:08:00Z", "content": "The Xiaomi 13 Ultra not only gained a significant foothold in the flagship market by offering the best-in-class hardware for an Android handset, but the company also managed to make the most of the l… [+2039 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Massive magnetic filament EXPLOSION on Sun blasts CME towards Earth; Solar storm to wreak havoc in 2 days - HT Tech", "description": "Just hours ago, a massive explosion was detected on the surface of the Sun. Forecasters have revealed that a CME burst was released toward the Earth during the explosion. It can cause a terrifying solar storm in days to come.", "url": "https://tech.hindustantimes.com/tech/news/massive-magnetic-filament-explosion-on-sun-blasts-cme-towards-earth-solar-storm-to-wreak-havoc-in-2-days-71682137687576.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/22/1600x900/Untitled_design_73_1682137952311_1682137952459.png", "publishedAt": "2023-04-22T04:37:25Z", "content": "A few days ago, several astronomers warned about the high number of magnetic filaments present on the Earth-facing side of the Sun. These looping structures are filled with plasma and magnetic fields… [+2508 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stellar Assassins: NASA's Chandra Unmasks New Cosmic Threat to Planetary Life - SciTechDaily", "description": "Astronomers have determined supernova explosions pose yet another threat to planets and their atmospheres. This result comes from analysis of X-ray observations for over 30 supernovae using NASA’s Chandra X-ray Observatory and other telescopes. For some types…", "url": "https://scitechdaily.com/stellar-assassins-nasas-chandra-unmasks-new-cosmic-threat-to-planetary-life/", "urlToImage": "https://scitechdaily.com/images/Supernova-Planet-scaled.jpg", "publishedAt": "2023-04-21T17:15:18Z", "content": "Earth is in a safe space in terms of potentially harmful supernova explosions, but may not have been in the past.Astronomers using data from NASAs Chandra X-ray Observatory and other telescopes have … [+3405 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Develop Next-Gen Fuel Cell Membrane With Unmatched Conductivity - SciTechDaily", "description": "Researchers at Nagoya University in Japan, under a project commissioned by the New Energy and Industrial Technology Development Organization (NEDO), have created poly(styrenesulfonic acid)-based PEMs with a high density of sulfonic acid groups. A crucial elem…", "url": "https://scitechdaily.com/scientists-develop-next-gen-fuel-cell-membrane-with-unmatched-conductivity/", "urlToImage": "https://scitechdaily.com/images/Ultra-High-Density-Sulfonic-Acid-Polymer-Electrolyte-Membrane-for-Fuel-Cells.jpg", "publishedAt": "2023-04-21T16:08:57Z", "content": "ByNagoya UniversityApril 21, 2023\r\nResearchers develop a new ultra-high-density sulfonic acid polymer electrolyte membrane for fuel cells, which can be used for vehicles and combined heat and power s… [+2515 chars]"}, {"source": {"id": null, "name": "Graphene-Info"}, "author": null, "title": "Researchers study 'sandwich' of graphene and boron nitride for next-gen microelectronics - Graphene-Info", "description": "Graphene conducts electricity well – too well, in fact, to be useful in microelectronic technology. But by sandwiching graphene between two layers of boron nitride, which also has a hexagonal pattern, a moiré pattern results. The presence of this pattern is a…", "url": "https://www.graphene-info.com/researchers-study-sandwich-graphene-and-boron-nitride-next-gen-microelectronics", "urlToImage": null, "publishedAt": "2023-04-21T07:44:08Z", "content": "Graphene conducts electricity well too well, in fact, to be useful in microelectronic technology. But by sandwiching graphene between two layers of boron nitride, which also has a hexagonal pattern, … [+2821 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Mohammad Haris", "title": "TCS, Infosys, HCL Tech: All About IT Companies' Employee Count, Attrition And Hiring In Q4FY23 - News18", "description": "Indian IT companies including TCS, Infosys, and HCL Tech have reported a slowdown in hiring as well as a fall in attrition rates in the March 2023 quarter", "url": "https://www.news18.com/business/tcs-infosys-hcl-tech-all-about-it-companies-employee-count-attrition-and-hiring-in-q4fy23-7601341.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2023/04/tcs-1-168205675916x9.jpg", "publishedAt": "2023-04-21T06:11:00Z", "content": "Global tech companies have been resorting to layoffs to cut costs amid economic uncertainties since last year. Amid this, in the latest quarter ended March 2023, IT companies in India including TCS, … [+3369 chars]"}]}