{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Solar Conjunction: Spacecraft Fall Silent as Mars Disappears Behind the Sun - SciTechDaily", "description": "The space between Earth and Mars is usually buzzing with science data, telemetry, and commands racing to and from almost a dozen missions at the Red Planet. But for roughly one and a half days this November, communication between the planets will fall silent …", "url": "https://scitechdaily.com/solar-conjunction-spacecraft-fall-silent-as-mars-disappears-behind-the-sun/", "urlToImage": "https://scitechdaily.com/images/Mars-Solar-Conjunction-Concept.jpg", "publishedAt": "2023-11-20T03:13:39Z", "content": "ByEuropean Space Agency (ESA)November 19, 2023\r\nThe solar conjunction of Mars occurs approximately every 25 months, disrupting communication with Mars missions. In 2023, Mars will pass directly behin… [+6645 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sarah Fortinsky", "title": "Elon Musk addresses claims of antisemitism: ‘Nothing could be further from the truth’ - The Hill", "description": "Tech mogul Elon Musk on Sunday addressed public backlash to his recent post on X, the platform formerly known as Twitter, in which he appeared to endorse an antisemitic conspiracy theory about Jewish people espoused by another X user. “This past week, there w…", "url": "https://thehill.com/policy/technology/4318008-elon-musk-addresses-claims-of-antisemitism-nothing-could-be-further-from-the-truth/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/11/AP23305462183981-e1700147358965.jpg?w=1280", "publishedAt": "2023-11-20T01:10:00Z", "content": "Skip to content\r\nTech mogul Elon Musk on Sunday addressed public backlash to his recent post on X, the platform formerly known as Twitter, in which he appeared to endorse an antisemitic conspiracy th… [+2694 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Berber Jin, Deepa Seetharaman, Tom Dotan, Keach Hagey", "title": "Sam Altman's Counter-Rebellion Leaves OpenAI Leadership Hanging in the Balance - The Wall Street Journal", "description": "Ousted chief is pushing to return with a new board that could include tech veterans like Bret Taylor, Brian Chesky and Laurene Powell Jobs", "url": "https://www.wsj.com/tech/ai/openai-leadership-hangs-in-balance-as-sam-altmans-counte-rebellion-gains-steam-47276fa8", "urlToImage": "https://images.wsj.net/im-889272/social", "publishedAt": "2023-11-19T23:46:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Triangular Triumph: Unraveling the Mystery of Quantum Spin Liquids After 50 Years - SciTechDaily", "description": "A collaborative research team has confirmed quantum spin liquid behavior in the material KYbSe2, validating a decades-old hypothesis. This breakthrough, significant for quantum computing and superconductor development, was achieved using advanced neutron scat…", "url": "https://scitechdaily.com/triangular-triumph-unraveling-the-mystery-of-quantum-spin-liquids-after-50-years/", "urlToImage": "https://scitechdaily.com/images/Quantum-Material-Spin-Liquid-Concept.jpg", "publishedAt": "2023-11-19T23:29:58Z", "content": "Researchers have studied the triangular lattice of various materials in search of QSL behavior, said QSC member and lead author Allen Scheie, a staff scientist at Los Alamos. One advantage of this on… [+4652 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "William A. Haseltine", "title": "Can Light And Sound Therapy Treat Alzheimer’s Disease? Part 3 - Forbes", "description": "Cognito Therapeutics, an MIT-based neurotechnology company, made headlines this year when they announced a $73 million investment into a premier therapy for Alzheimer’s.", "url": "https://www.forbes.com/sites/williamhaseltine/2023/11/19/can-light-and-sound-therapy-treat-alzheimers-disease-part-3/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/655a7b7d00f1f3198d6d0c42/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2023-11-19T21:26:16Z", "content": "The emergence of electrical brain activity as a possible therapeutic target has uncovered new ... [+] insights into how Alzheimers develops and progresses.\r\ngetty\r\nCognito Therapeutics, a neurotechno… [+4898 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "EMIT: NASA's Unexpected Hero in the Climate Crisis - SciTechDaily", "description": "Since launching 16 months ago, the EMIT imaging spectrometer aboard the International Space Station has shown an ability to detect more than just surface minerals. More than a year after first detecting methane plumes from its perch aboard the International S…", "url": "https://scitechdaily.com/?p=329357", "urlToImage": "https://scitechdaily.com/images/Methane-Natural-Gas-Flaring-Concept.jpg", "publishedAt": "2023-11-19T21:09:51Z", "content": "ByJet Propulsion LaboratoryNovember 19, 2023\r\nFlaring, in which excess natural gas is intentionally burned into the air, is one way methane is released from oil and gas facilities. NASAs EMIT mission… [+10482 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Microglia's Key Function in Brain Development Uncovered - SciTechDaily", "description": "Scientists have found that microglia play a crucial role in regulating the number of cells that become neurons in the brain, enhancing our understanding of brain development and disorders. An international team of scientists has uncovered the vital role of mi…", "url": "https://scitechdaily.com/microglias-key-function-in-brain-development-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-Organoid-Petri-Dish-Art-Concept.jpg", "publishedAt": "2023-11-19T19:49:57Z", "content": "ByAgency for Science, Technology and Research (A*STAR), SingaporeNovember 19, 2023\r\nResearchers have discovered the vital role of microglia in brain development by studying lab-grown brain organoids.… [+8612 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NISAR's Odyssey: Pioneering Earth-Observing Satellite Clears Crucial Test - SciTechDaily", "description": "During three weeks in a thermal vacuum chamber in Bengaluru, India, the joint NASA-ISRO satellite demonstrated its hardiness in a harsh, space-like environment. NISAR, the trailblazing Earth-observing radar satellite being developed by the United States and I…", "url": "https://scitechdaily.com/?p=329199", "urlToImage": "https://scitechdaily.com/images/NASA-NISAR-Orbit-Illustration-scaled.jpg", "publishedAt": "2023-11-19T13:28:33Z", "content": "ByJet Propulsion LaboratoryNovember 19, 2023\r\nAfter it launches in early 2024, NISAR will scan nearly all of the planets land and ice twice every 12 days. In orbit, the satellite will extend its sola… [+3131 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI Payload 2.0: Essential tips and tactics for success in the revamped mode - HT Tech", "description": "Unlock the secrets of BGMI Payload 2.0 with essential tips! From breaking sealed doors to drone warfare, master the game's upgraded features for ultimate victory.", "url": "https://tech.hindustantimes.com/how-to/bgmi-payload-2-0-essential-tips-and-tactics-for-success-in-the-revamped-mode-71700379686767.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/19/1600x900/BGMI__1700379903342_1700379903585.jpg", "publishedAt": "2023-11-19T07:45:54Z", "content": "Unleash the full potential of BGMI Payload 2.0, the revamped edition of Payload mode that introduces thrilling enhancements to the classic battle royale experience. With heavier weaponry, flying vehi… [+1971 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "When Telescopes Fall: The Daring Recovery of NASA's Dark Matter Data - SciTechDaily", "description": "And the recovery journey involving a smashed telescope, a cougar scare, and police. Data from a NASA mission to map dark matter around galaxy clusters has been saved by a new recovery system designed by scientists at the University of Sydney. The system allow…", "url": "https://scitechdaily.com/when-telescopes-fall-the-daring-recovery-of-nasas-dark-matter-data/", "urlToImage": "https://scitechdaily.com/images/Tarantula-Nebula-SuperBIT-scaled.jpg", "publishedAt": "2023-11-19T05:21:06Z", "content": "ByUniversity of SydneyNovember 18, 2023\r\nThe Tarantula Nebula taken by the Super Pressure Balloon Imaging Telescope (SuperBIT). Credit: NASA/SuperBIT\r\nAnd the recovery journey involving a smashed tel… [+6796 chars]"}]}