{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking Physics: Muon G-2 Experiment Reinforces Surprise Result, Setting Up “Ultimate Showdown” - SciTechDaily", "description": "Findings at Fermilab show discrepancy between theory and experiment, which may lead to new physics beyond the Standard Model. Physicists now have a brand-new measurement of a property of the muon called the anomalous magnetic moment that improves the precisio…", "url": "https://scitechdaily.com/breaking-physics-muon-g-2-experiment-reinforces-surprise-result-setting-up-ultimate-showdown/", "urlToImage": "https://scitechdaily.com/images/Sub-Atomic-Particle-Quantum-Physics-Art-Illustration.jpg", "publishedAt": "2023-08-13T15:33:40Z", "content": "ByFermi National Accelerator LaboratoryAugust 13, 2023\r\nFermilabs Muon g-2 experiment has unveiled a new precision measurement of the muons magnetic property, hinting at undiscovered particles and a … [+10610 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Roshni Agarwal", "title": "Ahead of Market: 10 things that will decide D-Street action on Monday - The Economic Times", "description": "“Nifty restricted its move to 230 odd points in the eventful week, showcasing timidity among the counterparties. Technically speaking, amidst the ongoing consolidation in the market, the chart structure construes a time-wise correction, which is to be taken a…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/ahead-of-market-10-things-that-will-decide-d-street-action-on-monday/articleshow/102698160.cms", "urlToImage": "https://economictimes.indiatimes.com/thumb/msid-102698198,width-1070,height-580,imgsize-88698,overlay-etmarkets/photo.jpg", "publishedAt": "2023-08-13T11:59:00Z", "content": "Benchmark equity indices Sensex and Nifty declined for a second straight day on Friday due to selling in banking, FMCG, and pharma shares amid a negative trend in Asian and European markets. The dome… [+4903 chars]"}]}