{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Techcircle.in"}, "author": null, "title": "Qualcomm runs AI art generator Stable Diffusion on an Android phone - TechCircle", "description": "Qualcomm announced that it has conducted the world's first demonstration of the artificial intelligence (AI) art generator Stable Diffusion on an Android smartphone. The smartphone used for the demo ran on Qualcomm’s latest Snapdragon 8 Gen 2 processor, which…", "url": "https://www.techcircle.in/2023/02/24/qualcomm-runs-ai-art-generator-stable-diffusion-on-an-android-phone/", "urlToImage": "https://assets.techcircle.in/uploads/article-image/2023/02/images/32160-stable-diffusion-images-2.png", "publishedAt": "2023-02-24T09:32:22Z", "content": "Qualcomm announced that it has conducted the world's first demonstration of the artificial intelligence (AI) art generator Stable Diffusion on an Android smartphone. The smartphone used for the demo … [+1909 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Saiful Ridzaimi", "title": "MSI Malaysia launches all-new laptops with NVIDIA GeForce RTX 40 series and up to 13th Gen Intel Core HX - TechNave", "description": "MSI Malaysia yesterday officially launched its all-new laptop lineup for the local market. Equipped with the latest NVIDIA GeForce RTX 40 series GPUs, consumers", "url": "https://technave.com/gadget/MSI-Malaysia-launches-all-new-laptops-with-NVIDIA-GeForce-RTX-40-series-and-up-to-13th-Gen-Intel-Core-HX-33561.html", "urlToImage": "https://technave.com/data/files/article/202302240858386444.jpg", "publishedAt": "2023-02-24T09:18:22Z", "content": "MSI Malaysia yesterday officially launched its all-new laptop lineup for the local market. Equipped with the latest NVIDIA GeForce RTX 40 series GPUs, consumers in our country can enjoy FREE USD100 o… [+1390 chars]"}, {"source": {"id": null, "name": "Www.dal.ca"}, "author": null, "title": "Sun shines on Dal clean tech researcher's powerful air capture project - Dal News", "description": "Chemistry researcher Dr. Mita Dasog has received a funding award in support of a collaborative project that could revolutionize the technology used to extract carbon dioxide directly from the atmosphere.", "url": "https://www.dal.ca/news/2023/02/24/sun-shines-on-dal-clean-tech-researcher-s-powerful-air-capture-p.html", "urlToImage": "https://cdn.dal.ca/news/2023/02/24/sun-shines-on-dal-clean-tech-researcher-s-powerful-air-capture-p/_jcr_content/image.adaptive.full.high.jpg/1677097443624.jpg", "publishedAt": "2023-02-23T22:33:42Z", "content": "Dalhousie researcher Dr. Mita Dasog has received a $50,000 USD award to kick-start a project that could revolutionize the technology used to extract carbon dioxide directly from the atmosphere.\r\nEarl… [+3273 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Google Photos’ AI-powered ‘Magic Eraser’ is now a Google One subscription perk - TechCrunch", "description": "One of the Google Pixel’s best photo-editing features, “Magic Eraser,” is now making its way to other Android and iOS devices. But it won’t be free. Today, Google announced that the popular tool, which uses AI to remove unwanted content from images, will beco…", "url": "https://techcrunch.com/2023/02/23/google-photos-ai-powered-magic-eraser-is-now-a-google-one-subscription-perk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/12/GettyImages-887454024.jpg?resize=1200,797", "publishedAt": "2023-02-23T19:38:28Z", "content": "One of the Google Pixel’s best photo-editing features, “Magic Eraser,” is now making its way to other Android and iOS devices. But it won’t be free. Today, Google announced that the popular tool, whi… [+2936 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Rand slips as greylisting reality sets in - BusinessTech", "description": "The South African rand reacts to the national budget speech.", "url": "https://businesstech.co.za/news/finance/667477/rand-slips-as-greylisting-reality-sets-in/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/02/cyril-ramaphosa-eskom-power-station.jpg", "publishedAt": "2023-02-23T11:05:52Z", "content": "South Africa gave up the gains it made following finance minister Enoch Godongwana budget speech on Wednesday.\r\nFollowing the budget, where the minister announced that the government would take on mo… [+3701 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "Unfold the Incredible: Use Cases of the Impressive ASUS Zenbook 17 Fold OLED UX9702 Valued at $3,499.99 - TechCabal", "description": "The world’s first 17-inch foldable OLED laptop. A big screen in your work bag. Great keyboard and trackpad. Multiple screens. Very portable. Good for productivity. Versatile and Beautiful – Everything you get in a modern and futuristic laptop. Foldable device…", "url": "https://techcabal.com/2023/02/22/unfold-the-incredible-use-cases-of-the-impressive-asus-zenbook-17-fold-oled-ux9702-valued-at-3499-99/", "urlToImage": "https://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2023/02/2-1-1024x587.jpg", "publishedAt": "2023-02-22T15:43:44Z", "content": "The worlds first 17-inch foldable OLED laptop. A big screen in your work bag. Great keyboard and trackpad. Multiple screens. Very portable. Good for productivity. Versatile and Beautiful Everything y… [+7454 chars]"}]}