{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Athletic"}, "author": "Sam Vecenie, Jon Krawczynski", "title": "Will Nikola Jokić be suspended after his run-in with Suns owner Mat Ishbia? What we expect the NBA to do - The Athletic", "description": "Jokić and the Suns owner got into a rare confrontation that led to a tech for the Nuggets star. But will that be the end of it?", "url": "https://theathletic.com/4497780/2023/05/08/nikola-jokic-suns-owner-mat-ishbia-suspension/", "urlToImage": "https://cdn.theathletic.com/app/uploads/2023/05/08115116/GettyImages-1253045890-1-1024x715.jpg", "publishedAt": "2023-05-08T20:02:22Z", "content": "Denver Nuggets center and two-time NBA MVP Nikola Joki was assessed a technical foul for making contact with Phoenix Suns owner Mat Ishbia during the second quarter of Game 4 of a Western Conference … [+11227 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Global Study Finds Link Between COVID-19 Vaccination and Menstrual Changes - SciTechDaily", "description": "A recent study found a slightly higher risk of heavier periods after COVID-19 vaccination. Researchers emphasize that the changes are small and typically return to normal in the next menstrual cycle. A new international study finds that women vaccinated for C…", "url": "https://scitechdaily.com/global-study-finds-link-between-covid-19-vaccination-and-menstrual-changes/", "urlToImage": "https://scitechdaily.com/images/Period-Menstrual-Cycle-Concept.jpg", "publishedAt": "2023-05-08T17:15:43Z", "content": "ByOregon Health &amp; Science UniversityMay 8, 2023\r\nA new international study published in the British Journal of Obstetrics and Gynaecology has found that women vaccinated for COVID-19 have a sligh… [+5575 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Will Knight", "title": "What Really Made Geoffrey Hinton Into an AI Doomer - WIRED", "description": "The AI pioneer is alarmed by how clever the technology he helped create has become. And it all started with a joke.", "url": "https://www.wired.com/story/geoffrey-hinton-ai-chatgpt-dangers/", "urlToImage": "https://media.wired.com/photos/6458f22c4a854832b16fcf7b/191:100/w_1280,c_limit/GeoffHinton_Biz_h_15908078.jpg", "publishedAt": "2023-05-08T15:18:00Z", "content": "A lot of the headlines have been saying that I think it should be stopped nowand I've never said that, he says. First of all, I don't think that's possible, and I think we should continue to develop … [+3015 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "First ChatGPT arrest made in China over fake train crash news - Deccan Herald", "description": "Chinese police have detained a man for allegedly generating fake news of a train crash and disseminating it online using artificial intelligence technology to \"concoct information\" and post it on multiple accounts, in what was reported to be China's first arr…", "url": "https://www.deccanherald.com/international/world-news-politics/first-chatgpt-arrest-made-in-china-over-fake-train-crash-news-1216881.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/05/08/chatgpt-reuters-1215327-1683127094-1216881-1683549987.jpg", "publishedAt": "2023-05-08T12:44:16Z", "content": "Chinese police have detained a man for allegedly generating fake news of a train crash and disseminating it online using artificial intelligence technology to \"concoct information\" and post it on mul… [+3183 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Smashing offer on iQOO Neo 6 5G; Save over 23000 on the phone worth 34999 today - HT Tech", "description": "You can get iQOO Neo 6 5G with a lot of savings today. The phone worth Rs. 34999 can be yours under Rs. 1500 on Amazon. Here is what you need to do.", "url": "https://tech.hindustantimes.com/mobile/news/smashing-offer-on-iqoo-neo-6-5g-save-over-23000-on-the-phone-worth-34999-today-71683520070197.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/08/1600x900/Untitled_design_39_1683520111970_1683520112170.png", "publishedAt": "2023-05-08T04:31:13Z", "content": "If you are planning to buy a phone, you need to hurry as today is the last day of the Great Summer Sale on Amazon. Also, if you love gaming and want a phone that can allow you to play for long hours … [+1959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Waste Pile to Diamond Discovery: How a Humble Piece of Rock Solved a Long-Standing Diamond Mystery - SciTechDaily", "description": "Two researchers from Queensland University of Technology (QUT) have utilized a simple laptop computer and a piece of rock, obtained from a diamond mine's \"waste pile\", to unravel a long-standing geological mystery surrounding the formation of diamonds in the …", "url": "https://scitechdaily.com/from-waste-pile-to-diamond-discovery-how-a-humble-piece-of-rock-solved-a-long-standing-diamond-mystery/", "urlToImage": "https://scitechdaily.com/images/Shiny-Diamond.jpg", "publishedAt": "2023-05-08T00:18:01Z", "content": "Two QUT researchers used a standard laptop and a piece of rock from a diamond mine waste pile to solve a long-standing geological puzzle about diamond formation in the Earths ancient continents.\r\nTwo… [+5307 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Space Exploration Partner, Mars Experience on Earth, Black Hole Week - SciTechDaily", "description": "Another partner for space exploration … A Mars experience right here on Earth … And a promising find outside our solar system … A few of the stories to tell you about – This Week at NASA! https://youtu.be/9CbCEsfZ7BE Another Nation Signs Up for Exploration Co…", "url": "https://scitechdaily.com/?p=275105", "urlToImage": "https://scitechdaily.com/images/GJ-486-b-Exoplanet-Star.jpg", "publishedAt": "2023-05-07T14:18:52Z", "content": "ByNASAMay 7, 2023\r\nGJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just under 1… [+3569 chars]"}]}