{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ALI SWENSON", "title": "AI-generated voices in robocalls can deceive voters. The FCC just made them illegal - The Associated Press", "description": "The Federal Communications Commission is outlawing robocalls that contain voices generated by artificial intelligence. The decision sends a clear message that exploiting the technology to scam people and mislead voters won’t be tolerated. Thursday’s unanimous…", "url": "https://apnews.com/article/fcc-elections-artificial-intelligence-robocalls-regulations-a8292b1371b3764916461f60660b93e6", "urlToImage": "https://dims.apnews.com/dims4/default/8a17bd6/2147483647/strip/true/crop/5855x3293+0+305/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff1%2F0c%2F425f7073cd8be81bc4e03f2bcf9a%2F63e0598984514a13a5ba4c80ec2c73a4", "publishedAt": "2024-02-08T16:01:13Z", "content": "NEW YORK (AP) The Federal Communications Commission on Thursday outlawed robocalls that contain voices generated by artificial intelligence, a decision that sends a clear message that exploiting the … [+5222 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Rita Liao", "title": "AR glasses with multimodal AI nets funding from Pokémon Go creator - TechCrunch", "description": "In the week when gadget lovers around the world are enchanted by Vision Pro, a young, brave startup is trying to carve out a space for its augmented", "url": "https://techcrunch.com/2024/02/08/ar-glasses-with-multimodal-ai-attracts-funding-from-pokemon-go-founder/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/02/Frame-by-Brilliant-Labs-on-CEO-Bobak-2.jpeg?resize=1200,900", "publishedAt": "2024-02-08T14:00:56Z", "content": "In the week when gadget lovers around the world are enchanted by Vision Pro, a young, brave startup is trying to carve out a space for its augmented reality device that features a form factor starkly… [+3387 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Lauren Sforza", "title": "NASA Jet Propulsion Laboratory laying off hundreds, citing budget gridlock - The Hill", "description": "The congressional budget gridlock has led NASA to lay off hundreds of workers in its Jet Propulsion Laboratory (JPL), which has launched numerous missions to Mars to search for signs of life. The JPL, which is managed by the California Institute of Technology…", "url": "https://thehill.com/regulation/transportation/4455507-nasa-jet-propulsion-laboratory-laying-off-hundreds/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/02/AP20149501536005-e1707400459225.jpg?w=1280", "publishedAt": "2024-02-08T14:00:00Z", "content": "Skip to content\r\nThe congressional budget gridlock has led NASA to lay off hundreds of workers in its Jet Propulsion Laboratory (JPL), which has launched numerous missions to Mars to search for signs… [+2171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Juno Captures Two Active Volcanic Plumes on Jupiter's Moon Io - SciTechDaily", "description": "NASA's Juno spacecraft observed two volcanic plumes on Io, suggesting significant volcanic activity on Jupiter's moon. In a significant astronomical achievement, NASA's Juno spacecraft has once again broadened our understanding of the solar system's dynamics …", "url": "https://scitechdaily.com/nasas-juno-captures-two-active-volcanic-plumes-on-jupiters-moon-io/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Two-Active-Volcanic-Plumes-on-Jupiters-Moon-Io.jpg", "publishedAt": "2024-02-08T13:41:44Z", "content": "On February 3, NASA’s Juno spacecraft captured images of two volcanic plumes on Jupiter’s moon Io, possibly indicating activity from either two vents of a single volcano or two separate volcanoes. Th… [+4516 chars]"}]}