{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Microsoft wants changing default apps in Windows to be less of a mess - Ars Technica", "description": "But it probably won't stop the OS from reminding you that Edge exists.", "url": "https://arstechnica.com/gadgets/2023/03/setting-a-default-browser-could-get-easier-in-future-windows-11-versions/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/windows-11-band-aid-patch-760x380.jpg", "publishedAt": "2023-03-20T17:10:49Z", "content": "24 with \r\nOne of the enduring legacies of the '90s browser wars has been an outsize attention to how Microsoft handles default app settings in Windows, especially browser settings. The company plans … [+3843 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ron Miller", "title": "AWS takes a hit in latest round of Amazon layoffs - TechCrunch", "description": "When Amazon announced 9,000 additional layoffs this morning, perhaps it wasn't surprising that AWS was included as growth slows.", "url": "https://techcrunch.com/2023/03/20/aws-takes-a-hit-in-latest-round-of-amazon-layoffs/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/AWS-logo.jpg?resize=1200,761", "publishedAt": "2023-03-20T16:42:43Z", "content": "When Amazon announced it was laying off another 9,000 employees today, AWS employees were not exempt with Amazon CEO (and former AWS CEO) Andy Jassy announcing the cloud division would be included in… [+2944 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DART VADAR harnesses the force of enzymes for better RNA drugs: New, easy-to-design RNA-based sensor can detect and automatically respond to molecular triggers within cells - Science Daily", "description": "Gene therapy has been heralded as the new frontier of medicine, but there are still many limitations to current technologies; among them, how to deliver therapeutic genes to specific cells, and only activate them in the right context. A team has created a new…", "url": "https://www.sciencedaily.com/releases/2023/03/230320101933.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-03-20T16:02:07Z", "content": "More than twelve billion doses of mRNA vaccines have been administered globally since the start of the COVID pandemic, saving millions of lives. But RNA-based therapies for other diseases have so far… [+9973 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Netflix plans to release 40 more games this year, will add Monument Valley in 2024 - TechCrunch", "description": "Netflix has announced that it has 40 games slated for launch this year and has 70 in development with its partners.", "url": "https://techcrunch.com/2023/03/20/netflix-release-40-more-games-this-year-add-monument-valley-2024/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/03/Monument-Valley.jpg?resize=1200,676", "publishedAt": "2023-03-20T14:01:21Z", "content": "Netflix has announced that it has 40 games slated for launch this year and has 70 in development with its partners. The company also has 16 games currently being developed by its in-house game studio… [+3668 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "The SpaceX steamroller has shifted into a higher gear this year - Ars Technica", "description": "We're not at airline-like operations yet, but we're getting a lot closer.", "url": "https://arstechnica.com/science/2023/03/the-spacex-steamroller-has-shifted-into-a-higher-gear-this-year/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/FrdmblBaYAEY5Wr-760x380.jpg", "publishedAt": "2023-03-20T13:40:55Z", "content": "Enlarge/ A Starlink mission launches on a Falcon 9 rocket Friday from Vandenberg Space Force Base.\r\n45 with \r\nIs it possible that SpaceX has succeeded in making orbital launches boring? Increasingly,… [+3679 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deep Impact: Heat Waves Happen at the Bottom of the Ocean Too - SciTechDaily", "description": "First assessment of bottom marine heat waves opens a window on the deep. The 2013-2016 marine heat wave known as “The Blob” warmed a vast expanse of surface waters across the northeastern Pacific, disrupting West Coast marine ecosystems, depressing salmon ret…", "url": "https://scitechdaily.com/deep-impact-heat-waves-happen-at-the-bottom-of-the-ocean-too/", "urlToImage": "https://scitechdaily.com/images/Bathymetric-Features-Western-Atlantic-Ocean-Basin.jpg", "publishedAt": "2023-03-20T12:33:39Z", "content": "ByNational Oceanic and Atmospheric Administration (NOAA)March 20, 2023\r\nThis visualization depicts bathymetric features of the western Atlantic Ocean Basin, including the continental shelf, captured … [+9286 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Incredible iPhone 13 offer announced! Price drops to 32999 from 69900 on Flipkart - HT Tech", "description": "Buying an iPhone 13 today from Flipkart will cost you approximately half of its market price. The device worth Rs. 69900 can be yours for just Rs. 32999. Here is how.", "url": "https://tech.hindustantimes.com/mobile/news/incredible-iphone-13-offer-announced-price-drops-to-32999-from-69900-on-flipkart-71679286662094.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/20/1600x900/iPhone_14_with_airpods_1676723389837_1679286820955_1679286820955.jpg", "publishedAt": "2023-03-20T04:37:28Z", "content": "Buying an Apple iPhone model means that you need to have a minimum of Rs. 40000 to Rs. 50000 in your pocket, considering its market price. Though you have the option to get the phone by opting for EM… [+1887 chars]"}]}