{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "40% of Older Adults: Newly Identified Form of Dementia Is Shockingly Common - SciTechDaily", "description": "A recent study indicates the prevalence of brain changes from limbic-predominant age-related TDP-43 encephalopathy might be approximately 40% in older adults and as high as 50% in people with Alzheimer’s disease According to the researchers, the paper, which …", "url": "https://scitechdaily.com/40-of-older-adults-newly-identified-form-of-dementia-is-shockingly-common/", "urlToImage": "https://scitechdaily.com/images/Neuron-Brain-Neuroscience-Concept.jpg", "publishedAt": "2022-07-02T19:27:31Z", "content": "ByUniversity of KentuckyJuly 2, 2022\r\nThe symptoms of Limbic-predominant age-related TDP-43 encephalopathy (LATE) are comparable to those of Alzheimers disease, involving memory loss and issues with … [+6216 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Understanding Plants Is Key to Finding a Cure for Cancer - SciTechDaily", "description": "If scientists can fully understand plant growth, they might be able to find a cancer cure In order to increase agricultural yields, it is important to understand how plants process light. Plants use light to determine when to grow and bloom. Plants find light…", "url": "https://scitechdaily.com/understanding-plants-is-key-to-finding-a-cure-for-cancer/", "urlToImage": "https://scitechdaily.com/images/Genetically-Modified-Plants-Concept.jpg", "publishedAt": "2022-07-02T16:10:22Z", "content": "The scientists state that if they can understand unchecked plant growth, they believe they can find a cure for cancer.\r\nIf scientists can fully understand plant growth, they might be able to find a c… [+3424 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Gmail, Hotmail users ALERT! This FAKE mail can steal your Facebook details - HT Tech", "description": "Gmail and Hotmail users have been warned about fake mail purportedly from Facebook that can steal your details.", "url": "https://tech.hindustantimes.com/tech/news/gmail-hotmail-users-alert-this-fake-mail-can-steal-your-facebook-details-71656772218753.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/02/1600x900/40843712195_9d1e58fd96_c_1643895072282_1656772282072.jpg", "publishedAt": "2022-07-02T14:31:40Z", "content": "Here is a warning for Gmail and Hotmail users! If you use Gmail or Hotmail then you need to watch out for a fake mail allegedly from the Facebook Support team. As per a report by express.co.uk, cyber… [+2322 chars]"}, {"source": {"id": null, "name": "Usf.edu"}, "author": "https://wusfnews.wusf.usf.edu/people/melissa-block", "title": "YouTube Minecraft player Technoblade — now also known as Alex — dies from cancer - WUSF News", "description": "One of the most popular Minecraft players on YouTube, known as \"Technoblade,\" died this week after a battle with cancer. In a farewell message, he finally divulged his first name: Alex.", "url": "https://wusfnews.wusf.usf.edu/2022-07-02/youtube-minecraft-player-technoblade-now-also-known-as-alex-dies-from-cancer", "urlToImage": null, "publishedAt": "2022-07-02T13:43:00Z", "content": "MELISSA BLOCK, HOST:\r\nHe was known to his adoring fans as Technoblade, a young YouTuber who streamed himself playing Minecraft, the world-building fantasy game. He was good at it, winning 1,800 games… [+1373 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study of Ancient Mass Extinction Reveals Dinosaurs Took Over Earth Amid Ice, Not Warmth - SciTechDaily", "description": "Thriving in a Series of Sudden Global Chills That Killed Competitors Many of us are familiar with the popular theory of how the dinosaurs died 66 million years ago: in Earth’s violent collision with a meteorite, followed by a global winter caused by dust and …", "url": "https://scitechdaily.com/study-of-ancient-mass-extinction-reveals-dinosaurs-took-over-earth-amid-ice-not-warmth/", "urlToImage": "https://scitechdaily.com/images/Feathered-Theropod-Dinosaur.jpg", "publishedAt": "2022-07-02T04:45:54Z", "content": "ByColumbia Climate SchoolJuly 1, 2022\r\nWith a lava flow in the distance, a primitively feathered theropod dinosaur carries off a mammalian victim during a snowy volcanic winter caused by massive erup… [+11369 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Black Shark 5 series - Affordable Gaming Phone | TechNave Unboxing and Hands-On Video - TechNave", "description": "Check out the latest ✨Black Shark 5 series✨ here and don't forget to let us know which variant are you go for 😉Price tag💰Black Shark 5👇🏻8GB+128GB 👉🏻RM2...", "url": "https://www.youtube.com/watch?v=YwN3I_X4FVQ", "urlToImage": "https://i.ytimg.com/vi/YwN3I_X4FVQ/hqdefault.jpg", "publishedAt": "2022-07-02T03:15:01Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Soft' CRISPR may offer a new fix for genetic defects: Targeted repairs with 'nicks' of single DNA strands provide foundation for novel disease therapies - Science Daily", "description": "Scientists have developed a new CRISPR-based technology that could offer a safer approach to correcting genetic defects. The new 'soft' CRISPR approach makes use of natural DNA repair machinery, providing a foundation for novel gene therapy strategies with th…", "url": "https://www.sciencedaily.com/releases/2022/07/220701143121.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-07-01T19:14:15Z", "content": "Curing debilitating genetic diseases is one of the great challenges of modern medicine. During the past decade, development of CRISPR technologies and advancements in genetics research brought new ho… [+4572 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New classification system proposed for colorectal cancer to guide treatment and clinical trials - Medical Xpress", "description": "A team of clinician-scientists and scientists, led by the National Cancer Centre Singapore (NCCS) and A*STAR's Genome Institute of Singapore (GIS) together with collaborators in Europe and South Korea, used single cell techniques to uncover a central dichotom…", "url": "https://medicalxpress.com/news/2022-07-classification-colorectal-cancer-treatment-clinical.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-classification-sys.jpg", "publishedAt": "2022-07-01T15:06:17Z", "content": "A team of clinician-scientists and scientists, led by the National Cancer Centre Singapore (NCCS) and A*STAR's Genome Institute of Singapore (GIS) together with collaborators in Europe and South Kore… [+5986 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "How The Top 5 African Wearable Brands Fared In the Ist Quarter Of 2022 - Techpoint Africa", "description": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report", "url": "https://techpoint.africa/2022/07/01/how-the-top-5-african-wearable-brands-fared-in-the-ist-quarter-of-2022", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image.jpeg", "publishedAt": "2022-07-01T13:16:42Z", "content": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report on the Africans wearable market analysis… [+4227 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "Oraimo Watch Pro vs Samsung Galaxy Watch 4 - Techpoint Africa", "description": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart", "url": "https://techpoint.africa/2022/07/01/oraimo-watch-pro-vs-samsung-galaxy-watch-4", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image-1.png", "publishedAt": "2022-07-01T13:11:27Z", "content": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart watches on the market, you may be confused wh… [+3122 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Following a Fungus From Genes to Tree Disease - a Journey in Science - AllAfrica - Top Africa News", "description": "Analysis - Anyone who reads even a little about science and technology will be familiar by now with the idea of genome sequencing. This process involves breaking an organism's DNA into fragments to study their compositions or sequences. Then the fragments are…", "url": "https://allafrica.com/stories/202207010160.html", "urlToImage": "https://cdn06.allafrica.com/download/pic/main/main/csiid/00610063:c49083765319d180a201976817ab40de:arc614x376:w1200.jpg", "publishedAt": "2022-07-01T07:45:49Z", "content": "Anyone who reads even a little about science and technology will be familiar by now with the idea of genome sequencing. This process involves breaking an organism's DNA into fragments to study their … [+5924 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tenoumer Crater, Mauritania – One of the Best-Preserved Craters on Earth - SciTechDaily", "description": "One of the best-preserved craters on Earth lies deep within the Sahara Desert. On Asteroid Day, the Copernicus Sentinel-2 satellite mission takes us over the almost-perfectly circular Tenoumer Crater in Mauritania. Tenoumer Crater, visible in the center of th…", "url": "https://scitechdaily.com/tenoumer-crater-mauritania-one-of-the-best-preserved-craters-on-earth/", "urlToImage": "https://scitechdaily.com/images/Tenoumer-Crater.jpg", "publishedAt": "2022-07-01T03:04:51Z", "content": "Copernicus Sentinel-2 image captured on May 16, 2022, of Tenoumer Crater in Mauritania, one of the best-preserved craters on Earth. Credit: Contains modified Copernicus Sentinel data (2022), processe… [+2337 chars]"}]}