{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Pixel Fold: Price, design, specs to launch, check it all out - HT Tech", "description": "Google Pixel Fold is all set to launch in a few days. From design, specs, to price – know everything that you need to know about this foldable smartphone.", "url": "https://tech.hindustantimes.com/mobile/news/google-pixel-fold-price-design-specs-to-launch-check-it-all-out-71683457933845.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/Google_Pixel_fold_1683458150141_1683458172707.PNG", "publishedAt": "2023-05-07T11:17:25Z", "content": "Google Pixel Fold launch is just a few days away! It has now been officially confirmed to launch on May 10, at the beginning of the Google I/O Event 2023. With this Pixel Fold, Google is all set to s… [+2333 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "iPhone 13 Pro Max: Don't pay 50000, you have to give only THIS much! - HT Tech", "description": "iPhone 13 Pro Max Dont pay 50000 you have to give only THIS much iPhone 13 Pro price cut for the Max 512GB variant has been rolled out and it has reduced the rate by a massive amount. Check the iPhone 13 Pro Max deal on Flipkart. Apple iPhone 13 Pro Max 512GB…", "url": "https://tech.hindustantimes.com/web-stories/iphone-13-pro-max-dont-pay-50000-you-have-to-give-only-this-much-71683449881848.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/iPhone_13_Pro_Max1633406989523_1683451173016_1683451799132.webp/", "publishedAt": "2023-05-07T09:31:14Z", "content": "Photo Credit: HT Tech\r\n iPhone 13 Pro price cut for the Max 512GB variant has been rolled out and it has reduced the rate by a massive amount. Check the iPhone 13 Pro Max deal on Flipkart.\r\nPhoto Cre… [+1500 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Boost: Special Omega-3 Fatty Acid Lipid's Key Role in Aging Uncovered - SciTechDaily", "description": "Researchers have discovered that the transporter protein Mfsd2a is critical for regulating brain cells that maintain myelin sheaths, which protect nerves. This discovery could help reduce the effects of aging on the brain and lead to therapies for neurologica…", "url": "https://scitechdaily.com/brain-boost-special-omega-3-fatty-acid-lipids-key-role-in-aging-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-With-Myelinated-Axons.jpg", "publishedAt": "2023-05-06T10:38:59Z", "content": "ByDuke-NUS Medical SchoolMay 6, 2023\r\nThe developing preclinical models brain with myelinated axons (shown in green color). Scientists from Singapore have discovered the crucial role of a transporter… [+6250 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 6 May 2023: Fascinating Twilight in a Flower! - HT Tech", "description": "NASA Astronomy Picture of the Day 6 May shares a breathtaking image of the transition of the day in the shape of a flower.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-6-may-2023-fascinating-twilight-in-a-flower-71683368347797.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/06/1600x900/NASA_APOD_may6_1683368662430_1683368677127.jpg", "publishedAt": "2023-05-06T10:25:38Z", "content": "Skyscapes during the twilight are undoubtedly beautiful and mesmerizing. However, it can be creative too with a sense of perfect presentation. An astrophotographer, Dario Giannobile showed proof of i… [+1928 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Marc McLaren", "title": "Quordle today - hints and answers for Saturday, May 6 (game #467) - TechRadar", "description": "Our clues will help you solve Quordle today and keep that streak going", "url": "https://www.techradar.com/news/quordle-today-answers-clues-6-may-2023", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4XP9iNbdvkijJyZnzx3WoL-1200-80.jpg", "publishedAt": "2023-05-06T06:24:10Z", "content": "Quordle needs to be approached in a different way to Wordle. With four puzzles to solve in nine guesses, you can't blindly throw letters at it and expect to win - you'll stand a far better chance if … [+1813 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Exciton fission: One photon in, two electrons out - Science Daily", "description": "Photovoltaics, the conversion of light to electricity, is a key technology for sustainable energy. Since the days of Max Planck and Albert Einstein, we know that light as well as electricity are quantized, meaning they come in tiny packets called photons and …", "url": "https://www.sciencedaily.com/releases/2023/05/230505141618.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-05T20:25:03Z", "content": "Photovoltaics, the conversion of light to electricity, is a key technology for sustainable energy. Since the days of Max Planck and Albert Einstein, we know that light as well as electricity are quan… [+2166 chars]"}]}