{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Christian Davenport", "title": "While Boeing has struggled with Starliner, SpaceX has soared - The Washington Post", "description": "Delays and technical problems have kept Boeing’s Starliner on the ground for a month past its anticipated launch, with the latest scheduled launch date set for Wednesday. The company’s problems highlight the contrast in performance between Boeing’s troubled p…", "url": "https://www.washingtonpost.com/technology/2024/06/04/space-nasa-boeing-starliner-spacex/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HR5ZEGGWZYI6ZPQXFBQWJF2MKQ_size-normalized.jpg&w=1440", "publishedAt": "2024-06-04T11:07:33Z", "content": "The story of NASAs commercial crew program, the bold endeavor by NASA a decade ago to outsource human spaceflight to a pair of companies, is a tale of contrast of an improbable rise to prominence for… [+7779 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 16 Pro models may feature thinnest bezels- Know what's expected - HT Tech", "description": "Apple's upcoming iPhone 16 Pro and Pro Max models are set to feature the world's thinnest screen bezels, significantly improving the screen-to-body ratio. The new iPhones will also boast larger displays, advanced A18 chips, and new capacitive buttons.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-16-pro-models-may-feature-thinnest-bezels-know-whats-expected-71717444555759.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/03/1600x900/sebastian-bednarek-NuAamGgwymw-unsplash_1717444695727_1717444757777.jpg", "publishedAt": "2024-06-04T05:44:04Z", "content": "Apple is poised to introduce major display improvements with the upcoming iPhone 16 series. According to recent leaks, the iPhone 16 Pro and iPhone 16 Pro Max will boast significantly thinner bezels … [+2354 chars]"}]}