{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Surprises: Hubble Captures Stunning Movie of DART Asteroid Impact Debris - SciTechDaily", "description": "Never-Before-Seen Spacecraft Collision Yields Unexpected Surprises In 2022 NASA embarked on a bold experiment to see if they could change an asteroid's velocity by smacking it with a ballistic probe – kind of like hitting it with a hammer. This experiment was…", "url": "https://scitechdaily.com/?p=258169", "urlToImage": "https://scitechdaily.com/images/NASA-DART-Spacecraft-Prior-to-Impact-scaled.jpg", "publishedAt": "2023-03-05T21:15:37Z", "content": "BySpace Telescope Science InstituteMarch 5, 2023\r\nThis illustration depicts NASAs Double Asteroid Redirection Test (DART) spacecraft prior to impact at the Didymos binary asteroid system. Credit: NAS… [+11307 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Report Reveals 59% of Long COVID Patients Suffer From Organ Damage a Year Later - SciTechDaily", "description": "Organ damage persisted in 59% of long COVID patients a year after initial symptoms, even in those not severely affected when first diagnosed with the virus, according to a comprehensive new study. A new comprehensive study of organ impairment in long COVID pa…", "url": "https://scitechdaily.com/shocking-report-reveals-59-of-long-covid-patients-suffer-from-organ-damage-a-year-later/", "urlToImage": "https://scitechdaily.com/images/Man-Human-Body-Anatomy-Internal-Organs.jpg", "publishedAt": "2023-03-05T16:35:48Z", "content": "ByUniversity College London (UCL)March 5, 2023\r\nLong COVID, also known as post-acute sequelae of SARS-CoV-2 infection (PASC), is a condition where individuals continue to experience symptoms or devel… [+5168 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 5 March 2023: Spectacular meeting of Venus and Jupiter - HT Tech", "description": "NASA Astronomy Picture of the Day is depicting two bright planets in the sky. These are none other than the rare Venus and Jupiter conjunction.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-5-march-2023-spectacular-meeting-of-venus-and-jupiter-71678006757089.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/05/1600x900/VenusJupiterSky_Tumino_1080_annotated_1678006774166_1678006781296_1678006781296.jpg", "publishedAt": "2023-03-05T09:01:10Z", "content": "The world is not yet done talking about the rare meeting of two planets in our solar system in the night sky! Almost on a daily basis, you can find new photos released on the internet of the Venus-Ju… [+1815 chars]"}]}