{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Snooze or Lose: How Poor Sleep Habits Could Double Your Asthma Risk - SciTechDaily", "description": "Healthy sleep pattern linked to lower risk in adults, large study shows. A UK Biobank study published in BMJ Open Respiratory Research suggests that poor quality sleep may increase an individual's genetic susceptibility to asthma, potentially doubling the ris…", "url": "https://scitechdaily.com/?p=266005", "urlToImage": "https://scitechdaily.com/images/Happy-Woman-Waking-Up-in-Bed-Good-Sleep.jpg", "publishedAt": "2023-04-04T13:08:10Z", "content": "ByBMJApril 4, 2023\r\nGood sleep is important for health, even for the lungs and the respiratory system. In fact, poor quality sleep may double the risk of asthma diagnosis by increasing genetic suscep… [+6661 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Walmart-backed payments giant PhonePe makes e-commerce push - TechCrunch", "description": "Walmart's PhonePe launched Pincode, a hyperlocal commerce app and joined the New Delhi-backed Open Network for Digital Commerce (ONDC).", "url": "https://techcrunch.com/2023/04/04/walmart-backed-fintech-giant-phonepe-makes-e-commerce-push/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/04/GettyImages-1234065228.jpg?resize=1200,800", "publishedAt": "2023-04-04T08:07:23Z", "content": "In a move reminiscent of its successful early bet on the government-backed UPI network seven years ago, PhonePe, India’s leading mobile payments app, is now setting its sights on the e-commerce secto… [+3473 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Weird threat! NASA detects Ring-shaped sunspot; Solar storm fears rise for Earth - HT Tech", "description": "In the southern hemisphere of the Sun, a ring-shaped sunspot has been detected by the NASA Solar Dynamics Observatory, Which has expanded at a furious rate over the last 24 hours. Is another solar storm coming for the Earth?", "url": "https://tech.hindustantimes.com/tech/news/weird-threat-nasa-detects-ring-shaped-sunspot-solar-storm-fears-rise-for-earth-71680587481644.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/04/1600x900/sun-4444454_1920_1651753999330_1680587544596_1680587544596.jpg", "publishedAt": "2023-04-04T05:57:04Z", "content": "Earlier, the National Oceanic and Atmospheric Administration had revealed that as many as four sunspots have been detected on the Earth-facing side of the Sun, among which one was likely to erupt a C… [+2777 chars]"}]}