{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "Lyft Demands Employees Return to Office in September - Slashdot", "description": "\"Since the pandemic began, Lyft employees have been able to work remotely,\" notes the New York Times, \"logging into videoconferences from their homes and dispersing across the country like many other tech workers. Last year, the company made that policy offic…", "url": "https://it.slashdot.org/story/23/04/29/0454222/lyft-demands-employees-return-to-office-in-september", "urlToImage": "https://a.fsdn.com/sd/topics/business_64.png", "publishedAt": "2023-04-29T18:54:11Z", "content": "In my experience, the vast majority of \"white board\" type meetings were between my teams as tech people trying to convince management of things that needed attention - equipment upgrades, system/netw… [+804 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Surprising Consequence of a High-Fat Diet During Pregnancy - SciTechDaily", "description": "It's common knowledge that maintaining a healthy diet is important, particularly during pregnancy. Consuming a high-fat diet can have severe impacts on metabolism, increasing the risk of obesity, diabetes, liver disease, and even cancer. Studies have shown th…", "url": "https://scitechdaily.com/scientists-discover-surprising-consequence-of-a-high-fat-diet-during-pregnancy/", "urlToImage": "https://scitechdaily.com/images/Variety-Unhealthy-Junk-Food.jpg", "publishedAt": "2023-04-29T17:37:36Z", "content": "ByTokyo Medical and Dental UniversityApril 29, 2023\r\nA study by Tokyo Medical and Dental University reveals that offspring exposed to high-fat diets during gestation and early life exhibit a preferen… [+4455 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Divya", "title": "iOS 17 set to change Wallet and Health Apps on your iPhone - HT Tech", "description": "iOS 17 is expected to bring several important changes to Wallet and Health App on iPhones. What's coming? Read on.", "url": "https://tech.hindustantimes.com/tech/news/ios-17-set-to-change-wallet-and-health-apps-on-your-iphone-71682775957054.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/29/1600x900/iPhone_wallet_Unsplash_1682776222437_1682776236060.jpg", "publishedAt": "2023-04-29T13:51:58Z", "content": "Undoubtedly, from all that is being reported so far, iOS 17 is going to be one of the biggest updates for iPhone users for quite some time. Considering that iOS 17 was initially dismissed as being of… [+2134 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sticky Situation: Critical Antenna on ESA's Jupiter Icy Moons Explorer Fails To Deploy - SciTechDaily", "description": "ESA's Jupiter Icy Moons Explorer (Juice) has encountered a deployment issue with its Radar for Icy Moons Exploration (RIME) antenna. The issue, potentially caused by a stuck pin, is being addressed by ESA's mission control teams with various strategies, inclu…", "url": "https://scitechdaily.com/?p=272800", "urlToImage": "https://scitechdaily.com/images/Illustration-of-JUICE-Spacecraft-at-Jupiter-scaled.jpg", "publishedAt": "2023-04-29T12:07:15Z", "content": "ByEuropean Space Agency (ESA)April 29, 2023\r\nIllustration of the JUICE spacecraft at Jupiter. The Radar for Icy Moons Exploration (RIME) antenna on ESAs Jupiter Icy Moons Explorer (Juice) spacecraft … [+4975 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm delayed! But there is WORSE news coming for Earth - HT Tech", "description": "Earlier NOAA forecasters predicted that a CME cloud could be hitting the Earth on April 27 or 28 and spark a solar storm. It has not yet arrived. But that could actually be a scary development for the Earth.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-delayed-but-there-is-worse-news-coming-for-earth-71682739935633.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/29/1600x900/m73-flare-rotated_0_1680256680821_1682739978598.jpeg", "publishedAt": "2023-04-29T03:52:55Z", "content": "Amazingly, astronomers are perplexed right now. A solar storm was predicted to strike the Earth on either April 27 or 28 by the National Oceanic and Atmospheric Administration (NOAA). The storm was g… [+2361 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Ruairi J Mackenzie", "title": "Women’s Gut Bacteria Linked to Emotional Regulation - Technology Networks", "description": "Innovative research has uncovered a connection between the gut microbiome and positive emotions like happiness, hopefulness and better emotional management skills.", "url": "https://www.technologynetworks.com/immunology/news/womens-gut-bacteria-linked-to-emotional-regulation-372775", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/372775/womens-gut-bacteria-linked-to-emotional-regulation-372775-640x360.jpg?cb=20230428", "publishedAt": "2023-04-28T14:22:58Z", "content": "Innovative research from Brigham and Women's Hospital and the Harvard T.H. Chan School of Public Health has uncovered a connection between the gut microbiome and positive emotions like happiness, hop… [+4789 chars]"}]}