{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Advanced Remote Soil Carbon Sequestration and Emissions Measurement - AZoCleantech", "description": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering, costs, precision, and availability. Carbon sequestration an…", "url": "https://www.azocleantech.com/article.aspx?ArticleID=1655", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/Article_Images/ImageForArticle_1655_16753236478707967.jpg", "publishedAt": "2023-02-02T07:43:00Z", "content": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering,… [+7165 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Galaxy Unpacked: Samsung launches Galaxy S23 series with Snapdragon 8 Gen 2 - Economic Times", "description": "South Korean tech conglomerate Samsung unveiled the Galaxy S23 smartphone series at its Galaxy Unpacked event on February 01. The series consists of Galaxy S23, Galaxy S23 Plus and Galaxy S23 Ultra. The biggest upgrade for this generation is that all S23 phon…", "url": "https://economictimes.indiatimes.com/magazines/panache/galaxy-unpacked-samsung-launches-galaxy-s23-series-with-snapdragon-8-gen-2/videoshow/97546424.cms", "urlToImage": "https://img.etimg.com/thumb/msid-97546424,width-1070,height-580,overlay-etpanache/photo.jpg", "publishedAt": "2023-02-02T07:23:00Z", "content": "South Korean tech conglomerate Samsung unveiled the Galaxy S23 smartphone series at its Galaxy Unpacked event on February 01. The series consists of Galaxy S23, Galaxy S23 Plus and Galaxy S23 Ultra. … [+407 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN,China Global Television Network", "title": "Influence of China's sci-tech journals continues to grow - CGTN", "description": "The influence of China's science and technology journals continues to grow, with more of these journals now included in key global periodical retrieval systems, according to a recent report from the Institute of Scientific and Technical Information under", "url": "https://news.cgtn.com/news/2023-02-02/Influence-of-China-s-sci-tech-journals-continues-to-grow-1h5xtw6T9Pq/index.html", "urlToImage": "https://news.cgtn.com/news/2023-02-02/Influence-of-China-s-sci-tech-journals-continues-to-grow-1h5xtw6T9Pq/img/af3d67a6596d40f4a39a85836207056b/af3d67a6596d40f4a39a85836207056b-750.jpeg", "publishedAt": "2023-02-02T02:26:37Z", "content": "The influence of China's science and technology journals continues to grow, with more of these journals now included in key global periodical retrieval systems, according to a recent report from the … [+587 chars]"}, {"source": {"id": null, "name": "Biopharminternational.com"}, "author": "Cynthia A. Challener", "title": "Technology for In Vivo CAR T-cell Therapy Advances - BioPharm International", "description": "In vivo CAR-T gene therapies could overcome the challenges faced by autologous and allogeneic treatments.", "url": "https://www.biopharminternational.com/view/technology-for-in-vivo-car-t-cell-therapy-advances", "urlToImage": null, "publishedAt": "2023-02-02T02:11:13Z", "content": "There is no doubt that chimeric antigen receptor (CAR) T-cell therapies have had a tremendous positive impact on patients that have received them; however, autologous cell therapies produced in centr… [+18368 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Staff Reporter", "title": "Samsung Galaxy S23 launched - South African pricing, specs - TechCentral - TechCentral", "description": "Samsung Electronics has taken the wraps off the Galaxy S23, S23+ and S23 Ultra. This is how much they cost in South Africa.", "url": "https://techcentral.co.za/samsung-galaxy-s23-launched-south-african-pricing-specs/221585/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2023/01/samsung-galaxy-s23-adjusted.jpg", "publishedAt": "2023-02-01T18:00:39Z", "content": "Samsung Electronics on Wednesday took the wraps off its latest flagship smartphone series, the Galaxy S23, S23+ and S23 Ultra.\r\nNot that there was much new to reveal, mind you: almost everything abou… [+2521 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "Microsoft to bring new look to Teams Rooms on Windows - The Siasat Daily", "description": "Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays", "url": "https://www.siasat.com/microsoft-to-bring-new-look-to-teams-rooms-on-windows-2516397/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/02/wgqgeqge-1.jpg", "publishedAt": "2023-02-01T16:01:00Z", "content": "San Francisco: Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays, by the end of this quarter.\r\n“To make Teams Rooms ev… [+1408 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:15:13Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon", "title": "US and India to boost defense and technology cooperation as China threat grows - CNN", "description": "The United States and India are taking steps to strengthen their defense partnership, officials said Tuesday, the latest sign of cooperation between the two countries in the face of an increasingly assertive China.", "url": "https://www.cnn.com/2023/02/01/asia/us-india-defense-technology-cooperation-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230201021412-01-usa-india-military-exercise-102121-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-01T08:10:00Z", "content": "The United States and India are taking steps to strengthen their defense partnership, officials said Tuesday, the latest sign of cooperation between the two countries in the face of an increasingly a… [+2937 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UCF researchers uncover key mechanisms for sustainable ammonia production - EurekAlert", "description": "A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing sustainable fertilizer research and thus aiding global food safety efforts.\nAmmonia, a…", "url": "https://www.eurekalert.org/news-releases/978297", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-31T19:54:28Z", "content": "ORLANDO, Jan. 31, 2022 — A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing s… [+4796 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Use Quantum Mechanics To See Objects Without Looking at Them - SciTechDaily", "description": "The newly developed method links quantum and classical worlds and may enhance measurements for quantum computers and other applications. Our vision is made possible by the specialized cells in our retina that absorb light. But, can one see without any absorpt…", "url": "https://scitechdaily.com/researchers-use-quantum-mechanics-to-see-objects-without-looking-at-them/", "urlToImage": "https://scitechdaily.com/images/Researchers-Use-Quantum-Mechanics-To-See-Objects-Without-Looking-at-Them-scaled.jpg", "publishedAt": "2023-01-31T19:31:20Z", "content": "ByAalto UniversityJanuary 31, 2023\r\nAalto University quantum researchers use quantum coherence to detect objects without looking at them. Credit: Mikko Raskinen/Aalto University.\r\nThe newly developed… [+4968 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Kevin Purdy", "title": "How to control your smart home without yelling at a dumb voice assistant - Ars Technica", "description": "You can have nice, automated things without learning how to shout at speakers.", "url": "https://arstechnica.com/gadgets/2023/01/how-to-control-your-smart-home-without-yelling-at-a-dumb-voice-assistant/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/01/GettyImages-1273260594-760x380.jpg", "publishedAt": "2023-01-31T12:30:03Z", "content": "Enlarge/ We don't have to rely on megacorp obelisks to operate the things we buy. We don't have to learn their language. We can break free.\r\n135 with 0 posters participating\r\nFor many people, an auto… [+2726 chars]"}]}