{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Aishwarya Panda", "title": "Oppo F27 series launch on June 13 in India: Here’s what to expect from this smartphone under ₹25,000 - HT Tech", "description": "Oppo F27 series is expected to make its debut on June 12, 2024, with three models. Know what’s coming ahead of the launch.", "url": "https://tech.hindustantimes.com/mobile/news/oppo-f27-series-launch-on-june-13-in-india-here-s-what-to-expect-from-this-smartphone-under-rs-25000-71717387717879.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/03/1600x900/5155_1708545528370_1717387753477.jpg", "publishedAt": "2024-06-03T04:14:35Z", "content": "The Oppo F27 series is expected to make its debut in India soon. The series may include three smartphone models: Oppo F27, Oppo F27 Pro and F27 Pro Plus. Recently a tipster has revealed the expected … [+2171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mediterranean Diet Tied to 23% Lower Risk of Death in Landmark 25-Year Study - SciTechDaily", "description": "Researchers at Brigham and Women's Hospital have explored and analyzed the fundamental reasons that might account for the Mediterranean diet's 23 percent decrease in overall mortality risk among American women. Researchers at Brigham and Women’s Hospital have…", "url": "https://scitechdaily.com/mediterranean-diet-tied-to-23-lower-risk-of-death-in-landmark-25-year-study/", "urlToImage": "https://scitechdaily.com/images/Mediterranean-Diet-Food.jpg", "publishedAt": "2024-06-03T00:55:34Z", "content": "Researchers found that the Mediterranean diet reduces all-cause mortality by 23% among U.S. women, likely due to beneficial changes in metabolism and inflammation markers, emphasizing its potential f… [+5624 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Uncovers Most Distant Known Galaxy – “Most Significant Extragalactic Discovery to Date” - SciTechDaily", "description": "Astronomers using NASA’s James Webb Space Telescope have discovered the earliest and most distant galaxies known, dating back to just 300 million years after the Big Bang, a major milestone in understanding the universe's early stages. An international team o…", "url": "https://scitechdaily.com/webb-uncovers-most-distant-known-galaxy-most-significant-extragalactic-discovery-to-date/", "urlToImage": "https://scitechdaily.com/images/JADES-GS-z14-0-Pullout-Webb-NIRCam.jpg", "publishedAt": "2024-06-02T21:11:13Z", "content": "This infrared image from NASA’s James Webb Space Telescope (also called Webb or JWST) was taken by the NIRCam (Near-Infrared Camera) for the JWST Advanced Deep Extragalactic Survey, or JADES, program… [+6738 chars]"}]}