{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "EMIT: NASA's Unexpected Hero in the Climate Crisis - SciTechDaily", "description": "Since launching 16 months ago, the EMIT imaging spectrometer aboard the International Space Station has shown an ability to detect more than just surface minerals. More than a year after first detecting methane plumes from its perch aboard the International S…", "url": "https://scitechdaily.com/?p=329357", "urlToImage": "https://scitechdaily.com/images/Methane-Natural-Gas-Flaring-Concept.jpg", "publishedAt": "2023-11-19T21:09:51Z", "content": "ByJet Propulsion LaboratoryNovember 19, 2023\r\nFlaring, in which excess natural gas is intentionally burned into the air, is one way methane is released from oil and gas facilities. NASAs EMIT mission… [+10482 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Microglia's Key Function in Brain Development Uncovered - SciTechDaily", "description": "Scientists have found that microglia play a crucial role in regulating the number of cells that become neurons in the brain, enhancing our understanding of brain development and disorders. An international team of scientists has uncovered the vital role of mi…", "url": "https://scitechdaily.com/microglias-key-function-in-brain-development-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-Organoid-Petri-Dish-Art-Concept.jpg", "publishedAt": "2023-11-19T19:49:57Z", "content": "ByAgency for Science, Technology and Research (A*STAR), SingaporeNovember 19, 2023\r\nResearchers have discovered the vital role of microglia in brain development by studying lab-grown brain organoids.… [+8612 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Mark Gurman", "title": "Apple In-House Technologies Team Eyes Making Cameras, Screens, Modems, Batteries - Bloomberg", "description": "This week, we go inside Apple’s quest to replace every major part of the iPhone with an in-house design. Also: The company is finally embracing the RCS texting standard; Apple’s revenue share from the Google search deal is revealed in court; and one of its he…", "url": "https://www.bloomberg.com/news/newsletters/2023-11-19/apple-in-house-technologies-team-eyes-making-cameras-screens-modems-batteries-lp5j5h6b", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iAr1hmXY7eck/v1/1200x800.jpg", "publishedAt": "2023-11-19T13:46:10Z", "content": "This week, we go inside Apples quest to replace every major part of the iPhone with an in-house design. Also: The company is finally embracing the RCS texting standard; Apples revenue share from the … [+171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NISAR's Odyssey: Pioneering Earth-Observing Satellite Clears Crucial Test - SciTechDaily", "description": "During three weeks in a thermal vacuum chamber in Bengaluru, India, the joint NASA-ISRO satellite demonstrated its hardiness in a harsh, space-like environment. NISAR, the trailblazing Earth-observing radar satellite being developed by the United States and I…", "url": "https://scitechdaily.com/?p=329199", "urlToImage": "https://scitechdaily.com/images/NASA-NISAR-Orbit-Illustration-scaled.jpg", "publishedAt": "2023-11-19T13:28:33Z", "content": "ByJet Propulsion LaboratoryNovember 19, 2023\r\nAfter it launches in early 2024, NISAR will scan nearly all of the planets land and ice twice every 12 days. In orbit, the satellite will extend its sola… [+3131 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "A Brief Review of Diagnostic Techniques and Clinical Management in Chronic Kidney Disease - Cureus", "description": "Given its increasing incidence and detrimental effects on life expectancy and quality of life, chronic kidney disease (CKD) is a significant worldwide health concern. This review article provides a complete summary of current information on the diagnosis and …", "url": "https://www.cureus.com/articles/196508-a-brief-review-of-diagnostic-techniques-and-clinical-management-in-chronic-kidney-disease?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/804826/article_river_c972ef4077db11ee839419f87899721e-PRISMA_2020_flow_diagram_new_SRs_v1-1-.png", "publishedAt": "2023-11-19T07:07:22Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}]}