{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "BNNBloomberg.ca"}, "author": "Bloomberg News", "title": "Slack Unveils New Tools in Heated Competition on Hybrid Work - BNN", "description": "Slack Technologies Inc. is releasing new features to help people work with their colleagues whether in the office or at home, a sign of the stepped up competition around managing a hybrid workforce.", "url": "http://www.bnnbloomberg.ca/slack-unveils-new-tools-in-heated-competition-on-hybrid-work-1.1623638", "urlToImage": "http://www.bnnbloomberg.ca/polopoly_fs/1.1623639!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/the-slack-technologies-inc-program-on-a-laptop-computer-and-the-company-logo-on-a-smartphone-arranged-in-dobbs-ferry-new-york-u-s-on-saturday-may-29-2021-slack-technologies-inc-is-scheduled-to-release-earnings-figures-on-june-3-photographer-tiffany-hagler-geard-bloomberg.jpg", "publishedAt": "2021-06-30T14:57:35Z", "content": "Slack Technologies Inc. is releasing new features to help people work with their colleagues whether in the office or at home, a sign of the stepped up competition around managing a hybrid workforce.\r… [+1541 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Dave Michaels", "title": "Robinhood Agrees to Pay $70 Million to Settle Regulatory Investigation - The Wall Street Journal", "description": "Online brokerage faulted for missteps related to options trading and technology outages; company neither admits nor denies allegations", "url": "https://www.wsj.com/articles/robinhood-agrees-to-pay-70-million-to-settle-regulatory-investigation-11625063765", "urlToImage": "https://images.wsj.net/im-362340/social", "publishedAt": "2021-06-30T14:50:00Z", "content": "WASHINGTONRobinhood Financial LLC has agreed to pay nearly $70 million to resolve sweeping regulatory allegations that the brokerage misled customers, approved ineligible traders for risky strategies… [+8539 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Facebook and Matterport collaborate on realistic virtual training environments for AI - TechCrunch", "description": "To train a robot to navigate a house, you either need to give it a lot of real time in a lot of real houses, or a lot of virtual time in a lot of virtual houses. The latter is definitely the better option, and Facebook and Matterport are working together to m…", "url": "http://techcrunch.com/2021/06/30/facebook-and-matterport-collaborate-on-realistic-virtual-training-environments-for-ai/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/habitat-header.jpg?w=764", "publishedAt": "2021-06-30T14:32:45Z", "content": "To train a robot to navigate a house, you either need to give it a lot of real time in a lot of real houses, or a lot of virtual time in a lot of virtual houses. The latter is definitely the better o… [+5916 chars]"}, {"source": {"id": null, "name": "MobileSyrup"}, "author": null, "title": "Leaked Samsung Galaxy Z Fold 3 renders feature in-display selfie camera - MobileSyrup", "description": "New renders have surfaced on the net regarding the rumoured Galaxy Z Fold 3, the tech giant's foldable that folds like a book.", "url": "https://mobilesyrup.com/2021/06/30/samsung-galaxy-z-fold-3-renders-leak-selfie-camera/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2021/06/z-fold-3-render-scaled.jpg", "publishedAt": "2021-06-30T14:24:00Z", "content": "Yesterday, we saw renders of Samsung’s Galaxy Z Flip 3, and now, new renders have surfaced of the rumoured Galaxy Z Fold 3, the company’s foldable that folds like a book.\r\nDigit India shared the rend… [+1253 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Ian Thomas", "title": "How CRISPR gene editing will treat diseases in future: Nobel-winning Intellia co-founder Jennifer Doudna - CNBC", "description": "Jennifer Doudna, 2020 Nobel Prize winner in chemistry for CRISPR gene editing and co-founder of Intellia Therapeutics, on future of the breakthrough technology.", "url": "https://www.cnbc.com/2021/06/30/how-crispr-gene-editing-will-treat-disease-intellia-founder-doudna-.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105924772-1558442732965gettyimages-528038980.jpeg?v=1624980369", "publishedAt": "2021-06-30T14:04:55Z", "content": "Gene-editing technology CRISPR reached a major milestone this past weekend, completing its first systemic delivery as a medicine to a human body.\r\nCRISPR, or clustered regularly interspaced short pal… [+4678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Issues like responsibility and accountability of big tech companies must be debated: Jaishankar - The Indian Express", "description": "External Affairs Minister S Jaishankar's comments came in the midst of growing tensions between Indian authorities and the US social media giant Twitter on a range of issues including the new IT rules.", "url": "https://indianexpress.com/article/india/big-tech-companies-twitter-debate-s-jaishankar-7383138/", "urlToImage": "https://images.indianexpress.com/2021/05/jaishankar-1.jpg", "publishedAt": "2021-06-30T13:55:31Z", "content": "External Affairs Minister S Jaishankar on Wednesday called for a debate on responsibility and accountability of the big tech companies which enjoy huge power and influence as “non-state players”, say… [+2359 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Breakthrough for tracking RNA with fluorescence - EurekAlert", "description": "Researchers at Chalmers University of Technology, Sweden, have succeeded in developing a method to label mRNA molecules, and thereby follow, in real time, their path through cells, using a microscope - without affecting their properties or subsequent activity…", "url": "https://www.eurekalert.org/pub_releases/2021-06/cuot-bft062921.php", "urlToImage": "https://www.eurekalert.org/multimedia/pub/web/269462_web.jpg", "publishedAt": "2021-06-30T13:32:34Z", "content": "Researchers at Chalmers University of Technology, Sweden, have succeeded in developing a method to label mRNA molecules, and thereby follow, in real time, their path through cells, using a microscope… [+5405 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "SFA suspends supplier of Ho Kee Pau, recalls food delivered to NEX outlet over pest infestations - CNA", "description": "SINGAPORE: The Singapore Food Agency (SFA) has suspended the operations of HKP Food Technology, a supplier of Ho Kee Pau, after it found pest infestations at areas where food was prepared and assembled.", "url": "https://www.channelnewsasia.com/news/singapore/ho-kee-pau-supplier-suspended-nex-recall-pests-sfa-15125308", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/15125472/16x9/991/557/29eea87eccb0ea78887f91c1934d7a36/gn/ho-kee-pau-steamed-buns.jpg", "publishedAt": "2021-06-30T13:12:33Z", "content": "SINGAPORE: The Singapore Food Agency (SFA) has suspended the operations of HKP Food Technology, a supplier of Ho Kee Pau, after it found pest infestations at areas where food was prepared and assembl… [+1414 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ongoing \"Hubble Tension\" in Expanding Universe Debate – \"There May Not Be a Conflict After All\" - SciTechDaily", "description": "New analysis by University of Chicago astronomer finds agreement with standard model in ongoing \"Hubble tension.\" Our universe is expanding, but our two main ways to measure how fast this expansion is happening have resulted in different answers. For the past…", "url": "https://scitechdaily.com/ongoing-hubble-tension-in-expanding-universe-debate-there-may-not-be-a-conflict-after-all/", "urlToImage": "https://scitechdaily.com/images/Red-Giant-Helium-Flash.jpg", "publishedAt": "2021-06-30T12:25:25Z", "content": "A red giant star, Camelopardalis, emits a shell of gas as a layer of helium around its core begins to fuse. Such events help scientists calculate how fast the universe is expanding. Credit: ESA/NASA\r… [+6652 chars]"}, {"source": {"id": null, "name": "Business Wire"}, "author": null, "title": "The Lancet Infectious Diseases Published Data from Sinovac's Phase I/II Study, World's First Published Study on Clinical Trial Results of a COVID-19 Vaccine in Healthy Children and Adolescents Aged 3 to 17 Years Old - Business Wire", "description": "Sinovac Biotech Ltd. (NASDAQ: SVA) (“Sinovac” or the “Company”), a leading provider of biopharmaceutical products in China, announced The Lancet Infec", "url": "https://www.businesswire.com/news/home/20210630005422/en/The-Lancet-Infectious-Diseases-Published-Data-from-Sinovac%E2%80%99s-Phase-III-Study-World%E2%80%99s-First-Published-Study-on-Clinical-Trial-Results-of-a-COVID-19-Vaccine-in-Healthy-Children-and-Adolescents-Aged-3-to-17-Years-Old", "urlToImage": "http://www.businesswire.com/images/bwlogo_square.png", "publishedAt": "2021-06-30T10:30:00Z", "content": "BEIJING--(BUSINESS WIRE)--Sinovac Biotech Ltd. (NASDAQ: SVA) (Sinovac or the Company), a leading provider of biopharmaceutical products in China, announced The Lancet Infectious Diseases published re… [+7771 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Rogerson", "title": "Samsung Galaxy Z Fold 3 leak shows the full design and a whole bunch of colors - Techradar", "description": "One phone in three shades", "url": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-leak-shows-the-full-design-and-a-whole-bunch-of-colors", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PM4rVad9dXJAKNeWJFWgqA-1200-80.jpg", "publishedAt": "2021-06-30T08:45:18Z", "content": "The Samsung Galaxy Z Fold 3 could be the most exciting Samsung phone of the year, and weve now had our closest look yet at the likely design, thanks to leaked renders.\r\nThese renders were shared with… [+1510 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Turning Non-Recyclable Plastics Into Useful Foams - Technology Networks", "description": "Biodegradable plastics are supposed to be good for the environment. But because they are specifically made to degrade quickly, they cannot be recycled. Now, researchers have developed a method to turn biodegradable plastic knives, spoons and forks into a foam…", "url": "https://www.technologynetworks.com/applied-sciences/news/turning-non-recyclable-plastics-into-useful-foams-350349", "urlToImage": "https://cdn.technologynetworks.com/tn/images/thumbs/jpeg/640_360/turning-non-recyclable-plastics-into-useful-foams-350349.jpg?cb=20210630", "publishedAt": "2021-06-30T08:41:11Z", "content": "Biodegradable plastics are supposed to be good for the environment. But because they are specifically made to degrade quickly, they cannot be recycled.\r\nIn Physics of Fluids, by AIP Publishing, resea… [+2386 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "No payment received from Brazil govt, ‘step-by-step’ approach followed: Bharat Biotech over Covaxin deal row - The Indian Express", "description": "\"As of 29th June 2021, Bharat Biotech has not received any advance payments nor supplied any vaccines to Ministry of Health Brazil,\" the company statement reads.", "url": "https://indianexpress.com/article/world/no-payment-from-brazil-govt-bharat-biotech-covaxin-deal-row-7382621/", "urlToImage": "https://images.indianexpress.com/2021/06/Covaxin.png", "publishedAt": "2021-06-30T08:32:37Z", "content": "Following the temporary suspension of Bharat Biotech’s deal with Brazil for 20 million doses of the Covaxin Covid vaccine, the pharmaceutical company has clarified that it had not received any paymen… [+2204 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Data shows South Africa is set for interest rates hikes - BusinessTech", "description": "Africa’s oldest central bank celebrates its centenary Wednesday just as it started – steering South Africa through an economic crisis.", "url": "https://businesstech.co.za/news/banking/502209/data-shows-south-africa-is-set-for-interest-rates-hikes/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/Kganyago-e1622467826148.jpg", "publishedAt": "2021-06-30T08:01:46Z", "content": "Africas oldest central bank celebrates its centenary Wednesday just as it started – steering South Africa through an economic crisis.\r\nBorn out of a banking crisis caused by unusual financial and mon… [+3671 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Tage Kene-Okafor", "title": "Nigeria’s MDaaS launches new healthtech product on the back of $2.3M seed extension - TechCrunch", "description": "It is no secret that healthcare in Nigeria and most parts of Africa is not easily available and a lot of work needs to be done in that regard. However, there are instances where accessibility is taken for granted. Take for instance Nigeria where a majority of…", "url": "http://techcrunch.com/2021/06/30/nigerias-mdaas-launches-new-healthtech-product-on-the-back-of-2-3m-seed-extension/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/MDaaS-Global-raises-2.3m-to-launch-digital-health-solution-SentinelX-and-expand-across-Nigeria-2.jpeg?w=600", "publishedAt": "2021-06-30T08:01:26Z", "content": "It is no secret that healthcare in Nigeria and most parts of Africa is not easily available and a lot of work needs to be done in that regard. However, there are instances where accessibility is take… [+8310 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Extended level 4 lockdown would be devastating for schools, minister warns; ongoing debate over who should be next in line for vaccines; South Africa’s admin capital is in deep financial trouble; and Zuma’s supporters are being encouraged to flout lockdown la…", "url": "https://businesstech.co.za/news/government/502147/5-important-things-happening-in-south-africa-today-1070/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2017/03/Jacob-Zuma-4.png", "publishedAt": "2021-06-30T06:21:56Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 13,347 new cases of Covid-19, taking the total reported to 1,954,466. Deaths have reached … [+3595 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bloomberg", "title": "Google-Microsoft Truce Crumbles Amid Feud Over Cloud, Ad Tech - Daily Maverick", "description": "Microsoft and Google, tech giants that compete in cloud computing, web search and artificial intelligence, five years ago formally agreed to cease using their substantial lobbying firepower against each other, seeking to eliminate a pricey and distracting bat…", "url": "https://www.dailymaverick.co.za/article/2021-06-30-google-microsoft-truce-crumbles-amid-feud-over-cloud-ad-tech/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/06/Microsoft-logo-scaled.jpg", "publishedAt": "2021-06-30T03:29:26Z", "content": "Even before the deal was allowed to lapse, the non-aggression pact had been fraying. The companies feuded publicly over a proposal to force Google to pay news publishers for content and squabbled mor… [+14417 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "New Xiaomi patent reveals rollable device, could be Mi Mix Roll - TechNave", "description": "In March,&nbsp;Xiaomi&nbsp;launched the&nbsp;Mi Mix Fold&nbsp;- its first device with a foldable display. But while a few companies went for the clamshell form", "url": "https://technave.com/gadget/New-Xiaomi-patent-reveals-rollable-device-could-be-Mi-Mix-Roll-25476.html", "urlToImage": "https://technave.com/data/files/article/202106300206521837.jpg", "publishedAt": "2021-06-30T02:14:39Z", "content": "In March, Xiaomi launched the Mi Mix Fold - its first device with a foldable display. But while a few companies went for the clamshell form factor next, that might not be the case for Xiaomi. In fact… [+985 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Sterling Walker", "title": "Dinosaurs also thrived in the Arctic - Awani Review", "description": "Dinosaur species made the Arctic their permanent home and may have evolved techniques to survive the cold, according to a new study published in current", "url": "https://www.awanireview.com/dinosaurs-also-thrived-in-the-arctic/", "urlToImage": null, "publishedAt": "2021-06-29T02:11:11Z", "content": "Dinosaur species made the Arctic their permanent home and may have evolved techniques to survive the cold, according to a new study published in current biology.\r\nThis study is the first to provide e… [+1247 chars]"}]}