{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After Oppo Reno 8 launch, Oppo Reno 7 Pro gets big price cut - HT Tech", "description": "Oppo has officially slashed the prices of the Reno 7 Pro soon after the launch of the Oppo Reno 8 series in India. Know how much it will cost you.", "url": "https://tech.hindustantimes.com/mobile/news/after-oppo-reno-8-launch-oppo-reno-7-pro-gets-big-price-cut-71660398215495.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/13/1600x900/Untitled_design_-_2022-02-21T081446.594_1645413340109_1660398391419_1660398391419.jpg", "publishedAt": "2022-08-13T13:48:17Z", "content": "Oppo Reno 7 Pro price cut has been announced! The Mumbai-based retailer Mahesh Telecom has shared the information on Twitter that Oppo has slashed the price of the Reno 7 Pro by as much as Rs. 3000. … [+1444 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Does the Brain Decide in Chaos? - SciTechDaily", "description": "The brain uses data compression while making decisions. If you grew up in the 1980s or like playing old video games, you might be familiar with Frogger. The game can be quite difficult. To succeed, you must first make it through a busy traffic flow and then z…", "url": "https://scitechdaily.com/how-does-the-brain-decide-in-chaos/", "urlToImage": "https://scitechdaily.com/images/Consciousness-Brain-Activity.jpg", "publishedAt": "2022-08-13T13:26:41Z", "content": "The researchers believe that this discovery has wide-ranging implications for both neuroscience and artificial intelligence.\r\nThe brain uses data compression while making decisions.\r\nIf you grew up i… [+3912 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Floating in Space Might Seem Exciting, but It Has Serious Consequences - SciTechDaily", "description": "According to a new study, six months in space is equivalent to decades of bone loss on Earth. Have you ever wondered whether you have anything in common with an astronaut? It turns out that there are 206 of them - your bones. A study on bone loss in astronaut…", "url": "https://scitechdaily.com/floating-in-space-might-seem-exciting-but-it-has-serious-consequences/", "urlToImage": "https://scitechdaily.com/images/Astronaut-CME-Outer-Space.jpg", "publishedAt": "2022-08-13T12:36:09Z", "content": "Although floating in space could be enjoyable, a TBone study reveals that it is taxing on earthly bodies.\r\nAccording to a new study, six months in space is equivalent to decades of bone loss on Earth… [+4004 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Ashwini Sakharkar", "title": "Antarctica’s ice shelves may be melting at an accelerated rate - Tech Explorist", "description": "How do coastal ocean currents increase Antarctic ice shelf melt?", "url": "https://www.techexplorist.com/antarctica-ice-shelves-melting-accelerated-rate/53078/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/freshwater.jpg", "publishedAt": "2022-08-13T11:30:59Z", "content": "West Antarctica is undergoing rapid changes associated with both atmospheric and oceanic warming. This atmospheric warming, coupled with increased ocean temperature along the West Antarctic Peninsula… [+2942 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Evidence That Giant Asteroid Impacts Created the Continents - SciTechDaily", "description": "New research has uncovered the strongest evidence yet that Earth’s continents were formed by giant meteorite impacts, which were especially common during the first billion years or so of our planet’s four-and-a-half-billion-year history. Curtin University res…", "url": "https://scitechdaily.com/new-evidence-that-giant-asteroid-impacts-created-the-continents/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Collision-Earth-Impact.jpg", "publishedAt": "2022-08-13T10:43:59Z", "content": "Evidence that Earths continents were formed by giant meteorite impacts has been uncovered in new research.\r\nNew research has uncovered the strongest evidence yet that Earths continents were formed by… [+2565 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How much you need to earn the equivalent of R20,000 per month for 20 years upon retirement in South Africa - BusinessTech", "description": "There is so much uncertainty in the world today – from the two-year-long fight against the pandemic and consumers’ battle against war-induced fuel hikes, to investors trying to interpret global recession concerns or South Africans’ struggle with Eskom.", "url": "https://businesstech.co.za/news/business/615365/how-much-you-need-to-earn-the-equivalent-of-r20000-per-month-for-20-years-upon-retirement-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/06/shutterstock_746139745-e1654175939468.jpg", "publishedAt": "2022-08-13T08:34:42Z", "content": "There is so much uncertainty in the world today from the two-year-long fight against the pandemic and consumers battle against war-induced fuel hikes to investors trying to interpret global recession… [+4319 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "These Canadian startups are taking quantum computing mainstream - CBC News", "description": "For years, quantum computers have mostly been the focus of academics and government. Now, experts say we could be near a turning point where the technology is closer to commercialization.", "url": "https://www.cbc.ca/news/business/quantum-computers-canada-1.6546128", "urlToImage": "https://i.cbc.ca/1.6546162.1660072659!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/borealis.jpg", "publishedAt": "2022-08-13T08:00:00Z", "content": "It's not what you'd expect to find on the 29th floor of a Toronto office building. Instead of cubicles, a complex arrangement of lasers, mirrors and optical fibres run from floor to ceiling, making u… [+5762 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Recommended accessories for your PerantiSiswa tablet - TechNave", "description": "Have you heard of the&nbsp;PerantiSiswa programme&nbsp;by the Ministry of Communications and Multimedia (K-KOMM)? It aims to provide B40 students in higher-lear", "url": "https://technave.com/gadget/Recommended-accessories-for-your-PerantiSiswa-tablet-31261.html", "urlToImage": "https://technave.com/data/files/article/202208110831419778.jpg", "publishedAt": "2022-08-13T04:14:34Z", "content": "Have you heard of the PerantiSiswa programme by the Ministry of Communications and Multimedia (K-KOMM)? It aims to provide B40 students in higher-learning institutions with a tablet. Recently, it was… [+4982 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Shoemaker to the stars Jimmy Choo talks tech, Princess Diana and paying it forward through education - CNA Luxury", "description": "The designer’s journey from Penang to the pinnacle of the global fashion world is legendary. CNA Luxury met up with Choo in Bangkok where he talks about his stratospheric rise and the lessons he has learned along the way.", "url": "https://cnaluxury.channelnewsasia.com/people/jimmy-choo-interview-shoes-princess-diana-huawei-bangkok-205856", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--tLx1MT_t--/c_crop,h_843,w_1500,x_0,y_4/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/08/11/jimmy_choo_shoe_designer.png?itok=L7eOdYFa", "publishedAt": "2022-08-12T22:45:00Z", "content": "Abodes in Bangkok dont come much more uplifting than a penthouse suite at the citys Peninsula Hotel. Perched proudly at the crown of the property, the plush furnishings in the duplex unit exude a com… [+1716 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Grab iPhone SE 3 starting from just $209.99! Check this BestBuy offer here - HT Tech", "description": "iPhone SE 3 price cut: BestBuy is giving away exciting offers on iPhone SE 3 with an eligible carrier service provider. Check the details of the deal here.", "url": "https://tech.hindustantimes.com/mobile/news/grab-iphone-se-3-starting-from-just-209-99-check-this-bestbuy-offer-here-71660325890467.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/12/1600x900/4_1646766275861_1660326001550_1660326001550.jpg", "publishedAt": "2022-08-12T17:41:40Z", "content": "Planning to buy a new iPhone? If yes, today could be the best chance to grab it with a bit of a discount. BestBuy is giving away an attractive discount on iPhone SE 3. The phone was launched earlier … [+1450 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Muktar Oladunmade", "title": "Samsung announces the Galaxy Z Fold4 and Flip4 in Nigeria - TechCabal", "description": "Samsung has unveiled its latest foldable phones, the Galaxy Fold 4 and the Flip 4. Both phones will be available in Nigeria by September.", "url": "https://techcabal.com/2022/08/12/samsung-launches-its-newest-foldable-phones-in-nigeria/", "urlToImage": "https://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2022/08/Samsung-Unveils-Galaxy-Z-Flip4-and-Galaxy-Z-Fold4-in-Nigeria-1024x650.jpg", "publishedAt": "2022-08-12T16:59:17Z", "content": "L-R: MX, Marketing Manager, Samsung Nigeria,Omolade Agbadaola; Master Trainer, Samsung Nigeria, Solomon Osieluwo; Head of Retail MX, Joy Tim-Ayoola; Marketing Lead, Chika Nnadozie and MX Business Man… [+3550 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Diagnostic Robotics has AI catching health problems before they take you to the ER - TechCrunch", "description": "Tel Aviv-based Diagnostic Robotics just raised a $45M B round, led by StageOne investors, which will help the company start working directly with providers.", "url": "https://techcrunch.com/2022/08/12/diagnostic-robotics-has-ai-catching-health-problems-before-they-take-you-to-the-er/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/08/diagnostic-robotics-2.png?w=569", "publishedAt": "2022-08-12T16:32:04Z", "content": "A stitch in time saves nine, they say and a blood thinner in time saves a trip to the emergency room for a heart attack, as Diagnostic Robotics hopes to show. The company’s machine learning-powered p… [+4891 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "What causes the Perseid Meteor Shower? NASA reveals the answer - HT Tech", "description": "What causes the Perseid Meteor Shower? The answer is provided by NASA and it is as stunning as the shower itself.", "url": "https://tech.hindustantimes.com/tech/news/what-causes-the-perseid-meteor-shower-nasa-reveals-the-answer-71660315674821.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/12/1600x900/geminid20091209-full_1659694290386_1660315821565_1660315821565.jpg", "publishedAt": "2022-08-12T14:51:12Z", "content": "The Perseid Meteor Shower is an annual event which is active from mid-July to September every year. It is easily the most stunning meteor shower of the year, bringing spectacular visuals for astronom… [+1787 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Madrid meteor mystery unearthed, was part of a comet! Origins revealed - HT Tech", "description": "The origins and trajectory of the meteor that was spotted in Madrid has finally been revealed.", "url": "https://tech.hindustantimes.com/tech/news/madrid-meteor-mystery-unearthed-was-part-of-a-comet-origins-revealed-71660291807117.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/12/1600x900/meteorite-6059746_1920_1627288222483_1660291869859_1660291869859.jpg", "publishedAt": "2022-08-12T08:12:27Z", "content": "A meteor that was spotted over Madrid in the last week of July has had its origins revealed. Although the meteor burned up in the Earth's atmosphere on July 31, its origins and trajectory has now bee… [+1610 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Tech Desk", "title": "Lenovo is partnering with organizations to upskill youth with tech skills - Times Now", "description": "Lenovo has confirmed that it is partnering with different youth organizations across Asia Pacific.", "url": "https://www.timesnownews.com/technology-science/lenovo-is-partnering-with-organizations-to-upskill-youth-with-tech-skills-article-93515614", "urlToImage": "https://static.tnn.in/thumb/msid-93515614,imgsize-100,width-1280,height-720,resizemode-75/93515614.jpg", "publishedAt": "2022-08-12T06:29:07Z", "content": "FILE PHOTO: The Lenovo logo is seen in this illustration photo January 22, 2018. REUTERS/Thomas White/Illustration"}, {"source": {"id": null, "name": "Techguide.com.au"}, "author": "Stephen Fenech", "title": "ASUS ROG Phone 6 Series take mobile gaming to an all-new level - Tech Guide", "description": "ASUS Republic of Gamers (ROG) have announced the pricing and availability of its highly anticipated new high powered gaming devices - ROG Phone 6 series.ROG Phone 6 and ROG Phone 6 Pro are powered by the latest Snapdragon 8+ Gen 1 Mobile Platform wit", "url": "https://www.techguide.com.au/news/mobiles-news/asus-rog-phone-6-series-take-mobile-gaming-to-an-all-new-level/", "urlToImage": "https://www.techguide.com.au/wp-content/uploads/2022/08/ASUSROG4.jpeg", "publishedAt": "2022-08-12T00:12:27Z", "content": "ASUS Republic of Gamers (ROG) have announced the pricing and availability of its highly anticipated new high powered gaming devices – ROG Phone 6 series.\r\nROG Phone 6 and ROG Phone 6 Pro are powered … [+1646 chars]"}]}