{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Gavi.org"}, "author": null, "title": "Missing TB cases 'key to elimination' - Gavi, the Vaccine Alliance", "description": "\"With investment in new technologies to diagnose missing cases, TB can be eliminated, say disease experts.\"", "url": "https://www.gavi.org/vaccineswork/missing-tb-cases-key-elimination", "urlToImage": "https://www.gavi.org/sites/default/files/vaccineswork/2024/Header/genXpert_MAIN_h1.jpg", "publishedAt": "2024-03-28T15:05:43Z", "content": "In the journey towards a world free of Tuberculosis (TB), the crucial first step begins with identifying individuals affected by the disease.\r\nGlobally, around 1.3 million people died from TB in 2022… [+5804 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says three asteroids will pass Earth by a close margin today; Check speed, size and more - HT Tech", "description": "As many as three asteroids are expected to fly past Earth by a close margin today, March 28. From size and speed to distance of approach, know all about these close encounters, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-three-asteroids-will-pass-earth-by-a-close-margin-today-check-speed-size-and-more-71711622914929.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/28/1600x900/3_1693479089566_1711623447074.jpg", "publishedAt": "2024-03-28T10:59:06Z", "content": "Just yesterday, 3 asteroids passed Earth by a close margin. While none of them were considered Potentially Hazardous Asteroids, the biggest of them was 150 feet wide, making it almost as big as an ai… [+2809 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "Apple Is On Google And OpenAI’s Disposal For An AI-Powered Chatbot In iOS 18, As Company’s Own Version Remains Unlikely - Wccftech", "description": "Apple is slated to rely on Google, OpenAI, and Baidu for an AI-powered chatbot as its own version remains unlikely for iOS 18 on iPhone.", "url": "https://wccftech.com/apple-ai-chatbot-for-ios-18/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/03/Siri.jpg", "publishedAt": "2024-03-27T18:33:00Z", "content": "Apple announced yesterday that it will be hosting its highly anticipated WWDC 2024 event on June 10 to announce iOS 18 and a bunch of other updates for its entire product line. We have previously cov… [+2273 chars]"}]}