{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Haripriya Suresh", "title": "NVIDIA to train 50,000 Infosys employees on AI technology - Moneycontrol", "description": "This is NVIDIA’s third major collaboration announcement in India this month, after partnership announcements with Reliance and Tata.", "url": "https://www.moneycontrol.com/news/business/nvidia-infosys-to-collaborate-to-help-enterprises-drive-productivity-with-generative-ai-11397661.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/09/Huang_Nilekani-1-770x433.jpg", "publishedAt": "2023-09-20T10:15:21Z", "content": "In NVIDIAs third major collaboration announcement in India this month, it will be collaborating with IT major Infosys to help enterprises drive productivity gains with generative AI applications and … [+2927 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Nithya P Nair, Siddharth Suvarna", "title": "iPhone 15 Series, iPhone 14, Apple Watch Series 9 Available With Up to Rs. 6,000 Bank Discount: Details | Technology News - Gadgets 360", "description": "Apple is offering an instant savings offer for its latest iPhone 15 lineup for customers making purchases using HDFC Bank cards. This can be availed while shopping on the company’s online store, or in retail stores Apple Saket and Apple BKC.", "url": "https://www.gadgets360.com/mobiles/news/iphone-15-plus-pro-max-14-13-watch-series-9-ultra-2-se-hdfc-bank-offer-instant-discount-apple-details-4406038", "urlToImage": "https://i.gadgets360cdn.com/large/iphone_15_small_1694675501869.jpg", "publishedAt": "2023-09-20T06:06:33Z", "content": "iPhone 15 series pre-orders began last week followed by the launch at the Apple Wanderlust event on September 12. If you've been wanting to buy one of the latest iPhone models but have been put off b… [+3037 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 Pro Max is the fastest iPhone ever, AnTuTu scores reveal - HT Tech", "description": "The AnTuTu scores reveal that the iPhone 15 Pro Max is the fastest iPhone ever, with a score significantly higher than last year’s flagship.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-pro-max-is-the-fastest-iphone-ever-antutu-scores-reveal-71695187919718.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/20/1600x900/APPLE-UNVEILING-5_1695188049158_1695188065766.jpg", "publishedAt": "2023-09-20T05:35:40Z", "content": "iPhones are usually considered to be among the very best smartphones in the world. While they come with a hefty price tag, Apple offers the top-of-the-line tech with its new smartphones each year, an… [+2045 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Search for Dark Matter – A Promising New Method - SciTechDaily", "description": "Approximately 80% of the universe's matter is composed of a mysterious and unseen substance. This \"dark matter\" was first theorized nearly 90 years ago. “This was the only way to reconcile the velocity distribution of visible matter within galaxies with exist…", "url": "https://scitechdaily.com/?p=309969", "urlToImage": "https://scitechdaily.com/images/Dark-Matter-Black-Hole-Abstract.jpg", "publishedAt": "2023-09-20T05:10:26Z", "content": "About 80% of the universes matter is an undetected substance called dark matter. While its existence has been theorized for about 90 years, scientists at the JEDI collaboration, using advanced partic… [+4283 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid set to get closer to Earth today than Moon is! Know details of this terrifying approach - HT Tech", "description": "An Apollo group near-Earth Asteroid could make its closest approach today, and it will get much closer to our planet than even the is! Check the speed, size, and other details, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-set-to-get-closer-to-earth-today-than-moon-is-know-details-of-this-terrifying-approach-71695185300815.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/20/1600x900/asteroid-6149674_640_1686902438536_1695185452907.jpg", "publishedAt": "2023-09-20T04:51:15Z", "content": "NASA defines asteroids as ancient space rocks left over from the early formation of our solar system about 4.6 billion years ago. While most of these space rocks are located in the main asteroid belt… [+2084 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "An Unexpected New Way To Recycle – Scientists Transform Plastic Waste Into Soap - SciTechDaily", "description": "Researchers have developed a new method to recycle plastics, such as those from milk cartons, food containers, and plastic bags, into soap. The method: Heat the long carbon chains in the plastics then quickly cool them. Researchers from Virginia Tech have dev…", "url": "https://scitechdaily.com/an-unexpected-new-way-to-recycle-scientists-transform-plastic-waste-into-soap/", "urlToImage": "https://scitechdaily.com/images/Plastic-Recycling-Concept-Art.jpg", "publishedAt": "2023-09-19T20:41:20Z", "content": "ByVirginia TechSeptember 19, 2023\r\nResearchers have developed a method to upcycle plastics into valuable surfactants used in products like soap and detergents. This discovery, rooted in the molecular… [+8288 chars]"}]}