{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Potential GTA 6 gameplay and map details surface on TikTok ahead of official reveal - HT Tech", "description": "A TikTok user has allegedly unveiled GTA 6 footage and map insights, creating a huge buzz ahead of the official reveal. Leaker's connection to a Rockstar Games employee adds heft to claim.", "url": "https://tech.hindustantimes.com/gaming/news/potential-gta-6-gameplay-and-map-details-surface-on-tiktok-ahead-of-official-reveal-71701612602793.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/03/1600x900/GTA_6__1701612816291_1701612816490.png", "publishedAt": "2023-12-03T14:14:15Z", "content": "In a surprising turn of events, a potential glimpse into the highly anticipated GTA 6 gameplay and map has emerged on TikTok. An individual going by the username \"azzarossi\" shared the purported game… [+2312 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Monday: 15 things to know before opening bell - Moneycontrol", "description": "A long build-up was seen in 84 stocks, which included Delta Corp, Can Fin Homes, Hindustan Copper, Dr Lal PathLabs, and Dixon Technologies.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-15-things-to-know-before-opening-bell-7-11844881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/Stock-market-770x433.png", "publishedAt": "2023-12-03T13:36:43Z", "content": "After surpassing the previous record high on the first day of December series and continuation of bullish sentiment for five weeks in a row, experts expect the momentum to continue and take the Nifty… [+8169 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Week in tech: Nasa to train Indian astronaut for a trip to the ISS - Mint Lounge", "description": "Nasa administrator Bill Nelson’s recent visit to India marked another milestone for the deepening space ties between the two countries", "url": "https://lifestyle.livemint.com/smart-living/innovation/week-in-tech-nasa-isro-iss-bill-nelson-nisar-111701599273087.html", "urlToImage": "https://images.livemint.com/img/2023/12/03/1140x641/PTI11-29-2023-000282A-0_1701599499520_1701599525959.jpg", "publishedAt": "2023-12-03T12:50:49Z", "content": "Heres a weekly recap of at what made news in the world of science and technology.\r\nNasa to train Indian astronaut for ISS voyage\r\nNasa administrator Bill Nelsons recent visit to India marked another … [+2555 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "IPO Weekly Wrap: Tata Tech, IREDA, Gandhar, Flair, SME stocks make bumper debuts; Fedbank disappoints - Moneycontrol", "description": "Tata Technologies, Gandhar Oil Refinery, Indian Renewable Energy (IREDA) and Flair Writing Industries made bumper debuts while Fedbank Financial Services disappointed investors", "url": "https://www.moneycontrol.com/news/business/ipo/ipo-weekly-wrap-tata-tech-ireda-gandhar-flair-sme-issues-make-bumper-debuts-fedbank-disappoints-11847511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/market_volatile-10-770x433.jpg", "publishedAt": "2023-12-03T10:42:06Z", "content": "The listings of five mainboard and two small and medium enterprises (SME) IPOs kept investors busy this week. Tata Technologies is listed at a 140 percent premium over the issue price. Gandhar Oil Re… [+6839 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Sushant Singh", "title": "Redmi Note 13 Pro and Redmi Note 13 Pro+ European price leaked ahead of launch - The Tech Outlook", "description": "After the huge success of the recently launched Redmi Note 13 series in the home market users are waiting for it to be launched globally. Though it's listed on certification websites like EEC, NBTC, IMDA, TDRA, and SDPPI, the FCC has suggested its ne", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/redmi-note-13-pro-and-redmi-note-13-pro-european-price-leaked-ahead-of-launch/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/12/Redmi_Note_13_Pro1.jpg", "publishedAt": "2023-12-02T17:16:10Z", "content": "After the huge success of the recently launched Redmi Note 13 series in the home market users are waiting for it to be launched globally. Though it’s listed on certification websites like EEC, NBTC, … [+1384 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lost in Space: Is a Giant Void Driving the Universe Apart? - SciTechDaily", "description": "Cosmologists propose a giant void in space as a solution to the \"Hubble tension,\" challenging conventional models and suggesting a revision of Einstein's gravity theory. One of the biggest mysteries in cosmology is the rate at which the universe is expanding.…", "url": "https://scitechdaily.com/lost-in-space-is-a-giant-void-driving-the-universe-apart/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Space-Void-Concept-Art.jpg", "publishedAt": "2023-12-02T09:25:42Z", "content": "The recent “Hubble tension” in cosmology, marked by conflicting expansion rate measurements, raises questions about the standard cosmological model. A new theory posits that a giant, underdense void … [+8017 chars]"}]}