{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O'Donnell", "title": "iPhone 15 Ultra will launch with a new matte finish, \"clicky\" buttons, USB type-C and no mute switch - Notebookcheck.net", "description": "Apple is once again tipped to produce its inaugural Ultra-class iPhone in 2023, with this alleged new 15-series flagship turning up in dummy form on a popular tech YouTube channel. It may be slightly narrower and thicker than the 14 Pro Max it is tipped to re…", "url": "https://www.notebookcheck.net/iPhone-15-Ultra-will-launch-with-a-new-matte-finish-clicky-buttons-USB-type-C-and-no-mute-switch.715930.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/14promaxv15ultradummyteaser.png", "publishedAt": "2023-05-07T16:07:55Z", "content": "Apple is projected to finally select the Ultra tag for its top-end iPhone in 2023. Now, according to the popular YouTuber Lewis Hilsentegger, that is not the only Android smartphone trend it will fol… [+1934 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: New Space Exploration Partner, Mars Experience on Earth, Black Hole Week - SciTechDaily", "description": "Another partner for space exploration … A Mars experience right here on Earth … And a promising find outside our solar system … A few of the stories to tell you about – This Week at NASA! https://youtu.be/9CbCEsfZ7BE Another Nation Signs Up for Exploration Co…", "url": "https://scitechdaily.com/?p=275105", "urlToImage": "https://scitechdaily.com/images/GJ-486-b-Exoplanet-Star.jpg", "publishedAt": "2023-05-07T14:18:52Z", "content": "ByNASAMay 7, 2023\r\nGJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just under 1… [+3569 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "OpenAI CEO: Fully Remote Work for Startups is 'One of the Tech Industry's Worst Mistakes' - Slashdot", "description": "ChatGPT creator OpenAI is now valued at nearly $30 billion, reports Fortune &mdash; adding that CEO Sam Altman \"still thinks startups are most effective when employees work together in an office.\"\n\n\nThe idea of fully remote work becoming the norm has come and…", "url": "https://it.slashdot.org/story/23/05/07/0128220/openai-ceo-fully-remote-work-for-startups-is-one-of-the-tech-industrys-worst-mistakes", "urlToImage": "https://a.fsdn.com/sd/topics/it_64.png", "publishedAt": "2023-05-07T13:11:30Z", "content": "Ok, let's consider phases of a tecnology startup.\r\nYou have some guys, 2-5 people, who come up with some sort of idea. Maybe they are already working for someone (remotely or not) and decide to start… [+2318 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Pixel Fold: Price, design, specs to launch, check it all out - HT Tech", "description": "Google Pixel Fold is all set to launch in a few days. From design, specs, to price – know everything that you need to know about this foldable smartphone.", "url": "https://tech.hindustantimes.com/mobile/news/google-pixel-fold-price-design-specs-to-launch-check-it-all-out-71683457933845.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/07/1600x900/Google_Pixel_fold_1683458150141_1683458172707.PNG", "publishedAt": "2023-05-07T11:17:25Z", "content": "Google Pixel Fold launch is just a few days away! It has now been officially confirmed to launch on May 10, at the beginning of the Google I/O Event 2023. With this Pixel Fold, Google is all set to s… [+2333 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study: 70% of Type 2 Diabetes Cases Linked to Food Choices - SciTechDaily", "description": "A study has established a correlation between a poor diet and 14 million cases of type 2 diabetes worldwide. According to a research model developed by the Friedman School of Nutrition Science and Policy at Tufts University, poor diet was a significant factor…", "url": "https://scitechdaily.com/new-study-70-of-type-2-diabetes-cases-linked-to-food-choices/", "urlToImage": "https://scitechdaily.com/images/Healthy-Food-Choices-Diabetes-scaled.jpg", "publishedAt": "2023-05-06T14:25:17Z", "content": "ByTufts UniversityMay 6, 2023\r\nResearchers estimate 7 out of 10 cases of type 2 diabetes worldwide in 2018 linked to food choices. Credit: Alonso Nichols/Tufts University\r\nA study has established a c… [+5564 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ryan Hogg", "title": "'Godfather of AI': The tech could be more urgent risk than climate change - Business Insider", "description": "\"With climate change, it's very easy to recommend what you should do: you just stop burning carbon. If you do that, eventually things will be okay. For this it's not at all clear what you should do,\" Geoffrey Hinton told Reuters.", "url": "https://www.businessinsider.com/godfather-geoffrey-hinton-ai-more-urgent-threat-than-climate-change-2023-5", "urlToImage": "https://i.insider.com/644fe1b9da6d7b0019bdca65?width=1200&format=jpeg", "publishedAt": "2023-05-06T13:17:00Z", "content": "The \"Godfather of AI\" who recently quit Google to raise awareness about the dangers of artificial intelligence has said the threat the tech poses to the world could be more urgent than climate change… [+1693 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brain Boost: Special Omega-3 Fatty Acid Lipid's Key Role in Aging Uncovered - SciTechDaily", "description": "Researchers have discovered that the transporter protein Mfsd2a is critical for regulating brain cells that maintain myelin sheaths, which protect nerves. This discovery could help reduce the effects of aging on the brain and lead to therapies for neurologica…", "url": "https://scitechdaily.com/brain-boost-special-omega-3-fatty-acid-lipids-key-role-in-aging-uncovered/", "urlToImage": "https://scitechdaily.com/images/Brain-With-Myelinated-Axons.jpg", "publishedAt": "2023-05-06T10:38:59Z", "content": "ByDuke-NUS Medical SchoolMay 6, 2023\r\nThe developing preclinical models brain with myelinated axons (shown in green color). Scientists from Singapore have discovered the crucial role of a transporter… [+6250 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 6 May 2023: Fascinating Twilight in a Flower! - HT Tech", "description": "NASA Astronomy Picture of the Day 6 May shares a breathtaking image of the transition of the day in the shape of a flower.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-6-may-2023-fascinating-twilight-in-a-flower-71683368347797.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/06/1600x900/NASA_APOD_may6_1683368662430_1683368677127.jpg", "publishedAt": "2023-05-06T10:25:38Z", "content": "Skyscapes during the twilight are undoubtedly beautiful and mesmerizing. However, it can be creative too with a sense of perfect presentation. An astrophotographer, Dario Giannobile showed proof of i… [+1928 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Exciton fission: One photon in, two electrons out - Science Daily", "description": "Photovoltaics, the conversion of light to electricity, is a key technology for sustainable energy. Since the days of Max Planck and Albert Einstein, we know that light as well as electricity are quantized, meaning they come in tiny packets called photons and …", "url": "https://www.sciencedaily.com/releases/2023/05/230505141618.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-05-05T20:25:03Z", "content": "Photovoltaics, the conversion of light to electricity, is a key technology for sustainable energy. Since the days of Max Planck and Albert Einstein, we know that light as well as electricity are quan… [+2166 chars]"}]}