{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Consumption of Cardamom for appetite boost and fat burn - Tech Explorist", "description": "Cardamom seeds boost energy expenditure and reduce fat in mice.", "url": "https://www.techexplorist.com/consumption-cardamom-appetite-boost-fat-burn/66785/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/08/cardamom.jpg", "publishedAt": "2023-08-14T08:37:11Z", "content": "Cardamom (Elettaria cardamomum), a popular spice known for its aromatic flavor, has been investigated for its potential health benefits beyond its culinary use. The study explores the effects of card… [+4184 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Startling Case of “Blue Legs Raises” Concerns Over Long Covid's Unexplored Symptoms - SciTechDaily", "description": "Recent research presents a unique case of a Long Covid patient whose legs turned blue after standing, highlighting the need for increased awareness of acrocyanosis. The study also emphasizes the connection between Long Covid, dysautonomia, and conditions like…", "url": "https://scitechdaily.com/a-startling-case-of-blue-legs-raises-concerns-over-long-covids-unexplored-symptoms/", "urlToImage": "https://scitechdaily.com/images/Long-COVID-‘Blue-Legs-Symptom.jpg", "publishedAt": "2023-08-14T08:26:08Z", "content": "ByUniversity of LeedsAugust 14, 2023\r\nFrom left: Patient standing at 0 minutes; 2 minutes, and 10 minutes. Credit: University of Leeds\r\nRecent research presents a unique case of a Long Covid patient … [+4509 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Talking in Waves: The Unique Communication Language of Cells - SciTechDaily", "description": "The physics of cell communication: ISTA scientists successfully model cell dynamics. Like us, cells communicate. Well, in their own special way. Using waves as their common language, cells tell one another where and when to move. They talk, they share informa…", "url": "https://scitechdaily.com/talking-in-waves-the-unique-communication-language-of-cells/", "urlToImage": "https://scitechdaily.com/images/Cell-Biology-Concept-Art-Illustration.jpg", "publishedAt": "2023-08-13T23:26:07Z", "content": "Researchers have developed a theoretical model to understand cellular communication and movement. Their latest findings could have significant implications for wound healing, with early computer simu… [+5641 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking Physics: Muon G-2 Experiment Reinforces Surprise Result, Setting Up “Ultimate Showdown” - SciTechDaily", "description": "Findings at Fermilab show discrepancy between theory and experiment, which may lead to new physics beyond the Standard Model. Physicists now have a brand-new measurement of a property of the muon called the anomalous magnetic moment that improves the precisio…", "url": "https://scitechdaily.com/breaking-physics-muon-g-2-experiment-reinforces-surprise-result-setting-up-ultimate-showdown/", "urlToImage": "https://scitechdaily.com/images/Sub-Atomic-Particle-Quantum-Physics-Art-Illustration.jpg", "publishedAt": "2023-08-13T15:33:40Z", "content": "ByFermi National Accelerator LaboratoryAugust 13, 2023\r\nFermilabs Muon g-2 experiment has unveiled a new precision measurement of the muons magnetic property, hinting at undiscovered particles and a … [+10610 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple iPhone 15 Pro models' chip details leaked! - HT Tech", "description": "A huge number of leaks have revealed most of what is likely to be on the iPhone 15 Pro models. However, nothing much was known about the iPhone 15 Pro chip. That has just been changed by the latest leak.", "url": "https://tech.hindustantimes.com/mobile/news/apple-iphone-15-pro-models-chip-details-leaked-71691930565506.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/13/1600x900/iPhone_15_1691930838248_1691930838511.jpg", "publishedAt": "2023-08-13T12:47:48Z", "content": "As anticipation builds for Apple's forthcoming iPhone 15 launch, a significant revelation has emerged. While a huge number of leaks have revealed most of what is likely to be on the iPhone 15 Pro mod… [+3405 chars]"}]}