{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Ultimate Death Stare: How Moth Wing Patterns Allow Them To Escape Death - SciTechDaily", "description": "Dr. Hannah Rowland and Dr. John Skelhorn explain how these defensive patterns on moth wings persuade birds that assaulting the insects is not worth the risk. Art mirrors real life when it comes to moth wings Have you ever had the impression that someone in a …", "url": "https://scitechdaily.com/the-ultimate-death-stare-how-moth-wing-patterns-allow-them-to-escape-death/", "urlToImage": "https://scitechdaily.com/images/Peacock-Butterfly-scaled.jpg", "publishedAt": "2022-11-19T21:08:49Z", "content": "A peacock butterfly with eyespots on its wings. Credit: Dr. Hannah Rowland\r\nDr. Hannah Rowland and Dr. John Skelhorn explain how these defensive patterns on moth wings persuade birds that assaulting … [+4525 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Is It Safe for Humans To Go Up to Space? ISS Experiments Reveal Risks for Future Space Flights - SciTechDaily", "description": "The study in mouse cells analyzed the impact of space radiation and will help scientists better estimate the safety and dangers of space travel. An international team of scientists conducted a long-term experiment onboard the International Space Station to in…", "url": "https://scitechdaily.com/is-it-safe-for-humans-to-go-up-to-space-iss-experiments-reveal-risks-for-future-space-flights/", "urlToImage": "https://scitechdaily.com/images/Astronaut-in-Outer-Space.jpg", "publishedAt": "2022-11-19T19:57:59Z", "content": "ByOsaka Metropolitan UniversityNovember 19, 2022\r\nAstronauts may be exposed to high energy charged particles from galactic cosmic rays and solar particle events, as well as secondary protons and neut… [+4990 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Paul Tassi", "title": "Pokemon Scarlet And Violet’s Tech Problems Are On Game Freak, Not The Switch - Forbes", "description": "Game Freak is to blame for how bad Pokemon Scarlet and Violet are performing, even if Nintendo should upgrade the Switch soon too.", "url": "https://www.forbes.com/sites/paultassi/2022/11/19/pokemon-scarlet-and-violets-tech-problems-are-on-game-freak-not-the-switch/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6378e032e6034480162d6c0f/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-11-19T13:58:18Z", "content": "Pokemon Scarlet and Violet\r\nGame Freak\r\nWhile yes, we have reached a point in the lifecycle of the Nintendo Switch where the handheld console is roughly two full generations of tech behind its rivals… [+2346 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Exceeding Expectations” – Orion Spacecraft Conducts First Inspection - SciTechDaily", "description": "https://youtu.be/pCp-VY2VxGY On the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfway to the Moon. Credit: NASA On the third day of its Arte…", "url": "https://scitechdaily.com/exceeding-expectations-orion-spacecraft-conducts-first-inspection/", "urlToImage": "https://scitechdaily.com/images/Orion-Captures-Moon-With-Camera-on-Solar-Array.gif", "publishedAt": "2022-11-19T11:16:10Z", "content": "ByNASANovember 19, 2022\r\nOn the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfwa… [+4514 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "There are now 8 billion people in the world – here’s what that means for the future - BusinessTech", "description": "There are 8 billion people in the world. That’s a fact. It’s a thing we can’t deny. Like the fact that", "url": "https://businesstech.co.za/news/lifestyle/643463/there-are-now-8-billion-people-in-the-world-heres-what-that-means-for-the-future/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Large-crowd.jpg", "publishedAt": "2022-11-19T11:09:16Z", "content": "The worlds population reached 8 billion Tuesday (15 November), according to estimates from the United Nations, even as the international body said that a surge in births in lower-income countries is … [+2563 chars]"}, {"source": {"id": null, "name": "Tiretechnologyinternational.com"}, "author": "Callum Brook-Jones", "title": "Porsche specifies off-road tire for the first time on 911 model - Tire Technology International", "description": "To deliver maximum performance on tough terrain, Pirelli will supply its Scorpion All Terrain Plus as original equipment for the Porsche 911 Dakar, marking the first time that Porsche will specify an off-road tire for the 911 model. The reinterpreted 911 mode…", "url": "https://www.tiretechnologyinternational.com/news/oe-fitments/porsche-specifies-off-road-tire-for-the-first-time-on-911-model.html", "urlToImage": "https://www.tiretechnologyinternational.com/wp-content/uploads/2022/11/USE-FIRST-e1668788552986-1024x489.jpg", "publishedAt": "2022-11-18T16:24:38Z", "content": "To deliver maximum performance on tough terrain, Pirelli will supply its Scorpion All Terrain Plus as original equipment for the Porsche 911 Dakar, marking the first time that Porsche will specify an… [+1131 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Liftoff! Stunning Photos of Successful Launch for JPSS-2, LOFTID - SciTechDaily", "description": "Last week the NOAA’s Joint Polar Satellite System-2 (JPSS-2) satellite, with NASA’s LOFTID technology demonstration along for the ride, lifted off from Space Launch Complex-3 at Vandenberg Space Force Base in California. Powered by 860,000 pounds of thrust fr…", "url": "https://scitechdaily.com/liftoff-stunning-photos-of-successful-launch-for-jpss-2-loftid/", "urlToImage": "https://scitechdaily.com/images/JPSS-2-and-LOFTID-Launch-Moon-scaled.jpg", "publishedAt": "2022-11-18T15:03:19Z", "content": "ByNASANovember 18, 2022\r\nThe Moon makes a stunning backdrop for the successful launch of the third in a series of polar-orbiting weather satellites for the National Oceanic and Atmospheric Administra… [+3595 chars]"}, {"source": {"id": null, "name": "Beebom"}, "author": "Vanshika Malhotra", "title": "Intel’s FakeCatcher Can Detect a Deepfake Video in Real Time - Beebom", "description": "Intel has introduced a new technology called FakeCatcher, which can easily detect Deepfake videos in real-time. Check out the details.", "url": "https://beebom.com/intel-fakecatcher-technology-detect-deepfakes/", "urlToImage": "https://beebom.com/wp-content/uploads/2022/11/intel-fakecatcher.jpg", "publishedAt": "2022-11-18T12:07:20Z", "content": "While Deepfakes can be fun, they have been increasingly used to spread fake news and fake images of people, especially celebrities. With time, detecting one and become more difficult but Intel has a … [+2297 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major headache for new climate laws in South Africa - BusinessTech", "description": "A recent report by the Parliamentary Monitoring Group examined the actions and effectiveness of the country’s Parliament in achieving outcomes in relation to the climate change agenda, with some disturbing findings.", "url": "https://businesstech.co.za/news/government/644195/major-headache-for-new-climate-laws-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Ramaphosa-Green-Earth-Climate-Change-v2.jpg", "publishedAt": "2022-11-18T08:33:39Z", "content": "The Parliamentary Monitoring Group (PMG) has found that critical climate bills are not given enough engagement nor properly understood by people in parliament – stalling progress and creating headach… [+3571 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Royal Ibeh", "title": "Huawei Launches Transformative Fintech Offering To Revolutionise Mobile Money - Leadership News", "description": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial", "url": "https://leadership.ng/huawei-launches-transformative-fintech-offering-to-revolutionise-mobile-money/", "urlToImage": "https://leadership.ng/wp-content/uploads/2022/08/HUAWEI-2.jpg", "publishedAt": "2022-11-18T07:45:50Z", "content": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial inclusion and improve the consumers digital user … [+3073 chars]"}]}