{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Samuel Axon", "title": "Civilization VII review: A major overhaul solves Civ’s oldest problems - Ars Technica", "description": "Not all changes will be popular, but it’s a great launching point for a new age.", "url": "https://arstechnica.com/gaming/2025/02/civilization-vii-review-a-major-overhaul-solves-civs-oldest-problems/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/01/civ7-graphics-1-1152x648-1738360684.jpg", "publishedAt": "2025-02-03T14:00:51Z", "content": null}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Galaxy S25 Ultra Durability Test Reveals Samsung Has Compromised The Build Quality With Removable Camera Rings, A Scratch Prone Display, And A Misaligned Logo At The Back - Wccftech", "description": "Samsung has made several compromises in build quality with the Galaxy S25 Ultra, as a durability test reveals detachable camera rings, and more.", "url": "https://wccftech.com/galaxy-s25-ultra-durability-test-with-compromises/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/02/Galaxy-S25-Ultra-e1738563360199.jpg", "publishedAt": "2025-02-03T06:26:00Z", "content": "Samsung recently announced its highly anticipated Galaxy S25 series with some design changes on the outside but major performance gains on the inside. If you have been following the news, the device … [+2896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Uncovers Life’s Building Blocks in Asteroid Bennu’s Pristine Sample - SciTechDaily", "description": "NASA’s OSIRIS-REx mission delivered samples from asteroid Bennu, revealing crucial molecules linked to life, including amino acids and nucleobases found in DNA and RNA. The presence of ammonia and formaldehyde suggests conditions ripe for forming complex mole…", "url": "https://scitechdaily.com/?p=452718", "urlToImage": "https://scitechdaily.com/images/Jason-Dworkin-Asteroid-Bennu-Vial.jpg", "publishedAt": "2025-02-03T03:33:24Z", "content": "In this video frame, Jason Dworkin holds up a vial that contains part of the sample from asteroid Bennu delivered to Earth by NASA’s OSIRIS-REx (Origins, Spectral Interpretation, Resource Identificat… [+11273 chars]"}]}