{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Slack, Forest to MindMeister, streamline your workflow with these 5 must-have productivity apps - HT Tech", "description": "Check out these top 5 productivity apps including Slack, Forest, and MindMeister to elevate your work output. From seamless team communication to focused work sessions, discover tools to streamline your workflow effortlessly.", "url": "https://tech.hindustantimes.com/tech/news/slack-forest-to-mindmeister-streamline-your-workflow-with-these-5-must-have-productivity-apps-71706425167182.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/01/28/1600x900/Productivity_apps_1706425536306_1706425536546.jpg", "publishedAt": "2024-01-28T07:07:16Z", "content": "Top productivity apps for 2024: In the quest for enhanced productivity, the right tools can make all the difference. Personalising your approach to productivity is essential, as what works for one pe… [+3298 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "Apple Allows Sideloading Apps On iPhone In Some Countries, Excluding India - Zee News", "description": "The tech giant Apple is making updates to the iPhone and iPad software with the upcoming iOS 17.4, along with several changes to the App Store, including sideloading apps on the iPhone. Apple is implementing these changes to comply with the European Union’s D…", "url": "https://zeenews.india.com/technology/apple-allows-sideloading-apps-in-iphone-in-some-countries-excluding-india-2714858.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2024/01/28/1355431-apple-reuters.jpg", "publishedAt": "2024-01-28T06:57:53Z", "content": "New Delhi: The tech giant Apple is making updates to the iPhone and iPad software with the upcoming iOS 17.4, along with several changes to the App Store, including sideloading apps on the iPhone. Ap… [+1766 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Roohi Mariam Peter", "title": "Long COVID research: where do we stand? - Labiotech.eu", "description": "Studies and recent developments in long COVID research could pave the way for more diagnostic and therapeutic opportunities.", "url": "https://www.labiotech.eu/in-depth/long-covid-research-where-do-we-stand/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2024/01/long-COVID-research.jpg", "publishedAt": "2024-01-26T14:03:08Z", "content": "When the World Health Organization declared the coronavirus outbreak a global pandemic in early 2020, little did we know that it would dominate the rest of the year and the years to come. Now, almost… [+8151 chars]"}]}