{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Uncovers Life’s Building Blocks in Asteroid Bennu’s Pristine Sample - SciTechDaily", "description": "NASA’s OSIRIS-REx mission delivered samples from asteroid Bennu, revealing crucial molecules linked to life, including amino acids and nucleobases found in DNA and RNA. The presence of ammonia and formaldehyde suggests conditions ripe for forming complex mole…", "url": "https://scitechdaily.com/?p=452718", "urlToImage": "https://scitechdaily.com/images/Jason-Dworkin-Asteroid-Bennu-Vial.jpg", "publishedAt": "2025-02-03T03:33:24Z", "content": "In this video frame, Jason Dworkin holds up a vial that contains part of the sample from asteroid Bennu delivered to Earth by NASA’s OSIRIS-REx (Origins, Spectral Interpretation, Resource Identificat… [+11273 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Connie Loizos", "title": "DeepSeek founder Liang Wenfeng receives a hero’s welcome back home - TechCrunch", "description": "DeepSeek founder Lian Wenfeng is being hailed as a hero in the southern Chinese province of Guangdong, where he grew up and reportedly returned for the", "url": "https://techcrunch.com/2025/02/02/deepseek-founder-liang-wenfeng-receives-a-heros-welcome-back-home/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2196672039.jpg?w=1024", "publishedAt": "2025-02-03T03:19:59Z", "content": "DeepSeek founder Lian Wenfeng is being hailed as a hero in the southern Chinese province of Guangdong, where he grew up and reportedly returned for the Lunar New Year, joined by bodyguards.\r\nWenfengw… [+978 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Apple reportedly launching a new event invite feature code-named Confetti - TechCrunch", "description": "Apple will be giving iCloud users a new way to invite people to parties, meetings, and other events, according to Bloomberg’s Mark Gurman. The company has", "url": "https://techcrunch.com/2025/02/02/apple-reportedly-launching-a-new-event-invite-feature-code-named-confetti/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/12/GettyImages-510240901.jpg?resize=1200,800", "publishedAt": "2025-02-02T17:05:25Z", "content": "Apple will be giving iCloud users a new way to invite people to parties, meetings, and other events, according to Bloombergs Mark Gurman.\r\nThe company has code-named the service Confetti, and it coul… [+400 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Emma Burleigh", "title": "Nvidia CEO Jensen Huang says everyone should get an AI tutor right away - Fortune", "description": "The chip leader says the tech should now teach humans, but doesn’t believe it will replace them in the workforce.", "url": "https://fortune.com/2025/02/02/nvidia-ceo-jensen-huang-ai-tutors-future-of-work/", "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/01/GettyImages-2194622689_f62c95-e1738345394470.jpg?resize=1200,600", "publishedAt": "2025-02-02T16:30:00Z", "content": null}]}