{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: “Peak Venus” and Jupiter Occultation - SciTechDaily", "description": "What are some skywatching highlights in May 2023? Venus reaches its highest point in the evening sky for the year, while Jupiter disappears behind the Moon for some U.S. observers. Plus, some key differences in the Southern Hemisphere's skies compared to thos…", "url": "https://scitechdaily.com/?p=273594", "urlToImage": "https://scitechdaily.com/images/Jupiter-Occultation.jpg", "publishedAt": "2023-05-02T21:06:52Z", "content": "ByNASA's Jet Propulsion LaboratoryMay 2, 2023\r\nAn occultation is a celestial event that occurs when one object is hidden by another object that passes between it and the observer. In this Jupiter occ… [+8778 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "AI pioneer Geoffrey Hinton leaves Google, citing \"profound risks to humanity\" • FRANCE 24 English - FRANCE 24 English", "description": "Chris O’Brien, Editor of the French Tech Journal, spoke to FRANCE 24’s François Picard following the resignation of the ‘godfather’ of artificial intelligenc...", "url": "https://www.youtube.com/watch?v=PcPB6oEN7ms", "urlToImage": "https://i.ytimg.com/vi/PcPB6oEN7ms/maxresdefault.jpg", "publishedAt": "2023-05-02T18:31:26Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Waugh Tech Correspondent", "title": "I'm a cybersecurity expert - here are the apps I would NEVER use - Daily Mail", "description": "A cybersecurity expert has revealed several popular apps he would never use due to how data is collected and stored and such services let big tech companies decide what we see online.", "url": "https://www.dailymail.co.uk/sciencetech/article-12024707/Im-hacking-expert-mainstream-apps-NEVER-use-privacy-risks.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/02/15/70483523-0-image-a-14_1683037359414.jpg", "publishedAt": "2023-05-02T13:43:16Z", "content": "Tom Gaffney is a cybersecurity specialist with F-Secure \r\nMany of the world's most popular apps have dubious terms of service, and exploit private data to make money, according to a cybersecurity exp… [+4308 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AHA Rates 10 Popular Diets: What's Best for Heart-Healthy Eating – And What Misses the Mark - SciTechDaily", "description": "A new American Heart Association scientific statement rates how closely several popular eating patterns align with the Association’s guidance for heart-healthy eating. A new American Heart Association scientific statement assesses and scores the heart healthi…", "url": "https://scitechdaily.com/?p=273545", "urlToImage": "https://scitechdaily.com/images/Heart-Healthy-Food.jpg", "publishedAt": "2023-05-02T12:36:39Z", "content": "ByAmerican Heart AssociationMay 2, 2023\r\nThe American Heart Associations new scientific statement assesses popular diets and their alignment with heart-healthy guidelines. Top ratings were given to t… [+17341 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 asteroids rushing towards Earth! One to come as close as the Moon - HT Tech", "description": "As many as 5 asteroids could make their close approaches to Earth in the next few days, and the closest will pass at nearly the same distance as the Moon! Know their speed, distance and other details, as per NASA.", "url": "https://tech.hindustantimes.com/photos/5-asteroids-rushing-towards-earth-one-to-come-as-close-as-the-moon-71683023112945.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid-6075441_640_1683023282496_1683023310361.jpg", "publishedAt": "2023-05-02T10:30:39Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}]}