{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NanoVision Unleashed: PicoRulers Revolutionizing Cellular Imaging - SciTechDaily", "description": "Good news for researchers working with high-resolution fluorescence microscopy: Biocompatible molecular rulers are available for the first time to calibrate the latest super-resolution microscopy methods. Recent advancements in super-resolution microscopy now…", "url": "https://scitechdaily.com/nanovision-unleashed-picorulers-revolutionizing-cellular-imaging/", "urlToImage": "https://scitechdaily.com/images/PicoRuler-Molecular-Nano-Ruler.jpg", "publishedAt": "2023-12-03T19:47:13Z", "content": "PicoRuler: Protein-based molecular rulers make it possible to test the optical resolution of the latest super-resolution microscopy methods on biomolecules in the sub-10-nanometer range under realist… [+3393 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "A look at the new discoveries that make Neanderthals more knowable now than ever - PBS NewsHour", "description": "Neanderthals have held our fascination ever since we first identified their remains. Today, thanks to new artifacts and technologies, findings about our closest relatives are coming thick and fast.", "url": "https://www.pbs.org/newshour/science/a-look-at-the-new-discoveries-that-make-neanderthals-more-knowable-now-than-ever", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/12/GettyImages-1235088525-e1701630599313-1024x686.jpg", "publishedAt": "2023-12-03T19:33:35Z", "content": "Neanderthals are Homo sapienss closest-known relative, and today we know we rubbed shoulders with them for thousands of years, up until the very end of their long reign some 40,000 years ago. Most re… [+15240 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Lifestyle Desk", "title": "How to Handle a Partner Who's Always on Their Phone - Times Now", "description": "Explore strategies to address a partner's excessive phone use. Emphasize communication, understanding their perspective, setting phone-free times, leading by example, and enjoying screen-free activities together. Aim for a balanced, tech-wise relationship.", "url": "https://www.timesnownews.com/lifestyle/relationships/love-sex/how-to-handle-a-partner-whos-always-on-their-phone-article-105700371", "urlToImage": "https://static.tnn.in/thumb/msid-105700434,thumbsize-1504033,width-1280,height-720,resizemode-75/105700434.jpg", "publishedAt": "2023-12-03T17:30:00Z", "content": "03:02\r\nTelangana Election Result: Meet KVR Reddy, BJPs Hidden Giant Slayer Who Defeated Both KCR, Revanath"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Captures Mysterious Reappearance of a Ghostly Object – “This Thing Is a Real Monster!” - SciTechDaily", "description": "The James Webb Space Telescope's discovery of AzTECC71, a dusty star-forming galaxy from the early universe, challenges previous assumptions about galaxy prevalence and composition, offering new insights into cosmic history and galaxy evolution. It first appe…", "url": "https://scitechdaily.com/webb-captures-mysterious-reappearance-of-a-ghostly-object-this-thing-is-a-real-monster/", "urlToImage": "https://scitechdaily.com/images/Astronomy-Mystery-Object-Concept.jpg", "publishedAt": "2023-12-03T16:09:04Z", "content": "The James Webb Space Telescope has uncovered AzTECC71, a faint galaxy that was previously elusive to the Hubble Space Telescope. This discovery by the COSMOS-Web collaboration reveals a dusty, star-f… [+6122 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Monday: 15 things to know before opening bell - Moneycontrol", "description": "A long build-up was seen in 84 stocks, which included Delta Corp, Can Fin Homes, Hindustan Copper, Dr Lal PathLabs, and Dixon Technologies.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-15-things-to-know-before-opening-bell-7-11844881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/Stock-market-770x433.png", "publishedAt": "2023-12-03T13:36:43Z", "content": "After surpassing the previous record high on the first day of December series and continuation of bullish sentiment for five weeks in a row, experts expect the momentum to continue and take the Nifty… [+8169 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Samsung Galaxy S24 Ultra leak hints at its super-thin display bezels - TechRadar", "description": "But a thicker frame", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/samsung-galaxy-s24-ultra-leak-hints-at-its-super-thin-display-bezels", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yUocRHspkGBvZ2inCZ36sN-1200-80.jpg", "publishedAt": "2023-12-03T13:30:01Z", "content": "We've got another Galaxy S24 leak to pass on to you, this time regarding the Samsung Galaxy S24 Ultra – and specifically how thin the bezels around the edge of the flagship phone's display are going … [+1927 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Week in tech: Nasa to train Indian astronaut for a trip to the ISS - Mint Lounge", "description": "Nasa administrator Bill Nelson’s recent visit to India marked another milestone for the deepening space ties between the two countries", "url": "https://lifestyle.livemint.com/smart-living/innovation/week-in-tech-nasa-isro-iss-bill-nelson-nisar-111701599273087.html", "urlToImage": "https://images.livemint.com/img/2023/12/03/1140x641/PTI11-29-2023-000282A-0_1701599499520_1701599525959.jpg", "publishedAt": "2023-12-03T12:50:49Z", "content": "Heres a weekly recap of at what made news in the world of science and technology.\r\nNasa to train Indian astronaut for ISS voyage\r\nNasa administrator Bill Nelsons recent visit to India marked another … [+2555 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "IPO Weekly Wrap: Tata Tech, IREDA, Gandhar, Flair, SME stocks make bumper debuts; Fedbank disappoints - Moneycontrol", "description": "Tata Technologies, Gandhar Oil Refinery, Indian Renewable Energy (IREDA) and Flair Writing Industries made bumper debuts while Fedbank Financial Services disappointed investors", "url": "https://www.moneycontrol.com/news/business/ipo/ipo-weekly-wrap-tata-tech-ireda-gandhar-flair-sme-issues-make-bumper-debuts-fedbank-disappoints-11847511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/market_volatile-10-770x433.jpg", "publishedAt": "2023-12-03T10:42:06Z", "content": "The listings of five mainboard and two small and medium enterprises (SME) IPOs kept investors busy this week. Tata Technologies is listed at a 140 percent premium over the issue price. Gandhar Oil Re… [+6839 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem codes for December 2: Chance to win rare costumes and weapons - HT Tech", "description": "Garena Free Fire Redeem codes for December 2: Grab in-game items ranging from diamond vouchers to costumes and weapons. Know how to claim them.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-december-2-chance-to-win-rare-costumes-and-weapons-71701498627955.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/02/1600x900/pop07_1638420714978_1701498699134.jpg", "publishedAt": "2023-12-02T06:40:42Z", "content": "Garena Free Fire Redeem codes for December 2: Free Fire can be the perfect game to play when a group of friends meet up and do not have an idea what to do or where to go. The squad mode in the game i… [+2391 chars]"}]}