{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "Google warns users to take action to protect against remotely exploitable flaws in popular Android phones - TechCrunch", "description": "The four vulnerabilities found in Samsung chips can be exploited to compromise Android devices \"silently and remotely\" over the cell network.", "url": "https://techcrunch.com/2023/03/16/google-warning-samsung-chips-flaws-android/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/03/GettyImages-1126324973-samsung.jpg?resize=1200,800", "publishedAt": "2023-03-16T21:27:51Z", "content": "Googles security research unit is sounding the alarm on a set of vulnerabilities it found in certain Samsung chips included in dozens of Android models, wearables and vehicles, fearing the flaws coul… [+2418 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "'Next-Generation Science': NASA Is Exploring Quantum Tech For Climate Data, Advance 3D Printing For Use In Space - ABP Live", "description": "NASA is launching two Space Technology Research Institutes to develop critical technology in engineering and climate research. Each institute will receive up to $15 mn in funding over five years.", "url": "https://news.abplive.com/science/next-generation-science-nasa-working-on-quantum-tech-for-climate-data-3d-printed-parts-for-space-1588963", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/03/17/7418134d80233b4b4e4e2c160533cd301678995250599236_original.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2023-03-16T19:54:47Z", "content": "NASA is pushing forward with its long-term exploration goals with the help of two newly created Space Technology Research Institutes (STRIs), the agency said Thursday as it announced the plan to leve… [+3763 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Pixel Fold Launch Date, Price leaked! Pixel 7a tipped for launch too - HT Tech", "description": "A recent listing might have just revealed the release date, prices and other details about the Google Pixel Fold along with the Pixel 7a.", "url": "https://tech.hindustantimes.com/mobile/news/google-pixel-fold-launch-date-price-leaked-pixel-7a-tipped-for-launch-too-71678966554774.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/16/1600x900/2_1668596861401_1678966665856_1678966665856.jpg", "publishedAt": "2023-03-16T11:43:27Z", "content": "Foldable smartphones have taken over the world and these devices offer something unique compared to the generic smartphones with identical looks and at par specs. Samsung has two offerings in the fol… [+2467 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Extraordinary “Rapunzel” Virus: An Evolutionary Marvel - SciTechDaily", "description": "Extremely long tail provides a window into how bacteria-infecting viruses assemble. A recent study in the Journal of Biological Chemistry has revealed the secret behind an evolutionary marvel: a bacteriophage with an extremely long tail. This extraordinary ta…", "url": "https://scitechdaily.com/?p=260912", "urlToImage": "https://scitechdaily.com/images/Bacteriophage-P74-26-Structure-Illustration.jpg", "publishedAt": "2023-03-16T09:35:08Z", "content": "ByAmerican Society for Biochemistry and Molecular BiologyMarch 16, 2023\r\nBacteriophage P74-26 structure illustration. Phage tails come in varying lengths and styles. The P74-26 bacteriophage has a ta… [+4855 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Bing said to remove waitlist for its GPT-4 powered chat - TechCrunch", "description": "Microsoft has seemingly lifted the waitlist restrictions on Bing search engine's new GPT-4 powered chatbot experience.", "url": "https://techcrunch.com/2023/03/16/bing-said-to-remove-waitlist-for-its-gpt-4-powered-chat/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/02/chatgpt-bing.jpg?resize=1200,727", "publishedAt": "2023-03-16T07:00:59Z", "content": "Microsoft’s Bing is enjoying the spotlight for the first time in a decade after it released a GPT-powered interface last month. But the tech giant has so far been cautious about the pace at which it … [+1897 chars]"}]}