{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "espn", "name": "ESPN"}, "author": null, "title": "UConn's Dan Hurley, irritated by a fan, gets technical foul - ESPN", "description": "UConn coach Dan Hurley said he received a technical foul after pointing out an unruly fan to officials during the Huskies' 95-90 win over St. John's in Friday's Big East tournament semifinals.", "url": "https://www.espn.com/mens-college-basketball/story/_/id/39742728/uconn-dan-hurley-irritated-fan-gets-technical-foul", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0316%2Fr1305673_1296x729_16%2D9.jpg", "publishedAt": "2024-03-16T04:34:00Z", "content": "Mar 15, 2024, 11:34 PM ET\r\nNEW YORK -- UConn coach Dan Hurley got heated about a fan again Friday night.\r\nMoments after St. John's counterpart Rick Pitino received a technical foul for shouting at of… [+3561 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jupiter Unveiled: Hubble Captures the Giant's Roaring Storms and Volcanic Moon Io - SciTechDaily", "description": "Cyclones, Wind Shear, Violent Storms Churn in Jupiter's Atmosphere The largest and nearest of the giant outer planets, Jupiter's colorful clouds present an ever-changing kaleidoscope of shapes and colors. This is a planet where there is always stormy weather:…", "url": "https://scitechdaily.com/jupiter-unveiled-hubble-captures-the-giants-roaring-storms-and-volcanic-moon-io/", "urlToImage": "https://scitechdaily.com/images/Hubble-2024-Jupiter-scaled.jpg", "publishedAt": "2024-03-16T02:58:06Z", "content": "NASA’s Hubble Space Telescope captured new images of Jupiter on January 5-6, 2024, revealing dynamic weather patterns and notable storms like the Great Red Spot and Red Spot Jr. The observations are … [+6761 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "Some McDonald's outlets back online after tech outage in several countries - Reuters", "description": null, "url": "https://www.reuters.com/business/retail-consumer/mcdonalds-battles-technical-woes-australia-hong-kong-japan-nyt-says-2024-03-15/", "urlToImage": null, "publishedAt": "2024-03-15T20:24:31Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo group asteroid set to pass Earth by just 622,000 km, reveals NASA! Know how big it is - HT Tech", "description": "An Apollo asteroid is predicted to pass Earth at its closest distance in orbit today, March 14. From size, speed to distance of approach, know all about the asteroid.", "url": "https://tech.hindustantimes.com/tech/news/apollo-group-asteroid-set-to-pass-earth-by-just-622-000-km-reveals-nasa-know-how-big-it-is-71710476880052.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/15/1600x900/Asteroid_2023_QH_1693479044729_1710477090848.jpg", "publishedAt": "2024-03-15T04:37:57Z", "content": "In the last few weeks, numerous asteroids have passed Earth at close distances. The orbits of these space rocks bring them close enough to the planet to be monitored by space agencies such as NASA an… [+2135 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Apple acquires AI startup specializing in overlooking manufacturing components - TechCrunch", "description": "Apple has acquired DarwinAI, which specializes in vision-based tech to observe components during manufacturing to improve efficiency,", "url": "https://techcrunch.com/2024/03/14/apple-acquires-ai-startup-specializing-in-overlooking-manufacturing-components/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/GettyImages-1235254642.jpg?resize=1200,800", "publishedAt": "2024-03-15T04:06:00Z", "content": "Apple has added another AI startup to its acquisition list with Canada-based DarwinAI, which specializes in vision-based tech to observe components during manufacturing to improve efficiency, Bloombe… [+1615 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Earth Received a Message Laser-Beamed From 10 Million Miles Away in NASA Test - ScienceAlert", "description": "Eventually, we're going to want to expand the World Wide Web across the galaxy, and NASA recently demonstrated a key piece of tech that could help, beaming messages via laser across a distance of almost 16 million kilometers (10 million miles).", "url": "https://www.sciencealert.com/earth-received-a-message-laser-beamed-from-10-million-miles-away-in-nasa-test", "urlToImage": "https://www.sciencealert.com/images/2023/11/GettyImages-1247965075-1.jpg", "publishedAt": "2024-03-14T22:29:24Z", "content": "Eventually, we're going to want to expand the World Wide Web across the galaxy, and NASA recently demonstrated a key piece of tech that could help, beaming messages via laser across a distance of alm… [+3178 chars]"}]}