{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Morgan Little", "title": "Apple’s October Scary Fast Event: Everything revealed about the new MacBook Pro, iMac and M3 chips - TechCrunch", "description": "Apple's October event was low on spooks and scares, but still packed in three M3 chips, two MacBook Pro models and a revamped iMac.", "url": "https://techcrunch.com/2023/10/31/apples-october-scary-fast-event-everything-announced-so-far/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/10/Screenshot-2023-10-30-at-5.26.00-PM.png?resize=1200,626", "publishedAt": "2023-10-31T17:36:13Z", "content": "Apples October event had some exciting product announcements   but dont worry, there was nothing too spooky. Last week, the company announced a surprise Scary Fast event, prompting speculation that A… [+4399 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple shows off MacBooks with M3 chip at Scary Fast event - Yahoo Finance", "description": "Apple (AAPL) announced its latest tech products including the latest generation of Macs and MacBook Pros fitted with its new line of M3 chips, during its Sca...", "url": "https://www.youtube.com/watch?v=-u8JYEa2RVs", "urlToImage": "https://i.ytimg.com/vi/-u8JYEa2RVs/maxresdefault.jpg", "publishedAt": "2023-10-31T15:08:07Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Joe Biden’s executive order to regulate AI likely to make immigration faster | Mint - Mint", "description": "Joe Biden’s executive order not only establishes new guidelines to protect the national security and privacy of its citizens but also seeks to balance the needs of cutting-edge technology companies by attracting talent from across the globe", "url": "https://www.livemint.com/news/world/joe-biden-s-executive-order-to-regulate-ai-likely-to-make-immigration-faster-11698762720443.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/31/1600x900/Joe_Biden_1698763193654_1698763193789.JPG", "publishedAt": "2023-10-31T14:50:41Z", "content": "To promote innovation and attract (AI) talent to the United States, an Executive Order issued by US President Joe Biden seeks to use existing authorities to expand the ability of highly skilled immig… [+3397 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cardiovascular Deaths Due to Extreme Heat Expected To Skyrocket - SciTechDaily", "description": "In nationwide projections, elderly and black adults are most at risk for cardiovascular death due to extreme heat, finds a new study in the journal, Circulation. Cardiovascular deaths from extreme heat in the United States are projected to increase by 162% by…", "url": "https://scitechdaily.com/?p=323312", "urlToImage": "https://scitechdaily.com/images/Extreme-Heat-Cardiology-Heart-Concept-Art.jpg", "publishedAt": "2023-10-31T08:31:36Z", "content": "ByAmerican Heart AssociationOctober 31, 2023\r\nCardiovascular deaths in the U.S. from extreme heat are projected to double or triple by mid-century if greenhouse gas emissions are not reduced.\r\nIn nat… [+10769 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What’s the ISRO budget for the project? - HT Tech", "description": "Shukrayaan1 mission Whats theISRObudget for the project The Shukrayaan1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour. The Shukrayaan1 mission is expected to cost between Rs. 500 cr…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan1-mission-what-s-the-isro-budget-for-the-project-71698724427302.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/31/1600x900/Venus_1696761565001_1698724499602.jpg/", "publishedAt": "2023-10-30T22:33:48Z", "content": "Photo Credit: Pixabay\r\n The Shukrayaan-1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour.\r\nPhoto Credit: Pixabay\r\n The Shuk… [+1527 chars]"}]}