{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supermassive Black Hole's Spin Verified – Einstein's General Theory of Relativity Shines - SciTechDaily", "description": "The M87 galaxy's black hole exhibits an oscillating jet, confirming its spin, as deduced from a two-decade study aligning with Einstein's General Theory of Relativity predictions. The nearby radio galaxy M87, located 55 million light-years from the Earth and …", "url": "https://scitechdaily.com/supermassive-black-holes-spin-verified-einsteins-general-theory-of-relativity-shines/", "urlToImage": "https://scitechdaily.com/images/Tilted-Black-Hole-Accretion-Disk-Model-Schematic-Representation-scaled.jpg", "publishedAt": "2023-09-30T21:07:55Z", "content": "ByChinese Academy of SciencesSeptember 30, 2023\r\nSchematic representation of the tilted accretion disk model. The black hole spin axis is assumed to be straight up and down in this illustration. The … [+8882 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "Sébastian SEIBT", "title": "'Counterfeit people': The dangers posed by Meta's AI celebrity lookalike chatbots - FRANCE 24 English", "description": "Meta announced on Wednesday the arrival of chatbots with personalities similar to certain celebrities, with whom it will be possible to chat. Presented as an entertaining evolution of ChatGPT and other forms of AI, this latest technological development could …", "url": "https://www.france24.com/en/technology/20230930-counterfeit-people-the-dangers-posed-by-meta-s-ai-celebrity-lookalike-chatbots", "urlToImage": "https://s.france24.com/media/display/fa812c06-5ed5-11ee-aa02-005056bfb2b6/w:1280/p:16x9/human-ia-3.jpg", "publishedAt": "2023-09-30T15:27:41Z", "content": "Meta announced on Wednesday the arrival of chatbots with personalities similar to certain celebrities, with whom it will be possible to chat. Presented as an entertaining evolution of ChatGPT and oth… [+6896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Develop Incredibly Lightweight Material 4 Times Stronger Than Steel - SciTechDaily", "description": "Researchers developed a light yet strong material by combining two unexpected ingredients—DNA and glass. Working at the nanoscale provides scientists with a deep understanding and precision in crafting and analyzing materials. In broader-scale production, and…", "url": "https://scitechdaily.com/scientists-develop-incredibly-lightweight-material-4-times-stronger-than-steel/", "urlToImage": "https://scitechdaily.com/images/DNA-Inside-Glass.jpg", "publishedAt": "2023-09-30T14:51:06Z", "content": "ByBrookhaven National LaboratorySeptember 30, 2023\r\nResearchers have created a novel material by coating DNA with a pure form of glass, resulting in a substance that is lighter and stronger than stee… [+12096 chars]"}]}