{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple closing in on pact with OpenAI to use its AI | World Business Watch | WION - WION", "description": "Reports suggest that Apple has closed in on an agreement with OpenAI to use the start-up’s technology on the iPhone. That's part of Apple's broader push to b...", "url": "https://www.youtube.com/watch?v=AcxxvE8Ztf0", "urlToImage": "https://i.ytimg.com/vi/AcxxvE8Ztf0/maxresdefault.jpg", "publishedAt": "2024-05-12T06:02:12Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Super-Earth Surprise: Webb Finds Atmosphere on Rocky Exoplanet For the First Time - SciTechDaily", "description": "Gas bubbling up from a lava-covered surface on 55 Cancri e may feed an atmosphere rich in carbon dioxide or carbon monoxide. These days, detecting a planetary atmosphere tens or even hundreds of light-years from Earth might not sound like such a big deal. Sci…", "url": "https://scitechdaily.com/super-earth-surprise-webb-finds-atmosphere-on-rocky-exoplanet-for-the-first-time/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Concept.jpg", "publishedAt": "2024-05-12T03:20:52Z", "content": "Using NASA’s James Webb Space Telescope, scientists may have identified atmospheric gases on 55 Cancri e, a super-hot, rocky exoplanet. This discovery could represent the most definitive evidence of … [+11595 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Aidin Vaziri", "title": "Apple apologizes after 'really disturbing' iPad ad sparks backlash - San Francisco Chronicle", "description": "The Cupertino tech giant pulled the ad, which featured the wanton destruction of creative tools.", "url": "https://www.sfchronicle.com/tech/article/apple-ipad-ad-19452690.php", "urlToImage": "https://s.hdnux.com/photos/01/37/40/03/25034971/7/rawImage.jpg", "publishedAt": "2024-05-11T22:31:16Z", "content": "A hydraulic press crushes an array of creative instruments in an Apple ad that has been pulled from television.\r\nApple/Associated Press\r\nApple has apologized after facing backlash over a new iPad Pro… [+2947 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Jijo Malayil", "title": "MIT's new AI tech could make limbless, slimy, squishy robots a reality - Interesting Engineering", "description": "A novel algorithm enables robots to flexibly squish, bend, or stretch for tasks such as obstacle avoidance or item retrieval.", "url": "https://interestingengineering.com/innovation/mit-ai-slimy-squishy-robots", "urlToImage": "https://cms.interestingengineering.com/wp-content/uploads/2024/05/IE-photo-ratio-19201080-3.jpg", "publishedAt": "2024-05-10T12:01:00Z", "content": "Each task is designed to represent certain properties that we deem important, such as the ability to navigate through long-horizon explorations, analyze the environment, and interact with external ob… [+1862 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "The New Samsung AI TV: Bringing the Future Home - samsung.com", "description": "What if technology could make an everyday moment richer, more connected and more lifelike? Samsung’s latest AI TV strives to enhance the viewing experience and", "url": "https://news.samsung.com/in/the-new-samsung-ai-tv-bringing-the-future-home", "urlToImage": "https://img.global.news.samsung.com/in/wp-content/uploads/2024/05/qled.jpg", "publishedAt": "2024-05-10T06:53:55Z", "content": "What if technology could make an everyday moment richer, more connected and more lifelike? Samsungs latest AI TV strives to enhance the viewing experience and integrate advanced technology into peopl… [+3175 chars]"}]}