{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Williams", "title": "A new quantum technique could enable telescopes the size of planet Earth - Phys.org", "description": "There's a revolution underway in astronomy. In fact, you might say there are several. In the past 10 years, exoplanet studies have advanced considerably, gravitational wave astronomy has emerged as a new field, and the first images of supermassive black holes…", "url": "https://phys.org/news/2022-05-quantum-technique-enable-telescopes-size.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/a-new-quantum-techniqu.jpg", "publishedAt": "2022-05-30T14:13:16Z", "content": "There's a revolution underway in astronomy. In fact, you might say there are several. In the past 10 years, exoplanet studies have advanced considerably, gravitational wave astronomy has emerged as a… [+7743 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iQOO Neo 6 price in India revealed? Find out now - HT Tech", "description": "Here’s all you need to know about iQOO Neo 6 price on launch in India tomorrow.", "url": "https://tech.hindustantimes.com/tech/news/iqoo-neo-6-price-in-india-on-launch-tomorrow-check-now-71653917690877.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/05/30/1600x900/Web_capture_27-5-2022_115943_www.iqoo.com_1653633086307_1653917845649.jpeg", "publishedAt": "2022-05-30T13:38:23Z", "content": "iQOO is all set for iQOO Neo 6 India launch tomorrow on May 31. The smartphone has already made its debut in China and the company has confirmed its arrival in India through a tweet. They wrote, Knoc… [+1655 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Michael Nedelman, CNN", "title": "Plans underway to ramp up monkeypox testing if outbreak grows quickly - CNN", "description": "As more cases are uncovered in a global monkeypox outbreak, biotech companies and health officials are looking to make PCR testing for the virus more widely available in the US.", "url": "https://www.cnn.com/2022/05/30/health/monkeypox-testing-plans-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527140224-monkeypox-tests-super-tease.jpg", "publishedAt": "2022-05-30T12:46:00Z", "content": null}, {"source": {"id": null, "name": "iTech Post"}, "author": "Princess Scott", "title": "SpaceX Hopeful That Starship Megarocket Gets Good Review From FAA - iTech Post", "description": "After several months of delays, SpaceX is hopeful to get a green light from the FAA. After several delays regarding the environmental review of SpaceX's Starship rocket program in Texas, the company is optimistic they are going to receive a piece of good news…", "url": "https://www.itechpost.com/articles/110999/20220530/spacex-hopeful-starship-megarocket-gets-good-review-faa.htm", "urlToImage": "https://1401700980.rsc.cdn77.org/data/images/full/105977/spacex-hopeful-that-starship-megarocket-gets-good-review-from-faa.png", "publishedAt": "2022-05-30T11:30:00Z", "content": "After several delays regarding the environmental review of SpaceX's Starship rocket program in Texas, the company is optimistic they are going to receive a piece of good news from the Federal Aviatio… [+3290 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Ngozi Chukwu", "title": "6 ways your Samsung phone can make you more productive - TechCabal", "description": "Is your phone distracting you during work? Learn to use your Samsung phone to increase your productivity and focus while working from home.", "url": "https://techcabal.com/2022/05/30/6-ways-your-samsung-phone-can-make-you-more-productive/", "urlToImage": "https://s15543.pcdn.co/wp-content/uploads/2018/04/dsc_1787_39780899305_o-875x404.jpg", "publishedAt": "2022-05-30T09:27:34Z", "content": "Image source: Samsung\r\nRecent studies show that remote work is more productive than working in an office setting. Still, its easy to get distracted and procrastinate while working from home.  Sometim… [+4794 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Emmanuel Akinwotu", "title": "The technical tunes getting elderly Nigerians up and digitally dancing - The Guardian", "description": "People living in a Lagos care home are enjoying a break in routine with a virtual mix of therapy and entertainment delivered via headset", "url": "https://amp.theguardian.com/global-development/2022/may/30/the-technical-tunes-getting-elderly-nigerians-up-and-digitally-dancing", "urlToImage": null, "publishedAt": "2022-05-30T06:32:00Z", "content": "A common conditionPeople living in a Lagos care home are enjoying a break in routine with a virtual mix of therapy and entertainment delivered via headset\r\nMon 30 May 2022 02.30 EDT\r\nIn the living ro… [+4740 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Asus ROG Cetra True Wireless Earbuds: Great for gaming but audio department needs improvement - AsiaOne", "description": "Asus can always be depended on to deliver high-quality products and PC-building parts, and its audio offerings are no slouch either. Having released multiple lines of both wired and wireless headphones, the Taiwanese tech giant has more than enough expertise …", "url": "https://www.asiaone.com/digital/asus-rog-cetra-true-wireless-earbuds-great-gaming-audio-department-needs-improvement", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/300522_AsusEarbuds_ASUSTEK%20COMPUTER%20INC.jpg?h=0429cc9e&itok=OREfguoB", "publishedAt": "2022-05-30T05:17:00Z", "content": "Asus can always be depended on to deliver high-quality products and PC-building parts, and  its audio offerings are no slouch either.\r\nHaving released multiple lines of both wired and wireless headph… [+7965 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Spectacular New Tau Herculids Meteor Shower May Light Up the Skies Over North America - SciTechDaily", "description": "Astronomers are excited about the possibility of a new meteor shower on May 30-31, the tau Herculid shower, forecast to peak on the night of May 30 and early morning of May 31. Back in 1930, German observers Arnold Schwassmann and Arno Arthur Wachmann discove…", "url": "https://scitechdaily.com/spectacular-new-tau-herculids-meteor-shower-may-light-up-the-skies-over-north-america/", "urlToImage": "https://scitechdaily.com/images/Broken-Comet-73P-Schwassman-Wachmann-3.jpg", "publishedAt": "2022-05-30T04:36:11Z", "content": "This infrared image from NASAs Spitzer Space Telescope shows the broken Comet 73P/Schwassman-Wachmann 3 skimming along a trail of debris left during its multiple trips around the sun. The flame-like … [+2568 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Musk's Starlink to disrupt ISP market as hope rises for 25m unserved Nigerians - Guardian Nigeria", "description": "Following the operational licences handed to Space Exploration Technologies Corp (SpaceX), owned by world’s richest man, Elon Musk, to operate in Nigeria, there appears to be hope of connectivity for the about 114 access gaps (communities without telecoms ser…", "url": "https://guardian.ng/technology/musks-starlink-to-disrupt-isp-market-as-hope-rises-for-25m-unserved-nigerians/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/05/Musks-Starlink.jpg", "publishedAt": "2022-05-30T04:25:00Z", "content": "SpaceX gets six licences from NCC, may spend $30b on coverageTo battle MTN, Airtel, Globacom, 9mobile, others for market shareRural-Urban telecoms service to witness new growth\r\nFollowing the operati… [+9097 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "New initiatives to train, certify technicians in EV maintenance and servicing - CNA", "description": "SINGAPORE: The Land Transport Authority (LTA) will be working with organisations to train and certify automotive technicians in the safety-related areas of electric vehicle (EV) maintenance and servicing.\r\n\r\nLTA said on Monday (May 30) that the move is part o…", "url": "https://www.channelnewsasia.com/singapore/lta-train-certify-technicians-electric-vehicle-ev-maintenance-servicing-2715461", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--oIQ6yUp2--/c_crop,h_705,w_1254,x_0,y_63/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/03/07/istock_-_taikrixel_story_2.jpg?itok=ZBTdezS8", "publishedAt": "2022-05-30T03:48:00Z", "content": "The transport authority will work with SkillsFuture Singapore (SSG) and training providers, such as the Institute of Technical Education (ITE) College West, Singapore Polytechnic and Ngee Ann Polytec… [+1299 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Damian Troise and Alex Veiga", "title": "ASX set to jump as Wall Street bounces to wrap up best week in 18 months - Sydney Morning Herald", "description": "Technology companies led a broad rally as Wall Street notched its best week since late 2020. The gain broke a seven-week losing streak for the market, the longest such stretch since 2001.", "url": "https://www.smh.com.au/business/markets/asx-set-to-jump-higher-as-wall-street-wraps-up-best-week-in-18-months-20220530-p5apgc.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1839%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/19c22f110aac036c5298516b9ef5318511d0f659", "publishedAt": "2022-05-29T19:24:58Z", "content": "Technology companies led a broad rally for stocks on Friday as Wall Street notched its best week in 18 months. The gain broke a seven-week losing streak for the market, the longest such stretch since… [+1723 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "Rahul Naskar", "title": "iPhone 14 Pro may finally get a feature Android users have had for years - Neowin", "description": "iPhone 14 Pro and iPhone 14 Pro Max will reportedly get a feature Android users have had for years. The Cupertino tech giant may introduce it in the iOS 16 update. Murk Gurman has more details.", "url": "https://www.neowin.net/news/iphone-14-pro-may-finally-get-a-feature-android-users-have-had-for-years/", "urlToImage": "https://cdn.neow.in/news/images/uploaded/2021/09/1631649716_apple_event_(85)_story.jpg", "publishedAt": "2022-05-29T17:01:00Z", "content": "Apple is only a few days away from its annual developer conference, WWDC 2022, where the company is expected to make several announcements, including revealing the next version of iOS, iOS 16, which … [+2096 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "David Sanderson", "title": "Why Musk's Mars adventures could herald a race of cyborgs - The Times", "description": "The descendants of today’s “crazy adventurers” trying to reach Mars will be capable of using genetic engineering and cyborg techniques to turn into a new species and explore the universe for millennia, the astronomer royal has said.Lord Rees of Ludlow said pi…", "url": "https://www.thetimes.co.uk/article/why-musks-mars-adventures-could-herald-a-race-of-cyborgs-pjwlbvzl8", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Ffba8e79c-df9a-11ec-baab-53d14c642149.jpg?crop=1600%2C900%2C0%2C0&resize=1200", "publishedAt": "2022-05-29T17:00:00Z", "content": "The descendants of todays crazy adventurers trying to reach Mars will be capable of using genetic engineering and cyborg techniques to turn into a new species and explore the universe for millennia, … [+519 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "A financial expert and trading strategist answers 10 commonly asked questions about online trading - BusinessTech", "description": "Chief trading strategist at CMTrading, Fred Razak, has been trading on the financial markets for well over 20 years. Here he answers 10 pressing questions about online trading commonly asked by internet users.", "url": "https://businesstech.co.za/news/business/590482/a-financial-expert-and-trading-strategist-answers-10-commonly-asked-questions-about-online-trading/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2017/02/Trading-e1487339497419.jpeg", "publishedAt": "2022-05-29T11:00:51Z", "content": "Chief trading strategist at CMTrading, Fred Razak, has been trading on the financial markets for well over 20 years. Here he answers 10 pressing questions about online trading commonly asked by inter… [+7703 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Starliner’s Historic Test Mission, Solar Sail, Mars Helicopter’s Record Flight - SciTechDaily", "description": "A commercial crew spacecraft’s historic test mission … Recognizing the leadership of our James Webb Space Telescope team ... And a small spacecraft prepares for a unique mission around the Moon … a few of the stories to tell you about – This Week at NASA! htt…", "url": "https://scitechdaily.com/this-week-nasa-starliners-historic-test-mission-solar-sail-mars-helicopters-record-flight/", "urlToImage": "https://scitechdaily.com/images/NASA-Starliner-Solar-Sail-CAPSTONE.gif", "publishedAt": "2022-05-29T10:24:34Z", "content": "ByNASAMay 29, 2022\r\nThe James Webb Space Telescope (JWST or Webb) is an orbiting infrared observatory that will complement and extend the discoveries of the Hubble Space Telescope. It covers longer w… [+5368 chars]"}]}