{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA and SpaceX Delay Crew-4 Launch to International Space Station - SciTechDaily", "description": "The Flight Readiness Review for NASA’s SpaceX Crew-4 mission to the International Space Station has concluded, and teams are proceeding toward a 5:26 a.m. EDT liftoff on Saturday, April 23, from Kennedy Space Center’s Launch Complex 39A in Florida. The date a…", "url": "https://scitechdaily.com/nasa-and-spacex-delay-crew-4-launch-to-international-space-station/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Crew-Dragon-Spacecraft-Approaches-International-Space-Station-scaled.jpg", "publishedAt": "2022-04-17T20:46:33Z", "content": "NASAs SpaceX Crew-4 astronauts participate in a training session at SpaceX headquarters in Hawthorne, CA. From left to right: NASA astronaut and SpaceX Crew-4 mission specialist Jessica Watkins; NASA… [+3353 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": null, "title": "Free Garena Fire MAX Redeem Codes for April 17: Learn how to get free stuff now. - Techstory", "description": "The higher variant of Garena Free Fire that is Garena Free Fire MAX is acquiring fame in India after the boycott of Free Fire. It very well may be realized that Garena Free Fire has been restricted in the nation referring to security reasons and has even been…", "url": "https://techstory.in/free-garena-fire-max-redeem-codes-for-april-17-learn-how-to-get-free-stuff-now/", "urlToImage": "https://techstory.in/wp-content/uploads/2022/04/photo-1568915567812-757e15929f_0_1200x768.jpeg", "publishedAt": "2022-04-17T19:42:13Z", "content": "The higher variant of Garena Free Fire that is Garena Free Fire MAX is acquiring fame in India after the boycott of Free Fire. It very well may be realized that Garena Free Fire has been restricted i… [+1727 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "3 Billion Bases of Our DNA: First Complete, Gapless Sequence of a Human Genome - SciTechDaily", "description": "Scientists have published the first complete, gapless sequence of a human genome, two decades after the Human Genome Project produced the first draft human genome sequence. According to researchers, having a complete, gap-free sequence of the roughly 3 billio…", "url": "https://scitechdaily.com/3-billion-bases-of-our-dna-first-complete-gapless-sequence-of-a-human-genome/", "urlToImage": "https://scitechdaily.com/images/Complete-Human-Genome-Sequence.jpg", "publishedAt": "2022-04-17T19:23:47Z", "content": "Scientists have published the first complete, gapless sequence of a human genome, two decades after the Human Genome Project produced the first draft human genome sequence. Credit: Ernesto del Aguila… [+7972 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Fuel leak thwarts NASA's dress rehearsal for Space Launch System moon rocket - HT Tech", "description": "This time, the launch team managed to load some super-cold liquid hydrogen and oxygen into the core stage of the 30-story Space Launch System rocket, but fell far short of the full amount.", "url": "https://tech.hindustantimes.com/tech/news/fuel-leak-thwarts-nasa-s-dress-rehearsal-for-space-launch-system-moon-rocket-71650194402331.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/17/1600x900/SPACE-EXPLORATION-MOON-ROCKET-0_1650200735875_1650200765417.JPG", "publishedAt": "2022-04-17T16:00:23Z", "content": "NASA's latest attempt to fuel its huge moon rocket for a countdown test was thwarted Thursday by a hazardous hydrogen leak, the latest in a series of vexing equipment trouble.\r\nThe launch team had ju… [+1383 chars]"}, {"source": {"id": null, "name": "Malaysiandigest.com"}, "author": null, "title": "Where Can I Buy One Plus Phone In Usa? - malaysiandigest.com", "description": "Would it be cool if OnePlus phones became y phones popular in the USA? ? In any case, it doesn't even rank high among the top five best brands for premium smartphones. Most tech geeks consider a one plus is their choice when it comes to smartphone reviews. Ta…", "url": "https://malaysiandigest.com/where-can-i-buy-one-plus-phone-in-usa/", "urlToImage": null, "publishedAt": "2022-04-17T01:53:20Z", "content": "Would it be cool if OnePlus phones became y phones popular in the USA? ? In any case, it doesn’t even rank high among the top five best brands for premium smartphones. Most tech geeks consider a one … [+56 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Testing Mega Moon Rocket, Massive Comet, and Future X-59 Research - SciTechDaily", "description": "Testing our mega Moon rocket and ground systems ... Preparing the James Webb Space Telescope for science ... And testing an instrument for future X-59 research … a few of the stories to tell you about – This Week at NASA! https://youtu.be/PbM_x-6LRIQ Testing …", "url": "https://scitechdaily.com/this-week-nasa-testing-mega-moon-rocket-massive-comet-and-future-x-59-research/", "urlToImage": "https://scitechdaily.com/images/NASA-Testing-Mega-Moon-Rocket.gif", "publishedAt": "2022-04-16T20:46:13Z", "content": "Testing our mega Moon rocket and ground systems \r\nPreparing the James Webb Space Telescope for science \r\nAnd testing an instrument for future X-59 research a few of the stories to tell you about This… [+3171 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breathtaking NASA Photo of Martian Crater Looks Like “Alien Footprint” - SciTechDaily", "description": "Although the photo above isn't new (it was captured by the High-Resolution Imaging Science Experiment (HiRISE), on the Mars Reconnaissance Orbiter on September 8, 2021), NASA just posted it to Instagram this week. The stunning image went viral, with some sayi…", "url": "https://scitechdaily.com/breathtaking-nasa-photo-of-martian-crater-looks-like-alien-footprint/", "urlToImage": "https://scitechdaily.com/images/Zero-Longitude-Crater-on-Mars-scaled.jpg", "publishedAt": "2022-04-16T11:35:26Z", "content": "The crater in the center of this HiRISE image defines where zero longitude is on Mars, like the Greenwich Observatory does for the Earth. Credit: NASA/JPL-Caltech/UArizona\r\nAlthough the photo above i… [+1570 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Black Hole origin missing link discovered! All thanks to Hubble Telescope - HT Tech", "description": "NASA’s Hubble telescope has discovered a critical “missing link” to study the origins of supermassive black holes. Here’s what we know now.", "url": "https://tech.hindustantimes.com/tech/news/black-hole-origin-missing-link-discovered-all-thanks-to-hubble-telescope-71650103317773.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/16/1600x900/SPACE-SCIENCE-ASTRONOMY-BLACK-HOLE-1_1644152686122_1650103585224.jpg", "publishedAt": "2022-04-16T10:06:44Z", "content": "NASA's Hubble Telescope found the 'missing link' between young star-forming galaxies and the first supermassive black holes! Astronomers believe that the identified rapidly growing black hole in the … [+2402 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "DIY digital archaeology: New methods for visualizing small objects and artifacts - EurekAlert", "description": "A new article in PLOS ONE presents step-by-step protocols for creating publishable 2D and 3D visualizations. The techniques will allow anyone to produce high-quality images and models with minimal effort and cost.", "url": "https://www.eurekalert.org/news-releases/949730", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/e13d43ff-1d37-4072-a026-8c3e8f87bd92/Rendition/thumbnail/Content/Public", "publishedAt": "2022-04-15T22:59:52Z", "content": "image: Workflow and computational steps for the SOAP and HRP Methodsview more \r\nCredit: Jacopo Niccolò Cerasoni\r\nThe ability to visually represent artefacts, whether inorganics like stone, ceramic an… [+3908 chars]"}]}