{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Uranus: NASA’s Dual Observations Pave the Way to Discovering New Worlds - SciTechDaily", "description": "Using the dual perspectives of Hubble and New Horizons, scientists have gained new insights into Uranus' atmospheric properties and brightness, informing future exoplanet studies. Uranus has been described as mysterious, strange, and fairly unknown to those o…", "url": "https://scitechdaily.com/unlocking-uranus-nasas-dual-observations-pave-the-way-to-discovering-new-worlds/", "urlToImage": "https://scitechdaily.com/images/Hubble-Views-of-Uranus-2023.jpg", "publishedAt": "2024-10-11T12:41:29Z", "content": "Simultaneous observations of Uranus by Hubble and New Horizons provide key data for future exoplanet exploration, showing variations in brightness and atmosphere not visible from Earth, crucial for u… [+10290 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Eleven things to know about in the Windows 11 2024 Update - Ars Technica", "description": "A look at some of the changes and odds and ends in this year’s Windows release.", "url": "https://arstechnica.com/gadgets/2024/10/eleven-things-to-know-about-in-the-windows-11-2024-update/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/rainbow-bloom.jpg", "publishedAt": "2024-10-11T11:30:15Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cardiac Crisis: COVID-19 Doubles Risk of Heart Attacks, Strokes, and Death - SciTechDaily", "description": "Research indicates that COVID-19 survivors face doubled risks of severe cardiac events for years after recovery, especially if hospitalized. People with A, B, or AB blood types are particularly vulnerable, highlighting the need for personalized approaches to …", "url": "https://scitechdaily.com/?p=421580", "urlToImage": "https://scitechdaily.com/images/Cardiology-Heart-Problems-Art-Concept.jpg", "publishedAt": "2024-10-11T02:01:39Z", "content": "New research reveals that a history of COVID-19 significantly increases the risk of major cardiac events like heart attacks, strokes, or death up to three years post-infection. Credit: SciTechDaily.c… [+4632 chars]"}]}