{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "wired", "name": "Wired"}, "author": "Celia Ford, Emily Mullin", "title": "One shot of a kidney protein gave monkeys a brain boost - Ars Technica", "description": "An early experiment in older rhesus macaques suggests that an injection of klotho improves working memory. Could it one day help people?", "url": "https://www.wired.com/story/one-shot-of-a-kidney-protein-gave-monkeys-a-brain-boost/", "urlToImage": "https://media.wired.com/photos/649ecade9ec11a2433532c15/191:100/w_1280,c_limit/brainconcept_science_GettyImages-1359441183.jpg", "publishedAt": "2023-07-04T12:05:42Z", "content": "They then administered a single low dose of klotho under each monkeys skin, raising levels of the protein to those normally present in the animals at birth. Four hours later, researchers had them com… [+2846 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Google changes privacy policy; everything you post will be used to boost its AI tools - HT Tech", "description": "Google has updated its privacy policy, and everything that you post online could be scraped to build its AI tools and train AI models.", "url": "https://tech.hindustantimes.com/tech/news/google-changes-privacy-policy-everything-you-post-will-be-used-to-boost-its-ai-tools-71688469343057.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/04/1600x900/solen-feyissa-UWVJaDvXW_c-unsplash_1688470081486_1688470094638.jpg", "publishedAt": "2023-07-04T11:29:40Z", "content": "It has already been known that artificial intelligence (AI) models are trained on data sets that allow them to analyze and respond to texts in several contexts as well as languages. For instance, Cha… [+2319 chars]"}, {"source": {"id": null, "name": "Technext24.com"}, "author": null, "title": "New Apple AirPods Pro will also double as hearing aids - Technext", "description": "Apple airpods pro plans to introduce solutions to hearing dilemma amid other features to its users. The date this will take effect is yet unknown.", "url": "https://technext24.com/2023/07/04/new-apple-airpods-pro-double-hearing-aid/", "urlToImage": "https://technext24.com/wp-content/uploads/2023/07/Apple-Airpods-Pro-Gen-2-vs.-Apple-Airpods-Pro-Gen-1-Hero-Image-2-scaled-1.jpg", "publishedAt": "2023-07-04T09:00:00Z", "content": "Apple is reportedly set to release new features in AirPods Pro that will enable the device also act as a hearing aid. Among the anticipated features, Apple is said to be developing a function that mi… [+2555 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Elusive Ninth Dedekind Number Discovered: Unlocking a Decades-Old Mystery of Mathematics - SciTechDaily", "description": "Scientists from the Universities of Paderborn and Leuven solve long-known problem in mathematics. Making history with 42 digits: Scientists at Paderborn University and KU Leuven have unlocked a decades-old mystery of mathematics with the so-called ninth Dedek…", "url": "https://scitechdaily.com/?p=289258", "urlToImage": "https://scitechdaily.com/images/Mathematics-Problem-Mystery-Concept.jpg", "publishedAt": "2023-07-04T08:25:01Z", "content": "Mathematicians at Paderborn University and KU Leuven, using the Noctua supercomputer and specialized hardware accelerators, have solved a decades-old problem by calculating the ninth Dedekind number,… [+6774 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Parker Solar Probe reveals secrets of the solar wind, which sparks geomagnetic storms on Earth - HT Tech", "description": "The data obtained from Parker Solar Probe has helped scientists to better understand Solar wind speed and this may help in predicting solar eruptions and understanding geomagnetic storms.", "url": "https://tech.hindustantimes.com/tech/news/parker-solar-probe-reveals-secrets-of-the-solar-wind-which-sparks-geomagnetic-storms-on-earth-71688449127327.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/04/1600x900/Parker-Solar-Probe_ObservingSun_1280_1688449981472_1688449997550.jpg", "publishedAt": "2023-07-04T05:57:21Z", "content": "Scientists have made a groundbreaking discovery about the solar wind, revealing how it reaches extraordinary speeds exceeding 1 million miles per hour. The findings, published in the journal Nature, … [+2314 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "The detection of the Universe's background gravitational wave radiation: a scientific triumph - WSWS", "description": "The same confident optimism which organized thousands of scientists towards the successful detection of high-frequency gravitational waves in 2015 now has produced its first fruit with another detector technology and strategy in seeing the background of long-…", "url": "https://www.wsws.org/en/articles/2023/07/04/zxwd-j04.html", "urlToImage": "https://www.wsws.org/asset/71369476-ff16-4582-bedb-684d5cd98315?rendition=1600x900", "publishedAt": "2023-07-04T02:07:48Z", "content": "Count what is countable, measure what is measurable, and what is not measurable, make measurableattributed to Galileo Galilei\r\nThe detection of a predicted universal background of gravitational waves… [+18931 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Intensely Powerful X1.0 Solar Flare Witnessed by NASA's Solar Dynamics Observatory - SciTechDaily", "description": "The Sun emitted a strong solar flare, peaking at 7:14 p.m. EDT (4:14 p.m. PDT) on July 2, 2023. NASA’s Solar Dynamics Observatory, which watches the Sun constantly, captured an image of the event. This flare is classified as an X1.0 flare. X-class denotes the…", "url": "https://scitechdaily.com/intensely-powerful-x1-0-solar-flare-witnessed-by-nasas-solar-dynamics-observatory/", "urlToImage": "https://scitechdaily.com/images/July-2023-X-Class-Solar-Flare.jpg", "publishedAt": "2023-07-04T00:44:45Z", "content": "ByNASA Goddard Space Flight CenterJuly 3, 2023\r\nNASAs Solar Dynamics Observatory captured this image of a solar flare as seen in the bright flash on the top right area of the Sun on July 2, 2023. The… [+3770 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "As Twitter flounders, Mastodon refreshes its official app for Android users - TechCrunch", "description": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, Mastodon is launching a significant refresh of its Android app.", "url": "https://techcrunch.com/2023/07/03/as-twitter-flounders-mastodon-refreshes-its-official-app-for-android-users/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/mastodon-app-android.png?resize=1200,734", "publishedAt": "2023-07-03T19:48:55Z", "content": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, open source Twitter alternative Mastodon is celebrating the launch of a significant refresh of its Android… [+3300 chars]"}]}