{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "To the Moon and Beyond: Meet the Trailblazing Astronauts of NASA's Artemis II - SciTechDaily", "description": "NASA and the Canadian Space Agency have announced the four astronauts selected for Artemis II, the first crewed mission in NASA's Artemis program, which aims to establish a long-term presence on the Moon for science and exploration. The crew includes NASA ast…", "url": "https://scitechdaily.com/?p=265984", "urlToImage": "https://scitechdaily.com/images/NASA-Artemis-II-Crew-Portrait.jpg", "publishedAt": "2023-04-04T08:35:37Z", "content": "ByNASAApril 4, 2023\r\nThe crew of NASAs Artemis II mission (left to right): NASA astronauts Christina Hammock Koch, Reid Wiseman (seated), Victor Glover, and Canadian Space Agency astronaut Jeremy Han… [+8791 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "iPhone 17 Pro may feature under-display Face ID tech - The Siasat Daily", "description": "San Francisco: The under-display Face ID technology will reportedly debut on Apple's iPhone 17 Pro, which will become the first iPhone to feature such technology. According to display analyst Ross Young, the under-display 'Face ID' technology will still be ac…", "url": "https://www.siasat.com/iphone-17-pro-may-feature-under-display-face-id-tech-2561170/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/04/Apple-iPhone-15-pro.jpg", "publishedAt": "2023-04-04T08:16:00Z", "content": "San Francisco: The under-display Face ID technology will reportedly debut on Apple’s iPhone 17 Pro, which will become the first iPhone to feature such technology.\r\nAccording to display analyst Ross Y… [+1355 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Byju's raises $700 million in fresh funding round: Report - Mint", "description": "The much-needed capital infusion could help the edtech major stave off potential debt issues", "url": "https://www.livemint.com/companies/news/byjus-raises-700-million-in-fresh-funding-round-report-11680587966477.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/04/600x338/Byjus_1680588178725_1680588178938_1680588178938.JPG", "publishedAt": "2023-04-04T06:04:11Z", "content": "Byjus, the worlds most valuable edtech startup, has raised $700 million at a flat valuation of $22 billion, involving two separate deals of equity and convertible notes, according to a Financial Expr… [+1798 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Weird threat! NASA detects Ring-shaped sunspot; Solar storm fears rise for Earth - HT Tech", "description": "In the southern hemisphere of the Sun, a ring-shaped sunspot has been detected by the NASA Solar Dynamics Observatory, Which has expanded at a furious rate over the last 24 hours. Is another solar storm coming for the Earth?", "url": "https://tech.hindustantimes.com/tech/news/weird-threat-nasa-detects-ring-shaped-sunspot-solar-storm-fears-rise-for-earth-71680587481644.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/04/1600x900/sun-4444454_1920_1651753999330_1680587544596_1680587544596.jpg", "publishedAt": "2023-04-04T05:57:04Z", "content": "Earlier, the National Oceanic and Atmospheric Administration had revealed that as many as four sunspots have been detected on the Earth-facing side of the Sun, among which one was likely to erupt a C… [+2777 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA tracks 92-foot asteroid flyby; closest Earth approach today - HT Tech", "description": "A 92-foot asteroid is expected to make a close approach to Earth today. Check out its speed, distance and other details, as revealed by NASA.", "url": "https://tech.hindustantimes.com/tech/news/nasa-tracks-92-foot-asteroid-flyby-closest-earth-approach-today-71680583258752.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/04/1600x900/cosmos-7051165_1280_1675313973292_1680583346492_1680583346492.jpg", "publishedAt": "2023-04-04T04:43:04Z", "content": "Asteroids make close approaches to Earth almost every day, but how does NASA track these space rocks located millions of kilometers away in space? NASA telescopes such as the Pans-STARRS1 located in … [+1737 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The BOAT Event: Brightest Gamma-Ray Burst in History Puzzles Astronomers Worldwide - SciTechDaily", "description": "University of Arizona astronomers have joined an international effort to study the aftermath of the brightest flash of gamma rays ever observed. Observations involving various UArizona telescopes and instruments provide astronomers with a \"cosmic lab\" to stud…", "url": "https://scitechdaily.com/the-boat-event-brightest-gamma-ray-burst-in-history-puzzles-astronomers-worldwide/", "urlToImage": "https://scitechdaily.com/images/Record-Breaking-Gamma-Ray-Burst.gif", "publishedAt": "2023-04-04T04:22:06Z", "content": "ByDaniel Stolte, University of ArizonaApril 3, 2023\r\nUniversity of Arizona astronomers join an international effort to study the BOAT (brightest of all time), a gamma-ray burst providing a cosmic lab… [+10361 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for April 4: Weapon crates, diamond vouchers and costumes - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for April 4: Have you checked today’s freebies? Don’t delay. Claim them right now.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-april-4-weapon-crates-diamond-vouchers-and-costumes-71680577092739.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/04/1600x900/055_1_1680577559298_1680577559563_1680577559563.jpg", "publishedAt": "2023-04-04T03:16:01Z", "content": "Garena Free Fire MAX Redeem Codes for April 4: Free Fire is as much a game of skill as much as it is about strategy. For example, you can be a great gun slinger, but if you do not choose your battles… [+2675 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Time-Bending Experiment: Physicists Reveal Quantum Nature of Light in a New Dimension - SciTechDaily", "description": "Imperial physicists have recreated the famous double-slit experiment, which showed light behaving as particles and a wave, in time rather than space. In a groundbreaking development, Imperial College London physicists have recreated the historic double-slit e…", "url": "https://scitechdaily.com/?p=265767", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Light-Waves-Concept.jpg", "publishedAt": "2023-04-04T03:10:36Z", "content": "ByImperial College LondonApril 3, 2023\r\nImperial physicists have performed the double-slit experiment in time, using materials that can change optical properties in femtoseconds, providing insights i… [+2889 chars]"}, {"source": {"id": null, "name": "Hollywood Reporter"}, "author": "J. Clara Chan", "title": "Spotify Shutters Live Audio App - Hollywood Reporter", "description": "The tech giant, which created its live audio offering after acquiring Betty Labs, canceled some of its live audio shows last year.", "url": "https://www.hollywoodreporter.com/business/business-news/spotify-live-shutters-1235366519/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2023/04/Spotify-Logo-Mobile-Phone-GettyImages-1234971748-H-2023.jpg?w=1024", "publishedAt": "2023-04-03T23:21:11Z", "content": "Spotify is shutting down its standalone live audio app, Spotify Live, at the end of this month as the audio giant turns away from live programming, a company spokesperson told The Hollywood Reporter … [+2098 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Matt Williams", "title": "Astronomers Think They've Found One of the Biggest Black Holes Ever Seen - Universe Today", "description": "Using the Gravitational Lensing technique, astronomers have found evidence of what could be the largest black hole ever detected!", "url": "https://www.universetoday.com/160755/astronomers-think-theyve-found-one-of-the-biggest-black-holes-ever-seen/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/03/Ultramassive-Black-Holes-WEB-.jpg", "publishedAt": "2023-04-03T21:49:48Z", "content": "In 1931, Indian-American physicist Subrahmanyan Chandrasekhar proposed a resolution to Einstein’s Theory of General Relativity that postulated the existence of black holes. By 1972, astronomers obtai… [+5113 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Mysteries of Superionic Ice: Deciphering the Magnetic Anomalies of Neptune and Uranus - SciTechDaily", "description": "A key aspect of the study was the deployment of density functional theory (DFT), a method derived from quantum mechanics and used in solid-state physics to resolve complex crystalline structures. Researchers used density functional theory to study the mechani…", "url": "https://scitechdaily.com/unlocking-the-mysteries-of-superionic-ice-deciphering-the-magnetic-anomalies-of-neptune-and-uranus/", "urlToImage": "https://scitechdaily.com/images/Superionic-Ice-XVIII.jpg", "publishedAt": "2023-04-03T00:36:24Z", "content": "BySão Paulo Research Foundation (FAPESP)April 2, 2023\r\nImage from simulation of ice XVIII. Oxygen ions (red) occupy a regular crystal lattice, while protons (white) diffuse like a liquid. Credit: Mau… [+7757 chars]"}]}