{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Historic Artemis I Launch, Power Spacewalk, New Webb Image & X-59 Aircraft - SciTechDaily", "description": "The historic launch of NASA’s Artemis I flight test … A powerwalk outside the space station … And the beginnings of a new star … a few of the stories to tell you about – This Week at NASA! https://youtu.be/v3qv2ZAvUbo Artemis I Mega Rocket Launches Orion to M…", "url": "https://scitechdaily.com/this-week-nasa-historic-artemis-i-launch-power-spacewalk-new-webb-image-x-59-aircraft/", "urlToImage": "https://scitechdaily.com/images/NASA-Historic-Artemis-I-Launch.gif", "publishedAt": "2022-11-19T22:38:52Z", "content": "ByNASANovember 19, 2022\r\nThe historic launch of NASA\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government th… [+2875 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Ultimate Death Stare: How Moth Wing Patterns Allow Them To Escape Death - SciTechDaily", "description": "Dr. Hannah Rowland and Dr. John Skelhorn explain how these defensive patterns on moth wings persuade birds that assaulting the insects is not worth the risk. Art mirrors real life when it comes to moth wings Have you ever had the impression that someone in a …", "url": "https://scitechdaily.com/the-ultimate-death-stare-how-moth-wing-patterns-allow-them-to-escape-death/", "urlToImage": "https://scitechdaily.com/images/Peacock-Butterfly-scaled.jpg", "publishedAt": "2022-11-19T21:08:49Z", "content": "A peacock butterfly with eyespots on its wings. Credit: Dr. Hannah Rowland\r\nDr. Hannah Rowland and Dr. John Skelhorn explain how these defensive patterns on moth wings persuade birds that assaulting … [+4525 chars]"}, {"source": {"id": null, "name": "Tech4gamers.com"}, "author": "Avinash Jaisrani", "title": "Warzone 2.0 Has A Ton Of Negative Reviews On Steam - Tech4Gamers", "description": "Warzone 2.0 launched recently, but the review section on Steam is already filled with a ton of negative reviews.", "url": "https://tech4gamers.com/warzone-2-0-negative-reviews-steam/", "urlToImage": "https://tech4gamers.com/wp-content/uploads/2022/09/Call-of-Duty-Warzone-2.0.jpg", "publishedAt": "2022-11-19T18:03:52Z", "content": "Call of Duty: Modern Warfare 2 has enjoyed financial success. The title went on to make over $800 million in three days while becoming the biggest Call of Duty launch on PlayStation and Steam. Additi… [+2006 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Paul Tassi", "title": "Pokemon Scarlet And Violet’s Tech Problems Are On Game Freak, Not The Switch - Forbes", "description": "Game Freak is to blame for how bad Pokemon Scarlet and Violet are performing, even if Nintendo should upgrade the Switch soon too.", "url": "https://www.forbes.com/sites/paultassi/2022/11/19/pokemon-scarlet-and-violets-tech-problems-are-on-game-freak-not-the-switch/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6378e032e6034480162d6c0f/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-11-19T13:58:18Z", "content": "Pokemon Scarlet and Violet\r\nGame Freak\r\nWhile yes, we have reached a point in the lifecycle of the Nintendo Switch where the handheld console is roughly two full generations of tech behind its rivals… [+2346 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "2022 World Cup: Oliseh to work with Wenger - Daily Post Nigeria", "description": "Former Super Eagles coach, Sunday Oliseh has confirmed he will be working under legendary Arsenal boss, Arsene Wenger, during the 2022 World Cup in Qatar. Oliseh has been selected by FIFA as one of the six technical experts for the tournament. The former Boru…", "url": "https://dailypost.ng/2022/11/19/2022-world-cup-oliseh-to-work-with-wenger/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/11/Collage-Maker-19-Nov-2022-01.28-PM.jpg", "publishedAt": "2022-11-19T12:32:36Z", "content": "Former Super Eagles coach, Sunday Oliseh has confirmed he will be working under legendary Arsenal boss, Arsene Wenger, during the 2022 World Cup in Qatar.\r\nOliseh has been selected by FIFA as one of … [+588 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Exceeding Expectations” – Orion Spacecraft Conducts First Inspection - SciTechDaily", "description": "https://youtu.be/pCp-VY2VxGY On the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfway to the Moon. Credit: NASA On the third day of its Arte…", "url": "https://scitechdaily.com/exceeding-expectations-orion-spacecraft-conducts-first-inspection/", "urlToImage": "https://scitechdaily.com/images/Orion-Captures-Moon-With-Camera-on-Solar-Array.gif", "publishedAt": "2022-11-19T11:16:10Z", "content": "ByNASANovember 19, 2022\r\nOn the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfwa… [+4514 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "There are now 8 billion people in the world – here’s what that means for the future - BusinessTech", "description": "There are 8 billion people in the world. That’s a fact. It’s a thing we can’t deny. Like the fact that", "url": "https://businesstech.co.za/news/lifestyle/643463/there-are-now-8-billion-people-in-the-world-heres-what-that-means-for-the-future/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Large-crowd.jpg", "publishedAt": "2022-11-19T11:09:16Z", "content": "The worlds population reached 8 billion Tuesday (15 November), according to estimates from the United Nations, even as the international body said that a surge in births in lower-income countries is … [+2563 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Rebecca Isaacs", "title": "35+ best Amazon Black Friday deals 2022: Save now on Fire TV, iPad, Ring cameras, and more - ZDNet", "description": "Amazon's Black Friday plan involves getting the deals straight to you earlier this year. Shop its deals and score big savings on top tech items and gifts.", "url": "https://www.zdnet.com/article/early-amazon-black-friday-deals-november-18-2022/", "urlToImage": "https://www.zdnet.com/a/img/resize/f7bb0eb76df0df6ecce573b978ee396d1b345f86/2022/11/17/60a61358-377a-41df-a445-181b3b815342/best-amazon-black-friday-deals.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2022-11-18T20:48:45Z", "content": "ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other … [+1152 chars]"}, {"source": {"id": null, "name": "Beebom"}, "author": "Vanshika Malhotra", "title": "Intel’s FakeCatcher Can Detect a Deepfake Video in Real Time - Beebom", "description": "Intel has introduced a new technology called FakeCatcher, which can easily detect Deepfake videos in real-time. Check out the details.", "url": "https://beebom.com/intel-fakecatcher-technology-detect-deepfakes/", "urlToImage": "https://beebom.com/wp-content/uploads/2022/11/intel-fakecatcher.jpg", "publishedAt": "2022-11-18T12:07:20Z", "content": "While Deepfakes can be fun, they have been increasingly used to spread fake news and fake images of people, especially celebrities. With time, detecting one and become more difficult but Intel has a … [+2297 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major headache for new climate laws in South Africa - BusinessTech", "description": "A recent report by the Parliamentary Monitoring Group examined the actions and effectiveness of the country’s Parliament in achieving outcomes in relation to the climate change agenda, with some disturbing findings.", "url": "https://businesstech.co.za/news/government/644195/major-headache-for-new-climate-laws-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Ramaphosa-Green-Earth-Climate-Change-v2.jpg", "publishedAt": "2022-11-18T08:33:39Z", "content": "The Parliamentary Monitoring Group (PMG) has found that critical climate bills are not given enough engagement nor properly understood by people in parliament – stalling progress and creating headach… [+3571 chars]"}]}