{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Devin Coldewey", "title": "Apple joins the race to find an AI icon that makes sense - TechCrunch", "description": "No one knows what AI looks like, or even is supposed to look like. It does everything, but looks like nothing.", "url": "https://techcrunch.com/2024/06/15/apple-joins-the-race-to-find-an-ai-icon-that-makes-sense/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/ai-logos-v2.jpg?resize=1200,675", "publishedAt": "2024-06-15T18:01:00Z", "content": "This week was an exciting one for the AI community, as Apple joined Google, OpenAI, Anthropic, Meta and others in the long-running competition to find an icon that even remotely suggests AI to users.… [+6035 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Flares” and “Echoes” – Unveiling the Monster Black Hole at Our Galaxy's Core - SciTechDaily", "description": "Michigan State University researchers have made important discoveries about the supermassive black hole at our galaxy's center, presenting their findings based on NuSTAR X-ray data. Researchers led by Shuo Zhang have presented new findings that will help scie…", "url": "https://scitechdaily.com/flares-and-echoes-unveiling-the-monster-black-hole-at-our-galaxys-core/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Flare-From-Sagittarius-A.jpg", "publishedAt": "2024-06-15T15:06:53Z", "content": "Michigan State University researcher Grace Sanger-Johnson found nine previously undiscovered X-ray flares from Sagittarius A*, the Milky Way’s central supermassive black hole, by sifting through a de… [+6522 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "How much does ChatGPT cost? Everything you need to know about OpenAI's pricing plans - TechCrunch", "description": "How much does it cost to use OpenAI's ChatGPT? Do you even need a subscription? Our comprehensive article dives in.", "url": "https://techcrunch.com/2024/06/15/how-much-does-chatgpt-cost-everything-you-need-to-know-about-openais-pricing-plans/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/05/OpenAI-and-ChatGPT.jpeg?resize=1200,676", "publishedAt": "2024-06-15T15:00:00Z", "content": "OpenAI’s AI-powered chatbot platform ChatGPT keeps expanding with new features. It now offers a store the GPT Store for AI-powered applications and services. The recently introduced memories feature … [+5661 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New Tech Updates And Launches: Apple's WWDC Event, Xiaomi - NDTV", "description": "A lot happened in the world of technology over the past week. Apple held its annual WWDC event at Apple Park, where it finally took the covers off the AI fea...", "url": "https://www.youtube.com/watch?v=MZtSNIYqoko", "urlToImage": "https://i.ytimg.com/vi/MZtSNIYqoko/maxresdefault.jpg", "publishedAt": "2024-06-15T10:35:00Z", "content": null}]}