{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN,China Global Television Network", "title": "Influence of China's sci-tech journals continues to grow - CGTN", "description": "The influence of China's science and technology journals continues to grow, with more of these journals now included in key global periodical retrieval systems, according to a recent report from the Institute of Scientific and Technical Information under", "url": "https://news.cgtn.com/news/2023-02-02/Influence-of-China-s-sci-tech-journals-continues-to-grow-1h5xtw6T9Pq/index.html", "urlToImage": "https://news.cgtn.com/news/2023-02-02/Influence-of-China-s-sci-tech-journals-continues-to-grow-1h5xtw6T9Pq/img/af3d67a6596d40f4a39a85836207056b/af3d67a6596d40f4a39a85836207056b-750.jpeg", "publishedAt": "2023-02-02T02:26:37Z", "content": "The influence of China's science and technology journals continues to grow, with more of these journals now included in key global periodical retrieval systems, according to a recent report from the … [+587 chars]"}, {"source": {"id": null, "name": "Biopharminternational.com"}, "author": "Cynthia A. Challener", "title": "Technology for In Vivo CAR T-cell Therapy Advances - BioPharm International", "description": "In vivo CAR-T gene therapies could overcome the challenges faced by autologous and allogeneic treatments.", "url": "https://www.biopharminternational.com/view/technology-for-in-vivo-car-t-cell-therapy-advances", "urlToImage": null, "publishedAt": "2023-02-02T02:11:13Z", "content": "There is no doubt that chimeric antigen receptor (CAR) T-cell therapies have had a tremendous positive impact on patients that have received them; however, autologous cell therapies produced in centr… [+18368 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Amplified search for new forces: Special setup uses polarized rubidium and xenon as transmitter and receiver system for exotic fields - Science Daily", "description": "In the search for new forces and interactions beyond the Standard Model, an international team of researchers has now taken a good step forward. The researchers are using an amplification technique based on nuclear magnetic resonance. They use their experimen…", "url": "https://www.sciencedaily.com/releases/2023/02/230201134227.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-02T00:59:32Z", "content": "In the search for new forces and interactions beyond the Standard Model, an international team of researchers involving the PRISMA+ Cluster of Excellence at Johannes Gutenberg University Mainz (JGU) … [+5028 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Revolutionary automated LiDAR classification now available through Neara's self-service offering - PR Newswire", "description": "/PRNewswire/ -- Neara, a leading climate tech software platform and provider of 3D interactive simulation models of critical infrastructure, today announced...", "url": "https://www.prnewswire.com/news-releases/revolutionary-automated-lidar-classification-now-available-through-nearas-self-service-offering-301736722.html", "urlToImage": null, "publishedAt": "2023-02-01T22:17:00Z", "content": "New solution offers LiDAR-based insights of critical infrastructure 30x faster than manual processing\r\nSEATTLE, Feb. 1, 2023 /PRNewswire/ -- Neara, a leading climate tech software platform and provid… [+3729 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Staff Reporter", "title": "Samsung Galaxy S23 launched - South African pricing, specs - TechCentral - TechCentral", "description": "Samsung Electronics has taken the wraps off the Galaxy S23, S23+ and S23 Ultra. This is how much they cost in South Africa.", "url": "https://techcentral.co.za/samsung-galaxy-s23-launched-south-african-pricing-specs/221585/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2023/01/samsung-galaxy-s23-adjusted.jpg", "publishedAt": "2023-02-01T18:00:39Z", "content": "Samsung Electronics on Wednesday took the wraps off its latest flagship smartphone series, the Galaxy S23, S23+ and S23 Ultra.\r\nNot that there was much new to reveal, mind you: almost everything abou… [+2521 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "Microsoft to bring new look to Teams Rooms on Windows - The Siasat Daily", "description": "Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays", "url": "https://www.siasat.com/microsoft-to-bring-new-look-to-teams-rooms-on-windows-2516397/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/02/wgqgeqge-1.jpg", "publishedAt": "2023-02-01T16:01:00Z", "content": "San Francisco: Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays, by the end of this quarter.\r\n“To make Teams Rooms ev… [+1408 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Could a Nuclear Thermal Rocket Engine Power a Trip to Mars? NASA and DARPA Are Testing - SciTechDaily", "description": "NASA and the Defense Advanced Research Projects Agency (DARPA) recently announced a collaboration to demonstrate a nuclear thermal rocket engine in space, an enabling capability for NASA crewed missions to Mars. NASA and DARPA will partner on the Demonstratio…", "url": "https://scitechdaily.com/could-a-nuclear-thermal-rocket-engine-power-a-trip-to-mars-nasa-and-darpa-are-testing/", "urlToImage": "https://scitechdaily.com/images/Mars-Transit-Habitat-and-Nuclear-Propulsion-System-scaled.jpg", "publishedAt": "2023-02-01T13:46:57Z", "content": "ByNASAFebruary 1, 2023\r\nArtist concept of Demonstration for Rocket to Agile Cislunar Operations (DRACO) spacecraft, which will demonstrate a nuclear thermal rocket engine. Nuclear thermal propulsion … [+6332 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:15:13Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon", "title": "US and India to boost defense and technology cooperation as China threat grows - CNN", "description": "The United States and India are taking steps to strengthen their defense partnership, officials said Tuesday, the latest sign of cooperation between the two countries in the face of an increasingly assertive China.", "url": "https://www.cnn.com/2023/02/01/asia/us-india-defense-technology-cooperation-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230201021412-01-usa-india-military-exercise-102121-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-01T08:10:00Z", "content": "The United States and India are taking steps to strengthen their defense partnership, officials said Tuesday, the latest sign of cooperation between the two countries in the face of an increasingly a… [+2937 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UCF researchers uncover key mechanisms for sustainable ammonia production - EurekAlert", "description": "A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing sustainable fertilizer research and thus aiding global food safety efforts.\nAmmonia, a…", "url": "https://www.eurekalert.org/news-releases/978297", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-31T19:54:28Z", "content": "ORLANDO, Jan. 31, 2022 — A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing s… [+4796 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Use Quantum Mechanics To See Objects Without Looking at Them - SciTechDaily", "description": "The newly developed method links quantum and classical worlds and may enhance measurements for quantum computers and other applications. Our vision is made possible by the specialized cells in our retina that absorb light. But, can one see without any absorpt…", "url": "https://scitechdaily.com/researchers-use-quantum-mechanics-to-see-objects-without-looking-at-them/", "urlToImage": "https://scitechdaily.com/images/Researchers-Use-Quantum-Mechanics-To-See-Objects-Without-Looking-at-Them-scaled.jpg", "publishedAt": "2023-01-31T19:31:20Z", "content": "ByAalto UniversityJanuary 31, 2023\r\nAalto University quantum researchers use quantum coherence to detect objects without looking at them. Credit: Mikko Raskinen/Aalto University.\r\nThe newly developed… [+4968 chars]"}]}