{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Dan Goodin", "title": "Gemini hackers can deliver more potent attacks with a helping hand from… Gemini - Ars Technica", "description": "Hacking LLMs has always been more art than science. A new attack on Gemini could change that.", "url": "https://arstechnica.com/security/2025/03/gemini-hackers-can-deliver-more-potent-attacks-with-a-helping-hand-from-gemini/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/03/google-gemini-self-hack-hands-1152x648.jpg", "publishedAt": "2025-03-28T11:00:58Z", "content": null}, {"source": {"id": null, "name": "NPR"}, "author": null, "title": "Cooper Flagg sends Duke into Elite Eight while Texas Tech wins an overtime thriller - NPR", "description": "The Sweet 16 weekend began Thursday night with dramatic late-night games as both men and women roll into action on Friday.", "url": "https://www.npr.org/2025/03/28/g-s1-56825/ncaa-sweet-16-flagg-duke", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5589x3144+0+291/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fc6%2Ff5%2F1b9146ae40338631aeeaf0fa23e7%2Fduke-flagg-getty.jpg", "publishedAt": "2025-03-28T09:00:00Z", "content": "For the Elite Eight in the NCAA men's basketball tournament, the ACC has a Flagg bearer.\r\nAs the lone ACC team left in the tournament, Duke with its sensational freshman, Cooper Flagg, held on down t… [+2890 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Captures Neptune’s Long-Hidden Auroras in Stunning Detail - SciTechDaily", "description": "Long-Sought Auroral Glow Finally Emerges Under Webb’s Powerful Gaze Neptune lies in the cold, dark reaches of the outer edges of our solar system, about 3 billion miles from the Sun, at the farthest edge of the planetary lineup. Only one spacecraft has ever f…", "url": "https://scitechdaily.com/?p=465174", "urlToImage": "https://scitechdaily.com/images/Neptune-Auroras-Hubble-and-Webb-Image.jpg", "publishedAt": "2025-03-28T08:13:05Z", "content": "Neptune’s elusive auroras have finally been captured in stunning detail by NASA’s James Webb Space Telescope. Using its powerful infrared capabilities, scientists detected glowing auroral activity un… [+9240 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Des Bieler, Candace Buckner, Adam Kilgore, Emily Giambalvo, Barry Svrluga, Gene Wang, Chuck Culpepper, Jesse Dougherty, Neil Greenberg", "title": "March Madness highlights: Duke holds off Arizona; Texas Tech storms back to oust Arkansas in OT - The Washington Post", "description": "Half of the men’s Elite Eight is set after top seeds Duke and Florida took down Arizona and Maryland, respectively, while Texas Tech ousted Arkansas in OT and Alabama rolled over BYU.", "url": "https://www.washingtonpost.com/sports/2025/03/27/march-madness-live-scores-ncaa-basketball/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GQ2LAVNJLM63IHCH3JT4UQPQ5Q_size-normalized.jpg&w=1440", "publishedAt": "2025-03-28T06:34:55Z", "content": "No. 2 seed Alabama traveled north, and did not mess around. Were not used to the basketball program looking as dominant as the Crimson Tide on the gridiron, but in the Newark regional semifinal, Alab… [+286 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Galaxy S25 Edge Dummy Units Surface, Flaunting The Ultra-Slim Design And Giving Us A Closer Look At The Upcoming Device - Wccftech", "description": "The Galaxy S25 Edge dummy units are out giving us a closer look at the slim form factor and the design of the upcoming device", "url": "https://wccftech.com/galaxy-s25-edge-dummy-units-surface-flaunting-the-ultra-slim-design-and-giving-us-a-closer-look-at-the-upcoming-device/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/03/Galaxy-S25-Edge-1-1-e1743099877514.jpg", "publishedAt": "2025-03-27T18:48:00Z", "content": "Samsung is determined to bring many noteworthy upgrades this year, with its much-anticipated Project Moohan and a tri-fold smartphone planned to roll out in 2025. Now, the attention seems to be on th… [+2289 chars]"}]}