{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bret Baier, Amy Munneke", "title": "James Webb Telescope helps enhance technology from virtual reality to LASIK eye surgery - Fox News", "description": "Some of the recent discoveries made by the James Webb Telescope, which is delivering never before seen images of space, include three galaxies that could be actively forming.", "url": "https://www.foxnews.com/science/james-webb-telescope-helps-enhance-technology-virtual-reality-lasik-eye-surgery", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/06/BILL-NELSON.jpg", "publishedAt": "2024-06-17T23:00:31Z", "content": "WASHINGTON The James Webb Telescope is delivering amazing photos of space like weve never seen before.\r\n\"Its a new window into the history of our universe,\" President Joe Biden said during an unveili… [+4175 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tyler Rohr, Ali Mashayek, Sophie Meyjes", "title": "Marine CO₂ removal technologies could depend on the appetite of the ocean's tiniest animals - Phys.org", "description": "As the world struggles to decarbonize, it's becoming increasingly clear we'll need to both rapidly reduce emissions and actively remove carbon dioxide (CO2) from the atmosphere. The latest Intergovernmental Panel on Climate Change report considered 230 pathwa…", "url": "https://phys.org/news/2024-06-marine-technologies-appetite-ocean-tiniest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/marine-co-removal-tech.jpg", "publishedAt": "2024-06-17T16:20:38Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+7204 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss the Strawberry Moon in June's Night Sky! - SciTechDaily", "description": "The Next Full Moon is the Strawberry Moon; the Flower, Hot, Hoe, or Planting Moon; the Mead or Honey Moon; the Rose Moon; Vat Purnima; Poson Poya; and the LRO Moon. On June 21, 2024, the full \"Strawberry Moon\" will be visible, marked by various cultural celeb…", "url": "https://scitechdaily.com/dont-miss-the-strawberry-moon-in-junes-night-sky/", "urlToImage": "https://scitechdaily.com/images/Full-Strawberry-Moon-Illustration.jpg", "publishedAt": "2024-06-17T13:23:50Z", "content": "The name “Strawberry Moon” isn’t from the color of the Moon, despite what you see in this artist’s illustration. It comes from the Algonquin tribes of North America, marking the time of year when wil… [+20694 chars]"}]}