{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Captures a Marvel of Galactic Morphology - SciTechDaily", "description": "The galaxy featured in this Hubble Picture of the Week has a shape unlike many of the galaxies familiar to Hubble. Although its thousands of brilliant stars evoke a spiral galaxy, it lacks the characteristic ‘winding’ structure. The shining crimson blossoms s…", "url": "https://scitechdaily.com/hubble-captures-a-marvel-of-galactic-morphology/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-1156-Crop-scaled.jpg", "publishedAt": "2022-08-22T04:15:14Z", "content": "Hubble Space Telescope image of NGC 1156. Credit: ESA/Hubble &amp; NASA, R. B. Tully, R. Jansen, R. Windhorst\r\nThe galaxy featured in this Hubble Picture of the Week has a shape unlike many of the ga… [+1530 chars]"}, {"source": {"id": null, "name": "Swinburne.edu.au"}, "author": null, "title": "Underground lab plunges researchers into the dark (matter) - Swinburne University of Technology", "description": "Swinburne researchers unveil the first stage of the Stawell Underground Physics Laboratory, located at the active Stawell Gold Mine in the Wimmera region of Victoria – to be used to shine a light on dark matter.", "url": "https://www.swinburne.edu.au/news/2022/08/Underground-lab-plunges-researchers-into-the-dark-matter/", "urlToImage": "https://www.swinburne.edu.au/content/dam/media/research/stawell-lab.jpg/_jcr_content/renditions/cq5dam.web.1280.720.jpeg", "publishedAt": "2022-08-22T02:59:01Z", "content": "Located one kilometre underground, the Southern Hemispheres first dark matter underground physics laboratory is open. The one-of-a-kind lab will allow researchers from several Australian universities… [+4756 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Disproving a 60-Year-Old Hypothesis: Most “Silent” Mutations Are Actually Harmful - SciTechDaily", "description": "A new study finds that most \"silent\" mutations are harmful rather than neutral. Marshall Nirenberg, a University of Michigan alumni, and a small group of researchers cracked the genetic code of life in the early 1960s, figuring out the rule by which informati…", "url": "https://scitechdaily.com/disproving-a-60-year-old-hypothesis-most-silent-mutations-are-actually-harmful/", "urlToImage": "https://scitechdaily.com/images/Genetics-Cancer-DNA-Mutation-Illustration.jpg", "publishedAt": "2022-08-22T02:23:59Z", "content": "ByUniversity of MichiganAugust 21, 2022\r\nSynonymous mutations have long been thought to have relatively no impact.\r\nA new study finds that most silent mutations are harmful rather than neutral.\r\nMars… [+6134 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Ask Giz Your Burning Science or Tech Questions and We’ll Get Them Answered - Gizmodo Australia", "description": "Phone not working in an elevator? Xbox not connecting? Is the Moon made of cheese? Don't know what the deal is with pufferfish? Just Ask Giz.", "url": "https://www.gizmodo.com.au/2022/08/ask-giz/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/03/18/ask-gizmodo-1.jpg?quality=80&resize=1280,720", "publishedAt": "2022-08-22T01:25:00Z", "content": "Here at Gizmodo Australia we like many things, lots of things, in fact. But one thing we really like is finding answers to stuff you want to know about.\r\nIf youve spent any time on Gizmodo Australia … [+1192 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "INQUIRER.net BrandRoom", "title": "vivo champions photography in the Philippines - INQUIRER.net", "description": "Interest in photography seems to be at an all-time high—and still gaining momentum—in the Philippines these days. Thanks to technology, anyone with a camera phone can simply take a photo and, in", "url": "https://www.inquirer.net", "urlToImage": "https://technology.inquirer.net/files/2022/08/Screen-Shot-2022-08-17-at-12.08.26-PM-620x381.jpg", "publishedAt": "2022-08-22T01:00:00Z", "content": "Interest in photography seems to be at an all-time highand still gaining momentumin the Philippines these days. Thanks to technology, anyone with a camera phone can simply take a photo and, in no tim… [+5326 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Malou Talosig-Bartolome", "title": "Group pitches use of tech in 'rightsizing' bureaucracy | Malou Talosig-Bartolome - BusinessMirror", "description": "USE technology to “rightsize” bureaucracy. This is the pitch of Emmanuel Lallana, chief executive of nonprofit organization Ideacorp Inc., to President Ferdinand R. Marcos Jr. who recently revived “rightsizing” as the way to make the bureaucracy “responsive t…", "url": "https://businessmirror.com.ph/2022/08/22/group-pitches-use-of-tech-in-rightsizing-bureaucracy/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/11/BusinessMirror-BM-lettermark.jpg", "publishedAt": "2022-08-21T19:16:00Z", "content": "USE technology to rightsize bureaucracy.\r\nThis is the pitch of Emmanuel Lallana, chief executive of nonprofit organization Ideacorp Inc., to President Ferdinand R. Marcos Jr. who recently revived rig… [+3396 chars]"}, {"source": {"id": null, "name": "Voonze.com"}, "author": "https://www.facebook.com/TheDeepLines", "title": "When the Thames and the Seine flowed into the Rhine: there is another Europe under the sea and not long ago there were humans living there - How smart Technology changing lives - InTallaght", "description": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, and part of Atlantic France. It was more than a land bridge; i…", "url": "https://voonze.com/when-the-thames-and-the-seine-flowed-into-the-rhine-there-is-another-europe-under-the-sea-and-not-long-ago-there-were-humans-living-there/", "urlToImage": "https://voonze.com/wp-content/uploads/2022/08/When-the-Thames-and-the-Seine-flowed-into-the-Rhine.jpg", "publishedAt": "2022-08-21T17:12:42Z", "content": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, an… [+2373 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": "Peter Griffin", "title": "Death of the password: Your fingers and eyes are the future of digital security - New Zealand Herald", "description": "Listener: New technology set to solve one of the biggest weaknesses in digital security.", "url": "https://www.nzherald.co.nz/business/death-of-the-password-your-fingers-and-eyes-are-the-future-of-digital-security/RFAGA2TOHWTRIDCQ3GYDTGYZTM/", "urlToImage": "https://www.nzherald.co.nz/resizer/8fdtc7H51DptoR-hxZwsM7aDPGc=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/3BSKF3GBIVVECKUPTUP5XUFNRI.jpg", "publishedAt": "2022-08-21T17:00:00Z", "content": "Fingerprint and facial recognition features could help avoid password hacking. Photo / 123RFFingerprint scanning and facial recognition are set to solve one of the biggest weaknesses in digital secur… [+3999 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "SpaceX Dragon Splashes Down With Scientific Cargo for Analysis - SciTechDaily", "description": "SpaceX’s uncrewed Dragon cargo spacecraft splashed down at 2:53 p.m. EDT (11:53 a.m. PDT) Saturday, August 20, north of Cape Canaveral off the Florida coast, marking the return of the company’s 25th contracted cargo resupply mission to the International Space…", "url": "https://scitechdaily.com/spacex-dragon-splashes-down-with-scientific-cargo-for-analysis/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Dragon-Resupply-Ship-Approaches-Space-Station-July-2022-scaled.jpg", "publishedAt": "2022-08-21T10:31:04Z", "content": "ByNASAAugust 21, 2022\r\nThe SpaceX Dragon resupply ship carrying over 5,800 pounds of new science experiments and crew supplies, pictured from a window on the SpaceX Dragon Freedom crew ship, approach… [+3626 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harvard Researchers Discover Global Warming Spawned the Age of Reptiles - SciTechDaily", "description": "Harvard researchers find rapid evolution of reptiles was triggered by nearly 60 million years of global warming and climate change. Researchers can explore the impact of environmental crises on organismal evolution by studying climate change-induced mass exti…", "url": "https://scitechdaily.com/harvard-researchers-discover-global-warming-spawned-the-age-of-reptiles/", "urlToImage": "https://scitechdaily.com/images/Reptile-Adaptive-Radiation-Reconstruction-scaled.jpg", "publishedAt": "2022-08-21T03:44:46Z", "content": "ByHarvard University, Department of Organismic and Evolutionary BiologyAugust 20, 2022\r\nArtistic reconstruction of the reptile adaptive radiation in a terrestrial ecosystem during the warmest period … [+9771 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Selects Mission Proposals to Study Stellar Explosions, Galaxies & Stars - SciTechDaily", "description": "Four mission proposals submitted to NASA’s Explorers Program have been selected for further study. The proposals include missions that would study exploding stars, distant clusters of galaxies, as well as nearby galaxies and stars. Two Explorer Missions of Op…", "url": "https://scitechdaily.com/nasa-selects-mission-proposals-to-study-stellar-explosions-galaxies-stars/", "urlToImage": "https://scitechdaily.com/images/Supernova-Explosion-Nebula.gif", "publishedAt": "2022-08-20T20:14:03Z", "content": "ByNASAAugust 20, 2022\r\nAnimation showing the formation of a supernova remnant.\r\nFour mission proposals submitted to NASA\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA)… [+2664 chars]"}]}