{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "James Webb Telescope looks back in time, finds oldest organic molecules ever seen - HT Tech", "description": "These chemicals were found within a galaxy that originated when the universe was approximately 10% of its present age.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-telescope-looks-back-in-time-finds-oldest-organic-molecules-ever-seen-71686062592623.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/06/1600x900/webb-space-telescope_1686063078472_1686063088349.jpg", "publishedAt": "2023-06-06T14:54:03Z", "content": "A groundbreaking study led by astronomers from Texas A&amp;M University using NASA's James Webb Space Telescope (JWST) has unveiled the existence of the oldest known complex organic molecules in the … [+2813 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Christine Hall", "title": "Apple WWDC 2023: Everything announced from the Apple Vision Pro to iOS 17, MacBook Air and more - TechCrunch", "description": "The TechCrunch team was on the ground in Cupertino for Apple's WWDC 2023 keynote. Here are the biggest announcements in an easy-to-skim digest.", "url": "https://techcrunch.com/2023/06/06/apple-wwdc-2023-everything-announced-so-far-including-ios-17-macbook-air-and-more/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/wwdc-2023-cook-rainbow-1.jpg?resize=1200,675", "publishedAt": "2023-06-06T14:03:45Z", "content": "Yesterday was Apple’s WWDC 2023 keynote. Each year Apple kicks off its Worldwide Developer Conference with a few hours of just straight announcements, generally covering things from OS to watchOS to … [+10312 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Power of Exercise: Countering High Genetic Risk of Type 2 Diabetes - SciTechDaily", "description": "Can physical activity ‘fight off’ risk of type 2 diabetes? A University of Sydney study suggests high levels of physical activity can significantly lower the risk of developing type 2 diabetes, even for those with a high genetic risk. Over an hour of daily mo…", "url": "https://scitechdaily.com/?p=284104", "urlToImage": "https://scitechdaily.com/images/Health-Fitness-Painting.jpg", "publishedAt": "2023-06-06T13:42:18Z", "content": "ByUniversity of SydneyJune 6, 2023\r\nA new study has found a strong correlation between high levels of physical activity and a decreased risk of type 2 diabetes, even among individuals with a high gen… [+5754 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Here are the iOS 17 features Apple didn’t announce on stage - TechCrunch", "description": "Apple’s Vision Pro headset dominated the headlines at the Worldwide Developer Conference (WWDC) event on Monday. But Apple is also going to launch a major update to iOS later this year. The upcoming iOS 17 update will introduce many “nice-to-have” features li…", "url": "https://techcrunch.com/2023/06/06/here-are-the-ios-17-features-apple-didnt-announce-on-stage/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/Screenshot-2023-06-06-at-5.30.25-PM.jpg?resize=1200,611", "publishedAt": "2023-06-06T13:30:00Z", "content": "Apple’s Vision Pro headset dominated the headlines at the Worldwide Developer Conference (WWDC) event on Monday. But Apple is also going to launch a major update to iOS later this year. The upcoming … [+4893 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Smoke Signals: James Webb Telescope Discovers Organic Molecules in Distant Galaxy - SciTechDaily", "description": "Astronomers have found complex organic molecules in a galaxy more than 12 billion light-years away from Earth. Using NASA’s James Webb Space Telescope, an international team of astronomers detected complex organic molecules, akin to Earth's smoke, soot, and s…", "url": "https://scitechdaily.com/cosmic-smoke-signals-james-webb-telescope-discovers-organic-molecules-in-distant-galaxy/", "urlToImage": "https://scitechdaily.com/images/Complex-Organic-Molecules-Galaxy.jpg", "publishedAt": "2023-06-06T08:21:37Z", "content": "ByTexas A&amp;M UniversityJune 6, 2023\r\nAstronomers using the Webb telescope discovered evidence of complex organic molecules similar to smoke or smog in the distant galaxy shown here. The galaxy, mo… [+9306 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "New Testing Method Enables Better Diagnosis of Male Infertility - Technology Networks", "description": "Scientists have shown that desirable agronomic traits of shorter stem length and early maturity can be introduced into black rice, which is known to be more nutritious than white rice.", "url": "https://www.technologynetworks.com/applied-sciences/news/pigmented-rice-enhancements-could-help-to-combat-malnutrition-374284", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374284/pigmented-rice-enhancements-could-help-to-combat-malnutrition-374284-640x360.jpg?cb=20230606", "publishedAt": "2023-06-06T08:20:49Z", "content": "Pigmented rice is known to be much more nutritious than white rice and could be an important resource to improve human health and combat malnutrition. However, improved yield and agronomic traits are… [+3395 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Potentially Hazardous 1500-foot asteroid hurtling towards Earth at fearsome pace! - HT Tech", "description": "NASA has issued an alert that a bridge-sized asteroid is on course to approach Earth soon! Check out its speed, distance, and other details, as revealed by the space agency.", "url": "https://tech.hindustantimes.com/tech/news/potentially-hazardous-1500-foot-asteroid-hurtling-towards-earth-at-fearsome-pace-71686026534327.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/06/1600x900/space-1728186_640_1685508037976_1686026611347.jpg", "publishedAt": "2023-06-06T04:43:56Z", "content": "NASA uses telescopes, such as Pans-STARRS1 in Maui, Hawaii, and Catalina Sky Survey near Tucson, Arizona, to detect near-Earth objects like asteroids and comets. To collect accurate information about… [+2154 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "The 'breath' between atoms is a key building block for quantum technology - Tech Explorist", "description": "Vibration between two layers of atoms can be used to engineer quantum technologies.", "url": "https://www.techexplorist.com/breath-atoms-key-building-block-quantum-technology/61356/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/06/Onpage-quantum-emitters-illustration.jpg", "publishedAt": "2023-06-05T10:33:05Z", "content": "A team led by UW ECE and Physics Professor Mo Li discovered a technique to use the “breathing” between two layers of atoms, creating a new building block for quantum technologies. \r\nBreathing is a pr… [+6056 chars]"}]}