{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Decoding Deep Space Mysteries: Researchers Uncover Potential Link Between Two of Astronomy's Most Enigmatic Phenomena - SciTechDaily", "description": "An international group of researchers has identified a potential link between gravitational waves from neutron star mergers and fast radio bursts. This finding could enhance our comprehension of the mechanisms behind certain deep-space burst phenomena. The my…", "url": "https://scitechdaily.com/?p=284622", "urlToImage": "https://scitechdaily.com/images/Gravitational-Waves-Illustration.jpg", "publishedAt": "2023-06-13T19:15:06Z", "content": "ByUniversity of Nevada, Las VegasJune 13, 2023\r\nAn international research team has found a potential link between neutron star mergers and fast radio bursts (FRBs), two of the universes most enigmati… [+7051 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Megaplume of water vapor erupting on Enceladus caught by Webb Telescope - Ars Technica", "description": "Enceladus' rapid orbit and large geysers spread water widely near Saturn.", "url": "https://arstechnica.com/science/2023/06/megaplume-of-water-vapor-erupting-on-enceladus-caught-by-webb-telescope/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-1-760x380.png", "publishedAt": "2023-06-13T18:44:52Z", "content": "Enlarge/ A close up of Enceladus (inset) and a wide-field view of the geysers it creates.\r\n25 with \r\nEnceladus, a frozen moon orbiting Saturn, has caught the interest of scientists because of the plu… [+4808 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold, silver sell off as FOMC conclusion looms - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2023-06-13/Gold-silver-sell-off-as-FOMC-conclusion-looms.html", "urlToImage": "https://www.kitco.com/news/2023-06-13/images/goldchart_0613_pm.png", "publishedAt": "2023-06-13T17:12:00Z", "content": "(Kitco News) - Gold and silver prices are lower in midday dealings Tuesday, losing initial gains that were seen following a U.S. inflation report that came in very close to market expectations. Posit… [+2544 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "YouTube is lowering the barrier to be eligible for its monetization program - TechCrunch", "description": "YouTube is lowering the requirements for creators to get access to monetization tools under the YouTube Partner Program (YPP).", "url": "https://techcrunch.com/2023/06/13/youtube-is-lowering-the-barrier-to-be-eligible-for-its-monetization-program/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/02/alexander-shatov-niUkImZcSP8-unsplash.jpg?resize=1200,900", "publishedAt": "2023-06-13T13:01:50Z", "content": "YouTube is lowering the requirements for creators to get access to monetization tools under the YouTube Partner Program (YPP). The company is expanding its shopping affiliate program to U.S.-based cr… [+2585 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14, iPhone 14 Pro, iPhone 14 Plus get huge discounts as Amazon's Apple Day sale goes live - HT Tech", "description": "Good news for Apple fans. If you were looking for price cuts to be announced on iPhone 14, iPhone 14 Pro, iPhone 14 Plus and more, then your wait is over as Amazon’s Apple day sale has gone live", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-iphone-14-pro-iphone-14-plus-get-huge-discounts-as-amazons-apple-day-sale-goes-live-71686659104716.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/APPLE-FAR-OUT-51_1669476928393_1669476928393_1686659362688.jpg", "publishedAt": "2023-06-13T12:32:17Z", "content": "Amazon has just announced its most awaited Apple days sale. Notably, it is rolling out amazing discounts on a number of iPhones. The sale is on and will go on for a week. If you are an Apple fan, gra… [+1290 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do Some Species Survive Mass Extinctions? Hidden “Whole Genome Duplication” May Be the Secret - SciTechDaily", "description": "Geneticists have made a significant discovery about the ancient history of sturgeons and paddlefish, which carries profound implications for our understanding of evolution. They identified a previously hidden instance of \"whole genome duplication\" (WGD) in th…", "url": "https://scitechdaily.com/?p=283315", "urlToImage": "https://scitechdaily.com/images/Abstract-Genetic-Sequencing-Fail.jpg", "publishedAt": "2023-06-13T10:12:28Z", "content": "ByTrinity College DublinJune 13, 2023\r\nGeneticists discovered a past whole genome duplication (WGD) event in the common ancestor of sturgeons and paddlefish that occurred just before a significant ma… [+4344 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "450-foot asteroid, bigger than the Statue of Liberty, rushing towards Earth at fearsome speed - HT Tech", "description": "NASA has revealed key details about a mammoth asteroid that is set to make its closest approach to Earth. Know its speed, size, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/450foot-asteroid-statue-of-liberty-earth-nasa-speed-54272-kmph-71686630599977.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/13/1600x900/orbit-viewer-snapshot_1686630862332_1686630865898.jpg", "publishedAt": "2023-06-13T04:35:01Z", "content": "Located at JPL, the Center for Near-Earth Object Studies (CNEOS) works alongside the Planetary Defense Coordination Office at NASA Headquarters in Washington to characterize the orbits of near-Earth … [+1834 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover BEBOP-1c: Tatooine-Like Exoplanet Orbits Twin Stars in a Multiplanetary System - SciTechDaily", "description": "An international team of astronomers has announced the second-ever discovery of a multiplanetary circumbinary system. Astronomers at the University of Birmingham have discovered a second planet, named BEBOP-1c, in the rare multiplanetary circumbinary system B…", "url": "https://scitechdaily.com/?p=285657", "urlToImage": "https://scitechdaily.com/images/Planet-With-Two-Suns-Illustration.jpg", "publishedAt": "2023-06-13T03:03:38Z", "content": "ByUniversity of BirminghamJune 12, 2023\r\nAn international team of astronomers has announced the discovery of a second planet in a rare multiplanetary circumbinary system, known as BEBOP-1 or TOI-1338… [+8442 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Quantum Physics: New Visualization Technique Gives Insight Into Photosynthesis - SciTechDaily", "description": "Researchers have developed coherence maps, a technique to visualize quantum mechanics and understand the mechanisms underpinning photosynthesis. The maps elucidate the complex energy transfer process in photosynthesizing bacteria, providing a clear picture of…", "url": "https://scitechdaily.com/harnessing-quantum-physics-new-visualization-technique-gives-insight-into-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-06-12T23:06:14Z", "content": "ByUniversity of Illinois Grainger College of EngineeringJune 12, 2023\r\nScientists have developed an illustrative method called coherence maps to elucidate quantum phenomena. They used these maps to g… [+4561 chars]"}]}