{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb's Galactic Surprise: Reveals Rocky Planet Secrets in Cosmic Extremes - SciTechDaily", "description": "Astronomers find a range of molecules that are among the building blocks for rocky planets. Space is a harsh environment, but some areas are even harsher than others. A star-forming region, known as the Lobster Nebula, is host to some of the most massive star…", "url": "https://scitechdaily.com/webbs-galactic-surprise-reveals-rocky-planet-secrets-in-cosmic-extremes/", "urlToImage": "https://scitechdaily.com/images/Rocky-Planet-Forming-Extreme-Environment.jpg", "publishedAt": "2023-12-01T13:40:48Z", "content": "Astronomers using the James Webb Space Telescope have observed water and molecules essential for rocky planet formation in a highly irradiated area of the Lobster Nebula. This discovery, part of the … [+6622 chars]"}, {"source": {"id": null, "name": "Investor's Business Daily"}, "author": "Investor's Business Daily", "title": "Dow Jones Futures Rise; Tesla Falls On Cybertruck Details But These Techs Soar - Investor's Business Daily", "description": null, "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-futures-rise-tesla-falls-on-cybertruck-details/", "urlToImage": null, "publishedAt": "2023-12-01T12:42:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Medical Marvel: Human Cells Transformed Into Tiny Biological Robots - SciTechDaily", "description": "The multicellular bots move around and help heal “wounds” created in cultured neurons. Researchers at Tufts University and Harvard University’s Wyss Institute have created tiny biological robots that they call Anthrobots from human tracheal cells that can mov…", "url": "https://scitechdaily.com/medical-marvel-human-cells-transformed-into-tiny-biological-robots/", "urlToImage": "https://scitechdaily.com/images/Anthrobot.jpg", "publishedAt": "2023-12-01T09:29:36Z", "content": "An Anthrobot is shown, depth colored, with a corona of cilia that provides locomotion for the bot. Credit: Gizem Gumuskaya, Tufts University\r\nThe multicellular bots move around and help heal “wounds”… [+10372 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NISAR mission to astronauts, check out the projects NASA and ISRO are working on - HT Tech", "description": "During his visit to the White House, Prime Minister Narendra Modi announced NASA collaboration on various Space exploration programs with ISRO.", "url": "https://tech.hindustantimes.com/tech/news/nisar-mission-to-astronauts-check-out-the-projects-nasa-and-isro-are-working-on-71701419517426.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/01/1600x900/PTI11-29-2023-000282A-0_1701419595863_1701419618422.jpg", "publishedAt": "2023-12-01T08:41:40Z", "content": "India and the United States are set to embark on a groundbreaking collaboration in space exploration, marking a significant milestone in their space partnership. The announcement came after NASA Chie… [+2416 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Tata Technologies share price: Profit booking triggers. Experts list out 5 reasons to avoid buying rush | Mint - Mint", "description": "Tata Technologies share price: Due to narrow down in valuation gap against peers, newly listed Tata group shares have limited upside possibility, say experts", "url": "https://www.livemint.com/market/stock-market-news/tata-technologies-share-price-profit-booking-triggers-experts-list-out-5-reasons-to-avoid-buying-rush-11701413811177.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/01/1600x900/Tata_Technologies_share_price_stock_market_today_1701414022472_1701414022765.JPG", "publishedAt": "2023-12-01T07:08:36Z", "content": "Tata Technologies share price: After strong debut on Dalal Street, shares of Tata Technologies Ltd witnessed some profit booking during early morning session on Friday. Tata Technologies share price … [+3423 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Towering Inferno: Mount Erebus' Dramatic Emergence From the Antarctic Clouds - SciTechDaily", "description": "The fiery and icy upper reaches of the Antarctic volcano pierced through a canopy of clouds. On a late spring day in 2023, the summit crater of Mount Erebus, the world's southernmost active volcano, emerged majestically above the clouds. Captured by Landsat 9…", "url": "https://scitechdaily.com/the-towering-inferno-mount-erebus-dramatic-emergence-from-the-antarctic-clouds/", "urlToImage": "https://scitechdaily.com/images/Mount-Erebus-Breaks-Through.jpg", "publishedAt": "2023-11-29T18:13:39Z", "content": "Satellite view of the summit crater of Mount Erebus on November 25, 2023, captured by the Operational Land Imager-2 on Landsat 9.\r\nThe fiery and icy upper reaches of the Antarctic volcano pierced thr… [+1874 chars]"}]}