{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Meteorites That Helped Form Earth May Have Originated in the Outer Solar System - SciTechDaily", "description": "Evidence suggests surface minerals of outer main-belt asteroids, proposed to have sourced building blocks of Earth's water and life, are only stable at low temperatures. These asteroids formed in distant orbits and may help explain Earth's composition. Our So…", "url": "https://scitechdaily.com/meteorites-that-helped-form-earth-may-have-originated-in-the-outer-solar-system/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Belt-Artists-Illustration-scaled.jpg", "publishedAt": "2022-03-15T11:31:57Z", "content": "An artist’s illustration of the asteroid belt. Credit: NASA/JPL-Caltech\r\nEvidence suggests surface minerals of outer main-belt asteroids, proposed to have sourced building blocks of Earth’s water and… [+7356 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Scientists replicated conditions that exist within galaxy clusters - Tech Explorist", "description": "Tracing the evolution of galaxy clusters.", "url": "https://www.techexplorist.com/scientists-replicated-conditions-exist-within-galaxy-clusters/45351/", "urlToImage": "https://cdn.techexplorist.com/wp-content/uploads/2022/03/galaxy-cluster.jpg", "publishedAt": "2022-03-15T11:15:03Z", "content": "Hercules-Corona Borealis Great Wall is a supercluster of galaxies, measuring approximately 10 billion light-years in length. In 2013, astronomers who discovered it suggested that the cluster is the l… [+3037 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Mega Moon Rocket Is Ready To Roll: Watch the Artemis I Rollout Trailer - SciTechDaily", "description": "Twin solid rocket boosters that will produce a combined 7.2 million pounds of thrust at liftoff, a towering core stage, and the only human-rated spacecraft in the world capable of deep-space travel – together, NASA’s Space Launch System rocket and Orion space…", "url": "https://scitechdaily.com/nasas-mega-moon-rocket-is-ready-to-roll-watch-the-artemis-i-rollout-trailer/", "urlToImage": "https://scitechdaily.com/images/SLS-in-Block-1-Cargo-Configuration-Inside-VAB.jpg", "publishedAt": "2022-03-15T10:25:48Z", "content": "This illustration shows NASA’s Space Launch System (SLS) in its Block 1 configuration inside the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida. From top to bottom, the entire ro… [+1797 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Use 196 Lasers To Recreate the Conditions Inside Gigantic Galaxy Clusters – “One of the Most Awe-Inspiring Things in the Universe” - SciTechDaily", "description": "Experiments point the way to solving mystery that keeps clusters hot. Galaxies rarely live alone. Instead, dozens to thousands are drawn together by gravity, forming vast clusters that are the largest objects in the universe. “Galaxy clusters are one of the m…", "url": "https://scitechdaily.com/scientists-use-196-lasers-to-recreate-the-conditions-inside-gigantic-galaxy-clusters-one-of-the-most-awe-inspiring-things-in-the-universe/", "urlToImage": "https://scitechdaily.com/images/196-Lasers-Experiment-Computer-Simulation.jpg", "publishedAt": "2022-03-15T09:21:46Z", "content": "A technician works at the National Ignition Facility. Scientists used the array of 196 lasers to create conditions similar to the hot gas inside gigantic galaxy clusters.\r\nExperiments point the way t… [+6537 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Elevated Inflammation Persists in Immune Cells Months After Mild COVID-19 - Technology Networks", "description": "A new study demonstrates that macrophages show altered inflammatory and metabolic expression several months after mild COVID-19.", "url": "https://www.technologynetworks.com/cell-science/news/elevated-inflammation-persists-in-immune-cells-months-after-mild-covid-19-359554", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359554/elevated-inflammation-persists-in-immune-cells-months-after-mild-covid-19-359554-640x360.jpg?cb=20220315", "publishedAt": "2022-03-15T08:52:14Z", "content": "There is a lack of understanding as to why some people suffer from long-lasting symptoms after COVID-19 infection. A new study from Karolinska Institutet in Sweden, the Helmholtz Center Munich (HMGU)… [+3946 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s state of disaster extended as it passes the two-year mark - BusinessTech", "description": "Cooperative Governance and Traditional Affairs minister Nkosazana Dlamini-Zuma has extended South Africa’s national state of disaster by a further month.", "url": "https://businesstech.co.za/news/trending/568246/government-extends-south-africas-state-of-disaster-as-it-passes-the-two-year-mark/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/PresidentRamaphosa.jpg", "publishedAt": "2022-03-15T07:46:32Z", "content": "Cooperative Governance and Traditional Affairs minister Nkosazana Dlamini-Zuma has extended South Africas national state of disaster by a further month.\r\nThe state of disaster is now set to expire on… [+2030 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Gareth Beavis", "title": "Huge iPhone 14 leak lays bare many things we hoped wouldn't happen - TechRadar", "description": "The notch could go, there’s a chip split… it’s on for 2022", "url": "https://www.techradar.com/news/iphone-14-satellite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/uwZK6P9RBgt6aSSzRspPXg-1200-80.jpg", "publishedAt": "2022-03-15T07:18:35Z", "content": "If you don’t like spoilers, look away now: a large outpouring of information has occurred around the forthcoming iPhone 14 line-up.\r\n9to5Mac is reporting (and the site has a pretty good track record … [+4685 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Stocks fall as Hong Kong hammered again, oil retreats - news.com.au", "description": "<p>Equity markets fell Tuesday, with Hong Kong tech firms leading another collapse in the city's Hang Seng Index following the Covid-19 shutdown of tech hub Shenzhen and worries over Russia's military outreach to China.</p>", "url": "https://www.news.com.au/breaking-news/asian-markets-struggle-as-hong-kong-dives-again-oil-retreats/news-story/f1c2890f16e16a2eff73efe27c2bebfd", "urlToImage": "https://content.api.news/v3/images/bin/c89180305189b05c8b8c2a0814501753", "publishedAt": "2022-03-15T07:07:30Z", "content": "Concerns about China's economic outlook saw oil prices suffer fresh selling pressureEquity markets fell Tuesday, with Hong Kong tech firms leading another collapse in the city's Hang Seng Index follo… [+724 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The Gauteng health department shrugs off billions owed to suppliers; uncertainty persists over South Africa’s state of disaster and the latest unemployment figures; and the JSA has found Dali Mpofu guilty of violating its ethics rules by telling a fellow advo…", "url": "https://businesstech.co.za/news/government/568090/5-important-things-happening-in-south-africa-today-1240/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Nkosazana-Dlamini-Zuma-South-African-Minister-of-Cooperative-Governance-and-Traditional-Affairs-12.jpg", "publishedAt": "2022-03-15T06:37:39Z", "content": "Heres what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been no new Covid-19 deaths, taking the total reported to 99,725. The country has 18,112 active … [+2476 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Facebook to be prosecuted in South Africa - BusinessTech", "description": "The Competition Commission has referred to the Competition Tribunal for the prosecution of the social media giant, Meta Platforms, and its subsidiaries, WhatsApp Inc and Facebook South Africa for abuse of dominance.", "url": "https://businesstech.co.za/news/internet/568088/facebook-to-be-prosecuted-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/08/Facebook1-e1598529481824.jpg", "publishedAt": "2022-03-15T05:31:24Z", "content": "The Competition Commission has referred to the Competition Tribunal for the prosecution of the social media giant, Meta Platforms, and its subsidiaries, WhatsApp Inc and Facebook South Africa for abu… [+5303 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid found just 2 hours before COLLIDING with Earth! See what happened after that - HT Tech", "description": "Asteroid 2022 EB5 was discovered just two hours before it hit Earth. Know what happened after that, and whether it caused any damage.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-found-just-2-hours-before-colliding-with-earth-see-what-happened-after-that-71647317951281.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/15/1600x900/asteroid-4145080_1920_1646293428986_1647318055639.jpg", "publishedAt": "2022-03-15T04:22:28Z", "content": "Asteroids are dangerous big rocks that float through space and could take out civilisations, if the size is big enough. On a regular basis, Earth keeps getting visited by massive rocks that pass too … [+2102 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Great Oxygenation Event: MIT Scientists’ New Hypothesis for One of the Grand Mysteries of Science - SciTechDaily", "description": "Microbes and Minerals May Have Set Off Earth’s Oxygenation Scientists propose a new mechanism by which oxygen may have first built up in the atmosphere. For the first 2 billion years of Earth’s history, there was barely any oxygen in the air. While some micro…", "url": "https://scitechdaily.com/great-oxygenation-event-mit-scientists-new-hypothesis-for-one-of-the-grand-mysteries-of-science/", "urlToImage": "https://scitechdaily.com/images/Paleoproterozoic-Organisms.jpg", "publishedAt": "2022-03-15T03:27:44Z", "content": "Around 2.3 billion years ago, oxygen began building up in the atmosphere, eventually reaching the life-sustaining levels we breathe today. A new hypothesis proposed by MIT scientists suggests a mecha… [+6178 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Tech News | No More Out-of-order Timeline on Twitter - LatestLY", "description": "Get latest articles and stories on Tech at LatestLY. After facing people's criticism for switching Twitter from its chronological timeline to a new feed that shows suggested tweets instead, the company has finally rolled back the update.", "url": "https://www.latestly.com/agency-news/tech-news-no-more-out-of-order-timeline-on-twitter-3473819.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg", "publishedAt": "2022-03-15T01:30:24Z", "content": "Washington [US], March 15 (ANI): After facing people's criticism for switching Twitter from its chronological timeline to a new feed that shows suggested tweets instead, the company has finally rolle… [+1352 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Swati Bhasin", "title": "Ministers brief parliament today on Ukraine, missile misfire into Pak: 10 points - Hindustan Times", "description": "Budget session: Last week, India had said the incident happened due to \"technical malfunction\". | Latest News India", "url": "https://www.hindustantimes.com/india-news/rajnath-singh-to-address-parliament-on-accidental-fired-missile-into-pakistan-101647304463658.html", "urlToImage": "https://images.hindustantimes.com/img/2022/03/15/1600x900/PTI03-14-2022-000134A-0_1647304566014_1647304576137.jpg", "publishedAt": "2022-03-15T00:38:53Z", "content": "Defence minister Rajnath Singh will address the parliament on Tuesday on a missile 'accidentally fired' into Pakistan earlier this month. The statement comes as the second phase of the budget session… [+2485 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Jane Moore", "title": "Coronavirus: 11,975 new PCR confirmed-cases and 19,915 positive antigen tests reported since Friday - TheJournal.ie", "description": "The HPSC said the PCR positive tests from yesterday are “artificially low” due to a technical issue.", "url": "https://www.thejournal.ie/covid-19-coronavirus-latest-figures-ireland-6-5710739-Mar2022/", "urlToImage": "https://img2.thejournal.ie/article/5710739/river/?height=400&version=5710774", "publishedAt": "2022-03-14T15:41:00Z", "content": "PUBLIC HEALTH OFFICIALS have reported an additional 2,100 positive PCR cases of Covid-19 in Ireland in the past 24 hours.\r\nThe Health Protection Surveillance Centre (HPSC) also reported 5,475 PCR-con… [+1638 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Unvaccinated South Africans face higher insurance premiums - BusinessTech", "description": "Data published by the Association for Savings and Investment South Africa (Asisa) shows a big increase in Covid-related deaths in South Africa, with unvaccinated citizens likely to pay more for insurance going forward.", "url": "https://businesstech.co.za/news/finance/567820/unvaccinated-south-africans-face-higher-insurance-premiums/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/05/CapeTownLockdown-e1589784999789.jpg", "publishedAt": "2022-03-14T11:24:58Z", "content": "Data published by the Association for Savings and Investment South Africa (Asisa) shows a big increase in Covid-related deaths in South Africa over the last year, with insurance companies likely to p… [+3512 chars]"}, {"source": {"id": null, "name": "eNCA"}, "author": null, "title": "Chinese cities and factories lock down as outbreak spreads - eNCA", "description": "All 17 million people in the Chinese tech hub of Shenzhen began their first full day under lockdown Monday, as restrictions spread across Shanghai and other major cities to combat an outbreak challenging the nation's zero-tolerance Covid strategy.", "url": "https://www.enca.com/news/chinese-cities-and-factories-lock-down-outbreak-spreads", "urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/afp/2022-03/doc-326478N-%40photo1.jpg?h=4bf1c8f5&itok=N2FDO8Sa", "publishedAt": "2022-03-14T11:05:36Z", "content": "In Shanghai, China's most populous city, residential areas and offices in some neighbourhoods remained sealed Monday as city authorities try to avoid a full lockdown.\r\nThe metropolis reported around … [+1959 chars]"}]}