{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Jerome Powell's testimony could lay the groundwork for a sell-off in tech, says Deepwater's Munster - CNBC Television", "description": "Gene Munster, managing partner at Deepwater Asset Management, joins 'Squawk Box' to discuss what happens to tech stocks if Jerome Powell is hawkish in his up...", "url": "https://www.youtube.com/watch?v=0983mRMjr8k", "urlToImage": "https://i.ytimg.com/vi/0983mRMjr8k/maxresdefault.jpg", "publishedAt": "2023-03-06T15:00:03Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Worm Moon AKA Death Moon - SciTechDaily", "description": "The Next full moon is the Crow, Crust, Sap, Sugar, or Worm Moon; the Lenten, Chaste, or Death Moon, the full moon of Purim; the full moon of Holi; Māgha Pūjā and Medin Poya; Mid-Sha'ban; and the Pothole Moon. The next full moon will be Tuesday morning, March …", "url": "https://scitechdaily.com/?p=258400", "urlToImage": "https://scitechdaily.com/images/Full-Moon-Over-Mountains.jpg", "publishedAt": "2023-03-06T13:38:32Z", "content": "ByGordon Johnston, NASAMarch 6, 2023\r\nThe next full moon has many names including Crow, Crust, Sap, Sugar, Worm, or Death Moon. Southern Native American tribes called it the Worm Moon because earthwo… [+25426 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Organoid Intelligence” – Revolutionary Biocomputers Powered by Human Brain Cells - SciTechDaily", "description": "Despite AI’s impressive track record, its computational power pales in comparison with a human brain. Now, scientists unveil a revolutionary path to drive computing forward: organoid intelligence, where lab-grown brain organoids act as biological hardware. Ar…", "url": "https://scitechdaily.com/organoid-intelligence-revolutionary-biocomputers-powered-by-human-brain-cells/", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-Neural-Network-Concept-Art.jpg", "publishedAt": "2023-03-06T09:17:34Z", "content": "Scientists are collaborating across multiple fields to create biocomputers that utilize three-dimensional cultures of brain cells, called brain organoids, as biological hardware. They have outlined t… [+4852 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Surprises: Hubble Captures Stunning Movie of DART Asteroid Impact Debris - SciTechDaily", "description": "Never-Before-Seen Spacecraft Collision Yields Unexpected Surprises In 2022 NASA embarked on a bold experiment to see if they could change an asteroid's velocity by smacking it with a ballistic probe – kind of like hitting it with a hammer. This experiment was…", "url": "https://scitechdaily.com/?p=258169", "urlToImage": "https://scitechdaily.com/images/NASA-DART-Spacecraft-Prior-to-Impact-scaled.jpg", "publishedAt": "2023-03-05T21:15:37Z", "content": "BySpace Telescope Science InstituteMarch 5, 2023\r\nThis illustration depicts NASAs Double Asteroid Redirection Test (DART) spacecraft prior to impact at the Didymos binary asteroid system. Credit: NAS… [+11307 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 5 March 2023: Spectacular meeting of Venus and Jupiter - HT Tech", "description": "NASA Astronomy Picture of the Day is depicting two bright planets in the sky. These are none other than the rare Venus and Jupiter conjunction.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-5-march-2023-spectacular-meeting-of-venus-and-jupiter-71678006757089.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/05/1600x900/VenusJupiterSky_Tumino_1080_annotated_1678006774166_1678006781296_1678006781296.jpg", "publishedAt": "2023-03-05T09:01:10Z", "content": "The world is not yet done talking about the rare meeting of two planets in our solar system in the night sky! Almost on a daily basis, you can find new photos released on the internet of the Venus-Ju… [+1815 chars]"}]}