{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "China's Zhurong Mars Rover Finds Evidence of Water in Martian Sand Dunes - SciTechDaily", "description": "The Zhurong rover, part of China's Tianwen-1 Mars mission, has found evidence of liquid water at low Martian latitudes, indicating potentially habitable environments. This discovery, contradicting previous beliefs that water could only exist in solid or gaseo…", "url": "https://scitechdaily.com/?p=272933", "urlToImage": "https://scitechdaily.com/images/Zhurong-Mars-Rover-Selfie.jpg", "publishedAt": "2023-04-30T02:02:54Z", "content": "ByChinese Academy of SciencesApril 29, 2023\r\nA selfie taken by the Zhurong rover alongside its landing platform, captured with a wireless camera. Credit: Chinese National Space Administration\r\nThe Zh… [+6523 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for April 30: Collect latest rewards this way - HT Tech", "description": "Garena Free Fire MAX players have the opportunity to participate in latest events and grab rewards along with freebies today. Check details here.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-april-30-collect-latest-rewards-this-way-71682815746657.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/30/1600x900/005_1627814162698_1682816079116.jpg", "publishedAt": "2023-04-30T00:55:18Z", "content": "Garena Free Fire MAX redeem codes for April 30, 2023: How many freebies and rewards have you collected by using the redeem codes and participating in the events? You have an opportunity to grab more!… [+2491 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Surprising Consequence of a High-Fat Diet During Pregnancy - SciTechDaily", "description": "It's common knowledge that maintaining a healthy diet is important, particularly during pregnancy. Consuming a high-fat diet can have severe impacts on metabolism, increasing the risk of obesity, diabetes, liver disease, and even cancer. Studies have shown th…", "url": "https://scitechdaily.com/scientists-discover-surprising-consequence-of-a-high-fat-diet-during-pregnancy/", "urlToImage": "https://scitechdaily.com/images/Variety-Unhealthy-Junk-Food.jpg", "publishedAt": "2023-04-29T17:37:36Z", "content": "ByTokyo Medical and Dental UniversityApril 29, 2023\r\nA study by Tokyo Medical and Dental University reveals that offspring exposed to high-fat diets during gestation and early life exhibit a preferen… [+4455 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Divya", "title": "iOS 17 set to change Wallet and Health Apps on your iPhone - HT Tech", "description": "iOS 17 is expected to bring several important changes to Wallet and Health App on iPhones. What's coming? Read on.", "url": "https://tech.hindustantimes.com/tech/news/ios-17-set-to-change-wallet-and-health-apps-on-your-iphone-71682775957054.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/29/1600x900/iPhone_wallet_Unsplash_1682776222437_1682776236060.jpg", "publishedAt": "2023-04-29T13:51:58Z", "content": "Undoubtedly, from all that is being reported so far, iOS 17 is going to be one of the biggest updates for iPhone users for quite some time. Considering that iOS 17 was initially dismissed as being of… [+2134 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sticky Situation: Critical Antenna on ESA's Jupiter Icy Moons Explorer Fails To Deploy - SciTechDaily", "description": "ESA's Jupiter Icy Moons Explorer (Juice) has encountered a deployment issue with its Radar for Icy Moons Exploration (RIME) antenna. The issue, potentially caused by a stuck pin, is being addressed by ESA's mission control teams with various strategies, inclu…", "url": "https://scitechdaily.com/?p=272800", "urlToImage": "https://scitechdaily.com/images/Illustration-of-JUICE-Spacecraft-at-Jupiter-scaled.jpg", "publishedAt": "2023-04-29T12:07:15Z", "content": "ByEuropean Space Agency (ESA)April 29, 2023\r\nIllustration of the JUICE spacecraft at Jupiter. The Radar for Icy Moons Exploration (RIME) antenna on ESAs Jupiter Icy Moons Explorer (Juice) spacecraft … [+4975 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Ruairi J Mackenzie", "title": "Women’s Gut Bacteria Linked to Emotional Regulation - Technology Networks", "description": "Innovative research has uncovered a connection between the gut microbiome and positive emotions like happiness, hopefulness and better emotional management skills.", "url": "https://www.technologynetworks.com/immunology/news/womens-gut-bacteria-linked-to-emotional-regulation-372775", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/372775/womens-gut-bacteria-linked-to-emotional-regulation-372775-640x360.jpg?cb=20230428", "publishedAt": "2023-04-28T14:22:58Z", "content": "Innovative research from Brigham and Women's Hospital and the Harvard T.H. Chan School of Public Health has uncovered a connection between the gut microbiome and positive emotions like happiness, hop… [+4789 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Cluster of asteroids approaching Earth TODAY! From 25 feet to 203 feet, check details - HT Tech", "description": "Cluster of asteroids approaching Earth TODAY From 25 feet to 203 feet check details 5 asteroids with sizes varying from 25 feet to 203 feet have been tracked by NASA approaching Earth. Asteroid 2023 HW1 It will make its extremely close approach to the planet …", "url": "https://tech.hindustantimes.com/web-stories/cluster-of-asteroids-approaching-earth-today-from-25-feet-to-203-feet-check-details-71682662912791.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/28/1600x900/asteroid-field-7646062_1280_1682663234265_1682663238471.jpg/", "publishedAt": "2023-04-28T06:31:58Z", "content": "Photo Credit: Pixabay\r\n 5 asteroids, with sizes varying from 25 feet to 203 feet have been tracked by NASA approaching Earth. \r\nPhoto Credit: Pixabay\r\n Asteroid 2023 HW1  It will make its extremely c… [+1453 chars]"}]}