{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "POLITICO.eu"}, "author": "Veronika Melkozerova", "title": "Ukraine successfully shoots down first Russian strategic bomber - POLITICO Europe", "description": "The Russian defense ministry said the bomber crashed as it was returning from a mission in Ukraine “due to technical malfunction.”", "url": "https://www.politico.eu/article/ukraine-strategic-bomber-russia-attack-missiles-drones/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2024/04/19/GettyImages-2113284461-scaled.jpg", "publishedAt": "2024-04-19T15:13:00Z", "content": "Ukraine's military intelligence said Ukrainians used the same means to down the bomber as were previously used to shoot down an A-50 surveillance plane over the Sea of Azov in January.\r\nThe Russian d… [+1258 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Manjiri Joshi, News Desk", "title": "‘Personal Reasons’: Karnataka Govt Reacts To Campus Killing Of First-Year MCA Student After Love Jihad Char - News18", "description": "Neha, a first-year MCA student at BVB College of Engineering and Technology in Hubballi and daughter of Hubballi Dharwad Municipal Corporation (HDMC) councillor Niranjan Hiremath, was stabbed to death by Fayaz, a dropout from the same institute whose advances…", "url": "https://www.news18.com/india/personal-reasons-karnataka-govt-reacts-to-campus-killing-of-first-year-student-after-love-jihad-charge-8858621.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/04/untitled-design-3-2024-04-6c9d738ce6217cb9237cb227d8199d53-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-04-19T13:55:09Z", "content": "Dismissing the political attack and claims of love jihad, Karnataka CM Siddaramaiah on Friday said the murder of daughter of a Congress corporator on a Hubballi college campus was due to personal rea… [+4480 chars]"}, {"source": {"id": null, "name": "TechNode"}, "author": "Jessie Wu", "title": "Huawei launches Pura 70 series equipped with Kirin 9010 chip · TechNode - TechNode", "description": "On Thursday, Huawei unveiled a letter on the Chinese X-like social media platform Weibo to announce the Pura 70 Series Pioneer Program, a scheme for people to purchase devices from its latest mobile phone series without holding a launch event.", "url": "http://technode.com/2024/04/19/huawei-launches-new-pura-70-series-phones-equipped-with-self-developed-kirin-9010-chip/", "urlToImage": "https://technode.com/wp-content/uploads/2024/04/huawei-pura.png", "publishedAt": "2024-04-19T10:48:04Z", "content": "Every Wednesday and Friday, TechNodes Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\r\nOn Thursday, Huawei unveiled a letter on the Chinese X-… [+4050 chars]"}]}