{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Israel-Hamas War: Elon Musk's Reply On 'Jewish Groups Push Hate Against Whites' Post Causes Uproar - Hindustan Times", "description": "Tech billionaire, Elon Musk has found himself in yet another controversy amid the Israel-Palestine war. Musk has been accused of agreeing to anti-Jewish post...", "url": "https://www.youtube.com/watch?v=0MPvQK0xSgo", "urlToImage": "https://i.ytimg.com/vi/0MPvQK0xSgo/maxresdefault.jpg", "publishedAt": "2023-11-17T11:45:39Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 asteroids to pass by Earth today, reveals NASA; Know speed, size, and more - HT Tech", "description": "NASA has predicted 5 asteroids to pass Earth by a close margin today, November 17. From size, and speed to distance of approach, know details, as per the space agency.", "url": "https://tech.hindustantimes.com/photos/5-asteroids-to-pass-by-earth-today-reveals-nasa-know-speed-size-and-more-71700213823661.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/17/1600x900/cosmos-7935452_640_1693191091193_1700213884266.jpg", "publishedAt": "2023-11-17T09:39:06Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "10 Million Miles Away: NASA Achieves Historic Data Exchange With Deep Space Optical Communications Experiment - SciTechDaily", "description": "DSOC, an experiment that could transform how spacecraft communicate, has achieved ‘first light,’ sending data via laser to and from far beyond the Moon for the first time. NASA’s Deep Space Optical Communications (DSOC) experiment has beamed a near-infrared l…", "url": "https://scitechdaily.com/?p=328960", "urlToImage": "https://scitechdaily.com/images/Deep-Space-Communication-With-Lasers.jpg", "publishedAt": "2023-11-17T09:23:16Z", "content": "ByJet Propulsion LaboratoryNovember 17, 2023\r\nNASAs DSOC experiment, aboard the Psyche spacecraft, has successfully demonstrated the farthest-ever optical communication using a near-infrared laser fr… [+11483 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Anand J", "title": "Fintechs may feel the heat as RBI moves to curb unsecured consumer loans - Moneycontrol", "description": "According to CIBIL, among those who took personal loans of less than Rs 50,000 in the first quarter of the current fiscal, half of them had more than four existing loans. For the same category, only 17 percent had more than four loans before Covid, indicating…", "url": "https://www.moneycontrol.com/news/business/startup/fintechs-may-feel-the-heat-as-rbi-moves-to-curb-unsecured-consumer-loans-11761041.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/10/PTI04_06_2023_000117B-709x435.jpg", "publishedAt": "2023-11-17T09:14:19Z", "content": "The Reserve Bank of Indias (RBIs) move to tighten norms for personal loans and credit cards by raising the capital that banks and non-banking financial companies (NBFCs) need to set aside for such bo… [+6567 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Vaccination Vacation: Measles Makes a Menacing Comeback - SciTechDaily", "description": "CDC warns that global measles threat continues to grow as another year passes with millions of children unvaccinated. Following years of declines in measles vaccination coverage, measles cases in 2022 have increased by 18%, and deaths have increased by 43% gl…", "url": "https://scitechdaily.com/?p=328883", "urlToImage": "https://scitechdaily.com/images/Global-Map-Infectious-Disease-Art-Concept.jpg", "publishedAt": "2023-11-17T03:15:18Z", "content": "Measles cases and deaths surged globally in 2022, with a significant increase in outbreaks across 37 countries. The WHO and CDC report attributes this rise to a decline in measles vaccination rates, … [+3566 chars]"}]}