{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "Systematic patterns of magnetic field and ionospheric currents traced in the Antarctica can help space weather studies - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/systematic-patterns-magnetic-field-and-ionospheric-currents-traced-antarctica-can-help-space-weather", "urlToImage": null, "publishedAt": "2024-01-15T11:54:54Z", "content": "Scientists have identified the systematic patterns of magnetic field and ionospheric currents in Antarctica and found that ionic currents are responsible for consistent magnetic field variations at b… [+1795 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "RBI issues draft framework for fintech industry SRO - The Economic Times", "description": "The main idea behind the guidelines is to empower the fledgling sector to function and innovate responsibly, even in the absence of formal regulations.", "url": "https://economictimes.indiatimes.com/tech/technology/rbi-issues-draft-framework-for-fintech-self-regulatory-body/articleshow/106866149.cms", "urlToImage": "https://img.etimg.com/thumb/msid-106866237,width-1200,height-630,imgsize-121034,overlay-ettech/photo.jpg", "publishedAt": "2024-01-15T11:13:23Z", "content": "The Reserve Bank of India has issued a draft framework for self-regulatory organisations focused on the fintech sector (SRO-FT).The main idea behind the guidelines is to empower the fledgling sector … [+3380 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sharyn Alfonsi, Aliza Chasan", "title": "Experimental Alzheimer's, drug addiction ultrasound trials helping patients | 60 Minutes - CBS News", "description": "New experimental treatments using ultrasound energy to target the brain are being tested to help people with Alzheimer's and those battling drug addiction. The pioneering neurosurgeon behind the technology spoke with 60 Minutes.", "url": "https://www.cbsnews.com/news/ultrasound-treatment-alzheimers-drug-addiction-patients-60-minutes/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/01/12/bf0c0d89-a781-4f05-941a-6532f8f4bf9f/thumbnail/1200x630/25aef4f5b13f8e65469655812f98f2aa/ellison-rezai-mri.jpg?v=50926e3bde2e7c9caafa13eb3f9693b5", "publishedAt": "2024-01-14T23:50:00Z", "content": "A man with Alzheimer's, knowing there's no cure for the disease, donned a million-dollar helmet for a cutting-edge treatment directing nearly a thousand beams of ultrasound energy at a target in his … [+8460 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Delayed Dreams: NASA's Artemis Moon Missions Rescheduled - SciTechDaily", "description": "Artemis Campaign Updates and Goals NASA announced on Tuesday significant updates to its Artemis campaign. These updates aim to lay the groundwork for long-term scientific exploration on the Moon. The program's ambitious goals include landing the first woman a…", "url": "https://scitechdaily.com/delayed-dreams-nasas-artemis-moon-missions-rescheduled/", "urlToImage": "https://scitechdaily.com/images/Orion-Spacecraft-Over-Moon-Beyond-Earth.jpg", "publishedAt": "2024-01-14T14:02:59Z", "content": "Artemis II builds on the success of the uncrewed Artemis I in 2022, and will demonstrate a broad range of capabilities needed on deep space missions. The Artemis II flight test will be NASA’s first m… [+7281 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Holes' Glowing Secrets: New Findings Challenge Existing Theories - SciTechDaily", "description": "Cardiff astronomers, along with international partners, have revealed a novel method to investigate how black holes feast. An international team of astronomers has uncovered an entirely new method to investigate the behavior of active black holes. They observ…", "url": "https://scitechdaily.com/black-holes-glowing-secrets-new-findings-challenge-existing-theories/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Powerful-Jet-Illustration.jpg", "publishedAt": "2024-01-13T20:22:54Z", "content": "Astronomers have discovered a new way to analyze active black holes, revealing that their microwave and X-ray emissions are similar across different consumption rates. This insight, which challenges … [+4573 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Jason Hiner", "title": "Best of CES 2024: Editors' picks for top buys and the products of the future - ZDNet", "description": "Of all the products we saw at CES 2024, we picked a TV, a laptop, an AI device, and a tech accessory we most recommend. We have picks for the most innovative stuff, too.", "url": "https://www.zdnet.com/article/best-of-ces-2024-zdnet-editors-top-picks/", "urlToImage": "https://www.zdnet.com/a/img/resize/736805138a42685d7eb0c041a7248c44ec588699/2024/01/09/8f359f7c-6287-4f39-b5a5-1f6ae4aeb7a3/dsc00645-2.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2024-01-13T17:00:00Z", "content": "The ZDNET team scoured CES 2024 to find the most innovative new tech and the most exciting new products to share with our audience of professionals and tech enthusiasts. We have lots of lists summing… [+8631 chars]"}]}