{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NanoVision Unleashed: PicoRulers Revolutionizing Cellular Imaging - SciTechDaily", "description": "Good news for researchers working with high-resolution fluorescence microscopy: Biocompatible molecular rulers are available for the first time to calibrate the latest super-resolution microscopy methods. Recent advancements in super-resolution microscopy now…", "url": "https://scitechdaily.com/nanovision-unleashed-picorulers-revolutionizing-cellular-imaging/", "urlToImage": "https://scitechdaily.com/images/PicoRuler-Molecular-Nano-Ruler.jpg", "publishedAt": "2023-12-03T19:47:13Z", "content": "PicoRuler: Protein-based molecular rulers make it possible to test the optical resolution of the latest super-resolution microscopy methods on biomolecules in the sub-10-nanometer range under realist… [+3393 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "A look at the new discoveries that make Neanderthals more knowable now than ever - PBS NewsHour", "description": "Neanderthals have held our fascination ever since we first identified their remains. Today, thanks to new artifacts and technologies, findings about our closest relatives are coming thick and fast.", "url": "https://www.pbs.org/newshour/science/a-look-at-the-new-discoveries-that-make-neanderthals-more-knowable-now-than-ever", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/12/GettyImages-1235088525-e1701630599313-1024x686.jpg", "publishedAt": "2023-12-03T19:33:35Z", "content": "Neanderthals are Homo sapienss closest-known relative, and today we know we rubbed shoulders with them for thousands of years, up until the very end of their long reign some 40,000 years ago. Most re… [+15240 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Captures Mysterious Reappearance of a Ghostly Object – “This Thing Is a Real Monster!” - SciTechDaily", "description": "The James Webb Space Telescope's discovery of AzTECC71, a dusty star-forming galaxy from the early universe, challenges previous assumptions about galaxy prevalence and composition, offering new insights into cosmic history and galaxy evolution. It first appe…", "url": "https://scitechdaily.com/webb-captures-mysterious-reappearance-of-a-ghostly-object-this-thing-is-a-real-monster/", "urlToImage": "https://scitechdaily.com/images/Astronomy-Mystery-Object-Concept.jpg", "publishedAt": "2023-12-03T16:09:04Z", "content": "The James Webb Space Telescope has uncovered AzTECC71, a faint galaxy that was previously elusive to the Hubble Space Telescope. This discovery by the COSMOS-Web collaboration reveals a dusty, star-f… [+6122 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Week in tech: Nasa to train Indian astronaut for a trip to the ISS - Mint Lounge", "description": "Nasa administrator Bill Nelson’s recent visit to India marked another milestone for the deepening space ties between the two countries", "url": "https://lifestyle.livemint.com/smart-living/innovation/week-in-tech-nasa-isro-iss-bill-nelson-nisar-111701599273087.html", "urlToImage": "https://images.livemint.com/img/2023/12/03/1140x641/PTI11-29-2023-000282A-0_1701599499520_1701599525959.jpg", "publishedAt": "2023-12-03T12:50:49Z", "content": "Heres a weekly recap of at what made news in the world of science and technology.\r\nNasa to train Indian astronaut for ISS voyage\r\nNasa administrator Bill Nelsons recent visit to India marked another … [+2555 chars]"}]}