{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Andrew Liszewski", "title": "Researchers See Through a Mouse's Eyes by Decoding Brain Signals - Gizmodo", "description": "Don't worry, the technology can't be used to read your thoughts... yet.", "url": "https://gizmodo.com/ai-deep-learning-brain-activity-mouse-science-movie-cli-1850398690", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/709f4099c4456676b82aee0fd722ffc7.gif", "publishedAt": "2023-05-03T15:00:00Z", "content": "What was once the realm of science fiction and grifters who claim to have psychic powers takes another step towards reality as a team of researchers from the École Polytechnique Fédérale de Lausanne … [+3058 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Double Danger for Young Women: High Risk of Rehospitalization After Heart Attack - SciTechDaily", "description": "NIH-supported findings identify risk factors in women and suggest the need for closer monitoring. A study funded by the National Institutes of Health shows that women aged 55 and younger are nearly twice as likely to be rehospitalized within a year of a heart…", "url": "https://scitechdaily.com/?p=273871", "urlToImage": "https://scitechdaily.com/images/Woman-Heart-Attack.jpg", "publishedAt": "2023-05-03T08:23:40Z", "content": "Women aged 55 and younger face nearly twice the risk of rehospitalization in the year following a heart attack compared to similarly aged men, as per a study supported by the National Institutes of H… [+6262 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Carolyn Collins Petersen", "title": "ESA Can't Deploy JUICE's Radar Antenna. It Needs It to Scan Under the Ice at Callisto, Europa, and Ganymede - Universe Today", "description": "ESA technicians are still working to free the stuck RIME antenna on the JUICE spacecraft. So far, they've only moved it a little.", "url": "https://www.universetoday.com/161180/esa-cant-deploy-juices-radar-antenna-it-needs-it-to-scan-under-the-ice-at-callisto-europa-and-ganymede/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/Juices_longest_antenna_awaits_deployment_ESA24834789.jpg", "publishedAt": "2023-05-03T03:02:00Z", "content": "In a scene eerily reminiscent of the Galileo spacecraft’s antenna issues, ESA’s Jupiter Icy Moons Explorer (JUICE) is having a problem with an antenna. The 16-meter-long radar Radar for Icy Moons Exp… [+2701 chars]"}]}