{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity's New Discovery: Ancient Riverbeds on Mars and the Potential for Life - SciTechDaily", "description": "Curiosity rover findings indicate numerous craters on Mars may have once been flowing rivers, hinting at possible ancient life conditions. New analysis of data from the Curiosity rover reveals that much of the craters on Mars today could have once been habita…", "url": "https://scitechdaily.com/curiositys-new-discovery-ancient-riverbeds-on-mars-and-the-potential-for-life/", "urlToImage": "https://scitechdaily.com/images/NASA-Curiosity-Mars-Rover-Mont-Mercou-Selfie-scaled.jpg", "publishedAt": "2023-10-26T01:54:17Z", "content": "ByPenn State UniversityOctober 25, 2023\r\nNASAs Curiosity Mars rover used two cameras to create this selfie in front of Mont Mercou, a rock outcrop that stands 20 feet (6 meters) tall. New analysis by… [+4413 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Apple releases iOS 16.7.2 and iOS 15.8 security updates to patch old hardware - Ars Technica", "description": "Devices as old as the iPhone 6S and iPad Air 2 are still getting patches.", "url": "https://arstechnica.com/gadgets/2023/10/apple-releases-ios-16-7-2-and-ios-15-8-security-updates-to-patch-old-hardware/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/Apple_iPhone12Pro-iOS15-3up_060721-760x380.jpg", "publishedAt": "2023-10-25T19:31:05Z", "content": "Enlarge/ iPhones running iOS 15.\r\n32 with \r\nApple is releasing a slew of updates for its latest operating systems today, including iOS and iPadOS 17.1, macOS Sonoma 14.1, watchOS 10.1, and others. Th… [+3839 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Unraveled: Accelerating Waves and the Mysteries of Time and Relativity - SciTechDaily", "description": "Researchers have derived a new wave equation, linking wave mechanics with the general theory of relativity and the arrow of time, offering solutions to long-standing physics debates and introducing applications for novel materials. Researchers at Tampere Univ…", "url": "https://scitechdaily.com/physics-unraveled-accelerating-waves-and-the-mysteries-of-time-and-relativity/", "urlToImage": "https://scitechdaily.com/images/Artistic-Depiction-of-Exponentially-Curved-Spacetime.jpg", "publishedAt": "2023-10-25T13:11:13Z", "content": "An artistic depiction of a wave encountering an exponentially curved spacetime. Credit: Matias Koivurova, University of Eastern Finland\r\nResearchers have derived a new wave equation, linking wave mec… [+6323 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}]}