{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Week in tech: Nasa to train Indian astronaut for a trip to the ISS - Mint Lounge", "description": "Nasa administrator Bill Nelson’s recent visit to India marked another milestone for the deepening space ties between the two countries", "url": "https://lifestyle.livemint.com/smart-living/innovation/week-in-tech-nasa-isro-iss-bill-nelson-nisar-111701599273087.html", "urlToImage": "https://images.livemint.com/img/2023/12/03/1140x641/PTI11-29-2023-000282A-0_1701599499520_1701599525959.jpg", "publishedAt": "2023-12-03T12:50:49Z", "content": "Heres a weekly recap of at what made news in the world of science and technology.\r\nNasa to train Indian astronaut for ISS voyage\r\nNasa administrator Bill Nelsons recent visit to India marked another … [+2555 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "IPO Weekly Wrap: Tata Tech, IREDA, Gandhar, Flair, SME stocks make bumper debuts; Fedbank disappoints - Moneycontrol", "description": "Tata Technologies, Gandhar Oil Refinery, Indian Renewable Energy (IREDA) and Flair Writing Industries made bumper debuts while Fedbank Financial Services disappointed investors", "url": "https://www.moneycontrol.com/news/business/ipo/ipo-weekly-wrap-tata-tech-ireda-gandhar-flair-sme-issues-make-bumper-debuts-fedbank-disappoints-11847511.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/market_volatile-10-770x433.jpg", "publishedAt": "2023-12-03T10:42:06Z", "content": "The listings of five mainboard and two small and medium enterprises (SME) IPOs kept investors busy this week. Tata Technologies is listed at a 140 percent premium over the issue price. Gandhar Oil Re… [+6839 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Meizu brings smart MYVY Rings, offering wearable AR tech with gesture control: All details | Mint - Mint", "description": "Leading tech brands like Oura, Pi, and Samsung have unveiled their versions of smart rings, with Meizu joining the trend. The ring features augmented reality capabilities and is designed to be used in conjunction with the MYVU Discovery AR smart glasses.", "url": "https://www.livemint.com/technology/gadgets/meizu-brings-smart-myvy-rings-offering-wearable-ar-tech-with-gesture-control-all-details-11701579638058.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/03/1600x900/iuuuhh_1701580522687_1701580528266.png", "publishedAt": "2023-12-03T05:16:18Z", "content": "Smart rings have marked the next phase of technological progress, following the advent of smartwatches. Leading tech brands such as Oura, Pi, and others have already unveiled their versions of smart … [+2618 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Sushant Singh", "title": "Redmi Note 13 Pro and Redmi Note 13 Pro+ European price leaked ahead of launch - The Tech Outlook", "description": "After the huge success of the recently launched Redmi Note 13 series in the home market users are waiting for it to be launched globally. Though it's listed on certification websites like EEC, NBTC, IMDA, TDRA, and SDPPI, the FCC has suggested its ne", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/redmi-note-13-pro-and-redmi-note-13-pro-european-price-leaked-ahead-of-launch/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/12/Redmi_Note_13_Pro1.jpg", "publishedAt": "2023-12-02T17:16:10Z", "content": "After the huge success of the recently launched Redmi Note 13 series in the home market users are waiting for it to be launched globally. Though it’s listed on certification websites like EEC, NBTC, … [+1384 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Jorge Jimenez", "title": "The Great Gmail Purge, New Samsung Galaxy S24 Leaks, and More Top Product News of the Week - Gizmodo", "description": "Catch up on the biggest consumer technology stories from this week.", "url": "https://gizmodo.com/google-gmail-purge-android-chatgpt-samsung-galaxy-leaks-1851065741", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/0e621c8fd854409166219173bdea8788.jpg", "publishedAt": "2023-12-02T14:30:00Z", "content": "If you had an old burner Gmail account, this week was your last chance to log in before Google permanently nukes it. Meanwhile, recent Samsung leaks appear to confirm some Samsung Galaxy S24 Ultra re… [+3042 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lost in Space: Is a Giant Void Driving the Universe Apart? - SciTechDaily", "description": "Cosmologists propose a giant void in space as a solution to the \"Hubble tension,\" challenging conventional models and suggesting a revision of Einstein's gravity theory. One of the biggest mysteries in cosmology is the rate at which the universe is expanding.…", "url": "https://scitechdaily.com/lost-in-space-is-a-giant-void-driving-the-universe-apart/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Space-Void-Concept-Art.jpg", "publishedAt": "2023-12-02T09:25:42Z", "content": "The recent “Hubble tension” in cosmology, marked by conflicting expansion rate measurements, raises questions about the standard cosmological model. A new theory posits that a giant, underdense void … [+8017 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem codes for December 2: Chance to win rare costumes and weapons - HT Tech", "description": "Garena Free Fire Redeem codes for December 2: Grab in-game items ranging from diamond vouchers to costumes and weapons. Know how to claim them.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-december-2-chance-to-win-rare-costumes-and-weapons-71701498627955.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/02/1600x900/pop07_1638420714978_1701498699134.jpg", "publishedAt": "2023-12-02T06:40:42Z", "content": "Garena Free Fire Redeem codes for December 2: Free Fire can be the perfect game to play when a group of friends meet up and do not have an idea what to do or where to go. The squad mode in the game i… [+2391 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Two CMEs hit Earth, spark extra strong solar storm; NASA model shows more could be on the way - HT Tech", "description": "Intense solar storm activity was detected over the last few hours after two CMEs struck the Earth. The auroras were observed as far south as New Mexico in the US. NASA model suggests more CMEs could be on the way.", "url": "https://tech.hindustantimes.com/tech/news/two-cmes-hit-earth-spark-extra-strong-solar-storm-nasa-model-shows-more-could-be-on-the-way-71701495689239.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/02/1600x900/solar-flare-67532_1920_1_1663740280289_1701495736448.jpg", "publishedAt": "2023-12-02T05:44:55Z", "content": "The solar activity on Earth has intensified. Yesterday, December 1, it was reported that a second coronal mass ejection (CME) was headed for the Earth which could turn the ongoing solar storm even mo… [+2473 chars]"}]}