{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Realme GT NEO 3, Infinix Smart 6, Micromax IN 2c- Smartphones to launch THIS week - HT Tech", "description": "We are in the last week of April and there are three smartphones which will be launched in India this week. Realme GT NEO 3, Infinix Smart 6, and Micromax IN 2c are all set to launch on Flipkart. Check date and other details here.", "url": "https://tech.hindustantimes.com/mobile/news/realme-gt-neo-3-infinix-smart-6-micromax-in-2c-smartphones-to-launch-this-week-71650881020702.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/Untitled_design_(84)_1650264909965_1650881192686.jpg", "publishedAt": "2022-04-25T10:10:57Z", "content": "The month of April is about to end and we will still be seeing the launch of three smartphones in India. Yes, Realme GT NEO 3, Infinix Smart 6, and Micromax IN 2c are all set to hit the Indian market… [+1921 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "NASA: International Space Station almost crashes into space junk - HT Tech", "description": "On Saturday, the International Space Station was forced to take emergency evasive maneuvers in order to avoid crashing into space debris. It was an unplanned but a necessary move by NASA to avoid colliding with the space junk floating nearby. Read on to find …", "url": "https://tech.hindustantimes.com/photos/nasa-international-space-station-almost-crashes-into-space-junk-71650878944037.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/SPACE-EXPLORATION-ISS-RUSSIA-0_1630413730142_1650879070719.JPG", "publishedAt": "2022-04-25T09:36:56Z", "content": "Top SectionsExplore Tech\r\n Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Venus Rotates, Slowly, Despite Sun’s Powerful Gravitational Pull - SciTechDaily", "description": "The planet’s atmosphere explains the gravity of the situation. Venus, Earth’s sister planet would likely not rotate, if not for its soupy, fast-moving atmosphere. Instead, Venus would be fixed in place, always facing the sun the way the same side of the moon …", "url": "https://scitechdaily.com/why-venus-rotates-slowly-despite-suns-powerful-gravitational-pull/", "urlToImage": "https://scitechdaily.com/images/Venus-in-Transit.jpg", "publishedAt": "2022-04-25T09:29:23Z", "content": "ByUniversity of California - RiversideApril 25, 2022\r\nA sequence of images from Solar Dynamic Observatory in 171 angstroms of the Venus transit, merged together to show the path of Venus across the s… [+2201 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WiFi tips and tricks: Here is how to secure WiFi connection - HT Tech", "description": "If you have a WiFi connection at your home, know how you can secure it from hackers. Check the WiFi tips and tricks here.", "url": "https://tech.hindustantimes.com/how-to/wifi-tips-and-tricks-here-is-how-to-secure-wifi-connection-71650877540004.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/computer-3596169_960_720_1650877604397_1650877621409.jpg", "publishedAt": "2022-04-25T09:12:29Z", "content": "In the era of digitalization when, from official work to buying groceries, everything is done online- it is very important to have an uninterrupted, safe and secure internet connection. Though you ca… [+813 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Protein in Fungus That Allows It To Bypass Plant Defenses - SciTechDaily", "description": "A protein that permits the fungus that causes white mold stem rot in over 600 plant species to overcome plant defenses has been identified by scientists from the United States Department of Agriculture's Agricultural Research Service and Washington State Univ…", "url": "https://scitechdaily.com/scientists-discover-protein-in-fungus-that-allows-it-to-bypass-plant-defenses/", "urlToImage": "https://scitechdaily.com/images/White-Mold-Stem-Rot-in-Sunflowers.jpg", "publishedAt": "2022-04-25T09:00:56Z", "content": "ByU.S. Department of Agriculture - Agricultural Research ServiceApril 25, 2022A newly discovered protein helps the fungus that causes white mold stem rot in sunflowers and more than 600 other plant s… [+3939 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mix-and-Match Approach to Booster Vaccination Offers the Best Protection Against COVID-19 - SciTechDaily", "description": "A new study on Chile’s national COVID-19 vaccination program, being presented at this year’s European Congress of Clinical Microbiology & Infectious Diseases (ECCMID 2022, Lisbon, April 23-26), and published in the journal The Lancet Global Health on April 23…", "url": "https://scitechdaily.com/mix-and-match-approach-to-booster-vaccination-offers-the-best-protection-against-covid-19/", "urlToImage": "https://scitechdaily.com/images/COVID-Vaccine-Comparison.jpg", "publishedAt": "2022-04-25T08:39:41Z", "content": "ByEuropean Society of Clinical Microbiology and Infectious DiseasesApril 25, 2022\r\nAccording to a new study, administering a different type of vaccination (heterologous) for the third or booster dosa… [+11090 chars]"}, {"source": {"id": null, "name": "The Tech Portal"}, "author": "Soumyadeep Sarkar", "title": "'Space bricks' - Indian Institute of Science and ISRO create prototype bricks for building settlements on Mars - The Tech Portal", "description": "IISc and ISRO have collaborated to build the first bricks from Martian soil, which can be used to facilitate human settlements on Mars", "url": "https://thetechportal.com/2022/04/25/mars-soil-bricks-india-institute-of-science-isro/", "urlToImage": "https://thetechportal.com/wp-content/uploads/2022/04/Bricks-scaled.jpg", "publishedAt": "2022-04-25T05:38:31Z", "content": "There is time for the colonization of Mars to become reality. And Elon Musk and his SpaceX are busy building heavy, long-range rockets to take us to the red planet, one of the most basic problems alr… [+2851 chars]"}, {"source": {"id": null, "name": "Cilisos.my"}, "author": "UiHua", "title": "Samsung Galaxy A33 5G: Biasa in the front, sexy in the back - CILISOS.MY", "description": "For whatever reason, we’ve never done a tech review on Cilisos. So when Samsung Malaysia asked if we’d like to review their latest midrange phone, I jumped at the thought of getting to play with a new phone AND going Mr. Mobile on it. What arrived at our door…", "url": "https://cilisos.my/samsung-galaxy-a33-5g-biasa-in-the-front-sexy-in-the-back/", "urlToImage": "https://cilisos.my/wp-content/uploads/2022/04/A33-5G-featured3.jpg", "publishedAt": "2022-04-25T04:42:41Z", "content": "For whatever reason, we’ve never done a tech review on Cilisos. So when Samsung Malaysia asked if we’d like to review their latest midrange phone, I jumped at the thought of getting to play with a ne… [+5071 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ganymede Casts a Massive Shadow Across Jupiter in Spectacular New Image From NASA’s Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft captured this magnificent view of Jupiter during the mission’s 40th close pass by the giant planet on February 25, 2022. The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede. Citizen scientist Thomas …", "url": "https://scitechdaily.com/ganymede-casts-a-massive-shadow-across-jupiter-in-spectacular-new-image-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-04-25T04:21:29Z", "content": "Figure 1. Citizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was about 44,000 … [+2849 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Third Dose Vaccine Protection Against Hospitalization Wanes After 3 Months - SciTechDaily", "description": "Kaiser Permanente finds the Pfizer COVID-19 third dose vaccine protection against hospitalization from omicron wanes after 3 months. A research study released on April 22, 2022, in The Lancet Respiratory Medicine shows that a booster dose of the Pfizer COVID-…", "url": "https://scitechdaily.com/?p=167498", "urlToImage": "https://scitechdaily.com/images/Three-COVID-19-Vaccine-Doses.jpg", "publishedAt": "2022-04-24T19:13:44Z", "content": "A new research study published in The Lancet Respiratory Medicine shows that protection against the omicron variant deteriorates over time even after a third vaccine dose.\r\nKaiser Permanente finds th… [+2986 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Sun emits massive solar flare with potential to impact satellite communications: CESSI - HT Tech", "description": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems", "url": "https://tech.hindustantimes.com/tech/news/sun-emits-massive-solar-flare-with-potential-to-impact-satellite-communications-cessi-71650711160202.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/23/1600x900/SUn_flares_NASA_pic_1645287521356_1650714493036.jpg", "publishedAt": "2022-04-24T17:48:20Z", "content": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems, the Centre of Excellence in Space Sciences India (CESS… [+1515 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tom Huddleston", "title": "Some of tech's biggest names want a future without passwords — here's what that would look like - CNBC", "description": "From Google to Microsoft, some of tech's biggest names say the dream of a password-less internet is close to reality. The truth is a little more complicated.", "url": "https://www.cnbc.com/2022/04/24/what-a-future-without-passwords-would-look-like-when-it-might-happen.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106197655-1571819572820gettyimages-866481488.jpeg?v=1571887535&w=1920&h=1080", "publishedAt": "2022-04-24T13:30:01Z", "content": "Managing your online passwords can be a chore.\r\nCreating the sort of long, complicated passwords that best deter cyber-thieves especially for dozens of different online accounts can be tedious. But i… [+4631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What a good credit score looks like and how to improve it - BusinessTech", "description": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your ability to continue improving your life over the long term.", "url": "https://businesstech.co.za/news/finance/579878/what-a-good-credit-score-looks-like-and-how-to-improve-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/06/money-e1467040680257.jpg", "publishedAt": "2022-04-24T09:03:21Z", "content": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your abili… [+4305 chars]"}]}