{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Knowablemagazine.org"}, "author": null, "title": "COVID, RSV and the flu: A case of viral interference? - Ars Technica", "description": "", "url": "https://knowablemagazine.org/article/health-disease/2023/covid-rsv-flu-viral-interference", "urlToImage": "https://knowablemagazine.org/pb-assets/knowable-assets/article-assets/twitter/10.1146/knowable-011223-1-1200x630-1673564287437.jpg", "publishedAt": "2023-01-15T12:36:37Z", "content": "12 with 0 posters participating\r\nThree years into the pandemic, COVID-19 is still going strong, causing wave after wave as case numbers soar, subside, then ascend again. But this past autumn saw some… [+3638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Meta, Microsoft Vacate Office Buildings Over WFH, Massive Layoffs: Report - NDTV", "description": "Facebook parent Meta and Microsoft are separately vacating office buildings in Seattle and Bellevue in Washington -in the latest sign of change in the tech sector and softness in the office market here - according to the Seattle Times.", "url": "https://www.ndtv.com/world-news/why-meta-microsoft-vacating-their-offices-in-us-3694309", "urlToImage": "https://c.ndtvimg.com/2021-05/kr18cd1g_microsoftafp_625x300_21_May_21.jpg", "publishedAt": "2023-01-15T12:23:00Z", "content": "Both Meta and Microsoft have embraced remote work. (Representational)\r\nCalifornia: Facebook parent Meta and Microsoft are separately vacating office buildings in Seattle and Bellevue in Washington -i… [+3077 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 Best Samsung phones under 50000: Grab Galaxy S21 FE, Galaxy A73 5G, Galaxy Z Flip 3, more - HT Tech", "description": "If you are looking for the 5 best Samsung phones under Rs. 50000, then your options will include Galaxy S21 FE, Galaxy A73 5G, Galaxy Z Flip 3, among others. Check prices of these Samsung smartphone on Flipkart below.", "url": "https://tech.hindustantimes.com/mobile/news/5-best-samsung-phones-under-50000-grab-galaxy-s21-fe-galaxy-a73-5g-galaxy-z-flip-3-more-71673783005890.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/15/1600x900/SKOREA-SAMSUNG-18_1673783095812_1673783095812_1673783141106_1673783141106.jpg", "publishedAt": "2023-01-15T11:58:07Z", "content": "Are you looking for a feature rich Samsung smartphone? Well, if you have a budget of Rs. 50000, there are several options to look for on Flipkart. Also, Flipkart's Big Saving Days sale is live and se… [+2029 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Secret Code of the Universe: A Remarkable Way of Measuring the Fine Structure Constant - SciTechDaily", "description": "The fine structure constant is a fundamental constant of nature and its measurement is crucial in physics. Recently, researchers at TU Wien have discovered a unique way of measuring it. The value of one over 137, also known as the fine structure constant, is …", "url": "https://scitechdaily.com/the-secret-code-of-the-universe-a-remarkable-way-of-measuring-the-fine-structure-constant/", "urlToImage": "https://scitechdaily.com/images/Fine-Structure-Constant-Experiment.jpg", "publishedAt": "2023-01-15T09:49:30Z", "content": "A light source (left) sends a beam of light through a special material, which changes the direction of polarization by an angle that is given by the fine structure constant. Credit: Tatiana Lysenko /… [+3380 chars]"}, {"source": {"id": null, "name": "Manchester Evening News"}, "author": "Catherine Addison-Swan, Grace Hoffman, Ellie Kemp", "title": "Boss explains the 'coffee cup test' he uses in every job interview to decide who not to hire - Manchester Evening News", "description": "The tech company boss said those who fail the test would be blacklisted for any future positions", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/boss-explains-coffee-cup-test-25981405", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article18288040.ece/ALTERNATES/s1200/1_Woman-in-woolly-gray-sweater-holding-warm-cup-of-tea.jpg", "publishedAt": "2023-01-15T09:10:29Z", "content": "A boss has revealed the reason why he uses an unconventional 'coffee cup test' on job interview candidates when it comes to deciding who to hire.\r\nInterviews are high-pressure situations as it is - b… [+2385 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Upcoming Smartphone launches in India: Oppo A78, Samsung Galaxy A23, Infinix Note 12i, more - HT Tech", "description": "From Oppo A78, Samsung Galaxy A23 to Infinix Note 12i - check what's exciting coming to India in January, 2023.", "url": "https://tech.hindustantimes.com/mobile/news/upcoming-smartphone-launches-in-india-oppo-a78-samsung-galaxy-a23-infinix-note-12i-more-71673772232295.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/15/1600x900/upcoming_smartphones_Infinix_and_Oppo_1673772540169_1673772550218_1673772550218.jpg", "publishedAt": "2023-01-15T08:50:18Z", "content": "The first month of 2023 has been really exciting so far for smartphone lovers. Some noted launches include Realme 10 Pro series, Redmi Note 12 Pro and iQOO 11 series, which is the first smartphone in… [+2195 chars]"}, {"source": {"id": null, "name": "36ng.ng"}, "author": "Oladimeji", "title": "NASA’s Double Asteroid Redirection Test Is A Smashing Success - 36NG", "description": "The mission, focused on the Didymos-Dimorphos binary asteroid system, proved that an asteroid’s orbit can be altered by kinetic impactor technology. Rocks from space have walloped Earth for eons, and it’s only a matter of time until our planet lands yet again…", "url": "https://www.36ng.ng/2023/01/15/nasas-double-asteroid-redirection-test-is-a-smashing-success/", "urlToImage": "https://www.36ng.ng/wp-content/uploads/2023/01/9152B63F-925C-4827-9A3D-EB5765629B37.jpeg", "publishedAt": "2023-01-15T08:33:31Z", "content": "The mission, focused on the Didymos-Dimorphos binary asteroid system, proved that an asteroids orbit can be altered by kinetic impactor technology.\r\nRocks from space have walloped Earth for eons, and… [+7494 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 15 January 2023: Hubble Telescope snaps spooky Crab Nebula - HT Tech", "description": "NASA’s Astronomy Picture of the Day for 15 January, 2023 is one of a spooky Crab Nebula image captured by the Hubble Telescope.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-15-january-2023-hubble-telescope-snaps-spooky-crab-nebula-71673765740968.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/15/1600x900/CrabNebula_Hubble_960_1673765827749_1673765842040_1673765842040.jpg", "publishedAt": "2023-01-15T06:58:10Z", "content": "NASA Astronomy picture of the day takes everyone into a fascinatingly different dimension of the cosmos on a daily basis. Today, it took an eerie turn with a an image of a Crab Nebula! This is the me… [+1648 chars]"}, {"source": {"id": null, "name": "Gadgets Now"}, "author": "Gadgets Now Bureau", "title": "iQoo 11, Realme 10 phones launched in India; Lenovo 5G tablet; Apple CEO pay cut and more top tech news of the - Gadgets Now", "description": "This week we saw a major launch in India – the first Snapdragon 8 Gen 2-powered smartphone arrived in India – the iQoo 11. Also, we are in for another big launch in the coming week, as Samsung confirmed the launch date for the upcoming Galaxy S23 series. Appl…", "url": "https://www.gadgetsnow.com/slideshows/samsung-confirms-galaxy-s23-series-launch-date-iqoo-11-launched-in-india-apple-ceo-tim-cook-takes-a-pay-cut-and-more-top-tech-news-of-the-week/photolist/96993709.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-96993881,width-800,resizemode-4,imgsize-240436/share.jpg", "publishedAt": "2023-01-15T03:40:00Z", "content": "Samsung has announced the launch date of its next-generation flagship smartphone series, Galaxy S23. The company has scheduled its Galaxy Unpacked event for February 1, 2023. Samsung is expected to u… [+328 chars]"}, {"source": {"id": null, "name": "Neowin"}, "author": "Usama Jawad", "title": "Microsoft Weekly: New File Explorer, the death of Windows 8.1, and a Teams paywall - Neowin", "description": "Join us in a jampacked week in a new edition of Microsoft Weekly as we recap all the important stuff from the world of the Redmond tech giant, including the death of Windows 8.1 and a Teams paywall.", "url": "https://www.neowin.net/news/microsoft-weekly-new-file-explorer-the-death-of-windows-81-and-a-teams-paywall/", "urlToImage": "https://cdn.neowin.com/news/images/uploaded/2023/01/1673694043_fotor_2023-1-14_15_59_44_story.jpg", "publishedAt": "2023-01-14T18:16:00Z", "content": "Welcome to a new edition of Microsoft Weekly where we recap everything important that happened in the Microsoft-verse in the past seven days. Finally, we have a jampacked week full of interesting new… [+9620 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Hole's Deep Gravitational Sinkhole Twists Unlucky Star Into Donut Shape - SciTechDaily", "description": "A Deep Gravitational Sinkhole Swallows Unlucky Bypassing Star Black holes have such a voracious gravitational pull that they even swallow light. This makes them hungry monsters lurking in the eternal darkness. There’s no escape if you happen to stumble across…", "url": "https://scitechdaily.com/black-holes-deep-gravitational-sinkhole-twists-unlucky-star-into-donut-shape/", "urlToImage": "https://scitechdaily.com/images/Star-Spaghettification-Black-Hole.gif", "publishedAt": "2023-01-14T11:18:51Z", "content": "BySpace Telescope Science InstituteJanuary 14, 2023\r\nThis animation depicts a star experiencing spaghettification as its sucked in by a supermassive black hole during a tidal disruption event. Credit… [+9715 chars]"}, {"source": {"id": null, "name": "Techbullion.com"}, "author": "Ali Bajwa, Angela Scott-Briggs, TechBullion", "title": "Let's Keto Gummies Reviews – ALL YOU NEED TO KNOW - TechBullion", "description": "The ketogenic state can be reached quickly with the help of Let’s Keto Gummies, which are high-fat, low-carb gummies. There are no chemicals or synthetic ingredients in these keto gummies. They are made entirely of all-natural materials. If you eat these cand…", "url": "https://techbullion.com/lets-keto-gummies-reviews-all-you-need-to-know/", "urlToImage": "https://techbullion.com/wp-content/uploads/2023/01/Screenshot-2023-01-13-095947.png", "publishedAt": "2023-01-13T20:50:23Z", "content": "The ketogenic state can be reached quickly with the help of Let’s Keto Gummies, which are high-fat, low-carb gummies.\r\nThere are no chemicals or synthetic ingredients in these keto gummies. They are … [+14411 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Tanushree Shenwai, Tanushree Shenwai", "title": "This Artificial Intelligence (AI) Research Proposes A New Poisoning Attack That Could Trick AI-Based Coding Assistants Into Suggesting Dangerous Code - MarkTechPost", "description": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit 'AI pair programmer' called GitHub Copilot was unveiled in June 2021 by GitHub and OpenAI. Depending on the surrounding code and c…", "url": "https://www.marktechpost.com/2023/01/13/this-artificial-intelligence-ai-research-proposes-a-new-poisoning-attack-that-could-trick-ai-based-coding-assistants-into-suggesting-dangerous-code/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-13-at-12.06.15-PM.png", "publishedAt": "2023-01-13T20:07:25Z", "content": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit “AI pair programmer” called GitHub Copilot was unveiled in June 2021 b… [+4516 chars]"}]}