{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Writankar Mukherjee and Danish Khan", "title": "Apple CEO Tim Cook likely to fly in to launch company's first India store - Economic Times", "description": "Apple CEO Tim Cook is expected to visit India later this month for the launch of the tech giant's first company-owned store in Mumbai, and to discuss manufacturing expansion and exports with key ministers. The launch date of the Mumbai store is yet to be deci…", "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/apple-ceo-tim-cook-likely-to-fly-in-to-launch-companys-first-india-store/articleshow/99281058.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99281106,width-1070,height-580,imgsize-296752,overlay-economictimes/photo.jpg", "publishedAt": "2023-04-06T00:39:00Z", "content": "Kolkata | New Delhi: Apple chief executive Tim Cook is likely to visit India this month for the launch of the iPhone makers first company-owned store in the country and also for discussing with key m… [+2964 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Update: Cash App founder, MobileCoin CPO Bob Lee stabbed to death in San Francisco's Rincon Hill neighborhood - CBS San Francisco", "description": "Bob Lee, founder of Cash App and the former chief technology officer of Square, was identified as the man stabbed to death Tuesday near downtown San Francisco, according to his current employer, cryptocurrency startup MobileCoin.", "url": "https://www.cbsnews.com/sanfrancisco/news/fatal-stabbing-bob-lee-mobile-coin-san-francisco-main-street-rincon-hill/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/04/05/f1db00dd-1bbe-4d0c-9700-965eb1ddca66/thumbnail/1200x630/822d48a2c00f34f066fba6d5f01f5543/bob-lee.jpg", "publishedAt": "2023-04-05T18:19:00Z", "content": "SAN FRANCISCO -- Bob Lee, founder of Cash App and the former chief technology officer of Square, was identified as the man stabbed to death early Tuesday morning near downtown San Francisco, accordin… [+3736 chars]"}, {"source": {"id": null, "name": "AnandTech"}, "author": "Anton Shilov", "title": "Asus Preps ROG Ally: A Portable Windows Game Console with Custom Zen 4 + RDNA 3 APU - AnandTech", "description": "Asus has begun teasing its own portable game console, the ROG Ally, which the company is positioning as a high-end offering for the handheld...", "url": "https://www.anandtech.com/show/18801/asus-preps-rog-ally-a-portable-console-with-custom-zen-4-rdna-3-apu-and-secret-sauce", "urlToImage": "https://images.anandtech.com/doci/18801/asus-rog-ally-678_678x452.png", "publishedAt": "2023-04-05T18:00:00Z", "content": "Asus has begun teasing its own portable game console, the ROG Ally, which the company is positioning as a high-end offering for the handheld PC gaming market. With its ROG Ally, Asus is certainly try… [+4798 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Amygdala Unveiled: How Our Brains Process Threats, Rewards, and Dopamine - SciTechDaily", "description": "Neuroscientist Bo Li at Cold Spring Harbor Laboratory has made significant discoveries about the role of somatostatin-expressing (Sst+) central amygdala (CeA) neurons in learning about threats and rewards, and their relation to dopamine. By training mice to a…", "url": "https://scitechdaily.com/?p=266236", "urlToImage": "https://scitechdaily.com/images/Brain-Signals-Activity-Technology-Concept.jpg", "publishedAt": "2023-04-05T15:00:38Z", "content": "Research at Cold Spring Harbor Laboratory has revealed that specific neurons in the central amygdala are crucial for learning about threats and rewards, and are directly connected to dopamine neurons… [+4430 chars]"}]}