{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Raghav Ohri", "title": "ED issues show-cause notice to Xiaomi India top officials, 3 banks - Economic Times", "description": "The adjudicating authority under the Foreign Exchange Management Act has issued show-cause notices to Xiaomi Technology India Private Limited, the two executives, CITI Bank, HSBC Bank and Deutsche Bank AG, the agency said in a statement.", "url": "https://economictimes.indiatimes.com/news/india/ed-issues-show-cause-notice-to-xiaomi-india-top-officials-3-banks/articleshow/100882034.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100882034,width-1070,height-580,imgsize-911688,overlay-economictimes/photo.jpg", "publishedAt": "2023-06-09T19:13:00Z", "content": "The Enforcement Directorate's Adjudicating Authority has issued show-cause notices under the Foreign Exchange Management Act (FEMA) to Xiaomi Technology India Private Limited, its officials and three… [+2238 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Scharon Harding", "title": "Blue Microphones branding is going away after 28 years - Ars Technica", "description": "The Blue name was a hat tip to the co-founder's Latvian roots.", "url": "https://arstechnica.com/gadgets/2023/06/blue-microphones-branding-is-going-away-after-28-years/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/blue-760x380.jpg", "publishedAt": "2023-06-09T17:47:37Z", "content": "20 with \r\nIf you were to search among tech review sites for a USB microphone recommendation, you'd almost definitely see a Blue product listed. Founded in 1995 and gaining consumer recognition with d… [+4341 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Critical Schrödinger Cat Code: Quantum Computing Breakthrough for Better Qubits - SciTechDaily", "description": "Scientists from EPFL have proposed a breakthrough error-resilience scheme for quantum computing, known as a \"critical Schrödinger cat code.\" This novel system operates in a hybrid regime, exhibiting enhanced error suppression capabilities and impressive resis…", "url": "https://scitechdaily.com/?p=284830", "urlToImage": "https://scitechdaily.com/images/Schrodingers-Cat-Code-scaled.jpg", "publishedAt": "2023-06-09T17:24:52Z", "content": "ByEcole Polytechnique Fédérale de LausanneJune 9, 2023\r\nAn illustration of Schrödingers cat code. In a significant quantum computing breakthrough, physicists from EPFL have proposed a critical Schröd… [+5525 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WWDC 2023: Apple CEO Tim Cook meets India's Asmi Jain, Swift Student Challenge winner - HT Tech", "description": "Asmi Jain, who won an award from Apple for her app playground met CEO Tim Cook, it has been revealed.", "url": "https://tech.hindustantimes.com/tech/news/wwdc-2023-apple-ceo-tim-cook-meets-indias-asmi-jain-swift-student-challenge-winner-71686325728651.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/WWDC_swift_challenge_1685523072440_1686325938646.jpg", "publishedAt": "2023-06-09T15:57:37Z", "content": "Asmi Jain, the 20-year-old Indian who won the WWDC award for creating an app playground on healthcare, has met Apple CEO Tim Cook during the WWDC 2023.\r\nAsmi had emerged as one of the winners of the … [+2393 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 9 June 2023: Webb Telescope snaps Pandora Cluster - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Abell 2744, also known as the Pandora’s Cluster of galaxies which is located about 4 billion light-years away towards the constellation of Sculptor.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-9-june-2023-webb-telescope-snaps-pandora-cluster-71686309004223.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/Untitled_design_1686309185416_1686309191921.jpg", "publishedAt": "2023-06-09T11:18:18Z", "content": "Most galaxies exist in groups or clusters with dozens or hundreds of members, and these cluster galaxies are all in constant motion, pulled and twisted by their neighbour's gravity. Galaxies exist in… [+2514 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Furqan Shahid", "title": "Samsung Appears To Be Developing An ‘Ultra-Large AI System’ With The Help Of All Available GPU Resources - Wccftech", "description": "A new report has emerged, suggesting that Samsung is working on a large language AI model and could showcase it as early as July.", "url": "https://wccftech.com/samsung-appears-to-be-developing-an-ultra-large-ai-system-with-the-help-of-all-available-gpu-resources/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/steve-johnson-_0iV9LmPDn0-unsplash.jpg", "publishedAt": "2023-06-09T10:12:00Z", "content": "Considering how AI has become a popular aspect for all companies to work at, we are hearing more and more reports about various tech giants dabbling into it. Apple, Samsung, Google, you name it, and … [+1978 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "First Sketch Map of the Subglacial Geology of Thwaites Glacier Revealed - AZoCleantech", "description": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affecting it.", "url": "https://www.azocleantech.com/news.aspx?newsID=33532", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_33532_16863038512135959.jpg", "publishedAt": "2023-06-09T09:44:00Z", "content": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affe… [+3961 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Furqan Shahid", "title": "YouTuber Shows Just How Good Apple’s Customer Service Is Compared To Samsung As Apple Took Just 5 Days To Repair And Return The Device Whereas Samsung Took Almost A Month - Wccftech", "description": "Have you ever wondered how just how good Samsung or Apple's customer service is when it comes to repairing phones? Here's your chance to understand things.", "url": "https://wccftech.com/youtuber-shows-just-how-good-apples-customer-service-is-compared-to-samsung-as-apple-took-just-5-days-to-repair-and-return-the-device-whereas-samsung-took-almost-a-month/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/anton-maksimov-5642-su-R2ljPFJju1s-unsplash.jpg", "publishedAt": "2023-06-08T16:02:00Z", "content": "Experiencing damage to your phone is never really a good thing. Especially if that is the only device you own because, in such a case, you would have to send the device away for repairs. When it come… [+2433 chars]"}]}