{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Leak in the Void: Cosmonauts Contend With Coolant Mishap During Spacewalk - SciTechDaily", "description": "Roscosmos cosmonauts completed a spacewalk on October 25, completing important tasks including the Nauka module radiator inspection and nanosatellite release. Despite facing a coolant leak and partial solar sail deployment issues, the mission was concluded su…", "url": "https://scitechdaily.com/leak-in-the-void-cosmonauts-contend-with-coolant-mishap-during-spacewalk/", "urlToImage": "https://scitechdaily.com/images/Russian-Spacewalker-Oleg-Kononenko-Strela-Boom-scaled.jpg", "publishedAt": "2023-10-26T08:29:09Z", "content": "ByNASAOctober 26, 2023\r\nFlight Engineers Oleg Kononenko (left) and Nikolai Chub (right) of Roscosmos. Credit: NASA\r\nRoscosmos\r\nRoscosmos, also known as the Roscosmos State Corporation for Space Activ… [+3957 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Aditya-L 1 mission: Know how European agency supports ISRO’s solar study mission - HT Tech", "description": "AdityaL 1 mission Know how European agency supports ISROs solar study mission AdityaL1 marks Indias first mission to study the Sun focusing on our dynamic stars mysteries. It was launched on September 2nd 1150 IST from Satish Dhawan Space Centre. After launch…", "url": "https://tech.hindustantimes.com/web-stories/aditya-l-1-mission-know-how-european-agency-supports-isro-s-solar-study-mission-71698319331044.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/26/1600x900/ADITYA-L1_1697436265869_1698319444529.png/", "publishedAt": "2023-10-26T05:59:01Z", "content": "Photo Credit: ISRO\r\n Aditya-L1 marks India's first mission to study the Sun, focusing on our dynamic star's mysteries. It was launched on September 2nd, 11:50 IST from Satish Dhawan Space Centre.\r\nPh… [+1728 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Nithya P Nair, Manas Mitul", "title": "Apple Releases iOS 17.1 With New AirDrop, StandBy, Apple Music Features and Bug Fixes - Gadgets 360", "description": "Apple released the iOS 17 update for the recently-launched iPhone 15 series, along with a few select older iPhone models last month. Now, the Cupertino-based tech giant has released an iOS 17.1 update for eligible iPhone models. The update brings improvements…", "url": "https://www.gadgets360.com/mobiles/news/apple-ios-17-1-airdrop-standby-music-features-bug-fixes-release-note-4514816", "urlToImage": "https://i.gadgets360cdn.com/large/ios_17_namedrop_1695994958945.jpg", "publishedAt": "2023-10-26T05:33:43Z", "content": "Apple has released iOS 17.1, the latest version of its iPhone operating system. The update adds support for large AirDrop file transfer over the Internet when you are out of the AirDrop range. Furthe… [+2917 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Matthew Burgess", "title": "Stock Market Today: Dow, S&P Live Updates for October 26 - Bloomberg", "description": "Asian shares slumped and futures on the tech-heavy Nasdaq 100 index extended declines following a batch of poor corporate earnings. Currency traders were on edge after the yen weakened past a key level.", "url": "https://www.bloomberg.com/news/articles/2023-10-25/asian-stocks-to-open-mixed-yen-lowest-since-1990-markets-wrap", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ibAlioJZQXok/v0/1200x800.jpg", "publishedAt": "2023-10-26T02:15:00Z", "content": "Asian shares slumped and futuresBloomberg Terminal\r\non the tech-heavy Nasdaq 100 index extended declines following a batch of poor corporate earnings. Currency traders were on edge after the yen weak… [+443 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vijay Kishore", "title": "Stocks to Watch: Axis Bank, TechM, TCS, IRM Energy, Jubilant Foodworks | Mint - Mint", "description": "Asian Paints, Canara Bank, Colgate Palmolive, Indian Bank, ACC, PNB, Shriram Finance, Railtel Corporation, and Vodafone Idea will be among the stocks to watch on Thursday as they will be declaring their quarterly earnings report", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-axis-bank-techm-tcs-irm-energy-jubilant-foodworks-11698279088217.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/26/1600x900/40cfde44a33c403fb7f363284fb2f53b-40cfde44a33c403fb_1698279133747_1698279133935.jpg", "publishedAt": "2023-10-26T01:50:16Z", "content": "Axis Bank: Axis Bank Ltd on Wednesday reported a net profit of 5,863 crore in the second quarter of FY24 registering a 10% growth from 5,329.8 crore in the corresponding quarter of last year. NII dur… [+4411 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists develop highest-resolution single-photon superconducting camera - Phys.org", "description": "Researchers at the National Institute of Standards and Technology (NIST) and their colleagues have built a superconducting camera containing 400,000 pixels—400 times more than any other device of its type.", "url": "https://phys.org/news/2023-10-scientists-highest-resolution-single-photon-superconducting-camera.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/nist-team-develops-hig.jpg", "publishedAt": "2023-10-25T15:31:34Z", "content": "Researchers at the National Institute of Standards and Technology (NIST) and their colleagues have built a superconducting camera containing 400,000 pixels400 times more than any other device of its … [+5930 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}]}