{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Ravi Prakash Kumar", "title": "Tata Technologies heads to IPO Street: All you need to know about the company - Moneycontrol", "description": "Tata Tech IPO: Tata Technologies is the first Tata Group company to go public on the domestic bourses since the listing of Tata Consultancy Services in 2004", "url": "https://www.moneycontrol.com/news/business/ipo/tata-technologies-ipo-details-tech-company-10226391.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Tata-Technologies-770x433.jpg", "publishedAt": "2023-03-10T05:01:45Z", "content": "Pune-based Tata Technologies, a subsidiary of Tata Motors, on March 10 filed a draft red herring prospectus with the Securities and Exchange Board of India (SEBI) to initiate an initial public offeri… [+3024 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for March 10, 2023: Have you picked today's rewards yet? - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for March 10: These codes only last for a limited time. Claim them, find out how to.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-march-10-2023-have-you-picked-today-s-rewards-yet-71678421032455.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/10/1600x900/pop02_1652576476202_1678421087145_1678421087145.jpg", "publishedAt": "2023-03-10T04:12:08Z", "content": "Garena Free Fire MAX Redeem Codes for March 10: How many hours have you played Free Fire Max last week? If it is more than 10 hours, then it is easy to say that you're quite invested into the game. A… [+2717 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Create “Reddmatter” – Game-Changing Room-Temperature Superconductor - SciTechDaily", "description": "Researchers have not only raised the temperature, but also lowered the pressure required to achieve superconductivity. In a historic achievement, University of Rochester researchers have created a superconducting material at both a temperature and pressure lo…", "url": "https://scitechdaily.com/?p=259211", "urlToImage": "https://scitechdaily.com/images/Abstract-Electric-Matter-Phase-Concept.gif", "publishedAt": "2023-03-10T03:54:08Z", "content": "ByUniversity of RochesterMarch 9, 2023\r\nUniversity of Rochester scientists have made a significant breakthrough by developing a superconducting substance that is suitable for practical use at low tem… [+9926 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Disturbing Truth: Opioids Dominate as Primary Cause of Poisoning Deaths in Children - SciTechDaily", "description": "Researchers find rate of fatal opioid poisonings among children more than doubled over 13-year span Over-the-counter drugs also continue to pose fatal risks to young children despite measures to reduce exposure. Researchers from Children’s Hospital of Philade…", "url": "https://scitechdaily.com/disturbing-truth-opioids-dominate-as-primary-cause-of-poisoning-deaths-in-children/", "urlToImage": "https://scitechdaily.com/images/Opioid-Drug-Addiction-Death-Concept.jpg", "publishedAt": "2023-03-09T22:30:05Z", "content": "A study conducted by researchers from Childrens Hospital of Philadelphia (CHOP) found that opioids were responsible for more than half of all fatal poisonings in children under the age of 5, a number… [+4958 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Microsoft’s Bing hits 100 million active users thanks to AI chat, Edge browser - Ars Technica", "description": "\"We are fully aware we remain a small, low, single digit share player.\"", "url": "https://arstechnica.com/gadgets/2023/03/ai-powered-chat-helps-bing-make-a-small-dent-in-googles-search-hegemony/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing-760x380.jpeg", "publishedAt": "2023-03-09T20:35:17Z", "content": "58 with \r\nMicrosoft's Bing has never been in any danger of overtaking Google as the Internet's most popular search engine. But the headline-grabbing AI-powered features from the \"new Bing\" preview th… [+1849 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Short covering, position evening in gold ahead of U.S. jobs data - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2023-03-09/Short-covering-position-evening-in-gold-ahead-of-U-S-jobs-data.html", "urlToImage": "https://www.kitco.com/news/2023-03-09/images/goldchart_0309_pm.png", "publishedAt": "2023-03-09T17:29:00Z", "content": "(Kitco News) - Gold prices are higher in midday U.S. trading Wednesday, with silver near steady. Short covering and some position squaring are featured in the precious metals futures markets just ahe… [+2615 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Ethan Gach", "title": "Sony Microsoft's Battle Over Activision Is A Full Blown Circus - Kotaku", "description": "The fight over the biggest tech merger in U.S. history continues to be really goofy", "url": "https://kotaku.com/activision-call-duty-mwii-sony-microsoft-playstation-1850207404", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8db9aeb4512739a3f1e8ad0e44096ac6.jpg", "publishedAt": "2023-03-09T16:05:00Z", "content": "Over a year after it was first announced, Microsofts $69 billion Activision Blizzard deal is being picked apart under a microscope by regulators. It still appears to be crawling towards its inexorabl… [+3783 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Ece Nagihan", "title": "Google Translate Now Translates Texts in Pictures! How to Used? - Expat Guide Turkey", "description": "Google Translate can now translate the text on the picture. For this, it will be enough to upload your picture to the Translate site. The rest is Google Lens technology. Although the ChatGPT platform", "url": "https://expatguideturkey.com/google-translate-now-translates-texts-in-pictures-how-to-used/", "urlToImage": null, "publishedAt": "2023-03-09T14:46:42Z", "content": "Google Translate can now translate the text on the picture. For this, it will be enough to upload your picture to the Translate site. The rest is Google Lens technology.\r\nAlthough the ChatGPT platfor… [+1512 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Health Desk", "title": "Parenthood no longer a far-fetched dream? Japanese scientists create mice with two fathers - Times Now", "description": "The novel technique can help two men to have children together. And also help in treatments for severe forms of infertility, such as Turner's syndrome, where one copy of the X chromosome is missing or partly missing.", "url": "https://www.timesnownews.com/health/parenthood-no-longer-a-far-fetched-dream-japanese-scientists-create-mice-with-two-fathers-article-98510419", "urlToImage": "https://static.tnn.in/thumb/msid-98510419,updatedat-1678345777045,width-1280,height-720,resizemode-75/98510419.jpg", "publishedAt": "2023-03-09T07:09:37Z", "content": "In the study, yet to be published, Hayashi and the team transformed a male skin cell with the XY chromosome combination, into an egg, with the female XX version."}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Nanotube sensors can detect and distinguish gibberellin plant hormones - Tech Explorist", "description": "The nondestructive nanosensors could have wide applications in agricultural science.", "url": "https://www.techexplorist.com/nanotube-sensors-detect-distinguish-gibberellin-plant-hormones/57452/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/03/SMART-DiSTAP-nanotube-fluorescence.jpg", "publishedAt": "2023-03-09T06:56:31Z", "content": "Gibberellins (GAs) are a family of phytohormones that are essential for plant development but are challenging to recognize due to their identical chemical structures. MIT researchers build and manufa… [+5657 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Georgia Institute of Technology: Super-fast Insect Urination Powered by the Physics of Superpropulsion - India Education Diary", "description": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail and then launched it away so quickly that it seemed", "url": "https://indiaeducationdiary.in/georgia-institute-of-technology-super-fast-insect-urination-powered-by-the-physics-of-superpropulsion/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/visit-tech.png?fit=1024%2C444&ssl=1", "publishedAt": "2023-03-08T13:02:55Z", "content": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail a… [+117 chars]"}]}