{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Carin Smith", "title": "Aviation watchdog suspends Lufthansa Technik's licence, audits SAAT after Comair 'incidents' - News24", "description": "The SA Civil Aviation Authority has temporarily suspended the Approved Maintenance Organisation licence of Lufthansa Technik Maintenance International and is auditing SAA Technical.", "url": "https://www.news24.com/fin24/companies/travelandleisure/aviation-watchdog-suspends-lufthansa-techniks-licence-audits-saat-after-comair-incidents-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10142/92c9999efa01475d8ab1202ee826d7a4.jpg", "publishedAt": "2022-03-23T10:27:25Z", "content": "<ul><li>Lufthansa Technik Maintenance International's maintenance licence has temporarily been suspended in SA following an unscheduled audit by the SA Civil Aviation Authority.</li><li>The SACAA is … [+2843 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Growing uniformly sized nanodiamonds - Nanowerk", "description": "Scientists report a method to grow ultra-uniform nanodiamonds without the need for explosives. The technique also could be used to add beneficial single-atom defects in otherwise perfect crystals.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=60148.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id60148.jpg", "publishedAt": "2022-03-23T09:58:49Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Increases Risk of Type 2 Diabetes - SciTechDaily", "description": "People who have had Covid-19 are at increased risk of developing type 2 diabetes. This is the result of a study by DDZ, DZD and IQVIA, which has now been published in Diabetologia. Studies show that the human pancreas can also be a target of the SARS-CoV-2 (s…", "url": "https://scitechdaily.com/covid-19-increases-risk-of-type-2-diabetes/", "urlToImage": "https://scitechdaily.com/images/Diabetes-Warning.jpg", "publishedAt": "2022-03-23T09:39:13Z", "content": "People who have had Covid-19 are at increased risk of developing type 2 diabetes. This is the result of a study by DDZ, DZD and IQVIA, which has now been published in Diabetologia.\r\nStudies show that… [+2949 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "USAID launches tech-based reading program in NegOcc - pna.gov.ph", "description": "MANILA – United States Agency for International Development (USAID) Philippines Mission Director Ryan Washburn visited Negros Occidental recently to highlight USAID’s partnerships for water and economic resilience and launch a technology-based reading program…", "url": "https://www.pna.gov.ph/articles/1170464", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/03/23/image-14.png", "publishedAt": "2022-03-23T09:11:00Z", "content": "(Photo courtesy of US Embassy in Manila)\r\nMANILA – United States Agency for International Development (USAID) Philippines Mission Director Ryan Washburn visited Negros Occidental recently to highligh… [+2492 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "SEC OKs Converge bond offering, Asia Pacific Medical Center IPO - pna.gov.ph", "description": "MANILA – The Securities and Exchange Commission (SEC) has considered favorably the fixed-rate bond offering by Converge Information and Communications Technology Solutions, Inc. and initial public offering by Asia Pacific Medical Center (APMC) Bacolod, Inc. I…", "url": "https://www.pna.gov.ph/articles/1170441", "urlToImage": "https://files01.pna.gov.ph/ograph/2021/06/14/seclogopnacdo.jpeg", "publishedAt": "2022-03-23T05:39:00Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA scientist gets excited as new exoplanets discovered beyond our solar system - HT Tech", "description": "What makes this discovery by NASA truly exciting is that some of these exoplanets found outside the solar system are just like Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-scientist-gets-excited-as-new-exoplanets-discovered-beyond-our-solar-system-71648012035280.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/23/1600x900/Planet_1594799805402_1594799819612_1648012192335.jpg", "publishedAt": "2022-03-23T05:12:21Z", "content": "NASA: The American space agency has recently discovered 65 new planets taking its total discovered exoplanets to an impressive 5,000, creating a new cosmic milestone. What makes this discovery truly … [+3951 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Samuel Axon", "title": "Sonos starts hiring to build “Home Theater OS” - Ars Technica", "description": "Sonos could challenge Roku, Amazon, LG, and others with TV software platforms.", "url": "https://arstechnica.com/gadgets/2022/03/sonos-starts-hiring-to-build-home-theater-os/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/05/SonosArcWithStandingTV-760x380.jpg", "publishedAt": "2022-03-22T21:59:01Z", "content": "Enlarge/ The Sonos Arc soundbar.\r\n40 with 33 posters participating\r\nSonos has ambitions not just to be the platform of choice for home audio but for home theater, too, according to several new job po… [+2308 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Researchers control brain circuits from a distance using infrared light - Science Daily", "description": "Scientists have developed the first non-invasive technique for controlling targeted brain circuits in behaving animals from a distance. The tool has the potential to solve one of the biggest unmet needs in neuroscience: a way to flexibly test the functions of…", "url": "https://www.sciencedaily.com/releases/2022/03/220322150910.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-22T20:13:31Z", "content": "Imagine the brain as a giant switchboard covered with thousands of buttons, knobs, dials and levers that control aspects of our thought, emotions, behavior, and memory. (You can think of the movie In… [+8049 chars]"}, {"source": {"id": null, "name": "Techcityng.com"}, "author": "Collins Eshiet", "title": "Huawei Smart Office, a glimpse into the future of IoT - TechCity", "description": "At the MWC 2022, Huawei showcased the Smart Office and showed how it works across a host of its products.", "url": "https://www.techcityng.com/huawei-smart-office-a-glimpse-into-the-future-of-iot/", "urlToImage": "https://h2g6j3q2.rocketcdn.me/wp-content/uploads/2022/03/20220228_134023_ccexpress.jpeg", "publishedAt": "2022-03-22T14:28:26Z", "content": "At the MWC 2022, Huawei showcased the Smart Office and showed how it works across a host of its products. The showcase reinforced how ingrained innovation has always been in Huawei’s product line wit… [+2421 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious ORCs in Space Revealed Using the World's Most Powerful Radio Telescopes - SciTechDaily", "description": "Astronomy’s newest mystery objects, odd radio circles or ORCs, have been pulled into sharp focus by an international team of astronomers using the world’s most capable radio telescopes. First revealed by the ASKAP radio telescope, owned and operated by Austra…", "url": "https://scitechdaily.com/mysterious-orcs-in-space-revealed-using-the-worlds-most-powerful-radio-telescopes/", "urlToImage": "https://scitechdaily.com/images/Odd-Radio-Circles-Artists-Impression-scaled.jpg", "publishedAt": "2022-03-22T09:55:32Z", "content": "Artist’s impression of odd radio circles. It is thought to take the rings 1 billion years to reach the size we see them today. The rings are so big (millions of light years across), they’ve expanded … [+5886 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africans should expect higher interest rates this week - BusinessTech", "description": "The South African Reserve Bank is likely to hike interest rates by a further 25 basis points this week to 4.25% in an attempt to slow inflation, say economists.", "url": "https://businesstech.co.za/news/business/569950/south-africans-should-expect-higher-interest-rates-this-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/Rand-e1601546534500.png", "publishedAt": "2022-03-22T06:43:34Z", "content": "The South African Reserve Bank is likely to hike interest rates by a further 25 basis points this week to 4.25% in an attempt to slow inflation, say economists.\r\nA Reuters poll of economists said pri… [+5433 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Begins Multi-Instrument Alignment - SciTechDaily", "description": "After meeting the major milestone of aligning the telescope to NIRCam, the Webb team is starting to extend the telescope alignment to the guider (the Fine Guidance Sensor, or FGS) and the other three science instruments. This six-week-long process is called m…", "url": "https://scitechdaily.com/webb-space-telescope-begins-multi-instrument-alignment/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-03-22T04:29:37Z", "content": "NASA’s James Webb Space Telescope. Credit: NASA Goddard Space Flight Center and Northrup Grumman\r\nAfter meeting the major milestone of aligning the telescope to NIRCam, the Webb team is starting to e… [+3005 chars]"}]}