{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gadgets 360 With Technical Guruji: OnePlus Nord 3 - NDTV", "description": "If you're looking for a relatively affordable smartphone with premium features and enough power for gaming, OnePlus might have you covered with the new Nord ...", "url": "https://www.youtube.com/watch?v=6cYCcLN-U9I", "urlToImage": "https://i.ytimg.com/vi/6cYCcLN-U9I/maxresdefault.jpg", "publishedAt": "2023-07-08T12:00:04Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Double solar storms to hit Earth at any moment today! Will it spark an internet apocalypse? - HT Tech", "description": "The double solar storms, on the back of two CMEs, are arriving soon and can hit the Earth today, July 8, at any time. Can it cause an internet apocalypse? Find out.", "url": "https://tech.hindustantimes.com/tech/news/double-solar-storms-to-hit-earth-at-any-moment-today-will-it-spark-an-internet-apocalypse-71688814015091.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/08/1600x900/spaceweather01_1655181786407_1688814549276.jpg", "publishedAt": "2023-07-08T11:21:51Z", "content": "Yesterday, it was reported that a double solar storm strike was expected on the Earth. However, it did not happen. Turns out, the coronal mass ejection (CME) clouds that were moving towards our plane… [+2106 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Illuminates Earliest Strands of the Cosmic Web - SciTechDaily", "description": "A filament of 10 galaxies seen just 830 million years after the birth of the universe Woven across our universe is a weblike structure of galaxies called the cosmic web. Galaxies are strung along filaments in this vast web, which also contains enormous voids.…", "url": "https://scitechdaily.com/webb-space-telescope-illuminates-earliest-strands-of-the-cosmic-web/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Web-Art-Concept.jpg", "publishedAt": "2023-07-08T09:44:39Z", "content": "BySpace Telescope Science InstituteJuly 8, 2023\r\nAstronomers have discovered an early strand of the universes cosmic web using the James Webb Space Telescope, existing just 830 million years after th… [+11088 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Palm-Sized Powerhouse: RIKEN's Handheld Terahertz Device to “X-Ray” Things Without Harmful Radiation - SciTechDaily", "description": "Using new palm-sized devices, RIKEN researchers may have finally harnessed the terahertz band of the electromagnetic spectrum to effectively ‘X-ray’ things without using harmful ionizing radiation. Countless technologies—from smartphones and TVs to infrared i…", "url": "https://scitechdaily.com/palm-sized-powerhouse-rikens-handheld-terahertz-device-to-x-ray-things-without-harmful-radiation/", "urlToImage": "https://scitechdaily.com/images/Handheld-X-ray-Technology-Concept.jpg", "publishedAt": "2023-07-08T02:33:05Z", "content": "ByRIKENJuly 7, 2023\r\nRIKEN researchers have developed a handheld device that effectively uses the terahertz band of the electromagnetic spectrum for X-raying objects without harmful radiation. By opt… [+7092 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Samsung Launches New Smartphone In The 5G Segment 'Galaxy M34 5G' | Tech News - ET NOW", "description": "If you are planning to buy a 5G smartphone that too in a a mid price range segment, than here's the latest offering from Samsung, the Samsung Galaxy M34 5G s...", "url": "https://www.youtube.com/watch?v=e9_ME6TRYVk", "urlToImage": "https://i.ytimg.com/vi/e9_ME6TRYVk/maxresdefault.jpg", "publishedAt": "2023-07-07T19:17:46Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Machine learning enables accurate electronic structure calculations at large scales for material modeling - Phys.org", "description": "The arrangement of electrons in matter, known as the electronic structure, plays a crucial role in fundamental but also applied research, such as drug design and energy storage. However, the lack of a simulation technique that offers both high fidelity and sc…", "url": "https://phys.org/news/2023-07-machine-enables-accurate-electronic-large.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/machine-learning-takes-2.jpg", "publishedAt": "2023-07-07T16:58:41Z", "content": "The arrangement of electrons in matter, known as the electronic structure, plays a crucial role in fundamental but also applied research, such as drug design and energy storage. However, the lack of … [+6652 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Stadium-sized asteroid approaching Earth at rapid pace! NASA reveals details - HT Tech", "description": "NASA has revealed that an asteroid could be making its closest approach to Earth today, and it is huge! Check out its speed, distance, and other details, as revealed by NASA.", "url": "https://tech.hindustantimes.com/tech/news/stadiumsized-asteroid-approaching-earth-at-rapid-pace-nasa-reveals-details-71688701975248.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/07/1600x900/orbit-viewer-snapshot_1688702043197_1688702052010.jpg", "publishedAt": "2023-07-07T04:10:45Z", "content": "An asteroid that was previously expected to strike Earth is now being deemed safe. However, it will come close enough to the planet in this decade, giving scientists a chance to study it. This astero… [+1970 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "IIT-H Researchers Discover Ultra-Low Frequency Gravitational Waves - Transcontinental Times", "description": "INDIA: In a groundbreaking discovery, a team of researchers from the Indian Institute of Technology Hyderabad (IIT-H) has provided compelling evidence for the existence of ultra-low-frequency (ULF) gravitational waves.  The findings, published in the esteemed…", "url": "https://www.transcontinentaltimes.com/iit-h-researcher-gravitational-waves/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/07/Ultra-low-frequency-Gravitational-Waves-1.jpg", "publishedAt": "2023-07-06T18:44:29Z", "content": "INDIA: In a groundbreaking discovery, a team of researchers from the Indian Institute of Technology Hyderabad (IIT-H) has provided compelling evidence for the existence of ultra-low-frequency (ULF) g… [+2830 chars]"}]}