{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Come Sail Away With Me - SciTechDaily", "description": "The spiral arms of the galaxy NGC 3318 are lazily draped across this image from the NASA/ESA Hubble Space Telescope. This spiral galaxy lies in the constellation Vela and is roughly 115 light-years away from Earth. Vela was originally part of a far larger con…", "url": "https://scitechdaily.com/come-sail-away-with-me/", "urlToImage": "https://scitechdaily.com/images/Galaxy-NGC-3318-scaled.jpg", "publishedAt": "2022-01-17T05:09:29Z", "content": "ByESA/HubbleJanuary 16, 2022\r\nSpiral galaxy NGC 3318 imaged by the Hubble Space Telescope. Credit: ESA/Hubble &amp; NASA, ESO, R. J. Foley, Acknowledgement: R. Colombari\r\nThe spiral arms of the galax… [+1486 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Amit Mudgill", "title": "Why is HCL Tech falling post Q3 revenue beat, strong deal momentum? - Economic Times", "description": "Foreign brokerage Morgan Stanley said the strong revenue performance was dampened by a lack of positive revision in outlook. Weak margins in the services segment are driving limited EPS upgrades, it said while keeping a target of Rs 1,450 on the stock.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/why-is-hcl-tech-falling-post-q3-revenue-beat-strong-deal-momentum/articleshow/88943937.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88944239,width-1070,height-580,imgsize-13412,overlay-etmarkets/photo.jpg", "publishedAt": "2022-01-17T05:09:00Z", "content": "NEW DELHI: HCL Technologies reported strong revenue growth and its deal wins were robust at $2.1 billion, but a weak margin outlook mars the picture, said analysts, who believe re-rating hopes on the… [+2524 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Samsung could finally upgrade to 45W fast charging for Galaxy S22 series - TechNave", "description": "With the launch of the&nbsp;Samsung Galaxy S22 series&nbsp;coming soon, details about the new flagship series have been popping up fast. Specs like the chipset", "url": "https://technave.com/gadget/Samsung-could-finally-upgrade-to-45W-fast-charging-for-Galaxy-S22-series-28093.html", "urlToImage": "https://technave.com/data/files/article/202201170312583805.jpg", "publishedAt": "2022-01-17T03:20:10Z", "content": "With the launch of the Samsung Galaxy S22 series coming soon, details about the new flagship series have been popping up fast. Specs like the chipset and storage capacity are all that surprising for … [+1035 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem codes for January 17, 2022: Get Green Star Token, Brave Crystal, Sky Crystal - HT Tech", "description": "Garena Free Fire Redeem codes for January 17, 2022: Get Redeem codes at reward.ff.garena.com", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-january-17-2022-get-green-star-token-brave-crystal-sky-crystal-71642385480871.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/17/1600x900/bda3ef1394e93d39b36a9aa6305e7c64jpg_1638674694688_1642385625086.jpg", "publishedAt": "2022-01-17T02:18:41Z", "content": "Free Fire is one of the favourite games of e-gamers. The game became popular among Indian gamers after the Indian government banned the very popular PUBG Mobile India in Sept, 2020. The game is known… [+1633 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Type of “Strange Metal” – Material That Shares Fundamental Quantum Attributes With Black Holes - SciTechDaily", "description": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black holes. Scientists understand quite well how temperature affects…", "url": "https://scitechdaily.com/newly-discovered-type-of-strange-metal-material-that-shares-fundamental-quantum-attributes-with-black-holes/", "urlToImage": "https://scitechdaily.com/images/Strange-Metals-New-State-of-Matter.gif", "publishedAt": "2022-01-17T01:35:02Z", "content": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black hol… [+6135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Hole at Center of Milky Way Is Unpredictable and Chaotic – Mysterious Flares Erupt Every Day - SciTechDaily", "description": "An international team of researchers, led by postgraduate student Alexis Andrés, has found that the black hole at the center of our galaxy, Sagittarius A*, not only flares irregularly from day to day but also in the long term. The team analyzed 15 years’ wort…", "url": "https://scitechdaily.com/black-hole-at-center-of-milky-way-is-unpredictable-and-chaotic-mysterious-flares-erupt-every-day/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Artists-Concept-Illustration-scaled.jpg", "publishedAt": "2022-01-17T00:25:00Z", "content": "ByRoyal Astronomical SocietyJanuary 16, 2022\r\nArtist’s concept illustration of a supermassive black hole emitting an x-ray jet. Credit: NASA/JPL-Caltech\r\nAn international team of researchers, led by … [+3652 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Ian Bickis", "title": "Onboard vehicle tech becoming a safety issue, advocates say - CP24 Toronto's Breaking News", "description": "Automakers have been installing increasingly high-tech features and infotainment systems in vehicles, but that doesn't mean they're becoming safer.", "url": "https://www.cp24.com/news/onboard-vehicle-tech-becoming-a-safety-issue-advocates-say-1.5742308", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5742309.1642376879!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-01-16T23:48:33Z", "content": "TORONTO - A driver sitting behind the wheel of a new vehicle could be scrolling through their Spotify app looking for the right album when they get an incoming call or text, only to have a warning be… [+5610 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Browne", "title": "Pregnant people are still not getting vaccinated against Covid - Ars Technica", "description": "Misinformation and muddled public health messaging have failed expectant parents. Now Omicron's surge is putting both carriers and babies at risk.", "url": "https://www.wired.com/story/pregnant-people-still-not-getting-vaccinated-covid/", "urlToImage": "https://media.wired.com/photos/61e0a474844ec857b7138274/191:100/w_1280,c_limit/Science_pregnant_vaccine_GettyImages-1211125659.jpg", "publishedAt": "2022-01-16T12:24:09Z", "content": "Calendar year three into the pandemic, and vaccination coverage among pregnant people remains staggeringly low. \r\nAccording to data from the US Centers for Disease Control and Prevention, as of Janua… [+3008 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Citizen Scientists Discover Giant Jupiter-Like Planet in NASA TESS Data - SciTechDaily", "description": "Tom Jacobs of Bellevue, Washington, loves treasure hunts. Since 2010, the former U.S. naval officer has participated in online volunteer projects that allow anyone who is interested — “citizen scientists” — to look through NASA telescope data for signs of exo…", "url": "https://scitechdaily.com/citizen-scientists-discover-giant-jupiter-like-planet-in-nasa-tess-data/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-TOI-2180-b-scaled.jpg", "publishedAt": "2022-01-16T10:22:05Z", "content": "ByNASAJanuary 16, 2022\r\nThis illustration depicts a Jupiter-like exoplanet called TOI-2180 b. It was discovered in data from NASA’s Transiting Exoplanet Survey Satellite. Credit: NASA/JPL-Caltech/R. … [+14100 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Major Milestone for the James Webb Space Telescope, a “Mini” Monster Black Hole [Video] - SciTechDaily", "description": "A major milestone for the James Webb Space Telescope, what astronomers could learn from a “mini” monster black hole, and the latest assessment of our planet’s global surface temperature … a few of the stories to tell you about – This Week at NASA! https://you…", "url": "https://scitechdaily.com/a-major-milestone-for-the-james-webb-space-telescope-a-mini-monster-black-hole-video/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-01-15T12:37:43Z", "content": "Video transcript:\r\nA major milestone for the James Webb Space Telescope, what astronomers could learn from a mini monster black hole, and the latest assessment of our planet’s global surface temperat… [+2536 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "From pandemic to endemic: Covid forecast for 2022 - BusinessTech", "description": "After two years of contagion and death, Covid is shifting again. Omicron is spreading faster than any previous variant, but it’s also proving less malevolent. There’s growing talk that the worst pandemic of the past century may soon be known in another way — …", "url": "https://businesstech.co.za/news/trending/551008/from-pandemic-to-endemic-covid-forecast-for-2022/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/Covid-Vaccine-e1639040310267.jpg", "publishedAt": "2022-01-15T10:24:31Z", "content": "After two years of contagion and death, Covid is shifting again. Omicron is spreading faster than any previous variant, but its also proving less malevolent. Theres growing talk that the worst pandem… [+6010 chars]"}]}