{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Boeing's Starliner Stuck at Space Station: Unraveling Helium Leaks and Thruster Troubles - SciTechDaily", "description": "Boeing’s Starliner spacecraft is stuck at the Space Station for now as NASA and Boeing have adjusted the return schedule to address issues within the propulsion system while managing conflicts with planned spacewalks at the International Space Station. This d…", "url": "https://scitechdaily.com/boeings-starliner-stuck-at-space-station-unraveling-helium-leaks-and-thruster-troubles/", "urlToImage": "https://scitechdaily.com/images/Boeing-Starliner-Spacecraft-Docked-to-Space-Station.jpg", "publishedAt": "2024-06-22T14:46:36Z", "content": "The Starliner spacecraft on NASA’s Boeing Crew Flight Test is pictured docked to the Harmony module’s forward port as the International Space Station orbited 263 miles above the Mediterranean Sea. Cr… [+3830 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Eden Teshome", "title": "NASA again postpones return of Boeing Starliner crew from space - The Hill", "description": "NASA and Boeing have once again postponed the return of the Starliner from the International Space Station (ISS), as the two-person crew completes a full review of the spacecraft’s technical issues.  The mission, Boeing’s first manned space launch, was origin…", "url": "https://thehill.com/homenews/space/4734812-nasa-boeing-starliner-crew-return-delayed-international-space-station/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/06/AP24157676832842-e1719066739847.jpg?w=1280", "publishedAt": "2024-06-22T14:42:00Z", "content": "Skip to content\r\nNASA and Boeing have once again postponed the return of the Starliner from the International Space Station (ISS), as the two-person crew completes a full review of the spacecraft’s t… [+2105 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "David Delima", "title": "Samsung Galaxy S25 Series Could Reportedly Arrive With Exynos 2500 Chip, as Samsung Attempts to Improve Yield | Technology News - Gadgets 360", "description": "Samsung Galaxy S25 series could be equipped with an Exynos 2500 chipset after all, according to a South Korean publication, following reports that the company would use Qualcomm's next-generation Snapdragon mobile processor for its upcoming flagship smartphon…", "url": "https://www.gadgets360.com/mobiles/news/samsung-s25-series-exynos-2500-chip-development-galaxy-report-5945088", "urlToImage": "https://i.gadgets360cdn.com/large/galaxy-s24-review-cameras_1710411010922.jpg", "publishedAt": "2024-06-22T10:10:06Z", "content": "Samsung Galaxy S25 series could be equipped with an Exynos 2500 chipset after all, according to a South Korean news report that contradicts claims that the firm plans to exclusively use Qualcomm's ne… [+2093 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Reachbot: Revolutionary rock-climbing robot | Tech It Out - WION", "description": "On Tech It Out, we continuously provide updates on advancements in robotics. Researchers have recently created a robot resembling an insect, which could be h...", "url": "https://www.youtube.com/watch?v=iNwUGh7MYSE", "urlToImage": "https://i.ytimg.com/vi/iNwUGh7MYSE/maxresdefault.jpg", "publishedAt": "2024-06-22T07:30:11Z", "content": null}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Big Tech in China: Huawei announces new AI innovations at developer conference - CGTN", "description": "Chinese tech giant Huawei has announced a series of new innovations at its annual developer conference in the southern city of Dongguan. Huang Fei has the details.", "url": "https://news.cgtn.com/news/2024-06-22/VHJhbnNjcmlwdDc5Mzk2/index.html", "urlToImage": "https://video.cgtn.com/public/2024-06-22/public/video/376414/376414.jpg", "publishedAt": "2024-06-22T06:43:34Z", "content": null}]}