{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "NewJaisa Technologies IPO opens for subscription tomorrow - Hindustan Times", "description": "NewJaisa Tecnologies aims to raise ₹39.93 crore through its IPO. The issue will close for subscription on September 27.", "url": "https://www.hindustantimes.com/business/newjaisa-technologies-ipo-opens-for-subscription-tomorrow-101695553623497.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/09/24/1600x900/ipo_1695553652305_1695553652465.jpg", "publishedAt": "2023-09-24T11:23:24Z", "content": "IT electronics refurbishing firm NewJaisa Technologies's initial public offering (IPO) will be open for subscription on Monday, i.e September 25. The company aims to raise 39.93 crore through its IPO… [+2063 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Brainless Brilliance: Jellyfish Stun Scientists With Learning Skills - SciTechDaily", "description": "Jellyfish Learning Abilities: Challenging Neuroscientific Notions Even without a central brain, jellyfish can learn from past experiences like humans, mice, and flies, scientists report for the first time on September 22 in the journal Current Biology. They t…", "url": "https://scitechdaily.com/brainless-brilliance-jellyfish-stun-scientists-with-learning-skills/", "urlToImage": "https://scitechdaily.com/images/Jellyfish-Brain-Art-Concept.jpg", "publishedAt": "2023-09-24T10:45:00Z", "content": "ByCell PressSeptember 24, 2023\r\nJellyfish, despite lacking centralized brains, exhibit advanced learning abilities similar to humans and other complex organisms, challenging traditional beliefs about… [+5358 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Successfully Genetically Modify Individual Cells in Living Animals - SciTechDaily", "description": "One proven method for tracking down the genetic origins of diseases is to knock out a single gene in animals and study the consequences this has for the organism. The problem is that for many diseases, the pathology is determined by multiple genes, complicati…", "url": "https://scitechdaily.com/scientists-successfully-genetically-modify-individual-cells-in-living-animals/", "urlToImage": "https://scitechdaily.com/images/Mosaic-Mouse.jpg", "publishedAt": "2023-09-24T09:34:16Z", "content": "ByETH ZurichSeptember 24, 2023\r\nResearchers have developed a technique using CRISPR-Cas to simultaneously modify multiple genes in the cells of adult animals, creating a mosaic-like pattern that simp… [+8613 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "VIR-1388: Clinical Trial of Preventive HIV Vaccine Begins - SciTechDaily", "description": "Novel vaccine includes NIH-funded technology in development since 2004. A trial of a preventive HIV vaccine candidate has begun enrollment in the United States and South Africa. The Phase 1 trial will evaluate a novel vaccine known as VIR-1388 for its safety …", "url": "https://scitechdaily.com/?p=311063", "urlToImage": "https://scitechdaily.com/images/HIV-1-Virus-Particle.jpg", "publishedAt": "2023-09-24T04:46:00Z", "content": "ByNational Institutes of Health (NIH)September 23, 2023\r\nColorized transmission electron micrograph of an HIV-1 virus particle (yellow/gold) budding from the plasma membrane of an infected H9 T cell … [+6817 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fly Fitness: How the Iditarod Protein Connects Exercise, Cold Resistance & Cell Repair - SciTechDaily", "description": "The gene, dubbed Iditarod, seems responsible for exercise’s ability to clean up damaged cells. As the days get shorter and chillier in the northern hemisphere, those who choose to work out in the mornings might find it harder to get up and running. A new stud…", "url": "https://scitechdaily.com/fly-fitness-how-the-iditarod-protein-connects-exercise-cold-resistance-cell-repair/", "urlToImage": "https://scitechdaily.com/images/Man-Fitness-Snow-Cold-Art-Concept.jpg", "publishedAt": "2023-09-23T22:08:46Z", "content": "Researchers identified a protein in fruit flies that impacts exercise in cold conditions. This protein is related to human irisin, which plays a role in exercise benefits and cold adaptation. The stu… [+3835 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists regenerate neurons that restore walking in mice after paralysis from spinal cord injury - Phys.org", "description": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after spinal cord injury. The neuroscientists have shown that re-gr…", "url": "https://phys.org/news/2023-09-scientists-regenerate-neurons-mice-paralysis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spinalcord.jpg", "publishedAt": "2023-09-23T18:09:33Z", "content": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after s… [+3605 chars]"}]}