{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 489 answer for May 28: Watch out for tricks! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 489 answer for May 28: Today’s puzzle has quite a few uncommon words. Do not try solve it on your own, better to take help from these hints, clues and solutions.", "url": "https://tech.hindustantimes.com/how-to/quordle-489-answer-for-may-28-watch-out-for-tricks-check-quordle-hints-clues-solutions-71685234233567.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/28/1600x900/HT_Tech_25_1685234333794_1685234333968.jpg", "publishedAt": "2023-05-28T00:39:22Z", "content": "Quordle 489 answer for May 28: After the relaxing time of a few days, Quordle is waking up again. Today's difficulty level has been increased so you should come prepared when playing the game. The un… [+1790 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Forgotten Formula to Climate Game Changer: A New Tool for Converting Carbon Dioxide - SciTechDaily", "description": "Scientists from Cornell University have revisited a century-old electrochemical equation, the Cottrell equation, to aid in the conversion of atmospheric carbon dioxide into a functional product, and in managing this greenhouse gas. This equation, which bears …", "url": "https://scitechdaily.com/from-forgotten-formula-to-climate-game-changer-a-new-tool-for-converting-carbon-dioxide/", "urlToImage": "https://scitechdaily.com/images/Carbon-Capture-Technology-Chemical-Engineering.jpg", "publishedAt": "2023-05-27T20:43:57Z", "content": "Scientists at Cornell University have re-purposed the 120-year-old Cottrell equation to understand the reactions carbon dioxide undergoes when subjected to electrochemistry, with the goal of converti… [+3075 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Alchemy: Cellular Waste Transformed Into Essential Chemicals - SciTechDaily", "description": "A recent study uncovers a biochemical recycling process in animals that uses cellular waste to create vital chemicals, revolutionizing our understanding of animal and human functioning. This discovery opens up new research avenues for exploring over 100,000 u…", "url": "https://scitechdaily.com/natures-alchemy-cellular-waste-transformed-into-essential-chemicals/", "urlToImage": "https://scitechdaily.com/images/Natures-Biochemical-Recycling-Secrets.jpg", "publishedAt": "2023-05-27T14:44:26Z", "content": "In a recent Nature Chemical Biology article, researchers revealed a previously unknown biochemical recycling process in animals that uses cellular waste to produce new, vital chemicals. These chemica… [+2796 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Emergence of solvated dielectrons observed for the first time - Tech Explorist", "description": "Team generates low-energy electrons using ultraviolet light.", "url": "https://www.techexplorist.com/emergence-solvated-dielectrons-observed-first-time/60703/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/solvated-electrons.jpg", "publishedAt": "2023-05-27T11:00:03Z", "content": "Scientists have several theories about solvated dielectrons, but they have never made a direct observation of one. They are a pair of dissolved electrons in liquids like water or liquid ammonia. The … [+2432 chars]"}, {"source": {"id": null, "name": "CleanTechnica"}, "author": "Jennifer Sensiba", "title": "Two Charging Companies Respond To Ford’s Adoption Of The Tesla/NACS Plug - CleanTechnica", "description": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla was using its plug and everyone else was using the CCS1 plug …", "url": "https://cleantechnica.com/2023/05/27/two-charging-companies-respond-to-fords-adoption-of-the-tesla-nacs-plug/", "urlToImage": "http://cleantechnica.com/files/2023/05/Electrify-America-Station-With-Roof-2000x1000-1-800x400.png", "publishedAt": "2023-05-27T04:15:57Z", "content": "Yesterday’s announcement that Ford’s future vehicles would be equipped with Tesla’s NACS charging connector (Supercharging port) signaled a big shift in the industry. Before the announcement, Tesla w… [+7691 chars]"}, {"source": {"id": null, "name": "Jwplayer.com"}, "author": null, "title": "Mars Helicopter Ingenuity Spots Perseverance Rover During Flight 51 - msnNOW", "description": "NASA's Mars helicopter Ingenuity flew for the 51st time. The Perseverance rover can be seen in the distance during the flight in an enhanced color image. Credit: Space.com | footage courtesy: NASA/JPL-Caltech | edited by Steve Spaleta", "url": "http://cdn.jwplayer.com/videos/ShiYw8eR-SEwM0BSG.mp4", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1bJSoa.img?h=315&w=600&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2023-05-26T18:00:00Z", "content": "Like us on Facebook to see similar stories\r\nI'm already a fan, don't show this again"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Airplane-sized asteroid set to buzz Earth at close quarters, NASA data shows - HT Tech", "description": "Airplanesized asteroid set to buzz Earth at close quarters NASA data shows Various NASA telescopes are tracking this asteroid and the data reveals that it will pass very close to the Earth today. Asteroids pose a significant danger to Earth as is clear from p…", "url": "https://tech.hindustantimes.com/web-stories/airplanesized-asteroid-set-to-buzz-earth-at-close-quarters-nasa-data-shows-71685109678186.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/space-7288750_1920_Pixabay_1685111411411_1685111423780.jpg/", "publishedAt": "2023-05-26T14:34:52Z", "content": "Photo Credit: Pixabay\r\n Various NASA telescopes are tracking this asteroid and the data reveals that it will pass very close to the Earth today.\r\nPhoto Credit: Pixabay\r\n Asteroids pose a significant … [+1571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Have Flipped the Script on Autism Genetics - SciTechDaily", "description": "Researchers from Cold Spring Harbor Laboratory (CSHL) have recently revised the commonly held genetic assumptions about autism spectrum disorder (ASD). For many years, scientists believed that siblings diagnosed with ASD tended to inherit more genetic traits …", "url": "https://scitechdaily.com/researchers-have-flipped-the-script-on-autism-genetics/", "urlToImage": "https://scitechdaily.com/images/DNA-Next-Generation-Genetics-Biotechnology.jpg", "publishedAt": "2023-05-26T08:45:49Z", "content": "ByCold Spring Harbor LaboratoryMay 26, 2023\r\nA recent study has found that siblings affected by autism inherit a greater proportion of their genetic material from their father rather than their mothe… [+4511 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "New volatile sunspot grows 4 times bigger than the Earth; Will it unleash a solar storm? - HT Tech", "description": "A new sunspot has emerged on the Sun, which has grown overnight to gain a size four times the size of the Earth. The sunspot likely harbors an unstable magnetic field and can explode, sparking a solar storm.", "url": "https://tech.hindustantimes.com/tech/news/new-volatile-sunspot-grows-4-times-bigger-than-the-earth-will-it-unleash-a-solar-storm-71685072205218.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/26/1600x900/faintyoung_1652920721271_1685072261434.jpg", "publishedAt": "2023-05-26T03:42:37Z", "content": "As astronomers continue to monitor the sunspot AR3311 for any signs of eruption, a new sunspot is making a mark on the Sun. This new sunspot was practically invisible to the telescopes of NASA and th… [+2854 chars]"}]}