{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Smartphone manufacturers still want to make foldables a thing - Ars Technica", "description": "Samsung, Motorola and Huawei continue to invest in high-priced flip devices despite weak sales", "url": "https://www.ft.com/content/d8105aab-7e67-4df7-a734-d52042598009", "urlToImage": null, "publishedAt": "2023-12-31T04:26:56Z", "content": "Keep abreast of significant corporate, financial and political developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert comment… [+30 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shadow Play: NASA's Curiosity Mars Rover Captures a Martian Day, From Dawn to Dusk - SciTechDaily", "description": "Videos from the rover show its shadow moving across the Martian surface during a 12-hour sequence while Curiosity remained parked. When NASA’s Curiosity Mars rover isn’t on the move, it works pretty well as a sundial, as seen in two black-and-white videos rec…", "url": "https://scitechdaily.com/shadow-play-nasas-curiosity-mars-rover-captures-a-martian-day-from-dawn-to-dusk/", "urlToImage": "https://scitechdaily.com/images/Sunset-on-Mars-Art-Concept.jpg", "publishedAt": "2023-12-31T03:02:59Z", "content": "NASA’s Curiosity rover recorded two time-lapse videos on Mars, showcasing its shadow moving across the Martian terrain. The videos, captured during a communication-limited period, highlight technical… [+4471 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Noah Hunter", "title": "Daily Deals: Persona 5 Royal, JBL Charge 5, Logitech G Pro X - IGN", "description": "Check out our roundup of the best deals for Saturday, December 30", "url": "https://www.ign.com/articles/daily-deals-persona-5-royal-jbl-charge-5-logitech-g-pro-x", "urlToImage": "https://assets-prd.ignimgs.com/2023/12/30/daily-deals-dec-30-1703958969860.png?width=1280", "publishedAt": "2023-12-30T18:38:55Z", "content": "Tomorrow is New Year's Eve, and that means plenty of holiday sales have begun to run down. Discounts are all over each retailer's website, with games, tech, and more receiving deep cuts. The best dea… [+11342 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Should we welcome or worry about Artificial Intelligence? - Al Jazeera English", "description": "No longer the stuff of science fiction, incredible advances in artificial intelligence or A.I. are now a reality. As the technology develops, we'll experienc...", "url": "https://www.youtube.com/watch?v=D89pRohJWrc", "urlToImage": "https://i.ytimg.com/vi/D89pRohJWrc/maxresdefault.jpg", "publishedAt": "2023-12-30T17:30:01Z", "content": null}, {"source": {"id": null, "name": "New York Post"}, "author": "Alyssa Guzman", "title": "Pentagon’s mysterious unmanned X-37B space plane blasts off on another secretive mission - New York Post ", "description": "X-37B launched from NASA’s Kennedy Space Center Thursday night for yet another top-secret mission two weeks late due to technical difficulties and powerful storms.", "url": "https://nypost.com/2023/12/29/news/pentagons-mysterious-unmanned-x-37b-blasts-off-on-seventh-secretive-mission/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/12/2023-seventh-mission-military-space-74216449.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-12-29T21:40:00Z", "content": "The US militarys mysterious X-37B unmanned space plane blasted into space Thursday night aboard SpaceXs hulking Falcon Heavy rocket for yet another secretive mission involving “groundbreaking” experi… [+2733 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists modeled the different signatures of a kilonova explosion simultaneously - Tech Explorist", "description": "The goldmine of a neutron star collision.", "url": "https://www.techexplorist.com/scientists-modeled-different-signatures-kilonova-explosion-simultaneously/79100/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/12/two-merging-neutron-stars.jpg", "publishedAt": "2023-12-29T17:49:24Z", "content": "Neutron stars form when big stars end their lives. They squeeze a lot of mass into a tiny space, making a super-dense star about 10 kilometers wide. In 2017, scientists saw the results of two neutron… [+2705 chars]"}]}