{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Ars Technica System Guide: Four sample PC builds, from $500 to $5,000 - Ars Technica", "description": "Despite everything, it’s still possible to build decent PCs for decent prices.", "url": "https://arstechnica.com/gadgets/2025/08/ars-technica-system-guide-back-to-pc-building-for-back-to-school/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/IMG_2568-1152x648.jpeg", "publishedAt": "2025-08-18T11:00:25Z", "content": null}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Apple Vision Pro’s Ridiculously High Price And Increased Weight Already Makes It A Tough Sell, With A Report Stating That The Company Is Not Making Things Easier By Delaying Its Most Compelling Feature - Wccftech", "description": "Whatever sales the Apple Vision Pro garnered, a report mentions that the technology giant is not helping matters by taking its time with an attractive feature", "url": "https://wccftech.com/apple-vision-pro-most-compelling-feature-is-not-arriving-hampering-sales/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/08/Apple-Vision-Pro-1.jpg", "publishedAt": "2025-08-17T18:09:00Z", "content": "The last time the Apple Vision Pros sales were discussed, the overly expensive headset did not even cross 500,000 units since its official launch in January 2024. Despite the hardware having no equal… [+2418 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Hidden Geometry That Could Explain the Universe - SciTechDaily", "description": "How can the tiniest particles and the vast structure of the universe be explained using the same kind of mathematics? This puzzle is the focus of recent research by mathematicians Claudia Fevola (Inria Saclay) and Anna-Laura Sattelberger (Max Planck Institute…", "url": "https://scitechdaily.com/the-hidden-geometry-that-could-explain-the-universe/", "urlToImage": "https://scitechdaily.com/images/Shape-Universe-Algebraic-Geometry-scaled.jpg", "publishedAt": "2025-08-17T16:03:23Z", "content": "Illustration of a set of real zeros of a graph polynomial (middle) and two Feynman diagrams. Credit: Max Planck Institute for Mathematics in the Sciences\r\nHow can the tiniest particles and the vast s… [+7285 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Mega-Quake Shocked Myanmar. Could California Be Next? - SciTechDaily", "description": "Myanmar’s 2025 quake reveals that major faults may unleash far larger, more unpredictable earthquakes than scientists once believed.", "url": "https://scitechdaily.com/a-mega-quake-shocked-myanmar-could-california-be-next/", "urlToImage": "https://scitechdaily.com/images/Seismic-Activity-Earthquake-California-Map.jpg", "publishedAt": "2025-08-17T10:28:13Z", "content": "Myanmar’s 2025 quake reveals that major faults may unleash far larger, more unpredictable earthquakes than scientists once believed. Credit: Shutterstock\r\nA massive quake in Myanmar revealed the Saga… [+6081 chars]"}]}