{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "OnePlus Nord 4 vs OnePlus 12R: Price, display, processor, battery and more compared | Mint - Mint", "description": "The OnePlus 12R offers premium features with a Snapdragon 8 Gen 2 chipset, advanced display technology, and a versatile camera setup at a higher price. The OnePlus Nord 4 provides a balanced, budget-friendly option with a Snapdragon 7+ Gen 3 chipset, bright d…", "url": "https://www.livemint.com/technology/gadgets/oneplus-nord-4-vs-oneplus-12r-price-display-processor-battery-and-more-compared-11721149706582.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/07/16/1600x900/cds_1721135649426_1721149930003.jfif", "publishedAt": "2024-07-17T04:11:17Z", "content": "At their summer launch event in Milan, Italy, OnePlus introduced the newest version of their budget-friendly Nord series: the OnePlus Nord 4. This phone features a metal unibody design and is powered… [+4807 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of LUCA, Earth’s Earliest Life Form - SciTechDaily", "description": "A University of Bristol-led study found that life on Earth, stemming from a common ancestor called LUCA, flourished soon after the planet's formation. Through genetic analysis and evolutionary modeling, researchers pinpointed LUCA's existence to about 4.2 bil…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-luca-earths-earliest-life-form/", "urlToImage": "https://scitechdaily.com/images/LUCA-Under-Attack-From-Viruses-scaled.jpg", "publishedAt": "2024-07-17T03:10:45Z", "content": "A digital representation illustrating how LUCA was already under attack from viruses even at 4.2 billion years ago. Credit: Science Graphic Design\r\nA University of Bristol-led study found that life o… [+5231 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Dhanya Nagasundaram", "title": "US Market: Dow Jones gains over 740 points, Russell 2000 small-cap index rise on rate cut bets | Stock Market News - Mint", "description": "US Market News: Dow Jones hits record high as investors anticipate Federal Reserve easing cycle to control inflation and prevent recession. Gold prices also reach all-time high. Nasdaq gains restrained by weaker tech firms. on longest winning streak since 200…", "url": "https://www.livemint.com/market/stock-market-news/us-market-dow-jones-gains-over-740-points-russell-2000-small-cap-index-rise-on-rate-cut-bets-11721181365597.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/07/17/1600x900/g4a2f53ed96bfbca63a996baf2372a353d4b1e5d838511060e_1721126769778_1721182509445.jpg", "publishedAt": "2024-07-17T02:29:40Z", "content": "US Market News: Tuesday's record-breaking closing high for the Dow Jones Industrial Average and Wall Street stocks came from data supporting the belief that the US Federal Reserve is about to embark … [+3021 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Samuel Axon", "title": "YouTube creators surprised to find Apple and others trained AI on their videos - Ars Technica", "description": "Once again, EleutherAI's data frustrates professional content creators.", "url": "https://arstechnica.com/ai/2024/07/apple-was-among-the-companies-that-trained-its-ai-on-youtube-videos/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/07/Screenshot-2024-07-16-153158-760x380.png", "publishedAt": "2024-07-16T21:23:19Z", "content": "Enlarge/ YouTuber Marques Brownlee discusses iOS 18 in a new video. This specific video wasn't part of the large dataset that was used to train AI models, but many of his others were.\r\n69\r\nAI models … [+5454 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Eternal Day and Night: Webb’s Journey To Understand a Distant World’s Bizarre Atmosphere - SciTechDaily", "description": "Near-infrared spectral analysis of terminator confirms differences in morning and evening atmosphere. Since the first exoplanet was discovered in 1992, thousands of planets orbiting stars outside of our solar system have been confirmed through a myriad of dif…", "url": "https://scitechdaily.com/eternal-day-and-night-webbs-journey-to-understand-a-distant-worlds-bizarre-atmosphere/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-WASP-39-b-and-Star-scaled.jpg", "publishedAt": "2024-07-16T20:46:00Z", "content": "Researchers using the James Webb Space Telescope have uncovered atmospheric differences on the exoplanet WASP-39 b, revealing temperature variations and distinct cloud cover across its tidally locked… [+10506 chars]"}]}