{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Top gainers, losers today: Bajaj twins, Bharti Airtel, Tech Mahindra, Eicher Motors; check full list here | Mint - Mint", "description": "Sensex and Nifty 50 hit record highs but gains were limited due to mixed sectoral trends. Auto and oil & gas stocks were losers, while IT and banking stocks performed well.", "url": "https://www.livemint.com/market/stock-market-news/top-gainers-losers-today-bajaj-twins-bharti-airtel-tech-mahindra-eicher-motors-check-full-list-here-11688468053957.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/04/600x338/2-0-73350966-IM06-143839-pih-0_1681364162606_1688468309516.jpg", "publishedAt": "2023-07-04T11:00:01Z", "content": "Sensex and Nifty 50 extended their record-high levels on Tuesday, however, the upside was limited due to mixed trend seen in sectoral indices. Auto and oil &amp; gas stocks were top losers, while IT … [+2729 chars]"}, {"source": {"id": null, "name": "Technext24.com"}, "author": null, "title": "New Apple AirPods Pro will also double as hearing aids - Technext", "description": "Apple airpods pro plans to introduce solutions to hearing dilemma amid other features to its users. The date this will take effect is yet unknown.", "url": "https://technext24.com/2023/07/04/new-apple-airpods-pro-double-hearing-aid/", "urlToImage": "https://technext24.com/wp-content/uploads/2023/07/Apple-Airpods-Pro-Gen-2-vs.-Apple-Airpods-Pro-Gen-1-Hero-Image-2-scaled-1.jpg", "publishedAt": "2023-07-04T09:00:00Z", "content": "Apple is reportedly set to release new features in AirPods Pro that will enable the device also act as a hearing aid. Among the anticipated features, Apple is said to be developing a function that mi… [+2555 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Leaked Samsung Galaxy Z Fold 5 images reveal major benefit for users - HT Tech", "description": "Samsung could introduce a welcome change with the Samsung Galaxy Z Fold 5, and images of the same have leaked on Twitter.", "url": "https://tech.hindustantimes.com/mobile/news/leaked-samsung-galaxy-z-fold-5-images-reveal-major-benefit-for-users-71688460039149.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/04/1600x900/onur-binay-sPxk3zxpQ08-unsplash_1688460250788_1688460256613.jpg", "publishedAt": "2023-07-04T08:45:06Z", "content": "Samsung has been one of the top-most long-standing names when it comes to foldable smartphones and it has dominated the market since the launch of its first foldable smartphone, the Samsung Galaxy Fo… [+1904 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Elusive Ninth Dedekind Number Discovered: Unlocking a Decades-Old Mystery of Mathematics - SciTechDaily", "description": "Scientists from the Universities of Paderborn and Leuven solve long-known problem in mathematics. Making history with 42 digits: Scientists at Paderborn University and KU Leuven have unlocked a decades-old mystery of mathematics with the so-called ninth Dedek…", "url": "https://scitechdaily.com/?p=289258", "urlToImage": "https://scitechdaily.com/images/Mathematics-Problem-Mystery-Concept.jpg", "publishedAt": "2023-07-04T08:25:01Z", "content": "Mathematicians at Paderborn University and KU Leuven, using the Noctua supercomputer and specialized hardware accelerators, have solved a decades-old problem by calculating the ninth Dedekind number,… [+6774 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "The detection of the Universe's background gravitational wave radiation: a scientific triumph - WSWS", "description": "The same confident optimism which organized thousands of scientists towards the successful detection of high-frequency gravitational waves in 2015 now has produced its first fruit with another detector technology and strategy in seeing the background of long-…", "url": "https://www.wsws.org/en/articles/2023/07/04/zxwd-j04.html", "urlToImage": "https://www.wsws.org/asset/71369476-ff16-4582-bedb-684d5cd98315?rendition=1600x900", "publishedAt": "2023-07-04T02:07:48Z", "content": "Count what is countable, measure what is measurable, and what is not measurable, make measurableattributed to Galileo Galilei\r\nThe detection of a predicted universal background of gravitational waves… [+18931 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Intensely Powerful X1.0 Solar Flare Witnessed by NASA's Solar Dynamics Observatory - SciTechDaily", "description": "The Sun emitted a strong solar flare, peaking at 7:14 p.m. EDT (4:14 p.m. PDT) on July 2, 2023. NASA’s Solar Dynamics Observatory, which watches the Sun constantly, captured an image of the event. This flare is classified as an X1.0 flare. X-class denotes the…", "url": "https://scitechdaily.com/intensely-powerful-x1-0-solar-flare-witnessed-by-nasas-solar-dynamics-observatory/", "urlToImage": "https://scitechdaily.com/images/July-2023-X-Class-Solar-Flare.jpg", "publishedAt": "2023-07-04T00:44:45Z", "content": "ByNASA Goddard Space Flight CenterJuly 3, 2023\r\nNASAs Solar Dynamics Observatory captured this image of a solar flare as seen in the bright flash on the top right area of the Sun on July 2, 2023. The… [+3770 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of “Good Fat” – Protein Discovery Advances Potential Treatments for Obesity and Diabetes - SciTechDaily", "description": "Findings represent the first structural details of uncoupling protein 1 (UCP1), which allows fat tissue to burn off calories as heat. New research has unlocked insights into how “good fat” tissue could potentially be harnessed to combat obesity and remove glu…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-good-fat-protein-discovery-advances-potential-treatments-for-obesity-and-diabetes/", "urlToImage": "https://scitechdaily.com/images/Weight-Loss-Success-Before-and-After.jpg", "publishedAt": "2023-07-03T21:04:49Z", "content": "ByUniversity of PennsylvaniaJuly 3, 2023\r\nScientists have unveiled the atomic structure of UCP1, a protein key to calorie burning in good brown fat. This discovery, enabled by a cryogenic electron mi… [+3676 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "As Twitter flounders, Mastodon refreshes its official app for Android users - TechCrunch", "description": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, Mastodon is launching a significant refresh of its Android app.", "url": "https://techcrunch.com/2023/07/03/as-twitter-flounders-mastodon-refreshes-its-official-app-for-android-users/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/mastodon-app-android.png?resize=1200,734", "publishedAt": "2023-07-03T19:48:55Z", "content": "While Twitter is busy limiting the number of readable tweets and breaking its TweetDeck app, open source Twitter alternative Mastodon is celebrating the launch of a significant refresh of its Android… [+3300 chars]"}]}