{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hidden Depths: Uncovering Theia's Mysterious Remnants Inside Earth - SciTechDaily", "description": "New research suggests that large remnants of Theia, a Mars-sized object that collided with Earth to form the Moon, still exist within Earth's mantle. These remnants are thought to be linked to seismic anomalies and could provide insights into Earth's geologic…", "url": "https://scitechdaily.com/hidden-depths-uncovering-theias-mysterious-remnants-inside-earth/", "urlToImage": "https://scitechdaily.com/images/Theia-Colliding-With-Earth-scaled.jpg", "publishedAt": "2023-11-27T03:39:00Z", "content": "ByDavid Rothery, The Open University.November 26, 2023\r\nArtists impression of Theia colliding with the Earth billions of years ago. Credit: Hongping Deng and Hangzhou Sphere Studio\r\nNew research sugg… [+5350 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes or Asteroid? AI Ends Debate Over Dinosaur Extinction Event - SciTechDaily", "description": "Free-thinking computers reverse-engineered the fossil record to identify the causes of a cataclysm. To address the long-standing debate about whether a massive asteroid impact or volcanic activity caused the extinction of dinosaurs and numerous other species …", "url": "https://scitechdaily.com/volcanoes-or-asteroid-ai-ends-debate-over-dinosaur-extinction-event/", "urlToImage": "https://scitechdaily.com/images/Dinosaur-Extinction-Volcano-Asteroid.jpg", "publishedAt": "2023-11-27T02:28:29Z", "content": "ByDartmouth CollegeNovember 26, 2023\r\nDartmouth scientists used an innovative computer model to suggest that volcanic activity, rather than an asteroid impact, was the primary cause of the mass extin… [+9016 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "PCMag", "title": "140+ Early Cyber Monday Tech Deals For Less Than $100: Apple, Sony, Samsung, and More - PCMag", "description": null, "url": "https://www.pcmag.com/news/best-early-cyber-monday-tech-electronics-deals-under-100-dollars", "urlToImage": null, "publishedAt": "2023-11-26T21:56:12Z", "content": null}, {"source": {"id": null, "name": "Android Police"}, "author": "Luke Filipowicz", "title": "Best Buy kicks off its official Cyber Monday Savings Event with up to 50% off TVs, Chromebooks, phones, and more - Android Police", "description": "Best Buy's Cyber Monday Savings Event launches with huge deals on all your favorite tech!", "url": "https://www.androidpolice.com/best-buy-kicks-off-its-official-cyber-monday-savings-event/", "urlToImage": "https://static1.anpoimages.com/wordpress/wp-content/uploads/2022/11/bravia-xr-a80j-oled.jpg", "publishedAt": "2023-11-26T21:26:00Z", "content": "Even though Cyber Monday officially starts tomorrow, Best Buy isn't waiting to offer the season's best deals, so you don't have to wait to save money on all the best tech this year. If you thought th… [+1754 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Surprise: Plants Might Be Able To Absorb More CO2 Than Expected - SciTechDaily", "description": "A new study reveals that plants might absorb more CO2 than expected, offering hope in combating climate change. However, reducing emissions remains crucial, as planting trees alone isn't a sufficient solution. New research published on November 17 in Science …", "url": "https://scitechdaily.com/natures-surprise-plants-might-be-able-to-absorb-more-co2-than-expected/", "urlToImage": "https://scitechdaily.com/images/Forest-Absorbs-Carbon-Dioxide-Like-Lungs-Concept-Art.jpg", "publishedAt": "2023-11-26T21:19:55Z", "content": "ByTrinity College DublinNovember 26, 2023\r\nRecent research indicates that plants could absorb more atmospheric CO2 than previously believed, providing a hopeful perspective on climate change mitigati… [+6390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk To Meet Israel's Netanyahu Amid Row Over Anti-Jewish Post - NDTV", "description": "Elon Musk, the tech entrepreneur accused by civil rights groups of amplifying anti-Jewish hatred on his X social media platform, will meet Prime Minister Benjamin Netanyahu and President Isaac Herzog in Israel on Monday, Channel 12 TV said on Sunday.", "url": "https://www.ndtv.com/world-news/elon-musk-to-meet-israeli-pm-netanyahu-today-report-4608711", "urlToImage": "https://c.ndtvimg.com/2023-11/t010ooe_elon-musk_625x300_18_November_23.jpeg", "publishedAt": "2023-11-26T20:35:22Z", "content": "Elon Musk has said X should be a platform for people to post diverse viewpoints (File)\r\nElon Musk, the tech entrepreneur accused by civil rights groups of amplifying anti-Jewish hatred on his X socia… [+3152 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Tata Technologies IPO: Check share allotment and listing dates, grey market premium - Moneycontrol", "description": "Tata Technologies IPO: The company is expected to finalise the basis of allotment of IPO shares by November 28.", "url": "https://www.moneycontrol.com/news/business/ipo/tata-technologies-ipo-check-share-allotment-and-listing-dates-grey-market-premium-11813781.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/11/TataTechnologies2-770x433.jpg", "publishedAt": "2023-11-26T11:59:44Z", "content": "After receiving an amazing response to the IPO from across categories of investors last week, all eyes will now be on the share allotment by Tata Technologies, the subsidiary of Tata Motors. The comp… [+3966 chars]"}]}