{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Peregrine lander burned up in the atmosphere after failed mission - Scripps News", "description": "NASA and the private aerospace company Astrobotic Technology confirmed that their lunar lander, the Peregrine, burned up as it reentered Earth's atmosphere o...", "url": "https://www.youtube.com/watch?v=24SeAL715go", "urlToImage": "https://i.ytimg.com/vi/24SeAL715go/maxresdefault.jpg", "publishedAt": "2024-01-19T23:09:25Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "After Netflix says no, other app makers debate a Vision Pro launch - TechCrunch", "description": "YouTube is following in Netflix’s footsteps as it decides not to release a dedicated app for the Apple Vision Pro’s upcoming launch. Like Netflix YouTube is following in Netflix’s footsteps as it decides not to release a dedicated app for the Apple Vision Pro…", "url": "https://techcrunch.com/2024/01/19/youtube-and-other-apps-missing-from-apple-vision-pro-launch/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/wwdc-2023-vision-pro-lifestyle-plane-e1686004427171.jpg?w=1200", "publishedAt": "2024-01-19T21:21:21Z", "content": "YouTube is following in Netflixs footsteps as it decides not to release a dedicated app for the Apple Vision Pros upcoming launch. Like Netflix subscribers, viewers will have to go to the web browser… [+2962 chars]"}, {"source": {"id": null, "name": "TechNode"}, "author": "Jessie Wu", "title": "Huawei launches HarmonyOS NEXT to break away from Android · TechNode - TechNode", "description": "Huawei announced open applications for its developer preview version of HarmonyOS NEXT, with plans to release a more feature-complete developer beta version in the second quarter and a commercial version by the fourth quarter of 2024 as it looks to cut its ti…", "url": "http://technode.com/2024/01/19/huawei-launches-harmonyos-next-with-ambitious-plans-to-break-away-from-android/", "urlToImage": "https://technode.com/wp-content/uploads/2024/01/next.jpg", "publishedAt": "2024-01-19T09:40:22Z", "content": "Every Wednesday and Friday, TechNodes Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\r\nOn Thursday, Huawei announced open applications for its… [+3053 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Axiom, SpaceX launch third all-private crew mission to space station - Ars Technica", "description": "A US-Spanish dual citizen commands a crew of Italian, Swedish, and Turkish astronauts.", "url": "https://arstechnica.com/space/2024/01/all-european-crew-takes-aim-on-international-space-station/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/01/IMG_4873-copy-760x380.jpg", "publishedAt": "2024-01-19T04:08:41Z", "content": "Enlarge/ A Falcon 9 rocket lifts off from NASA's Kennedy Space Center to begin the Ax-3 commercial crew mission.\r\n40\r\nFor the third time, an all-private crew is heading for the International Space St… [+8194 chars]"}]}