{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 breathtaking images of planets shared by NASA: Jupiter storms, Ganymede and more - HT Tech", "description": "Top 5 breathtaking images of planets shared by NASA Jupiter storms Ganymede and more Take a journey through our solar system with NASAs amazing pictures From Jupiters giant storms to colourful cloud swirls explore these stunning views of our cosmic neighbourh…", "url": "https://tech.hindustantimes.com/web-stories/top-5-breathtaking-images-of-planets-shared-by-nasa-jupiter-storms-ganymede-and-more-71719311048992.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/25/1600x900/Top_5_breathtaking__images_of_planets_shared_by_NA_1719311196186_1719311196618.jpg/", "publishedAt": "2024-06-25T05:02:30Z", "content": "Photo Credit: NASA Take a journey through our solar system with NASA's amazing pictures! From Jupiter's giant storms to colourful cloud swirls, explore these stunning views of our cosmic neighbourhoo… [+1006 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA shares top 5 stunning images of celestial wonders captured by Hubble Space Telescope - HT Tech", "description": "NASA shares top 5 stunning images of celestial wonders captured by Hubble Space Telescope NASA highlights five breathtaking images from the Hubble Space Telescope showcasing supernovas galaxies and star formations offering a glimpse into the universes mesmeri…", "url": "https://tech.hindustantimes.com/web-stories/nasa-shares-top-5-stunning-images-of-celestial-wonders-captured-by-hubble-space-telescope-71719290129808.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/25/1600x900/NASA_shares_top_5_stunning_images_of_celestial_won_1719290231526_1719290231885.jpg/", "publishedAt": "2024-06-24T23:12:05Z", "content": "Photo Credit: NASA NASA highlights five breathtaking images from the Hubble Space Telescope, showcasing supernovas, galaxies, and star formations, offering a glimpse into the universe's mesmerising b… [+1327 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Faster Than the Speed of Light: Information Transfer Through “Spooky Action at a Distance” at the Large Hadron Collider - SciTechDaily", "description": "Researchers have confirmed that quantum entanglement persists between top quarks, the heaviest known fundamental particles. Physicists have demonstrated quantum entanglement in top quarks and their antimatter partners, a discovery made at CERN. This finding e…", "url": "https://scitechdaily.com/faster-than-the-speed-of-light-information-transfer-through-spooky-action-at-a-distance-at-the-large-hadron-collider/", "urlToImage": "https://scitechdaily.com/images/CMS-Central-Beampipe-Installation-scaled.jpg", "publishedAt": "2024-06-24T12:37:40Z", "content": "The inside of the Compact Muon Solenoid (CMS) experiment at the Large Hadron Collider. Rochester physicists working at the detector have observed spin entanglement between top quarks and top antiquar… [+4988 chars]"}]}