{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Telescope Captures Massive Asteroid Collision in Neighboring Star System - SciTechDaily", "description": "New observations spotlight the volatile processes that shape star systems like our own, offering a unique glimpse into the primordial stages of planetary formation. Astronomers have captured a snapshot of a giant asteroid collision in Beta Pictoris, revealing…", "url": "https://scitechdaily.com/webb-telescope-captures-massive-asteroid-collision-in-neighboring-star-system/", "urlToImage": "https://scitechdaily.com/images/Asteroid-Collision-Concept-Illustration-Art.jpg", "publishedAt": "2024-06-13T21:27:11Z", "content": "Astronomers observed a giant asteroid collision in Beta Pictoris, using data from the Webb and Spitzer telescopes. The event, occurring 20 years ago, offers new insights into early planetary formatio… [+6947 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Christine Hall", "title": "Here’s everything Apple announced at the WWDC 2024 keynote, including Apple Intelligence, Siri makeover - TechCrunch", "description": "The TechCrunch the team runs down all of the biggest news from the Apple WWDC 2024 keynote in an easy-to-skim digest.", "url": "https://techcrunch.com/2024/06/13/everything-apple-announced-wwdc-2024/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Tim-Cook-Apple-WWDC.png?resize=1200,678", "publishedAt": "2024-06-13T19:00:00Z", "content": "Its WWDC 2024 keynote time! Each year Apple kicks off its Worldwide Developers Conference with a few hours of just straight announcements, like the long-awaited Apple Intelligence and a makeover for … [+14109 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Zo Ahmed", "title": "Massive Epic Games leak hints at highly anticipated PC releases, including new Turok game - TechSpot", "description": "The leaked list includes games from heavy hitters like Bethesda, Sega, Sony, Square Enix, and more. It requires some detective work since all titles are listed under...", "url": "https://www.techspot.com/news/103376-massive-epic-games-leak-hints-highly-anticipated-pc.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/06/2024-06-13-image-6.jpg", "publishedAt": "2024-06-13T13:12:00Z", "content": "What just happened? A massive Epic Games Store leak has provided clues for gamers craving intel on the next wave of releases. The information comes courtesy of unofficial tracker EpicDB, which manage… [+2644 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Nandini Yadav", "title": "With Xiaomi 14 Civi we have brought gun to a knife fight, says Xiaomi India CMO Anuj Sharma - India Today", "description": "At the launch event of the Xiaomi 14 Civi in India Xiaomi India CMO Anuj Sharma discussed the smartphones pricing AI features and future plans in a conversation with India Today Tech", "url": "https://www.indiatoday.in/technology/features/story/with-xiaomi-14-civi-we-have-brought-gun-to-a-knife-fight-xiaomi-india-cmo-anuj-sharma-2552732-2024-06-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/xiaomi-india-cmo-anuj-sharma-134207784-16x9_0.jpg?VersionId=RR2ZzKM1JAZn5m_NnBxjWNZqay7pVndE", "publishedAt": "2024-06-13T09:42:52Z", "content": "“I don’t think it’s fair what we have done,” says Xiaomi India’s chief marketing officer Anuj Sharma, as he twists open a candy and pops it in his mouth. “I think we have brought a gun to a knife fig… [+4168 chars]"}]}