{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Is It Safe for Humans To Go Up to Space? ISS Experiments Reveal Risks for Future Space Flights - SciTechDaily", "description": "The study in mouse cells analyzed the impact of space radiation and will help scientists better estimate the safety and dangers of space travel. An international team of scientists conducted a long-term experiment onboard the International Space Station to in…", "url": "https://scitechdaily.com/is-it-safe-for-humans-to-go-up-to-space-iss-experiments-reveal-risks-for-future-space-flights/", "urlToImage": "https://scitechdaily.com/images/Astronaut-in-Outer-Space.jpg", "publishedAt": "2022-11-19T19:57:59Z", "content": "ByOsaka Metropolitan UniversityNovember 19, 2022\r\nAstronauts may be exposed to high energy charged particles from galactic cosmic rays and solar particle events, as well as secondary protons and neut… [+4990 chars]"}, {"source": {"id": null, "name": "Icrt.cu"}, "author": null, "title": "130 intermediate technicians and skilled workers graduate from Florida classrooms - Radio Florida, Noticias y Actualidades de Florida", "description": "Florida, Nov. 19.- The graduation of 130 students from the professional technical education level constitutes one of the main results of the Education sector in Florida at the end of this school", "url": "https://www.radioflorida.icrt.cu/89282-130-intermediate-technicians-and-skilled-workers-graduate-from-florida-classrooms/", "urlToImage": "https://www.radioflorida.icrt.cu/wp-content/uploads/2022/11/ensenanza-tecnico-profesional-600x400-1.jpg", "publishedAt": "2022-11-19T19:51:11Z", "content": "Florida, Nov. 19.- The graduation of 130 students from the professional technical education level constitutes one of the main results of the Education sector in Florida at the end of this school year… [+847 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Flipping the Script” – New Research Rewrites the Evolutionary Story of Gills - SciTechDaily", "description": "The study adds a new, early chapter to the evolutionary tale of gills. Most fish species depend on their gills to breathe underwater. Less widely known is the fact that, like kidneys in other animals, fish gills control the pH and salt balance of their blood.…", "url": "https://scitechdaily.com/flipping-the-script-new-research-rewrites-the-evolutionary-story-of-gills/", "urlToImage": "https://scitechdaily.com/images/Evolution-of-Gills.png", "publishedAt": "2022-11-19T18:47:11Z", "content": "Well before evolving to help vertebrates breathe underwater, gills played an early and equally important role in regulating the salt and pH balance of blood, according to surprising new research from… [+3303 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Paul Tassi", "title": "Pokemon Scarlet And Violet’s Tech Problems Are On Game Freak, Not The Switch - Forbes", "description": "Game Freak is to blame for how bad Pokemon Scarlet and Violet are performing, even if Nintendo should upgrade the Switch soon too.", "url": "https://www.forbes.com/sites/paultassi/2022/11/19/pokemon-scarlet-and-violets-tech-problems-are-on-game-freak-not-the-switch/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/6378e032e6034480162d6c0f/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-11-19T13:58:18Z", "content": "Pokemon Scarlet and Violet\r\nGame Freak\r\nWhile yes, we have reached a point in the lifecycle of the Nintendo Switch where the handheld console is roughly two full generations of tech behind its rivals… [+2346 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Exceeding Expectations” – Orion Spacecraft Conducts First Inspection - SciTechDaily", "description": "https://youtu.be/pCp-VY2VxGY On the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfway to the Moon. Credit: NASA On the third day of its Arte…", "url": "https://scitechdaily.com/exceeding-expectations-orion-spacecraft-conducts-first-inspection/", "urlToImage": "https://scitechdaily.com/images/Orion-Captures-Moon-With-Camera-on-Solar-Array.gif", "publishedAt": "2022-11-19T11:16:10Z", "content": "ByNASANovember 19, 2022\r\nOn the third day of the Artemis I mission, Orion maneuvered its solar arrays and captured the Moon with a camera mounted on the end of the array. The spacecraft is now halfwa… [+4514 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "There are now 8 billion people in the world – here’s what that means for the future - BusinessTech", "description": "There are 8 billion people in the world. That’s a fact. It’s a thing we can’t deny. Like the fact that", "url": "https://businesstech.co.za/news/lifestyle/643463/there-are-now-8-billion-people-in-the-world-heres-what-that-means-for-the-future/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Large-crowd.jpg", "publishedAt": "2022-11-19T11:09:16Z", "content": "The worlds population reached 8 billion Tuesday (15 November), according to estimates from the United Nations, even as the international body said that a surge in births in lower-income countries is … [+2563 chars]"}, {"source": {"id": null, "name": "ZDNet"}, "author": "Rebecca Isaacs", "title": "35+ best Amazon Black Friday deals 2022: Save now on Fire TV, iPad, Ring cameras, and more - ZDNet", "description": "Amazon's Black Friday plan involves getting the deals straight to you earlier this year. Shop its deals and score big savings on top tech items and gifts.", "url": "https://www.zdnet.com/article/early-amazon-black-friday-deals-november-18-2022/", "urlToImage": "https://www.zdnet.com/a/img/resize/f7bb0eb76df0df6ecce573b978ee396d1b345f86/2022/11/17/60a61358-377a-41df-a445-181b3b815342/best-amazon-black-friday-deals.jpg?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2022-11-19T02:33:42Z", "content": "ZDNET's recommendations are based on many hours of testing, research, and comparison shopping. We gather data from the best available sources, including vendor and retailer listings as well as other … [+1152 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Susan Caminiti", "title": "Testing Meta’s Quest Pro VR headset with CNBC Technology Executive Council members - CNBC", "description": "Two CNBC Technology Executive Council members give Meta's Quest Pro headset a test spin to see if things are really better in the metaverse.", "url": "https://www.cnbc.com/2022/11/18/testing-metas-quest-headset-with-cnbc-tech-executive-council-members.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107133203-1665581669729-gettyimages-1243896879-META_CONNECT_2022.jpeg?v=1668790233&w=1920&h=1080", "publishedAt": "2022-11-18T16:50:33Z", "content": "It's no secret that Meta CEO Mark Zuckerberg is betting big on the metaverse.\r\nThe company poured $10 billion into its Reality Labs business last year to help flesh out Meta's vision of a new kind of… [+3614 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Liftoff! Stunning Photos of Successful Launch for JPSS-2, LOFTID - SciTechDaily", "description": "Last week the NOAA’s Joint Polar Satellite System-2 (JPSS-2) satellite, with NASA’s LOFTID technology demonstration along for the ride, lifted off from Space Launch Complex-3 at Vandenberg Space Force Base in California. Powered by 860,000 pounds of thrust fr…", "url": "https://scitechdaily.com/liftoff-stunning-photos-of-successful-launch-for-jpss-2-loftid/", "urlToImage": "https://scitechdaily.com/images/JPSS-2-and-LOFTID-Launch-Moon-scaled.jpg", "publishedAt": "2022-11-18T15:03:19Z", "content": "ByNASANovember 18, 2022\r\nThe Moon makes a stunning backdrop for the successful launch of the third in a series of polar-orbiting weather satellites for the National Oceanic and Atmospheric Administra… [+3595 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major headache for new climate laws in South Africa - BusinessTech", "description": "A recent report by the Parliamentary Monitoring Group examined the actions and effectiveness of the country’s Parliament in achieving outcomes in relation to the climate change agenda, with some disturbing findings.", "url": "https://businesstech.co.za/news/government/644195/major-headache-for-new-climate-laws-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Ramaphosa-Green-Earth-Climate-Change-v2.jpg", "publishedAt": "2022-11-18T08:33:39Z", "content": "The Parliamentary Monitoring Group (PMG) has found that critical climate bills are not given enough engagement nor properly understood by people in parliament – stalling progress and creating headach… [+3571 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Royal Ibeh", "title": "Huawei Launches Transformative Fintech Offering To Revolutionise Mobile Money - Leadership News", "description": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial", "url": "https://leadership.ng/huawei-launches-transformative-fintech-offering-to-revolutionise-mobile-money/", "urlToImage": "https://leadership.ng/wp-content/uploads/2022/08/HUAWEI-2.jpg", "publishedAt": "2022-11-18T07:45:50Z", "content": "Huawei has announced the launch of an innovative fintech offering, which is set to revolutionise mobile money in Africa, aiming to increase financial inclusion and improve the consumers digital user … [+3073 chars]"}]}