{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Health Minister Discusses Covaxin's Emergency Use Listing With WHO Chief - NDTV", "description": "COVID-19 Technology Access Pool (C-TAP) was launched in May last year for facilitating timely, equitable and affordable access of COVID-19 health products by boosting their supply.", "url": "https://www.ndtv.com/india-news/health-minister-mansukh-mandaviya-speaks-to-who-chief-discuss-covaxin-vaccine-export-2581364", "urlToImage": "https://c.ndtvimg.com/2021-09/etuk1oeo_mansukh-mandaviyaindous-health-dialogue-_625x300_28_September_21.jpg", "publishedAt": "2021-10-20T04:24:00Z", "content": "Health Minister Mansukh Mandaviya spoke to WHO chief Tedros Adhanom Ghebreyesus today.\r\nUnited Nations/Geneva: WHO chief Tedros Adhanom Ghebreyesus discussed the issue of the emergency use listing of… [+2582 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Josh Atkinson", "title": "A Vietnamese player smashes a new iPhone 13 box, but is it incredibly cheap technology? - SwordsToday.ie", "description": "The Vietnamese team officially returns home officially after the fourth match of the third qualifying round of the World Cup. Currently, players are actively...", "url": "https://swordstoday.ie/a-vietnamese-player-smashes-a-new-iphone-13-box-but-is-it-incredibly-cheap-technology/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/10/A-Vietnamese-player-smashes-a-new-iPhone-13-box-but.jpg", "publishedAt": "2021-10-19T23:14:57Z", "content": "The Vietnamese team officially returns home officially after the fourth match of the third qualifying round of the World Cup. Currently, players are actively training to prepare for the match against… [+1195 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Zak Islam", "title": "The Dark Web has become darker and busier, cybercrime services cost less than $500 - TechSpot", "description": "Cloud security firm, Bitglass, recreated a data tracking experiment from 2015 by inventing a fictional identity selling login and password data. Researchers then posted the information in...", "url": "https://www.techspot.com/news/91830-dark-web-has-become-darker-busier-cybercrime-services.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2021/10/2021-10-19-image-27.jpg", "publishedAt": "2021-10-19T22:42:00Z", "content": "Why it matters: The dark web is still alive and kicking, and it's become more dangerous than ever. New research highlights how the value of stolen data and general cybercriminal behavior has evolved … [+3594 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Zack Whittaker", "title": "A massive ‘stalkerware’ leak puts the phone data of thousands at risk - TechCrunch", "description": "Call records, text messages, and location data from hundreds of thousands of phones are easily accessible.", "url": "http://techcrunch.com/2021/10/19/stalkerware-security-phone-data-thousands/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/10/stalkerware-leaked-location-2.jpg?w=711", "publishedAt": "2021-10-19T20:02:32Z", "content": "The private phone data of hundreds of thousands of people are at risk. Call records, text messages, photos, browsing history, precise geolocations and call recordings can all be pulled from a person’… [+4154 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "Jaishankar meets Israel, US, UAE counterparts; in-person talks aimed for future - Hindustan Times", "description": "The ministers, at the end of the meeting, decided to appoint senior-level professionals to a joint working group that will formulate options for cooperation in the fields of transportation, technology, maritime security, economics, and trade, as well as for a…", "url": "https://www.hindustantimes.com/india-news/jaishankar-meets-israel-us-uae-counterparts-in-person-talks-aimed-for-future-101634630237407.html", "urlToImage": "https://images.hindustantimes.com/img/2021/10/19/1600x900/87f448e5-7b3a-4b10-90f9-57f622e3cb9b_1634631367973_1634631378343.jpg", "publishedAt": "2021-10-19T08:30:30Z", "content": "India, Israel, the US, and the United Arab Emirates (UAE) have decided to establish an international forum for economic cooperation. The decision was taken at a virtual meeting between US secretary o… [+1795 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "The Canadian Press", "title": "Pfizer officially requests Health Canada approval for kids' COVID-19 shot - Yahoo News Canada", "description": "OTTAWA — Pfizer-BioNTech has asked Health Canada to approve the first COVID-19 vaccine for children aged five to 11 years old. The vaccine was developed in...", "url": "https://ca.news.yahoo.com/newsalert-pfizer-officially-requests-health-203940860.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/_CTTxhkFVIitp_b2WttC6A--~B/aD00NTA7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cp.org/25cd719359066ab64ce48025c443d7a1", "publishedAt": "2021-10-18T21:11:15Z", "content": "OTTAWA Pfizer-BioNTech has asked Health Canada to approve the first COVID-19 vaccine for children aged five to 11 years old.\r\nThe vaccine was developed in partnership with Germany's BioNTech and is n… [+3549 chars]"}]}