{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "New artificial light-harvesting system using organic nanotubes useful for solar cells, photocatalysis, optical sensors & tunable multi-color light emitting materials - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/new-artificial-light-harvesting-system-using-organic-nanotubes-useful-solar-cells-photocatalysis", "urlToImage": null, "publishedAt": "2023-05-24T11:40:50Z", "content": "Inspired by natural photosynthetic systems, researchers have developed a new method of harvesting artificial light using organic nanotubes, which can be utilized in solar cells, photocatalysis, optic… [+3969 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Exclusive: Russian hypersonic scientist accused of betraying secrets to China - Reuters.com", "description": "The director of a top Russian science institute, arrested on suspicion of treason along with two other hypersonic missile technology experts, stands accused of betraying secrets to China, two people familiar with the case told Reuters.", "url": "https://www.reuters.com/world/russian-hypersonic-scientist-accused-betraying-secrets-china-sources-2023-05-24/", "urlToImage": "https://www.reuters.com/resizer/pW5lFARUMPyAQOcrVjq4ZryTaqY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/FCTH6QJVIZIW7HCQ5VCAMUQATE.jpg", "publishedAt": "2023-05-24T11:10:00Z", "content": "LONDON, May 24 (Reuters) - The director of a top Russian science institute, arrested on suspicion of treason along with two other hypersonic missile technology experts, stands accused of betraying se… [+7034 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 24 May 2023: As Moon hides behind Jupiter, Sony camera snaps amazing pic - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of lunar occultation, as the Moon hid behind Jupiter.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-24-may-2023-as-moon-hides-behind-jupiter-sony-camera-snaps-amazing-pic-71684917091057.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/24/1600x900/nasa_1684917214394_1684917217656.jpg", "publishedAt": "2023-05-24T08:34:09Z", "content": "Over the past few months, we have seen several stunning snapshots of celestial objects as part of NASA's Astronomy Picture of the Day, which is published on a daily basis. Snapshots of celestial obje… [+1643 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm threat for Earth continues amid NOAA satellites detecting sunspot decay - HT Tech", "description": "NOAA satellites have spotted a decay in the magnetic field of sunspot AR3311. As a result, it has reduced the chances of an X-class solar flare eruption from 30% to 20%. However, it may be too early to write off the solar storm threat.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-threat-for-earth-continues-amid-noaa-satellites-detecting-sunspot-decay-71684907748247.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/24/1600x900/Sun_and_the_sea_1681961926459_1684907778392.jpg", "publishedAt": "2023-05-24T05:58:38Z", "content": "Yesterday, it was reported that a highly unstable sunspot, AR3311, which was responsible for an X-class solar flare eruption last week, has now entered the full view of Earth. The National Oceanic an… [+2005 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Microsoft Build 2023 Highlights: From Hybrid AI loop, Windows 11 to Bing Chat plugins, check it all out - HT Tech", "description": "Microsoft Build 2023 Highlights From Hybrid AI loop Windows 11 to Bing Chat plugins check it all out Microsoft Build 2023 focused on the new era of artificial intelligence AI has been kicked off by CEO Satya Nadella today. The event is primarily aimed at deve…", "url": "https://tech.hindustantimes.com/web-stories/microsoft-build-2023-highlights-from-hybrid-ai-loop-windows-11-to-bing-chat-plugins-check-it-all-out-71684862999190.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/23/1600x900/microsoft_build_1684858475137_1684867143791_1684867314043.png/", "publishedAt": "2023-05-24T04:47:05Z", "content": "Photo Credit: Microsoft\r\n Microsoft Build 2023, focused on the new era of artificial intelligence (AI), has been kicked off by CEO Satya Nadella today. The event is primarily aimed at developers.\r\nPh… [+1404 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Microsoft launches new AI tool to moderate text and images - TechCrunch", "description": "Microsoft has launched a new AI-powered service, Azure AI Content Safety, to detect potentially problematic speech and images online.", "url": "https://techcrunch.com/2023/05/23/microsoft-launches-new-ai-tool-to-moderate-text-and-images/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-1175327728.jpg?w=1024", "publishedAt": "2023-05-23T15:01:58Z", "content": "Microsoft is launching a new AI-powered moderation service that it says is designed to foster safer online environments and communities.\r\nCalled Azure AI Content Safety, the new offering, available t… [+5794 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Saber-Toothed Predator Sheds Light on the “Great Dying” Extinction Event - SciTechDaily", "description": "A recent study reveals intriguing insights into the catastrophic \"Great Dying\" extinction event 252 million years ago, focusing on the role of a tiger-sized, saber-toothed creature called Inostrancevia. Unearthed fossils indicate that this creature migrated 7…", "url": "https://scitechdaily.com/ancient-saber-toothed-predator-sheds-light-on-the-great-dying-extinction-event/", "urlToImage": "https://scitechdaily.com/images/Giant-Gorgonopsian-Inostrancevia-With-Dicynodont-Prey.jpg", "publishedAt": "2023-05-23T09:17:02Z", "content": "ByField MuseumMay 23, 2023\r\nGiant gorgonopsian Inostrancevia with its dicynodont prey, scaring off the much smaller African species Cyonosaurus. Credit: Art by Matt Celeskey\r\nA recent study reveals i… [+8435 chars]"}]}