{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Jagmeet Singh, Ivan Mehta", "title": "Truecaller brings real-time caller ID to iPhone users - TechCrunch", "description": "Truecaller for iOS has been updated with live caller ID support for its premium iPhone users.", "url": "https://techcrunch.com/2025/01/21/truecaller-brings-real-time-caller-id-to-iphone-users/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/01/truecaller-live-caller-id.jpg?resize=1200,800", "publishedAt": "2025-01-22T05:01:45Z", "content": "Popular caller ID app Truecaller has long left iPhone users at a disadvantage by not offering the caller information in real-time a feature its Android users have enjoyed for some time. Today, that c… [+3633 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Yahya Chaudhry", "title": "Scientists succeed in trapping molecules to perform quantum operations for the first time - Phys.org", "description": "Molecules haven't been used in quantum computing, even though they have the potential to make the ultra-high-speed experimental technology even faster. Their rich internal structures were seen as too complicated, too delicate, too unpredictable to manage, so …", "url": "https://phys.org/news/2025-01-scientists-succeed-molecules-quantum.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/researchers-make-leap.jpg", "publishedAt": "2025-01-21T20:28:52Z", "content": "Molecules haven't been used in quantum computing, even though they have the potential to make the ultra-high-speed experimental technology even faster. Their rich internal structures were seen as too… [+5864 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mysterious Space Signal Traced Across the Universe to an Ancient Dead Galaxy - SciTechDaily", "description": "Astronomers have traced a mysterious fast radio burst to an unexpected place — an ancient, massive galaxy far removed from active star formation. This revelation shakes up the conventional wisdom that such cosmic phenomena exclusively arise from younger, star…", "url": "https://scitechdaily.com/mysterious-space-signal-traced-across-the-universe-to-an-ancient-dead-galaxy/", "urlToImage": "https://scitechdaily.com/images/Clear-FRB-CHIME.jpg", "publishedAt": "2025-01-21T16:00:01Z", "content": "Discovering a fast radio burst in an old, distant galaxy challenges the belief that these events are exclusive to young, vibrant galaxies, suggesting a deeper, cosmic puzzle about their true origins … [+8308 chars]"}, {"source": {"id": null, "name": "FierceBiotech"}, "author": "James Waldron", "title": "HHS gives Moderna $590M to 'accelerate' bird flu vaccine trials - Fierce Biotech", "description": "The U.S. | The government wants Moderna to push forward with various bird flu vaccines as well as mRNA shots for other influenza strains with pandemic potential.", "url": "https://www.fiercebiotech.com/biotech/hhs-gives-moderna-590m-accelerate-bird-flu-vaccine-trials", "urlToImage": "https://qtxasset.com/quartz/qcloud5/media/image/BIRD%20FLU.jpg?VersionId=nPqOlx9FS.95xRfyV4iZ3uw_HvkzldIg", "publishedAt": "2025-01-21T13:24:42Z", "content": null}]}