{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 7 June 2023: Breathtaking Double Ring Galaxy - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of M94, also known as the Double Ring Galaxy that contains over 40 billion stars.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-7-june-2023-breathtaking-double-ring-galaxy-71686126434128.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/07/1600x900/Untitled_design_1686126565004_1686126568917.jpg", "publishedAt": "2023-06-07T08:30:54Z", "content": "Just a couple of days ago, we saw a breathtaking snapshot of the Trifid Nebula, the 20th object discovered by the French astronomer Charles Messier. Similar celestial objects were studied and catalog… [+1896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Demonstrates Superior Performance in Predicting Breast Cancer - SciTechDaily", "description": "AI algorithms outperformed traditional clinical risk models in a large-scale study, predicting five-year breast cancer risk more accurately. These models use mammograms as the single data source, offering potential advantages in individualizing patient care a…", "url": "https://scitechdaily.com/ai-demonstrates-superior-performance-in-predicting-breast-cancer/", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-AI-Success-Art.jpg", "publishedAt": "2023-06-07T08:22:40Z", "content": "In a comprehensive study published in the journal Radiology, artificial intelligence (AI) algorithms demonstrated superior performance to the standard clinical risk model in predicting the five-year … [+6132 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "We asked AI chatbot Google Bard about the next big solar storm; The answer was TERRIFYING - HT Tech", "description": "We asked Google Bard, the AI chatbot, about the possibility of a major solar storm in 2023. The answer was quite terrifying. Find out what it revealed.", "url": "https://tech.hindustantimes.com/tech/news/we-asked-ai-chatbot-google-bard-about-the-next-big-solar-storm-the-answer-was-terrifying-71686111925622.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/07/1600x900/NOAA_1632590234307_1686111980087.JPG", "publishedAt": "2023-06-07T04:28:45Z", "content": "The Earth continues to wait for the big cloud of coronal mass ejections (CME) that is expected to hit between June 7-8 and spark a minor solar storm. In the last couple of weeks, our planet has witne… [+2602 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Apple reveals its 2023 Apple Design Award winners - TechCrunch", "description": "Apple has unveiled the winners of the 2023 Apple Design Awards at its annual Worldwide Developers Conference.", "url": "https://techcrunch.com/2023/06/06/apple-reveals-its-2023-apple-design-award-winners/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/Apple-WWDC23-Design-Awards-trophy-230605_big.jpg.large_2x.jpg?resize=1200,675", "publishedAt": "2023-06-06T20:40:47Z", "content": "Apple has unveiled the winners of its 2023 Apple Design Awards at its annual Worldwide Developers Conference this week. Each year, the tech giant recognizes a dozen apps and games across six categori… [+2217 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Shows Early Universe Crackled With Bursts of Star Formation - SciTechDaily", "description": "Webb Also Continues To Uncover a Bounty of Distant, Young Galaxies With its large, light-gathering mirror and infrared sensitivity, NASA’s James Webb Space Telescope (JWST) is uniquely suited to study galaxies that existed in the early universe, just a few hu…", "url": "https://scitechdaily.com/webb-space-telescope-shows-early-universe-crackled-with-bursts-of-star-formation/", "urlToImage": "https://scitechdaily.com/images/Star-Formation-Illustration.jpg", "publishedAt": "2023-06-06T19:23:32Z", "content": "BySpace Telescope Science InstituteJune 6, 2023\r\nThe James Webb Space Telescopes JADES program is providing unprecedented insights into the early universe, discovering hundreds of ancient galaxies an… [+9481 chars]"}]}