{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid to pass Earth at a distance closer than the Moon, says NASA! - HT Tech", "description": "NASA has revealed that an asteroid will pass Earth today, February 8, and it will do so at a distance that is even closer than the Moon! Know its speed, size, distance of approach, and other details, as per the US Space Agency.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-to-pass-earth-at-a-distance-closer-than-the-moon-says-nasa-71707373007726.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/08/1600x900/3_1693479089566_1707376537462.jpg", "publishedAt": "2024-02-08T07:19:57Z", "content": "NASA uses its advanced space and ground-based telescopes such as the NEOWISE telescope, Pans-STARRS1, and Catalina Sky Survey to keep an eye on asteroids that have the potential to threaten Earth. Us… [+2548 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Apple eyes a foldable iPhone following Vision Pro launch - TechCrunch", "description": "Last week’s Vision Pro release shed some fascinating light on Apple’s generally top secret development process. A Vanity Fair interview with Tim Cook", "url": "https://techcrunch.com/2024/02/07/apple-eyes-a-foldable-iphone-following-vision-pro-launch/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/12/GettyImages-1682975657.jpg?resize=1200,800", "publishedAt": "2024-02-07T19:27:07Z", "content": "Last weeks Vision Pro release shed some fascinating light on Apples generally top secret development process. A Vanity Fair interview with Tim Cook detailed — in part — what a long and heavy lift it … [+6506 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Hamish Hector", "title": "WhatsApp will soon let you chat with other messaging apps – here's how the company says it'll work - TechRadar", "description": "WhatsApp cross-app messaging is on the way", "url": "https://www.techradar.com/phones/whatsapp-will-soon-let-you-chat-with-other-messaging-apps-heres-how-the-company-says-itll-work", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NHHyX8pBm38f3g2mtP32VW-1200-80.jpg", "publishedAt": "2024-02-07T14:34:06Z", "content": "WhatsApp is gearing up to launch cross-messaging between other platforms – meaning you might soon be able to use WhatsApp to send messages to people using Signal, Telegram, or others. \r\nWe know the c… [+3057 chars]"}, {"source": {"id": null, "name": "Quanta Magazine"}, "author": null, "title": "Radio Maps May Reveal the Universe’s Biggest Magnetic Fields - Quanta Magazine", "description": "A controversial technique has produced detailed maps of the magnetic fields in colossal galaxy clusters. If confirmed, the approach could be used to reveal where cosmic magnetic fields come from.", "url": "https://www.quantamagazine.org/radio-maps-may-reveal-the-universes-biggest-magnetic-fields-20240206/", "urlToImage": "https://d2r55xnwy6nx47.cloudfront.net/uploads/2024/02/MegaMagneticField-byNASA_ESA_CSA-byYueHu-Social.webp", "publishedAt": "2024-02-06T19:20:39Z", "content": "By making maps of the magnetic fields hidden inside massive galaxy clusters, astronomers are getting closer to finding the origin of cosmic magnetism.\r\nThese are the first maps of the detailed struct… [+7128 chars]"}]}