{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "All you need to know about ‘Apple BKC’, India's first Apple store in Mumbai - Hindustan Times", "description": "On Wednesday, the tech giant shared a ‘teaser’ of the retail outlet, which is inside the Jio World Drive Mall at Bandra Kurla Complex.", "url": "https://www.hindustantimes.com/technology/all-you-need-to-know-about-apple-bkc-india-s-first-apple-store-opening-in-mumbai-101680672895793.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/04/05/1600x900/BKC_1680673064955_1680673070922_1680673070922.jpg", "publishedAt": "2023-04-05T06:16:10Z", "content": "Apple on Wednesday shared a glimpse of its first-ever retail store for India, thus confirming long-standing reports of the tech giant being in talks to open its maiden outlet in the country. Called B… [+1242 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unraveling the Universe: Groundbreaking Measurement Shakes Up Physics - SciTechDaily", "description": "When it comes to measuring how fast the Universe is expanding, the result depends on which side of the Universe you start from. An EPFL study has calibrated the best cosmic yardsticks to unprecedented accuracy, shedding new light on the Hubble tension. The Hu…", "url": "https://scitechdaily.com/?p=266195", "urlToImage": "https://scitechdaily.com/images/Abstract-Technology-Universe-Expansion.jpg", "publishedAt": "2023-04-05T02:58:12Z", "content": "BySwiss Federal Institute of Technology Lausanne (EPFL)April 4, 2023\r\nA new study amplifies the Hubble tension, a discrepancy in cosmic expansion rate measurements, by providing the most accurate cal… [+2915 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "Can you fool a monkey with a magic trick? Only if it has opposable thumbs - Ars Technica", "description": "Sharing biomechanical ability may be key to anticipating movements of the same limbs in others.", "url": "https://arstechnica.com/science/2023/04/can-you-fool-a-monkey-with-a-magic-trick-only-if-it-has-opposable-thumbs/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/04/monkey1-760x380.jpg", "publishedAt": "2023-04-04T21:36:59Z", "content": "18 with \r\nA Humboldt's squirrel monkey is fooled by the \"French Drop\" magic trick. Credit: E. Garcia-Pelegrin et al., 2023\r\nA Humboldt's squirrel monkey is fooled by the \"French Drop\" magic trick. Cr… [+2788 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Hype grows for SpaceX’s Starship orbital flight test, but barriers remain - TechCrunch", "description": "Hype is growing for the first orbital flight test of SpaceX's Starship launch system, but barriers still remain.", "url": "https://techcrunch.com/2023/04/04/hype-grows-for-spacexs-starship-orbital-flight-test-but-barriers-remain/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/01/starship.jpeg?resize=1200,675", "publishedAt": "2023-04-04T20:42:57Z", "content": "More and more hype is building for the first orbital flight test of Starship, SpaceXs ultra-heavy launch system. That hype has started to reach a crescendo this week as the U.S. Federal Aviation Admi… [+2052 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Google Drive cancels its surprise file cap, promises to communicate better - Ars Technica", "description": "The reaction to Google Drive's secret 5 million file limit makes Google hit \"undo.\"", "url": "https://arstechnica.com/gadgets/2023/04/google-drive-cancels-its-surprise-file-cap-promises-to-communicate-better/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/google-workspace-760x380.jpg", "publishedAt": "2023-04-04T16:38:59Z", "content": "44 with \r\nGoogle is backtracking on its decision to put a file creation cap on Google Drive. Around two months ago, the company decided to cap all Google Drive users to 5 million files, even if they … [+4582 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Snooze or Lose: How Poor Sleep Habits Could Double Your Asthma Risk - SciTechDaily", "description": "Healthy sleep pattern linked to lower risk in adults, large study shows. A UK Biobank study published in BMJ Open Respiratory Research suggests that poor quality sleep may increase an individual's genetic susceptibility to asthma, potentially doubling the ris…", "url": "https://scitechdaily.com/?p=266005", "urlToImage": "https://scitechdaily.com/images/Happy-Woman-Waking-Up-in-Bed-Good-Sleep.jpg", "publishedAt": "2023-04-04T13:08:10Z", "content": "ByBMJApril 4, 2023\r\nGood sleep is important for health, even for the lungs and the respiratory system. In fact, poor quality sleep may double the risk of asthma diagnosis by increasing genetic suscep… [+6661 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Weird threat! NASA detects Ring-shaped sunspot; Solar storm fears rise for Earth - HT Tech", "description": "In the southern hemisphere of the Sun, a ring-shaped sunspot has been detected by the NASA Solar Dynamics Observatory, Which has expanded at a furious rate over the last 24 hours. Is another solar storm coming for the Earth?", "url": "https://tech.hindustantimes.com/tech/news/weird-threat-nasa-detects-ring-shaped-sunspot-solar-storm-fears-rise-for-earth-71680587481644.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/04/1600x900/sun-4444454_1920_1651753999330_1680587544596_1680587544596.jpg", "publishedAt": "2023-04-04T05:57:04Z", "content": "Earlier, the National Oceanic and Atmospheric Administration had revealed that as many as four sunspots have been detected on the Earth-facing side of the Sun, among which one was likely to erupt a C… [+2777 chars]"}]}