{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Apple Watch to see its biggest software update since its 2015 debut, report says - TechCrunch", "description": "Apple plans to introduce a revamped interface for its popular Watch at WWDC in June, alongside its mixed-reality headset, new Mac laptops and iOS 17.", "url": "https://techcrunch.com/2023/04/17/apple-watch-to-see-its-biggest-software-update-since-its-2015-debut/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/09/CMC_3437.jpg?resize=1200,800", "publishedAt": "2023-04-17T14:47:37Z", "content": "The Apple Watch’s software is due to get its biggest update since its release, according to a new report by Bloomberg’s Mark Gurman. Though details on the watchOS 10’s updated design were sparse to n… [+3098 chars]"}, {"source": {"id": null, "name": "Usni.org"}, "author": "Heather Mongilio and Sam LaGrone", "title": "FEDs Investigating Former Sailor Behind Pro-Russian 'Donbass Devushka' Accounts - USNI News - USNI News", "description": "The Department of Justice is investigating a former Navy non-commissioned officer for her role in spreading a series of leaked Pentagon documents, two U.S. defense officials told USNI News on Monday. Sarah Bils, 37, a former aviation electronics technician 2n…", "url": "https://news.usni.org/2023/04/17/feds-investigating-former-sailor-behind-pro-russian-donbass-devushka-accounts", "urlToImage": "https://news.usni.org/wp-content/uploads/2023/04/My-project-1-17-660x440.jpg", "publishedAt": "2023-04-17T14:11:00Z", "content": "The ‘Donbass Devushka’ avatar and former sailor Sarah Bils. USNI News Graphic\r\nThe Department of Justice is investigating a former Navy non-commissioned officer for her role in spreading a series of … [+2953 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Apple CEO Tim Cook meets Mukesh Ambani, N Chandrasekaran on Day 1 in Mumbai - Moneycontrol", "description": "During his visit, Apple CEO Tim Cook is also expected to meet Prime Minister Narendra Modi and the Union Minister of State for Electronics and Information Technology Rajeev Chandrasekhar.", "url": "https://www.moneycontrol.com/news/business/apple-ceo-tim-cook-meets-mukesh-ambani-n-chandrasekaran-on-day-1-in-mumbai-10427421.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/Tim-Cook-770x433.jpg", "publishedAt": "2023-04-17T12:43:29Z", "content": "Apple chief executive officer (CEO) Tim Cook has met India's top business stalwarts, including Reliance Industries chairman Mukesh Ambani and Tata Sons chairman N Chandrasekaran in Mumbai on April 17… [+3031 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "iOS 17 will reportedly set the stage for sideloading apps on iPhone - TechCrunch", "description": "Apple is reportedly building the groundwork in iOS 17 to allow people to sideload apps to their iPhones in the future.", "url": "https://techcrunch.com/2023/04/17/ios-17-will-reportedly-set-the-stage-for-sideloading-apps-on-iphone/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/10/CMC_3800.jpg?resize=1200,800", "publishedAt": "2023-04-17T11:22:15Z", "content": "Apple has kept the iPhone app distribution system closed, allowing users to download the apps only from the App Store. But the company might be adding some gates to this walled garden to let people s… [+1690 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Axel Metz", "title": "iPhone 15 Ultra could get a huge camera upgrade to take on the Galaxy S24 Ultra - TechRadar", "description": "Is Apple preparing to level the playing field?", "url": "https://www.techradar.com/news/iphone-15-ultra-could-get-a-huge-camera-upgrade-to-take-on-the-galaxy-s24-ultra", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NjsKvGgtW6FQv33jHknMKZ-1200-80.jpg", "publishedAt": "2023-04-17T10:27:41Z", "content": "Only last week, we published a story explaining how the Samsung Galaxy S24 Ultra's zoom capabilities could leave Apple’s iPhones in the dust – but a new rumor suggests the iPhone 15 Ultra will come w… [+3071 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Jules Bernstein", "title": "Methane from megafires: Novel detection technique raises pollution policy questions - Phys.org", "description": "Using a new detection method, UC Riverside scientists found a massive amount of methane, a super-potent greenhouse gas, coming from wildfires—a source not currently being accounted for by state air quality managers.", "url": "https://phys.org/news/2023-04-methane-megafires-technique-pollution-policy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/methane-from-megafires.jpg", "publishedAt": "2023-04-17T10:08:14Z", "content": "Using a new detection method, UC Riverside scientists found a massive amount of methane, a super-potent greenhouse gas, coming from wildfiresa source not currently being accounted for by state air qu… [+4858 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid alert! NASA reveals 5 space rocks speeding towards Earth TODAY - HT Tech", "description": "NASA has revealed key details about 5 asteroids such as their size, distance, speed and more, which are set to make close approaches to Earth today.", "url": "https://tech.hindustantimes.com/photos/asteroid-alert-nasa-reveals-5-space-rocks-speeding-towards-earth-today-71681718725221.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/17/1600x900/asteroid_1681212528521_1681718818919_1681719004344_1681719028498.jpg", "publishedAt": "2023-04-17T08:09:28Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "International Business Times, India Edition"}, "author": "Nirmal Narayanan", "title": "Forget nuclear weapons, as this technique could save earth from apocalyptic space bodies - IBTimes India", "description": "Earlier, space scientist Natalie Starkey had suggested that a pre-emptive nuclear strike is a perfect way by which planet Earth can be protected", "url": "https://www.ibtimes.co.in/forget-nuclear-weapons-this-technique-could-save-earth-apocalyptic-space-bodies-858314", "urlToImage": "https://data1.ibtimes.co.in/en/full/733985/nasa-working-asteroid-deflecting-machine.jpg", "publishedAt": "2023-04-17T06:35:44Z", "content": "It was around 66 million years back that a giant asteroid hit the Earth with full fury, causing chaos all around the planet. The asteroid impact was so huge, as it resulted in the extinction of dinos… [+1715 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Welcome to Mars! Caltech's Jaw-Dropping, 5.7 Terapixel Virtual Expedition Across the Red Planet - SciTechDaily", "description": "Both scientists and the public can navigate a new global image of the Red Planet that was made at Caltech using data from NASA’s Mars Reconnaissance Orbiter. Caltech has used data from NASA's Mars Reconnaissance Orbiter to create the highest-resolution global…", "url": "https://scitechdaily.com/welcome-to-mars-caltechs-jaw-dropping-5-7-terapixel-virtual-expedition-across-the-red-planet/", "urlToImage": "https://scitechdaily.com/images/Global-CTX-Mosaic-of-Mars.jpg", "publishedAt": "2023-04-16T20:45:08Z", "content": "ByJet Propulsion LaboratoryApril 16, 2023\r\nThe Global CTX Mosaic of Mars allows scientists and the public to explore the planet like never before. It includes different layers of data that can be tur… [+6614 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Amal Jos Chacko", "title": "Paladin Space pioneers tech to hoover dangerous space junk - Interesting Engineering", "description": "Report about Paladin Space, a startup that aims to make space free from junk, with their reusable space debris remover.", "url": "https://interestingengineering.com/science/paladin-space-pioneers-tech-to-hoover-dangerous-space-junk", "urlToImage": "https://dnd2oi6izkvoi.cloudfront.net/2023/04/16/image/jpeg/6uDGEj8eyYQ9ZwX0ShBUX7V7MNivwYcW9AdHy0P2.jpg", "publishedAt": "2023-04-16T15:17:00Z", "content": "The problem is of such consequence that space agencies and private space firms have made it their priority to find solutions. \r\nNew low-Earth orbit satellites must prove that they can safely be dispo… [+1119 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Study Uncovers Secret of Mammals' Evolutionary Success - SciTechDaily", "description": "A recent study has uncovered the secret to the success of one of the most prosperous animal lineages — modern mammals. The key, according to the study, was to start out small and simple. According to the study, the ancestors of modern mammals, over 300 millio…", "url": "https://scitechdaily.com/new-study-uncovers-secret-of-mammals-evolutionary-success/", "urlToImage": "https://scitechdaily.com/images/Artistic-Reconstruction-of-Early-Mammal-Ancestors.jpg", "publishedAt": "2023-04-15T19:25:37Z", "content": "Digital skull model of the small-sized Jurassic mammal ancestor Hadrocodium wui. Credit: Dr. Stephan Lautenschlager, University of Birmingham\r\nA recent study has uncovered the secret to the success o… [+2837 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Secrets of the Early Universe: Scientists Double Sensitivity of HERA Radio Telescope - SciTechDaily", "description": "Astronomers have taken a significant step forward in uncovering the mysteries of the cosmic dawn. A collection of 350 radio telescopes located in the Karoo desert of South Africa is rapidly advancing towards the detection of the \"cosmic dawn\" - the period fol…", "url": "https://scitechdaily.com/unlocking-the-secrets-of-the-early-universe-scientists-double-sensitivity-of-hera-radio-telescope/", "urlToImage": "https://scitechdaily.com/images/A-HERA-Antenna-at-Night-in-the-Karoo-South-Africa-scaled.jpg", "publishedAt": "2023-04-15T18:35:33Z", "content": "ByMcGill UniversityApril 15, 2023\r\nThe HERA radio telescope, located in Karoo in South Africa, consists of 350 dishes pointed upward to detect radio waves from the early universe. Credit: Dara Storer… [+6844 chars]"}]}