{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Paul Sawers", "title": "OpenAI formally brings web search to ChatGPT as DALL-E 3 integration arrives in beta - TechCrunch", "description": "OpenAI has officially launched Bing-powered search for ChatGPT users, as its text-to-image generator DALL-E 3 exits beta.", "url": "https://techcrunch.com/2023/10/18/openai-formally-brings-bing-powered-search-to-chatgpt-as-dall-e-3-arrives-in-beta/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/09/GettyImages-1647521480-e1694685235777.jpg?resize=1200,676", "publishedAt": "2023-10-18T10:33:01Z", "content": "OpenAI has formally launched its internet-browsing feature to ChatGPT, some three weeks after re-introducing the feature in beta after several months in hiatus.\r\nChatGPT, the generative AI chatbot th… [+2977 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Magnetic filament eruption on the Sun may spark solar storm tomorrow, says NASA - HT Tech", "description": "A magnetic filament has erupted on an active sunspot, shooting out a CME. While not entirely Earth-directed, NASA models have shown that it is likely to spark a solar storm and deliver a glancing blow to the Earth.", "url": "https://tech.hindustantimes.com/tech/news/magnetic-filament-eruption-on-the-sun-may-spark-solar-storm-tomorrow-says-nasa-71697610104271.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/Solar_storm_1697177201358_1697610177566.jpg", "publishedAt": "2023-10-18T06:27:10Z", "content": "On Monday, October 16, a powerful magnetic filament erupted on the Sun. In particular, the explosion of plasma took place on the active sunspot AR3467, which was earlier reported to have displayed si… [+2205 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "350-Year-Old Theorem Reveals New Properties of Light - SciTechDaily", "description": "Researchers at the Stevens Institute of Technology have applied a 350-year-old theorem, originally used to describe the behavior of pendulums and planets to reveal new properties of light waves. Ever since the 17th-century debates between Isaac Newton and Chr…", "url": "https://scitechdaily.com/?p=318944", "urlToImage": "https://scitechdaily.com/images/Physics-Color-Light-Waves.jpg", "publishedAt": "2023-10-18T06:09:14Z", "content": "Researchers have used a 350-year-old mechanical theorem, typically applied to tangible objects, to uncover new insights about lights nature. By interpreting lights intensity as an equivalent to physi… [+5205 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Hyperactivity to Memory Loss: The Shocking ADHD Link to Dementia - SciTechDaily", "description": "Rutgers researcher explores ADHD’s link to dementia and if risks can be mitigated with ADHD treatment. Adults with attention-deficit/hyperactivity disorder (ADHD) are nearly three times more likely to develop dementia than adults without ADHD, according to a …", "url": "https://scitechdaily.com/from-hyperactivity-to-memory-loss-the-shocking-adhd-link-to-dementia/", "urlToImage": "https://scitechdaily.com/images/ADHD-Dementia-Link.jpg", "publishedAt": "2023-10-18T02:24:34Z", "content": "ByRutgers UniversityOctober 17, 2023\r\nA shocking Rutgers study reveals that adults with ADHD face a nearly threefold increased risk of developing dementia. The research calls for more attention to AD… [+4609 chars]"}]}