{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Chemistry: Webb Reveals “Teenage Galaxies” Are Unusually Hot, Glowing With Unexpected Elements - SciTechDaily", "description": "JWST unexpectedly reveals nickel and oxygen, which are typically difficult to observe. Similar to human teenagers, teenage galaxies are awkward, experience growth spurts and enjoy heavy metal — nickel, that is. A Northwestern University-led team of astrophysi…", "url": "https://scitechdaily.com/strange-chemistry-webb-reveals-teenage-galaxies-are-unusually-hot-glowing-with-unexpected-elements/", "urlToImage": "https://scitechdaily.com/images/Teenage-Galaxy-Concept.jpg", "publishedAt": "2023-11-27T09:31:24Z", "content": "ByNorthwestern UniversityNovember 27, 2023\r\nAstrophysicists using NASAs James Webb Space Telescope have discovered that teenage galaxies, emerging within the first 2-3 billion years after the Big Ban… [+10014 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Earth gets laser-beamed message from 16 million kilometers away - India Today", "description": "The transmission was received by the Hale Telescope located at Caltech's Palomar Observatory in San Diego, marking the farthest-ever demonstration of optical communications to date.", "url": "https://www.indiatoday.in/science/story/earth-gets-laser-beamed-message-from-16-million-kilometers-away-2467965-2023-11-27", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202311/laser-message-27194832-16x9_0.jpg?VersionId=uY1WXtdj3JBMvplZ3tae3s9ClxH2FWk1", "publishedAt": "2023-11-27T06:28:00Z", "content": "Nasa's Deep Space Optical Communications (DSOC) experiment has successfully transmitted a near-infrared laser beam encoded with test data across the vast expanse of space, covering a distance of near… [+2960 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pranati Deva", "title": "Tata Tech IPO allotment status: Here's how to check status and latest GMP | Mint - Mint", "description": "The allotment for the initial public offer (IPO) of Tata Technologies is likely to be finalised tomorrow, November 28. Investors can check their allotment status on the issue's registrar Link Intime India's website as well as on BSE.", "url": "https://www.livemint.com/market/stock-market-news/tata-tech-ipo-allotment-heres-how-to-check-status-and-latest-gmp-11701057544215.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/27/1600x900/IPO-kAJ--621x414LiveMint_1701057856036_1701057856288.jpg", "publishedAt": "2023-11-27T04:25:36Z", "content": "The allotment for the initial public offer (IPO) of Tata Technologies is likely to be finalised tomorrow, November 28. Investors can check their allotment status on the issue's registrar Link Intime … [+4844 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI tips: Know how to play tactically to dominate players in solo matches and achieve victory - HT Tech", "description": "Check out the best BGMI tips for solo gameplay and win chicken dinner easily. Know the smart BGMI tactics here.", "url": "https://tech.hindustantimes.com/how-to/bgmi-tips-know-how-to-play-tactically-to-dominate-players-in-solo-matches-and-achieve-victory-71701053569211.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/27/1600x900/bgmi_1688952381443_1701053618829.png", "publishedAt": "2023-11-27T02:56:29Z", "content": "Battlegrounds Mobile India (BGMI) offers numerous gameplay options to players such as solo or squad. Today the guide focuses on providing BGMI tips to players who like to play solo matches or end up … [+2055 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Volcanoes or Asteroid? AI Ends Debate Over Dinosaur Extinction Event - SciTechDaily", "description": "Free-thinking computers reverse-engineered the fossil record to identify the causes of a cataclysm. To address the long-standing debate about whether a massive asteroid impact or volcanic activity caused the extinction of dinosaurs and numerous other species …", "url": "https://scitechdaily.com/volcanoes-or-asteroid-ai-ends-debate-over-dinosaur-extinction-event/", "urlToImage": "https://scitechdaily.com/images/Dinosaur-Extinction-Volcano-Asteroid.jpg", "publishedAt": "2023-11-27T02:28:29Z", "content": "ByDartmouth CollegeNovember 26, 2023\r\nDartmouth scientists used an innovative computer model to suggest that volcanic activity, rather than an asteroid impact, was the primary cause of the mass extin… [+9016 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Surprise: Plants Might Be Able To Absorb More CO2 Than Expected - SciTechDaily", "description": "A new study reveals that plants might absorb more CO2 than expected, offering hope in combating climate change. However, reducing emissions remains crucial, as planting trees alone isn't a sufficient solution. New research published on November 17 in Science …", "url": "https://scitechdaily.com/natures-surprise-plants-might-be-able-to-absorb-more-co2-than-expected/", "urlToImage": "https://scitechdaily.com/images/Forest-Absorbs-Carbon-Dioxide-Like-Lungs-Concept-Art.jpg", "publishedAt": "2023-11-26T21:19:55Z", "content": "ByTrinity College DublinNovember 26, 2023\r\nRecent research indicates that plants could absorb more atmospheric CO2 than previously believed, providing a hopeful perspective on climate change mitigati… [+6390 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Mahmoud Ghorbel, Mahmoud Ghorbel", "title": "This AI Research Proposes Random Slices Mixing Data Augmentation (RSMDA) for Superior Image Classification: A Novel Approach to Enhancing Neural Network Accuracy and Robustness - MarkTechPost", "description": "Data augmentation is a critical technique in deep learning that involves creating new training data by modifying existing samples. It is essential because it diversifies the training data, improving the model's ability to generalize to new, unseen examples. C…", "url": "https://www.marktechpost.com/2023/11/25/this-ai-research-proposes-random-slices-mixing-data-augmentation-rsmda-for-superior-image-classification-a-novel-approach-to-enhancing-neural-network-accuracy-and-robustness/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/11/applsci-13-01711-g002.png", "publishedAt": "2023-11-25T20:55:06Z", "content": "Data augmentation is a critical technique in deep learning that involves creating new training data by modifying existing samples. It is essential because it diversifies the training data, improving … [+4760 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "The OnePlus 12 gets three confirmed colors – and one retro rumor - TechRadar", "description": "More details on the phone", "url": "https://www.techradar.com/phones/the-oneplus-12-gets-three-confirmed-colors-and-one-retro-rumor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZVzgmoLCTUAsMqLQCA3GCb-1200-80.jpg", "publishedAt": "2023-11-25T16:30:33Z", "content": "We know that the OnePlus 12 is going to be unveiled on December 4, and we now also know the colors it's going to come in – and there's also talk of a more retro-inspired finish for the casing making … [+1781 chars]"}]}