{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "M3 MacBook Air Peak CPU Temperature Can Reach 114 Degrees Celcius, 33% Slower Than MacBook Pro With Same Chip Due To Lack Of A Fan - Wccftech", "description": "The lack of a cooling fan on the M3 MacBook Air has severe consequences, as it throttles due to extremely high temperatures", "url": "https://wccftech.com/m3-macbook-air-severely-throttles-under-load/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/03/M3-MacBook-Air-cooling-solution.jpg", "publishedAt": "2024-03-09T09:18:00Z", "content": "Apple continues to employ a fan-less cooling design for 13-inch and 15-inch M3 MacBook Air models, and while that means users will be pleased about the completely silent operation, they will lose out… [+2795 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": null, "title": "Video: Gadgets 360 With Technical Guruji: First Look at Nothing Phone 2a - Gadgets 360", "description": "Nothing launched its third phone, the Nothing 2a, this week for the mid-rage segment. The phone&#039;s pricing starts at Rs. 23,999 and features eye-catching design that we&#039;ve come to expect from Nothing. The phone features the trademark transparent back…", "url": "https://www.gadgets360.com/videos/gadgets-360-with-technical-guruji-first-look-at-nothing-phone-2a-767550", "urlToImage": "https://c.ndtvimg.com/2024-03/v9sisdi8_nothing-phone-2a_640x480_09_March_24.jpg", "publishedAt": "2024-03-09T05:27:27Z", "content": "Nothing launched its third phone, the Nothing 2a, this week for the mid-rage segment. The phone's pricing starts at Rs. 23,999 and features eye-catching design that we've come to expect from Nothing.… [+517 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "Broader indices underperform, but these 10 smallcaps post double digit gain - Moneycontrol", "description": "The consolidation is a brief pause in the overall uptrend, and we expect the up move to resume during the coming week, says Jatin Gedia – Technical Research Analyst at Sharekhan by BNP Paribas.", "url": "https://www.moneycontrol.com/news/business/markets/broader-indices-underperform-but-these-10-smallcaps-post-double-digit-gain-12427961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/03/Sensex_market_Nifty-1-770x433.jpg", "publishedAt": "2024-03-09T03:29:54Z", "content": "The Indian market had a positive run for the fourth week in a row, with the benchmark indices reaching an all-time high despite high volatility in the week ending on March 7. However, the broader ind… [+4591 chars]"}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "Kris Holt", "title": "Fortnite's new season is delayed due to tech issues - Engadget", "description": "Epic Games has delayed the start of the new Fortnite season due to a technical issue. The latest season focuses on Greek gods.", "url": "https://www.engadget.com/fortnites-new-season-is-delayed-due-to-tech-issues-161538098.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2024-03/d2d92110-dd63-11ee-b57f-2141e7463943", "publishedAt": "2024-03-08T16:15:38Z", "content": "As is always the case between seasons, Epic Games took Fortnite offline early on Friday to perform some maintenance and get the game ready for all the new stuff fans are about to enjoy. While the dow… [+1905 chars]"}]}