{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes Auto", "title": "Pfizer-BioNTech Covid-19 vaccine less effective in ages 5-11: New York study - The Straits Times", "description": "NEW YORK (REUTERS) - Two doses of the Pfizer-BioNTech Covid-19 vaccine was protective against severe disease in children aged 5 to 11 during the recent Omicron variant surge, but quickly lost most of its ability to prevent infection in the age group, accordin…", "url": "https://www.straitstimes.com/world/united-states/pfizer-biontech-covid-19-vaccine-less-effective-in-ages-5-11-new-york-study", "urlToImage": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/03/01/yu_kidvax.jpg?VersionId=.LOmQT0azsgRGJtOA_I4TWlkEyvBMwAA", "publishedAt": "2022-02-28T20:04:43Z", "content": "NEW YORK (REUTERS) - Two doses of the Pfizer-BioNTech Covid-19 vaccine was protective against severe disease in children aged 5 to 11 during the recent Omicron variant surge, but quickly lost most of… [+2246 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": null, "title": "Pfizer Covid vaccine is less effective in kids 5 to 11, study finds - STAT", "description": "New data suggest the Pfizer-BioNTech Covid vaccine works substantially less well at preventing infection and hospitalizations in kids 5 to 11.", "url": "https://www.statnews.com/2022/02/28/pfizer-covid-vaccine-kids-5-11/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/02/GettyImages-1236368686-1024x576.jpg", "publishedAt": "2022-02-28T19:52:30Z", "content": "Newly emerging data suggest the Pfizer-BioNTech Covid vaccine works substantially less well at preventing infection and hospitalizations in children aged 5 to 11 than it does in those aged 12 to 17 a… [+5170 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New data analysis tool reveals immune cell types associated with COVID-19 mortality risk - News-Medical.Net", "description": "A new data analysis tool developed by Yale researchers has revealed the specific immune cell types associated with increased risk of death from COVID-19, they report Feb. 28 in the journal Nature Biotechnology.", "url": "https://www.news-medical.net/news/20220228/New-data-analysis-tool-reveals-immune-cell-types-associated-with-COVID-19-mortality-risk.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/134984011-620x480.jpg", "publishedAt": "2022-02-28T17:58:00Z", "content": "A new data analysis tool developed by Yale researchers has revealed the specific immune cell types associated with increased risk of death from COVID-19, they report Feb. 28 in the journal Nature Bio… [+2914 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Government says too many skilled people have left South Africa – and it wants to bring them back - BusinessTech", "description": "Government is considering new strategies to keep hold of skilled South Africans as part of its new National Labour Migration Policy (NLMP).", "url": "https://businesstech.co.za/news/business/563412/government-says-too-many-skilled-people-have-left-south-africa-and-it-wants-to-bring-them-back/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/AirportDeparture-e1634886727591.jpg", "publishedAt": "2022-02-28T13:55:51Z", "content": "The government is considering new strategies to keep hold of skilled South Africans as part of its new National Labour Migration Policy (NLMP).\r\nThe NLMP, which was published for public comment on Mo… [+2267 chars]"}, {"source": {"id": null, "name": "Bitcoin.com"}, "author": null, "title": "Valve CEO Gabe Newell Praises NFT Technology, Criticizes Bad Actors – Bitcoin News - Bitcoin News", "description": "Gabe Newell, CEO of Valve, one of the largest companies in PC gaming, revealed his take on crypto and NFTs applied to games.", "url": "https://news.bitcoin.com/valve-ceo-gabe-newell-praises-nft-technology-criticizes-bad-actors/", "urlToImage": "https://static.news.bitcoin.com/wp-content/uploads/2022/02/shutterstock_1927830050.jpg", "publishedAt": "2022-02-28T13:33:40Z", "content": "Gabe Newell, founder and CEO of Valve, a popular company in the PC gaming market, has revealed his take on crypto and NFTs when applied to games. In an interview with gaming media, Newell validated t… [+3828 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Adrian Potoroaca", "title": "AMD Radeon RX 6500 XT GPUs briefly sell below MSRP in Europe - TechSpot", "description": "The GPU market has been a nightmare for the past two years or so, but things look like they’re at least headed in the right direction. Availability...", "url": "https://www.techspot.com/news/93574-amd-radeon-rx-6500-xt-gpus-briefly-sell.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/02/2022-02-28-image-5.jpg", "publishedAt": "2022-02-28T13:24:00Z", "content": "Why it matters: When AMD launched the Radeon RX 6500 XT earlier this year, it didnt exactly pique the interest of casual gamers looking for an entry-level GPU for 1080p gaming. Now that pricing has g… [+1558 chars]"}, {"source": {"id": null, "name": "SamMobile"}, "author": "SamMobile", "title": "Apple has a 20-inch foldable answer to Samsung Galaxy Book Fold laptop - SamMobile", "description": "It's no secret that Samsung wants to expand its foldable display technology to more products. Since last year, it has ...", "url": "https://www.sammobile.com/news/apple-20-inch-foldable-answer-to-samsung-galaxy-book-fold-laptop/", "urlToImage": "https://www.sammobile.com/wp-content/uploads/2021/08/Galaxy-Book-Fold-17-featured-720x405.png", "publishedAt": "2022-02-28T10:36:00Z", "content": "It’s no secret that Samsung wants to expand its foldable display technology to more products. Since last year, it has been reported that the company plans to launch foldable laptops. They may be call… [+1853 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Find Two Supermassive Black Holes Spiraling Toward a Cataclysmic Collision - SciTechDaily", "description": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging. Supermassive black holes millions to billions of times the mass of our Sun lie at the heart …", "url": "https://scitechdaily.com/astronomers-find-two-supermassive-black-holes-spiraling-toward-a-cataclysmic-collision/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Spinning-Disk.gif", "publishedAt": "2022-02-28T09:18:45Z", "content": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging.\r\nSupermassive black holes millio… [+4492 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The average take-home pay in South Africa right now - BusinessTech", "description": "South Africa’s average salary in January 2022 increased at its fastest rate since the pre-pandemic January 2020 period, according to the monthly BankserAfrica Take-home Pay Index (BTPI).", "url": "https://businesstech.co.za/news/finance/563260/the-average-take-home-pay-in-south-africa-right-now-9/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand1-scaled-e1606294571290.jpg", "publishedAt": "2022-02-28T08:33:11Z", "content": "South Africas average take-home pay in January 2022 increased at its fastest rate since the pre-pandemic January 2020 period, according to the monthly BankserAfrica Take-home Pay Index (BTPI).\r\nThe a… [+2032 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How Russia’s invasion of Ukraine will hit South Africa - BusinessTech", "description": "Russia’s invasion of Ukraine has led to turmoil in the global markets but is unlikely to have a major impact on the broader growth impact on South Africa, say economists at the Bureau for Economic Research (BER).", "url": "https://businesstech.co.za/news/finance/563176/how-russias-invasion-of-ukraine-will-hit-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/07/Fill-up-fuel-petrol.jpg", "publishedAt": "2022-02-28T06:57:30Z", "content": "Russia’s invasion of Ukraine has led to turmoil in the global markets but is unlikely to have a major impact on the broader growth impact on South Africa, say economists at the Bureau for Economic Re… [+2891 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": null, "title": "Technician dies in tragic accident in Tampines a day before he was due to take VTL home - STOMP", "description": "A Malaysian working in Singapore died in a road accident in Tampines one day before he was due to return home using the vaccinated travel lane (VTL). Read more at stomp.straitstimes.com", "url": "https://stomp.straitstimes.com/singapore-seen/technician-dies-in-tragic-accident-in-tampines-a-day-before-he-was-due-to-take-vtl", "urlToImage": "https://s3-stomprevamp.s3-ap-southeast-1.amazonaws.com/s3fs-public/styles/article_detail_fi_breakpoints_theme_bootstrap_screen-lg-min_1x/public/images/2022/02/fatal-accident.jpg?itok=EBvzpKqf", "publishedAt": "2022-02-28T03:11:33Z", "content": "Maureen KohThe New PaperFebruary 27, 2022\r\nA Malaysian working in Singapore died in a road accident in Tampines one day before he was due to return home using the vaccinated travel lane (VTL).\r\nThe 3… [+2156 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Huawei launches smart office products in Europe as smartphone sales suffer setback - Global Times", "description": "Huawei has launched seven smart office products at the Huawei Spring 2022 Smart Office Launch event on Sunday in Barcelona, Spain, as the Chinese tech giant is seeking new growth points amid withering sales due to the years-long US ban.", "url": "https://www.globaltimes.cn/page/202202/1253379.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-02-27/7377a9ef-ce90-4dae-b966-7e8fb972c429.jpeg", "publishedAt": "2022-02-27T17:45:00Z", "content": "Photo: VCG\r\nHuawei has launched seven smart office products at the Huawei Spring 2022 Smart Office Launch event on Sunday in Barcelona, Spain, as the Chinese tech giant is seeking new growth points a… [+1669 chars]"}, {"source": {"id": null, "name": "Technewsinc.com"}, "author": "Stan Shaw", "title": "If a green or orange dot appears at the top of the screen, your device may be hacked - Tech News Inc", "description": "Do you know the meaning of the green or orange dot that sometimes appears at the top of a file Iphone ? If not, this information should be very useful to", "url": "https://technewsinc.com/if-a-green-or-orange-dot-appears-at-the-top-of-the-screen-your-device-may-be-hacked/", "urlToImage": "https://img.20mn.fr/zF_Se0d_Ru2i813wYLiBMyk/648x360_optiques-iphone-13-pro-significativement-plus-grandes-celles-iphone-12-pro.jpg", "publishedAt": "2022-02-27T16:08:51Z", "content": "Do you know the meaning of the green or orange dot that sometimes appears at the top of a file Iphone ? If not, this information should be very useful to you! Since iOS 14, various indicators allow a… [+1451 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}]}