{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Opposites Attract, Likes Repel? Scientists Overturn Fundamental Principle of Physics - SciTechDaily", "description": "\"Opposites charges attract; like charges repel\" is a fundamental principle of basic physics. However, a new study from Oxford University, recently published in the journal Nature Nanotechnology, has demonstrated that similarly charged particles in solution ca…", "url": "https://scitechdaily.com/opposites-attract-likes-repel-scientists-overturn-fundamental-principle-of-physics/", "urlToImage": "https://scitechdaily.com/images/Hexagonal-Cluster-Formation-scaled.jpg", "publishedAt": "2024-03-09T23:01:57Z", "content": "A new study has overturned a fundamental principle of physics by demonstrating that similarly charged particles can attract each other in a solution, with the effect varying between positive and nega… [+4247 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Europa Clipper to carry unique message to Jupiter's moon, packed with Earth's essence - HT Tech", "description": "NASA's Europa Clipper, set to launch in October, carries a unique message to Jupiter's moon Europa, featuring a poetic tribute, names from the public, and symbolic artwork.", "url": "https://tech.hindustantimes.com/tech/news/nasa-europa-clipper-to-carry-unique-message-to-jupiters-moon-packed-with-earths-essence-71709991364928.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/09/1600x900/NASA_cliper_1709991575005_1709991588366.jpg", "publishedAt": "2024-03-09T13:42:03Z", "content": "In a celestial nod to human creativity and curiosity, NASA is set to launch its Europa Clipper spacecraft in October, bound for Jupiter's moon Europa. Nestled within the spacecraft is a symbolic mess… [+2579 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "New technology helps archaeologists explore the past - CBS News", "description": "Archaeologists are switching their pickaxes for subatomic particle detectors. The high-tech tools can see through hundreds of feet of rock, and allow archaeo...", "url": "https://www.youtube.com/watch?v=t22ON_qyKIw", "urlToImage": "https://i.ytimg.com/vi/t22ON_qyKIw/maxresdefault.jpg", "publishedAt": "2024-03-09T13:38:34Z", "content": null}, {"source": {"id": null, "name": "Dailymotion.com"}, "author": null, "title": "Bus-Size Asteroid Flew Closer Than The Moon - Watch The Orbit Animation - video Dailymotion - Dailymotion", "description": "Asteroid 2024 DW flew about 139,000 miles (224,000 km) away from Earth. The space rock was estimated to be about 43 feet wide (13 m).   Credit: Space.com | animation: NASA/JPL-Caltech | edited by Steve Spaleta Music: Black Bullet by Deskant / courtesy of Epid…", "url": "https://www.dailymotion.com/video/x8u3px4", "urlToImage": "https://s2.dmcdn.net/v/VsAFu1bww2HlQ348p/x720", "publishedAt": "2024-03-08T22:03:22Z", "content": null}]}