{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Stop sending WhatsApp photos on iPhone, Android the wrong way! Do THIS instead - HT Tech", "description": "Both the Android and iPhone users can send best quality photos via WhatsApp using a simple trick. Check it out below.", "url": "https://tech.hindustantimes.com/how-to/stop-sending-whatsapp-photos-on-iphone-android-the-wrong-way-do-this-instead-71666523019389.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/23/1600x900/cf85794e-ead8-11eb-b8ce-2737a30d4ad4_1629887891845_1637730137519_1666523097283_1666523097283.webp", "publishedAt": "2022-10-23T11:09:26Z", "content": "More than having simple textual conversations over WhatsApp, the mobile application is also being used to share media files (images, videos, and more). However, when you share or receive any photo or… [+2040 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moonlighting Unacceptable, \"Few\" Employees Fired Over It: IT Firm - NDTV Profit", "description": "IT company Happiest Minds Technologies has said moonlighting is unacceptable as it amounts to violation of job contract and that \"few\" employees found engaging in such practices have been fired over the last 6-12 months.", "url": "https://www.ndtv.com/business/moonlighting-unacceptable-few-employees-fired-over-it-happiest-minds-3456554", "urlToImage": "https://i.ndtvimg.com/i/2017-06/it-sector_650x400_71498458027.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675?ver-20220723.02", "publishedAt": "2022-10-23T08:35:00Z", "content": "Several firms have waded into the issue making it clear that they do not approve of it.(Representational)\r\nNew Delhi: IT company Happiest Minds Technologies has said moonlighting is unacceptable as i… [+4665 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Got gift cards collecting dust? Now's the time to use them - CBC.ca", "description": "Square, a financial technology company that sell mobile payment devices, found Canadians are sitting on more than $33 million worth of unspent gift cards through its platform alone.", "url": "https://www.cbc.ca/radio/costofliving/use-your-gift-cards-1.6620807", "urlToImage": "https://i.cbc.ca/1.6285719.1666287997!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pei-gift-cards.jpg", "publishedAt": "2022-10-23T08:00:00Z", "content": "The gift cards are stacking up for Neil Cooper. After a count, he says he has 19 cards kicking around his home. \r\n\"I have no idea how much are on any of these,\" said Cooper, whose collection of gift … [+4779 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Aman Niranjan", "title": "Huawei to Launch its Watch D in UK on 25th October - The Tech Outlook", "description": "In December 2021 Huawei launched its initial blood pressure-monitoring smartwatch for the indigenous market. However, after launching in Germany a few weeks ago. The company is set to launch the Watch D in the UK expected to release on 25th October a", "url": "https://www.thetechoutlook.com/news/new-release/huawei-to-launch-its-watch-d-in-uk-on-25th-october/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/10/Watch-q0.jpg", "publishedAt": "2022-10-23T07:43:41Z", "content": "In December 2021 Huawei launched its initial blood pressure-monitoring smartwatch for the indigenous market. However, after launching in Germany a few weeks ago. The company is set to launch the Watc… [+1023 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Huawei EMUI October 2022 Updates List - HC Newsroom", "description": "In October 2022, Huawei is all set to launch new EMUI software updates for devices and it brings a number of features for smartphone owners. On the other hand, the Chinese tech maker has already released the latest security patch details as well as a list of …", "url": "https://www.huaweicentral.com/huawei-emui-october-2022-updates-list-2/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/10/huawei-october-emui-2022-updates-1000x576.jpg", "publishedAt": "2022-10-23T06:21:56Z", "content": "Recently, Huawei listed all of the EMUI 13 features and the excitement among Huawei phone users is overwhelming. Yeah, it’s a matter of joy and EMUI 13 is the one that you are looking forward to incl… [+1941 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Massive property boom in this area in South Africa, thanks to wealthy semigrants - BusinessTech", "description": "The Umhlanga property market continues to perform well, says Brett Botsis, Seeff’s licensee for the area. Since the onset of the pandemic there has been a significant uptick in sales in the R5 million to R10 million range.", "url": "https://businesstech.co.za/news/trending/636449/massive-property-boom-in-this-area-in-south-africa-thanks-to-wealthy-semigrants/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/Umhlanga-beachfront-area-e1666338031160.jpg", "publishedAt": "2022-10-23T06:07:02Z", "content": "The Umhlanga property market continues to perform well, says Brett Botsis, Seeffs licensee for the area. Since the onset of the pandemic, there has been a significant uptick in sales in the R5 millio… [+3298 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Tech News LIVE Updates Today: Apple Watch saves life, Google bans 16 apps, asteroids, more - HT Tech", "description": "Technology News LIVE Updates Today, October 23, 2022: Apple Watch saves life again, Google Play Store bans 16 malicious apps, iPhone 13 and iPhone 12 have seen massive price cuts, and a lot more.", "url": "https://tech.hindustantimes.com/tech/news/tech-news-live-updates-today-apple-watch-saves-life-google-bans-16-apps-asteroids-more-71666500563964.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/23/1600x900/kishore-v-MzfOpeqQL8E-unsplash_1666502380520_1666502402443_1666502402443.jpg", "publishedAt": "2022-10-23T05:24:47Z", "content": "Technology News LIVE Updates Today, October 23, 2022: The weekend is holding India vs Pakistan match to stream online, Apple Watch saves life of a girl, asteroid zooming towards Earth, Google bans 16… [+112 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "439-Million-Year-Old Fossil Teeth Overturn Long-Held Views About Evolution - SciTechDaily", "description": "Rare Chinese fossil teeth have changed scientists' beliefs about the evolution of vertebrates. An international team of scientists has found toothed fish remains that date back 439 million years, which suggests that the ancestors of modern chondrichthyans (sh…", "url": "https://scitechdaily.com/?p=218890", "urlToImage": "https://scitechdaily.com/images/Volumetric-Reconstruction-of-a-Tooth-Whorl.jpg", "publishedAt": "2022-10-23T03:19:24Z", "content": "Volumetric reconstruction of a tooth whorl viewed from its lingual side (holotype of Qianodus duplicis). The specimen is just over 2 mm in length. Credit: Zhu, et al.\r\nRare Chinese fossil teeth have … [+5374 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Inside the elaborate set-up of a scam HQ, staffed by people forced to scam - CNA", "description": "In the first of a two-part special report, CNA Insider delves into the shadowy world of Southeast Asia-based scam syndicates, where sophisticated technology and psychological tactics are used on unsuspecting victims around the world. The twist? The people beh…", "url": "https://www.channelnewsasia.com/cna-insider/inside-elaborate-set-scam-hq-staffed-people-forced-scam-3018966", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--mXnMCWld--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/10/23/edited_a_long_chuan_dang_ji.jpg?itok=DAZcCzvU", "publishedAt": "2022-10-22T22:02:02Z", "content": "*Names have been changed \r\nSINGAPORE and PHNOM PENH: For some of the people hunched over computers and typing furiously, sweet-talking strangers thousands of miles away, what impels them is the threa… [+1776 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "NASA's Webb Telescope takes star-filled portrait of pillars of creation - HT Tech", "description": "NASA's James Webb Space Telescope has captured highly detailed landscape the Pillars of Creation where new stars are forming.", "url": "https://tech.hindustantimes.com/tech/news/nasas-webb-telescope-takes-star-filled-portrait-of-pillars-of-creation-71666434702552.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/22/1600x900/AP10-19-2022-000286A-0_1666435726258_1666435726258_1666435896256_1666435896256.jpg", "publishedAt": "2022-10-22T19:22:51Z", "content": "NASA's James Webb Space Telescope has captured a lush, highly detailed landscape the iconic Pillars of Creation where new stars are forming within dense clouds of gas and dust. The three-dimensional … [+2802 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Tom Rabe, Alexandra Smith", "title": "More than 500 electric vehicle chargers to be rolled out across NSW - Sydney Morning Herald", "description": "Fast and ultra-fast chargers will be rolled out across NSW over the next two years as part of a $40 million government bid to spur uptake of the technology.", "url": "https://www.smh.com.au/national/nsw/more-than-500-electric-vehicle-chargers-to-be-rolled-out-across-nsw-20221021-p5brv2.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.19353070175438597%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/a92d19a097510b7f1b43cbebd1a3bcadb8411785", "publishedAt": "2022-10-22T18:00:00Z", "content": "The government is working with Ampol, BP, Evie Networks, Tesla, the NRMA and Zeus Renewables to install the chargers.\r\nNSW is partnering with commercial installers to build, own and operate these cha… [+1056 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Debby Wu", "title": "TSMC Said to Suspend Work for Chinese Chip Startup Amid US Curbs - Bloomberg", "description": "Taiwan Semiconductor Manufacturing Co. has suspended production of advanced silicon for Chinese startup Biren Technology to ensure compliance with US regulations, according to a person familiar with the matter.", "url": "https://www.bloomberg.com/news/articles/2022-10-22/tsmc-said-to-suspend-work-for-chinese-chip-startup-amid-us-curbs", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ipeUr8.OUjgg/v1/1200x800.jpg", "publishedAt": "2022-10-22T17:44:21Z", "content": "Taiwan Semiconductor Manufacturing Co. has suspended production of advanced silicon for Chinese startup \r\nBiren Technology to ensure compliance with US regulations, according to a person familiar wit… [+472 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The chance to lower interest rates is in government’s hands: Kganyago - BusinessTech", "description": "South Africa’s central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.", "url": "https://businesstech.co.za/news/trending/636989/the-chance-to-lower-interest-rates-is-in-governments-hands-kganyago/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-10-22T05:41:04Z", "content": "South Africas central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.\r\nFiscal c… [+1694 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How South Africa’s tax rates compare to Australia, the UK and other countries - BusinessTech", "description": "Data from the Organisation for Economic Cooperation and Development’s (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with the rest of the world – but the devil’s in the details.", "url": "https://businesstech.co.za/news/business-opinion/635987/how-south-africas-tax-rates-compare-to-australia-the-uk-and-other-countries/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/the-SA-rand.jpg", "publishedAt": "2022-10-22T05:06:35Z", "content": "Data from the Organisation for Economic Cooperation and Developments (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with … [+4511 chars]"}, {"source": {"id": null, "name": "Wustl.edu"}, "author": "Brandie Jefferson", "title": "Multi-scale imaging technique may enable objective assessment of myofascial pain - The Source - Washington University in St. Louis - Washington University in St. Louis", "description": "Washington University in St. Louis researchers Song Hu, Yong Wang team up to find quantitative biomarkers for clinical pain management", "url": "https://source.wustl.edu/2022/10/multi-scale-imaging-technique-may-enable-objective-assessment-of-myofascial-pain/", "urlToImage": "https://source.wustl.edu/wp-content/uploads/2022/10/Song-Wang.jpg", "publishedAt": "2022-10-21T16:15:00Z", "content": "About 50 million Americans experience chronic pain. For many, the pain involves the muscle and the fascia surrounding it, creating myofascial pain with trigger points. This chronic pain syndrome sign… [+1332 chars]"}, {"source": {"id": null, "name": "Complete Sports Nigeria"}, "author": "Adekemi Olatunji", "title": "What Tech Influencers Have To Say About Infinix ZERO 20 - Complete Sports", "description": "A key feature, smartphone lovers look out for in smartphones is the camera Megapixel. Infinix has earned a bragging right with the launch ...", "url": "https://www.completesports.com/what-tech-influencers-have-to-say-about-infinix-zero-20/", "urlToImage": "https://www.completesports.com/wp-content/uploads/Infinix-ZERO-20.png", "publishedAt": "2022-10-21T14:13:52Z", "content": "A key feature, smartphone lovers look out for in smartphones is the camera Megapixel. Infinix has earned a bragging right with the launch of its Zero 20 device, the tech giant launched industrys firs… [+1573 chars]"}]}