{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 9 June 2023: Webb Telescope snaps Pandora Cluster - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Abell 2744, also known as the Pandora’s Cluster of galaxies which is located about 4 billion light-years away towards the constellation of Sculptor.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-9-june-2023-webb-telescope-snaps-pandora-cluster-71686309004223.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/Untitled_design_1686309185416_1686309191921.jpg", "publishedAt": "2023-06-09T11:18:18Z", "content": "Most galaxies exist in groups or clusters with dozens or hundreds of members, and these cluster galaxies are all in constant motion, pulled and twisted by their neighbour's gravity. Galaxies exist in… [+2514 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "First Sketch Map of the Subglacial Geology of Thwaites Glacier Revealed - AZoCleantech", "description": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affecting it.", "url": "https://www.azocleantech.com/news.aspx?newsID=33532", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_33532_16863038512135959.jpg", "publishedAt": "2023-06-09T09:44:00Z", "content": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affe… [+3961 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Italy's Campi Flegrei Supervolcano Edges Closer to Possible Eruption – Last Erupted in 1538 - SciTechDaily", "description": "According to new research, the Campi Flegrei supervolcano in southern Italy has become weaker, making it more likely to erupt. Using a unique model to interpret patterns of earthquakes and ground uplift, the study found parts of the volcano have been stretche…", "url": "https://scitechdaily.com/italys-campi-flegrei-supervolcano-edges-closer-to-possible-eruption-last-erupted-in-1538/", "urlToImage": "https://scitechdaily.com/images/Ocean-Supervolcano-Eruption-Art-Concept.jpg", "publishedAt": "2023-06-09T09:01:26Z", "content": "A new study suggests that the Campi Flegrei volcano in southern Italy has become weaker and more likely to erupt. The volcano, which last erupted in 1538, has been restless for over 70 years, with si… [+6702 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": null, "title": "Logitech retires the Blue microphone brand - Engadget", "description": "Logitech has has killed off the Blue microphone brand, and will now sell the products under the Logitech G gaming brand..", "url": "https://www.engadget.com/logitech-retires-the-blue-microphone-brand-083111975.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/rUWpXjiAffW5_Uhueu6fYg--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-06/137a5340-069d-11ee-ae59-b37f5febc9bb.cf.jpg", "publishedAt": "2023-06-09T08:32:21Z", "content": "Logitech is getting rid of the Blue microphone brand, and will now sell the products under the Logitech G gaming brand only keeping the Blue name to \"describe our technologies,\" it said. Blue has bee… [+2141 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "ChatGPT comes to iPad, adds support for Siri and Shortcuts - TechCrunch", "description": "OpenAI's ChatGPT app is getting its first big update. The new version brings native iPad support to the AI chatbot app, as well as support for using ChatGPT with Siri and Shortcuts.", "url": "https://techcrunch.com/2023/06/08/chatgpt-comes-to-ipad-adds-support-for-siri-and-shortcuts/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1254096989.jpg?resize=1200,675", "publishedAt": "2023-06-08T16:23:38Z", "content": "Less than a month after its release on the App Store, OpenAI’s ChatGPT app is getting its first big update. The new version, out today, brings native iPad support to the AI chatbot app, as well as su… [+2750 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Furqan Shahid", "title": "YouTuber Shows Just How Good Apple’s Customer Service Is Compared To Samsung As Apple Took Just 5 Days To Repair And Return The Device Whereas Samsung Took Almost A Month - Wccftech", "description": "Have you ever wondered how just how good Samsung or Apple's customer service is when it comes to repairing phones? Here's your chance to understand things.", "url": "https://wccftech.com/youtuber-shows-just-how-good-apples-customer-service-is-compared-to-samsung-as-apple-took-just-5-days-to-repair-and-return-the-device-whereas-samsung-took-almost-a-month/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/anton-maksimov-5642-su-R2ljPFJju1s-unsplash.jpg", "publishedAt": "2023-06-08T16:02:00Z", "content": "Experiencing damage to your phone is never really a good thing. Especially if that is the only device you own because, in such a case, you would have to send the device away for repairs. When it come… [+2433 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This AI-based language teacher promises to improve your fluency and speak with confidence - HT Tech", "description": "Gliglish is an AI-based platform that claims to improve your command over a new language. Check its features and how it works.", "url": "https://tech.hindustantimes.com/tech/news/this-ai-based-language-teacher-promises-to-improve-your-fluency-and-speak-with-confidence-71686236348871.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/08/1600x900/Gliglish_1686236368130_1686236374660.png", "publishedAt": "2023-06-08T15:01:41Z", "content": "Learning a new language can be difficult, especially in adulthood. It requires learning entirely new words and pronunciations and the right modulation to speak them. So, it is no wonder that people s… [+3233 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Ruairi J Mackenzie", "title": "Coos and Snooze: Scientists Decode Pigeons' Dreams - Technology Networks", "description": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a technique called functional magnetic resonance imaging (fMRI) to…", "url": "https://www.technologynetworks.com/neuroscience/news/coos-and-snooze-scientists-decode-pigeons-dreams-374412", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374412/coos-and-snooze-scientists-decode-pigeons-dreams-374412-640x360.jpg?cb=20230607", "publishedAt": "2023-06-07T15:54:53Z", "content": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a tech… [+5189 chars]"}]}