{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "Techguide.com.au"}, "author": "Stephen Fenech", "title": "Why dash cams have become essential for your car - everything you need to know - Tech Guide", "description": "Dash cams are one of the smallest automotive devices on the market and now also one of the most useful. They’re like seatbelts, you don’t think need one until you really need one.  But are they all the same? What do you need to look for? Tech Guide s", "url": "https://www.techguide.com.au/news/in-car-news/why-dash-cams-have-become-essential-for-your-car-everything-you-need-to-know/", "urlToImage": "https://www.techguide.com.au/wp-content/uploads/2022/03/NavmanMIVUE12002-1.jpeg", "publishedAt": "2022-12-04T23:53:45Z", "content": "Dash cams are one of the smallest automotive devices on the market and now also one of the most useful. Theyre like seatbelts, you dont think need one until you really need one.  But are they all the… [+6319 chars]"}, {"source": {"id": null, "name": "Gadget.co.za"}, "author": null, "title": "MediaTek powers Oppo Reno 8 Pro - Gadget", "description": "A partnership between the leading mobile chip manufacturer and the global smartphone maker enhances technology one chip at a time.", "url": "https://gadget.co.za/mediatek-oppo/", "urlToImage": "https://i0.wp.com/gadget.co.za/wp-content/uploads/2022/12/oppo-reno-8.jpg?resize=651%2C398&ssl=1", "publishedAt": "2022-12-04T22:19:19Z", "content": "With an average of just under 11 hours of screen time per day, South Africans are among the most engaged online users online globally. \r\nSmartphone maker Oppo has tapped into this engagement by colla… [+3317 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don’t Miss: Lunar Occultation – Mars Disappears - SciTechDaily", "description": "What are some skywatching highlights in December 2022? The Moon sweeps past Jupiter twice this month, and actually covers Mars completely, in an event called an occultation, on December 7. The event is visible across the U.S., except for the Southeast and Eas…", "url": "https://scitechdaily.com/dont-miss-lunar-occultation-mars-disappears/", "urlToImage": "https://scitechdaily.com/images/Mars-at-Moons-Edge.jpg", "publishedAt": "2022-12-04T22:07:03Z", "content": "ByJet Propulsion LaboratoryDecember 4, 2022\r\nThe Moon occasionally moves in front of all of the Solar Systems planets, including Mars. Credit: Sergio Scauso\r\nWhat are some skywatching highlights in D… [+7271 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Commentary: In wake of tech layoffs, culled workers are biding their time - CNA", "description": "While more than a thousand workers in Singapore’s tech sector have been retrenched, other recruiters are trying to tap into this new pool of talent, says Yorlin Ng of Momentum Works.", "url": "https://www.channelnewsasia.com/commentary/tech-layoff-shopee-meta-amazon-twitter-job-boom-bust-3120136", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--b-fzaRpc--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/12/03/tech_layoff_composite.png?itok=gHZDfiPx", "publishedAt": "2022-12-04T22:00:00Z", "content": "As there is less pressure to fight for talent, companies now have more mental space to plan their transformation instead of rushing for the next big thing just because others are doing it. They can a… [+1373 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Japanese firm develops world's first early screening test for pancreatic cancer, using worms - Japan Today", "description": "A Japanese biotech firm says it has developed the world's first early screening test for pancreatic cancer, using the powerful noses of tiny worms. Hirotsu Bio Science last month launched its N-NOSE plus Pancreas test, marketing directly to consumers in Japan…", "url": "https://japantoday.com/category/features/health/japanese-biotech-firm-develops-world's-first-early-screening-test-for-pancreatic-cancer-using-worms", "urlToImage": null, "publishedAt": "2022-12-04T21:00:00Z", "content": "A Japanese biotech firm says it has developed the world's first early screening test for pancreatic cancer, using the powerful noses of tiny worms.\r\nHirotsu Bio Science last month launched its N-NOSE… [+2788 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Brain on Fire” – Doctors Successfully Treat a Child Suffering From a Mysterious Disease - SciTechDaily", "description": "Blood plasma exchanges helped a 5-year-old with a rare autoimmune disorder get better. The sick child's prognosis, who had not responded to conventional treatment, was bleak. Nevertheless, a group of doctors from Rutgers University thought there could be hope…", "url": "https://scitechdaily.com/brain-on-fire-doctors-successfully-treat-a-child-suffering-from-a-mysterious-disease/", "urlToImage": "https://scitechdaily.com/images/Brain-Fire-Disease-Neuroscience-Concept.jpg", "publishedAt": "2022-12-04T20:36:45Z", "content": "The child was suffering from anti-NMDAR (N-methyl-D-aspartate receptor) encephalitis, a rare and difficult-to-diagnose malfunction of the brain. \r\nBlood plasma exchanges helped a 5-year-old with a ra… [+4542 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "NASA astronauts successfully install new solar array on International Space Station - HT Tech", "description": "Spacewalkers have successfully installed Roll-Out Solar Array on the starboard truss structure of the International Space Station.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronauts-successfully-install-new-solar-array-on-international-space-station-71670146135134.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/04/1600x900/blog_useva_82_120322b_1670164099284_1670164113133_1670164113133.jpg", "publishedAt": "2022-12-04T19:33:41Z", "content": "NASA astronauts Josh Cassada and Frank Rubio have successfully installed Roll-Out Solar Array on the starboard truss structure of the space station on Sunday. \r\n NASA uploaded the video on Twitter an… [+1722 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "End-to-end encryption being tested for group chats on Google's Messages app - HT Tech", "description": "Google has begun testing end-to-end encryption for group chats on its Messages App after rolling out the service for individual chats.", "url": "https://tech.hindustantimes.com/tech/news/endtoend-encryption-being-tested-for-group-chats-on-google-s-messages-app-71670146187242.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/04/1600x900/shiwa-id-_LG6-LuBXaQ-unsplash_1670168103853_1670181098689_1670181098689.jpg", "publishedAt": "2022-12-04T19:12:24Z", "content": "Search giant Google recently announced that it was carrying out a number of tests for end-to-end encryption being employed on its \"Messages\" app, especially for group chats. \r\n The multinational also… [+1477 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Researchers Find COVID-19 Pandemic Stress Physically Aged Teens’ Brains - SciTechDaily", "description": "The brains of adolescents who were assessed after the COVID pandemic shutdowns ended appeared several years older than those of teens who were assessed before the pandemic. Until now, such accelerated changes in “brain age” have only been seen in children exp…", "url": "https://scitechdaily.com/stanford-researchers-find-covid-19-pandemic-stress-physically-aged-teens-brains/", "urlToImage": "https://scitechdaily.com/images/3D-Brain-Scan-Side-View.gif", "publishedAt": "2022-12-04T16:33:22Z", "content": "ByStanford UniversityDecember 4, 2022\r\nThe brains of adolescents who were assessed after the pandemic shutdowns ended appeared several years older than those of teens who were assessed before the pan… [+7187 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Resurrecting Billon-Year-Old Enzymes – Scientists Reveal New Key Information About Photosynthesis - SciTechDaily", "description": "Back to the future of photosynthesis. Rubisco, the central biocatalyst in photosynthesis, is the most prevalent enzyme on the planet. A group of Max Planck Institute researchers has uncovered one of the key early photosynthesis adaptations by reconstructing b…", "url": "https://scitechdaily.com/resurrecting-billon-year-old-enzymes-scientists-reveal-new-key-information-about-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Spinning-DNA-Blue.gif", "publishedAt": "2022-12-04T12:59:32Z", "content": "ByMax Planck SocietyDecember 4, 2022\r\nThe study also shed light on how photosynthesis adapted to the rise of oxygen.\r\nBack to the future of photosynthesis. \r\nRubisco, the central biocatalyst in photo… [+6037 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom’s sabotage crisis - BusinessTech", "description": "On top of suffering at the hands of thieves and saboteurs, Eskom now has to deal with the investigations as well.", "url": "https://businesstech.co.za/news/government/648781/eskoms-sabotage-crisis/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/crime-Eskom-coal-theft.jpg", "publishedAt": "2022-12-04T06:01:33Z", "content": "Following high-profile cases of theft and sabotage at power utility Eskom, the group says it now has to “micromanage” investigations because South Africa’s authorities are moving too slowly.\r\nAccordi… [+3548 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Yale Research Reveals Why Immunotherapy Doesn’t Work for Everybody - SciTechDaily", "description": "A Yale University study presents a new explanation for why immunotherapy only works for some cancer patients. Immunotherapy, a biotherapy that improves the immune system's ability to recognize and fight mutant tumor cells, has changed the treatment landscape …", "url": "https://scitechdaily.com/new-yale-research-reveals-why-immunotherapy-doesnt-work-for-everybody/", "urlToImage": "https://scitechdaily.com/images/Cancer-Immunity-Illustration.jpg", "publishedAt": "2022-12-04T04:50:37Z", "content": "ByYale UniversityDecember 3, 2022\r\nThe new research focused on the failure of a process known as mismatch repair.\r\nA Yale University study presents a new explanation for why immunotherapy only works … [+4130 chars]"}, {"source": {"id": null, "name": "Senatus.net"}, "author": null, "title": "Bugatti Chiron Tourbillon Blue Titanium by Jacob & Co - SENATUS", "description": "<div><p>\nThe Bugatti Chiron Tourbillon Blue Titanium features a full-metal body with a twist. The entire case went into DLC treatment. A high-tech surface-altering technology, it turns the hypercar-shaped body blue and scratch-proof.\n</p><p class=\"inline_ad\">…", "url": "https://senatus.net/album/view/15268/", "urlToImage": "https://cache2.senatus.net/files/albums/displayfb2/senatus_xDbslh.jpeg?versionId=KmjkGF7y3p_cFdf_w_zZ.YEDiJiVsNzC", "publishedAt": "2022-12-04T01:41:15Z", "content": "The Bugatti Chiron Tourbillon Blue Titanium features a full-metal body with a twist. The entire case went into DLC treatment. A high-tech surface-altering technology, it turns the hypercar-shaped bod… [+557 chars]"}, {"source": {"id": null, "name": "Slashdot.org"}, "author": null, "title": "Astronomers Say a New, Huge Satellite Is As Bright As the Brightest Stars - Slashdot - Slashdot", "description": "An anonymous reader quotes a report from Ars Technica: Last month, a Texas-based company announced that it had successfully deployed the largest-ever commercial communications satellite in low-Earth orbit. This BlueWalker 3 demonstration satellite measures ne…", "url": "https://science.slashdot.org/story/22/12/03/0030247/astronomers-say-a-new-huge-satellite-is-as-bright-as-the-brightest-stars", "urlToImage": "https://a.fsdn.com/sd/topics/space_64.png", "publishedAt": "2022-12-03T18:45:00Z", "content": "Last month, a Texas-based company announced that it had successfully deployed the largest-ever commercial communications satellite in low-Earth orbit. This BlueWalker 3 demonstration satellite measur… [+2399 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Ben Schreckinger", "title": "‘This will be awesome’: Musk leaks Twitter’s Hunter Biden files - POLITICO Europe", "description": "The tech billionaire’s latest move will likely ingratiate him further with conservatives — and plunge the social media platform deeper into political controversy.", "url": "https://www.politico.eu/article/this-will-be-awesome-musk-leaks-twitters-hunter-biden-files/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/12/03/GettyImages-1242720021-scaled.jpg", "publishedAt": "2022-12-03T09:37:00Z", "content": "Elon Musk is stoking controversy on a new front, this time revealing sensitive internal deliberations at Twitter around Hunter Bidens personal computer files in the fall of 2020.\r\nOn Friday evening, … [+4476 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This property trend is shaking up South Africa’s housing market - BusinessTech", "description": "As some cities in South Africa start running out of room to expand, they’re turning to making better use of the space they do have.", "url": "https://businesstech.co.za/news/property/646761/this-property-trend-is-shaking-up-south-africas-housing-market/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/12/House-suburb-complex.png", "publishedAt": "2022-12-03T09:22:30Z", "content": "Despite the countrys economic woes and the somewhat lacklustre performance of the housing market, stock shortages are looming in many parts of the country – and not only in areas where ongoing semigr… [+6086 chars]"}]}