{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Davidson", "title": "Surround yourself in the sounds of Super Bowl Sunday with these 3 top soundbar deals - TechRadar", "description": "Level up your TV sound for the Super Bowl", "url": "https://www.techradar.com/televisions/soundbars/surround-yourself-in-the-sounds-of-super-bowl-sunday-with-these-3-top-soundbar-deals", "urlToImage": "https://cdn.mos.cms.futurecdn.net/d6osaBRvzrUcoSy6XZzbPK-1200-80.jpg", "publishedAt": "2024-02-04T20:00:25Z", "content": "We all know about the importance of having a good TV for watching the Super Bowl. You want a set with the best picture possible, one that can process the fast motion of every pass and run without com… [+4796 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ashwin Rajagopalan", "title": "6 coolest tech launches from Oppo, Redmi, BenQ, OnePlus and other consumer tech companies so far this... - Moneycontrol", "description": "India launches: Smartphones with 6,67 inch curved displays, a smart projector with Netflix integrated, new Bluetooth TWS earbuds with good active noise cancellation and a sub-35K slim notebook laptop.", "url": "https://www.moneycontrol.com/news/trends/lifestyle/6-coolest-tech-launches-from-oppo-redmi-benq-oneplus-and-other-consumer-tech-companies-so-far-this-year-12190061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/redmi-1-770x433.jpg", "publishedAt": "2024-02-04T13:34:52Z", "content": "Thirty-five days into 2024, weve already seen a flurry of launches from all the big consumer tech brands. OPPO and Redmi unveiled their first major smartphones for 2024 while BenQ launched an aggress… [+4512 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Mysterious Disappearance of an Underwater Explorer in Antarctica - SciTechDaily", "description": "The unmanned underwater vehicle Ran has gone missing under a glacier in Antarctica. The vehicle, owned by the University of Gothenburg, is one of three similar in the whole world that is used for research and has contributed to important knowledge about the s…", "url": "https://scitechdaily.com/the-mysterious-disappearance-of-an-underwater-explorer-in-antarctica/", "urlToImage": "https://scitechdaily.com/images/AUV-Ran.jpg", "publishedAt": "2024-02-04T12:42:23Z", "content": "The AUV is programmed in advance and then sent out on long journeys under the glaciers of Antarctica. Credit: Anna Wåhlin\r\nThe unmanned underwater vehicle Ran has gone missing under a glacier in Anta… [+4377 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Saumya Nigam", "title": "Apple's upcoming Vision Pro Headset: The fusion of Mac and TV technology - India TV News", "description": "Apple has had mixed results courting developers. Netflix, one of the most popular consumer video apps, said late Friday it is not making a new app for the Vision Pro, though consumers can watch movies and series on the device's web browser.", "url": "https://www.indiatvnews.com/technology/news/apple-s-upcoming-vision-pro-headset-the-fusion-of-mac-and-tv-technology-2024-02-04-915208", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/02/apple-vision-pro-1707045586.jpg", "publishedAt": "2024-02-04T11:28:38Z", "content": "Apple's Vision Pro has the potential to revolutionize home entertainment and work technology by redefining how people watch television and use computers. Positioned as a potential successor to both t… [+4844 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "iPhone 15 Pro Max Beats The Galaxy S24 By The Skin Of Its Teeth In The Latest Competitive Speed Test - Wccftech", "description": "The iPhone 15 Pro Max remains the speed test champion by beating the Galaxy S24 Ultra, but it was a close call this time", "url": "https://wccftech.com/iphone-15-pro-max-narrowly-beats-the-galaxy-s24-ultra-in-speed-test/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/02/iPhone-15-Pro-Max-vs-Galaxy-S24-Ultra-speed-test.jpg", "publishedAt": "2024-02-04T08:51:00Z", "content": "The Galaxy S24 Ultra might have been able to last longer than the iPhone 15 Pro Max in a previous battery drain test, but Apples top-end flagship retains its title of being the speed test king by bea… [+1847 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "From green hype to bailouts, the nickel industry has imploded - MINING.COM - MINING.com", "description": "The nickel market has been thrown into chaos after a flood of new supplies from Indonesia — the result of huge Chinese investment and major technological breakthroughs.", "url": "https://www.mining.com/web/from-green-hype-to-bailouts-the-nickel-industry-has-imploded/", "urlToImage": "https://www.mining.com/wp-content/uploads/2024/02/Abandoned-Kaula-Kotselvaara-Nickel-Mine-in-Russia.jpeg", "publishedAt": "2024-02-04T00:21:43Z", "content": "Yet things have quickly soured for BHP and other miners. The nickel market has been thrown into chaos after a flood of new supplies from Indonesia the result of huge Chinese investment and major tech… [+4222 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysics in Crisis? Mystery Object Discovered That Could Change Everything - SciTechDaily", "description": "Astronomers discover a celestial object that defies classification, possibly uncovering a new type of cosmic entity at the edge of known physics. Sometimes astronomers come across objects in the sky that we can’t easily explain. In our new research, published…", "url": "https://scitechdaily.com/astrophysics-in-crisis-mystery-object-discovered-that-could-change-everything/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Mystery-Object-Art-Concept.jpg", "publishedAt": "2024-02-03T15:26:13Z", "content": "ByEwan D. Barr, Arunima Dutta, and Benjamin StappersFebruary 3, 2024Researchers have identified an enigmatic cosmic system that might contain an object bridging the gap between neutron stars and blac… [+6851 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "GTA V PS5 Cheats: List of all GTA V Cheat Codes for PS5, PS4 - HT Tech", "description": "GTA V PS5 Cheats: Players can take advantage of GTA V PS5 cheats in the game and enhance their gameplay experience. So, if you’re new to GTA V, then check out the list of all GTA V cheat codes for PS5, PS4.", "url": "https://tech.hindustantimes.com/gaming/news/gta-v-ps5-cheats-list-of-all-gta-v-cheat-codes-for-ps5-ps4-71706877886480.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/02/1600x900/gta_v_1678076345536_1706877966951.png", "publishedAt": "2024-02-03T12:32:17Z", "content": "GTA V PS5 Cheats: GTA V is considered one of the best games in history. It has gone on to sell millions of copies and is now the second-best-selling video game of all time. Even though GTA V is now o… [+3205 chars]"}]}