{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sleeping Black Hole Erupts in Real Time – Blasting Out Record-Breaking X-Rays - SciTechDaily", "description": "A mysterious black hole in a distant galaxy just woke up after decades of silence—and it’s putting on a cosmic light show! ESA’s XMM-Newton and other X-ray telescopes are capturing massive bursts of energy known as quasiperiodic eruptions (QPEs) that defy cur…", "url": "https://scitechdaily.com/?p=469487", "urlToImage": "https://scitechdaily.com/images/Giant-Black-Hole-Awakens-With-Repetitive-X-Ray-Bursts-scaled.jpg", "publishedAt": "2025-04-14T08:23:28Z", "content": "This artist’s impression illustrates the mechanism that could be at the origin of the powerful bursts of X-ray light seen from a newly awakened black hole named Ansky. Credit: ESA\r\nA mysterious black… [+7486 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shocking Spherules on Mars: NASA’s Perseverance Rover Finds a Rock That Defies Explanation - SciTechDaily", "description": "Perseverance just stumbled upon one of Mars’ weirdest rocks yet—a formation covered in dark, spherical shapes with mysterious textures that have scientists buzzing. While similar Martian spheres have been seen before, this one, dubbed “St. Pauls Bay,” stands …", "url": "https://scitechdaily.com/shocking-spherules-on-mars-nasas-perseverance-rover-finds-a-rock-that-defies-explanation/", "urlToImage": "https://scitechdaily.com/images/St-Pauls-Bay-Target-Rock-Spherical-Objects.jpg", "publishedAt": "2025-04-13T17:01:27Z", "content": "This image from NASA’s Mars Perseverance rover, a fusion-processed SuperCam Remote Micro Imager (RMI) mosaic, shows part of the “St. Pauls Bay” target, acquired from the lower Witch Hazel Hill area o… [+4207 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "Apple Now Facing More Class-Action Lawsuits In Both The U.S. And Canada Over Delayed Siri Features; Plaintiffs Claimed That Phone Upgrades Were Made Over False Marketing - Wccftech", "description": "The delayed Siri features has landed Apple in more trouble as the technology giant now faces more class-action lawsuits", "url": "https://wccftech.com/apple-facing-more-lawsuits-due-to-delayed-siri-features/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/04/Apple-Intelligence-delayed-Siri-features.jpg", "publishedAt": "2025-04-13T10:06:00Z", "content": "A new and highly improved version of Siri was said to arrive under the umbrella of Apple Intelligences generative AI features. Unfortunately, the Cupertino firm ran into a boatload of snags and ultim… [+1781 chars]"}]}