{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Targeting “Undruggable” Proteins Opens New Doors for Neurodegenerative Disease Treatment - Technology Networks", "description": "Researchers unveil groundbreaking research with the potential to alter the treatment landscape for neurodegenerative diseases (NDs). The study introduces a pioneering approach aimed at combating conditions such as Alzheimer’s disease.", "url": "https://www.technologynetworks.com/drug-discovery/news/targeting-undruggable-proteins-opens-new-doors-for-neurodegenerative-disease-treatment-383913", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/383913/targeting-undruggable-proteins-opens-new-doors-for-neurodegenerative-disease-treatment-383913-640x360.jpg?cb=20240219", "publishedAt": "2024-02-19T09:28:00Z", "content": "Professors Nathan Gianneschi of the International Institute for Nanotechnology at Northwestern University in collaboration with Jeffrey A. Johnson and Delinda A. Johnson, senior scientist, of the Uni… [+6785 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Three Apollo asteroids set to pass Earth today, reveals NASA; check speed, size, and other details - HT Tech", "description": "NASA, using its advanced tech, has revealed that Earth will witness three asteroid approaches today, February 19. From size and speed to distance of close approach, know all about the asteroids.", "url": "https://tech.hindustantimes.com/tech/news/three-apollo-asteroids-set-to-pass-earth-today-reveals-nasa-check-speed-size-and-other-details-71708319057989.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/19/1600x900/3_1702029774727_1708319112346.png", "publishedAt": "2024-02-19T05:20:27Z", "content": "January 2024 was filled with numerous asteroid approaches, and February is set to continue the trend. But how do these asteroids get spotted? When NASA's telescopes track a new Near-Earth Asteroid (N… [+2987 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This soft serve machine is not broken, says NASA, shares image taken from ISS on Instagram - HT Tech", "description": "NASA captured a stunning image of Earth from the International Space Station, showing frozen seawater swirls along Labrador coast", "url": "https://tech.hindustantimes.com/tech/news/this-soft-serve-machine-is-not-broken-says-nasa-shares-image-taken-from-iss-on-instagram-71708239259190.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/18/1600x900/Nasa_soft_swirl_1708240294051_1708240363871.jpg", "publishedAt": "2024-02-18T18:14:30Z", "content": "NASA recently shared a breathtaking image of Earth taken from the International Space Station (ISS), revealing an incredible sight of frozen seawater. Captured on February 3, 2024, the image showcase… [+2253 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Mysterious 280-Million-Year-Old Fossil That Fooled Scientists for Decades - SciTechDaily", "description": "Paleontological analysis shows renowned fossil thought to show soft tissue preservation is in fact just paint. A 280-million-year-old fossil that has baffled researchers for decades has been shown to be, in part, a forgery following new examination of the rem…", "url": "https://scitechdaily.com/the-mysterious-280-million-year-old-fossil-that-fooled-scientists-for-decades/", "urlToImage": "https://scitechdaily.com/images/Tridentinosaurus-antiquus.jpg", "publishedAt": "2024-02-17T08:00:00Z", "content": "Tridentinosaurus antiquus was discovered in the Italian Alps in 1931 and was thought to be an important specimen for understanding early reptile evolution – but has now been found to be, in part a fo… [+4504 chars]"}]}