{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lorenzo Franceschi-Bicchierai", "title": "Meet Window Snyder, the trailblazer who helped secure the internet and billions of devices - TechCrunch", "description": "Meet Window Snyder, a veteran hacker and cybersecurity pro who has helped companies like Microsoft, Mozilla, and Apple be more secure.", "url": "https://techcrunch.com/2023/08/04/window-snyder-cybersecurity-trailblazer/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/window-snyder-1.jpg?resize=1200,801", "publishedAt": "2023-08-04T15:01:33Z", "content": "After the band played Miles Davis “Seven Steps to Heaven,” and an effusive introduction from the head of the school, Window Snyder stands in front of a hall filled with around 800 students at her old… [+26437 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm set to strike Earth in just a few hours, says NASA; Know the danger - HT Tech", "description": "NASA models have shown that a solar storm will strike the Earth in just a few hours. It is being caused by one of the numerous solar flare eruptions that took place recently. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-set-to-strike-earth-in-just-a-few-hours-says-nasa-know-the-danger-71691153736730.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/04/1600x900/m73-flare-rotated_0_1680256680821_1691153773285.jpeg", "publishedAt": "2023-08-04T13:00:16Z", "content": "Recently, the European Space Agency (ESA) revealed details about a 2021 solar storm that was so massive that it struck the Earth, the Moon, and Mars at the same time. Luckily, that event did not impa… [+2402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Uncover a Surprising Link Between Pure Mathematics and Genetics - SciTechDaily", "description": "An interdisciplinary team of mathematicians, engineers, physicists, and medical scientists has discovered a surprising connection between pure mathematics and genetics. This connection sheds light on the structure of neutral mutations and the evolution of org…", "url": "https://scitechdaily.com/scientists-uncover-a-surprising-link-between-pure-mathematics-and-genetics/", "urlToImage": "https://scitechdaily.com/images/Evolution-Genetics-Abstract.jpg", "publishedAt": "2023-08-04T11:24:45Z", "content": "Researchers have discovered an unexpected link between number theory in mathematics and genetics, providing critical insight into the nature of neutral mutations and the evolution of organisms. The t… [+2043 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 to Apple Watch 9, everything that could be launched at Apple event - HT Tech", "description": "With the launch date for Apple’s next event now being leaked, everyone's thoughts have turned to something else - what can we expect to be launched at the event? From iPhone 15 series, new Apple Watches, to MacBooks, know everything that could be announced at…", "url": "https://tech.hindustantimes.com/tech/news/iphone-15-to-apple-watch-9-everything-that-could-be-launched-at-apple-event-71691146529237.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/04/1600x900/screen-post-0ePrvkOL3bw-unsplash_1691146774051_1691146779789.jpg", "publishedAt": "2023-08-04T11:02:58Z", "content": "Apple September event: After the launch of Samsung's fifth-generation foldables, it is now Apple's turn to unveil its flagship devices. The Cupertino-based tech giant is gearing up to launch its iPho… [+2907 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Perseid Meteor Shower and a Rare Super Blue Moon - SciTechDaily", "description": "Saturn shines brightly all night in August, while the Perseids return for a good show on the 12th/13th, and a Super Blue Moon! What are some skywatching highlights in August 2023? Saturn reaches opposition this month, meaning it's at its biggest and brightest…", "url": "https://scitechdaily.com/dont-miss-perseid-meteor-shower-and-a-rare-super-blue-moon/", "urlToImage": "https://scitechdaily.com/images/Meteor-Shower-Art-Concept.jpg", "publishedAt": "2023-08-04T08:17:10Z", "content": "ByNASA Jet Propulsion LaboratoryAugust 4, 2023\r\nAugust offers a celestial extravaganza with clear views of Saturn at its opposition, the return of the annual Perseid meteor shower, and a rare super b… [+8042 chars]"}]}