{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rewinding Earth's Climate Clock: A Deep Dive Into 66 Million Years of CO2 Data - SciTechDaily", "description": "Carbon dioxide has not been as high as today's concentrations in 14 million years thanks to fossil fuel emissions now warming the planet. Today atmospheric carbon dioxide is at its highest level in at least several million years thanks to widespread combustio…", "url": "https://scitechdaily.com/rewinding-earths-climate-clock-a-deep-dive-into-66-million-years-of-co2-data/", "urlToImage": "https://scitechdaily.com/images/Earth-Atmospheric-Carbon-Dioxide-Chart-Concept.jpg", "publishedAt": "2024-01-07T15:47:56Z", "content": "The concentration of atmospheric CO2 is currently at a record high of 419 ppm due to human activities, particularly the burning of fossil fuels. An international team of scientists is examining geolo… [+7593 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomical Illusions: New Images Reveal What Neptune and Uranus Really Look Like - SciTechDaily", "description": "Recent research led by Professor Patrick Irwin shows that Neptune and Uranus are both a similar shade of greenish-blue, challenging previous perceptions of their colors. The study used modern telescopic data to correct historical color inaccuracies and explai…", "url": "https://scitechdaily.com/astronomical-illusions-new-images-reveal-what-neptune-and-uranus-really-look-like/", "urlToImage": "https://scitechdaily.com/images/Neptune-and-Uranus-True-Colors.jpg", "publishedAt": "2024-01-07T09:42:41Z", "content": "A study reveals Neptune and Uranus are both greenish-blue, not the deep azure and pale cyan previously believed. Modern telescope data was used to correct these historical color misrepresentations. C… [+8848 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The “Dolomite Problem” – Scientists Resolve 200-Year-Old Geology Mystery - SciTechDaily", "description": "To create mountains from dolomite, a common mineral, it must periodically dissolve. This seemingly paradoxical concept could help make new defect-free semiconductors and more. For two centuries, scientists have failed to grow a common mineral in the laborator…", "url": "https://scitechdaily.com/the-dolomite-problem-scientists-resolve-200-year-old-geology-mystery/", "urlToImage": "https://scitechdaily.com/images/Dolomites-Close-Up-scaled.jpg", "publishedAt": "2024-01-07T01:05:50Z", "content": "Professor Wenhao Sun shows off dolomite from his personal rock collection. Sun studies crystal growth of minerals from a materials science perspective. By understanding how atoms come together to for… [+7001 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Unboxing Redmi Note 13 Pro Plus 5G: Underwater Test Highlights | Redmi Note 13 Pro Plus 5G Review - India Today", "description": "Uncover the extraordinary features of the Redmi Note 13 Pro Plus 5G in a unique review session conducted by Tech Today's anchor, Ayush Alavadi. The highlight...", "url": "https://www.youtube.com/watch?v=wH-qLdj9Jno", "urlToImage": "https://i.ytimg.com/vi/wH-qLdj9Jno/maxresdefault.jpg", "publishedAt": "2024-01-06T08:54:07Z", "content": null}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Rakesh Patil", "title": "More than 100 smallcaps gain 10-52% as index hit fresh record high - Moneycontrol", "description": "The present sentiment suggests a promising trajectory towards 21800-21850 for the Nifty. If it surpasses 21850, we might anticipate a further climb toward 22000, says Rupak De, Senior Technical Analyst at LKP Securities.", "url": "https://www.moneycontrol.com/news/business/markets/more-than-100-smallcaps-gain-10-52-as-index-hit-fresh-record-high-12007621.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/01/sensex_nifty-marketup_sensexup-Niftyup-1-770x433.jpg", "publishedAt": "2024-01-06T05:06:38Z", "content": "The market began the new year on a positive note but ended the week with moderate losses. This was due to volatility caused by uncertainty over the future rate cut by Fed post-December meeting minute… [+4082 chars]"}]}