{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "David French", "title": "Dow and S&P end at fresh record highs, lifted by Netflix earnings and tech stocks - Reuters", "description": "The Dow Jones Industrial Average and S&P 500 chalked up record closing highs on Friday, with the Nasdaq also in positive territory, as markets were boosted by an earnings-driven jump in Netflix shares and broader gains across technology stocks.", "url": "https://www.reuters.com/markets/us/wall-street-futures-rise-tech-stocks-gain-netflix-jumps-after-strong-earnings-2024-10-18/", "urlToImage": "https://www.reuters.com/resizer/v2/TTEZ6BJSARKLNL7NETZ4AE3QZM.jpg?auth=c6dfb4cf57b812b10a7c168150c63442514d534d2964217edf2dc22f8669c585&height=1005&width=1920&quality=80&smart=true", "publishedAt": "2024-10-18T22:55:47Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Amazing New Benefit of Ozempic: Reducing Alcohol and Opioid Addiction - SciTechDaily", "description": "New research shows that Ozempic and similar drugs reduce opioid overdoses by 40% and alcohol intoxication by 50% in people with substance use disorders. These medications, often prescribed for diabetes and weight issues, may help treat addiction by influencin…", "url": "https://scitechdaily.com/scientists-discover-amazing-new-benefit-of-ozempic-reducing-alcohol-and-opioid-addiction/", "urlToImage": "https://scitechdaily.com/images/Obese-Man-Using-Semaglutide-Ozempic.jpg", "publishedAt": "2024-10-18T20:26:52Z", "content": "Ozempic is a medication containing semaglutide, a glucagon-like peptide-1 receptor agonist (GLP-1 RA), primarily used to treat type 2 diabetes by improving blood sugar control and promoting weight lo… [+2806 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Have Finally Uncovered the Mysterious Origin of Most Meteorites - SciTechDaily", "description": "Researchers found that 70% of meteorites originate from three asteroid families formed by recent collisions. They have identified the sources of over 90% of all known meteorites. A research team, led by scientists from the CNRS, the European Southern Observat…", "url": "https://scitechdaily.com/scientists-have-finally-uncovered-the-mysterious-origin-of-most-meteorites/", "urlToImage": "https://scitechdaily.com/images/Dark-Asteroids-Concept.jpg", "publishedAt": "2024-10-18T13:11:18Z", "content": "An international research team has determined that 70% of known meteorite falls come from three young asteroid families formed by collisions in the main asteroid belt 5.8, 7.5, and 40 million years a… [+5433 chars]"}]}