{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "Craig Hale", "title": "Intel apparently cancels its most intriguing CPU hybrid yet - TechRadar", "description": "Thunder Bay has been canceled, but we aren't entirely sure why", "url": "https://www.techradar.com/news/intel-apparently-cancels-its-most-intriguing-cpu-hybrid-yet", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZVQeXPSKu4GXBeAZNwtZ8H-1200-80.jpg", "publishedAt": "2023-03-20T17:10:39Z", "content": "An Intel project around two years in the making (and likely several more years of research) has been canceled, meaning the company will no longer be channeling efforts into creating a CPU-VPU hybrid,… [+1755 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DART VADAR harnesses the force of enzymes for better RNA drugs: New, easy-to-design RNA-based sensor can detect and automatically respond to molecular triggers within cells - Science Daily", "description": "Gene therapy has been heralded as the new frontier of medicine, but there are still many limitations to current technologies; among them, how to deliver therapeutic genes to specific cells, and only activate them in the right context. A team has created a new…", "url": "https://www.sciencedaily.com/releases/2023/03/230320101933.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-03-20T16:02:07Z", "content": "More than twelve billion doses of mRNA vaccines have been administered globally since the start of the COVID pandemic, saving millions of lives. But RNA-based therapies for other diseases have so far… [+9973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Deep Impact: Heat Waves Happen at the Bottom of the Ocean Too - SciTechDaily", "description": "First assessment of bottom marine heat waves opens a window on the deep. The 2013-2016 marine heat wave known as “The Blob” warmed a vast expanse of surface waters across the northeastern Pacific, disrupting West Coast marine ecosystems, depressing salmon ret…", "url": "https://scitechdaily.com/deep-impact-heat-waves-happen-at-the-bottom-of-the-ocean-too/", "urlToImage": "https://scitechdaily.com/images/Bathymetric-Features-Western-Atlantic-Ocean-Basin.jpg", "publishedAt": "2023-03-20T12:33:39Z", "content": "ByNational Oceanic and Atmospheric Administration (NOAA)March 20, 2023\r\nThis visualization depicts bathymetric features of the western Atlantic Ocean Basin, including the continental shelf, captured … [+9286 chars]"}]}