{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Experience a smooth performance with the 8GB+3GB extended RAM in the all-new vivo V21 series - BusinessWorld Online", "description": "Extra powerful processors and Extended RAM Technology enable users to enjoy the glossy-smooth functionality of the vivo V21 Series Enjoy the smooth performance of the vivo V21 Series, made possible with 8GB + 3GB Extended RAM Technology The vivo V21 5G and V2…", "url": "https://www.bworldonline.com/experience-a-smooth-performance-with-the-8gb3gb-extended-ram-in-the-all-new-vivo-v21-series/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/06/vivo-V21_Tech-Sustaining-PR-PHOTO-1024x1024.png", "publishedAt": "2021-06-18T07:00:50Z", "content": "<ul><li>Enjoy the smooth performance of the vivo V21 Series, made possible with 8GB + 3GB Extended RAM Technology</li><li>The vivo V21 5G and V21e runs on seriously powerful mobile processors</li><li… [+3635 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "China orders billionaire to lie low after poem post sparks fury - The Star Online", "description": "China’s government summoned Meituan’s Wang Xing to a meeting recently and warned him to keep a low profile, after the founder of China’s third-largest tech corporation last month posted a controversial poem that convulsed markets and sparked a social media fu…", "url": "https://www.thestar.com.my/tech/tech-news/2021/06/18/china-orders-billionaire-to-lie-low-after-poem-post-sparks-fury", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/06/18/1188991.jpg", "publishedAt": "2021-06-18T06:30:00Z", "content": "Chinas government summoned Meituans Wang Xing to a meeting recently and warned him to keep a low profile, after the founder of Chinas third-largest tech corporation last month posted a controversial … [+3383 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "Vanessa Lim", "title": "Shorter wait for Moderna COVID-19 vaccine slots, experts urge residents not to wait to get shots - CNA", "description": "SINGAPORE: Individuals looking to book their COVID-19 vaccination slots for the Moderna vaccine are likely to face a shorter wait, compared with those opting for the Pfizer-BioNTech jab. Experts CNA spoke have urged residents not to delay getting their vaccin…", "url": "https://www.channelnewsasia.com/news/singapore/covid-19-vaccination-slots-pfizer-moderna-shorter-wait-faster-15039748", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14486780/16x9/991/557/977357f023e24f99fd2f1afa9c50018c/IK/covid-19-vaccination-at-tanjong-pagar--singapore.jpg", "publishedAt": "2021-06-18T06:03:41Z", "content": "SINGAPORE: Individuals looking to book their COVID-19 vaccination slots for the Moderna vaccine are likely to face a shorter wait, compared with those opting for the Pfizer-BioNTech jab. Experts CNA … [+6524 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Daphne Galvez", "title": "Infectious disease expert backs use of face shield vs COVID-19 - INQUIRER.net", "description": "MANILA, Philippines — An infectious disease expert, who is also a government technical adviser, still recommends the use of face shields even in", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2020/12/face-shield-22dec2020-620x413.jpeg", "publishedAt": "2021-06-18T05:29:00Z", "content": "MANILA, Philippines An infectious disease expert, who is also a government technical adviser, still recommends the use of face shields even in outdoor settings due to the threat of COVID-19’a more in… [+3635 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung may have quietly discontinued the Galaxy Z Fold 2, does that mean the Galaxy Z Fold 3 is coming soon? - HT Tech", "description": "You can no longer buy the Samsung Galaxy Z Fold 2 from the Samsung store online, at least in the US. This can only mean one thing - the Galaxy Z Fold 3 is about to be launched soon.", "url": "https://tech.hindustantimes.com/mobile/news/samsung-may-have-quietly-discontinued-the-galaxy-z-fold-2-does-that-mean-the-galaxy-z-fold-3-is-coming-soon-71623984850730.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/06/18/1600x900/configurator-Fold2-family-02-DT-765x465_1623985367158_1623985376572.jpg", "publishedAt": "2021-06-18T02:54:10Z", "content": "We know that the Samsung Galaxy Fold 3 is coming soon. And recently, weve learned of another sign that indicates that the launch of the new foldable smartphone might be right around the corner. You c… [+2316 chars]"}, {"source": {"id": null, "name": "Voxy.co.nz"}, "author": null, "title": "Pioneering technology to help NASA land the next person on the moon - University of Western Australia - Voxy", "description": "A project led by The University of Western Australia in partnership with Fugro Australia and supported by the Australian Space Agency will expand optical communication technology to support international space exploration missions such as NASA’s", "url": "http://www.voxy.co.nz/technology/5/388933", "urlToImage": null, "publishedAt": "2021-06-18T02:23:46Z", "content": "A project led by The University of Western Australia in partnership with Fugro Australia and supported by the Australian Space Agency will expand optical communication technology to support internati… [+2607 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Amanda Silberling", "title": "Spotify acquires Podz, a podcast discovery platform - TechCrunch", "description": "Podcasts are all the rage, but podcast discovery is a challenge. Today, Spotify announced its acquisition of Podz, a startup that’s trying to solve the problem of podcast discovery. “At Spotify, we are investing to build and scale the world’s best (and most p…", "url": "http://techcrunch.com/2021/06/17/spotify-acquires-podz-a-podcast-discovery-app/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/08/spotify-app-icon-iphone.jpg?w=711", "publishedAt": "2021-06-17T22:24:26Z", "content": "Podcasts are all the rage, but podcast discovery is a challenge. Today, Spotify announced its acquisition of Podz, a startup that’s trying to solve the problem of podcast discovery.\r\n“At Spotify, we … [+2544 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Verity Sulway", "title": "GB News fails - from subtle mooning and tech glitches to messages from Mike Oxlong - Irish Mirror", "description": "GB News had a rocky opening week after trolls tricked hosts into reading out rude names, technical issues galore, Ofcom complaints, advertisers pulling out and exposed buttocks", "url": "https://www.mirror.co.uk/tv/tv-news/gb-news-fails-subtle-mooning-24344272", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article24335943.ece/ALTERNATES/s1200/1_Andrew-Neill-kicks-off-GB-News-with-savage-dig-at-BBC.jpg", "publishedAt": "2021-06-17T19:50:57Z", "content": "GB News launched on Sunday but has already been the butt of several jokes as pranksters get in touch using fake rude names such as Mike Hunt, along with a litany of technical issues.\r\n Not only that,… [+4161 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Nick Pino", "title": "Xbox Design Lab has reopened for custom Xbox Series X controllers - Techradar", "description": "Microsoft reopens the customization software for next-gen hardware", "url": "https://www.techradar.com/news/xbox-design-lab-has-reopened-for-custom-xbox-series-x-controllers", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ShNS3L2VkjoKx2XmFh8Qe4-1200-80.jpg", "publishedAt": "2021-06-17T18:26:03Z", "content": "Microsoft has announced that Xbox Design Lab, its controller customization software that allows gamers to design their own controllers, can now be used to create Xbox Series X and Xbox Series S contr… [+1605 chars]"}, {"source": {"id": null, "name": "Siliconrepublic.com"}, "author": "Sarah Harford", "title": "Ulster University data study could 'unlock insights' for treating Covid - Siliconrepublic.com", "description": "Using tech from Dell and Seagate, researchers at Ulster University will perform advanced analyses of Covid-19 patient data.", "url": "https://www.siliconrepublic.com/innovation/ulster-university-data-project-covid-19-treatment", "urlToImage": "https://www.siliconrepublic.com/wp-content/uploads/2021/06/Tony_Bjourson.jpeg", "publishedAt": "2021-06-17T16:00:37Z", "content": "Using tech from Dell and Seagate, researchers will perform advanced analyses of Covid-19 patient data.\r\nResearchers at Ulster University are undertaking a major data project that could provide insigh… [+2013 chars]"}, {"source": {"id": null, "name": "DailyFX"}, "author": "James Stanley", "title": "Euro Technical Analysis: EUR/USD, EUR/JPY, EUR/GBP - DailyFX", "description": "The Euro put in a big move yesterday on the back of the FOMC rate decision, but which markets are primed for fading that move and which are showing potential new trends?", "url": "https://www.dailyfx.com/forex/fundamental/daily_briefing/session_briefing/daily_fundamentals/2021/06/17/Euro-Technical-Analysis-EUR-USD-EUR-JPY-EUR-GBP.html", "urlToImage": "https://a.c-dn.net/b/0Tf6l1/headline_GettyImages-172171260.jpg", "publishedAt": "2021-06-17T15:40:00Z", "content": "Euro Talking Points:\r\n<ul><li>The single currency put in big moves against USD and JPY on the heels of yesterday’s FOMC rate decision. </li><li>In EUR/USD, it appears that we have a trend reversal wh… [+3900 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Boeing's Second Starliner Test Flight to Launch in July, NASA Says - ExtremeTech", "description": "Boeing has been toiling throughout the pandemic to get its CST-100 Starliner spacecraft ready for a do-over test flight, and NASA believes that will happen next month.", "url": "https://www.extremetech.com/extreme/323834-boeings-second-starliner-test-flight-to-launch-in-july-nasa-says", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2019/12/Starliner_OFT_Rollout.jpg", "publishedAt": "2021-06-17T14:01:48Z", "content": "For several years, SpaceX and Boeing were neck-and-neck in the race to send astronauts into space, but then Boeing encountered a few setbacks. That has left SpaceX as the sole private space firm laun… [+2540 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Darren Allan", "title": "Here’s how the new windows snapping works in Windows 11 - Techradar", "description": "It’s more convenient than the functionality seen with Windows 10", "url": "https://www.techradar.com/news/heres-how-the-new-windows-snapping-works-in-windows-11", "urlToImage": "https://cdn.mos.cms.futurecdn.net/yBsirNxrnuBxshrCgrFwsQ-1200-80.jpg", "publishedAt": "2021-06-17T10:45:19Z", "content": "Windows 11 has been leaked, as youre doubtless aware, and the spilled build of the OS has given us an interesting look at not just the appearance of the redesigned desktop OS, but also how it works i… [+1996 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Fran Sanders", "title": "Rocket Lab to Design NASA’s Mars Spacecraft: ESCAPADE Duo Using Photon Spacecraft Bus - Tech Times", "description": "Rocket Lab will get to design NASA’s ESCAPADE duo – Mars Spacecraft for future missions. Rocket Lab finally got Mars in its crosshairs.", "url": "https://www.techtimes.com/articles/261530/20210616/rocket-lab-design-nasa-s-mars-spacecraft-escapade-duo-using.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/387275/rocket-lab-builds-nasas-mars-spacecrafts.png", "publishedAt": "2021-06-16T13:02:13Z", "content": "(Photo : NASA) \r\nThe California-based Rocket Lab has finally got Mars in its crosshairs as the company will send a NASA CubeSat mission straight to the Earth's moon in fall. It also plans to launch i… [+3078 chars]"}]}