{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Massive Asteroid Impact Crater in Greenland Occurred a Few Million Years After Dinosaurs Went Extinct - SciTechDaily", "description": "Danish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater buried under a kilometer of Greenlandic ice. The dating ends speculation that the meteorite impacted after the appearance of humans and opens up a new…", "url": "https://scitechdaily.com/massive-asteroid-impact-crater-in-greenland-occurred-a-few-million-years-after-dinosaurs-went-extinct/", "urlToImage": "https://scitechdaily.com/images/Fieldwork-Edge-of-Greenland-Ice-Sheet-in-2019-scaled.jpg", "publishedAt": "2022-03-10T04:47:56Z", "content": "Photo from fieldwork at the edge of the Greenland Ice Sheet in 2019. Credit: Pierre Beck\r\nDanish and Swedish researchers have dated the enormous Hiawatha impact crater, a 31 km-wide meteorite crater … [+5564 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "UQ and Moderna partner to research and develop vaccines against global public health threats - News-Medical.Net", "description": "The University of Queensland has been selected as one of the first launch institutions in the world to partner with biotechnology company Moderna to research and develop vaccines to tackle the world's greatest global public health threats.", "url": "https://www.news-medical.net/news/20220309/UQ-and-Moderna-partner-to-research-and-develop-vaccines-against-global-public-health-threats.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/134984011-620x480.jpg", "publishedAt": "2022-03-10T03:33:00Z", "content": "The University of Queensland has been selected as one of the first launch institutions in the world to partner with biotechnology company Moderna to research and develop vaccines to tackle the world'… [+2942 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Stefanie Waldek", "title": "SpaceX launches 48 more Starlink satellites on an 'American broomstick' - TechCrunch", "description": "​It’s up, up and away for another SpaceX Starlink mission. At 5:45 this morning PST, a Falcon 9 rocket lifted off from Space Launch Complex 40 at Cape Canaveral in Florida, adding 48 new satellites to SpaceX’s 2,000-strong constellation of internet-providing …", "url": "https://techcrunch.com/2022/03/09/spacex-launches-48-more-starlink-satellites-on-an-american-broomstick/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/03/51924933910_9627ae096e_o.jpg?w=600", "publishedAt": "2022-03-09T22:42:38Z", "content": "Its up, up and away for another SpaceX Starlink mission. At 5:45 this morning PST, a Falcon 9 rocket lifted off from Space Launch Complex 40 at Cape Canaveral in Florida, adding 48 new satellites to … [+1927 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New research sheds light on nature of friction in multi-layered graphene: New study provides insights into how surface structures influence nanoscale friction in this promising 2D material - Science Daily", "description": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely clear. Now, in a recent study, scientists analyze how surface s…", "url": "https://www.sciencedaily.com/releases/2022/03/220309104411.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-09T21:48:29Z", "content": "Multi-layered graphene is a promising carbon-based nanomaterial for a variety of next-generation technologies, but the relationships between its surface structures and properties are not entirely cle… [+3335 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Scientists plan to bring back extinct Christmas Island rat by gene-editing DNA - Daily Mail", "description": "It could be possible to bring back the extinct Christmas Island rat using the CRISPR gene editing technique, according to Dr Tom Gilbert at the University of Copenhagen.", "url": "https://www.dailymail.co.uk/sciencetech/article-10594185/Scientists-plan-bring-extinct-Christmas-Island-rat.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/09/16/55144063-0-image-a-20_1646843199986.jpg", "publishedAt": "2022-03-09T16:37:57Z", "content": "Scientists have revealed plans to bring back the extinct Christmas Island rat, 119 years after it was wiped out. \r\nIn a new paper, an international team of academics outline how the use of CRISPR a g… [+9348 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "Exploring the Limitations of “Resurrecting” Extinct Animals - Technology Networks", "description": "A team of paleogeneticists have focused on the potential limitations of de-extinction, using the Christmas Island rat as a model organism.", "url": "https://www.technologynetworks.com/genomics/news/exploring-the-limitations-of-resurrecting-extinct-animals-359412", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359412/exploring-the-limitations-of-resurrecting-extinct-animals-359412-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T16:03:21Z", "content": "De-extinction, a process whereby scientists resurrect an organism that is or resembles an extinct species, was once talk of science fiction. Now, advances in genomic technologies have made it a forth… [+7223 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Molly Campbell", "title": "Could Cancer Cells' Iron Addiction Be Their Achilles Heel? - Technology Networks", "description": "A new study has found that cells carrying oncogenic <i>KRAS</i> mutations harbor elevated levels of a specific kind of iron. This iron could be used to activate drugs that target cancer cells, avoiding harm to normal, healthy cells.", "url": "https://www.technologynetworks.com/cancer-research/news/could-cancer-cells-iron-addiction-be-their-achilles-heel-359413", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/359413/could-cancer-cells-iron-addiction-be-their-achilles-heel-359413-640x360.jpg?cb=20220309", "publishedAt": "2022-03-09T15:10:29Z", "content": "A new study from researchers at the University of California, San Francisco (UCSF) has found that cells carrying oncogenic KRAS mutations harbor elevated levels of a specific kind of iron. This iron … [+5499 chars]"}, {"source": {"id": null, "name": "Ommcomnews.com"}, "author": "OMMCOM NEWS", "title": "China's Yutu 2 Rover Sends Back Image After 3 Years On Moon's Far Side | Science & Tech - Ommcom News", "description": "Beijing:  China's Yutu 2 rover, traversing the harsh environment of the moon's far side, has returned a view of its path over the last three years.Yutu 2 touched down on the lunar far side in January 2019 atop the Chang'e 4 lander, making the pair th", "url": "https://ommcomnews.com/science-tech/chinas-yutu-2-rover-sends-back-image-after-3-years-on-moons-far-side", "urlToImage": "https://ommcom.s3.ap-south-1.amazonaws.com/wp-content/uploads/2022/03/09200938/112b32f60ead923c97d3111bf99f9abb.jpg", "publishedAt": "2022-03-09T14:39:59Z", "content": "Beijing:  China’s Yutu 2 rover, traversing the harsh environment of the moon’s far side, has returned a view of its path over the last three years.\r\nYutu 2 touched down on the lunar far side in Janua… [+1659 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Even Mild COVID Can Cause Brain Shrinkage and Disrupt Mental Function - SciTechDaily", "description": "Most of what we know about how COVID can affect the brain has come from studies of severe infection. In people with severe COVID, inflammatory cells from outside the brain can enter brain tissue and spread inflammation. There may be changes to blood vessels. …", "url": "https://scitechdaily.com/even-mild-covid-can-cause-brain-shrinkage-and-disrupt-mental-function/", "urlToImage": "https://scitechdaily.com/images/Brain-Glitch-Stress-Disorder-Concept.jpg", "publishedAt": "2022-03-09T13:14:51Z", "content": "Most of what we know about how COVID can affect the brain has come from studies of severe infection. In people with severe COVID, inflammatory cells from outside the brain can enter brain tissue and … [+6029 chars]"}, {"source": {"id": null, "name": "University of Birmingham"}, "author": "University of Birmingham", "title": "New antimicrobial air filters tested on trains rapidly kill SARS-CoV-2 and other viruses - University of Birmingham", "description": "Researchers have developed new antimicrobial technology for air filters which can in seconds kill bacteria, fungi and viruses including SARS-CoV-2.", "url": "https://www.birmingham.ac.uk/news/latest/2022/03/new-antimicrobial-air-filters-tested-on-trains-rapidly-kill-sars-cov-2-and-other-viruses.aspx", "urlToImage": "https://www.birmingham.ac.uk/images/news/antimicrobial-air-filters-800.jpg", "publishedAt": "2022-03-09T12:30:23Z", "content": "Researchers at the University of Birmingham working in partnership with firms NitroPep Ltd and Pullman AC have developed new antimicrobial technology for air filters which can in seconds kill bacteri… [+5942 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Legal bid to extend driver licences in South Africa - BusinessTech", "description": "Civil society group Afriforum has announced legal action to extend the grace period for expired driver’s licences beyond the March 2022 deadline.", "url": "https://businesstech.co.za/news/motoring/566472/legal-bid-to-extend-driver-licences-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/DrivingLicencePolicing-e1641977848294.jpg", "publishedAt": "2022-03-09T11:57:50Z", "content": "Civil society group Afriforum has announced legal action to extend the grace period for expired drivers licences beyond the March 2022 deadline.\r\nAfriforum has instructed its lawyers to prepare a leg… [+3624 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gigantic Bubbles at Center of Milky Way Caused by Powerful Jet of Energy From Supermassive Black Hole - SciTechDaily", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy. Since then, astronomers have debated their origin. Now, a study including University of Michigan research suggests the bubbles are…", "url": "https://scitechdaily.com/gigantic-bubbles-at-center-of-milky-way-caused-by-powerful-jet-of-energy-from-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Milky-Way-Gigantic-Bubbles.jpg", "publishedAt": "2022-03-09T10:42:06Z", "content": "The NASA visualization team created a superposition of an image of the Milky Way, taken by the European Space Agency’s Gaia space observatory, and a visualization of the simulations of the eRosita an… [+6681 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Good news for the commercial cannabis industry in South Africa; hundreds of thousands of drivers will be left without valid licence cards at the end of the month; health experts warn that future COvid waves still pose a threat, and say the vulnerable need to …", "url": "https://businesstech.co.za/news/business/566134/5-important-things-happening-in-south-africa-today-1236/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/shutterstock_1958572762-e1646805506258.jpg", "publishedAt": "2022-03-09T06:24:33Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 16 new Covid-19 deaths, taking the total reported to 99,625. The country has 17,490 active… [+3209 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "ZUNAIRA SAIEED", "title": "Bursa set for rebound, bargain hunting for tech and chip stocks - The Star Online", "description": "KUALA LUMPUR: The local stock market took yet another beating but analysts say stocks are due for a rebound after being sold down for the past few days.", "url": "https://www.thestar.com.my/business/business-news/2022/03/09/bursa-set-for-rebound-bargain-hunting-for-tech-and-chip-stocks", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/09/1507980.jpg", "publishedAt": "2022-03-08T23:01:51Z", "content": "KUALA LUMPUR: The local stock market took yet another beating but analysts say stocks are due for a rebound after being sold down for the past few days.\r\nRakuten Trade head of equity sales Vincent La… [+2015 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How government can stop a R2/litre petrol price hike in South Africa next month - BusinessTech", "description": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says Investec chief economist Annabel Bishop.", "url": "https://businesstech.co.za/news/finance/565806/how-government-can-stop-a-r2-litre-petrol-price-hike-in-south-africa-next-month/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/03/South-Africa-Rand-Money-Notes-Coins.jpg", "publishedAt": "2022-03-08T14:01:12Z", "content": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says I… [+2216 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Jennifer Ouellette", "title": "This extinct ten-armed fossil may be earliest known ancestor of vampire squid - Ars Technica", "description": "Syllipsimopodi bideni named to honor US President Joe Biden's commitment to science.", "url": "https://arstechnica.com/science/2022/03/this-extinct-ten-armed-fossil-may-be-earliest-known-ancestor-of-vampire-squid/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/03/squid1ROTATE-760x380.jpg", "publishedAt": "2022-03-08T13:43:49Z", "content": "Enlarge/ An artistic reconstruction of the newly described 328-million-year-old vampyropod, Syllipsimopodi bideni.\r\n31 with 23 posters participating\r\nPaleontologists believe they have discovered a ne… [+4819 chars]"}]}