{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Utkarsh Shetti, Abhijith Ganapavaram and David Shepardson", "title": "American Airlines resumes flights after brief grounding ahead of busy Christmas travel - Yahoo! Voices", "description": "(Reuters) -American Airlines said on Tuesday its flights had resumed after a technical glitch forced the carrier to issue an hour-long ground stop...", "url": "https://www.yahoo.com/news/american-airlines-says-experiencing-technical-121206559.html", "urlToImage": "https://media.zenfs.com/en/reuters-finance.com/53a67b4fb78d5772c6e7c72e40ed74e1", "publishedAt": "2024-12-24T19:34:48Z", "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.Generate Key Takeaways\r\nB… [+3429 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Sharmila Kuthunur", "title": "NASA's Parker Solar Probe completes historic Christmas Eve flyby of the sun — but it could take days to know if it survived - Livescience.com", "description": "On Christmas Eve, NASA's Parker Solar Probe flew closer to the sun than any human-made object ever — a stunning technological feat that scientists liken to the historic Apollo moon landing in 1969.", "url": "https://www.livescience.com/space/space-exploration/nasas-parker-solar-probe-completes-historic-christmas-eve-flyby-of-the-sun-but-it-could-take-days-to-know-if-it-survived", "urlToImage": "https://cdn.mos.cms.futurecdn.net/VeQNDVpciwckXefPUgNqzP-1200-80.jpg", "publishedAt": "2024-12-24T17:14:53Z", "content": "NASA's Parker Solar Probe\r\n is spending Christmas Eve on a history-making attempt to fly closer to the sun\r\n than we have ever been before — a stunning technological feat that scientists liken to the… [+4030 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Charles Rollet", "title": "Google is using Anthropic’s Claude to improve its Gemini AI - TechCrunch", "description": "Contractors working on Google Gemini are comparing its responses to Claude's, according to internal correspondence seen by TechCrunch.", "url": "https://techcrunch.com/2024/12/24/google-is-using-anthropics-claude-to-improve-its-gemini-ai/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/12/getty-gemini-laptop.jpg?resize=1200,800", "publishedAt": "2024-12-24T16:20:38Z", "content": "Contractors working to improve Google’s Gemini AI are comparing its answers against outputs produced by Anthropic’s competitor model Claude, according to internal correspondence seen by TechCrunch. \r… [+2941 chars]"}]}