{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes Auto", "title": "Google tops ranking of S'pore's best employers for second straight year; EDB at No. 2 - The Straits Times", "description": "Toy retailer The Lego Group, tech giant Apple and fintech firm Wise rounded out the top five.\n. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/business/companies-markets/google-tops-ranking-of-spores-best-employers-for-second-straight-year-edb-at-no-2", "urlToImage": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/04/17/yu_googlesg.jpg?VersionId=VormKRTTfIkS6q7wkRiVyX02h1w95w0W", "publishedAt": "2022-04-17T21:00:00Z", "content": "SINGAPORE - Even as competition for talent remains tight, tech giant Google has topped a ranking of Singapore's best employers for the second year in a row.\r\nThe Economic Development Board (EDB) came… [+2158 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA and SpaceX Delay Crew-4 Launch to International Space Station - SciTechDaily", "description": "The Flight Readiness Review for NASA’s SpaceX Crew-4 mission to the International Space Station has concluded, and teams are proceeding toward a 5:26 a.m. EDT liftoff on Saturday, April 23, from Kennedy Space Center’s Launch Complex 39A in Florida. The date a…", "url": "https://scitechdaily.com/nasa-and-spacex-delay-crew-4-launch-to-international-space-station/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Crew-Dragon-Spacecraft-Approaches-International-Space-Station-scaled.jpg", "publishedAt": "2022-04-17T20:46:33Z", "content": "NASAs SpaceX Crew-4 astronauts participate in a training session at SpaceX headquarters in Hawthorne, CA. From left to right: NASA astronaut and SpaceX Crew-4 mission specialist Jessica Watkins; NASA… [+3353 chars]"}, {"source": {"id": null, "name": "Techstory.in"}, "author": null, "title": "Free Garena Fire MAX Redeem Codes for April 17: Learn how to get free stuff now. - Techstory", "description": "The higher variant of Garena Free Fire that is Garena Free Fire MAX is acquiring fame in India after the boycott of Free Fire. It very well may be realized that Garena Free Fire has been restricted in the nation referring to security reasons and has even been…", "url": "https://techstory.in/free-garena-fire-max-redeem-codes-for-april-17-learn-how-to-get-free-stuff-now/", "urlToImage": "https://techstory.in/wp-content/uploads/2022/04/photo-1568915567812-757e15929f_0_1200x768.jpeg", "publishedAt": "2022-04-17T19:42:13Z", "content": "The higher variant of Garena Free Fire that is Garena Free Fire MAX is acquiring fame in India after the boycott of Free Fire. It very well may be realized that Garena Free Fire has been restricted i… [+1727 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "3 Billion Bases of Our DNA: First Complete, Gapless Sequence of a Human Genome - SciTechDaily", "description": "Scientists have published the first complete, gapless sequence of a human genome, two decades after the Human Genome Project produced the first draft human genome sequence. According to researchers, having a complete, gap-free sequence of the roughly 3 billio…", "url": "https://scitechdaily.com/3-billion-bases-of-our-dna-first-complete-gapless-sequence-of-a-human-genome/", "urlToImage": "https://scitechdaily.com/images/Complete-Human-Genome-Sequence.jpg", "publishedAt": "2022-04-17T19:23:47Z", "content": "Scientists have published the first complete, gapless sequence of a human genome, two decades after the Human Genome Project produced the first draft human genome sequence. Credit: Ernesto del Aguila… [+7972 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": "ESPN", "title": "Ajax director on Man United target Erik ten Hag: We are doing everything to keep him - ESPN", "description": "Ajax's technical manager Gerry Hamstra said they are doing everything they can to convince Man United managerial target Erik ten Hag to stay.", "url": "https://www.espn.com.sg/football/ajax/story/4644904/ajax-director-on-man-united-target-erik-ten-hag-we-are-doing-everything-to-keep-him", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0323%2Fr990229_1296x729_16%2D9.jpg", "publishedAt": "2022-04-17T16:23:21Z", "content": "Ajax's technical manager Gerry Hamstra has said they are doing everything they can to convince Manchester United managerial target Erik ten Hag to stay at the club\r\nTen Hag is close to finalising a d… [+1530 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Monday: Top 15 things to know before Opening Bell - Moneycontrol", "description": "Based on the open interest future percentage, a short build-up was seen in 57 stocks, including Bank Nifty, Persistent Systems, L&amp;T Technology Services, HDFC Bank, and IndiaMART InterMESH", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-opening-bell-179-8368321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/sensex_nifty_sensex_market-770x430.jpg", "publishedAt": "2022-04-17T15:01:04Z", "content": "The Indian benchmark indices ended lower on all the three sessions of the holiday curtailed week, with the Nifty slipping below 17,500 on April 13. Soaring inflation, elevated oil prices and correcti… [+9900 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Namibian Gemstone Holds Key to Future Quantum Computers - SciTechDaily", "description": "A special form of light made using an ancient Namibian gemstone could be the key to new light-based quantum computers, which could solve long-held scientific mysteries, according to new research led by the University of St Andrews. The research, conducted in …", "url": "https://scitechdaily.com/ancient-namibian-gemstone-holds-key-to-future-quantum-computers/", "urlToImage": "https://scitechdaily.com/images/Cuprous-Oxide.jpg", "publishedAt": "2022-04-16T16:16:03Z", "content": "Cuprous oxide the mined crystal from Namibia used for making Rydberg polaritons. Credit: University of St Andrews\r\nA special form of light made using an ancient Namibian gemstone could be the key to … [+2844 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breathtaking NASA Photo of Martian Crater Looks Like “Alien Footprint” - SciTechDaily", "description": "Although the photo above isn't new (it was captured by the High-Resolution Imaging Science Experiment (HiRISE), on the Mars Reconnaissance Orbiter on September 8, 2021), NASA just posted it to Instagram this week. The stunning image went viral, with some sayi…", "url": "https://scitechdaily.com/breathtaking-nasa-photo-of-martian-crater-looks-like-alien-footprint/", "urlToImage": "https://scitechdaily.com/images/Zero-Longitude-Crater-on-Mars-scaled.jpg", "publishedAt": "2022-04-16T11:35:26Z", "content": "The crater in the center of this HiRISE image defines where zero longitude is on Mars, like the Greenwich Observatory does for the Earth. Credit: NASA/JPL-Caltech/UArizona\r\nAlthough the photo above i… [+1570 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Twitter ramps up efforts to fight off Musk’s hostile takeover - BusinessTech", "description": "Twitter has brought on a second investment bank, JPMorgan Chase & Co. to help it respond to Elon Musk’s hostile bid, according to people familiar with the matter.", "url": "https://businesstech.co.za/news/technology/578038/twitter-ramps-up-efforts-to-fight-off-musks-hostile-takeover/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/07/ElonMusk-e1530509482159.jpg", "publishedAt": "2022-04-16T05:02:31Z", "content": "Twitter has brought on a second investment bank, JPMorgan Chase &amp; Co. to help it respond to Elon Musks hostile bid, according to people familiar with the matter.\r\nThe largest US bank started work… [+2560 chars]"}]}