{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "UCL researchers identified five types of heart failure - Tech Explorist", "description": "Significant differences found between the subtypes in patients’ risk of dying in the year after diagnosis.", "url": "https://www.techexplorist.com/five-types-heart-failure/60742/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/heart-stet.jpg", "publishedAt": "2023-05-29T08:00:08Z", "content": "Heart failure is a heterogeneous syndrome reflecting multiple underlying causes. Heart failure subtypes have been analyzed using machine learning, but not across vast, distinct population-based datas… [+3222 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Catherine Shu and Rita Liao", "title": "All the Nvidia news announced by Jensen Huang at Computex - TechCrunch", "description": "Jensen Huang wants to bring generative AI to every data center, the Nvidia co-founder and CEO said during Computex in Taipei today. During the speech, Huang’s first public speech in almost four years he said, he made a slew of announcements, including super c…", "url": "https://techcrunch.com/2023/05/28/nvidia-computex-jensen-huang/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/jhh-headshot_6eb8f518-0274-4077-b194-e8d59f00c5bb-prv.jpg?resize=1133,1200", "publishedAt": "2023-05-29T07:41:15Z", "content": "Jensen Huang wants to bring generative AI to every data center, the Nvidia co-founder and CEO said during Computex in Taipei today. During the speech, Huangs first public speech in almost four years … [+5664 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Explores Aftermath of Catastrophic Stellar Explosion in NGC 298 - SciTechDaily", "description": "The Hubble Space Telescope captured an image of the spiral galaxy NGC 298, previously the site of a Type II supernova, as part of a study on these star explosions. The investigation seeks to explain the diversity in Type II supernovae by observing the regions…", "url": "https://scitechdaily.com/hubble-explores-aftermath-of-catastrophic-stellar-explosion-in-ngc-298/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-NGC-298-scaled.jpg", "publishedAt": "2023-05-29T04:28:43Z", "content": "ByESA/HubbleMay 28, 2023\r\nThe Hubble Space Telescope, in a study to better understand the origins of Type II supernovae, captured this image of the spiral galaxy NGC 298, located roughly 89 million l… [+3357 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Krafton’s popular Battlegrounds Mobile India, successor to PUBG, returns - TechCrunch", "description": "Krafton's Battlegrounds Mobile India (BGMI), successor to PUBG, now available to download nearly a year after being ousted.", "url": "https://techcrunch.com/2023/05/28/bgmi-battlegrounds-mobile-india-pubg-download/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/05/GettyImages-1233476245.jpg?resize=1200,800", "publishedAt": "2023-05-29T04:02:55Z", "content": "Krafton’s Battlegrounds Mobile India, the once chart-topping mobile game in the South Asian market, is now available to download on Android nearly a year after being ousted due to national security c… [+1219 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Earth has a 2nd moon! Amazing 65-foot asteroid just found by Pan-STARRS telescope - HT Tech", "description": "Astronomers have discovered an asteroid that has been dubbed as the second moon of the Earth.", "url": "https://tech.hindustantimes.com/tech/news/earth-has-a-2nd-moon-amazing-65-foot-asteroid-just-found-by-pan-starrs-telescope-71685328606055.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/29/1600x900/Quasi_Satellite_1685328943910_1685328944104.jfif", "publishedAt": "2023-05-29T03:01:50Z", "content": "Astronomers have discovered a new asteroid that has been orbiting Earth, acting as a \"quasi-moon\" of our planet. Yes, it is being called the Earth's second moon. This asteroid, named 2023 FW13, has a… [+2106 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Akash Podishetti", "title": "Big movers on D-Street: What should investors do with RIL, Medplus and Page Industries? - Economic Times", "description": "Positive macroeconomic data and normal monsoon forecasts boosted equity markets at the end of last week, with IT, realty and FMCG all seeing gains. RIL saw a 3% rise, but Page Industries saw a drop of 8.78%. Senior Technical Analyst, Swastika Investmart, Prav…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/big-movers-on-d-street-what-should-investors-do-with-ril-medplus-and-page-industries/articleshow/100579287.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100579286,width-1070,height-580,imgsize-54240,overlay-etmarkets/photo.jpg", "publishedAt": "2023-05-29T02:40:00Z", "content": "Expectations of positive macroeconomic data and normal monsoon forecasts boosted overall sentiments as equity markets ended last week on a high.On Friday, IT index climbed 1.34%, realty jumped 1.31%,… [+3074 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Forges Ahead in Crucial Test Series: Moon Rocket Engine Hot Fire - SciTechDaily", "description": "NASA has successfully completed a full-length hot fire test of the RS-25 engine, marking a crucial step in the Artemis missions that aim to return humans to the Moon and ultimately Mars. NASA completed a full-duration hot fire of the RS-25 certification engin…", "url": "https://scitechdaily.com/nasa-forges-ahead-in-crucial-test-series-moon-rocket-engine-hot-fire/", "urlToImage": "https://scitechdaily.com/images/RS-25-Certification-Engine-Hot-Fire-Test-scaled.jpg", "publishedAt": "2023-05-28T17:16:32Z", "content": "ByNASA's Stennis Space CenterMay 28, 2023\r\nOn May 23, NASA completed a significant full duration hot fire of the RS-25 certification engine at the Stennis Space Center in Mississippi. This was the ei… [+4981 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Slowing Cognitive Aging: Major Study Finds Daily Multivitamin Improves Memory in Older Adults - SciTechDaily", "description": "Taking a daily multivitamin may help slow age-related memory decline, a study has found. Over 3,500 adults aged 60 and above participated in the study, taking either a daily multivitamin or a placebo for three years. The results showed that those on multivita…", "url": "https://scitechdaily.com/slowing-cognitive-aging-major-study-finds-daily-multivitamin-improves-memory-in-older-adults/", "urlToImage": "https://scitechdaily.com/images/Woman-Holding-Vitamin-Supplement-Pill.jpg", "publishedAt": "2023-05-28T11:05:55Z", "content": "ByColumbia University Irving Medical CenterMay 28, 2023\r\nA study involving over 3,500 older adults has found that daily multivitamin supplementation can slow down age-related memory decline. The effe… [+8831 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking the Cosmic Silence: First Detection of Radio Waves From Type Ia Supernova - SciTechDaily", "description": "An unusual Type Ia supernova has been discovered by Stockholm University astronomers. For the first time, it was detected in radio waves and showed strong helium emissions. The supernova was triggered by a white dwarf star that pulled helium-rich material fro…", "url": "https://scitechdaily.com/breaking-the-cosmic-silence-first-detection-of-radio-waves-from-type-ia-supernova/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-05-28T09:58:37Z", "content": "ByW. M. Keck ObservatoryMay 28, 2023\r\nArtists rendition of SN 2020eyj, a white dwarf star that went supernova after pulling material from a helium companion star. Credit: Adam Makarenko/W. M. Keck Ob… [+4680 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Emergence of solvated dielectrons observed for the first time - Tech Explorist", "description": "Team generates low-energy electrons using ultraviolet light.", "url": "https://www.techexplorist.com/emergence-solvated-dielectrons-observed-first-time/60703/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/solvated-electrons.jpg", "publishedAt": "2023-05-27T11:00:03Z", "content": "Scientists have several theories about solvated dielectrons, but they have never made a direct observation of one. They are a pair of dissolved electrons in liquids like water or liquid ammonia. The … [+2432 chars]"}]}