{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surreal! NASA shares DEAFENING screams of the Sun; Listen to the scary sound - HT Tech", "description": "The audio tech aboard the NASA Solar and Helioscopic Observatory (SOHO) has detected sound waves emerging from the Sun. It can drive anyone DEAF!", "url": "https://tech.hindustantimes.com/tech/news/surreal-nasa-shares-deafening-screams-of-the-sun-listen-to-the-scary-sound-71679742639421.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/faintyoung_1648896828205_1679742736270_1679742736270.jpg", "publishedAt": "2023-03-25T11:16:48Z", "content": "Last month, NASA made a remarkable discovery when it recorded the sound coming from RS Puppis, a Cepheid variable star which is located about 6,500 light-years away. But that's not all the sound we c… [+1818 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Magnesium Helps Reduce the Risk of Dementia – “Less Age-Related Brain Shrinkage” - SciTechDaily", "description": "More magnesium in our daily diet leads to better brain health as we age, according to scientists from the Neuroimaging and Brain Lab at The Australian National University (ANU). The researchers say increased intake of magnesium-rich foods such as spinach and …", "url": "https://scitechdaily.com/magnesium-helps-reduce-the-risk-of-dementia-less-age-related-brain-shrinkage/", "urlToImage": "https://scitechdaily.com/images/Food-With-Magnesium.jpg", "publishedAt": "2023-03-25T10:21:54Z", "content": "ByAustralian National UniversityMarch 25, 2023\r\nA study from the Australian National University suggests that increased magnesium intake in our daily diet can improve brain health as we age and reduc… [+4313 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "GPS-Based Toll System In 6 Months To Replace All Toll Plazas: Nitin Gadkari - NDTV", "description": "The government will introduce new technologies including GPS-based toll collection systems in the next 6 months to replace existing highway toll plazas in the country, Union minister Nitin Gadkari said.", "url": "https://www.ndtv.com/india-news/gps-based-toll-system-in-6-months-to-replace-all-toll-plazas-nitin-gadkari-3892054", "urlToImage": "https://c.ndtvimg.com/2022-10/1ldp6abg_fastag-generic_625x300_13_October_22.jpg", "publishedAt": "2023-03-25T07:49:35Z", "content": "GPS-based toll collection systems will replace existing toll plazas, Mr Gadkari said.\r\nNew Delhi: The government will introduce new technologies including GPS-based toll collection systems in the nex… [+1504 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid to come closer than the Moon! NASA raises alert about flyby today - HT Tech", "description": "A gigantic 160-foot asteroid named Asteroid 2023 DZ2 will come worryingly close to Earth today. It will actually get between Earth and Moon! NASA has informed about its speed, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-to-come-closer-than-the-moon-nasa-raises-alert-about-flyby-today-71679724923760.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/asteroid-4063790_960_720_1670757436603_1679725224870_1679725224870.jpg", "publishedAt": "2023-03-25T06:29:12Z", "content": "A scary 160-foot asteroid named Asteroid 2023 DZ2 is rushing towards Planet Earth to make an uncomfortable close approach at a mind numbing speed, warns NASA. NASA tech and calculations have revealed… [+1618 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung Galaxy F14 priced at Rs. 12990 on launch; Check chip, battery and more - HT Tech", "description": "Samsung Galaxy F14 priced at Rs. 12990 on launch Check chip battery and more All you need to know about the newly launchedSamsung Galaxy F14smartphone including price chip battery and more. Samsung Samsung Galaxy announced the launch of its other addition in …", "url": "https://tech.hindustantimes.com/web-stories/samsung-galaxy-f14-priced-at-rs-12990-on-launch-check-chip-battery-and-more-71679723331457.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/25/1600x900/galaxy-f14-5g-sm-e146blvgins-samsung-original-imag_1679725443014_1679725626828_1679725626828.webp/", "publishedAt": "2023-03-25T06:27:52Z", "content": "All you need to know about the newly launched  Samsung Galaxy F14 smartphone, including price, chip, battery and more. (Samsung)\r\n Samsung Galaxy announced the launch of its other addition in the F-s… [+1219 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Far-Flung Origin of Life's Building Blocks: Researchers Uncover “Completely Unexpected” Findings - SciTechDaily", "description": "Imperial College London researchers have discovered the probable distant origin of Earth's volatile chemicals, some of which form the building blocks of life, through the analysis of meteorites. The researchers found that approximately 50% of the Earth's supp…", "url": "https://scitechdaily.com/the-far-flung-origin-of-lifes-building-blocks-researchers-uncover-completely-unexpected-findings/", "urlToImage": "https://scitechdaily.com/images/Planet-Jupiter-Space-scaled.jpg", "publishedAt": "2023-03-25T00:44:00Z", "content": "ByImperial College LondonMarch 24, 2023\r\nMany of Earths volatiles came from beyond Jupiter. Credit: Imperial College London/NASA\r\nImperial College London researchers have discovered the probable dist… [+6413 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Anuradha Shukla and Deepshikha Sikarwar", "title": "No more royal treatment for Indian arms of MNCs as govt doubles tax on royalty, fee for technical services - Economic Times", "description": "Apart from hitting companies with parents in jurisdictions that do not have a tax avoidance treaty with India, the move also makes it possible for the government to impose the higher treaty rate of 15% on local arms of companies from the US, UK and other coun…", "url": "https://economictimes.indiatimes.com/news/economy/policy/no-more-royal-treatment-for-indian-arms-of-mncs-as-govt-doubles-tax-on-royalty-fee-for-technical-services/articleshow/98982426.cms", "urlToImage": "https://img.etimg.com/thumb/msid-98982460,width-1070,height-580,imgsize-782314,overlay-economictimes/photo.jpg", "publishedAt": "2023-03-25T00:37:00Z", "content": "New Delhi: The Indian arms of the US- and UK-based multinational companies such as Hindustan Unilever, PepsiCo India, and Coca-Cola India will now be subject to a higher rate of tax on royalty paymen… [+1896 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Chaos Unleashed: Surprising Breakthrough in Pursuit of Energy-Efficient Quantum Technologies - SciTechDaily", "description": "Magnetic topological insulators are an exotic class of materials that conduct electrons without any resistance at all and so are regarded as a promising breakthrough in materials science. Researchers from the Cluster of Excellence ct.qmat in Würzburg and Dres…", "url": "https://scitechdaily.com/quantum-chaos-unleashed-surprising-breakthrough-in-pursuit-of-energy-efficient-quantum-technologies/", "urlToImage": "https://scitechdaily.com/images/Ferromagnetic-Topological-Insulator-scaled.jpg", "publishedAt": "2023-03-24T09:31:15Z", "content": "ByUniversity of WürzburgMarch 24, 2023\r\nA team of researchers from the Cluster of Excellence ct.qmat based at the universities JMU Würzburg and TU Dresden has engineered the topological insulator man… [+7399 chars]"}]}