{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "SpaceX is stretching the lifetime of its reusable Falcon 9 boosters - Ars Technica", "description": "Each Falcon 9 booster could fly twice as many times as originally intended.", "url": "https://arstechnica.com/space/2023/07/spacex-launches-its-fleet-leading-rocket-booster-for-record-16th-time/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/f9starlink65-760x380.jpeg", "publishedAt": "2023-07-10T16:59:08Z", "content": "Enlarge/ A Falcon 9 rocket streaks into the sky over Cape Canaveral, Florida, on a mission Sunday night to deploy 22 more Starlink internet satellites.\r\n48 with \r\nThe late-night liftoff of a Falcon 9… [+5847 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Tata Communications to buy balance stake in Singapore's Oasis Smart Sim for Rs99.3 crore - Economic Times", "description": "Oasis develops and provides advanced technologies and personalised services to enable the deployment of eSIM and SIM technologies. It has delivered over 350 million operating systems worldwide, worked with more than 100 mobile network operators (MNOs) and has…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/tata-communications-to-buy-balance-stake-in-singapores-oasis-smart-sim-for-rs99-3-crore/articleshow/101644003.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101644007,width-1070,height-580,imgsize-23079,overlay-etmarkets/photo.jpg", "publishedAt": "2023-07-10T14:00:00Z", "content": "Tata Communications International Pte Ltd., a wholly owned unit of Tata Communications, has signed a share purchase agreement to buy the remaining nearly 42% stake of Oasis Smart Sim Europe SAS for R… [+2237 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hiding in Plain Sight: Researchers Reveal Impact of Ancient Earthquake - SciTechDaily", "description": "Leveraging the combined strengths of genetics and geology, a team of researchers from the University of Otago has revealed a previously unidentified zone of coastal uplift in Rarangi, Marlborough, that was hiding in plain sight. This unknown earthquake uplift…", "url": "https://scitechdaily.com/hiding-in-plain-sight-researchers-reveal-impact-of-ancient-earthquake/", "urlToImage": "https://scitechdaily.com/images/Earthquake-Coastline-Illustration.jpg", "publishedAt": "2023-07-10T10:33:58Z", "content": "ByUniversity of OtagoJuly 10, 2023\r\nResearchers from the University of Otago have uncovered a previously unidentified zone of coastal uplift in Rarangi, Marlborough, using LiDAR mapping and kelp gene… [+3649 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Universe Revelation: Webb Detects Most Distant Active Supermassive Black Hole - SciTechDaily", "description": "With Webb, a slew of other distant black holes and early galaxies also popped into view for the first time. It’s a bonanza! The universe is absolutely teeming with black holes. Researchers have long known this, but less massive black holes that existed in the…", "url": "https://scitechdaily.com/early-universe-revelation-webb-detects-most-distant-active-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Distant-Black-Hole-Concept.jpg", "publishedAt": "2023-07-10T08:25:27Z", "content": "BySpace Telescope Science InstituteJuly 10, 2023\r\nThe James Webb Space Telescopes CEERS Survey has uncovered the most distant active supermassive black hole ever found, existing just over 570 million… [+17367 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Instagram’s Threads app reaches 100 million users within just five days - TechCrunch", "description": "Instagram's text-based app and Twitter rival Threads has achieved the mark of 100 million sign-ups in just few days after the launch.", "url": "https://techcrunch.com/2023/07/10/instagrams-threads-app-reaches-100-million-users-in-just-five-days/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1519168800.jpg?w=1024", "publishedAt": "2023-07-10T07:13:04Z", "content": "Instagram’s text-based app Threads has achieved the mark of 100 million sign-ups in just five days. The Twitter rival was launched on June 6 (or June 5 in the Americas), according to a tracker.\r\nMark… [+1505 chars]"}, {"source": {"id": null, "name": "WTVD-TV"}, "author": null, "title": "Avi Loeb, Harvard professor, says he found alien technology fragments from meteor off Papua New Guinea; Space Command weighs in - WTVD-TV", "description": "The U.S. Space Command confirmed with almost near certainty, 99.999%, that the material came from another solar system.", "url": "https://abc11.com/alien-technology-avi-loeb-harvard-professor-spheres/13482644/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13482647_070923-wls-cc-cnnw-harvard-prof-alien-tech-post-img.JPG?w=1600", "publishedAt": "2023-07-09T19:47:44Z", "content": "CAMBRIDGE, Mass. -- Harvard professor Avi Loeb believes he may have found fragments of alien technology from a meteor that landed in the waters off of Papua New Guinea in 2014, WBZ reported.\r\nLoeb an… [+3725 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm warning: NASA turns to AI for help - HT Tech", "description": "NASA's AI-enabled predictions can offer advance notice for solar storms, providing crucial preparation time to protect power grids and vital infrastructure.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-warning-nasa-turns-to-ai-for-help-71688873212052.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/09/1600x900/Solar_Storm_1688873341996_1688873342136.jpg", "publishedAt": "2023-07-09T03:34:00Z", "content": "NASA's AI-enabled predictions can offer advance notice for solar storms, providing crucial preparation time to protect power grids and crucial infrastructure. The AI model can forecast the location o… [+2705 chars]"}]}