{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "SpaceX rocket launched toward International Space Station; carries 4 crew members for NASA - HT Tech", "description": "SpaceX rocket taking four NASA astronauts to the International Space Station in a 16-hour flight. Check details about the mission here.", "url": "https://tech.hindustantimes.com/tech/news/spacex-rocket-launched-toward-international-space-station-carries-4-crew-members-for-nasa-71709530495267.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/04/1600x900/Secret-Space-Plane-1_1703921576516_1709530567334.jpg", "publishedAt": "2024-03-04T05:39:29Z", "content": "SpaceX rocket was successfully launched from NASA's Kennedy Space Center at Cape Canaveral, along Florida's Atlantic coast today and it is heading to the International Space Station. The spacecraft c… [+2608 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo group asteroid to pass Earth by just 57000 km today, says NASA! Know how big it is - HT Tech", "description": "NASA, using its advanced space tech, has revealed that a Near-Earth asteroid will come as close as just 57000 kilometers to Earth! From size to speed, know all about the asteroid.", "url": "https://tech.hindustantimes.com/tech/news/apollo-group-asteroid-to-pass-earth-by-just-57000-km-today-says-nasa-know-how-big-it-is-71709526736133.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/04/1600x900/asteroid_3_1697976915005_1709527044888.jpg", "publishedAt": "2024-03-04T04:38:24Z", "content": "February 2024 was filled with numerous asteroid approaches and the beginning of March is set to continue this trend. Since asteroids are millions of kilometers away in space, how are they tracked? As… [+2071 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": null, "title": "Get Your Hands on MWC 2024's Coolest Tech Now - CNET", "description": "While the Mobile World Congress may be over, the excitement doesn't end, especially since there is stuff we saw there that you can buy or pre-order today.", "url": "https://www.cnet.com/deals/get-your-hands-on-mwc-2024s-coolest-tech-now/", "urlToImage": "https://www.cnet.com/a/img/resize/59b55a00ad228743843581195c8175ee54b018ef/hub/2024/02/29/99442586-1351-4db2-862a-341f71a09a97/artboard-4-27.png?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2024-03-03T18:33:35Z", "content": "If you're not familiar with the MWC, it's a huge event where telecom and teletech companies like Samsung and Motorolla can show off their latest tech. This year's MWC 2024 went from Feb. 26 to Feb. 2… [+24302 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sustainable Chemistry Achieved: Scientists Develop Organic Framework Material That Mimics Photosynthesis - SciTechDaily", "description": "Scientists at the National University of Singapore (NUS) have created a microporous covalent organic framework with dense donor–acceptor lattices and engineered linkages for the efficient and clean production of hydrogen peroxide (H2O2) through the photosynth…", "url": "https://scitechdaily.com/sustainable-chemistry-achieved-scientists-develop-organic-framework-material-that-mimics-photosynthesis/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Electricity-Art-Concept.jpg", "publishedAt": "2024-03-03T13:21:46Z", "content": "Scientists have developed a new photocatalytic method for producing hydrogen peroxide using water and air, employing a novel covalent organic framework. This method is energy-efficient and environmen… [+3704 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Decoding the Geometry of Music: 70-Year-Old Math Problem Solved - SciTechDaily", "description": "A professor and his collaborators have proven Pólya’s conjecture for the eigenvalues of a disk, a tricky problem in mathematics. Is it possible to deduce the shape of a drum from the sounds it makes? This is the kind of question that Iosif Polterovich, a prof…", "url": "https://scitechdaily.com/decoding-the-geometry-of-music-70-year-old-math-problem-solved/", "urlToImage": "https://scitechdaily.com/images/Drum-Math-Problem.jpg", "publishedAt": "2024-03-03T11:39:47Z", "content": "Researchers have made a significant advance in spectral geometry by proving a special case of Pólya’s conjecture related to the eigenvalues of a disk. Their work, blending theoretical elegance with p… [+2644 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cannabis and Heart Health: A Troubling Connection Uncovered - SciTechDaily", "description": "More frequent use of cannabis was associated with higher odds of adverse cardiovascular outcomes, finds a new study in the Journal of the American Heart Association. Research Highlights: An analysis of survey data for 430,000 adults in the U.S. found that usi…", "url": "https://scitechdaily.com/cannabis-and-heart-health-a-troubling-connection-uncovered/", "urlToImage": "https://scitechdaily.com/images/Cannabis-Doctor.jpg", "publishedAt": "2024-03-03T03:47:05Z", "content": "Cannabis use is associated with higher risks of heart attack and stroke, a study of 430,000 adults indicates, stressing the need for awareness of its cardiovascular effects. Credit: SciTechDaily.com\r… [+8375 chars]"}]}