{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Mick Chan", "title": "Proton X50 now available with ATLAS OS by ACO Tech - paultan.org - Paul Tan's Automotive News", "description": "The Proton X50 can now receive ATLAS (ACO Tech Local Automotive Services) through an over-the-air update, ACO Tech has announced. The update may take up to 14 days to be received by all applicable vehicles, …", "url": "https://paultan.org/2022/07/18/proton-x50-now-available-with-atlas-os-by-aco-tech/", "urlToImage": "https://paultan.org/image/2022/06/ACO_Atlas-27-1200x800.jpg", "publishedAt": "2022-07-18T09:45:08Z", "content": "The Proton X50 can now receive ATLAS (ACO Tech Local Automotive Services) through an over-the-air update, ACO Tech has announced. The update may take up to 14 days to be received by all applicable ve… [+1115 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iQOO Neo 6 in new avatar now available; will also feature on Amazon Prime Day Sale - HT Tech", "description": "iQOO Neo 6 will now be available in Maverick Orange color variant on Amazon starting July 23, 2022.", "url": "https://tech.hindustantimes.com/mobile/news/iqoo-neo-6-in-new-avatar-now-available-will-also-feature-on-amazon-prime-day-sale-71658135585259.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/18/1600x900/image001_1658135666379_1658135692731_1658135692731.jpg", "publishedAt": "2022-07-18T09:16:26Z", "content": "Offering one more colour option to choose from, iQOO today, announced the launch of an all-new avatar of iQOO Neo 6 in Maverick Orange color variant in India. The new color variant will be priced at … [+2266 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Research Shows a Lower Protein Diet Could Be the Key to Healthier Eating Habits - SciTechDaily", "description": "Introducing infants and toddlers to a lower-protein Nordic-style diet that places an emphasis on plant-based foods could allow them to obtain healthy eating habits New research recently presented at the 54th Annual Meeting of the European Society of Paediatri…", "url": "https://scitechdaily.com/research-shows-a-lower-protein-diet-could-be-the-key-to-healthier-eating-habits/", "urlToImage": "https://scitechdaily.com/images/Healthy-Food-Selection-scaled.jpg", "publishedAt": "2022-07-18T08:38:24Z", "content": "ByThe European Society for Paediatric Gastroenterology, Hepatology and Nutrition (ESPGHAN)July 18, 2022By the time they were 18 months old, infants who began receiving taster portions of the new Nord… [+4466 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Lens Flair: Hubble Captures a Gravitationally Lensed Galaxy - SciTechDaily", "description": "This intriguing observation from the Hubble Space Telescope reveals a gravitationally lensed galaxy with the long-winded identifier SGAS J143845+145407. Gravitational lensing has generated a mirror image of the galaxy at the center of this image, creating a c…", "url": "https://scitechdaily.com/cosmic-lens-flair-hubble-captures-a-gravitationally-lensed-galaxy/", "urlToImage": "https://scitechdaily.com/images/Gravitationally-Lensed-Galaxy-SGAS-J143845-145407.jpg", "publishedAt": "2022-07-18T07:41:52Z", "content": "ByESA/HubbleJuly 18, 2022\r\nHubble Space Telescope observation of a gravitationally lensed galaxy that is identified as SGAS J143845+145407. Credit: ESA/Hubble &amp; NASA, J. Rigby\r\nThis intriguing ob… [+1525 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Muzaffar Ismail", "title": "HUAWEI nova Y70 users can get various welcome app gift packs with HUAWEI AppGallery - TechNave", "description": "Along with the recent launch of the&nbsp;HUAWEI nova Y70&nbsp;for RM699, HUAWEI Malaysia have also announced that users can get various welcome app gift packs w", "url": "https://technave.com/gadget/HUAWEI-nova-Y70-users-can-get-various-welcome-app-gift-packs-with-HUAWEI-AppGallery-30676.html", "urlToImage": "https://technave.com/data/files/article/202207060336474677.jpg", "publishedAt": "2022-07-18T07:11:16Z", "content": "Along with the recent launch of the HUAWEI nova Y70 for RM699, HUAWEI Malaysia have also announced that users can get various welcome app gift packs with the nova Y70 via the HUAWEI AppGallery. Just … [+1937 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Massive solar flares headed towards Earth! Geomagnetic storm expected to cause chaos - HT Tech", "description": "A massive solar flare is expected to cause geomagnetic storms on Earth in the coming days. Will these have a big impact? Know here.", "url": "https://tech.hindustantimes.com/tech/news/massive-solar-flares-headed-towards-earth-geomagnetic-storm-expected-to-cause-chaos-71658126456604.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/18/1600x900/faintyoung_(1)_1641610017542_1658126533486_1658126533486.jpg", "publishedAt": "2022-07-18T06:43:31Z", "content": "A small part of the Sun has exploded and this massive energy in the form of solar flares are set to impact Earth soon! Solar flares occur due to explosions of electromagnetic energy taking place on t… [+1796 chars]"}, {"source": {"id": null, "name": "Pandaily.com"}, "author": "Pandaily", "title": "ByteDance Invests in Cryo-EM and AI Biotech Startup Shuimu BioSciences - Pandaily", "description": "Beijing-based tech giant and TikTok owner ByteDance has recently ventured into the life sciences sector. Last October, the firm invested in biotech startup Shuimu BioSciences.", "url": "https://pandaily.com/bytedance-invests-in-cryo-em-and-ai-biotech-startup-shuimu-biosciences/", "urlToImage": "https://assets.pandaily.com/uploads/2022/07/med.jpg", "publishedAt": "2022-07-18T06:37:00Z", "content": "Beijing-based tech giant and TikTok owner ByteDance has recently ventured into the life sciences sector. Last October, the firm invested in biotech startup Shuimu BioSciences, a company seeking to le… [+1931 chars]"}, {"source": {"id": null, "name": "Theinformant.co.nz"}, "author": "Daniel Jacobs", "title": "Twitch: This hot bath has become popular thanks to a rather unusual technology Twitch - theinformant.co.nz", "description": "When we talk about the category Twitch and the Pools, Hot Tubs and Beaches, we", "url": "https://theinformant.co.nz/twitch-this-hot-bath-has-become-popular-thanks-to-a-rather-unusual-technology/", "urlToImage": "https://theinformant.co.nz/wp-content/uploads/2022/07/Twitch-This-hot-bath-has-become-popular-thanks-to-a.jpg", "publishedAt": "2022-07-18T06:04:20Z", "content": "When we talk about the category Twitch and the Pools, Hot Tubs and Beaches, we often think of Amoranth, one of the most popular streamers in this category. But it is not the only one that offers this… [+2085 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Jayprashanth Mohanram", "title": "New Maruti S-Presso with Dualjet petrol engine launched at Rs. 4.25 lakh - CarToq.com", "description": "Maruti Suzuki has just launched the new S-Presso hatchback with a new DualJet petrol engine and idle-stop technology. With a starting price of Rs. 4.25 lakh, the new S-Presso features a 1.0 liter-3 cylinder naturally aspirated petrol engine with dual injector…", "url": "https://www.cartoq.com/new-maruti-s-presso-with-dualjet-petrol-engine-launched-at-rs-4-25-lakh/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2022/04/s-presso-alto-variants-discontinued-featured.jpg", "publishedAt": "2022-07-18T05:54:29Z", "content": "Maruti Suzuki has just launched the new S-Presso hatchback with a new DualJet petrol engine and idle-stop technology. With a starting price of Rs. 4.25 lakh, the new S-Presso features a 1.0 liter-3 c… [+3274 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "With 80W charger, 6.7 inch display and 4K ultra night video, Oppo Reno 8 Pro to launch today - HT Tech", "description": "Oppo is all set to launch Reno 8 series today. Here is all we know so far about the phone.", "url": "https://tech.hindustantimes.com/mobile/news/with-80w-charger-6-7-inch-display-and-4k-ultra-night-video-oppo-reno-8-pro-to-launch-today-71658122694101.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/18/1600x900/Untitled_design_(96)_1658122810337_1658122825567_1658122825567.png", "publishedAt": "2022-07-18T05:44:38Z", "content": "Oppo is all set to launch the Oppo Reno 8 Series, the latest edition to its Reno series today, July 18 at 6pm. Along with the smartphones, Oppo will also be launching Oppo Pad Air and Oppo Enco X2. I… [+2113 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Sasol outage means all South African oil refineries are now shut - BusinessTech", "description": "Sasol, South Africa’s largest fuel producer, declared force majeure on the supply of petroleum products due to delays in deliveries of crude to the Natref refinery it owns with TotalEnergies SE, leaving just a fraction of the country’s fuel-production capacit…", "url": "https://businesstech.co.za/news/energy/607490/sasol-outage-means-all-south-african-oil-refineries-are-now-shut/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/Sasol-e1631015118873.jpg", "publishedAt": "2022-07-18T05:23:52Z", "content": "Sasol South Africas largest fuel producer, declared force majeure on the supply of petroleum products due to delays in deliveries of crude to the Natref refinery it owns with TotalEnergies SE, leavin… [+1895 chars]"}, {"source": {"id": null, "name": "The Detroit News"}, "author": "Lynn Henning, The Detroit News", "title": "Detroit Tigers take Texas Tech's Jace Jung at No. 12 in MLB Draft - Detroit News", "description": "The Detroit Tigers selected Texas Tech infielder Jace Jung with the No. 12 pick in the MLB Draft on Sunday.", "url": "https://www.detroitnews.com/story/sports/mlb/tigers/2022/07/17/detroit-tigers-mlb-draft/10081818002/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/07/17/PDTN/7569cad4-b348-426b-ae83-9d0dd4aebd46-jacejung.jpg?auto=webp&crop=6243,3512,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-07-18T05:10:08Z", "content": "They were hoping for something seismic Sunday evening — for a temblor or two that might alter the Tigers’ options in the 2022 MLB Draft’s first round.\r\nThey got their shake-up.\r\nA couple of early and… [+7527 chars]"}, {"source": {"id": null, "name": "ChannelNews"}, "author": "Daniel Croft", "title": "Apple's iPhone Might Be Getting Lasers – channelnews - ChannelNews", "description": "Apple is considering fitting lasers to future iPhones and Apple Watches according a new patent. According to a report by Patently Apple, the Cupertino based tech company is looking to add Horizontal Cavity Surface-Emitting Lasers (HCSEL) under the display, wh…", "url": "https://www.channelnews.com.au/apple-patent-to-add-lasers-to-iphone/", "urlToImage": "https://www.channelnews.com.au/wp-content/uploads/2022/07/Apple_iPhone_14_Pro_and_14_Pro_Max_clownfish_alpine_green_unofficial_concept_image_drdNBC.jpg", "publishedAt": "2022-07-17T23:41:20Z", "content": "Apple is considering fitting lasers to future iPhones and Apple Watches according a new patent.\r\nAccording to a report by Patently Apple, the Cupertino based tech company is looking to add Horizontal… [+1557 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "Hamish Cardwell", "title": "Future of New Zealand energy set to look very different - RNZ", "description": "The electricity sector is undergoing huge change as companies touting different technology vie for the market share that will be left once we stop burning fossil fuels.", "url": "https://www.rnz.co.nz/news/business/471127/future-of-new-zealand-energy-set-to-look-very-different", "urlToImage": "https://rnz-ressh.cloudinary.com/image/upload/s--ojXSm8ML--/c_scale,f_auto,q_auto,w_1050/4NORXD3_copyright_image_164053", "publishedAt": "2022-07-17T19:52:37Z", "content": "The country's shift to renewable energy is unlikely to see the lights go out more often.\r\nPhoto: AFP\r\nBut the electricity sector is undergoing huge change as companies touting different technology vi… [+5903 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Lachlan Abbott", "title": "ASX trades higher behind energy stocks after Wall Street rally - Sydney Morning Herald", "description": "The Australian sharemarket has started the week on the front foot, climbing by 1.2 per cent thanks to resources and tech stocks.", "url": "https://www.smh.com.au/business/markets/asx-set-for-bright-start-after-wall-street-rally-20220718-p5b2az.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.24699999999999997%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_141%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/f24c1eda39c2430c9e7ce310bc9b846ad056a1f0", "publishedAt": "2022-07-17T19:15:17Z", "content": "The lowdown: The big news of the day was ANZs $4.9 billion Suncorp play, which would significantly expand the major banks retail banking and Queensland presence.\r\nJarden analysts said the move would … [+1662 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Engineers Find a Way To Save Energy and Make Water Boil More Efficiently - SciTechDaily", "description": "New surface treatments could save energy for systems used in many industries. At the heart of a wide range of industrial processes, including most electricity generating plants, many chemical production systems, and even cooling systems for electronics, is an…", "url": "https://scitechdaily.com/mit-engineers-find-a-way-to-save-energy-and-make-water-boil-more-efficiently/", "urlToImage": "https://scitechdaily.com/images/Faster-Boiling-High-Speed-Video.gif", "publishedAt": "2022-07-17T18:55:58Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 17, 2022\r\nMIT engineers design new surface treatments that make water boil more efficiently.\r\nNew surface treatments could save energy for sy… [+8550 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Technology and Home Visits Can Help South Africans With Diabetes Cope With Insulin - AllAfrica - Top Africa News", "description": "Analysis - Approximately 4.5 million South Africans have type 2 diabetes - a condition characterised by high levels of sugar in the blood. It can be treated with drugs and managed through healthy eating and exercise. But if it's not managed well, it can be li…", "url": "https://allafrica.com/stories/202207170214.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-07-17T17:57:50Z", "content": "Approximately 4.5 million South Africans have type 2 diabetes - a condition characterised by high levels of sugar in the blood. It can be treated with drugs and managed through healthy eating and exe… [+6810 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says a humongous building-sized asteroid heading for Earth today - HT Tech", "description": "A giant asteroid is on the way to Earth today, NASA confirmed. Does it pose any risk to our planet? Know here.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-a-humongous-building-sized-asteroid-heading-for-earth-today-71658034283133.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/17/1600x900/asteroid-3628185_1920_1631933514992_1658034371310_1658034371310.jpg", "publishedAt": "2022-07-17T05:06:49Z", "content": "A day after an aiplane-sized asteroid hurtled very close to our planet, there is a new terror on way. Yes, NASA says an asteroid today will get extremely close to Earth. In fact, quite a few asteroid… [+1903 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Canada has restarted its residency draws – what South Africans should know - BusinessTech", "description": "After a more than 18-month break due to the Covid-19 pandemic, Immigration, Refugees and Citizenship Canada (IRCC) has restarted its Express Entry draws, allowing candidates from outside of Canada to be invited to apply for permanent residency.", "url": "https://businesstech.co.za/news/lifestyle/605486/canada-has-restarted-its-residency-draws-what-south-africans-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/AirCanada-e1615993950104.jpg", "publishedAt": "2022-07-17T05:01:02Z", "content": "After a more than 18-month break due to the Covid-19 pandemic, Immigration, Refugees and Citizenship Canada (IRCC) has restarted its ‘Express Entry’ draws, allowing candidates from outside of Canada … [+1961 chars]"}, {"source": {"id": null, "name": "Cryptotvplus.com"}, "author": "Ifeoma Joy Okorie", "title": "RunNation: A Move-to-earn Metaverse App; Run, Battle, and Earn - CryptoTvplus", "description": "Did you ever imagine mere exercise could yield rewards? The application of Blockchain technology is innovating the approach to traditional lifestyle. The sports industry is becoming more profitable with the concept of an earning mechanism that rewards individ…", "url": "https://cryptotvplus.com/2022/07/runnation-a-move-to-earn-metaverse-app-run-battle-and-earn/", "urlToImage": "https://cryptotvplus.com/wp-content/uploads/2022/07/wp-1657985614496-1000x600.jpg", "publishedAt": "2022-07-16T18:41:54Z", "content": "Did you ever imagine mere exercise could yield rewards? \r\nThe application of Blockchain technology is innovating the approach to traditional lifestyle. The sports industry is becoming more profitable… [+4129 chars]"}]}