{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple’s M3-powered 15-inch MacBook Air under development; know what to expect - HT Tech", "description": "The new 15-inch MacBook Air could get yet another upgrade as Apple is reportedly planning to launch an M3 version next year.", "url": "https://tech.hindustantimes.com/laptops-pc/news/apples-m3-powered-15-inch-macbook-air-under-development-know-what-to-expect-71689580293928.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/17/1600x900/walling-nMqqEFhInkY-unsplash_1689580459862_1689580469597.jpg", "publishedAt": "2023-07-17T07:56:09Z", "content": "Apple's WWDC 2023 was a Mac-fest with as many as 3 Macs being announced. The Cupertino-based tech giant launched a highly demanded 15-inch M2 MacBook Air along with M2 Ultra-powered Mac Pro and Mac S… [+1715 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Passive gravitational mass and active gravitational mass are always equivalent- study - Tech Explorist", "description": "Despite doubts from quantum physicists: Einstein's theory of relativity reaffirmed.", "url": "https://www.techexplorist.com/passive-gravitational-mass-and-active-gravitational-mass-are-always-equivalent-study/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/bunch-drops-liquid.jpg", "publishedAt": "2023-07-17T07:26:50Z", "content": "One of the essential tenets of fundamental physics is that the various characteristics of massweight, inertia, and gravitationalways remain constant in proportion to one another. Without this equival… [+2724 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Himani Jha, Manas Mitul", "title": "Realme Pad 2 Launch Date, Specifications Teased on Flipkart; 11.5-Inch LCD Display Confirmed: Report | Technology News - Gadgets 360", "description": "Realme Pad 2 could make its debut soon in India. The successor to 2021’s Realme Pad will likely debut alongside Realme C53 smartphone. The tablet’s launch page has reportedly been spotted on Flipkart, revealing the display specifications and colour options. T…", "url": "https://www.gadgets360.com/tablets/news/realme-pad-2-launch-in-india-july-19-design-specifications-teased-flipkart-report-4214096", "urlToImage": "https://i.gadgets360cdn.com/large/Realme_Pad_2_main_1689576184018.jpg", "publishedAt": "2023-07-17T06:45:26Z", "content": "Realme Pad 2 could make its debut soon in India. The successor to 2021's Realme Pad will likely launch alongside Realme C53 smartphone. The tablet's launch page has reportedly been spotted on Flipkar… [+2286 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "On the Trail of a Mysterious Force in Space – Scientists Shed New Light on Dark Energy - SciTechDaily", "description": "An initial study of dark energy using eROSITA suggests that it is evenly dispersed across both space and time. Edwin Hubble's observation of distant galaxies in the 1920s led to the groundbreaking conclusion that our universe is in a state of expansion. It wa…", "url": "https://scitechdaily.com/on-the-trail-of-a-mysterious-force-in-space-scientists-shed-new-light-on-dark-energy/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Dark-Energy-Concept-Illustration.jpg", "publishedAt": "2023-07-17T06:21:45Z", "content": "Using advanced space telescopes and data sets, researchers concluded that dark energy, representing about 76% of the universes energy density, is evenly spread throughout space and remains constant o… [+4510 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Detects Universe's Oldest Active Supermassive Black Hole - SciTechDaily", "description": "The James Webb Space Telescope has uncovered the most remote active supermassive black hole known to date, situated in the galaxy CEERS 1019, which existed about 570 million years after the Big Bang. Researchers, using the James Webb Space Telescope (JWST), h…", "url": "https://scitechdaily.com/webb-space-telescope-detects-universes-oldest-active-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Distant-Black-Hole-Concept-Art.jpg", "publishedAt": "2023-07-17T02:20:42Z", "content": "ByUniversity of Texas at AustinJuly 16, 2023\r\nThe James Webb Space Telescope has discovered the furthest active supermassive black hole yet, situated in the CEERS 1019 galaxy, which is less massive t… [+12574 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Potential organic molecules, clues to previous life on Mars - study - The Jerusalem Post", "description": "The research employed an innovative technique utilizing the SHERLOC instrument to detect signs of past life, paving the way for future extraterrestrial exploration.", "url": "https://www.jpost.com/science/article-750314", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/513284", "publishedAt": "2023-07-17T00:38:00Z", "content": "A recent study utilizing data collected by NASA's Mars Perseverance rover has revealed promising indications of organic molecules on Mars, suggesting a complex organic geochemical cycle and raising t… [+3697 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Celebrates First Year, NASA Humanoid Robot, Low Altitude Flights - SciTechDaily", "description": "Celebrating the Webb Space Telescope’s first year of science … Testing remote possibilities of a NASA humanoid robot … And a fleet of clean new rides for Artemis astronauts … A few of the stories to tell you about – This Week at NASA! https://youtu.be/isLhOu_…", "url": "https://scitechdaily.com/this-week-nasa-webb-celebrates-first-year-nasa-humanoid-robot-low-altitude-flights/", "urlToImage": "https://scitechdaily.com/images/Webb-Interstellar-Clouds-Art-Concept.jpg", "publishedAt": "2023-07-16T03:27:58Z", "content": "ByNASAJuly 15, 2023\r\nNASAs James Webb Space Telescope marks its first year of operations, delivering a detailed image of the nearest star-forming region to Earth, the Rho Ophiuchi cloud complex. This… [+4114 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Alert! NASA telescopes find colossal 910-foot asteroid heading towards Earth today - HT Tech", "description": "NASA has warned about a gigantic asteroid heading towards Earth today! Is it potentially hazardous for Earth? Know what NASA revealed.", "url": "https://tech.hindustantimes.com/tech/news/alert-nasa-telescopes-find-colossal-910-foot-asteroid-heading-towards-earth-today-71689477165187.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/16/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1683132681194_1689477299600.jpg", "publishedAt": "2023-07-16T03:15:25Z", "content": "A majority of asteroids can be found in the region of space situated between the orbits of Jupiter and Mars. These celestial bodies follow elliptical paths around the Sun, exhibiting irregular moveme… [+2085 chars]"}, {"source": {"id": null, "name": "Yanko Design"}, "author": "Srishti Mitra", "title": "Self-Cleansing Antimicrobial Vase Uses Centuries-Old Technique Involving Copper To Make Your Flowers Last Long - Yanko Design", "description": "A bunch of fresh flowers can add a whole aura of rejuvenating and positive energy to a living space. I love adorning my home with delicate bouquets of flowers,", "url": "https://www.yankodesign.com/2023/07/15/self-cleansing-antimicrobial-vase-uses-centuries-old-technique-involving-copper-to-make-your-flowers-last-longer/", "urlToImage": "https://www.yankodesign.com/images/design_news/2023/07/the-potr-letterbox-vase/letterbox_vase_yanko_design_01.jpg", "publishedAt": "2023-07-15T20:45:52Z", "content": "A bunch of fresh flowers can add a whole aura of rejuvenating and positive energy to a living space. I love adorning my home with delicate bouquets of flowers, but something I often struggle with is … [+2919 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Naima Syed", "title": "Kidney Cells Rejuvenation: A Novel Breakthrough - Asiana Times", "description": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnology. A previously unknown phenomenon of housekeeping, in which…", "url": "https://asianatimes.com/kidney-cells-rejuvenation-a-novel-breakthrough/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/07/USC-News-University-of-Southern-California.jpg", "publishedAt": "2023-07-15T08:37:27Z", "content": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnolog… [+3725 chars]"}]}