{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Bioengineers Develop Algorithm to Compare Cells Across Species – With Striking Results - SciTechDaily", "description": "Researchers created an algorithm to identify similar cell types from species – including fish, mice, flatworms and sponges – that have diverged for hundreds of millions of years, which could help fill in gaps in our understanding of evolution. Cells are the b…", "url": "https://scitechdaily.com/bioengineers-develop-algorithm-to-compare-cells-across-species-with-striking-results/", "urlToImage": "https://scitechdaily.com/images/Cell-Division-Illustration.jpg", "publishedAt": "2021-05-26T15:26:36Z", "content": "Researchers created an algorithm to identify similar cell types from species – including fish, mice, flatworms and sponges – that have diverged for hundreds of millions of years, which could help fil… [+5985 chars]"}, {"source": {"id": null, "name": "Techfinancials.co.za"}, "author": null, "title": "Spotify Premium Launches New Offers For Its Free and First-Time Users - TechFinancials", "description": "As South Africans ease into Winter, more people will seek comfort of indoor entertainment. To carry fans through the chilly season, Spotify", "url": "https://www.techfinancials.co.za/2021/05/26/spotify-premium-launches-new-offers-for-its-free-and-first-time-users/", "urlToImage": "https://n9v2j5d8.rocketcdn.me/wp-content/uploads/2019/07/shutterstock_679388728.jpg", "publishedAt": "2021-05-26T14:49:45Z", "content": "As South Africans ease into Winter, more and more people will seek the comfort of indoor entertainment. To carry fans through the chilly season, Spotify is launching new offers for its free and first… [+1737 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Instagram launches a new section for shopping product drops - TechCrunch", "description": "Instagram today announced it’s adding a new feature to help connect online shoppers to product drops through its app. Drops, which are a newer e-commerce trend, help sellers create buzz for forthcoming products in the days and weeks leading up to their availa…", "url": "http://techcrunch.com/2021/05/26/instagram-launches-a-new-section-for-shopping-product-drops/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/instagram-app-icon.jpg?w=711", "publishedAt": "2021-05-26T14:37:41Z", "content": "Instagram today announced it’s adding a new feature to help connect online shoppers to product drops through its app. Drops, which are a newer e-commerce trend, help sellers create buzz for forthcomi… [+3285 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "Is SpaceX reliable? Company goes for 100th successful flight in a row today - Ars Technica", "description": "The company has rarely used such a \"young\" rocket for a Starlink mission.", "url": "https://arstechnica.com/science/2021/05/is-spacex-reliable-company-goes-for-100th-successful-flight-in-a-row-today/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/05/unnamed-14-760x380.jpg", "publishedAt": "2021-05-26T14:31:59Z", "content": "Enlarge/ Photo of the Starlink payload on top of a Falcon 9 rocket in Florida this week.\r\n124 with 70 posters participating\r\nSpaceX will attempt to launch another batch of 60 Starlink satellites toda… [+2605 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "CITF says 956609 AstraZeneca vaccine slots snapped up in an hour, apologises for technical issues - The Star Online", "description": "PETALING JAYA: The second phase opt-in for the AstraZeneca Covid-19 vaccine was snapped up in an hour with a total of 956,609 slots taken up by Malaysians aged 18 and above, says the Covid-19 Immunisation Task Force (CITF).", "url": "https://www.thestar.com.my/news/nation/2021/05/26/citf-says-956609-astrazeneca-vaccine-slots-snapped-up-in-an-hour-apologises-for-technical-issues", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/26/1162000.jpg", "publishedAt": "2021-05-26T13:58:00Z", "content": "PETALING JAYA: The second phase opt-in for the AstraZeneca Covid-19 vaccine was snapped up in an hour with a total of 956,609 slots taken up by Malaysians aged 18 and above, says the Covid-19 Immunis… [+1107 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Agency Staff", "title": "Facebook, Instagram to let users hide likes on posts - TechCentral", "description": "Instagram is launching the option for users globally to hide like counts on posts and the change will soon roll out on Facebook.", "url": "https://techcentral.co.za/facebook-instagram-to-let-users-hide-likes-on-posts/107545/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2018/07/facebook-2156-1120.jpg", "publishedAt": "2021-05-26T13:17:34Z", "content": "Facebook’s photo-sharing app Instagram is launching the option for users globally to hide like counts on posts and the change will soon roll out on Facebook, after years of tests focused on lessening… [+1833 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amazon Agrees To Buy Hollywood Studio MGM For $8.45 Billion - NDTV", "description": "Amazon has agreed to buy the storied MGM studios for $8.45 billion, the companies said Wednesday, giving the US tech giant a vast library to further its ambitions in streaming.", "url": "https://www.ndtv.com/world-news/amazon-agrees-to-buy-hollywood-studio-mgm-for-8-45-billion-2449782", "urlToImage": "https://c.ndtvimg.com/2021-04/ge98cqb_amazon-generic-_625x300_06_April_21.jpg", "publishedAt": "2021-05-26T13:11:19Z", "content": "Amazon Prime Video competes with Netflix and others in the fast-evolving market (Representational)\r\nWashington: Amazon has agreed to buy the storied MGM studios for $8.45 billion, the companies said … [+2808 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Facebook and Instagram will now allow users to hide ‘Like’ counts on posts - TechCrunch", "description": "Facebook this week will begin to publicly roll out the option to hide Likes on posts across both Facebook and Instagram, following earlier tests beginning in 2019. The project, which puts the decision about Likes in the hands of the company’s global user base…", "url": "http://techcrunch.com/2021/05/26/facebook-and-instagram-will-now-allow-users-to-hide-like-counts-on-posts/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/11/Hidden-Instagram-Likes-1.jpg?w=753", "publishedAt": "2021-05-26T13:01:22Z", "content": "Facebook this week will begin to publicly roll out the option to hide Likes on posts across both Facebook and Instagram, following earlier tests beginning in 2019. The project, which puts the decisio… [+7032 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Elizabeth Culliford,Sheila Dang", "title": "In U.S. creator economy boom, big tech battles for online talent - Reuters", "description": "Katie Feeney, an 18-year-old from Olney, Maryland, was in her calculus class on Zoom in November when she learned that a week of posting skits and unboxing videos on Snapchat (SNAP.N) earned her $229,000. Her $1.4 million in total earnings over the past seven…", "url": "https://www.reuters.com/technology/us-creator-economy-boom-big-tech-battles-online-talent-2021-05-26/", "urlToImage": "https://www.reuters.com/resizer/vzXMbwKHapBMn1JQRlrLPd-Ouxc=/1200x628/smart/cloudfront-us-east-2.images.arcpublishing.com/reuters/BH7VFIZ6WBPDLMKDTVUQQCXRJ4.jpg", "publishedAt": "2021-05-26T11:23:00Z", "content": "Katie Feeney, an 18-year-old from Olney, Maryland, was in her calculus class on Zoom in November when she learned that a week of posting skits and unboxing videos on Snapchat (SNAP.N) earned her $229… [+5446 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "Taiwan says China blocked deal with BioNTech for COVID-19 shots - INQUIRER.net", "description": "TAIPEI — Taiwan directly accused China for the first time on Wednesday of blocking a deal with Germany&#039;s BioNTech SE for COVID-19 vaccines, in an escalating war of words after Beijing", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/05/6ZWYCAUPU5JAXDUGRIZSZ433LA-620x413.jpg", "publishedAt": "2021-05-26T11:19:00Z", "content": "Medical workers use a rapid test for coronavirus disease (COVID-19) on a Taiwanese resident following an increasing number of locally transmitted cases in Taipei, Taiwan, May 25, 2021. REUTERS/Ann Wa… [+3356 chars]"}, {"source": {"id": null, "name": "The News Minute"}, "author": null, "title": "FAQ: If I can still get COVID-19 after vaccination, why should I take the shot? - The News Minute", "description": "India presently has three vaccines against COVID-19 approved for use – Bharat Biotech’s Covaxin, Oxford-AstraZeneca’s Covishield (manufactured in India by Serum Institute of India), and the Russian vaccine Sputnik V (distributed in India by Dr Reddy’s Labs). …", "url": "https://www.thenewsminute.com/article/faq-if-i-can-still-get-covid-19-after-vaccination-why-should-i-take-shot-149565", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Vaccine_Second_dose_1200_PTI_240521.jpg", "publishedAt": "2021-05-26T10:38:26Z", "content": "While the vaccines do not give 100% protection against contacting COVID-19 altogether, it does increase the likelihood of the disease being milder if you do get it.India presently has three vaccines … [+2571 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mayank Sharma", "title": "Microsoft Project Reunion update hopes to make developing Windows 10 apps a breeze - TechRadar", "description": "Project Reunion aims to standardize Windows app development", "url": "https://www.techradar.com/news/microsoft-project-reunion-update-hopes-to-make-developing-windows-10-apps-a-breeze", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vZLMcEg5JqfGeXydVkkxhk-1200-80.jpg", "publishedAt": "2021-05-26T10:36:50Z", "content": "Microsofts Project Reunion\r\n initiative to simplify the life of Windows 10\r\n app developers has taken another step towards its first stable release.\r\nFirst announced at the Build 2020 conference by M… [+1354 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sanjiv Sathiah", "title": "12.9-inch iPad Pro mini-LED display is as custom as its M1 SoC, but early issues have emerged - Notebookcheck.net", "description": "Apple has detailed the technology behind the new mini-LED display found on the new iPad Pro 12.9-inch model. Like Apple’s custom A-series chips, the new panel is a custom Apple design and features proprietary algorithms to help it function. However, some user…", "url": "https://www.notebookcheck.net/12-9-inch-iPad-Pro-mini-LED-display-is-as-custom-as-its-M1-SoC-but-early-issues-have-emerged.540770.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/lr_top_4.jpg", "publishedAt": "2021-05-26T09:44:07Z", "content": "Apple likes to develop its own technologies where it can in order to differentiate itself from the competition. Its custom A-series chips really stand out in this regard as being well ahead of the co… [+2027 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "The makers of the first foldable phone just revealed something much weirder - TechRadar", "description": "Stretching screens", "url": "https://www.techradar.com/news/the-makers-of-the-first-foldable-phone-just-revealed-something-much-weirder", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3F8idv5biVPc9YiWxHQtTL-1200-80.jpg", "publishedAt": "2021-05-26T08:57:58Z", "content": "If you think foldable phones are pretty strange, funky or weird devices, you're not going to like what's coming next. Royole, which made the first ever folding smartphone, has just unveiled something… [+2403 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Indications are that South Africa’s third wave has started, nationally; push back against planned gun law changes in South Africa; ANC considering further action against Magashule; and delinquent director Dudu Myeni faces criminal complaint over state capture…", "url": "https://businesstech.co.za/news/government/493467/5-important-things-happening-in-south-africa-today-1046/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/09/Dudu-Myeni.png", "publishedAt": "2021-05-26T06:24:04Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: Global Covid-19 infections have hit 168.53 million confirmed, with the death toll reaching 3.5 million. In South Africa, th… [+3470 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Elon Musk’s new ambition could be riskiest ever human quest - Mint", "description": "Musk, founder of Space Exploration Technologies Corp. wants to send humans to space this decade. In an interview, he said that he was confident a crewed mission could take place in 2026..Many scientists, however, warn of too many unanswered questions confront…", "url": "https://www.livemint.com/news/world/elon-musk-s-new-ambition-could-be-riskiest-ever-human-quest-11622008817799.html", "urlToImage": "https://images.livemint.com/img/2021/05/26/600x338/2021-05-17T151002Z_1977457427_RC2RHN9BKRI8_RTRMADP_3_TESLA-BITCOIN-MUSK_1622009155917_1622009174148.JPG", "publishedAt": "2021-05-26T06:08:02Z", "content": "More than half a century after Neil Armstrong took mankinds giant leap on the moon, another space race is heating up. This time, the promising new frontier for Earthlings is Mars, the planet next doo… [+7002 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "AFP", "title": "Huawei pushes into software with new smartphone OS - Tech Wire Asia", "description": "by Dan Martin   Chinese tech giant Huawei on Tuesday said it would launch its long-awaited new operating system for smartphones HarmonyOS next week,", "url": "https://techwireasia.com/2021/05/huawei-to-unveil-new-harmonyos-push-into-software/", "urlToImage": "https://cdn.techwireasia.com/wp-content/uploads/2021/05/000_1JF4F7.jpg", "publishedAt": "2021-05-26T00:50:10Z", "content": "by Dan Martin\r\nChinese tech giant Huawei on Tuesday said it would launch its long-awaited new operating system for smartphones HarmonyOS next week, part of an all-out push into the software industry … [+4063 chars]"}, {"source": {"id": null, "name": "中国日报"}, "author": "金丹", "title": "Huawei's new mobile OS coming on June 2 - Chinadaily.com.cn - Chinadaily USA", "description": "Chinese technology giant Huawei Technologies Co said on Tuesday that it will launch its self-developed HarmonyOS operating system for smartphones on June 2 as part of its ongoing efforts to cultivate its software prowess after overseas restrictions affected i…", "url": "http://global.chinadaily.com.cn/a/202105/26/WS60ad8f74a31024ad0bac166a.html", "urlToImage": "//img2.chinadaily.com.cn/images/202105/26/60ad9f31a31024adbdca259e.jpeg", "publishedAt": "2021-05-26T00:28:07Z", "content": "A visitor tries Huawei's HarmonyOS operating system on a car dashboard during an auto expo in Shanghai. [Photo by Zhang Hengwei/China News Service] \r\nChinese technology giant Huawei Technologies Co s… [+2587 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "itel P Series Keeps Getting Better: Launches P37, P37 Pro - Channels Television", "description": "As one of itel’s most successful brands, the P series has evolved over the years with new updates and improvements, earning the title, the Max Power series. With the launch of the itel P37 smartphone on May 21, 2021 via a virtual event, the global tech compan…", "url": "https://www.channelstv.com/2021/05/25/itel-p-series-keeps-getting-better-launches-p37-p37-pro/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/05/Untitled-1-Recovered-Recovered-Recovered-Recovered-2.png", "publishedAt": "2021-05-25T19:09:58Z", "content": "As one of itel’s most successful brands, the P series has evolved over the years with new updates and improvements, earning the title, the Max Power series.\r\nWith the launch of the itel P37 smartphon… [+2864 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "Samsung A12 Vs Infinix HOT 10T: Which Is A Better Buy? - TechCabal", "description": "Infinix and Samsung are two major players in the African smartphone market. Both brands have managed to maintain their edge over other competitive brands through the consistent production of exceptional smartphones that meet the varying needs of gadget lovers…", "url": "https://techcabal.com/2021/05/25/samsung-a12-vs-infinix-hot-10t-which-is-a-better-buy/", "urlToImage": "https://cdn.shortpixel.ai/client/to_avif,q_glossy,ret_img,w_1208,h_774/https://techuncode.com/wp-content/uploads/2021/05/FotoJet-1.jpg", "publishedAt": "2021-05-25T09:01:45Z", "content": "Infinix and Samsung are two major players in the African smartphone market. Both brands have managed to maintain their edge over other competitive brands through the consistent production of exceptio… [+5635 chars]"}]}