{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fusion, Recoil, Discovery: A New Type of Atomic Nucleus Discovered - SciTechDaily", "description": "In a remarkable scientific breakthrough researchers have discovered the lightest isotope of the rare and rapidly decaying element, astatine. The discovery of 190-Astatine was made by Master of Science graduate Henna Kokkonen as part of her thesis work, provid…", "url": "https://scitechdaily.com/fusion-recoil-discovery-a-new-type-of-atomic-nucleus-discovered/", "urlToImage": "https://scitechdaily.com/images/Atomic-Nucleus-Art-Concept.jpg", "publishedAt": "2023-06-25T01:30:26Z", "content": "Researchers at the Accelerator Laboratory of the University of Jyväskylä, Finland, have made a groundbreaking discovery of a new atomic nucleus, 190-Astatine, which is now the lightest known isotope … [+3083 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for June 25, 2023: Win exciting rewards! - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for June 25: If you are looking for freebies such as costumes, weapons, and accessories, then these redeem codes will help you.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-june-25-2023-win-exciting-rewards-71687653041539.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/25/1600x900/056_1651885411062_1687653354541.jpg", "publishedAt": "2023-06-25T00:48:36Z", "content": "Garena Free Fire MAX redeem codes for June 25, 2023: Garena has announced its weekly agenda for the Free Fire fans! From the lucky wheel, faded wheel, and summer spin to jumbo top-up, a lot of stuff … [+2265 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New White Dwarf Pulsar Discovery: “Stellar Fossils” Unveil Cosmic Secrets - SciTechDaily", "description": "A research group from the University of Warwick has discovered a rare white dwarf pulsar for only the second time, providing significant insights into stellar evolution. The pulsar's strong magnetic fields, rapid spinning, and cool temperature support the dyn…", "url": "https://scitechdaily.com/?p=287434", "urlToImage": "https://scitechdaily.com/images/Exotic-Binary-Star-System-AR-Scorpii.jpg", "publishedAt": "2023-06-24T20:44:49Z", "content": "ByUniversity of WarwickJune 24, 2023\r\nA research team has made the second-ever discovery of a rare type of white dwarf pulsar system, a significant advancement in understanding stellar evolution. The… [+7407 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Vikas Yadav", "title": "Good News For PlayStation Fans! Call of Duty Will Continue To Ship On PS 5 and Upcoming Sony Consoles - Jagran English", "description": "A Microsoft official committed that the tech giant will continue to ship Call of Duty on Sony PlayStation consoles after the acquisition of Activision Blizzard", "url": "https://english.jagran.com/technology/good-news-for-playstation-fans-call-of-duty-continue-on-ps-5-sony-consoles-microsoft-ftc-us-trial-latest-news-10084416", "urlToImage": "https://imgeng.jagran.com/images/2023/jun/call-of-duty1687629852173.jpg", "publishedAt": "2023-06-24T17:33:00Z", "content": "JE Technology Desk: A Microsoft official committed in court that it will continue to ship Call of Duty to its competitor Sony PlayStation devices after its acquisition of Activision Blizzard, reporte… [+1717 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Terrifying Solar storms putting satellites in danger, NASA says - HT Tech", "description": "Earth's thermosphere has experienced its highest temperature in nearly 20 years as a result of intense solar storms.", "url": "https://tech.hindustantimes.com/tech/news/terrifying-solar-storms-putting-satellites-in-danger-nasa-says-71687609561332.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/satellite_1687609880842_1687609881108.jpg", "publishedAt": "2023-06-24T12:33:27Z", "content": "Earth's thermosphere has experienced its highest temperature in nearly 20 years as a result of intense solar storms. These storms, caused by coronal mass ejections and solar wind from the sun, have l… [+2274 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cataclysm in the Cosmos: Princeton Researchers Unmask the Violent Origins of the Geminids Meteor Shower - SciTechDaily", "description": "Princeton researchers used data from NASA's Parker Solar Probe to deduce that a catastrophic event likely created the prolific Geminids meteoroid stream. Unlike most meteor showers which originate from comets, the Geminids appear to stem from the asteroid 320…", "url": "https://scitechdaily.com/cataclysm-in-the-cosmos-princeton-researchers-unmask-the-violent-origins-of-the-geminids-meteor-shower/", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Spacecraft-Approaching-Sun-1.jpg", "publishedAt": "2023-06-24T12:13:01Z", "content": "ByPrinceton UniversityJune 24, 2023\r\nIllustration of the Parker Solar Probe spacecraft approaching the sun. Princeton scientists used NASAs Parker Solar Probe data to deduce a violent, catastrophic e… [+10181 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Radio Revelations: Unraveling the Origins of a Supernova - SciTechDaily", "description": "An international team of astronomers has revealed the origin of a thermonuclear supernova explosion. Strong emission lines of helium and the first detection of such a supernova in radio waves show that the exploding white dwarf star had a helium-rich companio…", "url": "https://scitechdaily.com/radio-revelations-unraveling-the-origins-of-a-supernova/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-06-24T08:32:28Z", "content": "ByUniversity of TurkuJune 24, 2023\r\nArtist impression of the double star system with a compact white dwarf star accreting matter from a helium-rich donor companion, surrounded by dense and dusty circ… [+4646 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 Yoga asanas for weight loss and apps to achieve your goal - HT Tech", "description": "5 Yoga asanas for weight loss and apps to achieve your goal Want to lose some extra weight These 5 yoga Asanas will not only help you lose weight but also keep your body and mind healthy. Check the Yoga apps that can help you too. The Virabhadrasana also know…", "url": "https://tech.hindustantimes.com/web-stories/5-yoga-asanas-for-weight-loss-and-apps-to-achieve-your-goal-71687609118267.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/pexels-karolina-grabowska-4498150_1687612719047_1687612755137.jpg/", "publishedAt": "2023-06-24T07:50:00Z", "content": "Photo Credit: pexels\r\n Want to lose some extra weight? These 5 yoga Asanas will not only help you lose weight but also keep your body and mind healthy. Check the Yoga apps that can help you too.\r\nPho… [+2059 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Price Cut Alert! iPhone 12 Mini available on Flipkart with huge discount; buy it for Rs. 50999 now - HT Tech", "description": "Price Cut Alert iPhone 12 Mini available on Flipkart with huge discount buy it for Rs. 50999 now Love compact phones iPhone 12 Mini is available on Flipkart with a huge discount. Check price now. Flipkart has announced a massive offer on the iPhone 12 Mini. M…", "url": "https://tech.hindustantimes.com/web-stories/price-cut-alert-iphone-12-mini-available-on-flipkart-with-huge-discount-buy-it-for-rs-50999-now-71687605702270.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/steve-george-_MTVlkU8Kmo-unsplash_1687607436969_1687607790183.jpg/", "publishedAt": "2023-06-24T06:26:46Z", "content": "Photo Credit: Pexels\r\n Love compact phones? iPhone 12 Mini is available on Flipkart with a huge discount. Check price now.\r\nPhoto Credit: Unsplash\r\n  Flipkart has announced a massive offer on the iPh… [+1305 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sun BLASTS another solar flare at Earth; Know the geomagnetic storm warning - HT Tech", "description": "Geomagnetic storm warnings are incoming after another solar flare erupted on the Sun. This time, it was an M 4.9-class solar flare.", "url": "https://tech.hindustantimes.com/tech/news/sun-blasts-another-solar-flare-at-earth-know-the-geomagnetic-storm-warning-71687585642127.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/g55452219aca037399358a816957cb701756ab19a372f2b0d8_1687585682449_1687585682569.png", "publishedAt": "2023-06-24T05:54:22Z", "content": "We are yet to receive an update on the incoming CME cloud that is supposed to deliver a glancing blow to the Earth today. But in the meantime, reports of another solar flare eruption have raised conc… [+2432 chars]"}]}