{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": null, "name": "PCWorld"}, "author": "Mark Hachman", "title": "Wi-Fi 7 is coming: Meet the smarter, faster Internet of the future - PC World New Zealand", "description": "Qualcomm announces the FastConnect 7800, which the company says will be the first Wi-Fi 7 chip. But what is Wi-Fi 7? We explain the next generation of wireless networking technology.", "url": "https://www.pcworld.com/article/616905/the-smarter-faster-less-laggy-wi-fi-7-is-on-the-horizon.html", "urlToImage": "https://www.pcworld.com/wp-content/uploads/2022/02/router-hero.jpg?quality=50&strip=all&w=1024", "publishedAt": "2022-02-28T14:06:10Z", "content": "Skip to contentType your search and hit enter\r\nMove over, Wi-Fi 6E! Chip vendors like Qualcomm are beginning to make plans for Wi-Fi 7, the next generation of Wi-Fi technology. Qualcomm said Monday a… [+8082 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Gabriel Pabico Lalu", "title": "Robredo believes IT, business process management has ability to boost economy - INQUIRER.net", "description": "MANILA, Philippines — Vice President Leni Robredo has underscored the importance of the information technology and business process management (IT-BPM) sector of the country, saying that the two", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/11/Vice-President-Leni-Robredo-Agri-2022-Online-Forum-11292021_4-620x414.jpg", "publishedAt": "2022-02-28T12:52:00Z", "content": "MANILA, Philippines Vice President Leni Robredo has underscored the importance of the information technology and business process management (IT-BPM) sector of the country, saying that the two indust… [+4210 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa announces ‘quota system’ for foreigners – what you should know - BusinessTech", "description": "For the first time in the history of South Africa, the government has formulated a comprehensive National Labour Migration Policy (NLMP), says Employment and Labour minister Thulas Nxesi.", "url": "https://businesstech.co.za/news/business/563364/south-africa-announces-quota-system-for-foreigners-what-you-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/08/thulasnxesi.jpg", "publishedAt": "2022-02-28T11:24:21Z", "content": "For the first time in the history of South Africa, the government has formulated a comprehensive National Labour Migration Policy (NLMP), says Employment and Labour minister Thulas Nxesi.\r\nIn a media… [+3499 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Agency Report", "title": "Why we reject horror movies in Nigerian cinemas - Exhibitors - Premium Times", "description": "The Cinema Exhibitors Association of Nigeria (CEAN) outlined the technical specifications that must be met before a cinema could showcase a movie across the nation.", "url": "https://www.premiumtimesng.com/entertainment/nollywood/514301-why-we-reject-horror-movies-in-nigerian-cinemas-exhibitors.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/03/Screenshot-372-e1615218718322.png", "publishedAt": "2022-02-28T10:39:20Z", "content": "On Sunday, the Cinema Exhibitors Association of Nigeria (CEAN) outlined the technical specifications that must be met before a cinema could showcase a movie across the nation.\r\nThe National Chairman … [+3331 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Jayne Augoye", "title": "Veteran Nigerian actor, Lari Williams, dies at 81 - Premium Times", "description": "The accomplished actor, who had a two year-lecturing contract with the University of Calabar (UNICAL) to teach drama and acting, particularly speech and acting technique, died in his hometown, Ikom, Cross-River", "url": "https://www.premiumtimesng.com/entertainment/nollywood/514293-veteran-nigerian-actor-lari-williams-dies-at-81.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/02/FB_IMG_1646034979915.jpg", "publishedAt": "2022-02-28T09:39:17Z", "content": "Veteran Nollywood actor, Lari Williams, has died at the age of 81.\r\nThe accomplished actor, who had a two year-lecturing contract with the University of Calabar (UNICAL) to teach drama and acting, pa… [+1949 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Find Two Supermassive Black Holes Spiraling Toward a Cataclysmic Collision - SciTechDaily", "description": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging. Supermassive black holes millions to billions of times the mass of our Sun lie at the heart …", "url": "https://scitechdaily.com/astronomers-find-two-supermassive-black-holes-spiraling-toward-a-cataclysmic-collision/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Spinning-Disk.gif", "publishedAt": "2022-02-28T09:18:45Z", "content": "A supermassive black hole 9 billion light-years away appears to have a companion black hole orbiting around it. As the orbit shrinks, the pair gets closer to merging.\r\nSupermassive black holes millio… [+4492 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Priya Kumari", "title": "Xiaomi 11T Pro 5G price on Amazon: Get whopping 20% discount, other offers too - HT Tech", "description": "Check discount, exchange offer by Amazon on Xiaomi 11T Pro 5G. Know the latest price here.", "url": "https://tech.hindustantimes.com/mobile/news/xiaomi-11t-pro-5g-price-on-amazon-get-whopping-20-discount-other-offers-too-71646038793024.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/28/1600x900/Untitled_design_-_2022-02-28T142823.034_1646038865074_1646038882062.jpg", "publishedAt": "2022-02-28T09:04:59Z", "content": "From affordable to premium smartphones, there are a lot of options to choose from. Some of the things you need to consider before buying any smartphone are its price and features. Getting to buy a go… [+2989 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "POCO F4 specs leaked online, expected to have Snapdragon 870 chipset - TechNave", "description": "Back in November 2021, it was rumoured that&nbsp;POCO&nbsp;would launch a rebranded version of the&nbsp;Xiaomi K50 Gaming Pro&nbsp;as the&nbsp;POCO F4 GT. Month", "url": "https://technave.com/gadget/POCO-F4-specs-leaked-online-expected-to-have-Snapdragon-870-chipset-28691.html", "urlToImage": "https://technave.com/data/files/article/202202280826159959.jpg", "publishedAt": "2022-02-28T08:37:00Z", "content": "Back in November 2021, it was rumoured that POCO would launch a rebranded version of the Xiaomi K50 Gaming Pro as the POCO F4 GT. Months later, we finally have an update that's related to this. Speci… [+1224 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The average take-home pay in South Africa right now - BusinessTech", "description": "South Africa’s average salary in January 2022 increased at its fastest rate since the pre-pandemic January 2020 period, according to the monthly BankserAfrica Take-home Pay Index (BTPI).", "url": "https://businesstech.co.za/news/finance/563260/the-average-take-home-pay-in-south-africa-right-now-9/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand1-scaled-e1606294571290.jpg", "publishedAt": "2022-02-28T08:33:11Z", "content": "South Africas average take-home pay in January 2022 increased at its fastest rate since the pre-pandemic January 2020 period, according to the monthly BankserAfrica Take-home Pay Index (BTPI).\r\nThe a… [+2032 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Himani Jha", "title": "Forget Microsoft Windows 11! Here is the big reason why - HT Tech", "description": "Microsoft Windows 11 successor? Already? The tech giant will start working on the development from March 2022.", "url": "https://tech.hindustantimes.com/tech/news/forget-microsoft-windows-11-here-is-the-big-reason-why-71646036608363.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/28/1600x900/Untitled_design_-_2022-02-11T124934.597_1644564944243_1646036691897.jpg", "publishedAt": "2022-02-28T08:26:19Z", "content": "Microsoft Windows 11 was rolled out just a few years ago and surprisingly Microsoft is already gearing up to bring its successor with new design elements and features! The tech giant will kickstart d… [+1738 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How Russia’s invasion of Ukraine will hit South Africa - BusinessTech", "description": "Russia’s invasion of Ukraine has led to turmoil in the global markets but is unlikely to have a major impact on the broader growth impact on South Africa, say economists at the Bureau for Economic Research (BER).", "url": "https://businesstech.co.za/news/finance/563176/how-russias-invasion-of-ukraine-will-hit-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/07/Fill-up-fuel-petrol.jpg", "publishedAt": "2022-02-28T06:57:30Z", "content": "Russia’s invasion of Ukraine has led to turmoil in the global markets but is unlikely to have a major impact on the broader growth impact on South Africa, say economists at the Bureau for Economic Re… [+2891 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The South African government attempts to repair relations with Russia after taking a harsh stance against the invasion; The director-general of the health department outlines how mandatory vaccinations will not be legal for public servants; South African doct…", "url": "https://businesstech.co.za/news/government/563104/5-important-things-happening-in-south-africa-today-1229/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/51903015163_a482f19f64_c.jpg", "publishedAt": "2022-02-28T06:14:29Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 1,266 new cases of Covid-19, taking the total reported to 3,673,257. Deaths have reached 9… [+3410 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "SEC grants crowdfunding licenses of 2 firms - pna.gov.ph", "description": "MANILA – The Securities and Exchange Commission (SEC) has allowed SeedIn Technology, Inc. and Eastern Securities Development Corporation to act as crowdfunding intermediaries and operate crowdfunding portals, providing the country’s small, medium and emerging…", "url": "https://www.pna.gov.ph/articles/1168652", "urlToImage": "https://files01.pna.gov.ph/ograph/2021/06/14/seclogopnacdo.jpeg", "publishedAt": "2022-02-28T05:26:00Z", "content": null}, {"source": {"id": null, "name": "The Straits Times"}, "author": null, "title": "Technician dies in tragic accident in Tampines a day before he was due to take VTL home - STOMP", "description": "A Malaysian working in Singapore died in a road accident in Tampines one day before he was due to return home using the vaccinated travel lane (VTL). Read more at stomp.straitstimes.com", "url": "https://stomp.straitstimes.com/singapore-seen/technician-dies-in-tragic-accident-in-tampines-a-day-before-he-was-due-to-take-vtl", "urlToImage": "https://s3-stomprevamp.s3-ap-southeast-1.amazonaws.com/s3fs-public/styles/article_detail_fi_breakpoints_theme_bootstrap_screen-lg-min_1x/public/images/2022/02/fatal-accident.jpg?itok=EBvzpKqf", "publishedAt": "2022-02-28T03:11:33Z", "content": "Maureen KohThe New PaperFebruary 27, 2022\r\nA Malaysian working in Singapore died in a road accident in Tampines one day before he was due to return home using the vaccinated travel lane (VTL).\r\nThe 3… [+2156 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Huawei launches smart office products in Europe as smartphone sales suffer setback - Global Times", "description": "Huawei has launched seven smart office products at the Huawei Spring 2022 Smart Office Launch event on Sunday in Barcelona, Spain, as the Chinese tech giant is seeking new growth points amid withering sales due to the years-long US ban.", "url": "https://www.globaltimes.cn/page/202202/1253379.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-02-27/7377a9ef-ce90-4dae-b966-7e8fb972c429.jpeg", "publishedAt": "2022-02-27T17:45:00Z", "content": "Photo: VCG\r\nHuawei has launched seven smart office products at the Huawei Spring 2022 Smart Office Launch event on Sunday in Barcelona, Spain, as the Chinese tech giant is seeking new growth points a… [+1669 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Updates on Artemis I Mission, Test Fires RS-25 Rocket Engine [Video] - SciTechDaily", "description": "An update on our Artemis I mission, test firing an Artemis rocket engine, and a resupply mission delivers to the space station … a few of the stories to tell you about – This Week at NASA! https://youtu.be/tPzByYNUPNE Video Transcript: An update on our Artemi…", "url": "https://scitechdaily.com/nasa-updates-on-artemis-i-mission-test-fires-rs-25-rocket-engine-video/", "urlToImage": "https://scitechdaily.com/images/Artemis-I-Inside-High-Bay-3-VAB.jpg", "publishedAt": "2022-02-27T16:37:27Z", "content": "Inside High Bay 3 of the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida, the work platforms have been retracted from around the Artemis I Space Launch System. Credit: NASA/Frank … [+3310 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Curiosity Rover Finds a Bizarre Rock on Mars That Looks Like a Flower - SciTechDaily", "description": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic feature, the rover team confirmed this object is a mineral format…", "url": "https://scitechdaily.com/curiosity-rover-finds-a-bizarre-rock-on-mars-that-looks-like-a-flower/", "urlToImage": "https://scitechdaily.com/images/Curiosity-Finds-Bizarre-Rock-on-Mars.jpg", "publishedAt": "2022-02-27T12:07:05Z", "content": "The Curiosity rover took a picture of something pretty enticing this week on the surface of Mars. While the object in question looks like a tiny little flower or maybe even some type of organic featu… [+2579 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Entirely New, Inexpensive Catalyst Speeds the Production of Oxygen From Water - SciTechDaily", "description": "The material could replace rare metals and lead to more economical production of carbon-neutral fuels. An electrochemical reaction that splits apart water molecules to produce oxygen is at the heart of multiple approaches aiming to produce alternative fuels f…", "url": "https://scitechdaily.com/entirely-new-inexpensive-catalyst-speeds-the-production-of-oxygen-from-water/", "urlToImage": "https://scitechdaily.com/images/Electrochemical-Reaction-Splitting-Water-Molecules-scaled.jpg", "publishedAt": "2022-02-27T05:15:59Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyFebruary 26, 2022Illustration depicts an electrochemical reaction, splitting water molecules (at right, with oxygen atom in red, and two hydr… [+6300 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Here’s what a R5 million property looks like in South Africa vs London, the US, Cyprus and Portugal - BusinessTech", "description": "We looked at what a R5 million property looks like in popular cities around the world compared to South Africa.", "url": "https://businesstech.co.za/news/property/561850/heres-what-a-r5-million-property-looks-like-in-south-africa-vs-london-the-us-cyprus-and-portugal/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/Screenshot-2022-02-23-161903.jpg", "publishedAt": "2022-02-27T05:00:55Z", "content": "South Africans are downscaling to adjust to financial pressures; however, according to FNB’s latest property barometer, as many as 8% of people are selling their homes with plans to leave the country… [+2573 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Reveal Incredible Map of 4.4 Million Galaxies - SciTechDaily", "description": "Durham University astronomer collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low-Frequency Array (LOFAR), a pan-European radio telescope. The map reveals an astonishingly detailed radio image…", "url": "https://scitechdaily.com/astronomers-reveal-incredible-map-of-4-4-million-galaxies/", "urlToImage": "https://scitechdaily.com/images/Detailed-Radio-Universe.gif", "publishedAt": "2022-02-26T17:54:11Z", "content": "Durham University astronomer collaborating with a team of international scientists have mapped more than a quarter of the northern sky using the Low-Frequency Array (LOFAR), a pan-European radio tele… [+7150 chars]"}]}