{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 stunning images of solar system captured by NASA James Webb Space Telescope - HT Tech", "description": "5 stunning images of solar system captured by NASA James Webb Space Telescope Check out mesmerising images of our solar system from the view of NASA James Webb Space Telescope. Our solar is vast and it consists of major planets moons asteroids comets and seve…", "url": "https://tech.hindustantimes.com/web-stories/5-stunning-images-of-solar-system-captured-by-nasa-james-webb-space-telescope-71720190523694.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/05/1600x900/STScI-01GCVNBND6RJ9360JKJ1G86Q0V_1720191127605_1720191135445.png/", "publishedAt": "2024-07-06T07:30:03Z", "content": "Photo Credit: Pixabay Check out mesmerising images of our solar system from the view of NASA James Webb Space Telescope. \r\nPhoto Credit: Pixabay Our solar is vast and it consists of major planets, mo… [+1336 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Victoria Feng", "title": "Apple accepts Epic Games Store for EU after public callout from company - NBC News", "description": "Apple has signed off on the Epic Games Store in the EU after the gaming company publicly complained that the tech giant had repeatedly rejected their application.", "url": "https://www.nbcnews.com/tech/tech-news/apple-accepts-epic-games-store-eu-public-callout-company-rcna160507", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2020-09/200908-fortnite-iphone-ew-342p-c28575.jpg", "publishedAt": "2024-07-05T22:44:05Z", "content": "Apple has signed off on the Epic Games Store in the European Union after the gaming company publicly complained that the tech giant had repeatedly rejected their application, which Epic Games said wa… [+2372 chars]"}, {"source": {"id": null, "name": "Droid Life"}, "author": "Tim", "title": "Pixel 9 Series Getting Big Hardware Upgrade - Droid Life", "description": "At long last, Google is reported to be upgrading the type of fingerprint reader on the Pixel lineup. For years, we’ve had an optical reader on Pixel phones, and while Google has done its best to make them quick, an upgrade to ultrasonic technology is sure to …", "url": "https://www.droid-life.com/2024/07/05/pixel-9-upgraded-with-ultrasonic-fingerprint-reader/", "urlToImage": "https://www.droid-life.com/wp-content/uploads/2024/06/Pixel-8a-Review-5-600x315-cropped.jpg", "publishedAt": "2024-07-05T16:08:21Z", "content": "At long last, Google is reported to be upgrading the type of fingerprint reader on the Pixel lineup. For years, we’ve had an optical reader on Pixel phones, and while Google has done its best to make… [+875 chars]"}]}