{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Blackouts hit Earth as 8 M-class solar flares erupt in 24 hours, says NASA; Solar storm threat rises - HT Tech", "description": "In the last 24 hours, as many as 8 M-class solar flares have erupted on a new sunspot sparking a rolling series of radio blackouts all across the Earth, NASA satellite detected. Is this a sign of a big incoming solar storm?", "url": "https://tech.hindustantimes.com/tech/news/blackouts-hit-earth-as-8-m-class-solar-flares-erupt-in-24-hours-says-nasa-solar-storm-threat-rises-71689224872192.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/13/1600x900/sun-4444454_1920_1651753999330_1689224921057.jpg", "publishedAt": "2023-07-13T05:11:42Z", "content": "In the early hours of July 12, a single M-class solar flare was produced by an emerging sunspot on the northeastern limb of the Sun, and it sparked blackouts over the North American continent, as per… [+2661 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Get ready! Samsung Galaxy Z Fold 5 and Galaxy Z Flip 5 India sale date revealed - HT Tech", "description": "The Samsung Galaxy Z Fold 5 and Galaxy Z Flip 5 India sale date has likely been revealed before the Samsung Unpacked 2023 event on July 26.", "url": "https://tech.hindustantimes.com/mobile/news/get-ready-samsung-galaxy-z-fold-5-and-galaxy-z-flip-5-india-sale-date-revealed-71689223809038.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/13/1600x900/render_1679998200329_1689224172507.webp", "publishedAt": "2023-07-13T05:00:09Z", "content": "The much-awaited Samsung Galaxy Z Fold 5 and Galaxy Z Flip 5 India sale date has likely been revealed before the Samsung event. The date for the availability of these phones in India and other countr… [+1933 chars]"}, {"source": {"id": null, "name": "Techpp.com"}, "author": "Utpal Raj", "title": "How to Enable and Use StandBy Mode on iPhone [iOS 17] - TechPP", "description": "StandBy mode turns your iPhone into an always-on smart display without consuming too much battery. Learn how to enable and use StandBy mode on iPhone running iOS 17.", "url": "https://techpp.com/2023/07/13/how-to-enable-and-use-standby-mode-on-iphone/", "urlToImage": "https://techpp.com/wp-content/uploads/2023/07/How-to-Enable-And-Use-StandBy-Mode-on-iPhone-1.jpg", "publishedAt": "2023-07-13T03:37:58Z", "content": "iOS 17 is the latest update that comes with a number of new features. Among these innovative new features, there is one that has attracted a lot of attention from iPhone users worldwide: the remarkab… [+12394 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Debangana Ghosh", "title": "HCLTech acquires German autonomous driving tech firm for $279 million - Moneycontrol", "description": "The acquisition will help the IT services firm strengthen its capabilities in autonomous driving, e-mobility and connectivity; and expand into key automotive markets in Europe, Americas and Japan.", "url": "https://www.moneycontrol.com/news/business/hcltech-to-acquire-german-automotive-engineering-firm-asap-group-for-279-million-10949301.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/04/HCL.jpg", "publishedAt": "2023-07-13T01:32:29Z", "content": "Indias third largest IT services firm, HCLTech has acquired a 100 percent equity stake in German automotive engineering services provider ASAP Group. The acquisition will help the IT Company to stren… [+2217 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Dark Matter Mysteries Through Gravitational Waves - SciTechDaily", "description": "Gravitational waves from merging black holes could unveil the nature of dark matter, according to computer simulations presented at the 2023 National Astronomy Meeting. Using computer simulations, an international team of cosmologists has discovered that obse…", "url": "https://scitechdaily.com/unlocking-dark-matter-mysteries-through-gravitational-waves/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Waves-Dark-Matter-Astrophysics-Illustration.jpg", "publishedAt": "2023-07-12T20:21:58Z", "content": "ByRoyal Astronomical SocietyJuly 12, 2023\r\nResearchers have revealed that the observation of gravitational waves from merging black holes may provide new insights into the nature of dark matter, acco… [+3753 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Swarm Intelligence in Space: NASA's Starling CubeSats Ready To Test Critical Technology - SciTechDaily", "description": "NASA’s Starling mission will test critical swarm technologies in space, highlighting the capabilities of autonomous spacecraft swarms. Through collaborations with academic institutions and small businesses, the mission aims to advance space exploration and st…", "url": "https://scitechdaily.com/swarm-intelligence-in-space-nasas-starling-cubesats-ready-to-test-critical-technology/", "urlToImage": "https://scitechdaily.com/images/NASA-Starling-Mission.jpg", "publishedAt": "2023-07-12T00:57:06Z", "content": "ByNASA Ames Research CenterJuly 11, 2023\r\nNASAs Starling mission will test new technologies for autonomous swarm navigation on four CubeSats in low-Earth orbit. Credit: Blue Canyon Technologies/NASA\r… [+5418 chars]"}]}