{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss Eclipses: NASA Releases New Map of Upcoming Solar Eclipses - SciTechDaily", "description": "Where will you be for the 2023 and 2024 solar eclipses in the United States? NASA has released a new map that could help you decide. Based on observations from several NASA missions, the map details the path of the Moon’s shadow as it crosses the contiguous U…", "url": "https://scitechdaily.com/?p=261604", "urlToImage": "https://scitechdaily.com/images/Moon-Appearance-November-2022-Total-Lunar-Eclipse.gif", "publishedAt": "2023-03-19T21:22:28Z", "content": "ByVanessa Thomas, NASAs Goddard Space Flight CenterMarch 19, 2023\r\nThe appearance of the Moon during the November 2022 total lunar eclipse. NASA has released a new map that details the 2023 and 2024 … [+9845 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Humans Are Leaving Behind a Frozen Legacy of Microbes on Mount Everest - SciTechDaily", "description": "Located nearly 5 miles above sea level in the Himalayas, the barren, wind-swept depression between Mount Everest and its neighboring summit, Lhotse, remains devoid of snow. At the South Col, hundreds of thrill-seekers set up their final camp annually, prepari…", "url": "https://scitechdaily.com/?p=260828", "urlToImage": "https://scitechdaily.com/images/Site-of-Soil-Samples-Near-South-Col-Camp-scaled.jpg", "publishedAt": "2023-03-19T18:47:50Z", "content": "A camp on the South Col, where hundreds of adventurers pitch their final camp each year before attempting to scale the worlds tallest peak from the southeastern side. Photo was taken near the site of… [+4941 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lance Ulanoff", "title": "Siri can't beat ChatGPT unless Apple breaks its own rules - TechRadar", "description": "Opinion: The one thing that's most important to Apple", "url": "https://www.techradar.com/opinion/siri-cant-beat-chatgpt-unless-apple-breaks-its-own-rules", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cQN5rxJTRtg46QzL7fhuHg-1200-80.jpg", "publishedAt": "2023-03-19T17:00:46Z", "content": "I''ve known Siri, Apple's voice assistant, for almost a dozen years, and yet I still can't recall a single meaningful conversation we've had. Conversely, ChatGPT and I have known each other for six m… [+4838 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iOS 16.4 update is on the way! Check benefits for your iPhone! - HT Tech", "description": "iOS 16.4 update is on the way Check benefits for your iPhone iOS 16.4 update release date has still not been declared but iPhone users have been anticipating this update for quite some time and it is likely very soon. Unsplash The expected iOS 16.4 release da…", "url": "https://tech.hindustantimes.com/web-stories/ios-16-4-update-is-on-the-way-check-benefits-for-your-iphone-71679224511678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/HT_Tech_1679225023193_1679225056883_1679225056883.jpg/", "publishedAt": "2023-03-19T11:30:51Z", "content": "iOS 16.4 update release date has still not been declared, but iPhone users have been anticipating this update for quite some time and it is likely very soon. (Unsplash)\r\nThe expected iOS 16.4 release… [+1468 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Madeline Coggins", "title": "CEO explains how a 'leapfrog in technology' can help companies catering to the blind community - Fox Business", "description": "Be My Eyes CEO Mike Buckley highlights the opportunity artificial intelligence presents to businesses, noting his own company has adopted new Chat GPT-4 tech to better help customers.", "url": "https://www.foxbusiness.com/technology/ceo-explains-leapfrog-technology-help-companies-catering-blind-community", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/02/0/0/2023-02-11T001737Z_2_LYNXMPEJ1A002_RTROPTP_4_OPENAI-CHATGPT.jpg?ve=1&tl=1", "publishedAt": "2023-03-19T11:07:42Z", "content": "The growth of artificial intelligence (AI) has prompted numerous companies to invest in and utilize technology to enhance their products and services. \r\nOne CEO outlined how this \"leapfrog in technol… [+4405 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study Shows Healthy Dogs and Cats Can Transmit Dangerous Microbes to Humans – And Vice Versa - SciTechDaily", "description": "Multi-drug-resistant organisms can be transmitted between healthy dogs and cats and their hospitalized owners. Fortunately, only a small number of cases were found suggesting pets are not a major source of antibiotic-resistant infections in hospital patients.…", "url": "https://scitechdaily.com/study-shows-healthy-dogs-and-cats-can-transmit-dangerous-microbes-to-humans-and-vice-versa/", "urlToImage": "https://scitechdaily.com/images/Veterinarians-Masks-Checking-Dog.jpg", "publishedAt": "2023-03-19T09:57:56Z", "content": "BySciTechDailyMarch 19, 2023\r\nHealthy dogs and cats may be transmitting multidrug-resistant organisms (MDROs) to their hospitalized owners, while humans could also be passing these microbes to their … [+5888 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14 Gudi Padwa offer rolled out on Maple; Get Rs. 8000 instant discount - HT Tech", "description": "You can grab amazing offers on iPhone 14, iPhone 14 Plus, and iPhone 14 Pro models on Maple till March 31. Check details here.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-gudi-padwa-offer-rolled-out-on-maple-get-rs-8000-instant-discount-71679216893102.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/19/1600x900/2_1677833039942_1679216955411_1679216955411.jpg", "publishedAt": "2023-03-19T09:18:39Z", "content": "Maple has announced a special offer on the iPhone 14, iPhone 14 Plus and iPhone 14 Pro in celebration of the upcoming festival of Gudi Padwa. You can avail the offers from March 15 to March 31, 2023.… [+1418 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Unveils Next-Gen Spacesuit for Artemis III Moon Surface Mission - SciTechDaily", "description": "When NASA sends the first astronauts to explore near the lunar South Pole, moonwalkers will wear spacesuits provided by Axiom Space. NASA selected the company to develop the modern suits for the Artemis III mission and participated in activities when the firs…", "url": "https://scitechdaily.com/nasa-unveils-next-gen-spacesuit-for-artemis-iii-moon-surface-mission/", "urlToImage": "https://scitechdaily.com/images/Axiom-AxEMU-Spacesuit-Thumbs-Up.jpg", "publishedAt": "2023-03-18T16:35:16Z", "content": "ByNASAMarch 18, 2023\r\nCredit: Axiom Space\r\nWhen NASA\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government th… [+6247 chars]"}, {"source": {"id": null, "name": "The Rahnuma Daily"}, "author": null, "title": "Mirai Solar harnesses green energy to power greenhouses - The Rahnuma Daily", "description": "(RAHNUMA):Mirai Solar, a solar technology startup of King Abdullah University of Science and Technology, is disrupting the greenhouse market by developing foldable roof shades that not only prevent fruits, vegetables and flowers from extreme sunlight but also…", "url": "https://www.therahnuma.com/mirai-solar-harnesses-green-energy-to-power-greenhouses/", "urlToImage": "https://www.therahnuma.com/wp-content/uploads/2023/03/16-20.jpg", "publishedAt": "2023-03-18T13:58:14Z", "content": "Founding team of Mirai Solar, from left, inside the KAUST Solar Center labs: Emmanuel Van Kerschaver, Michael Salvador, Tom Allen, Michele de Bastiani, Ahmed Balawi.\r\n(RAHNUMA):Mirai Solar, a solar t… [+5605 chars]"}]}