{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "espn", "name": "ESPN"}, "author": "Dave McMenamin", "title": "Murray dodges technical foul call after throwing heating pad - ESPN", "description": "Denver Nuggets guard Jamal Murray should have been called for a technical foul after throwing a heating pad on the floor during a 106-80 Game 2 loss to the Minnesota Timberwolves, crew chief Marc Davis said Monday, but play continued without any whistle.", "url": "https://www.espn.com/nba/story/_/id/40098658/murray-dodges-technical-foul-call-throwing-heating-pad", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0507%2Fr1329525_1296x729_16%2D9.jpg", "publishedAt": "2024-05-07T06:18:10Z", "content": "DENVER -- Nuggets guard Jamal Murray should have been called for a technical foul -- but not ejected -- for throwing a heating pad on the floor during Denver's 106-80 Game 2 loss to the Minnesota Tim… [+3657 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Dominic-Madori Davis and Amanda Silberling", "title": "The Kendrick-Drake feud shows how technology is changing rap battles - TechCrunch", "description": "The feud between Kendrick Lamar and Drake highlights technology’s increased role in rap beefs, in addition to how and when AI should be used in music.", "url": "https://techcrunch.com/2024/05/06/the-kendrick-drake-feud-shows-how-technology-is-changing-rap-battles/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/05/GettyImages-1410772995.jpg?w=1024", "publishedAt": "2024-05-06T22:50:53Z", "content": "It seems were all in agreement: Kendrick Lamar defeated Drake in one of the most engrossing rap battles of the decade. To add insult to injury, Drake also threw himself into legal hot water when he d… [+9388 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Revolutionising Cancer Care: Tech Innovations and Personalised Medicine | Medicine Box | CNBC TV18 - CNBC-TV18", "description": "On this edition of Medicine Box, Dr Vijay V Haribhakti, Chair of Onco Sciences at Sir HN Reliance Foundation Hospital and Dr T Raja, Director of Medical Onco...", "url": "https://www.youtube.com/watch?v=J7Ij1doGvXg", "urlToImage": "https://i.ytimg.com/vi/J7Ij1doGvXg/maxresdefault.jpg", "publishedAt": "2024-05-06T16:14:55Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Leap: How a New Experiment Could Solve Gravity's Biggest Mystery - SciTechDaily", "description": "A proposed experiment shows that quantum entanglement is not the only way to test whether gravity has a quantum nature. Gravity is part of our everyday life. Still, the gravitational force remains mysterious: to this day we do not understand whether its ultim…", "url": "https://scitechdaily.com/quantum-leap-how-a-new-experiment-could-solve-gravitys-biggest-mystery/", "urlToImage": "https://scitechdaily.com/images/Quantum-Time-Gravity-Concept.jpg", "publishedAt": "2024-05-05T15:51:11Z", "content": "A new study suggests an experimental method to test gravity’s quantum aspects without needing to entangle massive objects, potentially advancing the field significantly. Credit: SciTechDaily.com\r\nA p… [+4963 chars]"}]}