{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Starliner delays keep NASA astronauts in space longer - CBS News", "description": "For the first time since their mission started last month, NASA astronauts Butch Wilmore and Suni Williams discussed the technical difficulties that have len...", "url": "https://www.youtube.com/watch?v=K4YHvq0nFuM", "urlToImage": "https://i.ytimg.com/vi/K4YHvq0nFuM/maxresdefault.jpg", "publishedAt": "2024-07-11T13:31:33Z", "content": null}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Apple warns iPhone users in 98 countries of spyware attacks - TechCrunch", "description": "Apple has issued a new round of threat notifications to iPhone users across 98 countries, warning them of potential mercenary spyware attacks. It's the Apple issued threat notifications to iPhone users across 98 countries, warning them of spyware attacks.", "url": "https://techcrunch.com/2024/07/10/apple-alerts-iphone-users-in-98-countries-to-mercenary-spyware-attacks/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/07/GettyImages-2160134917.jpg?resize=1200,800", "publishedAt": "2024-07-11T03:14:47Z", "content": "Apple has issued a new round of threat notifications to iPhone users across 98 countries, warning them of potential mercenary spyware attacks. It’s the second such alert campaign from the company thi… [+1823 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Associated Press", "title": "Samsung launches first-of-a-kind smart ring, watch with AI features to help monitor your health - New York Post ", "description": "The AI deployment on Samsung’s new premium watch and ring is narrowly focused on improving and maintaining personal health — the main reason most people buy wearable technology.", "url": "https://nypost.com/2024/07/10/business/samsung-launches-first-of-a-kind-smart-ring-watch-with-ai-features/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/07/samsung-ai-devices.jpg?quality=75&strip=all&1720610817&w=1024", "publishedAt": "2024-07-10T16:53:00Z", "content": "Samsung is dressing up its wearable devices in technologys latest fashion artificial intelligence.\r\nThe South Korean electronics giant on Wednesday revealed that both its first-ever premium smartwatc… [+5113 chars]"}]}