{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Aircraft-sized asteroid set to make a close approach to Earth, says NASA - HT Tech", "description": "NASA has revealed details of an upcoming close encounter with an asteroid that will pass the planet closely today, October 26 Know its speed, size, distance of approach, and other details.", "url": "https://tech.hindustantimes.com/tech/news/aircraftsized-asteroid-set-to-make-a-close-approach-to-earth-says-nasa-71698295978256.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/26/1600x900/g40eb_1694271741677_1698296067592.jpg", "publishedAt": "2023-10-26T04:54:55Z", "content": "In research published in the Monthly Notices of the Royal Astronomical Society, MIT scientists have developed a new method to study the internal structure of the space rock based on how the spin of t… [+1965 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Vijay Kishore", "title": "Stocks to Watch: Axis Bank, TechM, TCS, IRM Energy, Jubilant Foodworks | Mint - Mint", "description": "Asian Paints, Canara Bank, Colgate Palmolive, Indian Bank, ACC, PNB, Shriram Finance, Railtel Corporation, and Vodafone Idea will be among the stocks to watch on Thursday as they will be declaring their quarterly earnings report", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-axis-bank-techm-tcs-irm-energy-jubilant-foodworks-11698279088217.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/26/1600x900/40cfde44a33c403fb7f363284fb2f53b-40cfde44a33c403fb_1698279133747_1698279133935.jpg", "publishedAt": "2023-10-26T01:50:16Z", "content": "Axis Bank: Axis Bank Ltd on Wednesday reported a net profit of 5,863 crore in the second quarter of FY24 registering a 10% growth from 5,329.8 crore in the corresponding quarter of last year. NII dur… [+4411 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "Social media platform X rolls out audio, video calling - Reuters", "description": "Social media platform X, formerly known as Twitter, is launching an early version of video and audio calling for some users, according to chief technology officer and owner Elon Musk, as the billionaire pushes for X to become an \"everything app\".", "url": "https://www.reuters.com/technology/social-media-platform-x-rolls-out-audio-video-calling-2023-10-25/", "urlToImage": "https://www.reuters.com/resizer/6dnyIM_RJmXNi1mRKQ79B7tyUkk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/J6YVDZW6EVKLTLKC43XUZYVLHY.jpg", "publishedAt": "2023-10-25T22:49:00Z", "content": "Oct 25 (Reuters) - Social media platform X, formerly known as Twitter, is launching an early version of video and audio calling for some users, according to chief technology officer and owner Elon Mu… [+879 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Ankika Biswas, Shashwat Chauhan", "title": "S&P 500, Nasdaq dip as Alphabet slides - Reuters", "description": "The tech-heavy Nasdaq and the S&P 500 dropped on Wednesday as Alphabet slumped after its cloud division missed revenue estimates, while other mega-cap stocks were also pressured by rising U.S. Treasury yields.", "url": "https://www.reuters.com/markets/us/nasdaq-sp-500-futures-fall-alphabet-leads-retreat-mega-cap-stocks-2023-10-25/", "urlToImage": "https://www.reuters.com/resizer/sriCh9sUOM23hYUleAUZ5G0-60U=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WMAFT5UNAFPRFJYTE57NDWP2CM.jpg", "publishedAt": "2023-10-25T13:55:00Z", "content": "Oct 25 (Reuters) - The tech-heavy Nasdaq and the S&amp;P 500 dropped on Wednesday as Alphabet slumped after its cloud division missed revenue estimates, while other mega-cap stocks were also pressure… [+3254 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Unraveled: Accelerating Waves and the Mysteries of Time and Relativity - SciTechDaily", "description": "Researchers have derived a new wave equation, linking wave mechanics with the general theory of relativity and the arrow of time, offering solutions to long-standing physics debates and introducing applications for novel materials. Researchers at Tampere Univ…", "url": "https://scitechdaily.com/physics-unraveled-accelerating-waves-and-the-mysteries-of-time-and-relativity/", "urlToImage": "https://scitechdaily.com/images/Artistic-Depiction-of-Exponentially-Curved-Spacetime.jpg", "publishedAt": "2023-10-25T13:11:13Z", "content": "An artistic depiction of a wave encountering an exponentially curved spacetime. Credit: Matias Koivurova, University of Eastern Finland\r\nResearchers have derived a new wave equation, linking wave mec… [+6323 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}, {"source": {"id": null, "name": "Mobile World Live"}, "author": "Chris Donkin", "title": "AR player prepares slimmed-down glasses for US, Europe - Mobile World Live", "description": "Xreal Technology announced the forthcoming release of its Air 2 into the increasingly competitive augmented reality eyewear sector.", "url": "https://www.mobileworldlive.com/devices/ar-player-prepares-slimmed-down-glasses-for-us-europe/", "urlToImage": "https://assets.mobileworldlive.com/wp-content/uploads/2023/10/24165056/MWL_Xreal_co_fofunder_PJ_650.jpg", "publishedAt": "2023-10-24T16:31:46Z", "content": "Xreal Technology announced the forthcoming US and European release of its Air 2 into the increasingly competitive AR eyewear sector, pushing the design as being comfortable, lightweight and accessibl… [+1378 chars]"}]}