{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Vaishnawi Sinha", "title": "Apple Vision Pro's spatial computing explained: What is means and how it works - Hindustan Times", "description": "Apple's new product Vision Pro headset has been designed using spatial computing technology, but not many people know what it means.", "url": "https://www.hindustantimes.com/technology/apple-vision-pro-headset-spatial-computing-technology-explained-what-is-means-and-how-it-works-101707020919783.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/02/04/1600x900/APPLE-VISION-PRO-LOS-ANGELES-8_1706894783946_1707020970312.JPG", "publishedAt": "2024-02-04T04:34:08Z", "content": "Apple's most expensive product - Vision Pro headset - has just hit the stores and is making a splash in the technology community. While many believe that it works on a virtual reality model, the Appl… [+2498 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA and SpaceX Set Target Date for Historic Crew-8 Launch - SciTechDaily", "description": "NASA and SpaceX are targeting no earlier than Thursday, February 22, for the launch of the agency’s Crew-8 mission to the International Space Station. Crew-8 hardware and ground systems processing continues for the SpaceX Dragon spacecraft and Falcon 9 rocket…", "url": "https://scitechdaily.com/nasa-and-spacex-set-target-date-for-historic-crew-8-launch/", "urlToImage": "https://scitechdaily.com/images/Official-SpaceX-Crew-8-Portrait-scaled.jpg", "publishedAt": "2024-02-03T23:51:31Z", "content": "Official SpaceX Crew-8 portrait with Roscosmos cosmonaut and Mission Specialist Aleksandr Grebenkin, and Pilot Michael Barratt, Commander Matthew Dominick, and Mission Specialist Jeanette Epps, all t… [+2713 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysics in Crisis? Mystery Object Discovered That Could Change Everything - SciTechDaily", "description": "Astronomers discover a celestial object that defies classification, possibly uncovering a new type of cosmic entity at the edge of known physics. Sometimes astronomers come across objects in the sky that we can’t easily explain. In our new research, published…", "url": "https://scitechdaily.com/astrophysics-in-crisis-mystery-object-discovered-that-could-change-everything/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Mystery-Object-Art-Concept.jpg", "publishedAt": "2024-02-03T15:26:13Z", "content": "ByEwan D. Barr, Arunima Dutta, and Benjamin StappersFebruary 3, 2024Researchers have identified an enigmatic cosmic system that might contain an object bridging the gap between neutron stars and blac… [+6851 chars]"}, {"source": {"id": null, "name": "Jagran.com"}, "author": "Vikas Yadav", "title": "Apple-Masimo Dispute Apple Has No Plans To License Medical Tech Firms Patent; Focused On Appeals, Says CEO Tim Cook - Jagran English", "description": "Apple holds no intentions to license Masimos blood oxygen monitoring technology to stop the ban on Apple watch imports, according to Apple Insider. Apple boss Tim Cook told CNBC: Were focused on appeal. There are lots of reasons to buy the watch even without …", "url": "https://english.jagran.com/technology/apple-masimo-dispute-apple-has-no-plans-to-license-medical-tech-firm-patent-focused-on-appeals-says-ceo-tim-cook-10131301", "urlToImage": "https://imgeng.jagran.com/images/2024/feb/apple-watch-ultra-21706947203137.jpg", "publishedAt": "2024-02-03T07:54:00Z", "content": "Masimo-Apple Patent Dispute: Cupertino-based tech giant Apple recently grabbed headlines for engaging in a patent dispute with medical tech firm Masimo. In the latest update around the tussle, it has… [+1953 chars]"}]}