{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Samsung says the Galaxy S24 vivid display issue isn't actually an issue - TechRadar", "description": "It's supposed to look like that", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/samsung-says-the-galaxy-s24-vivid-display-issue-isnt-actually-an-issue", "urlToImage": "https://cdn.mos.cms.futurecdn.net/27APpc5D5KTe7jmBBinq3o-1200-80.jpg", "publishedAt": "2024-02-04T14:30:50Z", "content": "Since the launch of the Samsung Galaxy S24 series, we've seen plenty of grumbling from new owners of the phones that the vivid display mode isn't quite as vivid as it has been on previous models – bu… [+1660 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "PTI", "title": "Vijay Shekhar Sharma: From architect of fintech powerhouse Paytm to controversies | Mint - Mint", "description": "RBI found that Paytm Payments Bank did not monitor payout transactions and carry out risk profiling of entities availing payout services, breached the regulatory ceiling of end of the day balance in certain customer advance accounts availing payout services", "url": "https://www.livemint.com/companies/news/vijay-shekhar-sharma-from-architect-of-fintech-powerhouse-paytm-to-controversies-11707053029083.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/02/04/1600x900/vijayshekharsharma_1707055567942_1707055568084.jpg", "publishedAt": "2024-02-04T14:13:41Z", "content": "New Delhi: Vijay Shekhar Sharma, one of the most recognised faces of India's fintech industry, has seen a fair share of controversies. Sharma launched Paytm - an acronym for 'pay through mobile' - of… [+5892 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Ashwin Rajagopalan", "title": "6 coolest tech launches from Oppo, Redmi, BenQ, OnePlus and other consumer tech companies so far this... - Moneycontrol", "description": "India launches: Smartphones with 6,67 inch curved displays, a smart projector with Netflix integrated, new Bluetooth TWS earbuds with good active noise cancellation and a sub-35K slim notebook laptop.", "url": "https://www.moneycontrol.com/news/trends/lifestyle/6-coolest-tech-launches-from-oppo-redmi-benq-oneplus-and-other-consumer-tech-companies-so-far-this-year-12190061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/redmi-1-770x433.jpg", "publishedAt": "2024-02-04T13:34:52Z", "content": "Thirty-five days into 2024, weve already seen a flurry of launches from all the big consumer tech brands. OPPO and Redmi unveiled their first major smartphones for 2024 while BenQ launched an aggress… [+4512 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Mysterious Disappearance of an Underwater Explorer in Antarctica - SciTechDaily", "description": "The unmanned underwater vehicle Ran has gone missing under a glacier in Antarctica. The vehicle, owned by the University of Gothenburg, is one of three similar in the whole world that is used for research and has contributed to important knowledge about the s…", "url": "https://scitechdaily.com/the-mysterious-disappearance-of-an-underwater-explorer-in-antarctica/", "urlToImage": "https://scitechdaily.com/images/AUV-Ran.jpg", "publishedAt": "2024-02-04T12:42:23Z", "content": "The AUV is programmed in advance and then sent out on long journeys under the glaciers of Antarctica. Credit: Anna Wåhlin\r\nThe unmanned underwater vehicle Ran has gone missing under a glacier in Anta… [+4377 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Paolo Confino", "title": "Could AI create a one-person unicorn? Sam Altman thinks so—and Silicon Valley sees the technology ‘waiting for us’ - Fortune", "description": "In September, Altman said his tech CEO friends' groupchat has a \"betting pool for the first year that there is a one-person billion dollar company.\"", "url": "https://fortune.com/2024/02/04/sam-altman-one-person-unicorn-silicon-valley-founder-myth/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2024/02/GettyImages-1258019697-e1706907427321.jpg?resize=1200,600", "publishedAt": "2024-02-04T12:00:00Z", "content": "The AI revolution has already minted dozens of unicornsstartups valued at $1 billion before going public. Now it could create a whole new type of startup: the one-person unicorn.  The idea even got a… [+9287 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Edited by Saumya Nigam", "title": "Apple's upcoming Vision Pro Headset: The fusion of Mac and TV technology - India TV News", "description": "Apple has had mixed results courting developers. Netflix, one of the most popular consumer video apps, said late Friday it is not making a new app for the Vision Pro, though consumers can watch movies and series on the device's web browser.", "url": "https://www.indiatvnews.com/technology/news/apple-s-upcoming-vision-pro-headset-the-fusion-of-mac-and-tv-technology-2024-02-04-915208", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/02/apple-vision-pro-1707045586.jpg", "publishedAt": "2024-02-04T11:28:38Z", "content": "Apple's Vision Pro has the potential to revolutionize home entertainment and work technology by redefining how people watch television and use computers. Positioned as a potential successor to both t… [+4844 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Ide", "title": "OnePlus keeps swiping at Apple and Samsung – but is it doing enough itself? - TechRadar", "description": "Banter or bold strategy: OnePlus points out competitors' flaws", "url": "https://www.techradar.com/phones/oneplus-keeps-swiping-at-apple-and-samsung-but-is-it-doing-enough-itself", "urlToImage": "https://cdn.mos.cms.futurecdn.net/bo2w68BGFpSUCzC7PMeuDB-1200-80.jpg", "publishedAt": "2024-02-04T11:01:10Z", "content": "OnePlus could be seen as throwing shade at its pseudo rivals Samsung and Apple after the launch of its new smartphones the OnePlus 12\r\n and OnePlus 12R\r\n. \r\nBut is it all banter or should the one-tim… [+6195 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astrophysics in Crisis? Mystery Object Discovered That Could Change Everything - SciTechDaily", "description": "Astronomers discover a celestial object that defies classification, possibly uncovering a new type of cosmic entity at the edge of known physics. Sometimes astronomers come across objects in the sky that we can’t easily explain. In our new research, published…", "url": "https://scitechdaily.com/astrophysics-in-crisis-mystery-object-discovered-that-could-change-everything/", "urlToImage": "https://scitechdaily.com/images/Cosmic-Mystery-Object-Art-Concept.jpg", "publishedAt": "2024-02-03T15:26:13Z", "content": "ByEwan D. Barr, Arunima Dutta, and Benjamin StappersFebruary 3, 2024Researchers have identified an enigmatic cosmic system that might contain an object bridging the gap between neutron stars and blac… [+6851 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "GTA V PS5 Cheats: List of all GTA V Cheat Codes for PS5, PS4 - HT Tech", "description": "GTA V PS5 Cheats: Players can take advantage of GTA V PS5 cheats in the game and enhance their gameplay experience. So, if you’re new to GTA V, then check out the list of all GTA V cheat codes for PS5, PS4.", "url": "https://tech.hindustantimes.com/gaming/news/gta-v-ps5-cheats-list-of-all-gta-v-cheat-codes-for-ps5-ps4-71706877886480.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/02/1600x900/gta_v_1678076345536_1706877966951.png", "publishedAt": "2024-02-03T12:32:17Z", "content": "GTA V PS5 Cheats: GTA V is considered one of the best games in history. It has gone on to sell millions of copies and is now the second-best-selling video game of all time. Even though GTA V is now o… [+3205 chars]"}]}