{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Hydrogen in a Safe, Easy, and Affordable Way for a Decarbonized Future - SciTechDaily", "description": "Japanese scientists have discovered a compound, ethylammonium lead iodide, which can store and release ammonia safely and efficiently. This finding holds potential for ammonia's role as a carbon-free hydrogen carrier, contributing to the transition towards a …", "url": "https://scitechdaily.com/harnessing-hydrogen-in-a-safe-easy-and-affordable-way-for-a-decarbonized-future/", "urlToImage": "https://scitechdaily.com/images/Chemical-Reaction-Catalyst-Energy-Art-Concept.jpg", "publishedAt": "2023-07-10T12:00:35Z", "content": "Scientists at the RIKEN Center for Emergent Matter Science in Japan have found a way to store ammonia securely and efficiently using a chemical reaction. They utilized a perovskite called ethylammoni… [+4764 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Paul Sutter", "title": "Get comfortable in the Solar System—we’ll be here for a while - Ars Technica", "description": "What if we dropped interstellar ambitions and focused on understanding our home system?", "url": "https://arstechnica.com/science/2023/07/get-comfortable-in-the-solar-system-well-be-here-for-a-while/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/GettyImages-460712793-760x380.jpg", "publishedAt": "2023-07-10T11:00:49Z", "content": "Enlarge/ Home sweet home.\r\n61 with \r\nOn August 25th, 2012, humanity became an interstellar species. There was no fanfare or galactic welcome party as a humble robotic probe, the Voyager 1 spacecraft,… [+3695 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hiding in Plain Sight: Researchers Reveal Impact of Ancient Earthquake - SciTechDaily", "description": "Leveraging the combined strengths of genetics and geology, a team of researchers from the University of Otago has revealed a previously unidentified zone of coastal uplift in Rarangi, Marlborough, that was hiding in plain sight. This unknown earthquake uplift…", "url": "https://scitechdaily.com/hiding-in-plain-sight-researchers-reveal-impact-of-ancient-earthquake/", "urlToImage": "https://scitechdaily.com/images/Earthquake-Coastline-Illustration.jpg", "publishedAt": "2023-07-10T10:33:58Z", "content": "ByUniversity of OtagoJuly 10, 2023\r\nResearchers from the University of Otago have uncovered a previously unidentified zone of coastal uplift in Rarangi, Marlborough, using LiDAR mapping and kelp gene… [+3649 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": null, "title": "Google is testing its medical AI chatbot at the Mayo Clinic - Engadget", "description": "Google is already testing its Med-PaLM 2 AI chat technology at at the Mayo Clinic and other hospitals..", "url": "https://www.engadget.com/google-is-testing-its-medical-ai-chatbot-at-the-mayo-clinic-102055669.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/JyIPCkECBfu0_qXHpdD.Xw--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-07/f168a820-1ef6-11ee-bf9f-8a488ba9aa0f.cf.jpg", "publishedAt": "2023-07-10T10:22:29Z", "content": "Google is already testing its Med-PaLM 2 AI chat technology at at the Mayo Clinic and other hospitals, The Wall Street Journal has reported. It's based on the company's PaLM 2 large language model (L… [+2151 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Universe Revelation: Webb Detects Most Distant Active Supermassive Black Hole - SciTechDaily", "description": "With Webb, a slew of other distant black holes and early galaxies also popped into view for the first time. It’s a bonanza! The universe is absolutely teeming with black holes. Researchers have long known this, but less massive black holes that existed in the…", "url": "https://scitechdaily.com/early-universe-revelation-webb-detects-most-distant-active-supermassive-black-hole/", "urlToImage": "https://scitechdaily.com/images/Distant-Black-Hole-Concept.jpg", "publishedAt": "2023-07-10T08:25:27Z", "content": "BySpace Telescope Science InstituteJuly 10, 2023\r\nThe James Webb Space Telescopes CEERS Survey has uncovered the most distant active supermassive black hole ever found, existing just over 570 million… [+17367 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Instagram’s Threads app reaches 100 million users within just five days - TechCrunch", "description": "Instagram's text-based app and Twitter rival Threads has achieved the mark of 100 million sign-ups in just few days after the launch.", "url": "https://techcrunch.com/2023/07/10/instagrams-threads-app-reaches-100-million-users-in-just-five-days/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1519168800.jpg?w=1024", "publishedAt": "2023-07-10T07:13:04Z", "content": "Instagram’s text-based app Threads has achieved the mark of 100 million sign-ups in just five days. The Twitter rival was launched on June 6 (or June 5 in the Americas), according to a tracker.\r\nMark… [+1505 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "Here’s When Apple Will Release iOS 17 Public Beta For iPhone - Wccftech", "description": "If you are not a developer and want to check out iOS 17, check out when Apple will release the first public beta of the platform on iPhone.", "url": "https://wccftech.com/ios-17-public-beta-release/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/07/iOS-17.jpg", "publishedAt": "2023-07-10T01:13:00Z", "content": "Apple announced iOS 17 at its WWDC 2023 event back in June with major changes and new features. It was initially coined that iOS 17 would be a minor update focusing on the stability of the platform. … [+2108 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm warning: NASA turns to AI for help - HT Tech", "description": "NASA's AI-enabled predictions can offer advance notice for solar storms, providing crucial preparation time to protect power grids and vital infrastructure.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-warning-nasa-turns-to-ai-for-help-71688873212052.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/09/1600x900/Solar_Storm_1688873341996_1688873342136.jpg", "publishedAt": "2023-07-09T03:34:00Z", "content": "NASA's AI-enabled predictions can offer advance notice for solar storms, providing crucial preparation time to protect power grids and crucial infrastructure. The AI model can forecast the location o… [+2705 chars]"}]}