{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "25+ iOS 16-ready apps featuring Lock Screen widgets you can try today - TechCrunch", "description": "One of the major changes with today’s launch of iOS 16 is the ability for users’ to now personalize their Lock Screen with widgets, in addition to adding widgets to the Home Screen, which had rolled out in iOS 14. However, outside of built-in widgets for Appl…", "url": "https://techcrunch.com/2022/09/12/25-ios-16-ready-apps-featuring-lock-screen-widgets-you-can-try-today/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/06/apple-wwdc-2022-2022-06-06-at-1.09.16-PM.jpg?w=1200", "publishedAt": "2022-09-12T22:07:30Z", "content": "One of the major changes with today’s launch of iOS 16 is the ability for users’ to now personalize their Lock Screen with widgets, in addition to adding widgets to the Home Screen, which had rolled … [+12842 chars]"}, {"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Saurav Das", "title": "Pokémon Go: Tips to use Rocket Radar and Rocket Balloons in the game - GamingonPhone", "description": "Pokémon Go is a popular mobile game from Niantic which combines gaming with the real world with the help of augmented reality technology. The game makes it possible for the players to catch and train", "url": "https://gamingonphone.com/guides/pokemon-go-tips-to-use-rocket-radar-and-rocket-balloons-in-the-game/", "urlToImage": "https://i0.wp.com/gamingonphone.com/wp-content/uploads/2022/09/Pokemon-Go-Rocket-Radar-Rocket-Balloons.jpg", "publishedAt": "2022-09-12T17:22:10Z", "content": "Pokémon Go is a popular mobile game fromNiantic which combines gaming with the real world with the help of augmented reality technology. The game makes it possible for the players to catch and train … [+3772 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "NASA Only 2 Weeks Away From World’s First ‘Interplanetary Defense’ Test; DART Mission To Strike Asteroid Dimorphos - EurAsian Times", "description": "The US Double Asteroid Redirection Test (DART), the world’s first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos on  September 26, NASA and Johns Hopkins Applied Physics La…", "url": "https://eurasiantimes.com/nasa-2-weeks-away-from-worlds-first-interplanetary-defense-test-dart/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/07/nasa-space.jpg", "publishedAt": "2022-09-12T16:56:31Z", "content": "The US Double Asteroid Redirection Test (DART), the worlds first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos … [+7440 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Tuesday: Top 15 things to know before the opening bell - Moneycontrol", "description": "Based on the open interest future percentage, there were 82 stocks, including PVR, L&amp;T Technology Services, Ambuja Cements, GNFC, and Divis Laboratories. in which a short-covering was seen", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-tuesday-top-15-things-to-know-before-the-opening-bell-6-9168021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/shutterstock_556282549-2-770x433.jpg", "publishedAt": "2022-09-12T16:54:31Z", "content": "The market extended its northward journey for the third consecutive session as the benchmark indices gained more than half a percent on September 12, tracking positive global cues. All sectoral indic… [+9605 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Skull Bones Restricted the Evolution of Earth’s Earliest Land Animals - SciTechDaily", "description": "According to new research, the skulls of tetrapods had fewer bones than extinct and living fish, restricting their evolution for millions of years. By analyzing fossil skulls of animals across the transition from an aquatic to terrestrial environment, scienti…", "url": "https://scitechdaily.com/skull-bones-restricted-the-evolution-of-earths-earliest-land-animals/", "urlToImage": "https://scitechdaily.com/images/Early-Tetrapod-scaled.jpg", "publishedAt": "2022-09-12T15:33:56Z", "content": "ByUniversity of BristolSeptember 12, 2022\r\nEarly tetrapod. The skulls of tetrapods had fewer bones than extinct and living fish, limiting their evolution for millions of years, according to the lates… [+4020 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Murk Rizwan", "title": "Get Advanced Desktop Wireless Charger With Alarm Clock For Just $51.99 - Wccftech", "description": "Get Advanced Desktop Wireless Charger With Digital Clock For Just $51.99. Power up your phone wirelessly and wake up on Alarm Clock", "url": "https://wccftech.com/get-desktop-wireless-charger-with-alarm-clock-for-just-51-99/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2022/09/wireless-charger.jpg", "publishedAt": "2022-09-12T13:41:53Z", "content": "If you are looking for a good deal to buy a digital alarm and wireless charger, then your search has ended today because Mbeat is offering you the best product with a big discount. You can buy the De… [+1319 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Buy iPhones this new way soon, just check out Apple subscription - HT Tech", "description": "Apple could come up with an iPhone subscription plan by the end of this year, an Apple analyst mentioned. Know all about it here.", "url": "https://tech.hindustantimes.com/mobile/news/buy-iphones-this-new-way-soon-just-check-out-apple-subscription-71662985112503.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/12/1600x900/APPLE-FAR-OUT-13_1662985453998_1662985453998_1662985473128_1662985473128.jpg", "publishedAt": "2022-09-12T12:25:00Z", "content": "The iPhone users will soon get a monthly Apple iPhone subscription bundle with a package involving the hardware and services such as Apple One, which has been rumoured for so long. The hardware subsc… [+1745 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "BS Web Team", "title": "NASA Artemis I: Fuel seals repaired, likely to launch moon rocket on Sep 23 - Business Standard", "description": "NASA had to scrub two launch attempts as the rocket experienced technical glitches including a fuel leak", "url": "https://www.business-standard.com/article/international/nasa-artemis-i-fuel-seals-repaired-likely-to-launch-moon-rocket-on-sep-23-122091200803_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-08/29/full/1661774752-4639.jpg", "publishedAt": "2022-09-12T11:53:00Z", "content": "The National Aeronautics and Space Administration (NASA) has replaced the seals on the Space Launch System (SLS) rocket’s core stage, associated with the liquid hydrogen leak detected during the Arte… [+3807 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Harish Upadhya", "title": "Why Bengaluru Demolition Drive is Going Silent Near Tech Parks Owned by the Mighty - News18", "description": "A BBMP demolition squad reached Bagmane tech park in the morning and even identified and marked 2.4 meters storm water drain encroachment by the IT park. Officials along with police reached the spot but mysteriously they left the tech park few hours later wit…", "url": "https://www.news18.com/news/india/why-bengaluru-demolition-drive-is-going-silent-near-tech-parks-owned-by-the-mighty-5942287.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/bengaluru-demolition-drive-166298135016x9.jpg", "publishedAt": "2022-09-12T11:32:00Z", "content": "In the aftermath of massive waterlogging in Bengaluru, the citys municipal body Bruhat Bengaluru Mahanagara Palike (BBMP) has started a demolition drive. The BBMP teams reached two locations in Mahad… [+2417 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Priyanka Iyer", "title": "Sachin Bansal-led Navi Technologies gets SEBI nod for Rs 3,350 crore IPO - Moneycontrol", "description": "The fintech company plans to invest the proceeds of the IPO in Navi Finserv and Navi General Insurance companies in addition to general expansion goals.", "url": "https://www.moneycontrol.com/news/business/ipo/sachin-bansal-led-navi-technologies-gets-sebi-nod-for-3350-crore-ipo-9166441.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/Sachin-Bansal-1-770x433.jpg", "publishedAt": "2022-09-12T11:27:13Z", "content": "The Securities and Exchange Board of India (SEBI) has approved Sachin Bansal's fintech startup Navi Technologies for an Initial Public Offering (IPO), providing the Flipkart co-founder a boost as he … [+2854 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "Dramatic footage shows orcas breaking an ice platform to trap and kill a seal, a rare technique used by only 100 whales - Yahoo News", "description": "The whales made an artificial wave to break up the ice platform by swimming side by side, as shown in a new BBC documentary.", "url": "https://www.businessinsider.com/video-killer-whale-organize-make-wave-kill-seal-ice-antarctica-2022-9", "urlToImage": "https://i.insider.com/631ef402e8b500001850c0fc?width=1200&format=jpeg", "publishedAt": "2022-09-12T11:02:31Z", "content": "Dramatic footage showed killer whales using a rare hunting technique to trap and kill a seal in the icy waters surrounding Antarctica.\r\nThe video, part of the BBC's new \"Frozen Planet II\" documentary… [+1536 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Why load shedding is back this week – and things aren’t looking good - BusinessTech", "description": "Eskom says that it lost 42 generating units over the last week – and while it has managed to bring 37 back, it underlines how volatile and vulnerable the grid is, with uncertainty over maintenance persisting.", "url": "https://businesstech.co.za/news/energy/624775/why-load-shedding-is-back-this-week-and-things-arent-looking-good/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Eskom-fire.png", "publishedAt": "2022-09-12T09:22:30Z", "content": "Eskom says that it lost 42 generating units over the last week – and while it has managed to bring 37 back, it underlines how volatile and vulnerable the grid is, with uncertainty over maintenance pe… [+3550 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "New tariff could see tyre prices in South Africa increase by as much as 45% - BusinessTech", "description": "The Department of Trade, Industry and Competition (DTiC) has published anti-dumping protection levies on the importation of tyres into South Africa in terms of section 57A of the Customs and Excise Act, 1964.", "url": "https://businesstech.co.za/news/motoring/624605/new-tariff-could-see-tyre-prices-in-south-africa-increase-by-as-much-as-45/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/CarAccident-e1639659178167.png", "publishedAt": "2022-09-12T05:37:45Z", "content": "The Department of Trade, Industry and Competition (DTIC) has published anti-dumping protection levies on the importation of tyres into South Africa in terms of section 57A of the Customs and Excise A… [+2951 chars]"}]}