{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Lunar Reconnaissance Orbiter Spies China's Chang'e 6 Spacecraft on Far Side of the Moon - SciTechDaily", "description": "NASA's Lunar Reconnaissance Orbiter photographed China's Chang'e 6 on the Moon, revealing its location on a crater within the geologically rich Apollo basin, characterized by ancient basaltic flows. NASA’s LRO (Lunar Reconnaissance Orbiter) imaged China’s Cha…", "url": "https://scitechdaily.com/nasas-lunar-reconnaissance-orbiter-spies-chinas-change-6-spacecraft-on-far-side-of-the-moon/", "urlToImage": "https://scitechdaily.com/images/NASA-Lunar-Reconnaissance-Orbiter-Chinas-Change-6-Lander.jpg", "publishedAt": "2024-06-18T08:25:55Z", "content": "This image from NASA’s Lunar Reconnaissance Orbiter Camera shows China’s Chang’e 6 in the Apollo basin on the lunar farside on June 7, 2024. The lander is seen as the small cluster of bright pixels i… [+4530 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Technology giant Apple scraps its Pay Later loan scheme in US - BBC.com", "description": "It marks a retreat for the technology giant from plans to offer traditional financial services.", "url": "https://www.bbc.com/news/articles/c255y82y9x8o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/02cc/live/b7a8e3f0-2d2a-11ef-b511-b95abae5bf80.jpg", "publishedAt": "2024-06-18T04:50:41Z", "content": "Apple is ending its in-house buy now, pay later scheme in the US, which it launched just last year.\r\nThe technology giant says it will now offer customers payment plans through third-party credit and… [+1170 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tyler Rohr, Ali Mashayek, Sophie Meyjes", "title": "Marine CO₂ removal technologies could depend on the appetite of the ocean's tiniest animals - Phys.org", "description": "As the world struggles to decarbonize, it's becoming increasingly clear we'll need to both rapidly reduce emissions and actively remove carbon dioxide (CO2) from the atmosphere. The latest Intergovernmental Panel on Climate Change report considered 230 pathwa…", "url": "https://phys.org/news/2024-06-marine-technologies-appetite-ocean-tiniest.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/marine-co-removal-tech.jpg", "publishedAt": "2024-06-17T16:20:38Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+7204 chars]"}]}