{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Paleontological Mystery: New Study Reveals That Ammonoids Thrived Until Their Sudden Extinction - SciTechDaily", "description": "A recent study utilized museum collections to chart global ammonite diversity prior to their complete extinction. The findings reveal that ammonites were not declining before they perished alongside non-avian dinosaurs 66 million years ago. A new study publis…", "url": "https://scitechdaily.com/paleontological-mystery-new-study-reveals-that-ammonoids-thrived-until-their-sudden-extinction/", "urlToImage": "https://scitechdaily.com/images/Ammonites-Basking-Under-the-Late-Cretaceous-Sun.jpg", "publishedAt": "2024-07-07T21:14:34Z", "content": "A new study challenges the view that ammonoids were declining before their extinction 66 million years ago, showing instead that they remained diverse and robust globally. This research highlights th… [+5523 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Zo Ahmed", "title": "NASA snaps images of an asteroid large enough to have a moon of its own - TechSpot", "description": "Initially discovered in 2011 by the NASA-funded Catalina Sky Survey in Tucson as it passed by, this giant space boulder is estimated to be around a mile...", "url": "https://www.techspot.com/news/103701-nasa-snaps-images-asteroid-large-enough-have-moon.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/07/2024-07-07-image-4.jpg", "publishedAt": "2024-07-07T13:32:00Z", "content": "What just happened? NASA struck gold late last month when it snapped a hefty asteroid cruising by Earth, giving us an up-close look at the rock--and its mini-moon tagging along. The images, captured … [+2777 chars]"}, {"source": {"id": null, "name": "Benzinga"}, "author": "Benzinga India Staff", "title": "IREDA, HCLTech And 3 Tata Stocks Are Set To Report Q1 Earnings Next Week - Benzinga India", "description": "Tata Consultancy Services, IREDA, Tata Elxsi, DMart, and Delta Corp are some of the companies that are scheduled to post their earnings next week.", "url": "https://in.benzinga.com/content/39656247/ireda-hcltech-and-3-tata-stocks-are-set-to-report-q1-earnings-next-week", "urlToImage": "https://cdn.benzinga.com/files/images/story/2024/07/07/earnings.jpeg?width=1200&height=800&fit=crop", "publishedAt": "2024-07-07T11:17:24Z", "content": "Tata Consultancy Services, IREDA, Tata Elxsi, HCLTech, DMart, and Delta Corp are some of the companies that are scheduled to post their earnings next week.\r\nThe first would be Delta Corp. The company… [+1744 chars]"}]}