{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "COLOSSAL 180-foot asteroid speeding towards Earth at 81907 kmph today, NASA warns - HT Tech", "description": "NASA has issued a warning regarding an asteroid that is rushing towards a very close approach to Earth. This 180-foot wide asteroid has been named 2023 HZ4.", "url": "https://tech.hindustantimes.com/tech/news/colossal-180-foot-asteroid-speeding-towards-earth-at-81907-kmph-today-nasa-warns-71683196191393.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/04/1600x900/asteroid-6155562_640_1683023354133_1683196353840.jpg", "publishedAt": "2023-05-04T10:33:14Z", "content": "An enormous asteroid is currently headed towards Earth, and what's concerning is that it's predicted to come perilously close! According to NASA's Jet Propulsion Laboratory, three asteroids are due t… [+1763 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Witness a Star Devouring a Planet – “We Are Seeing the Future of the Earth” - SciTechDaily", "description": "Earth will meet a similar fate in 5 billion years. As a star runs out of fuel, it will billow out to a million times its original size, engulfing any matter — and planets — in its wake. Scientists have observed hints of stars just before, and shortly after, t…", "url": "https://scitechdaily.com/astronomers-witness-a-star-devouring-a-planet-we-are-seeing-the-future-of-the-earth/", "urlToImage": "https://scitechdaily.com/images/Doomed-Planet-Skimming-Star-Surface-scaled.jpg", "publishedAt": "2023-05-04T08:19:38Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyMay 4, 2023\r\nThis artists impression shows a doomed planet skimming the surface of its star. Astronomers used a combination of telescopes to spot … [+9134 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Navdeep Singh", "title": "Sensex, Nifty trade flat as US Fed hikes rate - Economic Times", "description": "From the Sensex pack, Tata Steel, L&T, Bajaj Finance, Nestle, NTPC, TCS and Tata Motors opened with gains, while HCL Tech, Tech Mahindra, Power Grid, and ICICI Bank opened with cuts. Shares of ABB India rose over 4% after its Q4 earnings. GR Infraprojects gai…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-trade-flat-as-us-fed-hikes-rate/articleshow/99975666.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99975657,width-1070,height-580,imgsize-58226,overlay-etmarkets/photo.jpg", "publishedAt": "2023-05-04T04:12:00Z", "content": "After the Federal Reserve raised its benchmark lending rate by 25 bps again to cool inflation, Indian equity indices opened flat on Thursday as gains from index heavyweight TCS and HDFC were offset b… [+2934 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Quantum Secret: Link Discovered Between Photosynthesis and “Fifth State of Matter” - SciTechDaily", "description": "University of Chicago scientists hope ‘islands’ of exciton condensation may point way to new discoveries. Scientists at the University of Chicago have found a connection between photosynthesis and exciton condensates, a state of physics that allows energy to …", "url": "https://scitechdaily.com/?p=274098", "urlToImage": "https://scitechdaily.com/images/Photosynthesis-Energy-Concept.jpg", "publishedAt": "2023-05-04T03:54:41Z", "content": "ByLouise Lerner, University of ChicagoMay 3, 2023\r\nA University of Chicago study found links at the atomic level between photosynthesis and exciton condensatesa strange state of physics that allows e… [+7242 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "Disease detectives gathered at CDC event—a COVID outbreak erupted - Ars Technica", "description": "Some attendees reportedly did not mask, distance, or take other precautions.", "url": "https://arstechnica.com/science/2023/05/disease-detectives-gathered-at-cdc-event-a-covid-outbreak-erupted/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2020/05/GettyImages-1207345894-760x380.jpg", "publishedAt": "2023-05-03T20:53:15Z", "content": "69 with \r\nDisease detectives with the Centers for Disease Control and Prevention are on the case of a new COVID-19 outbreakthe one at their very own conference, which has sickened around 35 attendees… [+3870 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Double Danger for Young Women: High Risk of Rehospitalization After Heart Attack - SciTechDaily", "description": "NIH-supported findings identify risk factors in women and suggest the need for closer monitoring. A study funded by the National Institutes of Health shows that women aged 55 and younger are nearly twice as likely to be rehospitalized within a year of a heart…", "url": "https://scitechdaily.com/?p=273871", "urlToImage": "https://scitechdaily.com/images/Woman-Heart-Attack.jpg", "publishedAt": "2023-05-03T08:23:40Z", "content": "Women aged 55 and younger face nearly twice the risk of rehospitalization in the year following a heart attack compared to similarly aged men, as per a study supported by the National Institutes of H… [+6262 chars]"}]}