{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Mysterious New Objects Beyond the Edge of the Solar System - SciTechDaily", "description": "The Subaru Telescope has discovered new objects beyond the known Kuiper Belt, suggesting a more complex structure at the edge of the Solar System. This finding could reshape our understanding of planet formation and boost the search for life outside Earth. Us…", "url": "https://scitechdaily.com/?p=424651", "urlToImage": "https://scitechdaily.com/images/Kuiper-Belt-Object-Art-Concept.jpg", "publishedAt": "2024-10-27T03:55:48Z", "content": "Observations with the Subaru Telescope have uncovered new objects in the outer Solar System, suggesting a larger, undiscovered population beyond the Kuiper Belt. This discovery reshapes our understan… [+6171 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "We took on Google and forced them to pay out £2bn - BBC.com", "description": "Shivaun Raff and her husband, Adam, describe their long court battle with technology giant Google.", "url": "https://www.bbc.com/news/articles/cjr431lr72jo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6f37/live/9aeebb30-92d9-11ef-9e9f-f94aa162b9ae.jpg", "publishedAt": "2024-10-26T23:29:05Z", "content": "Shivaun Raff and her husband, Adam, have been locked in a long-running legal battle with Google\r\n\"Google essentially disappeared us from the internet.\"\r\nLaunch days. Theyre equal parts thrilling and … [+6723 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Apple wins $250 from Masimo in watch patent trial - TechCrunch", "description": "A federal jury ruled Friday that Masimo smartwatches infringed Apple patents, but Apple isn’t getting a big payday. Bloomberg Law reports that the company", "url": "https://techcrunch.com/2024/10/26/apple-wins-250-from-masimo-in-watch-patent-trial/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/09/CMC_7967.jpg?resize=1200,800", "publishedAt": "2024-10-26T19:53:20Z", "content": "A federal jury ruled Friday that Masimo smartwatches infringed Apple patents, but Apple isnt getting a big payday.\r\nBloomberg Law reports that the company was only seeking the statutory minimum of $2… [+1352 chars]"}]}