{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Google to bring AI-powered smartphone revolution? Know what's coming to you - HT Tech", "description": "Google's upcoming Android 14 is set to revolutionise smartphones with innovative AI features, including generative AI to offer a personalised and seamless user experience.", "url": "https://tech.hindustantimes.com/tech/news/google-to-bring-ai-powered-smartphone-revolution-know-whats-coming-to-you-71690798968222.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/31/1600x900/GOOGLE_1690799204447_1690799204743.JPG", "publishedAt": "2023-07-31T10:29:25Z", "content": "Google's next milestone in the world of smartphones is set to be a game-changer. The tech giant is poised to launch Android 14, featuring a plethora of Artificial Intelligence (AI) capabilities. At t… [+3135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Milky Way's Disco Ball: Hubble Captures Glittering Globular Cluster in Sagittarius - SciTechDaily", "description": "In a stunning image from the Hubble Space Telescope, the globular cluster NGC 6652 glimmers with the light of countless stars. The glittering, glitzy contents of the globular cluster NGC 6652 sparkle in this star-studded image from the Hubble Space Telescope.…", "url": "https://scitechdaily.com/the-milky-ways-disco-ball-hubble-captures-glittering-globular-cluster-in-sagittarius/", "urlToImage": "https://scitechdaily.com/images/Globular-Cluster-NGC-6652.jpg", "publishedAt": "2023-07-31T06:14:59Z", "content": "ByESA/HubbleJuly 30, 2023\r\nThis striking image from the Hubble Space Telescope reveals the globular cluster NGC 6652, located within our Milky Way galaxy. A product of the work of two distinct teams … [+2986 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "CGTN", "title": "Human life expectancy can increase to 120 years: study - CGTN", "description": "Human lifespan is expected to increase to up to 120 years within decades thanks to technologies such as artificial intelligence (AI) and knowledge gained from the COVID-19 pandemic, Swedish Television reported on Sunday.", "url": "https://news.cgtn.com/news/2023-07-31/Human-life-expectancy-can-increase-to-120-years-study-1lSCa5I3zkk/index.html", "urlToImage": "https://news.cgtn.com/news/2023-07-31/Human-life-expectancy-can-increase-to-120-years-study-1lSCa5I3zkk/img/e0bbafbdac004e6b9d67bd4dea73179a/e0bbafbdac004e6b9d67bd4dea73179a-750.jpeg", "publishedAt": "2023-07-31T02:26:44Z", "content": "Human lifespan is expected to increase to up to 120 years within decades, thanks to technologies such as artificial intelligence (AI) and knowledge gained from the COVID-19 pandemic, Swedish Televisi… [+1524 chars]"}]}