{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Last Spark: Consciousness in the Dying Brain Unveiled - SciTechDaily", "description": "New research finds intriguing brain wave patterns in comatose patients who died following cardiac arrest. Reports of near-death experiences—with tales of white light, visits from departed loved ones, hearing voices, among other attributes—capture our imaginat…", "url": "https://scitechdaily.com/?p=273522", "urlToImage": "https://scitechdaily.com/images/Spirituality-and-Cosmic-Energy.jpg", "publishedAt": "2023-05-02T08:23:40Z", "content": "A small study has provided initial evidence of heightened activity in the brain during the process of dying, potentially related to consciousness. The research observed four patients in comatose stat… [+4729 chars]"}, {"source": {"id": null, "name": "Adda247.com"}, "author": "piyush", "title": "IIT Madras researchers develop machine learning tool to detect tumour in brain, spinal cord - Adda247", "description": "IIT-Madras Researchers Develop Computational Tool to Detect Cancer-Causing Tumours in the Brain and Spinal Cord: Researchers at the Indian Institute of Technology Madras have developed a machine learning-based computational tool called GBMDriver to improve th…", "url": "https://currentaffairs.adda247.com/iit-madras-researchers-develop-machine-learning-tool-to-detect-tumour-in-brain-spinal-cord/", "urlToImage": "https://wpassets.adda247.com/wp-content/uploads/multisite/sites/5/2023/05/02115517/IIT-Madras-researchers-1-e1682924113277.jpg", "publishedAt": "2023-05-02T06:34:49Z", "content": "Researchers at the Indian Institute of Technology Madras have developed a machine learning-based computational tool called GBMDriver to improve the detection of cancer-causing tumours in the brain an… [+1798 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Webb finds water vapor around a rocky exoplanet - Tech Explorist", "description": "Water vapor in an atmosphere on a hot rocky planet would represent a major breakthrough for exoplanet science.", "url": "https://www.techexplorist.com/webb-finds-water-vapor-around-a-rocky-exoplanet/59715/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/GJ-486-b.jpg", "publishedAt": "2023-05-02T06:25:44Z", "content": "While studying a rocky exoplanet known as GJ 486 b, NASA‘s James Webb Space Telescope- using its Webb’s Near-Infrared Spectrograph (NIRSpec)- detected signals of water vapor. GJ 486 b is too close to… [+4179 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid 2023 HV5 to come as close to Earth as the Moon! NASA issues alert - HT Tech", "description": "The asteroid will approach Earth for its closest approach tomorrow, May 3. Know all details such as speed, distance and more, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2023-hv5-to-come-as-close-to-earth-as-the-moon-nasa-issues-alert-71683002033980.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid_1683002420925_1683002421133.jpg", "publishedAt": "2023-05-02T04:40:53Z", "content": "Whenever an asteroid's orbit brings it near a planet, the planet's gravitational pull can sometimes force it to go astray. When these space rocks come near Earth for close approach, most of them burn… [+1909 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "How A.I. is making brain cancer diagnosis faster than before - NBC News", "description": "New A.I. technology can find biomarkers of a cancerous tumor in just three minutes compared to three weeks with normal technology.» Subscribe to NBC News: ht...", "url": "https://www.youtube.com/watch?v=Bcgms_xkpSg", "urlToImage": "https://i.ytimg.com/vi/Bcgms_xkpSg/maxresdefault.jpg", "publishedAt": "2023-05-02T03:30:02Z", "content": null}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Mark Gurman", "title": "Samsung Bans Generative AI Use by Staff After ChatGPT Data Leak - Bloomberg", "description": "Samsung Electronics Co. is banning employee use of popular generative AI tools like ChatGPT after discovering staff uploaded sensitive code to the platform, dealing a setback to the spread of such technology in the workplace.", "url": "https://www.bloomberg.com/news/articles/2023-05-02/samsung-bans-chatgpt-and-other-generative-ai-use-by-staff-after-leak", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i1DwHhgTOV9Q/v0/1200x808.jpg", "publishedAt": "2023-05-02T00:48:00Z", "content": "Samsung Electronics Co. is banning employee use of popular generative AI tools like ChatGPT after discovering staff uploaded sensitive code to the platform, dealing a setback to the \r\nspread of such … [+454 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This asteroid will come alarmingly close to Earth! NASA clocks it at 32152 kmph - HT Tech", "description": "Earth is set for a dangerously close encounter with an asteroid on May 3, NASA has warned.", "url": "https://tech.hindustantimes.com/tech/news/this-asteroid-will-come-alarmingly-close-to-earth-nasa-clocks-it-at-32152-kmph-71682957829609.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/asteroid-6099696_1280_1682570598551_1682957957749.jpg", "publishedAt": "2023-05-01T16:19:38Z", "content": "A 100-feet wide asteroid just passed Earth, but there is another space rock on the way and it is set to make quite a scary encounter with our planet. NASA's Jet Propulsion Laboratory has issued an al… [+1699 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Daniel Lawler", "title": "Scientists use brain scans and AI to 'decode' thoughts - Tech Xplore", "description": "Scientists said Monday they have found a way to use brain scans and artificial intelligence modeling to transcribe \"the gist\" of what people are thinking, in what was described as a step towards mind reading.", "url": "https://techxplore.com/news/2023-05-scientists-brain-scans-ai-decode.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/the-fmri-machine-scans.jpg", "publishedAt": "2023-05-01T15:18:48Z", "content": "Scientists said Monday they have found a way to use brain scans and artificial intelligence modeling to transcribe \"the gist\" of what people are thinking, in what was described as a step towards mind… [+4598 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 1 May 2023: The Great Carina Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is NGC 3372, also known as the Great Carina Nebula which is located in the constellation of Carina.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-1-may-2023-the-great-carina-nebula-71682931600468.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/01/1600x900/carina_nebula_1682931649743_1682931649948.jpg", "publishedAt": "2023-05-01T09:02:52Z", "content": "A Nebula can contain as few as ten stars or as many as millions of stars, according to NASA. Although most nebulae belong to just three types - spherical, elliptical and bipolar, some of them might b… [+1811 chars]"}]}