{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stanford Identifies 6 Types of Depression: Could a Brain Scan Reveal the Best Treatment for You? - SciTechDaily", "description": "A Stanford Medicine study reveals six subtypes of depression, identified through brain imaging and machine learning. These subtypes exhibit unique brain activity patterns, helping predict which patients will benefit from specific antidepressants or behavioral…", "url": "https://scitechdaily.com/stanford-identifies-6-types-of-depression-could-a-brain-scan-reveal-the-best-treatment-for-you/", "urlToImage": "https://scitechdaily.com/images/Types-of-Depression-Art-Concept.jpg", "publishedAt": "2024-06-17T09:00:47Z", "content": "Researchers at Stanford Medicine have identified six biological subtypes of depression using brain imaging and machine learning, paving the way for precision psychiatry. Results indicate that certain… [+8873 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "NSAs Ajit Doval, Jake Sullivan talk advanced materials and tech in iCET dialogue - Hindustan Times", "description": "NSA Jake Sullivan also met External Affairs Minister Dr. S. Jaishankar earlier today. He is also expected to call on the Prime Minister. | Latest News India", "url": "https://www.hindustantimes.com/india-news/nsas-doval-sullivan-talk-advanced-materials-and-tech-in-icet-dialogue-101718609377590.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/17/1600x900/NSA_new_1718609489674_1718609493895.jpg", "publishedAt": "2024-06-17T07:32:23Z", "content": "United States' National Security Adviser Jake Sullivan, who is on a two-day official visit to New Delhi, met India's National Security Adviser Ajit Doval today.\r\nJake Sullivan meeting with NSA Ajit D… [+2625 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Aishwarya Panda", "title": "Samsung Galaxy Unpacked event date revealed: From new foldable smartphones to wearables, know what’s coming - HT Tech", "description": "The Samsung Galaxy Unpacked event to take place on July 10, 2024, Know what new devices may debut in the event.", "url": "https://tech.hindustantimes.com/tech/news/samsung-galaxy-unpacked-event-date-revealed-from-new-foldable-smartphones-to-wearables-know-what-s-coming-71718604040633.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/17/1600x900/fold_2_1690372677586_1718604079895.png", "publishedAt": "2024-06-17T06:25:29Z", "content": "Samsung fans have been waiting for the Galaxy Unpacked event which is yet to be announced officially. The excitement about the event comes from the launch of new generation foldables and wearables. W… [+2313 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Find: Webb Discovers Mystery Sulfur on Distant Planet - SciTechDaily", "description": "GJ 3470 b is a gas dwarf with unexpected sulfur dioxide in its atmosphere. This discovery provides insights into planet formation and chemical reactions. A surprising yellow haze of sulfur dioxide in the atmosphere of a gas “dwarf” exoplanet about 96 light ye…", "url": "https://scitechdaily.com/unexpected-find-webb-discovers-mystery-sulfur-on-distant-planet/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-GJ-3470-b.jpg", "publishedAt": "2024-06-17T00:57:32Z", "content": "The sulfur-laden atmosphere discovered on gaseous exoplanet GJ 3470 b, shown here in an illustration orbiting its star in the constellation Cancer, could help researchers figure out how it (and simil… [+5332 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Echoes of Creation: The Roman Telescope's Quest for Primordial Black Holes - SciTechDaily", "description": "NASA's Nancy Grace Roman Space Telescope might reveal previously undetected \"featherweight\" black holes with masses similar to Earth's. These primordial black holes, formed in the early universe, could significantly impact our understanding of astronomy and p…", "url": "https://scitechdaily.com/echoes-of-creation-the-roman-telescopes-quest-for-primordial-black-holes/", "urlToImage": "https://scitechdaily.com/images/Primordial-Black-Holes-scaled.jpg", "publishedAt": "2024-06-16T20:21:16Z", "content": "The upcoming Roman Space Telescope may unveil a new class of “featherweight” black holes, challenging existing theories of black hole formation. These Earth-mass black holes, if found, could have sig… [+7244 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Starliner's Return Delayed Again: What's Next for the Spacecraft? - SciTechDaily", "description": "NASA and Boeing have postponed the return of the Starliner crew from the ISS to June 22, allowing more time for departure preparations. Meanwhile, extensive testing on Starliner's capabilities continues, including a 'hot fire test' of its thrusters. NASA and …", "url": "https://scitechdaily.com/starliners-return-delayed-again-whats-next-for-the-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Boeings-CST-100-Starliner-Crew-Ship-Approaches-International-Space-Station-scaled.jpg", "publishedAt": "2024-06-15T17:57:35Z", "content": "Boeing’s CST-100 Starliner crew ship approaches the International Space Station on May 20, 2022, on the company’s Orbital Flight Test-2 mission before automatically docking to the Harmony module’s fo… [+4038 chars]"}]}