{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! Unstable sunspot takes aim at the Earth; NOAA reveals incoming danger - HT Tech", "description": "An unstable sunspot is directly facing the Earth and is crackling with solar flares. NOAA has issued a warning for a solar flare eruption that can lead to a powerful solar storm strike on our planet.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-unstable-sunspot-takes-aim-at-the-earth-noaa-reveals-incoming-danger-71696318894053.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/03/1600x900/solar-flare-67532_1920_1_1663740280289_1696318945255.jpg", "publishedAt": "2023-10-03T07:49:24Z", "content": "While the Earth has escaped solar storms lately, it has been riddled with radio blackouts owing to solar flare eruptions that send extreme ultraviolet radiation toward our planet. Just yesterday, an … [+2816 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid bigger than Brooklyn Bridge hurtling towards Earth today! NASA reveals stats - HT Tech", "description": "A mammoth, bridge-sized asteroid is hurtling towards Earth and it is expected to pass by the planet by a very close margin today, October 3. Check the details of this close encounter.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-bigger-than-brooklyn-bridge-hurtling-towards-earth-today-nasa-reveals-stats-71696307853245.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/03/1600x900/g503bfe0360_1695895922599_1696308051496.jpg", "publishedAt": "2023-10-03T04:41:17Z", "content": "Over the course of Earth's 4.5 billion-year-old history, there have been several major asteroid impacts that have had a significant impact on the future of the planet and helped humanity to emerge as… [+2216 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Perseverance Rover Captures 200-Foot-Wide Dust Devil Tearing Across Mars - SciTechDaily", "description": "The six-wheeled geologist spotted the twister as part of an atmospheric exploration of Jezero Crater. The lower portion of a Martian dust devil was captured moving along the western rim of Mars’ Jezero Crater by NASA’s Perseverance rover on August 30, 2023, t…", "url": "https://scitechdaily.com/?p=314038", "urlToImage": "https://scitechdaily.com/images/Martian-Dust-Devil-NASA-Perseverance-Mars-Rover.jpg", "publishedAt": "2023-10-03T01:52:46Z", "content": "ByJet Propulsion LaboratoryOctober 2, 2023\r\nNASAs Perseverance rover captured this Martian dust devil moving east to west at a clip of about 12 mph (19 kph) along a location called Thorofare Ridge in… [+4721 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Codes for October 3: Unlock emotes, outfits, and more - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for October 3: Players can earn amazing in-game items for free with the help of these codes! Check them out below.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-codes-for-october-3-unlock-emotes-outfits-and-more-71696295715729.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/03/1600x900/Garena_FF_Max_1646187536940_1696295891535.jpg", "publishedAt": "2023-10-03T01:21:15Z", "content": "Garena Free Fire MAX Redeem Codes for October 3: In Free Fire, there are some cool events coming up that let you get some awesome stuff for your game. These events are all about making your game bett… [+2332 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Staff", "title": "Ethical dilemma: Do computers with lab-grown brains have moral rights? - Study Finds", "description": "Bio-computing has arrived. This next step in technology uses biological parts as hardware in new computational devices -- essentially a computer with a brain.", "url": "https://studyfinds.org/brain-computers-moral-rights/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2023/10/AdobeStock_613598295-scaled.jpeg", "publishedAt": "2023-10-02T21:17:04Z", "content": "MELBOURNE, Australia — In a revolutionary leap from the pages of science fiction, “bio-computing” has arrived. This next step in technology uses biological parts as hardware in new computational devi… [+4058 chars]"}]}