{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "AZoRobotics"}, "author": null, "title": "IBM and NASA Join Hands to Extract Insights from Earth Observations Using AI Technology - AZoRobotics", "description": "IBM and NASA's Marshall Space Flight Center today announce a collaboration to use IBM's artificial intelligence (AI) technology to discover new insights in NASA's massive trove of Earth and geospatial science data.", "url": "https://www.azorobotics.com/News.aspx?newsID=13563", "urlToImage": "https://dp9eps5gd5xd0.cloudfront.net/images/news/ThumbForNews_13563_16753392927823198.jpg", "publishedAt": "2023-02-02T13:11:00Z", "content": "IBM and NASA's Marshall Space Flight Center today announce a collaboration to use IBM's artificial intelligence (AI) technology to discover new insights in NASA's massive trove of Earth and geospatia… [+3941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "New nanoscience could present a massive leap for photonic quantum computing - The Indian Express", "description": "Researchers have developed a nanoscopic technology that could present a massive leap for \"photonic quantum computing\" — they have successfully managed to get two entangled quantum light sources.", "url": "https://indianexpress.com/article/technology/photonic-quantum-computing-entangled-light-sources-8420399/", "urlToImage": "https://images.indianexpress.com/2023/02/Quantum-entangled-light-20230202.jpg", "publishedAt": "2023-02-02T12:07:14Z", "content": "In a major breakthrough, researchers at the University of Copenhagen and Ruhr University have figured out how to control two quantum light sources rather than one. While a small step up from one to t… [+4127 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Revolutionary New Physics Hypothesis: Three Time Dimensions, One Space Dimension - SciTechDaily", "description": "How would our world be perceived by observers moving faster than light in a vacuum? According to theorists from Warsaw and Oxford universities, such a view would differ from what we encounter daily, with the presence of not only spontaneous phenomena but also…", "url": "https://scitechdaily.com/a-revolutionary-new-physics-hypothesis-three-time-dimensions-one-space-dimension/", "urlToImage": "https://scitechdaily.com/images/Clock-Time-Relativity-Concept-Art.jpg", "publishedAt": "2023-02-02T11:48:01Z", "content": "The researchers hope that their findings will contribute to a better understanding of the phenomenon of spontaneous symmetry breaking associated with the mass of the Higgs particle and other particle… [+6538 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cosmic Breakthrough: Accurate New Map of All the Matter in the Universe Released - SciTechDaily", "description": "Analysis combines Dark Energy Survey and South Pole Telescope data to understand evolution of universe. Sometimes to know what the matter is, you have to find it first. When the universe began, matter was flung outward and gradually formed the planets, stars,…", "url": "https://scitechdaily.com/cosmic-breakthrough-accurate-new-map-of-all-the-matter-in-the-universe-released/", "urlToImage": "https://scitechdaily.com/images/Big-Bang-Expanding-Universe-Concept.jpg", "publishedAt": "2023-02-02T10:25:30Z", "content": "ByLouise Lerner, University of ChicagoFebruary 2, 2023\r\nA team of scientists, comprising experts from the University of Chicago and Fermi National Accelerator Laboratory, have made a game-changing an… [+6057 chars]"}, {"source": {"id": null, "name": "TODAYonline"}, "author": null, "title": "ChatGPT vs human: How a S'pore professor could tell which essays were written by a reporter or the chatbot - TODAY", "description": "SINGAPORE — In December, one of my more tech-savvy friends asked if I wanted him to generate a story about me using artificial intelligence (AI). As a writer, I was naturally intrigued, so I agreed.", "url": "https://www.todayonline.com/singapore/chatgpt-vs-human-professor-reporter-2100626", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--ff1-VRgD--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/tdy/image/2023/02/02/20230119_am_aichatbot.jpg?itok=HFukmqGn", "publishedAt": "2023-02-02T09:29:00Z", "content": "Assoc Prof Sherwood found similar issues in the essays.\r\nThe first was filled with diction fluctuations, too much repetition and other issues. It read like the first draft of an essay\".\r\nThis was not… [+1906 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "Hyundai launches 2023 Creta & Alcazar with added safety tech - Team-BHP", "description": "Hyundai has announced the launch of the Creta and Alcazar for the 2023 model year. The updated SUVs now come with a host of active and passive safety features as standard. The 2023 Creta and Alcazar get 6 airbags in total, including driver, passenger, side an…", "url": "https://www.team-bhp.com/news/hyundai-launches-2023-creta-alacazar-added-safety-tech", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/01-SUV Key Visual 2x1.jpg", "publishedAt": "2023-02-02T08:34:28Z", "content": "Hyundai has announced the launch of the Creta and Alcazar for the 2023 model year. The updated SUVs now come with a host of active and passive safety features as standard.\r\nThe 2023 Creta and Alcazar… [+956 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Advanced Remote Soil Carbon Sequestration and Emissions Measurement - AZoCleantech", "description": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering, costs, precision, and availability. Carbon sequestration an…", "url": "https://www.azocleantech.com/article.aspx?ArticleID=1655", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/Article_Images/ImageForArticle_1655_16753236478707967.jpg", "publishedAt": "2023-02-02T07:43:00Z", "content": "Carbon (C) in soil is essential for reducing and responding to climate change worldwide. The measurement of in-situ soil carbon sequestration encounters several challenges, including aerial covering,… [+7165 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "Dashveenjit Kaur", "title": "IBM and NASA are collaborating to study the impact of climate change using AI - Tech Wire Asia", "description": "The joint work will apply AI foundation model technology by IBM to NASA's Earth-observing satellite data for the first time.", "url": "https://techwireasia.com/2023/02/ibm-and-nasa-are-collaborating-to-study-the-impact-of-climate-change-using-ai/", "urlToImage": "https://techwireasia.com/wp-content/uploads/2023/02/shutterstock_409229497-e1675313736477.jpg", "publishedAt": "2023-02-02T04:02:36Z", "content": "<ul><li>The joint work will apply AI foundation model technology by IBM to NASA’s Earth-observing satellite data for the first time.</li><li>The collaboration has the potential to quickly advance the… [+4503 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I tried using a smart lock for a week – here's how it went - AsiaOne", "description": "\"What's the point of all this?\" Those were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\". In the clip, almost everything in her home was powered by technology an…", "url": "https://www.asiaone.com/digital/i-tried-using-smart-door-lock-week-heres-how-it-went-aqara-zigbee-a100", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/20230102_smart_lock_aqara.jpg?h=efed96af&itok=s0FOS7mc", "publishedAt": "2023-02-02T04:00:00Z", "content": "\"What's the point of all this?\"\r\nThose were my exact thoughts two years ago when I saw a viral TikTok clip of a woman who had just given a brief tour of her newly refurbished \"smart home\".\r\nIn the cl… [+6893 chars]"}, {"source": {"id": null, "name": "Technewsspace.com"}, "author": null, "title": "Improvements To Parkour, Combat System And The Second Plot Addition: Techland Spoke About The Development Plan For Dying Light 2 In 2023 - Tech News Space", "description": "As promised, as part of Dying Light 2 Stay Human 1st Anniversary Direct broadcasts Studio Techland revealed what open-world zombie action users can expect", "url": "https://technewsspace.com/improvements-to-parkour-combat-system-and-the-second-plot-addition-techland-spoke-about-the-development-plan-for-dying-light-2-in-2023/", "urlToImage": "https://i0.wp.com/technewsspace.com/wp-content/uploads/2023/02/Improvements-to-parkour-combat-system-and-the-second-plot-addition.jpg", "publishedAt": "2023-02-01T18:33:12Z", "content": "As promised, as part of Dying Light 2 Stay Human 1st Anniversary Direct broadcasts Studio Techland revealed what open-world zombie action users can expect this year.\r\nImage source: Techland\r\nThe anni… [+1480 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Could a Nuclear Thermal Rocket Engine Power a Trip to Mars? NASA and DARPA Are Testing - SciTechDaily", "description": "NASA and the Defense Advanced Research Projects Agency (DARPA) recently announced a collaboration to demonstrate a nuclear thermal rocket engine in space, an enabling capability for NASA crewed missions to Mars. NASA and DARPA will partner on the Demonstratio…", "url": "https://scitechdaily.com/could-a-nuclear-thermal-rocket-engine-power-a-trip-to-mars-nasa-and-darpa-are-testing/", "urlToImage": "https://scitechdaily.com/images/Mars-Transit-Habitat-and-Nuclear-Propulsion-System-scaled.jpg", "publishedAt": "2023-02-01T13:46:57Z", "content": "ByNASAFebruary 1, 2023\r\nArtist concept of Demonstration for Rocket to Agile Cislunar Operations (DRACO) spacecraft, which will demonstrate a nuclear thermal rocket engine. Nuclear thermal propulsion … [+6332 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:08:55Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}]}