{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Never-seen-before! NASA's Hubble Space Telescope reveals why Saturn's atmosphere is heating up - HT Tech", "description": "NASA's Hubble Space Telescope has found the reason behind Saturn's atmosphere heating up.", "url": "https://tech.hindustantimes.com/tech/news/neverseenbefore-nasa-s-hubble-space-telescope-reveals-why-saturn-s-atmosphere-is-heating-up-71680262438322.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/31/1600x900/hubble_saturnlymanalpha_stsci-01gw30qm3c2wx3vhpp1a_1680262660605_1680262660775_1680262660775.png", "publishedAt": "2023-03-31T11:39:32Z", "content": "Earth's temperature is soaring mainly because of global warming. But, we cannot say the same for the other planets of our solar system. NASA's Hubble Space Telescope has figured out the reason behind… [+2156 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "An Aspherical “Cow” – Weird Explosion the Size of Our Solar System Baffles Astronomers - SciTechDaily", "description": "Astronomers have observed an explosion 180 million light-years away that challenges our current understanding of cosmic explosions, exhibiting a significantly flatter appearance than previously thought possible. Astronomers have observed an explosion 180 mill…", "url": "https://scitechdaily.com/?p=265147", "urlToImage": "https://scitechdaily.com/images/Slim-Boom-Space-Explosion-scaled.jpg", "publishedAt": "2023-03-31T08:25:09Z", "content": "Slim Boom. Credit: Phil Drury, University of Sheffield\r\nAstronomers have observed an explosion 180 million light-years away that challenges our current understanding of cosmic explosions, exhibiting … [+4269 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 31 March 2023: Saturn's moon Titan, which is bigger than Mercury - HT Tech", "description": "Today's NASA Astronomy Picture of the Day is a snapshot showing 6 faces of Titan, Saturn's largest Moon.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-31-march-2023-saturn-s-moon-titan-which-is-bigger-than-mercury-71680245383112.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/31/1600x900/nasa_1680245536541_1680245544541_1680245544541.jpg", "publishedAt": "2023-03-31T06:53:35Z", "content": "Titan, the biggest moon of Saturn, is the second largest moon in our solar system. It is an icy celestial body concealed by a golden hazy atmosphere. According to NASA, only Ganymede, the moon of Jup… [+2132 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Improving future electronic devices through oxide materials - Phys.org", "description": "National University of Singapore (NUS) physicists have demonstrated a new way of controlling Rashba interactions in oxide systems. Tuning and controlling Rashba interactions is a particularly promising technology, as it can potentially be integrated directly …", "url": "https://phys.org/news/2023-03-future-electronic-devices-oxide-materials.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/towards-improving-futu-1.jpg", "publishedAt": "2023-03-30T13:42:08Z", "content": "National University of Singapore (NUS) physicists have demonstrated a new way of controlling Rashba interactions in oxide systems. Tuning and controlling Rashba interactions is a particularly promisi… [+3671 chars]"}]}