{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "Elon Musk launches AI firm xAI as he looks to take on OpenAI - Reuters", "description": "Elon Musk, the billionaire entrepreneur, launched his long-teased artificial intelligence startup xAI on Wednesday, unveiling a team comprised of engineers from the same big U.S. technology firms that he hopes to challenge in his bid to build an alternative t…", "url": "https://www.reuters.com/technology/elon-musks-ai-firm-xai-launches-website-2023-07-12/", "urlToImage": "https://www.reuters.com/resizer/lEn0-qHGTSU-i4qE6S4qKCu9Mvc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/F2L5QKLKVRPQ3FFRDBRNR27HXY.jpg", "publishedAt": "2023-07-13T05:10:00Z", "content": "July 12 (Reuters) - Elon Musk, the billionaire entrepreneur, launched his long-teased artificial intelligence startup xAI on Wednesday, unveiling a team comprised of engineers from the same big U.S. … [+2677 chars]"}, {"source": {"id": null, "name": "Techpp.com"}, "author": "Utpal Raj", "title": "How to Enable and Use StandBy Mode on iPhone [iOS 17] - TechPP", "description": "StandBy mode turns your iPhone into an always-on smart display without consuming too much battery. Learn how to enable and use StandBy mode on iPhone running iOS 17.", "url": "https://techpp.com/2023/07/13/how-to-enable-and-use-standby-mode-on-iphone/", "urlToImage": "https://techpp.com/wp-content/uploads/2023/07/How-to-Enable-And-Use-StandBy-Mode-on-iPhone-1.jpg", "publishedAt": "2023-07-13T03:37:58Z", "content": "iOS 17 is the latest update that comes with a number of new features. Among these innovative new features, there is one that has attracted a lot of attention from iPhone users worldwide: the remarkab… [+12394 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Rover sampling finds organic molecules in water-altered rocks on Mars - Ars Technica", "description": "No clear implications for life, but some samples could be brought back to Earth.", "url": "https://arstechnica.com/science/2023/07/organic-chemicals-on-mars-are-associated-with-water-shaped-deposits/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/07/image-1-760x380.jpeg", "publishedAt": "2023-07-12T22:18:43Z", "content": "Enlarge/ Jezero crater shows clear signs of water-formed deposits, so it's not a surprise to find water-altered material there.\r\n13 with \r\nOrganic chemicals, primarily composed of carbon and hydrogen… [+4645 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking Dark Matter Mysteries Through Gravitational Waves - SciTechDaily", "description": "Gravitational waves from merging black holes could unveil the nature of dark matter, according to computer simulations presented at the 2023 National Astronomy Meeting. Using computer simulations, an international team of cosmologists has discovered that obse…", "url": "https://scitechdaily.com/unlocking-dark-matter-mysteries-through-gravitational-waves/", "urlToImage": "https://scitechdaily.com/images/Gravitational-Waves-Dark-Matter-Astrophysics-Illustration.jpg", "publishedAt": "2023-07-12T20:21:58Z", "content": "ByRoyal Astronomical SocietyJuly 12, 2023\r\nResearchers have revealed that the observation of gravitational waves from merging black holes may provide new insights into the nature of dark matter, acco… [+3753 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Swarm Intelligence in Space: NASA's Starling CubeSats Ready To Test Critical Technology - SciTechDaily", "description": "NASA’s Starling mission will test critical swarm technologies in space, highlighting the capabilities of autonomous spacecraft swarms. Through collaborations with academic institutions and small businesses, the mission aims to advance space exploration and st…", "url": "https://scitechdaily.com/swarm-intelligence-in-space-nasas-starling-cubesats-ready-to-test-critical-technology/", "urlToImage": "https://scitechdaily.com/images/NASA-Starling-Mission.jpg", "publishedAt": "2023-07-12T00:57:06Z", "content": "ByNASA Ames Research CenterJuly 11, 2023\r\nNASAs Starling mission will test new technologies for autonomous swarm navigation on four CubeSats in low-Earth orbit. Credit: Blue Canyon Technologies/NASA\r… [+5418 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Amazon Prime Day: How robots play an important role in shipping out packages - Yahoo Finance", "description": "#Amazon #youtube #stockmarket Yahoo Finance Tech Reporter Allie Garfinkle details how Amazon's mobility robots are helping to push out purchases, while also ...", "url": "https://www.youtube.com/watch?v=i8diWQms2HU", "urlToImage": "https://i.ytimg.com/vi/i8diWQms2HU/maxresdefault.jpg", "publishedAt": "2023-07-11T18:06:42Z", "content": null}]}