{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Chaos Unleashed: Surprising Breakthrough in Pursuit of Energy-Efficient Quantum Technologies - SciTechDaily", "description": "Magnetic topological insulators are an exotic class of materials that conduct electrons without any resistance at all and so are regarded as a promising breakthrough in materials science. Researchers from the Cluster of Excellence ct.qmat in Würzburg and Dres…", "url": "https://scitechdaily.com/quantum-chaos-unleashed-surprising-breakthrough-in-pursuit-of-energy-efficient-quantum-technologies/", "urlToImage": "https://scitechdaily.com/images/Ferromagnetic-Topological-Insulator-scaled.jpg", "publishedAt": "2023-03-24T09:31:15Z", "content": "ByUniversity of WürzburgMarch 24, 2023\r\nA team of researchers from the Cluster of Excellence ct.qmat based at the universities JMU Würzburg and TU Dresden has engineered the topological insulator man… [+7399 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "SURPRISE solar storm! G4-class geomagnetic storm hits the Earth, strongest in 6 years - HT Tech", "description": "The Earth has been hit with a surprise solar storm that no forecaster was able to see. The resultant effect was a severe G4-class geomagnetic storm. Know its impact.", "url": "https://tech.hindustantimes.com/tech/news/surprise-solar-storm-g4-class-geomagnetic-storm-hits-the-earth-strongest-in-6-years-71679647526188.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/24/1600x900/solar-flare-67532_1920_1_1663740280289_1679647551601_1679647551601.jpg", "publishedAt": "2023-03-24T08:50:03Z", "content": "For a couple of days, the Earth has been awaiting the solar winds that were released from a massive coronal hole in the atmosphere of the Sun. There were some concerns that a solar storm event so clo… [+2228 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Louise Lerner", "title": "Scientists discover easy way to make atomically-thin metal layers for new technology - Phys.org", "description": "The secret to a perfect croissant is the layers—as many as possible, each one interspersed with butter. Similarly, a new material with promise for new applications is made of many extremely thin layers of metal, between which scientists can slip different ion…", "url": "https://phys.org/news/2023-03-scientists-easy-atomically-thin-metal-layers.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/uchicago-scientists-di.jpg", "publishedAt": "2023-03-24T07:39:52Z", "content": "The secret to a perfect croissant is the layersas many as possible, each one interspersed with butter. Similarly, a new material with promise for new applications is made of many extremely thin layer… [+4363 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 24 March 2023: Comet ZTF and the stars of Milky Way - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is of Comet ZTF fading away in the sky.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-24-march-2023-comet-ztf-and-the-stars-of-milky-way-71679638100857.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/03/24/1600x900/comet_1679638274443_1679638282033_1679638282033.jpg", "publishedAt": "2023-03-24T06:13:27Z", "content": "Comets are of great interest to scientists as they are remnants of the early Solar System, providing valuable information about its composition and conditions. One of these is the Rare Green Comet ZT… [+1723 chars]"}]}