{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Tim Cook talks new Apple products and concerns about AI l GMA - Good Morning America", "description": "The CEO of Apple shares how the company’s latest innovations integrate AI technology and what users can expect the next time they update their devices.READ M...", "url": "https://www.youtube.com/watch?v=YmOC7dK3rc0", "urlToImage": "https://i.ytimg.com/vi/YmOC7dK3rc0/maxresdefault.jpg", "publishedAt": "2023-06-06T16:03:17Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Quantum visualization technique gives insight into photosynthesis - Phys.org", "description": "Systems obeying quantum mechanics are notoriously difficult to visualize, but researchers at the University of Illinois Urbana-Champaign have developed an illustration technique that displays quantum features in an easy-to-read diagram called a coherence map.…", "url": "https://phys.org/news/2023-06-quantum-visualization-technique-insight-photosynthesis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/quantum-visualization-1.jpg", "publishedAt": "2023-06-06T15:50:03Z", "content": "Systems obeying quantum mechanics are notoriously difficult to visualize, but researchers at the University of Illinois Urbana-Champaign have developed an illustration technique that displays quantum… [+3413 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "James Webb Telescope looks back in time, finds oldest organic molecules ever seen - HT Tech", "description": "These chemicals were found within a galaxy that originated when the universe was approximately 10% of its present age.", "url": "https://tech.hindustantimes.com/tech/news/james-webb-telescope-looks-back-in-time-finds-oldest-organic-molecules-ever-seen-71686062592623.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/06/1600x900/webb-space-telescope_1686063078472_1686063088349.jpg", "publishedAt": "2023-06-06T14:54:03Z", "content": "A groundbreaking study led by astronomers from Texas A&amp;M University using NASA's James Webb Space Telescope (JWST) has unveiled the existence of the oldest known complex organic molecules in the … [+2813 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Power of Exercise: Countering High Genetic Risk of Type 2 Diabetes - SciTechDaily", "description": "Can physical activity ‘fight off’ risk of type 2 diabetes? A University of Sydney study suggests high levels of physical activity can significantly lower the risk of developing type 2 diabetes, even for those with a high genetic risk. Over an hour of daily mo…", "url": "https://scitechdaily.com/?p=284104", "urlToImage": "https://scitechdaily.com/images/Health-Fitness-Painting.jpg", "publishedAt": "2023-06-06T13:42:18Z", "content": "ByUniversity of SydneyJune 6, 2023\r\nA new study has found a strong correlation between high levels of physical activity and a decreased risk of type 2 diabetes, even among individuals with a high gen… [+5754 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Potentially Hazardous 1500-foot asteroid hurtling towards Earth at fearsome pace! - HT Tech", "description": "NASA has issued an alert that a bridge-sized asteroid is on course to approach Earth soon! Check out its speed, distance, and other details, as revealed by the space agency.", "url": "https://tech.hindustantimes.com/tech/news/potentially-hazardous-1500-foot-asteroid-hurtling-towards-earth-at-fearsome-pace-71686026534327.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/06/1600x900/space-1728186_640_1685508037976_1686026611347.jpg", "publishedAt": "2023-06-06T04:43:56Z", "content": "NASA uses telescopes, such as Pans-STARRS1 in Maui, Hawaii, and Catalina Sky Survey near Tucson, Arizona, to detect near-Earth objects like asteroids and comets. To collect accurate information about… [+2154 chars]"}]}