{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Mangalyaan-2 mission: How ISRO’s second mission is uniquely different from NASA’s Mars Climate Orbiter - HT Tech", "description": "Mangalyaan2 mission How ISROs second mission is uniquely different from NASAs Mars Climate Orbiter ISRO is planning a second Mars Orbiter Mission which has been dubbed Mangalyaan2 mission. Know how this project is different from NASAs Mars Climate Orbiter. IS…", "url": "https://tech.hindustantimes.com/web-stories/mangalyaan2-mission-how-isro-s-second-mission-is-uniquely-different-from-nasa-s-mars-climate-orbiter-71698818832375.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/01/1600x900/Mars_1670411070516_1698819501806.jfif/", "publishedAt": "2023-11-01T00:49:08Z", "content": "Photo Credit: Pixabay\r\n ISRO is planning a second Mars Orbiter Mission which has been dubbed Mangalyaan-2 mission. Know how this project is different from NASAs Mars Climate Orbiter.\r\nPhoto Credit: P… [+1628 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Morgan Little", "title": "Apple’s October Scary Fast Event: Everything revealed about the new MacBook Pro, iMac and M3 chips - TechCrunch", "description": "Apple's October event was low on spooks and scares, but still packed in three M3 chips, two MacBook Pro models and a revamped iMac.", "url": "https://techcrunch.com/2023/10/31/apples-october-scary-fast-event-everything-announced-so-far/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/10/Screenshot-2023-10-30-at-5.26.00-PM.png?resize=1200,626", "publishedAt": "2023-10-31T17:37:30Z", "content": "Apples October event had some exciting product announcements but dont worry, there was nothing too spooky. Last week, the company announced a surprise Scary Fast event, prompting speculation that App… [+4402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cardiovascular Deaths Due to Extreme Heat Expected To Skyrocket - SciTechDaily", "description": "In nationwide projections, elderly and black adults are most at risk for cardiovascular death due to extreme heat, finds a new study in the journal, Circulation. Cardiovascular deaths from extreme heat in the United States are projected to increase by 162% by…", "url": "https://scitechdaily.com/?p=323312", "urlToImage": "https://scitechdaily.com/images/Extreme-Heat-Cardiology-Heart-Concept-Art.jpg", "publishedAt": "2023-10-31T08:31:36Z", "content": "ByAmerican Heart AssociationOctober 31, 2023\r\nCardiovascular deaths in the U.S. from extreme heat are projected to double or triple by mid-century if greenhouse gas emissions are not reduced.\r\nIn nat… [+10769 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What’s the ISRO budget for the project? - HT Tech", "description": "Shukrayaan1 mission Whats theISRObudget for the project The Shukrayaan1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour. The Shukrayaan1 mission is expected to cost between Rs. 500 cr…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan1-mission-what-s-the-isro-budget-for-the-project-71698724427302.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/31/1600x900/Venus_1696761565001_1698724499602.jpg/", "publishedAt": "2023-10-30T22:33:48Z", "content": "Photo Credit: Pixabay\r\n The Shukrayaan-1 mission to Venus is set to launch in 2024. The mission concept was conceived back in 2012 to make it a historical endeavour.\r\nPhoto Credit: Pixabay\r\n The Shuk… [+1527 chars]"}]}