{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Evening Standard"}, "author": "Barney Davis", "title": "‘We’re proud to be British’ Andrew Neil launches GB News with some technical difficulties - Evening Standard", "description": "Andrew Neil has launched his new GB News channel to introduce his “anti-woke” co-stars saying “we’re proud to be British - the clue is in the name”.", "url": "https://www.standard.co.uk/news/uk/gb-news-andrew-neil-launch-dan-wooten-b940381.html", "urlToImage": "https://static.standard.co.uk/2021/06/13/20/newFile-1.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2021-06-13T21:27:24Z", "content": "Andrew Neil has launched his new GB News channel to introduce his anti-woke co-stars saying were proud to be British - the clue is in the name.\r\nThe chairman of the new channel told viewers that GB N… [+3402 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "Your iPhone 12 Pro will soon 3D scan your foot to perfect online shoe shopping - TechRadar", "description": "Use your iPhone 12 Pro to get your exact shoe size to help shop online", "url": "https://www.techradar.com/news/your-iphone-12-pro-will-soon-3d-scan-your-foot-to-perfect-online-shoe-shopping", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qoCXDjjZDBV8sbQH2wsG5P-1200-80.jpg", "publishedAt": "2021-06-13T21:00:31Z", "content": "Online shopping has skyrocketed during the pandemic, highlighting its usefulness and shortcomings. Ordering goods is incredibly convenient until you need to know your size, for clothes and shoes. But… [+6667 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "G7’s billion vaccine plan counts some past pledges, limiting impact - The Indian Express", "description": "A U.S. initiative announced on Thursday to donate 500 million doses of the Pfizer and BioNTech SE vaccine is part of the G7 pledge.", "url": "https://indianexpress.com/article/world/g7-billion-vaccine-plan-counts-some-past-pledges-limiting-impact-7357375/", "urlToImage": "https://images.indianexpress.com/2021/06/G-7-summit.jpg", "publishedAt": "2021-06-13T15:43:23Z", "content": "A G7 plan to donate a billion COVID-19 vaccine doses to poorer countries will have limited impact because it includes some previous pledges, but it still offers a small lifeline to a global vaccine b… [+2833 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Ubisoft unveils first-person adventure Avatar: Frontiers of Pandora, coming to high-end consoles and PC in 2022 - HT Tech", "description": "Arriving five years after it was first announced, Avatar: Frontiers of Pandora promises fantastic graphics, an interactive world and creatures and intense battles. But will your computer or console be able to play the game?", "url": "https://tech.hindustantimes.com/gaming/news/ubisoft-unveils-avatar-frontiers-of-pandora-coming-to-high-end-consoles-and-pc-in-2022-71623595332842.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/06/13/1600x900/AFOP-avatar-hero_1623595623300_1623595651435.jpg", "publishedAt": "2021-06-13T14:42:12Z", "content": "At E3 2021, Ubisoft finally took the wraps off the first trailer of Avatar: Frontiers of Pandora a new first-person adventure game that features gorgeous graphics and a stunning throwback to Pandora,… [+1935 chars]"}, {"source": {"id": null, "name": "Citynews.ca"}, "author": null, "title": "Canada paid a premium to get doses from Pfizer earlier than planned - CityNews Toronto", "description": "Canada paid a premium to get more than 250,000 doses of the Pfizer-BioNTech vaccine delivered last December, weeks earlier than planned. The detail is contained in heavily redacted contracts released to the House of Commons health committee late Friday, but a…", "url": "https://toronto.citynews.ca/2021/06/12/canada-paid-a-premium-to-get-doses-from-pfizer-earlier-than-planned/", "urlToImage": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2020/12/13/vaccine-delivery-UPS.jpg", "publishedAt": "2021-06-12T21:45:11Z", "content": "Canada paid a premium to get more than 250,000 doses of the Pfizer-BioNTech vaccine delivered last December, weeks earlier than planned.\r\nThe detail is contained in heavily redacted contracts release… [+4872 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Top 10 best and worst cities to live in - BusinessTech", "description": "Covid-19 is shattering Europe’s claims to have some of the world’s most liveable cities, according to a new ranking.", "url": "https://businesstech.co.za/news/wealth/497085/top-10-best-and-worst-cities-to-live-in/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Auckland-e1623398693457.jpeg", "publishedAt": "2021-06-12T13:01:08Z", "content": "Covid-19 is shattering Europes claims to have some of the worlds most liveable cities, according to a new ranking.\r\nVienna, which topped the Economist Intelligence Units index from 2018 to 2020, tumb… [+2809 chars]"}]}