{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Technical View | Nifty likely to consolidate before marching towards 22,500 - Moneycontrol", "description": "Volatility spiked and climbed above the 16 mark, which can create discomfort for the bulls in coming days. The India VIX, the fear index, rose 5.22 percent to 16.02 from 15.22 levels", "url": "https://www.moneycontrol.com/news/business/markets/technical-view-nifty-likely-to-consolidate-before-marching-towards-22500-12305341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/market_flat-3-770x433.jpg", "publishedAt": "2024-02-19T11:38:48Z", "content": "The Nifty hit a new high of 22,187 on February 19 as the market closed in the green for the fifth consecutive session despite mixed global cues.\r\nThe 50-stock index gave up some of the gains later in… [+2557 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This soft serve machine is not broken, says NASA, shares image taken from ISS on Instagram - HT Tech", "description": "NASA captured a stunning image of Earth from the International Space Station, showing frozen seawater swirls along Labrador coast", "url": "https://tech.hindustantimes.com/tech/news/this-soft-serve-machine-is-not-broken-says-nasa-shares-image-taken-from-iss-on-instagram-71708239259190.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/18/1600x900/Nasa_soft_swirl_1708240294051_1708240363871.jpg", "publishedAt": "2024-02-18T18:14:30Z", "content": "NASA recently shared a breathtaking image of Earth taken from the International Space Station (ISS), revealing an incredible sight of frozen seawater. Captured on February 3, 2024, the image showcase… [+2253 chars]"}, {"source": {"id": null, "name": "Spaceflight Now"}, "author": null, "title": "Rocket Lab Electron rocket lifts off with space debris removal mission – Spaceflight Now - Spaceflight Now", "description": "A small satellite that will inspect a discarded rocket body in orbit lifted off Sunday/Monday on a mission to develop techniques for removing space debris. The satellite built by Japan-based Astroscal", "url": "https://spaceflightnow.com/2024/02/18/rocket-lab-electron-rocket-to-launch-space-debris-removal-mission/", "urlToImage": "https://spaceflightnow.com/wp-content/uploads/2024/02/20240218-Electron-Launch-Feature-Image.jpg", "publishedAt": "2024-02-18T16:30:00Z", "content": "An Electron rocket lifts off from Rocket Lab’s launch site on New Zealand’s Mahia Peninsula carrying the ADRAS-J satellite for Astroscale. Image: Rocket Lab.\r\nA small satellite that will inspect a di… [+2588 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Mysterious 280-Million-Year-Old Fossil That Fooled Scientists for Decades - SciTechDaily", "description": "Paleontological analysis shows renowned fossil thought to show soft tissue preservation is in fact just paint. A 280-million-year-old fossil that has baffled researchers for decades has been shown to be, in part, a forgery following new examination of the rem…", "url": "https://scitechdaily.com/the-mysterious-280-million-year-old-fossil-that-fooled-scientists-for-decades/", "urlToImage": "https://scitechdaily.com/images/Tridentinosaurus-antiquus.jpg", "publishedAt": "2024-02-17T08:00:00Z", "content": "Tridentinosaurus antiquus was discovered in the Italian Alps in 1931 and was thought to be an important specimen for understanding early reptile evolution – but has now been found to be, in part a fo… [+4504 chars]"}]}