{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Gadgets360.com"}, "author": "Roydon Cerejo, Siddharth Suvarna", "title": "Oppo Find N3 Flip India Launch Confirmed for October 12: All Details | Technology News - Gadgets 360", "description": "Oppo India has officially confirmed that it’s next clamshell foldable, the Find N3 Flip, will be announced on October 12. The event will be streamed live on YouTube starting at 7PM IST. The Oppo Find N3 Flip marks the launch of the company’s second foldable i…", "url": "https://www.gadgets360.com/mobiles/news/oppo-find-n3-flip-india-launch-date-price-details-4456766", "urlToImage": "https://i.gadgets360cdn.com/large/oppo_find_n3_flip_1695891839987.jpg", "publishedAt": "2023-10-06T12:45:02Z", "content": "Oppo India has officially confirmed that it's next foldable, the Find N3 Flip, will be announced on October 12. The event will be streamed live on YouTube starting at 7PM IST. The Oppo Find N3 Flip m… [+2154 chars]"}, {"source": {"id": null, "name": "Travel+Leisure"}, "author": "https://www.facebook.com/travelandleisure/", "title": "The 8 Best Apple Tech Deals at Amazon - Travel + Leisure", "description": "Amazon Big Deal Days include Apple products like AirTags, AirPods, iPads, and more tech accessories for your next trip up to 43 percent off. Score early deals on wireless headphones, laptops, and more ahead of October Prime Day.", "url": "https://www.travelandleisure.com/amazon-october-prime-day-2023-best-apple-deals-8348249", "urlToImage": "https://www.travelandleisure.com/thmb/vnkSIvvY26ToK2od4GvHroFnbaU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/tl-amazon-apple-deals-tout-8c7149bd07ef49f19ddbece8ad66dfda.jpg", "publishedAt": "2023-10-06T04:00:00Z", "content": "Im not ashamed to admit it: Im a total Apple diehard. As I type these words on my MacBook, my iPhone and AirPods are within arms reach, and my Apple Watch is wrapped around my wrist. In fact, Ive lov… [+5449 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA reveals bus-sized asteroid rushing towards Earth today! Check speed, size, other details - HT Tech", "description": "A bus-sized, Apollo group asteroid is hurtling towards Earth and is expected to make its closest approach to Earth today, October 6. Check details such as its speed, distance, and more.", "url": "https://tech.hindustantimes.com/tech/news/nasa-reveals-bus-sized-asteroid-rushing-towards-earth-today-check-speed-size-other-details-71696564225998.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/06/1600x900/Asteroid_2023_QH_1693479044729_1696564353357.jpg", "publishedAt": "2023-10-06T03:54:52Z", "content": "NASA has several space and ground-based telescopes in place to discover, track, and study asteroids. But if you're a budding astronomer, you can help the space agency too! NASA's new Daily Minor Plan… [+1879 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Gold Reinvented: Stanford Scientists Uncover Exotic Chemical State in New Material - SciTechDaily", "description": "A form of gold that does not occur stably in nature is at the heart of a new crystalline material with intriguing properties. For the first time, Stanford researchers have found a way to create and stabilize an extremely rare form of gold that has lost two ne…", "url": "https://scitechdaily.com/gold-reinvented-stanford-scientists-uncover-exotic-chemical-state-in-new-material/", "urlToImage": "https://scitechdaily.com/images/Gold-Chemistry-Material-Science-Concept.jpg", "publishedAt": "2023-10-05T17:16:41Z", "content": "ByStanford UniversityOctober 5, 2023\r\nStanford scientists have synthesized a rare form of gold, Au2+, stabilized by halide perovskite, with potential applications in electronics and energy sectors, l… [+9870 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists discovered how to produce the vital agricultural fertilizer - Tech Explorist", "description": "New method uses a catalyst to make synthetic urea.", "url": "https://www.techexplorist.com/scientists-discovered-produce-vital-agricultural-fertilizer/74258/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/10/fertilizer.jpg", "publishedAt": "2023-10-05T05:22:24Z", "content": "Urea, with a high nitrogen content, is considered one of agricultural production’s most vital nitrogen fertilizers. It is also a primary raw material for manufacturing industries, including pharmaceu… [+1555 chars]"}]}