{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Isaac Stanley-Becker, John Wagner", "title": "RNC counters Biden announcement with dystopian, AI-aided video - The Washington Post", "description": "Republicans used a dystopian video created with artificial intelligence technology to counter Biden’s announcement of his reelection campaign.", "url": "https://www.washingtonpost.com/politics/2023/04/25/rnc-biden-ad-ai/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OB4ERH3QRO43TNTD2ZLFJRMC64.JPG&w=1440", "publishedAt": "2023-04-25T15:36:00Z", "content": "Comment on this story\r\nComment\r\nShortly after President Biden announced his reelection bid Tuesday, the Republican National Committee countered with a video of its own offering a pretty predictable m… [+5694 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kirsten Korosec", "title": "GM is killing off the Chevy Bolt and Bolt EUV - TechCrunch", "description": "GM CEO Mary Barra said Tuesday the automaker will stop production of its top-selling Chevy Bolt and Bolt EUV models by the end of 2023.", "url": "https://techcrunch.com/2023/04/25/gm-is-killing-off-the-chevy-bolt-and-bolt-euv/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2016/08/cpxbwluw8aabwl9-jpg-large.jpeg?resize=1200,660", "publishedAt": "2023-04-25T14:26:03Z", "content": "General Motors Chair and CEO Mary Barra said Tuesday the automaker will stop producing its two top-selling EVs: the Chevy Bolt and its larger sibling, the Bolt EUV, by the end of 2023.\r\nBarra told in… [+1175 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Ekrem Çetinkaya, Ekrem Çetinkaya", "title": "Moving Images with No Effort: Text2Video-Zero is an AI Model That Converts Text-to-Image Models to Zero-Shot Video Generators - MarkTechPost", "description": "We have witnessed the rise of generative AI models in the last couple of months. They went from generating low-resolution face-like images to generating high-resolution photo-realistic images quite quickly. It is now possible to obtain unique, photo-realistic…", "url": "https://www.marktechpost.com/2023/04/25/moving-images-with-no-effort-text2video-zero-is-an-ai-model-that-converts-text-to-image-models-to-zero-shot-video-generators/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/04/Screenshot-2023-04-25-at-5.55.43-PM.png", "publishedAt": "2023-04-25T12:29:55Z", "content": "We have witnessed the rise of generative AI models in the last couple of months. They went from generating low-resolution face-like images to generating high-resolution photo-realistic images quite q… [+4489 chars]"}, {"source": {"id": null, "name": "Financial Express"}, "author": null, "title": "Point of Care Diagnostic Devices and Technologies: Capacity Boosters in India’s battle against Malaria - The Financial Express", "description": "Rural areas in India lack the availability of such specialized facilities and equipment which is one of the key reasons why the timely detection of malaria infections remains low.", "url": "https://www.financialexpress.com/healthcare/news-healthcare/point-of-care-diagnostic-devices-and-technologies-capacity-boosters-in-indias-battle-against-malaria/3061402/", "urlToImage": "https://www.financialexpress.com/wp-content/uploads/2022/12/dengue.jpg", "publishedAt": "2023-04-25T10:30:00Z", "content": "By Dr. Muthu Dhandapani\r\nDespite the significant pool of brilliant healthcare professionals, India severely lacks in terms of the capacity required to deal with the disease burden in this country. Wi… [+4402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars' Hidden Depths: NASA's InSight Lander Unmasks the Red Planet's Liquid Core - SciTechDaily", "description": "New NASA InSight research reveals that Mars has a liquid core rich in sulfur and oxygen, leading to new clues about how terrestrial planets form, evolve and potentially sustain life. NASA's InSight lander has discovered that Mars has a completely liquid core,…", "url": "https://scitechdaily.com/?p=271290", "urlToImage": "https://scitechdaily.com/images/Cutaway-of-Mars-Seismic-Waves.jpg", "publishedAt": "2023-04-25T09:08:29Z", "content": "ByUniversity of MarylandApril 25, 2023\r\nThis artists concept shows a cutaway of Mars, along with the paths of seismic waves from two separate quakes in 2021. Detected by NASAs InSight mission, these … [+9163 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louis Chilton", "title": "In Succession's world of toxic men, Alexander Skarsgård's Matsson hits a chilling new low - The Independent", "description": "The biting HBO drama has featured its fair share of problematic men in the past. But the sinister Scandinavian tech billionaire epitomises a dimension of the uber-rich that ‘Succession’ has mostly skirted around, writes Louis Chilton", "url": "https://www.independent.co.uk/arts-entertainment/tv/features/succession-cast-episode-5-alexander-skarsgard-b2326189.html", "urlToImage": "https://static.independent.co.uk/2023/04/21/15/newFile-9.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-04-25T06:01:17Z", "content": "Sign up to our free IndyArts newsletter for all the latest entertainment news and reviews\r\nSign up to our free IndyArts newsletter\r\nLike all truly great TV series, Succession is about a lot of things… [+3632 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "1007-foot asteroid speeding at 62723 kmph towards Earth, NASA warns - HT Tech", "description": "NASA has warned about a perilous 1007-foot wide space rock that is speeding toward Earth soon.", "url": "https://tech.hindustantimes.com/tech/news/1007foot-asteroid-speeding-at-62723-kmph-towards-earth-nasa-warns-71682400879378.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/25/1600x900/cosmos-7935452_1920_Pixabay_1682401012706_1682401023102.jpg", "publishedAt": "2023-04-25T05:37:43Z", "content": "A colossal space rock is on its way to Earth and it is coming at a mind-numbing speed! NASA has alerted the public about the gigantic Asteroid 2006 HV5 that will come worryingly close to Earth on Apr… [+1898 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Giant SpaceX rocket leaves crater, serious damage at Texas base - HT Tech", "description": "Repairing the damage from Thursday's unmanned test flight is expected to take months, potentially delaying further launch attempts and slowing the development of a rocket NASA plans to use on its upcoming Moon missions.", "url": "https://tech.hindustantimes.com/tech/news/giant-spacex-rocket-leaves-crater-serious-damage-at-texas-base-71682358547612.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/25/1600x900/TOPSHOT-US-SPACE-SPACEX-STARSHIP-0_1682396584656_1682396637600.jpg", "publishedAt": "2023-04-25T04:27:23Z", "content": "Flying chunks of concrete, twisted metal sheets, craters blasted deep into the ground: the thunderous power of SpaceX's first test flight of Starship -- the biggest and most powerful rocket ever buil… [+4589 chars]"}]}