{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Critically Endangered Iconic Great Apes in Borneo Lost Muscle During Fruit Shortages - SciTechDaily", "description": "Highlights Need to Protect Orangutan Habitat Wild orangutans are known for their ability to survive food shortages, but scientists have made a surprising finding that highlights the need to protect the habitat of these critically endangered primates, which fa…", "url": "https://scitechdaily.com/critically-endangered-iconic-great-apes-in-borneo-lost-muscle-during-fruit-shortages/", "urlToImage": "https://scitechdaily.com/images/Jerry-the-Orangutan.jpg", "publishedAt": "2021-05-13T09:25:52Z", "content": "A male orangutan eating non-fruit vegetation instead of the fruit orangutans prefer on the island of Borneo in Southeast Asia. Credit: Kristana Parinters Makur/Tuanan Orangutan Research Project\r\nHigh… [+4060 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "SA-born biotech billionaire commits R3 billion to produce vaccines locally - News24", "description": "Dr Patrick Soon-Shiong says South Africa has the science, the human capital, the capacity and the desire to produce vaccines.", "url": "https://www.news24.com/fin24/Companies/Health/sa-born-biotech-billionaire-commits-r3-billion-to-produce-vaccines-locally-20210513", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11086/ac171cd80bb24aeea7f06974169bf318.jpg", "publishedAt": "2021-05-13T07:12:08Z", "content": "<ul><li>US-based billionaire Dr Patrick Soon-Shiong, who was born and trained in South Africa, will spend R3 billion to \"transfer technology\" to allow vaccine production in South Africa. </li><li>He … [+3679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "50 Bharat Biotech employees test Covid-19 positive; Joint MD’s tweet draws bouquets and brickbats - The Indian Express", "description": "Suchitra Ella on Wednesday tweeted \"Quite disheartening to the teams to hear some states complaining about our intentions. 50 of our employees are off work due to Covid, yet we continue to work under pandemic lockdowns 24x7 for U.\"", "url": "https://indianexpress.com/article/india/50-employees-bharat-biotech-test-covid-19-positive-joint-mds-tweet-draws-bouquets-and-brickbats-7313261/", "urlToImage": "https://images.indianexpress.com/2021/05/COVAXIN-1.jpeg", "publishedAt": "2021-05-13T06:03:55Z", "content": "Bharat Biotech’s Joint Managing Director Suchitra Ella’s tweet saying 50 of their employees tested positive for Covid received bouquets and brickbats from netizens with some saying Covaxin was saving… [+1562 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Keep 12-16 week gap between Covishield doses; jabs for recovered Covid-19 patients only after 6 months: Panel - Times Now", "description": "Government panel National Technical Advisory Group on Immunisation suggested that pregnant women may be offered the choice to take any Covid-19 vaccine.", "url": "https://www.timesnownews.com/india/article/keep-12-16-week-gap-between-covishield-doses-jabs-for-recovered-covid-19-patients-only-after-6-months-panel/756494", "urlToImage": "https://imgk.timesnownews.com/story/Coronavirus-vaccination_AP_7.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-05-13T05:55:00Z", "content": "<ul><li>The Drugs Controller General of India has granted its approval for the Phase 2 and Phase 3 clinical trials of Bharat Biotechs Covid-19 vaccine Covaxin</li></ul>\r\n<ul><li>The firm will reporte… [+2023 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "New Covid-19 data shows infections rising in these areas – as third wave hits South Africa - BusinessTech", "description": "South Africa’s Department of Health said that while Covid-19 infections climbed 46% in the last week the country has not yet reached a “resurgence threshold”.", "url": "https://businesstech.co.za/news/trending/489915/new-covid-19-data-shows-infections-rising-in-these-areas-as-third-wave-hits-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/Zweli-Mkhize--e1620884611899.jpg", "publishedAt": "2021-05-13T05:45:02Z", "content": "Mkhize has warned provincial departments to prepare for a rise in cases in the coming weeks as the country is hit by a third wave of Covid-19 infections.\r\nIn a notesent on Wednesday (12 May), Mkhize … [+3456 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "realme Narzo 30A review - A basic phone for basic usage - TechNave", "description": "A budget phone is a favourite amongst Malaysians, and the&nbsp;realme&nbsp;Narzo 30A&nbsp;is one of the latest options available. Launched at the end of March 2", "url": "https://technave.com/gadget/realme-Narzo-30A-review-A-basic-phone-for-basic-usage-24601.html", "urlToImage": "https://technave.com/data/files/mall/article/202105030957189616.jpg", "publishedAt": "2021-05-13T03:33:45Z", "content": "A budget phone is a favourite amongst Malaysians, and the realme Narzo 30A is one of the latest options available. Launched at the end of March 2021, It features an attractive price of RM599 with mid… [+6935 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "NASA's Voyager 1 also detects a faint monotone hum beyond our solar system - SwordsToday.ie", "description": "This artist's illustration of what Voyager 1 looked like when Interstellar entered space. NASA / JPL-Caltech Said NASA's Voyager 1, the longest spacecraft", "url": "https://swordstoday.ie/nasas-voyager-1-also-detects-a-faint-monotone-hum-beyond-our-solar-system/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/05/NASAs-Voyager-1-also-detects-a-faint-monotone-hum-beyond.jpg", "publishedAt": "2021-05-13T03:23:02Z", "content": "This artist’s illustration of what Voyager 1 looked like when Interstellar entered space.\r\n NASA / JPL-Caltech\r\nSaid NASA’s Voyager 1, the longest spacecraft on Earth Farewell to the Solar System Abo… [+2810 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hear the Eerie Sounds of Interstellar Space Captured by NASA's Voyager - SciTechDaily", "description": "As NASA’s Voyager 1 Surveys Interstellar Space, Its Density Measurements Are Making Waves In the sparse collection of atoms that fills interstellar space, Voyager 1 has measured a long-lasting series of waves where it previously only detected sporadic bursts.…", "url": "https://scitechdaily.com/hear-the-eerie-sounds-of-interstellar-space-captured-by-nasas-voyager/", "urlToImage": "https://scitechdaily.com/images/Voyager-2-Nearing-Interstellar-Space.jpg", "publishedAt": "2021-05-13T02:16:41Z", "content": "An illustration depicting one of NASA’s twin Voyager spacecraft. Both Voyagers have entered interstellar space, or the space outside our Sun’s heliosphere. Credit: NASA/JPL-Caltech\r\nAs NASA’s Voyager… [+7641 chars]"}, {"source": {"id": null, "name": "ForexLive"}, "author": "Adam Button", "title": "Bitcoin crumbles after Elon Musk bails. Why it may never recover - ForexLive", "description": "Bitcoin has fatal flaws and is now a novelty, not the currency of the future In many things, being first to market gives you an insurmountable lead but technology is not one of those things.", "url": "https://www.forexlive.com/Cryptocurrency/!/bitcoin-crumbles-after-elon-musk-bails-why-it-may-never-recover-00-20210513", "urlToImage": "https://az705044.vo.msecnd.net/20210513/elon-musk-bitcoin.png", "publishedAt": "2021-05-13T00:17:05Z", "content": null}, {"source": {"id": null, "name": "Toronto Sun"}, "author": "Reuters", "title": "Mixing Pfizer and AstraZeneca vaccines causes more reactions, no safety concerns: U.K. Study - Toronto Sun", "description": "Preliminary results of an ongoing study in the United Kingdom suggest alternating the Oxford-AstraZeneca and Pfizer-BioNTech vaccines causes more frequent mild…", "url": "https://torontosun.com/health/delaying-second-covid-19-vaccine-doses-can-help-reduce-deaths-study", "urlToImage": "https://smartcdn.prod.postmedia.digital/torontosun/wp-content/uploads/2021/04/ts2021421jb011-e1620858958285.jpg?quality=100&strip=all", "publishedAt": "2021-05-12T23:27:27Z", "content": "Helen Briggs, a pharmacist, holds up a tray of syringes as Lirie Palamind an RPN (background) loads up them up with Pfizer-BioNTech COVID-19 vaccine at the Humber River Hospital clinic held at Downsv… [+5563 chars]"}, {"source": {"id": null, "name": "Winnipeg Free Press"}, "author": "Camille Bains, The Canadian Press", "title": "Expect more reactions from mixing vaccines: study - Winnipeg Free Press", "description": "Preliminary results of an ongoing study in the United Kingdom suggest alternating the Oxford-AstraZeneca and Pfizer-BioNTech vaccines causes more frequent mild to moderate symptoms, but there are no other safety concerns from mixing those vaccines.However, re…", "url": "https://www.winnipegfreepress.com/arts-and-life/life/health/uk-study-says-expect-more-reactions-from-mixing-pfizer-and-astrazeneca-vaccines--574408032.html", "urlToImage": "https://media.winnipegfreepress.com/images/20210512160552-609c40057c2c1aa462732972jpeg.jpg", "publishedAt": "2021-05-12T22:49:31Z", "content": "A vial of AstraZeneca vaccine is seen at a mass COVID-19 vaccination clinic in Calgary, Alta., on Thursday, April 22, 2021.THE CANADIAN PRESS/Jeff McIntosh\r\nPreliminary results of an ongoing study in… [+3804 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Gold rally fades as inflation rises to the highest level in a decade - Kitco NEWS", "description": "Exclusive to Kitco News, technical analyst Gary Wagner provides a daily recap of what happened in the gold market, highlighting important events that captured investors' attention during the U.S. trading session. Wagner's commentary features a mix of fundamen…", "url": "https://www.kitco.com/commentaries/2021-05-12/Gold-rally-fades-as-inflation-rises-to-the-highest-level-in-a-decade.html", "urlToImage": "https://www.kitco.com/commentaries/2021-05-12/images/goldmay15.png", "publishedAt": "2021-05-12T22:30:00Z", "content": "Today the Bureau of Labor Statistics reported a tremendous and unexpected spike in inflation. That data sent shockwaves through the financial markets across the board. U.S. equities were hit hard, wi… [+2266 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mayank Sharma", "title": "Microsoft Outlook update actually crashed the whole system - Techradar", "description": "Microsoft has identified the cause and has started rolling out a fix", "url": "https://www.techradar.com/news/microsoft-outlook-update-actually-crashed-the-whole-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Un5CRWVYRDC769ZrkZKAjn-1200-80.jpg", "publishedAt": "2021-05-12T15:27:27Z", "content": "A recent change to the component responsible for displaying text in Microsoft Outlook\r\n is preventing users from creating and viewing emails in the desktop version of the email client\r\n.\r\nThe bug in … [+1320 chars]"}, {"source": {"id": null, "name": "Siliconrepublic.com"}, "author": "Lisa Ardill", "title": "The new iron-gallium alloy making a buzz in magnetoelectrics - Siliconrepublic.com", "description": "Researchers at the University of Michigan have developed a new magnetoelectric material that could power more efficient tech devices.", "url": "https://www.siliconrepublic.com/innovation/magnetoelectric-materials-michigan-iron-gallium", "urlToImage": "https://www.siliconrepublic.com/wp-content/uploads/2021/05/AdobeStock_212804251.jpeg", "publishedAt": "2021-05-12T12:00:22Z", "content": "Researchers claim their new material could slash the electricity requirements of the worlds computing infrastructure.\r\nA group led by University of Michigan researchers has developed a new material f… [+2359 chars]"}, {"source": {"id": null, "name": "Marine Technology News"}, "author": null, "title": "Coral Reef Restorations Can Be Optimized to Reduce Flood Risk - Marine Technology News", "description": "New practical guidelines for reef restoration will benefit coral ecosystems while also providing coastal communities with effective…", "url": "https://www.marinetechnologynews.com/news/coral-restorations-optimized-reduce-610626", "urlToImage": "https://images.marinetechnologynews.com/images/maritime/w800/kichigin19-adobe-stock-122684.jpeg", "publishedAt": "2021-05-11T20:27:47Z", "content": "New practical guidelines for reef restoration will benefit coral ecosystems while also providing coastal communities with effective protection from flood risk\r\nA new study by the open access publishe… [+4275 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA and Axiom Agree to First Private Astronaut Mission to Space Station - SciTechDaily", "description": "NASA and Axiom Space have signed an order for the first private astronaut mission to the International Space Station to take place no earlier than January 2022. “We are excited to see more people have access to spaceflight through this first private astronaut…", "url": "https://scitechdaily.com/nasa-and-axiom-agree-to-first-private-astronaut-mission-on-space-station/", "urlToImage": "https://scitechdaily.com/images/Axiom-Station.jpg", "publishedAt": "2021-05-11T19:21:28Z", "content": "In the future, Axiom Space aims to own and operate the world’s first commercial space station: Orbiting 250 miles above the Earth’s surface and traveling over 17,000 miles per hour, the Axiom Station… [+4784 chars]"}, {"source": {"id": null, "name": "Techcityng.com"}, "author": "BellaRose Okojie", "title": "TECNO CAMON 17 launched with a notable selfie documentary - TechCity", "description": "Tecno has announced the launch of it's Camon 17 smartphone with a stunning documentary that discusses thought-provoking subjects surrounding the", "url": "https://www.techcityng.com/tecno-camon-17-launched-with-a-notable-selfie-documentary/", "urlToImage": "https://h2g6j3q2.rocketcdn.me/wp-content/uploads/2021/05/rrr.jpg", "publishedAt": "2021-05-11T16:27:12Z", "content": "Tecno has announced the launch of it’s Camon 17 smartphone with a stunning documentary that discusses thought-provoking subjects surrounding the rise of the selfie and the selfie generation’s needs. … [+3094 chars]"}]}