{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Kyivindependent.com"}, "author": "Anna Fratsyvir", "title": "Ukraine detains Chinese spies tasked with stealing Neptune missile technology, SBU says - The Kyiv Independent", "description": "According to the SBU, the two individuals, a 24-year-old former student of a Kyiv technical university and his father, were gathering classified documentation with the intent to illegally transfer it to Chinese intelligence.", "url": "https://kyivindependent.com/ukraine-detains-2-chinese-nationals-suspected-of-spying-on-neptun-missile-technology-sbu-says-06-2025/", "urlToImage": "https://assets.kyivindependent.com/content/images/2025/07/IMAGE-2025-07-09-13-04-09.jpg", "publishedAt": "2025-07-09T10:35:49Z", "content": "The Security Service of Ukraine (SBU) has detained two Chinese nationals in Kyiv suspected of attempting to steal classified military technology related to Ukraine's Neptune cruise missile system, th… [+2000 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Rebecca Szkutak", "title": "Hugging Face opens up orders for its Reachy Mini desktop robots - TechCrunch", "description": "Hugging Face is releasing two versions of its desktop robot meant for designing and coding AI applications.", "url": "https://techcrunch.com/2025/07/09/hugging-face-opens-up-orders-for-its-reachy-mini-desktop-robots/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/07/REACHY-MINI-3.jpg?resize=1200,798", "publishedAt": "2025-07-09T07:00:00Z", "content": "Hugging Face is ready for developers to start tinkering and testing its latest robotics release.\r\nThe AI development platform announced Wednesday that it’s now accepting orders for its Reachy Mini de… [+3247 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Uncover Forgotten 1938 Fusion Breakthrough That Could Power the Future - SciTechDaily", "description": "Physicists confirm DT fusion insights from a 1938 experiment. The findings connect past theory with current fusion efforts. A team at Los Alamos National Laboratory has successfully recreated a significant yet largely overlooked physics experiment: the first …", "url": "https://scitechdaily.com/physicists-uncover-forgotten-1938-fusion-breakthrough-that-could-power-the-future/", "urlToImage": "https://scitechdaily.com/images/Nuclear-Fusion-Energy-Reactor-Plasma-Concept-Illustration.jpg", "publishedAt": "2025-07-08T03:32:09Z", "content": "By reconstructing a nearly forgotten 1938 experiment, scientists have uncovered new significance in an early observation of deuterium-tritium fusion that still shapes nuclear science today. (Artist’s… [+10136 chars]"}]}