{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Tech News Today: Copilot iOS app launch, Surface laptops with AI features, and more - The Indian Express", "description": "Tech News Today (December 31, 2023): Microsoft's GPT-4 powered chatbot Copilot app is now available for iPhones and iPads just a few days after the launch of the same for Android devices, similarly,  next-generation Surface laptops are reported to include a h…", "url": "https://indianexpress.com/article/technology/tech-news-today-31-december-2023-copilot-app-surface-ai-pc-iphone-15-discount-9089500/", "urlToImage": "https://images.indianexpress.com/2023/12/copilot-app-android-ios.jpg", "publishedAt": "2023-12-31T07:41:09Z", "content": "<li>01Copilot now available for iPads and iPhones\r\nMicrosoft's GPT-4 powered Copilot app is now available for iPads and iPhones. Users can log in using a Microsoft account to access the latest genera… [+1266 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Best year end deals: Start 2024 with a bang! These 8 top Bluetooth speakers will put you right in the mood - HT Tech", "description": "Best Year End Deals: Check out these 8 top Bluetooth speakers including Mivi Play, Zebronics Zeb-Warrior 2.0, and more which are now vailable with huge discounts.", "url": "https://tech.hindustantimes.com/tech/news/best-year-end-deals-start-2024-with-a-bang-these-8-top-bluetooth-speakers-will-put-you-right-in-the-mood-71704002433463.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/31/1600x900/_dd84b760-ebfa-11e8-86fe-bb1c4000c468_1704003936789.jpg", "publishedAt": "2023-12-31T06:43:44Z", "content": "Best year end deals: Planning to party on New Year's Eve and the first day of 2024? Now, you can get the best speakers at low prices due to year end sales. Various e-commerce platforms are offering h… [+15494 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revealing the Ice Giant: Uranus's Hidden Features Uncovered by Webb - SciTechDaily", "description": "On December 18, 2023, the James Webb Space Telescope captured remarkable images of Uranus, revealing the planet's intricate ring system and seasonal north polar cap, as well as observing bright storms near its southern cap. The ice giant Uranus and its rings …", "url": "https://scitechdaily.com/revealing-the-ice-giant-uranuss-hidden-features-uncovered-by-webb/", "urlToImage": "https://scitechdaily.com/images/Uranus-Wide-Webb-NIRCam-Image.jpg", "publishedAt": "2023-12-31T06:16:40Z", "content": "This image of Uranus from NIRCam (Near-Infrared Camera) on NASA’s James Webb Space Telescope shows the planet and its rings in new clarity. The planet’s seasonal north polar cap gleams in a bright wh… [+3070 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "Smartphone manufacturers still want to make foldables a thing - Ars Technica", "description": "Samsung, Motorola and Huawei continue to invest in high-priced flip devices despite weak sales", "url": "https://www.ft.com/content/d8105aab-7e67-4df7-a734-d52042598009", "urlToImage": null, "publishedAt": "2023-12-31T04:26:56Z", "content": "Keep abreast of significant corporate, financial and political developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert comment… [+30 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: Probing Venus potential for life amidst controversy and clues - HT Tech", "description": "Shukrayaan1 mission Probing Venus potential for life amidst controversy and clues ISRO after triumphant missions to the moon and the sun now sets its sights on the enigmatic Venus with the Shukrayaan1 mission. ISRO Chairman S Somanath confirms the missions pr…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan1-mission-probing-venus-potential-for-life-amidst-controversy-and-clues-71704008357189.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/31/1600x900/Venus_1696761565001_1704008474585.jpg/", "publishedAt": "2023-12-31T02:19:14Z", "content": "Photo Credit: ISRO\r\n ISRO, after triumphant missions to the moon and the sun, now sets its sights on the enigmatic Venus with the Shukrayaan-1 mission. \r\nPhoto Credit: NASA\r\n ISRO Chairman, S Somanat… [+1890 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Aditya-L1 mission update: Status to launch date, all you need to know about ISRO's solar odyssey - HT Tech", "description": "AdityaL1 mission update Status to launch dateall you need to know about ISROs solar odyssey AdityaL1 mission status The spacecraft is on track to reach its celestial destination Lagrange Point 1 L1 on January 6 2024. ISRO Chairman S. Somanath confirms the spa…", "url": "https://tech.hindustantimes.com/web-stories/adityal1-mission-update-status-to-launch-date-all-you-need-to-know-about-isros-solar-odyssey-71704007605039.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/31/1600x900/Aditya-L1_1696421559090_1704007794708.jpg/", "publishedAt": "2023-12-31T02:07:12Z", "content": "Photo Credit: ISRO\r\n Aditya-L1 mission status: The spacecraft is on track to reach its celestial destination, Lagrange Point 1 (L1), on January 6, 2024. ISRO Chairman S. Somanath confirms the spacecr… [+2290 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Alyssa Guzman", "title": "Pentagon’s mysterious unmanned X-37B space plane blasts off on another secretive mission - New York Post ", "description": "X-37B launched from NASA’s Kennedy Space Center Thursday night for yet another top-secret mission two weeks late due to technical difficulties and powerful storms.", "url": "https://nypost.com/2023/12/29/news/pentagons-mysterious-unmanned-x-37b-blasts-off-on-seventh-secretive-mission/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/12/2023-seventh-mission-military-space-74216449.jpg?quality=75&strip=all&w=1024", "publishedAt": "2023-12-29T21:40:00Z", "content": "The US militarys mysterious X-37B unmanned space plane blasted into space Thursday night aboard SpaceXs hulking Falcon Heavy rocket for yet another secretive mission involving “groundbreaking” experi… [+2733 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists modeled the different signatures of a kilonova explosion simultaneously - Tech Explorist", "description": "The goldmine of a neutron star collision.", "url": "https://www.techexplorist.com/scientists-modeled-different-signatures-kilonova-explosion-simultaneously/79100/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/12/two-merging-neutron-stars.jpg", "publishedAt": "2023-12-29T17:49:24Z", "content": "Neutron stars form when big stars end their lives. They squeeze a lot of mass into a tiny space, making a super-dense star about 10 kilometers wide. In 2017, scientists saw the results of two neutron… [+2705 chars]"}]}