{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Samsung Galaxy Z Flip 5, Z Fold 5 to be available earlier than expected: Check price, details - HT Tech", "description": "Samsung's latest foldable phones, the Galaxy Z Flip 5 and Z Fold 5, have witnessed a record-breaking 100,000 pre-bookings in India within just 28 hours of availability. Know when they will be available to buy.", "url": "https://tech.hindustantimes.com/mobile/news/samsung-galaxy-z-flip-5-z-fold-5-to-be-available-earlier-than-expected-check-price-details-71691768457963.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/11/1600x900/Galaxy_Z_Flip_5_1691768552412_1691768552752.JPG", "publishedAt": "2023-08-11T15:46:14Z", "content": "Samsung has reached a big milestone with its latest offering in foldables. The Galaxy Z Flip 5 and Galaxy Z Fold 5, these two devices have witnessed a positive response from consumers with 100,000 pr… [+2260 chars]"}, {"source": {"id": null, "name": "PhoneArena"}, "author": "Tsveta Ermenkova", "title": "5 celebrities who don't use an iPhone and the surprising reasons why - PhoneArena", "description": "For ages, Apple has reigned as the celebrity tech darling. But guess what? Not every big star sips the iPhone-flavored Kool-Aid. Check out which famous people prefer Android phones over iPhones.", "url": "https://www.phonearena.com/news/5-celebrities-who-dont-use-an-iPhone-and-the-surprising-reasons-why_id149663", "urlToImage": "https://m-cdn.phonearena.com/images/article/149663-wide-two_1200/5-celebrities-who-dont-use-an-iPhone-and-the-surprising-reasons-why.jpg", "publishedAt": "2023-08-11T11:56:56Z", "content": "Alright, let's roll out the carpet and give a nod to these 5 celebs who've taken a different path. Starting off with the billionaire honcho himself, Bill Gates, the Microsoft maestro. \r\nWord is, he r… [+2580 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Bacteria found in hot springs may be closest to mitochondria precursor - Phys.org", "description": "A group of genomic researchers at the Center for Genomic Sciences, in Mexico, working with a colleague from the Institute of Biotechnology, also in Mexico, has found a type of bacteria that might be the closest modern relative of the mitochondria precursor.", "url": "https://phys.org/news/2023-08-bacteria-hot-closest-mitochondria-precursor.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/bacteria-found-in-hot.jpg", "publishedAt": "2023-08-10T12:48:35Z", "content": "A group of genomic researchers at the Center for Genomic Sciences, in Mexico, working with a colleague from the Institute of Biotechnology, also in Mexico, has found a type of bacteria that might be … [+2877 chars]"}]}