{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Way To Develop Drugs Without Side Effects – To Treat Obesity, Pain, Osteoporosis, and Neurological Disorders - SciTechDaily", "description": "Researchers discovered a novel method to activate G-protein coupled receptors from inside the cells, and it helps develop drugs without side effects. The team identified a molecule, PCO371, that interacts with the intracellular region of a specific GPCR, offe…", "url": "https://scitechdaily.com/new-way-to-develop-drugs-without-side-effects-to-treat-obesity-pain-osteoporosis-and-neurological-disorders/", "urlToImage": "https://scitechdaily.com/images/GPCR-Trageted-Response.jpg", "publishedAt": "2023-06-10T02:26:36Z", "content": "An artists impression of the GPCR activation from inside the cell. Credit: Kobayashi and Kawakami et al., 2023\r\nResearchers discovered a novel method to activate G-protein coupled receptors from insi… [+4508 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for June 10: Complete your outfit collection - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for June 10: You can win bundles, diamond vouchers, skins, weapon crates, pets and new characters. Don’t forget to claim today’s rewards.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-june-10-complete-your-outfit-collection-71686363358389.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/10/1600x900/048_1654217194104_1686363402777.jpg", "publishedAt": "2023-06-10T02:23:10Z", "content": "Garena Free Fire MAX Redeem Codes for June 10: Do you only focus on your HP during the game or do you also focus on the EP? Ethical Power (EP) is a crucial tool that can keep you from dying during co… [+2362 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Reddit CEO doubles down on attack on Apollo developer in drama-filled AMA - TechCrunch", "description": "Reddit’s unpopular decision to revise its API pricing in a move that’s forcing third-party apps out of business has taken a weird turn. In an AMA hosted today by Reddit co-founder and CEO Steve Huffman, aka u/spez on the internet forum site, the exec doubled …", "url": "https://techcrunch.com/2023/06/09/reddit-ceo-doubles-down-on-attack-on-apollo-developer-in-drama-filled-ama/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/03/reddit.jpg?resize=1200,800", "publishedAt": "2023-06-09T21:22:30Z", "content": "Reddit’s unpopular decision to revise its API pricing in a move that’s forcing third-party apps out of business has taken a weird turn. In an AMA hosted today by Reddit co-founder and CEO Steve Huffm… [+6611 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Raghav Ohri", "title": "ED issues show-cause notice to Xiaomi India top officials, 3 banks - Economic Times", "description": "The adjudicating authority under the Foreign Exchange Management Act has issued show-cause notices to Xiaomi Technology India Private Limited, the two executives, CITI Bank, HSBC Bank and Deutsche Bank AG, the agency said in a statement.", "url": "https://economictimes.indiatimes.com/news/india/ed-issues-show-cause-notice-to-xiaomi-india-top-officials-3-banks/articleshow/100882034.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100882034,width-1070,height-580,imgsize-911688,overlay-economictimes/photo.jpg", "publishedAt": "2023-06-09T19:13:00Z", "content": "The Enforcement Directorate's Adjudicating Authority has issued show-cause notices under the Foreign Exchange Management Act (FEMA) to Xiaomi Technology India Private Limited, its officials and three… [+2238 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Nathan Birch", "title": "Assassin’s Creed Mirage Shows Off Classic Parkour, Improved Sealth, New Enemy Types, More - Wccftech", "description": "Assassin's Creed Mirage shows off surprisingly promising-looking parkour and stealth in a new deep dive dev video.", "url": "https://wccftech.com/assassins-creed-mirage-deep-dive-parkour-better-stealth-new-enemies/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2022/09/WCCFassassinscreedmirage1.jpg", "publishedAt": "2023-06-09T16:58:00Z", "content": "A couple weeks ago during the big PlayStation Showcase, we got our first look at Assassins Creed Mirage in action, and the reaction was somewhat mixed. While many were excited about its back-to-basic… [+2634 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Research takes first steps towards realizing mechanical qubits - Phys.org", "description": "Quantum information (QI) processing may be the next game changer in the evolution of technology, by providing unprecedented computational capabilities, security and detection sensitivities. Qubits, the basic hardware element for quantum information, are the b…", "url": "https://phys.org/news/2023-06-mechanical-qubits.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/first-steps-towards-re.jpg", "publishedAt": "2023-06-09T16:40:49Z", "content": "Quantum information (QI) processing may be the next game changer in the evolution of technology, by providing unprecedented computational capabilities, security and detection sensitivities. Qubits, t… [+7571 chars]"}, {"source": {"id": null, "name": "Tech4gamers.com"}, "author": "Avinash Jaisrani", "title": "Assassin's Creed Mirage Gameplay Highlights Stealth And Classic Elements - Tech4Gamers", "description": "A new developer diary from Ubisoft is live, showing a look at Ubisoft's approach to the classic elements in Assassin's Creed Mirage.", "url": "https://tech4gamers.com/assassins-creed-mirage-gameplay-stealth/", "urlToImage": "https://tech4gamers.com/wp-content/uploads/2023/06/Assassins-Creed-Mirage-1.webp", "publishedAt": "2023-06-09T16:21:51Z", "content": "Assassin’s Creed Mirage finally showed the much-anticipated return of classic elements from the franchise during the PlayStation Showcase. This trailer highlighted various elements, encouraging fans … [+2125 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 9 June 2023: Webb Telescope snaps Pandora Cluster - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Abell 2744, also known as the Pandora’s Cluster of galaxies which is located about 4 billion light-years away towards the constellation of Sculptor.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-9-june-2023-webb-telescope-snaps-pandora-cluster-71686309004223.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/Untitled_design_1686309185416_1686309191921.jpg", "publishedAt": "2023-06-09T11:18:18Z", "content": "Most galaxies exist in groups or clusters with dozens or hundreds of members, and these cluster galaxies are all in constant motion, pulled and twisted by their neighbour's gravity. Galaxies exist in… [+2514 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "First Sketch Map of the Subglacial Geology of Thwaites Glacier Revealed - AZoCleantech", "description": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affecting it.", "url": "https://www.azocleantech.com/news.aspx?newsID=33532", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_33532_16863038512135959.jpg", "publishedAt": "2023-06-09T09:44:00Z", "content": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affe… [+3961 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Furqan Shahid", "title": "YouTuber Shows Just How Good Apple’s Customer Service Is Compared To Samsung As Apple Took Just 5 Days To Repair And Return The Device Whereas Samsung Took Almost A Month - Wccftech", "description": "Have you ever wondered how just how good Samsung or Apple's customer service is when it comes to repairing phones? Here's your chance to understand things.", "url": "https://wccftech.com/youtuber-shows-just-how-good-apples-customer-service-is-compared-to-samsung-as-apple-took-just-5-days-to-repair-and-return-the-device-whereas-samsung-took-almost-a-month/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/anton-maksimov-5642-su-R2ljPFJju1s-unsplash.jpg", "publishedAt": "2023-06-08T16:02:00Z", "content": "Experiencing damage to your phone is never really a good thing. Especially if that is the only device you own because, in such a case, you would have to send the device away for repairs. When it come… [+2433 chars]"}]}