{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Selective Destruction – Scientists Propose New Theory of Aging - SciTechDaily", "description": "A new editorial paper published in the journal Aging argues that in multicellular organisms, neighboring cells are in constant competition. The underlying reasons for aging have long remained elusive. However, in 1977, Thomas Kirkwood hypothesized that organi…", "url": "https://scitechdaily.com/selective-destruction-scientists-propose-new-theory-of-aging/", "urlToImage": "https://scitechdaily.com/images/Clock-Aging-Particles.jpg", "publishedAt": "2023-09-17T15:42:35Z", "content": "Researchers propose a novel aging theoryselective destruction theory (SDT)which describes aging as a process not tied to damage accumulation, offering a new perspective in gerontology research.\r\nA ne… [+1942 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade setup for Monday: Top 15 things to know before the opening bell - Moneycontrol", "description": "Based on the OI percentage, 55 stocks were on the short-covering list. These included Balrampur Chini Mills, HDFC Bank, Tech Mahindra, Nestle India, and Coromandel International.", "url": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-monday-top-15-things-to-know-before-the-opening-bell-59-11382931.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/09/market_volatile-3-770x433.jpg", "publishedAt": "2023-09-17T13:33:13Z", "content": "The Indian equity market has been witnessing a consistent rally and most experts are expecting a consolidation. If the current momentum continues, then the immediate resistance for the Nifty50 can be… [+9981 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Volodymyr Usov", "title": "When SpaceX's Starship is ready to settle Mars, will we be? (op-ed) - Space.com", "description": "In due time, we will extend our civilization into the final frontier, surmounting our evolutionary limitations through technological and biological enhancements.", "url": "https://www.space.com/spacex-starship-ready-mars-humanity-ready", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LM2cdLZauUjiQ8iLDuTjBE-1200-80.jpg", "publishedAt": "2023-09-17T12:58:52Z", "content": "Volodymyr Usov is a technology entrepreneur from Ukraine who served as a chairman of the State Space Agency of Ukraine in 2020 and 2021. He is a co-founder of Kurs Orbital, a start-up developing an a… [+12296 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple's latest devices, Tecno Pova 5 Pro review and more | Tech It Out: Ep 127 | Full Show - WION", "description": "In this week's show, we talk about how China has been allegedly spying on Western countries. We tell you if you should buy Tecno Pova 5 Pro or not. Watch the...", "url": "https://www.youtube.com/watch?v=eV-3kfmC7-4", "urlToImage": "https://i.ytimg.com/vi/eV-3kfmC7-4/maxresdefault.jpg", "publishedAt": "2023-09-17T10:30:19Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm alert! A CME just hit the Earth today and more are coming - HT Tech", "description": "The volatile sun has unleashed yet another strong coronal mass ejection (CME) that has actually gone on to hit the Earth sparking fears of a solar storm today.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-a-cme-just-hit-the-earth-today-and-more-are-coming-71694942610484.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/17/1600x900/Solar_Storm_1694942822959_1694942823098.jpg", "publishedAt": "2023-09-17T09:28:13Z", "content": "Solar activity has been on the rise, with recent developments stoking concerns about potential repercussions for our planet. On September 17th, as predicted, Earth was hit by a Coronal Mass Ejection … [+2687 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Hit by iPhone 12 radiation issue, here is what Apple will do next - HT Tech", "description": "Authorities in France informed Apple about the iPhone 12 radiation threat and that it exceeded European Union regulations levels.", "url": "https://tech.hindustantimes.com/mobile/news/hit-by-iphone-12-radiation-issue-here-is-what-apple-will-do-next-71694935461837.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/17/1600x900/iPhone_12_1694612403611_1694935635289.png", "publishedAt": "2023-09-17T07:31:59Z", "content": "On September 12, 2023, Apple launched its most anticipated iPhone 15 models at the grand Apple \"Wonderlust\" event. During the event, Apple simultaneously discontinued the iPhone 12, which was origina… [+2422 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Sushant Singh", "title": "Redmi Note 13 Pro+ tipped to come in IP68 certified body ahead of its official launch - The Tech Outlook", "description": "Smartphones that are no less than a pocket-sized powerhouse with huge storage and capabilities are constantly exposed to accidental spills, rain, and everyday dust. In such conditions, it becomes necessary that smartphones not only come with some of", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/redmi-note-13-pro-tipped-to-come-in-ip68-certified-body-ahead-of-its-official-launch/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/09/Redmi-Note-13-Series-Launching-this-Month-Note-13-Pro-Key-Specs-Revealed-1.jpg", "publishedAt": "2023-09-16T17:39:14Z", "content": "Smartphones that are no less than a pocket-sized powerhouse with huge storage and capabilities are constantly exposed to accidental spills, rain, and everyday dust. In such conditions, it becomes nec… [+1135 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Francesco De Meo", "title": "Nintendo Switch 2 SOC May Be Produced on a 5nm Process Node; To Have Max Clock Speed Higher Than 2.5 GHz - Wccftech", "description": "A new video shared online today provides some interesting information on the Nintendo Switch 2, such as the process node used for the SOC and more", "url": "https://wccftech.com/nintendo-switch-2-soc-5nm-clock-speed-2-5-ghz/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2022/08/nintendo-switch-sales-HD-scaled.jpg", "publishedAt": "2023-09-16T10:33:00Z", "content": "The Nintendo Switch 2 SOC may be produced on a 5nm process node and have a maximum clock speed of over 2.5 GHz, according to information unearthed today.\r\nIn a new video shared on YouTube, Doctre 81 … [+1641 chars]"}]}