{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Scientists Discover a Weird Material Made of Subatomic Particles - ScienceAlert", "description": "Scientists are always looking for the next weird and wonderful material, and they've just found it: A bosonic correlated insulator to give it its technical name, which is both a new material and, indeed, a whole new state of matter.", "url": "https://www.sciencealert.com/scientists-discover-a-weird-material-made-of-subatomic-particles", "urlToImage": "https://www.sciencealert.com/images/2023/06/MoirePattern.jpg", "publishedAt": "2023-06-20T06:17:39Z", "content": "Scientists are always looking for the next weird and wonderful material, and they've just found it: A bosonic correlated insulator to give it its technical name, which is both a new material and, ind… [+3173 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Google Translate-like AI tool can interpret Cuneiform, a 5000-year-old writing system! - HT Tech", "description": "A recently developed AI tool might be able to unearth mysteries of the past by translating a 5000-year-old writing system into English!", "url": "https://tech.hindustantimes.com/tech/news/google-translate-like-ai-tool-can-interpret-cuneiform-a-5000-year-old-writing-system-71687232855975.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/20/1600x900/Untitled_design_1687233330640_1687233337610.jpg", "publishedAt": "2023-06-20T03:57:37Z", "content": "The artificial intelligence (AI) revolution has taken the world by storm. The emergence of AI tools such as ChatGPT and Google Bard has had a profound impact on how we access and process information,… [+3135 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid hurtling towards Earth at fast pace; Will come dangerously close today! - HT Tech", "description": "An asteroid is expected to make its closest approach to Earth today, NASA has revealed. Will it impact Earth? Know shocking details.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-hurtling-towards-earth-at-fast-pace-will-come-dangerously-close-today-71687227269198.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/20/1600x900/asteroid_1681212528521_1681718818919_1681719004344_1687227413748.jpg", "publishedAt": "2023-06-20T02:17:18Z", "content": "An asteroid, given the designation of Asteroid 2023 LT1, is on its way towards Earth today, June 20. The asteroid was spotted by NASA's Defense Coordination Office (PDCO), which is responsible for mo… [+1801 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth's “Boring Billion” – Study Unveils 19-Hour Days in Earth's Deep Past - SciTechDaily", "description": "Contrary to traditional belief, Earth's day length was not consistently shorter in the past but may have stalled at about 19 hours for about a billion years, according to a study published in Nature Geoscience. This period of stable day length intriguingly co…", "url": "https://scitechdaily.com/earths-boring-billion-study-unveils-19-hour-days-in-earths-deep-past/", "urlToImage": "https://scitechdaily.com/images/Earths-Opposing-Tides.jpg", "publishedAt": "2023-06-20T02:06:03Z", "content": "ByChinese Academy of SciencesJune 19, 2023\r\n600-million-year-old sedimentary rock preserving Milankovitch cycles that allow for Earths ancient day length to be detected. Credit: Ross Mitchell\r\nContra… [+5014 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Elizabeth Rayne", "title": "Parker Solar Probe images the launch of the solar wind - Ars Technica", "description": "This discovery is literally the hottest thing in a while.", "url": "https://arstechnica.com/science/2023/06/parker-solar-probe-images-the-launch-of-the-solar-wind/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-3-760x380.jpeg", "publishedAt": "2023-06-19T11:15:25Z", "content": "Enlarge/ An artist's depiction of the Parker Solar Probe, along with its subject.\r\n11 with \r\nThe solar wind swarms with charged particles that can light up auroras, cause satellites to glitch, and da… [+4426 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Seismic Signals From Space: Intriguing Correlation Between Earthquakes and Cosmic Radiation Discovered - SciTechDaily", "description": "Scientists have found a strong statistical link between changes in cosmic radiation and seismic activity, potentially aiding in earthquake prediction. However, the ability to predict specific locations remains unclear, and the discovery has led to intriguing …", "url": "https://scitechdaily.com/seismic-signals-from-space-intriguing-correlation-between-earthquakes-and-cosmic-radiation-discovered/", "urlToImage": "https://scitechdaily.com/images/Impending-Earthquakes-Can-Be-Detected-in-Space-scaled.jpg", "publishedAt": "2023-06-18T23:16:08Z", "content": "ByThe Henryk Niewodniczanski Institute of Nuclear Physics Polish Academy of SciencesJune 18, 2023In space, you can see impending earthquakes. Not so literally, as in the above collage of photos, but … [+8311 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Molecule NPY and Weight Gain: How Chronic Stress Drives the Brain To Crave Comfort Food - SciTechDaily", "description": "Scientists have found that stress coupled with a high-calorie diet increases the brain's reward signals for food consumption, leading to weight gain. They attribute this to the molecule NPY, produced under stress, and the suppression of satiety response in th…", "url": "https://scitechdaily.com/molecule-npy-and-weight-gain-how-chronic-stress-drives-the-brain-to-crave-comfort-food/", "urlToImage": "https://scitechdaily.com/images/Unhealthy-Fried-Junk-Food.jpg", "publishedAt": "2023-06-18T10:46:55Z", "content": "Researchers from the Garvan Institute of Medical Research in Sydney have discovered a link between stress and excessive eating, particularly of high-calorie comfort food, leading to weight gain. The … [+5321 chars]"}]}