{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physicists Create Continuous Time Crystal for the First Time - SciTechDaily", "description": "Scientists have succeeded for the first time in realizing a time crystal that spontaneously breaks continuous time translation symmetry. The researchers, from the Institute of Laser Physics at the University of Hamburg, reported their observation in a study p…", "url": "https://scitechdaily.com/physicists-create-continuous-time-crystal-for-the-first-time/", "urlToImage": "https://scitechdaily.com/images/Abstract-Red-Crystals.gif", "publishedAt": "2022-07-03T08:08:31Z", "content": "Researchers observe continuous time crystal for the first time. (Artists concept.)\r\nScientists have succeeded for the first time in realizing a time crystal that spontaneously breaks continuous time … [+2171 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Oppo F21 Series on Offer: Get up to 18% price cut, Exchange offer and more - HT Tech", "description": "Amazon is offering a great deal on Oppo F21 series. From discount, exchange offer and more- here are all the benefits that you can avail.", "url": "https://tech.hindustantimes.com/how-to/oppo-f21-series-on-offer-get-up-to-18-price-cut-exchange-offer-and-more-71656830728568.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/03/1600x900/Untitled_design_(29)_1656830767667_1656830788718.png", "publishedAt": "2022-07-03T06:55:35Z", "content": "The Oppo F21 series is on sale on Amazon today. Yes, you can get both the Oppo F21 Pro and F21 Pro 5G at discounted rates along with exchange and bank offers. However, it needs to be noted the phones… [+2655 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple bans dangerous app! Delete from your iPhone now, it can call on your behalf, take photos - HT Tech", "description": "This dangerous spyware has targeted several iPhone and Android users! Apple has banned the app now. Know what you should do to avoid this spyware on your iPhone.", "url": "https://tech.hindustantimes.com/tech/news/apple-bans-dangerous-app-delete-from-your-iphone-now-it-can-call-on-your-behalf-take-photos-71656830869880.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/03/1600x900/leon-seibert-8_ZHWUiAnRk-unsplash_1618123954560_1656830977674.jpg", "publishedAt": "2022-07-03T06:50:30Z", "content": "Apple iPhones are being attacked by a most dangerous app, which Apple has now banned. This latest spyware is capable of hacking your iPhone! Googles Threat Analysis Group (TAG), which keeps a track a… [+2026 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Digitisation & Innovation: Exploring the Business of Fashion In Africa - Guardian Nigeria", "description": "The era of digitisation and technological development has enabled many African creative businesses - including fashion - to gain global visibility, reach a broader, more diverse audience and customer base, and various opportunities for more revenue.", "url": "https://editor.guardian.ng/life/digitisation-innovation-exploring-the-business-of-fashion-in-africa/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/07/Feature-Image.jpg", "publishedAt": "2022-07-03T06:02:00Z", "content": "David Akinfenwa\r\nThe era of digitisation and technological development has enabled many African creative businesses – including fashion – to gain global visibility, reach a broader, more diverse audi… [+9426 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Ariston goes renewable with water heaters, saves 75% energy cost - Guardian Nigeria", "description": "Considering the power situation in the country, Ariston, an operator in the thermal comfort industry, has introduced new water heater technologies that can save about 75 per cent energy cost...", "url": "https://guardian.ng/business-services/business/ariston-goes-renewable-with-water-heaters-saves-75-energy-cost/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/07/Ariston.jpg", "publishedAt": "2022-07-03T03:39:00Z", "content": "Head of Sales, Central Africa, Ariston Group, Solomon Umoh (left); Director, Central Africa, Ariston Group, Richmond Aguiar and Head of Marketing, Central Africa, Ariston Group, Habeeb Somoye during … [+27 chars]"}, {"source": {"id": null, "name": "CNET"}, "author": "Lisa Eadicicco", "title": "The iPhone's Next Breakthrough Features May Depend on These Technologies - CNET", "description": "Apple's smartphone just turned 15. Lidar and AI could play a big role in where the iPhone goes next, experts say.", "url": "https://www.cnet.com/tech/mobile/features/iphones-next-breakthrough-features-may-depend-these-technologies/", "urlToImage": "https://www.cnet.com/a/img/resize/518d49903cdde5377b60cec582d70910305bc6f7/hub/2022/06/27/d54290c3-0635-407e-b421-28214ffa78ef/breakthough-iphone-technologies-static.png?auto=webp&fit=crop&height=675&width=1200", "publishedAt": "2022-07-02T23:28:00Z", "content": "For Lucy Edwards, a blind, UK-based journalist and broadcaster, maintaining a social distance in public during the height of the pandemic was challenging. That's why she tried People Detection, a fea… [+10791 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ABC News", "title": "1 person dead in accident at Michigan air show involving jet-powered truck - ABC News", "description": "The crash occurred during the \"pyrotechnic portion\" of the air show, police said.", "url": "https://abcnews.go.com/US/person-dead-accident-air-show-involving-jet-powered/story?id=86129671", "urlToImage": "https://s.abcnews.com/images/US/airshow-accident-ht-rc-220702_1656798854385_hpMain_16x9_992.jpg", "publishedAt": "2022-07-02T23:01:35Z", "content": "One person is dead after an accident during the \"pyrotechnic portion\" of an air show in Michigan, police said.\r\nThe incident occurred Saturday shortly after 1 p.m. at the Battle Creek Field of Flight… [+1620 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Tom Bedford", "title": "Samsung Galaxy S22 Ultra vs iPhone 13 Pro Max camera test: why one is my favorite - Techradar", "description": "Only one goes the distance", "url": "https://www.techradar.com/news/samsung-galaxy-s22-ultra-vs-iphone-13-pro-max-camera-test-why-one-is-my-favorite", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rAdwiUFK4N9nSPmbKfRonR-1200-80.jpg", "publishedAt": "2022-07-02T15:00:34Z", "content": "If you've got money to burn and want to buy a smartphone that's top of its league for photography, you've basically got two choices.\r\nThe Samsung Galaxy S22 Ultra and iPhone 13 Pro Max are both good … [+8365 chars]"}, {"source": {"id": null, "name": "Goodyfeed.com"}, "author": "George Yang", "title": "Popular Minecraft YouTuber Technoblade Dies of Cancer at Age 23 - Goody Feed", "description": "He started his YouTube channel when he was just 13 years old. Here's what happened.", "url": "https://goodyfeed.com/technoblade/", "urlToImage": "https://goodyfeed.com/wp-content/uploads/2022/07/Technoblade.jpg", "publishedAt": "2022-07-02T07:13:00Z", "content": "If youre into Minecraft, youd know Technoblade.\r\nThe YouTuber, who had about 12 million subscribers, started his YouTube channel back in 2013, when he was mere 13 years old, playing Minecraft. He had… [+1773 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Study of Ancient Mass Extinction Reveals Dinosaurs Took Over Earth Amid Ice, Not Warmth - SciTechDaily", "description": "Thriving in a Series of Sudden Global Chills That Killed Competitors Many of us are familiar with the popular theory of how the dinosaurs died 66 million years ago: in Earth’s violent collision with a meteorite, followed by a global winter caused by dust and …", "url": "https://scitechdaily.com/study-of-ancient-mass-extinction-reveals-dinosaurs-took-over-earth-amid-ice-not-warmth/", "urlToImage": "https://scitechdaily.com/images/Feathered-Theropod-Dinosaur.jpg", "publishedAt": "2022-07-02T04:45:54Z", "content": "ByColumbia Climate SchoolJuly 1, 2022\r\nWith a lava flow in the distance, a primitively feathered theropod dinosaur carries off a mammalian victim during a snowy volcanic winter caused by massive erup… [+11369 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Soft' CRISPR may offer a new fix for genetic defects: Targeted repairs with 'nicks' of single DNA strands provide foundation for novel disease therapies - Science Daily", "description": "Scientists have developed a new CRISPR-based technology that could offer a safer approach to correcting genetic defects. The new 'soft' CRISPR approach makes use of natural DNA repair machinery, providing a foundation for novel gene therapy strategies with th…", "url": "https://www.sciencedaily.com/releases/2022/07/220701143121.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-07-01T19:14:15Z", "content": "Curing debilitating genetic diseases is one of the great challenges of modern medicine. During the past decade, development of CRISPR technologies and advancements in genetics research brought new ho… [+4572 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "How The Top 5 African Wearable Brands Fared In the Ist Quarter Of 2022 - Techpoint Africa", "description": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report", "url": "https://techpoint.africa/2022/07/01/how-the-top-5-african-wearable-brands-fared-in-the-ist-quarter-of-2022", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image.jpeg", "publishedAt": "2022-07-01T13:16:42Z", "content": "The biggest African technology brands are breaking into the worldwide wearables market to meet the needs of African consumers. Canalys recently added a report on the Africans wearable market analysis… [+4227 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": null, "title": "Oraimo Watch Pro vs Samsung Galaxy Watch 4 - Techpoint Africa", "description": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart", "url": "https://techpoint.africa/2022/07/01/oraimo-watch-pro-vs-samsung-galaxy-watch-4", "urlToImage": "https://admin.techpoint.africa/wp-content/uploads/2022/07/image-1.png", "publishedAt": "2022-07-01T13:11:27Z", "content": "This comparison of the Oraimo Watch Pro and the Samsung Galaxy Watch 4 matches the two most popular smart watches on the market. With both of these smart watches on the market, you may be confused wh… [+3122 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": null, "title": "Simpli ACV Keto Gummies Reviews (Weight Loss 2022) Simply Health ACV Gummies | HIDDEN DANGER Revealed? - The Week", "description": "Latest news from India, World, Entertainment, Science, Health and Technology", "url": "https://www.theweek.in", "urlToImage": "https://www.theweek.in/etc/designs/week/img/logo-main.png", "publishedAt": "2022-07-01T10:26:47Z", "content": "Punjab Cong MLA Khaira claims tax evasion scam of Rs 44,000 crore"}]}