{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Shackleton Shadows Unveiled: NASA Stunning Moon Camera Mosaic Sheds Light on Lunar South Pole - SciTechDaily", "description": "LROC and ShadowCam collaboratively unveil the Shackleton Crater's mosaic, providing unparalleled insights into the lunar South Pole and its potential ice deposits, aiding future lunar exploration missions. A new mosaic of the Shackleton Crater showcases the p…", "url": "https://scitechdaily.com/shackleton-shadows-unveiled-nasa-stunning-moon-camera-mosaic-sheds-light-on-lunar-south-pole/", "urlToImage": "https://scitechdaily.com/images/Shackleton-Crater-Mosaic.jpg", "publishedAt": "2023-09-21T09:42:26Z", "content": "ByNASASeptember 21, 2023\r\nA new mosaic of the Shackleton Crater. Credit: Mosaic created by LROC (Lunar Reconnaissance Orbiter) and ShadowCam teams with images provided by NASA/KARI/ASU\r\nLROC and Shad… [+5527 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Newly Discovered Bone Stem Cell Causes Premature Skull Fusion - Technology Networks", "description": "A previously unknown type of bone-forming stem cell causes premature fusion of the top of the skull in infants, reports a new study.", "url": "https://www.technologynetworks.com/cell-science/news/newly-discovered-bone-stem-cell-causes-premature-skull-fusion-379059", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/379059/newly-discovered-bone-stem-cell-causes-premature-skull-fusion-379059-640x360.jpg?cb=20230921", "publishedAt": "2023-09-21T08:32:56Z", "content": "Craniosynostosis, the premature fusion of the top of the skull in infants, is caused by an abnormal excess of a previously unknown type of bone-forming stem cell, according to a preclinical study led… [+5067 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Genetically modified silkworms produced spider silk six times tougher than the Kevlar - Tech Explorist", "description": "Spider silk is spun by silkworms for the first time, offering a green alternative to synthetic fibers.", "url": "https://www.techexplorist.com/genetically-modified-silkworms-produced-spider-silk-six-times-tougher-kevlar/70603/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/09/spider-silk.jpg", "publishedAt": "2023-09-21T06:09:58Z", "content": "High demand exists for lightweight materials with exceptional strength and toughness. Spider silk, a sustainable material, satisfies these criteria. Still, commercialization is difficult because of t… [+2663 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's OSIRIS-REx Makes Final Course Adjustment Before Asteroid Sample Delivery - SciTechDaily", "description": "NASA's OSIRIS-REx spacecraft fired its thrusters to adjust its trajectory to refine its sample capsule's landing location on Earth, set for September 24, targeting the Defense Department’s Utah Test and Training Range. On September 17, NASA’s OSIRIS-REx engin…", "url": "https://scitechdaily.com/nasas-osiris-rex-makes-final-course-adjustment-before-asteroid-sample-delivery/", "urlToImage": "https://scitechdaily.com/images/OSIRIS-REx-Heads-Home.gif", "publishedAt": "2023-09-20T22:53:10Z", "content": "ByLonnie Shekhtman, NASASeptember 20, 2023\r\nOn September 17, NASA adjusted the trajectory of its OSIRIS-REx spacecraft to fine-tune the landing site for its sample capsule due to return to Earth on S… [+4548 chars]"}]}