{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Oliver Salt", "title": "Zuckerberg vs Musk: X chief Elon leaks private messages with tech rival as he tells him to get serious over $1 - Daily Mail", "description": "Zuckerberg and Musk appeared set to battle it out when the latter tweeted that he was 'up for a cage fight' with his fellow billionaire, who responded by saying: 'Send me location'.", "url": "https://www.dailymail.co.uk/sport/mma/article-12405075/Zuckerberg-vs-Musk-Elon-fight-leaked-messages.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/08/14/14/74298651-0-image-a-48_1692020800236.jpg", "publishedAt": "2023-08-14T13:29:55Z", "content": "Mark Zuckerberg told Elon Musk to get serious over their proposed $1billion super-fight or 'move on' in a string of messages leaked by his tech rival.\r\nZuckerberg and Musk appeared set to battle it o… [+3024 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "How to determine if an AI system is user-friendly and to make it better - HT Tech", "description": "Explore the importance of user-friendliness in AI systems. Learn how to assess, improve, and make AI technology more accessible and easy to use for everyone.", "url": "https://tech.hindustantimes.com/how-to/how-to-determine-if-an-ai-system-is-user-friendly-and-to-make-it-better-71692015932709.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/14/1600x900/AI_1692016227682_1692016228021.jpg", "publishedAt": "2023-08-14T12:34:24Z", "content": "User-friendliness matters a lot for artificial intelligence (AI) systems to be successful. These systems can do complex tasks and even interact with people. Let's find out how to check if an AI syste… [+2079 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Startling Case of “Blue Legs Raises” Concerns Over Long Covid's Unexplored Symptoms - SciTechDaily", "description": "Recent research presents a unique case of a Long Covid patient whose legs turned blue after standing, highlighting the need for increased awareness of acrocyanosis. The study also emphasizes the connection between Long Covid, dysautonomia, and conditions like…", "url": "https://scitechdaily.com/a-startling-case-of-blue-legs-raises-concerns-over-long-covids-unexplored-symptoms/", "urlToImage": "https://scitechdaily.com/images/Long-COVID-‘Blue-Legs-Symptom.jpg", "publishedAt": "2023-08-14T08:26:08Z", "content": "ByUniversity of LeedsAugust 14, 2023\r\nFrom left: Patient standing at 0 minutes; 2 minutes, and 10 minutes. Credit: University of Leeds\r\nRecent research presents a unique case of a Long Covid patient … [+4509 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Superconducting Optomechanical Breakthrough: A Quantum Leap in Mechanical Oscillator Technology - SciTechDaily", "description": "Scientists at EPFL have developed a superconducting circuit optomechanical platform that demonstrates ultra-low quantum decoherence and high-fidelity quantum control. Their groundbreaking work with a “vacuum-gap drumhead capacitor” has led to the longest quan…", "url": "https://scitechdaily.com/superconducting-optomechanical-breakthrough-a-quantum-leap-in-mechanical-oscillator-technology/", "urlToImage": "https://scitechdaily.com/images/Ultra-Coherent-Superconducting-Electro-Mechanical-System.jpg", "publishedAt": "2023-08-14T05:59:20Z", "content": "ByEPFLAugust 13, 2023\r\nScanning electron microscope image of an ultra-coherent superconducting electro-mechanical system. Credit: Amir Youssefi (EPFL)\r\nScientists at EPFL have developed a superconduc… [+5568 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Breaking Physics: Muon G-2 Experiment Reinforces Surprise Result, Setting Up “Ultimate Showdown” - SciTechDaily", "description": "Findings at Fermilab show discrepancy between theory and experiment, which may lead to new physics beyond the Standard Model. Physicists now have a brand-new measurement of a property of the muon called the anomalous magnetic moment that improves the precisio…", "url": "https://scitechdaily.com/breaking-physics-muon-g-2-experiment-reinforces-surprise-result-setting-up-ultimate-showdown/", "urlToImage": "https://scitechdaily.com/images/Sub-Atomic-Particle-Quantum-Physics-Art-Illustration.jpg", "publishedAt": "2023-08-13T15:33:40Z", "content": "ByFermi National Accelerator LaboratoryAugust 13, 2023\r\nFermilabs Muon g-2 experiment has unveiled a new precision measurement of the muons magnetic property, hinting at undiscovered particles and a … [+10610 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Fresh iPhone 15 Pro leaks hint at the raw power of Apple's next flagship phone - TechRadar", "description": "Benchmarks and RAM", "url": "https://www.techradar.com/phones/iphone/fresh-iphone-15-pro-leaks-hint-at-the-raw-power-of-apples-next-flagship-phone", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QdhMp6xhWg2kCAqTZACCGh-1200-80.jpg", "publishedAt": "2023-08-13T12:30:21Z", "content": "The iPhone 15 leaks show no sign of letting up as we approach the expected September launch – and a couple of bits of new information have given us a better idea of just how powerful the Pro handset … [+1842 chars]"}]}