{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Apple Testing Own Chatbot “Apple GPT” as it Plays Catch-up to ChatGPT - Firstpost", "description": "Apple Testing Own Chatbot as it Plays Catch-up to ChatGPT Apple is developing to its AI Chatbot similar to OpenAI’s ChatGPT. The tech giant has built its own...", "url": "https://www.youtube.com/watch?v=cH7jZyqAmqM", "urlToImage": "https://i.ytimg.com/vi/cH7jZyqAmqM/maxresdefault.jpg", "publishedAt": "2023-07-20T13:14:50Z", "content": null}, {"source": {"id": null, "name": "MacRumors"}, "author": "Hartley Charlton", "title": "Apple Threatens to Pull FaceTime and iMessage in the UK Over Proposed Surveillance Law Changes - MacRumors", "description": "Apple says it will pull services including FaceTime and iMessage in the UK if plans to amend surveillance legislation that would require tech...", "url": "https://www.macrumors.com/2023/07/20/apple-threatens-to-pull-facetime-and-imessage-uk/", "urlToImage": "https://images.macrumors.com/t/n72gXAq-55QcsXTWEyHi3Zy3FoE=/1600x/article-new/2022/09/apple-regent-street-hires.jpeg", "publishedAt": "2023-07-20T12:10:02Z", "content": "Apple says it will pull services including FaceTime and iMessage in the UK if plans to amend surveillance legislation that would require tech companies to make major security and privacy changes go a… [+2579 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Stargazing delight! Mars, Venus, and Mercury to align with the crescent Moon tonight - HT Tech", "description": "Tonight, witness a celestial spectacle: Mars, Venus, Mercury, and the crescent moon align in the western sky after sunset.", "url": "https://tech.hindustantimes.com/tech/news/stargazing-delight-mars-venus-and-mercury-to-align-with-the-crescent-moon-tonight-71689835055538.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/20/1600x900/Stargazing_1689835318046_1689835318385.jpg", "publishedAt": "2023-07-20T06:44:30Z", "content": "Get ready for an extraordinary celestial treat tonight as the night sky unveils a mesmerising gathering of celestial bodies shortly after sunset. Despite hazy skies caused by Canadian wildfires in so… [+2268 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Venezuela joins China-led space program - Global Times", "description": "“Venezuela is going to the Moon!” Gabriela Jimenez, Venezuela’s vice president and minister of science and technology, wrote with great excitement in a twitter post on Tuesday after she signed a joint statement on the China-led International Lunar Research St…", "url": "https://www.globaltimes.cn/page/202307/1294734.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2022/2022-11-09/b2168458-2382-4cbc-a1eb-188987c9c3f1_s.jpeg", "publishedAt": "2023-07-19T18:33:00Z", "content": "The moon is seen during a total lunar eclipse in Sydney, Australia, Nov. 8, 2022.(Photo: Xinhua)\r\n Venezuela is going to the Moon! Gabriela Jimenez, Venezuelas vice president and minister of science … [+1179 chars]"}]}