{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Analytics Insight"}, "author": "Harshini", "title": "Top Tech News Today: Next Week, Android Users Can Enjoy OpenAI's ChatGPT App. Ripple CEO Expresses Appreciation to Congressional Crypto Allies - Analytics Insight", "description": "OpenAI has announced that ChatGPT, an AI chatbot, will be accessible to Android users as an app similar to the iOS version starting next week.", "url": "https://www.analyticsinsight.net/top-tech-news-today-next-week-android-users-can-enjoy-openais-chatgpt-app-ripple-ceo-expresses-appreciation-to-congressional-crypto-allies/", "urlToImage": "https://www.analyticsinsight.net/wp-content/uploads/2023/07/Top-Tech-News-Today-Next-Week-Android-Users-Can-Enjoy-OpenAIs-ChatGPT-App.jpg", "publishedAt": "2023-07-24T06:10:57Z", "content": "For Android OpenAI ChatGPT app has been built to provide an identical experience to its iOS version\r\n Good morning tech fam, here are some quick tech updates for you to catch on to!\r\nWhats New Today:… [+3399 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After debris breaks off DART target asteroid, NASA tracks another asteroid heading for Earth - HT Tech", "description": "Asteroid 2015 MA54 will make an extremely close approach to Earth today, and NASA has revealed details such as its speed, size, and distance of approach. Here’s everything we know so far.", "url": "https://tech.hindustantimes.com/tech/news/after-debris-breaks-off-dart-target-asteroid-nasa-tracks-another-asteroid-heading-for-earth-71690164234864.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/24/1600x900/orbit-viewer-snapshot_1690164317575_1690164326675.jpg", "publishedAt": "2023-07-24T02:06:32Z", "content": "The National Aeronautics and Space Administration (NASA) made history on September 26, 2022, as it successfully carried out its first-ever planetary defense test to protect Earth against potential as… [+2055 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "maheen soomro", "title": "The Future of Space Exploration: Upcoming Missions, Technologies, and Human Colonization - Medium", "description": "Space exploration has always captivated humanity’s imagination, and in recent years, advancements in technology have brought us closer to exploring the cosmos like never before. From ambitious…", "url": "https://medium.com/@maheensoomro183/the-future-of-space-exploration-upcoming-missions-technologies-and-human-colonization-ca0f3b119eb1", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*bhUe5phx8rdGNiHvkfnhDA.png", "publishedAt": "2023-07-23T16:07:57Z", "content": "Prologue:\r\nSpace exploration has always captivated humanitys imagination, and in recent years, advancements in technology have brought us closer to exploring the cosmos like never before. From ambiti… [+3499 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Marijuana Use May Alter Your DNA Methylation - SciTechDaily", "description": "Recent and long-term marijuana use is linked to changes in the human epigenome, a new Northwestern Medicine study published in the journal Molecular Psychiatry has found. Marijuana ranks as the most widely used drug in the United States. Data from the Centers…", "url": "https://scitechdaily.com/warning-marijuana-use-may-alter-your-dna-methylation/", "urlToImage": "https://scitechdaily.com/images/Marijuana-Body-Effects-Art-Concept.jpg", "publishedAt": "2023-07-23T02:33:02Z", "content": "ByNorthwestern UniversityJuly 22, 2023\r\nA study by Northwestern Medicine links recent and long-term marijuana use to changes in the human epigenome. The research identified significant epigenetic cha… [+5543 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Warning: GPS Data Could Detect Large Earthquakes Hours Before They Happen - SciTechDaily", "description": "A systematic global analysis of GPS time-series data from nearly 100 large earthquakes suggests the existence of a precursory phase of fault slip that occurs about two hours before seismic rupture. The analysis of Global Positioning System (GPS) time-series d…", "url": "https://scitechdaily.com/early-warning-gps-data-could-detect-large-earthquakes-hours-before-they-happen/", "urlToImage": "https://scitechdaily.com/images/GPS-Earthquake-Art.jpg", "publishedAt": "2023-07-22T15:41:50Z", "content": "ByWalter Beckwith, American Association for the Advancement of Science (AAAS)July 22, 2023\r\nA comprehensive analysis of GPS time-series data suggests a precursory phase of fault slip occurs two hours… [+3751 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Samsung Galaxy S24 rumored to be missing out on one key camera upgrade - TechRadar", "description": "The same selfies", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/samsung-galaxy-s24-rumored-to-be-missing-out-on-one-key-camera-upgrade", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5v5fDnsJP2DxVyLzRC7y76-1200-80.jpg", "publishedAt": "2023-07-22T11:30:39Z", "content": "We're hoping that the Samsung Galaxy S24 will be with us in the early part of 2024, but the latest rumor to reach our ears suggests that there's one key component that won't be getting an upgrade nex… [+1699 chars]"}]}