{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Life’s stresses can make people focus more on their romantic partner’s negative behavior - Tech Explorist", "description": "Can stressful life circumstances affect how partners see each other?", "url": "https://www.techexplorist.com/life-stresses-people-focus-romantic-partners-negative-behavior/53973/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/09/fighting-couples.jpg", "publishedAt": "2022-09-27T09:12:10Z", "content": "Stressful experiences external to a marriage are often associated with poor relationship functioning and lowered marital satisfaction. This phenomenon is known as stress spillover. However, little at… [+3007 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"This Would Not Work For India\": Gautam Adani Mirrors PM Modi Comments - NDTV", "description": "Billionaire Gautam Adani said China will feel increasingly isolated as rising nationalism, shifts in supply chains and technology curbs threaten the world's second-biggest economy.", "url": "https://www.ndtv.com/india-news/billionaire-gautam-adani-says-china-will-feel-increasingly-isolated-3381215", "urlToImage": "https://c.ndtvimg.com/2022-09/bcd0rqjg_gautam-adani_625x300_27_September_22.jpg", "publishedAt": "2022-09-27T08:34:00Z", "content": "Gautam Adani's conglomerate is marshaling its resources into renewables.\r\nBillionaire Gautam Adani said China will feel increasingly isolated as rising nationalism, shifts in supply chains and techno… [+2485 chars]"}, {"source": {"id": null, "name": "TechNode"}, "author": "Ward Zhou", "title": "Vivo launches X Fold+ with a high-end processor · TechNode - TechNode", "description": "Chinese phone vendor Vivo launched its second generation foldable phone, the X Fold+, in China at a release event on Monday night.", "url": "http://technode.com/2022/09/27/vivo-updates-foldable-phone-x-fold-with-high-end-qualcomm-processor/", "urlToImage": "https://technode.com/wp-content/uploads/2022/09/Screenshot-2022-09-27-at-14.24.34-2.jpg", "publishedAt": "2022-09-27T07:27:20Z", "content": "Every Wednesday and Friday, TechNodes Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\r\nChinese phone vendor Vivo launched its second generatio… [+2723 chars]"}, {"source": {"id": null, "name": "Technewstoday.com"}, "author": "chunan", "title": "What Is XAPK File? How To Open And Install It On Android - Tech News Today", "description": "When you download a software or a game on your Android system, you will receive an APK file. Upon running these files, it will install the downloaded app.", "url": "https://www.technewstoday.com/how-to-install-xapk-file/", "urlToImage": "https://www.technewstoday.com/wp-content/uploads/2022/09/how-to-install-xapk-file.jpg", "publishedAt": "2022-09-27T07:02:25Z", "content": "When you download a software or a game on your Android system, you will receive an APK file. Upon running these files, it will install the downloaded app. Sometime, however, instead of an APK file, y… [+4234 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Erasure” – New Discovery Could Be the Key to Practical Quantum Computing - SciTechDaily", "description": "A new error correction method. Researchers have uncovered a brand-new technique for correcting errors in quantum computer calculations, potentially eliminating a significant barrier to a powerful new field of computing. Error correction is a well-developed su…", "url": "https://scitechdaily.com/erasure-new-discovery-could-be-the-key-to-practical-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Erasure-Errors-in-Quantum-Computing-scaled.jpg", "publishedAt": "2022-09-27T06:12:10Z", "content": "ByPrinceton University, Engineering SchooSeptember 26, 2022\r\nA team led by Jeff Thompson of Princeton University pioneered an approach to more efficient error correction in quantum computers. Credit:… [+4465 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Muzaffar Ismail", "title": "First Impressions: ViewSonic LS550WHE - the ideal projector for your office, classroom or budget home theater? - TechNave", "description": "In these current times of economic uncertainty we tend to look for things that are durable, can last a long time and are relatively more affordable to buy. Whil", "url": "https://technave.com/gadget/First-Impressions-ViewSonic-LS550WHE-the-ideal-projector-for-your-office-classroom-or-budget-home-theater-31941.html", "urlToImage": "https://technave.com/data/files/article/202209270116348169.jpg", "publishedAt": "2022-09-27T06:06:41Z", "content": "In these current times of economic uncertainty we tend to look for things that are durable, can last a long time and are relatively more affordable to buy. While it isn’t always easy to find somethin… [+6118 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "Inno Flores", "title": "Instagram Rolls Out Tests for Home Feed, Replaces Shopping Tab - Tech Times", "description": "The shopping tab has been replaced to a second menu, along with other options like settings and saved posts.", "url": "https://www.techtimes.com/articles/281091/20220926/instagram-shopping-home-ecommerce.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/412192/uae-health-virus-gulf-internet.jpg", "publishedAt": "2022-09-27T03:50:00Z", "content": "Instagram is currently testing home feeds and reveals that the platform is replacing the shopping tab and possibly shifting its e-commerce strategy, as per the report by The Verge.\r\nAs per the users … [+2628 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Eleanor Hayward", "title": "NHS smartwatches offer patients with Parkinson's better life quality - The Times", "description": "More than 100,000 patients with Parkinson’s disease will be prescribed smartwatches and apps on the NHS as part of a technological revolution in treatment.The N", "url": "https://www.thetimes.co.uk/article/nhs-smartwatches-to-give-patients-with-parkinsons-better-life-quality-39tfmphrc", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fb520eb1c-3dc8-11ed-b24d-96120f17513d.jpg?crop=945%2C532%2C0%2C49&resize=1200", "publishedAt": "2022-09-26T23:01:00Z", "content": "More than 100,000 patients with Parkinsons disease will be prescribed smartwatches and apps on the NHS as part of a technological revolution in treatment.\r\nThe National Institute for Health and Care … [+609 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "More price pressure on gold, silver as USDX, bond yields spike up - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2022-09-26/More-price-pressure-on-gold-silver-as-USDX-bond-yields-spike-up.html", "urlToImage": "https://www.kitco.com/news/2022-09-26/images/goldchart_0926_pm.png", "publishedAt": "2022-09-26T15:58:00Z", "content": "Editor's Note: With so much market volatility, stay on top of daily news! Get caught up in minutes with our speedy summary of today's must-read news and expert opinions. Sign up here! \r\n(Kitco News) … [+4032 chars]"}, {"source": {"id": null, "name": "Stuff.co.za"}, "author": "Brett Venter", "title": "There’s less competition in tech than ever – Why that should concern you - Stuff Magazines", "description": "There's nothing wrong with a little healthy competition. Unless you're Mark Zuckerberg, in which case all opposition to your...", "url": "https://stuff.co.za/2022/09/26/theres-less-competition-in-tech-than-ever-why-that-should-concern-you/", "urlToImage": "https://stuff.co.za/wp-content/uploads/2022/09/Competition-main.png", "publishedAt": "2022-09-26T13:52:03Z", "content": "There’s nothing wrong with a little healthy competition. Unless you’re Mark Zuckerberg, in which case all opposition to your plan for world domination should be crushed underfoot. Even then, it may n… [+6207 chars]"}, {"source": {"id": null, "name": "Techeconomy.ng"}, "author": "Yinka Okeowo", "title": "Zenbook 14 OLED (UX3402ZA) Review: ASUS Powerful User-Centric Device - TechEconomy.ng", "description": "The 12th Gen Intel Core i7 Processor, Intel Iris Xe graphics, 16 GB RAM and 1 TB PCIe 4.0 SSD deliver superb performance, and there’s a long-lasting 75 Wh battery.", "url": "https://techeconomy.ng/2022/09/zenbook-14-oled-ux3402za-review-asus-powerful-user-centric-device/", "urlToImage": "https://i0.wp.com/techeconomy.ng/wp-content/uploads/2022/09/Zenbook-14-OLED-UX3402ZA.png?resize=1000%2C600&ssl=1", "publishedAt": "2022-09-26T13:34:54Z", "content": "Zenbook 14 OLED is another powerful gadget. The 16.9 mm slim and 1.39 kg1 light OLED device comes with a breathtaking new design thats timelessly elegant yet totally modern.\r\nAs an ASUS lover you are… [+20248 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Staff Reporter", "title": "SweepSouth raises R200-million in new funding round - TechCentral", "description": "Cape Town-based on-demand home cleaning and services platform SweepSouth has raised a further $11-million in funding.", "url": "https://techcentral.co.za/sweepsouth-raises-r200-million-in-new-funding-round/215640/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2022/09/aisha-pandor-1500-800.jpg", "publishedAt": "2022-09-26T11:09:38Z", "content": "Aisha Pandor\r\nCape Town-based on-demand home cleaning and services platform SweepSouth has raised a further US$11-million (R200-million) in funding, this time led by Alitheia IDF, a private equity fu… [+1833 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Ramaphosa calls for patience as South Africans vent anger over load shedding - BusinessTech", "description": "Writing in his weekly letter to the public, Ramaphosa says there is a sense of despair that the situation does not seem to be improving but it is.", "url": "https://businesstech.co.za/news/energy/628216/ramaphosa-calls-for-patience-as-south-africans-vent-anger-over-load-shedding/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/Ramaphosa-e1614765516165.jpg", "publishedAt": "2022-09-26T10:09:53Z", "content": "President Cyril Ramaphosa says that widespread public anger in the face of load shedding is wholly justified, but asks citizens to have patience as the government makes progress in trying to stop the… [+4765 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Viruses May Be “Watching” You – Lying in Wait Before Multiplying and Killing - SciTechDaily", "description": "Viruses may be ‘watching’ you – some microbes lie in wait until their hosts unintentionally give them the signal to start multiplying and kill them. Especially after more than two years of the COVID-19 pandemic, many people picture a virus as a nasty spiked b…", "url": "https://scitechdaily.com/viruses-may-be-watching-you-lying-in-wait-before-multiplying-and-killing/", "urlToImage": "https://scitechdaily.com/images/Illustration-of-Bacteriophages.jpg", "publishedAt": "2022-09-26T09:14:25Z", "content": "ByIvan Erill, University of Maryland, Baltimore CountySeptember 26, 2022\r\nPhages can sense bacterial DNA damage, which triggers them to replicate and jump ship.\r\nViruses may be watching you some micr… [+8977 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "How is the Hermes Kelly bag made? Find out at this exhibition in Singapore - CNA Luxury", "description": "Get up close and personal with Hermes’ artisans in Singapore as the maison showcases the techniques and crafting process behind its iconic luxury goods at an interactive exhibition.", "url": "https://cnaluxury.channelnewsasia.com/obsessions/hermes-making-exhibition-singapore-mbs-209226", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--nymYKWX0--/c_crop,h_1125,w_2000,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/09/22/hermes_in_the_making_exhibition_singapore.jpg?itok=BgGuGrov", "publishedAt": "2022-09-26T05:44:50Z", "content": "What makes Hermes handbags so revered? What goes into the design of an Hermes timepiece?\r\nIf you have these questions in mind, you may just get them answered at the upcoming Hermes In The Making exhi… [+673 chars]"}, {"source": {"id": null, "name": "Nus.edu.sg"}, "author": "National University of Singapore", "title": "NUS scientists develop novel technique to grow meat in the lab using magnetic field - NUS News", "description": "Scientist from the National University of Singapore (NUS) have found a novel way of growing cell-based meat by zapping animal cells with a magnet. This new technique simplifies the production process of cell-based meat by reducing reliance on animal products,…", "url": "https://news.nus.edu.sg/novel-technique-to-grow-meat-in-the-lab-using-magnetic-field/", "urlToImage": "https://content.presspage.com/uploads/2580/1920_researchteam.jpg?10000", "publishedAt": "2022-09-26T03:00:00Z", "content": "Scientist from the National University of Singapore (NUS) have found a novel way of growing cell-based meat by zapping animal cells with a magnet. This new technique simplifies the production process… [+1578 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "My fears about Nigeria’s energy transition plan - Punch Newspapers", "description": "Ted Nordhaus and Saloni Shah minced no words when they described in their ‘Foreign Policy’ piece that the economic and humanitarian crisis in Sri Lanka was caused by ‘the farrago of magical thinking, technocratic hubris, ideological delusion, self-dealing and…", "url": "https://punchng.com/my-fears-about-nigerias-energy-transition-plan/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/05/02221622/Power-generation.jpg", "publishedAt": "2022-09-26T01:02:32Z", "content": "Ted Nordhaus and Saloni Shah minced no words when they described in their Foreign Policy piece that the economic and humanitarian crisis in Sri Lanka was caused by the farrago of magical thinking, te… [+8550 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Chrysalis: Saturn's Ancient, Missing Moon - SciTechDaily", "description": "Saturn’s Rings and Tilt Could Be the Product of an Ancient, Missing Moon According to a new study, a “grazing encounter” may have smashed the moon to bits to form Saturn’s rings. Swirling around the planet’s equator, the rings of Saturn are an obvious indicat…", "url": "https://scitechdaily.com/chrysalis-saturns-ancient-missing-moon/", "urlToImage": "https://scitechdaily.com/images/Titan-Moon-Orbits-Saturn.jpg", "publishedAt": "2022-09-25T17:44:52Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologySeptember 25, 2022\r\nScientists propose a lost moon of Saturn, which they call Chrysalis, pulled on the planet until it ripped apart, forming rings… [+11286 chars]"}]}