{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Become a Jovian Vortex Hunter: Help NASA by Spotting Vortices on the Planet Jupiter - SciTechDaily", "description": "Jovian Vortex Hunter, a new NASA citizen science project, seeks your help spotting vortices – spiral wind patterns – and other phenomena in photos of the planet Jupiter. Junocam, another NASA citizen science project, seeks help from members of the public proc…", "url": "https://scitechdaily.com/become-a-jovian-vortex-hunter-help-nasa-by-spotting-vortices-on-the-planet-jupiter/", "urlToImage": "https://scitechdaily.com/images/Jupiter-Vortex-Pattern.jpg", "publishedAt": "2022-07-10T21:50:26Z", "content": "ByNASAJuly 10, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisor… [+2131 chars]"}, {"source": {"id": null, "name": "Ausdroid"}, "author": null, "title": "The Hilltop Hoods G-SHOCK watch hands on — It’s so simple, slick and stylish - Ausdroid", "description": "As tech junkies at Ausdroid, we are often drawn to the latest and greatest shiny things that go beep. Recently one caught my eye from G-SHOCK as a collaboration with the Hilltop Hoods. On the surface, it looks really simple and in honesty, it is but damn it’s…", "url": "https://ausdroid.net/2022/07/11/the-hilltop-hoods-g-shock-watch-hands-on-its-so-simple-slick-and-stylish/", "urlToImage": "https://ausdroid.net/wp-content/uploads/2022/07/G-SHOCK-header-scaled.jpg", "publishedAt": "2022-07-10T21:30:14Z", "content": "As tech junkies at Ausdroid, we are often drawn to the latest and greatest shiny things that go beep. Recently one caught my eye from G-SHOCK as a collaboration with the Hilltop Hoods. On the surface… [+2902 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Quantum Sensor Can Detect Electromagnetic Signals of Any Frequency - SciTechDaily", "description": "MIT engineers expand the capabilities of these ultrasensitive nanoscale detectors, with potential uses for biological sensing and quantum computing. With the ability to detect the most minute variations in magnetic or electrical fields, quantum sensors have e…", "url": "https://scitechdaily.com/mit-quantum-sensor-can-detect-electromagnetic-signals-of-any-frequency/", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Technology-Sensors-Concept.jpg", "publishedAt": "2022-07-10T20:39:06Z", "content": "ByDavid L. Chandler, Massachusetts Institute of TechnologyJuly 10, 2022\r\nScientists at MIT have developed a method to enable such quantum sensors to detect any arbitrary frequency, with no loss of th… [+6598 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dark Matter May Not Exist: These Physicists Favor of a New Theory of Gravity - SciTechDaily", "description": "Using Newton’s laws of physics, we can model the motions of planets in the Solar System quite accurately. However, in the early 1970s, scientists discovered that this didn’t work for disc galaxies – stars at their outer edges, far from the gravitational force…", "url": "https://scitechdaily.com/dark-matter-may-not-exist-these-physicists-favor-of-a-new-theory-of-gravity/", "urlToImage": "https://scitechdaily.com/images/Spiral-Galaxy-Spin.gif", "publishedAt": "2022-07-10T19:09:05Z", "content": "ByIndranil Banik, Postdoctoral Research Fellow of Astrophysics, University of St AndrewsJuly 10, 2022Dark matter was proposed to explain why stars at a galaxys far edge were able to move much faster … [+7559 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Harry Davies, Simon Goodley, Felicity Lawrence, Paul Lewis, Lisa O'Carroll", "title": "Uber broke laws, duped police and secretly lobbied governments, leak reveals - The Guardian", "description": "124,000 documents expose inner workings behind US tech firm’s rise as a global empire responsible for 19m journeys a day", "url": "https://www.theguardian.com/news/2022/jul/10/uber-files-leak-reveals-global-lobbying-campaign", "urlToImage": "https://i.guim.co.uk/img/media/5a11a2e3eb94b741de55e754f3b6b7f1f837293d/0_0_5816_3490/master/5816.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=19bdbdcd69a3a7fd3b0b6cb89ac74f9d", "publishedAt": "2022-07-10T16:44:00Z", "content": "A leaked trove of confidential files has revealed the inside story of how the tech giant Uber flouted laws, duped police, exploited violence against drivers and secretly lobbied governments during it… [+13241 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Bluetooth audio for gaming, Yay or Nay? - NL Tech", "description": "Seriously, audio jacks are irreplaceable when it comes to fast-paced games. It is especially important for gaming phones.The app we used to test the audio de...", "url": "https://www.youtube.com/watch?v=5xErSxZP8Ro", "urlToImage": "https://i.ytimg.com/vi/5xErSxZP8Ro/maxresdefault.jpg", "publishedAt": "2022-07-10T12:30:04Z", "content": null}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sohini Das", "title": "Bharat Biotechs Zika vaccine set to go to Phase 2 clinical trials soon - Business Standard", "description": "Doctors point out to lack of testing tools even as they attend to suspected Zika cases", "url": "https://www.business-standard.com/article/companies/bharat-biotech-s-zika-vaccine-set-to-go-to-phase-2-clinical-trials-soon-122071000223_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-06/03/full/1496504981-1795.jpg", "publishedAt": "2022-07-10T07:56:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone deal! Get iPhone 13 Pro with $800 discount THIS way; buy it or wait for iPhone 14? - HT Tech", "description": "iPhone 13 Pro price cut: You can get the iPhone 13 Pro with a discount of $800. Know the whole iPhone Pro deal here.", "url": "https://tech.hindustantimes.com/how-to/iphone-deal-get-iphone-13-pro-with-800-discount-this-way-buy-it-or-wait-for-iphone-14-71657388373440.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/09/1600x900/iPhone_13_Pro_Max_(7)_1632411404068_1657388585727.jpg", "publishedAt": "2022-07-09T17:43:22Z", "content": "iPhone 13 Pro price cut by as much as $800? That may sound unrealistic to believe, but US Mobile telecommunication company T-Mobile is actually offering the Pro version of the iPhone 13 series with t… [+2234 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Space Telescopes First Full Color Images, Important Mission to the Moon - SciTechDaily", "description": "Ready to showcase the Webb space telescope’s first full-color images … Back in touch with a spacecraft on an important mission to the Moon …. And our Artemis I Moon rocket and spacecraft move a step closer to launch … a few of the stories to tell you about – …", "url": "https://scitechdaily.com/this-week-nasa-webb-space-telescopes-first-full-color-images-important-mission-to-the-moon/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Webb-First-Full-Color-Images.gif", "publishedAt": "2022-07-09T14:37:33Z", "content": "ByNASAJuly 9, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisory… [+2452 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The rand is being tested as fears of a US recession mount - BusinessTech", "description": "The rand’s 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportive.", "url": "https://businesstech.co.za/news/finance/604862/the-rand-is-being-tested-as-fears-of-a-us-recession-mount/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2022-07-09T06:20:18Z", "content": "The rands 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportiv… [+4123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Creatures Fill Puzzling Gap in the Fossil Record - SciTechDaily", "description": "Research reveals yunnanozoans as the oldest known stem vertebrates. New findings answer questions in the fossil record. The puzzling gap in the fossil record that would explain the evolution of invertebrates to vertebrates has long perplexed scientists. Verte…", "url": "https://scitechdaily.com/extinct-creatures-fill-puzzling-gap-in-the-fossil-record/", "urlToImage": "https://scitechdaily.com/images/Yunnanozoan-Artistic-Reconstruction-scaled.jpg", "publishedAt": "2022-07-09T03:36:51Z", "content": "Artistic reconstruction of the yunnanozoan from the Cambrian Chengjiang biota shows basket-like pharyngeal skeletons. Credit: Dinghua Yang\r\nResearch reveals yunnanozoans as the oldest known stem vert… [+4848 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "April Fowell", "title": "Japan Plans to Create a Laser Beam to Eliminate Satellite Debris in Space - Tech Times", "description": "Japan Aerospace Exploration Agency is experimenting with a laser beam to deal with space junk.", "url": "https://www.techtimes.com/articles/277825/20220708/japan-plans-to-create-a-laser-beam-to-eliminate-satellite-debris-in-space.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/407955/textures-with-negative-space.jpg", "publishedAt": "2022-07-09T03:00:00Z", "content": "Japan is looking for ways to deal with space debris. Ever since the space age began, space junk that consists of satellites, rocket parts, and wreckage from collisions has been piling up. It is even … [+2821 chars]"}]}