{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gadgets 360 With TG: Poco M6 5G, Honor 90 GT and Honor Pad 9 Launched and More Tech News - NDTV", "description": "Poco M6 5G was launched in India as the company's latest M-series phone to debut in the country. It is equipped with a 50-megapixel rear camera and will be a...", "url": "https://www.youtube.com/watch?v=1PXxBJ5pUJs", "urlToImage": "https://i.ytimg.com/vi/1PXxBJ5pUJs/maxresdefault.jpg", "publishedAt": "2023-12-23T17:45:00Z", "content": null}, {"source": {"id": null, "name": "MarketWatch"}, "author": "James Rogers", "title": "Musk's SpaceX hits rocket milestone in latest Starlink Falcon 9 launch - MarketWatch", "description": "Elon Musk’s private space company SpaceX has pioneered reusable rocket technology", "url": "https://www.marketwatch.com/story/musks-spacex-hits-rocket-milestone-in-latest-starlink-falcon-9-launch-7e6f4046", "urlToImage": "https://images.mktw.net/im-40500833/social", "publishedAt": "2023-12-23T08:19:00Z", "content": "SpaceX marked a milestone for its reusable rocket technology in the early hours of Saturday when the company launched 23 Starlink satellites into low earth orbit from Cape Canaveral Space Force Stati… [+1766 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Surpasses Reality: White AI Faces More Convincing Than Real Humans - SciTechDaily", "description": "New research shows that AI-generated white faces appear more realistic than real human faces, signaling potential risks of racial bias and misinformation in AI technology. White faces generated by artificial intelligence (AI) now appear more real than human f…", "url": "https://scitechdaily.com/ai-surpasses-reality-white-ai-faces-more-convincing-than-real-humans/", "urlToImage": "https://scitechdaily.com/images/AI-Face-Generation-Analysis.jpg", "publishedAt": "2023-12-22T21:33:20Z", "content": "A study reveals that AI-generated white faces are now perceived as more real than actual human faces, with a notable discrepancy in the realism of AI faces of people of color. This trend, attributed … [+3562 chars]"}]}