{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Barron's"}, "author": "Emese Bartha, Dow Jones Newswires, Brian Swint, George Glover, Adam Clark, Giulia Petroni, Dow Jones Newswires, Jessica Fleetham, Dow Jones Newswires, Kosaku Narioka, Dow Jones Newswires", "title": "Stock Market News: Dow Set to Open Down - Barron's", "description": "Dow, S&P 500, and Nasdaq futures are falling in premarket trading Wednesday as the stock market continues to rotate from Big Tech stocks to smaller caps.", "url": "https://www.barrons.com/livecoverage/stock-market-today-071724", "urlToImage": "https://images.barrons.com/im-783602/social", "publishedAt": "2024-07-17T10:12:00Z", "content": "U.S. stock futures were dropping early Wednesday as the prospect of lower interest rates shifted interest to smaller companies over the high-value technology firms that have recently driven gains.\r\nF… [+1174 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "80.lv"}, "author": "Theodore McKenzie", "title": "170,000+ YouTube Videos Were Used by Silicon Valley Giants to Train AI - 80.lv", "description": "Asking the opinions of YouTube creators themselves never occurred to tech companies.", "url": "https://80.lv/articles/170-000-youtube-videos-were-used-by-silicon-valley-giants-to-train-ai/", "urlToImage": "https://cdn.80.lv/api/upload/meta/35106/images/6697458573cca/contain_1200x630.jpg", "publishedAt": "2024-07-17T04:21:40Z", "content": "Proof News, in collaboration with Wired, has published an extensive investigative report stating that numerous tech companies, including NVIDIA, Apple, Salesforce, and Anthropic, have used content fr… [+807 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "OnePlus Nord 4 vs OnePlus 12R: Price, display, processor, battery and more compared | Mint - Mint", "description": "The OnePlus 12R offers premium features with a Snapdragon 8 Gen 2 chipset, advanced display technology, and a versatile camera setup at a higher price. The OnePlus Nord 4 provides a balanced, budget-friendly option with a Snapdragon 7+ Gen 3 chipset, bright d…", "url": "https://www.livemint.com/technology/gadgets/oneplus-nord-4-vs-oneplus-12r-price-display-processor-battery-and-more-compared-11721149706582.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/07/16/1600x900/cds_1721135649426_1721149930003.jfif", "publishedAt": "2024-07-17T04:11:17Z", "content": "At their summer launch event in Milan, Italy, OnePlus introduced the newest version of their budget-friendly Nord series: the OnePlus Nord 4. This phone features a metal unibody design and is powered… [+4807 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 7 images of celestial wonders captured by Webb and Hubble telescopes shared by NASA - HT Tech", "description": "Top 7 images of celestial wonders captured by Webb and Hubble telescopes shared by NASA The James Webb Space telescopes nearinfrared image reveals the vibrant Penguin and Egg galaxies in shades of pink and blue. Thousands of galaxies and stars dot the backgro…", "url": "https://tech.hindustantimes.com/web-stories/top-7-images-of-celestial-wonders-captured-by-webb-and-hubble-telescopes-shared-by-nasa-71721208756213.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/17/1600x900/Top_7_images_of_celestial_wonders_1721208891979_1721208892265.jpg/", "publishedAt": "2024-07-17T04:09:35Z", "content": "Photo Credit: NASA The James Webb Space telescope's near-infrared image reveals the vibrant Penguin and Egg galaxies in shades of pink and blue. Thousands of galaxies and stars dot the background, cr… [+1355 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "https://www.cnbctv18.com", "title": "Dow Jones sees best day in more than a year with 700 point rally, Russell 2000 jumps 3% - CNBCTV18", "description": "The rotation from megacap tech stocks to smaller cyclical names began last week after June's CPI data in the US showed the lowest inflation in three years.", "url": "https://www.cnbctv18.com/market/us-markets-tuesday-dow-jones-700-point-rally-record-high-best-day-since-june-2023-russell-2000-fed-trump-19444382.htm", "urlToImage": "https://images.cnbctv18.com/uploads/2020/04/SP_wallstreet1.jpg?im=FitAndFill,width=500,height=300", "publishedAt": "2024-07-17T00:32:22Z", "content": "US markets on Wall Street continued to hit new highs on Tuesday as the names beyond big-tech and megacap stocks began contributing to the surge amidst renewed hopes of rate cuts from the US Federal R… [+1994 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Eternal Day and Night: Webb’s Journey To Understand a Distant World’s Bizarre Atmosphere - SciTechDaily", "description": "Near-infrared spectral analysis of terminator confirms differences in morning and evening atmosphere. Since the first exoplanet was discovered in 1992, thousands of planets orbiting stars outside of our solar system have been confirmed through a myriad of dif…", "url": "https://scitechdaily.com/eternal-day-and-night-webbs-journey-to-understand-a-distant-worlds-bizarre-atmosphere/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-WASP-39-b-and-Star-scaled.jpg", "publishedAt": "2024-07-16T20:46:00Z", "content": "Researchers using the James Webb Space Telescope have uncovered atmospheric differences on the exoplanet WASP-39 b, revealing temperature variations and distinct cloud cover across its tidally locked… [+10506 chars]"}]}