{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Improving recyclable waste classification with laser-induced breakdown spectroscopy: Coupling spectroscopy with sorting algorithms paves the way for more efficient and reliable waste segregation in the future - Science Daily", "description": "Delving into the intricacies of waste management, researchers explore the application of laser-induced breakdown spectroscopy technology for the identification and classification of recyclable waste. They collected and analyzed the spectra of 80 recyclable wa…", "url": "https://www.sciencedaily.com/releases/2023/07/230725122952.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-07-25T21:35:10Z", "content": "Managing and classifying waste accurately for reuse is a growing challenge in environmental protection. Addressing this issue, researchers at Hefei University of Technology in China have embarked on … [+2720 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Kari Paul", "title": "Alphabet stocks rise after second-quarter profits exceed expectations - The Guardian", "description": "The sunny report establishes a continued rebound for the tech company after a difficult 2022 and thousands of job cuts", "url": "https://www.theguardian.com/technology/2023/jul/25/alphabet-google-q2-earnings-report-stock", "urlToImage": "https://i.guim.co.uk/img/media/c6629ffd6b6b331f328010cb52820a40c3eb6d6a/0_199_6048_3627/master/6048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=61c70f795426c95104d2ac3f06289272", "publishedAt": "2023-07-25T21:07:00Z", "content": "Alphabet stocks rose in after-hours trading on Tuesday after the Google parent companys second-quarter profits exceeded Wall Street expectations, amid a rebound in advertising dollars and the growing… [+3301 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta and Sarah Perez", "title": "Meta’s Threads app is rolling out a Following feed - TechCrunch", "description": "Meta's text-based social network Threads is rolling out one of the most requested features after its launch — a following feed.", "url": "https://techcrunch.com/2023/07/25/metas-threads-app-is-rolling-out-a-following-feed/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/07/Threads-GettyImages-1524134312.jpg?resize=1200,800", "publishedAt": "2023-07-25T16:13:52Z", "content": "Meta’s text-based social network Threads is rolling out one of the most requested features after its launch a Following feed. The company has also announced the ability to see posts youve liked in yo… [+3919 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Himani Jha, Manas Mitul", "title": "Noise Luna Ring Smart Wearable With Heart Rate Monitor, SpO2 Sensor Launched in India: Details | Technology News - Gadgets 360", "description": "Noise has launched its first smart ring, the Luna Ring, in India on Tuesday. The latest smart wearable from the Indian manufacturer brand comes equipped with several health sensors including a heart rate monitor, temperature sensor and SpO2 sensor. The new sm…", "url": "https://www.gadgets360.com/wearables/news/noise-luna-ring-launch-in-india-specifications-features-4239339", "urlToImage": "https://i.gadgets360cdn.com/large/Noise_Luna_Ring_main_1690297108743.jpg", "publishedAt": "2023-07-25T15:00:30Z", "content": "Noise has launched its first smart ring, the Luna Ring, in India on Tuesday. The latest smart wearable from the Indian manufacturer comes equipped with several health sensors including a heart rate m… [+2682 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Samsung Galaxy Unpacked Seoul event live updates: New Fold5, Flip5 to be unveiled - The Indian Express", "description": "Get ready for the Samsung Galaxy Unpacked 2023 event, where we will see the new foldables, watches, and tablets from the tech giant. Follow our live blog for the latest updates.", "url": "https://indianexpress.com/article/technology/tech-news-technology/samsung-galaxy-unpacked-2023-live-updates-8859677/", "urlToImage": "https://images.indianexpress.com/2023/07/galaxy-unpacked-2023-featured1.jpg", "publishedAt": "2023-07-25T14:30:16Z", "content": "Samsung's second major launch event for the year is here. (Image: Nandagopal Rajan/Indian Express)Welcome to our live blog on the Galaxy Unpacked 2023 event, where we will bring you the latest update… [+1062 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Akash Podishetti", "title": "Q1 Results Preview: What's in store for Tech Mahindra, Dr Reddy's, Cipla, Tata Consumer, BPCL, PNB - Economic Times", "description": "Following its IT peers, Tech Mahindra is expected to see a muted quarter with sequential decline in communications revenue and flat growth in the enterprise segment", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/q1-results-preview-whats-in-store-for-tech-mahindra-dr-reddys-cipla-tata-consumer-bpcl-pnb/articleshow/102113393.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102113391,width-1070,height-580,imgsize-182712,overlay-etmarkets/photo.jpg", "publishedAt": "2023-07-25T14:28:00Z", "content": "A host of companies, including Tech Mahindra, Dr Reddy's, Cipla, Tata Consumer, BPCL, and PNB will announce their first quarter results on Wednesday. Here's a brief look at what the companies might r… [+3002 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Dr. Prajakta Banik", "title": "Brain networks use electric fields to store memories - Tech Explorist", "description": "Electric fields coordinate brain networks to encode memories.", "url": "https://www.techexplorist.com/electric-fields-coordinate-brain-networks-encode-memories/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/brain-1.jpg", "publishedAt": "2023-07-25T10:26:14Z", "content": "The human brain’s remarkable capacity to store and retrieve memories has long fascinated neuroscientists. Decades of research have elucidated the key brain regions involved in memory processing. Howe… [+4888 chars]"}]}