{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "Google reportedly plans to cut ties with Scale AI - TechCrunch", "description": "Meta’s massive investment in Scale AI may be giving some of the startup’s biggest customers pause. Reuters reports that Google had planned to pay Scale AI $200 million this year but is now planning to cut ties with the startup and is having conversations with…", "url": "https://techcrunch.com/2025/06/14/google-reportedly-plans-to-cut-ties-with-scale-ai/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2199793091.jpg?w=1024", "publishedAt": "2025-06-14T18:46:54Z", "content": "Metas big investment in Scale AI may be giving some of the startups customers pause.\r\nReuters reports that Google had planned to pay Scale $200 million this year but is now having conversations with … [+963 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "The App Store’s new AI-generated tags are live in the beta - TechCrunch", "description": "Apple's plans to improve App Store discoverability using AI tagging techniques are now available in the developer beta build of iOS 26. However, the tags", "url": "https://techcrunch.com/2025/06/14/the-app-stores-new-ai-generated-tags-are-live-in-the-beta/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/apple-app-store-ios-2021.jpg?w=1180", "publishedAt": "2025-06-14T16:01:49Z", "content": "Apple’s plans to improve App Store discoverability using AI tagging techniques are now available in the developer beta build of iOS 26.\r\nHowever, the tags do not appear on the public App Store as of … [+1786 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Amanda Silberling", "title": "Apple’s Liquid Glass design is paving the way for AR glasses - TechCrunch", "description": "This visual overhaul gives us a glimpse into the design of Apple's rumored AR glasses, which will reportedly debut next year.", "url": "https://techcrunch.com/2025/06/13/apples-liquid-glass-design-is-paving-the-way-for-ar-glasses/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/06/liquid-glass.jpeg?resize=1200,694", "publishedAt": "2025-06-13T18:00:15Z", "content": "At Apple’s WWDC 2025 event, the company announced its most dramatic software design change in over a decade: Liquid Glass. This visual overhaul gives us a glimpse into what might be coming in Apple’s… [+2299 chars]"}]}