{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Polly Allcock", "title": "Details about the new bezel-less Realme Smart TV X Full HD revealed ahead of launch - Notebookcheck.net", "description": "Information about the new Realme Smart TV X Full HD series has been unveiled ahead of the scheduled April 29th launch in India. The almost bezel-less HD TV will come with 43-in and 40-in options. The gadget will have Dolby Audio and Realme Chroma Boost techno…", "url": "https://www.notebookcheck.net/Details-about-the-new-bezel-less-Realme-Smart-TV-X-Full-HD-revealed-ahead-of-launch.615432.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/Realme_smart_TV_Full_HD.png", "publishedAt": "2022-04-25T14:28:22Z", "content": "Details about the new Realme Smart TV X Full HD have been revealed ahead of the product launch in India on April 29th. Listings on Realme and Flipkarts websites describe some specifications, with an … [+1121 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Gov't discussing possible PHL investment by US battery tech company - BusinessWorld Online", "description": "THE Department of Trade and Industry (DTI) said it met with US battery technology company ZAF Energy Systems, Inc. and its affiliate Battery Grade Materials, Inc. (BGM) in Washington, DC, to discuss the possibility of an investment in the Philippines.", "url": "https://www.bworldonline.com/economy/2022/04/25/444490/govt-discussing-possible-phl-investment-by-us-battery-tech-company/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/04/Data-Center-1.jpg", "publishedAt": "2022-04-25T12:13:11Z", "content": "THE Department of Trade and Industry (DTI) said it met with US battery technology company ZAF Energy Systems, Inc. and its affiliate Battery Grade Materials, Inc. (BGM) in Washington, DC, to discuss … [+3698 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Henry Kwan", "title": "HUAWEI Watch GT 3 Pro arriving on 28 April can survive up to 30 meters depth in water - TechNave", "description": "HUAWEI&nbsp;has announced the date for introducing the&nbsp;Pro version of Watch GT 3. Before that happens, the company has dropped some&nbsp;teasers&nbsp;confi", "url": "https://technave.com/gadget/HUAWEI-Watch-GT-3-Pro-arriving-on-28-April-can-survive-up-to-30-meters-depth-in-water-29797.html", "urlToImage": "https://technave.com/data/files/article/202204251154408940.png", "publishedAt": "2022-04-25T12:03:09Z", "content": "HUAWEI has announced the date for introducing the Pro version of Watch GT 3. Before that happens, the company has dropped some teasers confirming that the smartwatch will allow users to go down into … [+932 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Nando’s fired a South African employee who ate slices of carrot – here’s what happened - BusinessTech", "description": "Almost four years after being fired for eating two slices of carrot, the Durban Labour Court has ruled that an employee at Nando’s Scottsville must be reinstated.", "url": "https://businesstech.co.za/news/business/580408/nandos-fired-a-south-african-employee-who-ate-slices-of-carrot-heres-what-happened/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Nandos.jpg", "publishedAt": "2022-04-25T10:20:27Z", "content": "Almost four years after being fired for eating two slices of carrot, the Durban Labour Court has ruled that an employee at Nandos Scottsville must be reinstated.\r\nDuring his disciplinary hearing in J… [+4190 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "NASA: International Space Station almost crashes into space junk - HT Tech", "description": "On Saturday, the International Space Station was forced to take emergency evasive maneuvers in order to avoid crashing into space debris. It was an unplanned but a necessary move by NASA to avoid colliding with the space junk floating nearby. Read on to find …", "url": "https://tech.hindustantimes.com/photos/nasa-international-space-station-almost-crashes-into-space-junk-71650878944037.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/SPACE-EXPLORATION-ISS-RUSSIA-0_1630413730142_1650879070719.JPG", "publishedAt": "2022-04-25T09:36:56Z", "content": "Top SectionsExplore Tech\r\n Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Venus Rotates, Slowly, Despite Sun’s Powerful Gravitational Pull - SciTechDaily", "description": "The planet’s atmosphere explains the gravity of the situation. Venus, Earth’s sister planet would likely not rotate, if not for its soupy, fast-moving atmosphere. Instead, Venus would be fixed in place, always facing the sun the way the same side of the moon …", "url": "https://scitechdaily.com/why-venus-rotates-slowly-despite-suns-powerful-gravitational-pull/", "urlToImage": "https://scitechdaily.com/images/Venus-in-Transit.jpg", "publishedAt": "2022-04-25T09:29:23Z", "content": "ByUniversity of California - RiversideApril 25, 2022\r\nA sequence of images from Solar Dynamic Observatory in 171 angstroms of the Venus transit, merged together to show the path of Venus across the s… [+2201 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Ramaphosa says load shedding unacceptable – and is coming to an end - BusinessTech", "description": "President Cyril Ramaphosa says it is ‘difficult and unacceptable’ that South Africa continues to face ongoing load shedding, with his government now working to ensure it comes to a permanent end.", "url": "https://businesstech.co.za/news/energy/580356/ramaphosa-says-load-shedding-unacceptable-and-is-coming-to-an-end/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/PresidentRamaphosa.jpg", "publishedAt": "2022-04-25T09:28:15Z", "content": "President Cyril Ramaphosa says it is ‘difficult and unacceptable’ that South Africa continues to face ongoing load shedding, with his government now working to ensure it comes to a permanent end.\r\nWr… [+4574 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa facing Covid wave test in coming weeks - BusinessTech", "description": "The resurgence of Covid cases in South Africa and signs of a possible fifth wave of infections will be a test for South Africa’s government and the country’s new pandemic restrictions, says Business Leadership South Africa chief executive Busi Mavuso.", "url": "https://businesstech.co.za/news/business/580192/south-africa-facing-covid-wave-test-in-coming-weeks/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Ramaphosa-e1604392561571.jpg", "publishedAt": "2022-04-25T07:56:09Z", "content": "The resurgence of Covid cases in South Africa and signs of a possible fifth wave of infections will test South Africa’s government and the country’s new pandemic restrictions, says Business Leadershi… [+4125 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "10 jobs that offer the most work-from-home options in South Africa right now - BusinessTech", "description": "Property data from FNB shows that a significant number of South Africa’s offices are standing empty, despite the lifting of almost all lockdown restrictions and calls for a return to work.", "url": "https://businesstech.co.za/news/business/580182/10-jobs-which-offer-the-most-work-from-home-options-in-south-africa-right-now/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/04/WorkFromHome-e1650870741632.jpeg", "publishedAt": "2022-04-25T07:23:02Z", "content": "A new CareerJunction analysis of job trends shows that remote-working opportunities have climbed significantly in South Africa over the last 12 months. The group recorded a 160% increase in these opp… [+3356 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Hassan Mujtaba", "title": "NVIDIA Ada Lovelace GPUs To Have A Node Advantage Over AMD RDNA 3, Rumored To Utilize TSMC 4N Process - Wccftech", "description": "NVIDIA Ada Lovelace GPUs for next-gen GeForce RTX 40 Gaming graphics cards will have a node advantage over AMD RDNA 3 in the form of TSMC 4N.", "url": "https://wccftech.com/nvidia-ada-lovelace-gpus-4n-process-node-advantage-over-5nm-amd-rdna-3/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2022/04/2022-03-22_20-29-40-2060x1159-very_compressed-scale-4_00x-Custom-740x416.png", "publishedAt": "2022-04-25T07:10:36Z", "content": "NVIDIA's Ada Lovelace GPUs for next-gen GeForce RTX 40 Gaming graphics cards will have a node advantage over AMD's RDNA 3, as reported by Moore's Law is Dead.\r\nNVIDIA Ada Lovelace Gaming GPUs Rumored… [+3746 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "India, EU launch new body to tackle challenges in trade, tech - Hindustan Times", "description": "This is the first time that India has agreed to set up such a trade and technology council with any of its partners | Latest News India", "url": "https://www.hindustantimes.com/india-news/india-eu-launch-new-body-to-tackle-challenges-in-trade-tech-101650870156077.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/25/1600x900/India-FM_1650870821971_1650870830791.jpg", "publishedAt": "2022-04-25T07:02:35Z", "content": "New Delhi: India and the European Union (EU) on Monday launched the India-EU Trade and Technology Council, a strategic mechanism to tackle challenges at the nexus of trade, trusted technology, and se… [+1877 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Bleak load shedding forecast for South Africa - BusinessTech", "description": "South Africa’s record power outages last week will likely be a shock to the country’s Q2 GDP growth, say economists at the Bureau for Economic Research (BER).", "url": "https://businesstech.co.za/news/energy/580140/bleak-load-shedding-forecast-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/04/LoadShedding-e1650866731523.jpg", "publishedAt": "2022-04-25T06:16:32Z", "content": "South Africa’s record power outages last week will likely shock the country’s Q2 GDP growth, say economists at the Bureau for Economic Research (BER).\r\nIn a research note on Monday (25 April), the gr… [+2251 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Updated R350 grant rules for South Africa - BusinessTech", "description": "The Department of Social Development has announced that South Africans will need to reapply for the R350 Social relief of distress grant as the government moves away from the national state of disaster framework.", "url": "https://businesstech.co.za/news/finance/580124/updated-r350-grant-rules-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand1-scaled-e1606294571290.jpg", "publishedAt": "2022-04-25T05:53:28Z", "content": "The Department of Social Development has announced that South Africans will need to reapply for the R350 Social relief of distress grant as the government moves away from the national state of disast… [+1687 chars]"}, {"source": {"id": null, "name": "Cilisos.my"}, "author": "UiHua", "title": "Samsung Galaxy A33 5G: Biasa in the front, sexy in the back - CILISOS.MY", "description": "For whatever reason, we’ve never done a tech review on Cilisos. So when Samsung Malaysia asked if we’d like to review their latest midrange phone, I jumped at the thought of getting to play with a new phone AND going Mr. Mobile on it. What arrived at our door…", "url": "https://cilisos.my/samsung-galaxy-a33-5g-biasa-in-the-front-sexy-in-the-back/", "urlToImage": "https://cilisos.my/wp-content/uploads/2022/04/A33-5G-featured3.jpg", "publishedAt": "2022-04-25T04:42:41Z", "content": "For whatever reason, we’ve never done a tech review on Cilisos. So when Samsung Malaysia asked if we’d like to review their latest midrange phone, I jumped at the thought of getting to play with a ne… [+5071 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ganymede Casts a Massive Shadow Across Jupiter in Spectacular New Image From NASA’s Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft captured this magnificent view of Jupiter during the mission’s 40th close pass by the giant planet on February 25, 2022. The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede. Citizen scientist Thomas …", "url": "https://scitechdaily.com/ganymede-casts-a-massive-shadow-across-jupiter-in-spectacular-new-image-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-04-25T04:21:29Z", "content": "Figure 1. Citizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was about 44,000 … [+2849 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Third Dose Vaccine Protection Against Hospitalization Wanes After 3 Months - SciTechDaily", "description": "Kaiser Permanente finds the Pfizer COVID-19 third dose vaccine protection against hospitalization from omicron wanes after 3 months. A research study released on April 22, 2022, in The Lancet Respiratory Medicine shows that a booster dose of the Pfizer COVID-…", "url": "https://scitechdaily.com/covid-19-third-dose-vaccine-protection-against-hospitalization-wanes-after-3-months/", "urlToImage": "https://scitechdaily.com/images/Three-COVID-19-Vaccine-Doses.jpg", "publishedAt": "2022-04-24T19:13:44Z", "content": "ByKaiser PermanenteApril 24, 2022\r\nA new research study published in The Lancet Respiratory Medicine shows that protection against the omicron variant deteriorates over time even after a third vaccin… [+3947 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tom Huddleston", "title": "Some of tech's biggest names want a future without passwords — here's what that would look like - CNBC", "description": "From Google to Microsoft, some of tech's biggest names say the dream of a password-less internet is close to reality. The truth is a little more complicated.", "url": "https://www.cnbc.com/2022/04/24/what-a-future-without-passwords-would-look-like-when-it-might-happen.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106197655-1571819572820gettyimages-866481488.jpeg?v=1571887535&w=1920&h=1080", "publishedAt": "2022-04-24T13:30:01Z", "content": "Managing your online passwords can be a chore.\r\nCreating the sort of long, complicated passwords that best deter cyber-thieves especially for dozens of different online accounts can be tedious. But i… [+4631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What a good credit score looks like and how to improve it - BusinessTech", "description": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your ability to continue improving your life over the long term.", "url": "https://businesstech.co.za/news/finance/579878/what-a-good-credit-score-looks-like-and-how-to-improve-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/06/money-e1467040680257.jpg", "publishedAt": "2022-04-24T09:03:21Z", "content": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your abili… [+4305 chars]"}]}