{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple iPhone 15 launch date leaked! Know when sales will likely start too - HT Tech", "description": "A major leak has revealed the date when iPhone 15 series will likely be unveiled to the world. Know the likely date for the Apple fall event and when you may get to purchase the upcoming smartphones.", "url": "https://tech.hindustantimes.com/mobile/news/apple-iphone-15-launch-date-leaked-know-when-sales-will-likely-start-too-71691123918331.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/04/1600x900/felix-fischer-1m0BBZpeSUs-unsplash_1689268741940_1691123984549.jpg", "publishedAt": "2023-08-04T04:44:20Z", "content": "Apple fans have been waiting for the announcement of the biggest event of the year by the company for long and now a massive leak may well have given them a date. Yes, iPhone 15 launch date has been … [+1953 chars]"}, {"source": {"id": null, "name": "MarketWatch"}, "author": "Emily Bary", "title": "Apple's Tim Cook explains why he won't showboat around AI - MarketWatch", "description": "There’s a reason Apple has been quieter than most about AI, and it’s not because the company is sleeping on the technology", "url": "https://www.marketwatch.com/story/apples-tim-cook-explains-why-he-wont-showboat-around-ai-7f5fd073", "urlToImage": "https://images.mktw.net/im-829640/social", "publishedAt": "2023-08-03T23:03:00Z", "content": "If Apple Inc.s Thursday earnings call sounded a bit different than other recent ones from Big Tech players, perhaps that was due to a noticeable lack of artificial-intelligence discussion. In fact, A… [+2637 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jason Rainbow", "title": "SpaceX launches Intelsat's last C-band clearing satellite - SpaceNews", "description": "The last satellite Intelsat needs to claim nearly $5 billion in total C-band spectrum clearing proceeds is performing well after launching Aug. 3. on a Falcon 9, its manufacturer Maxar Technologies said.", "url": "https://spacenews.com/spacex-launches-intelsats-last-c-band-clearing-satellite/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/08/Galaxy37_eastgrassh_IMG_2715-scaled.jpg", "publishedAt": "2023-08-03T17:51:43Z", "content": "TAMPA, Fla. The last satellite Intelsat needs to claim nearly $5 billion in total C-band spectrum clearing proceeds is performing well after launching Aug. 3. on a Falcon 9, its manufacturer Maxar Te… [+3931 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm to strike the Earth tomorrow, NOAA issues warning; Multiple CMEs approaching the planet - HT Tech", "description": "According to the NOAA forecast, a solar storm is expected to hit the Earth between August 4 and 5, after multiple faint CMEs were spotted heading towards us. Check details.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-to-strike-the-earth-tomorrow-noaa-issues-warning-multiple-cmes-approaching-the-planet-71691049164265.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/03/1600x900/sun-2224937_1280_1677654423439_1691049918335.jpg", "publishedAt": "2023-08-03T08:23:24Z", "content": "After the lucky escape from a coronal mass ejection (CME) earlier this week, now another solar storm threat is facing us. According to the National Oceanic and Atmospheric Administration (NOAA), a US… [+2568 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Elusive Ghost Shark – Unlocking Secrets of One of the Strangest Deep-Sea Creatures - SciTechDaily", "description": "This summer, a team of researchers from the University of Florida and the Seattle Aquarium is plunging 100 meters beneath the waves in the Pacific Northwest to investigate the enigmatic ghost sharks, one of the ocean's strangest deep-sea creatures. The scient…", "url": "https://scitechdaily.com/the-elusive-ghost-shark-unlocking-secrets-of-one-of-the-strangest-deep-sea-creatures/", "urlToImage": "https://scitechdaily.com/images/Ghost-Shark.jpg", "publishedAt": "2023-08-03T05:21:03Z", "content": "ByUniversity of FloridaAugust 2, 2023\r\nA ghost shark, formally called chimaera. Credit: University of Florida\r\nThis summer, a team of researchers from the University of Florida and the Seattle Aquari… [+3358 chars]"}]}