{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 3 May 2023: The stunning Centaurus A Galaxy - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is the elliptical galaxy NGC 5128, also known as Centaurus A, which is the closest active galaxy to Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-3-may-2023-the-stunning-centaurus-a-galaxy-71683094041916.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/centaurus_a_1683094232374_1683094245561.jpg", "publishedAt": "2023-05-03T06:11:38Z", "content": "Stars, which illuminate the darkness of space, are formed in a giant cloud of dust and gas in space, known as a Nebula. The age, distribution, and composition of the stars in a galaxy trace the histo… [+1817 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Proximity alert! Whopping 180-foot asteroid speeding towards Earth for close approach - HT Tech", "description": "A gigantic asteroid, which is almost as big as an aircraft, could make a very close approach to Earth soon, says NASA.", "url": "https://tech.hindustantimes.com/tech/news/proximity-alert-whopping-180-foot-asteroid-speeding-towards-earth-for-close-approach-71683087806925.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/space-2709026_1280_1683023322018_1683087901216.jpg", "publishedAt": "2023-05-03T04:25:26Z", "content": "Several asteroids make close approaches to Earth on a daily basis. Their close approaches serve as a reminder of the potential danger that asteroids can pose to our planet. Just remember what happene… [+1917 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Scientists use brain scans and AI to 'decode' thoughts - HT Tech", "description": "Scientists said Monday they have found a way to use brain scans and artificial intelligence modelling to transcribe \"the gist\" of what people are thinking, in what was described as a step towards mind reading.", "url": "https://tech.hindustantimes.com/tech/news/scientists-use-brain-scans-and-ai-to-decode-thoughts-71682998003594.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/AI-COMPANIES--1_1680317716958_1680317716958_1683090929990.JPG", "publishedAt": "2023-05-03T03:47:10Z", "content": "Scientists said Monday they have found a way to use brain scans and artificial intelligence modelling to transcribe \"the gist\" of what people are thinking, in what was described as a step towards min… [+4029 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT issued as multiple CMEs charge towards Earth today - HT Tech", "description": "As per NOAA, multiple minor CMEs could collectively launch a solar storm attack on the Earth today, May 3. Know the possible consequences from this event.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-issued-as-multiple-cmes-charge-towards-earth-today-71683085080950.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/03/1600x900/faintyoung_2_1683085147627_1683085147807.jpg", "publishedAt": "2023-05-03T03:42:08Z", "content": "Yesterday, we were discussing the possibility of a solar storm this week as a result of a solar flare eruption on the sunspot AR3288. The early projections revealed that not enough coronal mass eject… [+2576 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Godfather of AI' speaks out on dangers of technology he helped create - KENS 5: Your San Antonio News Source", "description": "Geoffry Hinton resigned from his role at Google and shared concerns about the spread of misinformation and AI displacing jobs.", "url": "https://www.youtube.com/watch?v=QfJdKgTb2q8", "urlToImage": "https://i.ytimg.com/vi/QfJdKgTb2q8/hqdefault.jpg", "publishedAt": "2023-05-03T03:31:16Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Korn", "title": "Why the 'Godfather of AI' decided he had to 'blow the whistle' on the technology - CNN", "description": "Geoffrey Hinton, also known as the \"Godfather of AI,\" decided he had to \"blow the whistle\" on the technology he helped develop after worrying about how smart it was becoming, he told CNN on Tuesday.", "url": "https://www.cnn.com/2023/05/02/tech/hinton-tapper-wozniak-ai-fears/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230502172638-geoffrey-hinton-the-lead-0502.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-03T03:23:00Z", "content": "Geoffrey Hinton, also known as the Godfather of AI, decided he had to blow the whistle on the technology he helped develop after worrying about how smart it was becoming, he told CNN on Tuesday.\r\nIm … [+2915 chars]"}, {"source": {"id": null, "name": "Universe Today"}, "author": "Carolyn Collins Petersen", "title": "ESA Can't Deploy JUICE's Radar Antenna. It Needs It to Scan Under the Ice at Callisto, Europa, and Ganymede - Universe Today", "description": "ESA technicians are still working to free the stuck RIME antenna on the JUICE spacecraft. So far, they've only moved it a little.", "url": "https://www.universetoday.com/161180/esa-cant-deploy-juices-radar-antenna-it-needs-it-to-scan-under-the-ice-at-callisto-europa-and-ganymede/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2023/05/Juices_longest_antenna_awaits_deployment_ESA24834789.jpg", "publishedAt": "2023-05-03T03:02:00Z", "content": "In a scene eerily reminiscent of the Galileo spacecraft’s antenna issues, ESA’s Jupiter Icy Moons Explorer (JUICE) is having a problem with an antenna. The 16-meter-long radar Radar for Icy Moons Exp… [+2701 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Steamy Space Mystery: Webb Telescope Finds Water Vapor, But From a Rocky Planet or Its Star? - SciTechDaily", "description": "More observations will be needed to determine if exoplanet GJ 486 b has an atmosphere. GJ 486 b is about 30% larger than the Earth and three times as massive, which means it is a rocky world with stronger gravity than Earth. It orbits a red dwarf star in just…", "url": "https://scitechdaily.com/?p=273388", "urlToImage": "https://scitechdaily.com/images/Exoplanet-GJ-486-b-scaled.jpg", "publishedAt": "2023-05-03T02:48:17Z", "content": "BySpace Telescope Science InstituteMay 2, 2023\r\nThis artists concept represents the rocky exoplanet GJ 486 b, which orbits a red dwarf star that is only 26 light-years away in the constellation Virgo… [+11290 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: “Peak Venus” and Jupiter Occultation - SciTechDaily", "description": "What are some skywatching highlights in May 2023? Venus reaches its highest point in the evening sky for the year, while Jupiter disappears behind the Moon for some U.S. observers. Plus, some key differences in the Southern Hemisphere's skies compared to thos…", "url": "https://scitechdaily.com/?p=273594", "urlToImage": "https://scitechdaily.com/images/Jupiter-Occultation.jpg", "publishedAt": "2023-05-02T21:06:52Z", "content": "ByNASA's Jet Propulsion LaboratoryMay 2, 2023\r\nAn occultation is a celestial event that occurs when one object is hidden by another object that passes between it and the observer. In this Jupiter occ… [+8778 chars]"}, {"source": {"id": null, "name": "PsyPost"}, "author": "Christina Maher", "title": "Mind reading? New AI system can translate a person's brain activity into a continuous stream of text - PsyPost", "description": "The technology to decode our thoughts is drawing ever closer. Neuroscientists at the University of Texas have for the first time decoded data from non-invasive brain scans and used them to reconstruct language and meaning from stories that people hear, see or…", "url": "https://www.psypost.org/2023/05/mind-reading-new-ai-system-can-translate-a-persons-brain-activity-into-a-continuous-stream-of-text-80255", "urlToImage": "https://www.psypost.org/wp-content/uploads/2021/03/brain-neural-network-artificial-intelligence.jpg", "publishedAt": "2023-05-02T20:02:48Z", "content": "The technology to decode our thoughts is drawing ever closer. Neuroscientists at the University of Texas have for the first time decoded data from non-invasive brain scans and used them to reconstruc… [+5936 chars]"}, {"source": {"id": null, "name": "ArchDaily"}, "author": "Jon Astbury", "title": "The Best of Both Worlds: Ray Tracing and Rasterization - ArchDaily", "description": "The new version of Lumion 2023 gives users the best of both worlds: technological control and ease of use, with the power to create stunning project images.", "url": "https://www.archdaily.com/1000095/the-best-of-both-worlds-ray-tracing-and-rasterization", "urlToImage": "https://images.adsttc.com/media/images/6449/3ee4/59da/0d61/14e2/2a53/large_jpg/the-best-of-both-worlds-ray-tracing-and-rasterization_1.jpg?1682521850", "publishedAt": "2023-05-02T05:30:00Z", "content": "Courtesy of Lumion\r\nVisualization and technology have long gone hand in hand. It is, after all, a means of representing architecture that has relied on technological developments to keep up with the … [+5225 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Feeding the Future: Artificial Photosynthesis Transforms CO2 Into Food - SciTechDaily", "description": "Researchers produce important amino acid from greenhouse gas CO2 Growing demand for food in the world Biotechnological process via methanol as intermediate product Less ground required than for plant cultivation Ensuring the supply of food to the constantly g…", "url": "https://scitechdaily.com/feeding-the-future-artificial-photosynthesis-transforms-co2-into-food/", "urlToImage": "https://scitechdaily.com/images/Abstract-Photosynthesis-Concept.gif", "publishedAt": "2023-05-01T18:13:47Z", "content": "ByTechnical University of Munich (TUM)May 1, 2023\r\nResearchers at the Technical University of Munich have developed a sustainable method to create the essential amino acid L-alanine from CO2. This pr… [+3363 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Encoding Breakthrough Unlocks New Potential in Neutral-Atom Quantum Computing - SciTechDaily", "description": "Encoding breakthrough allows for solving wider set of applications using neutral-atom quantum computers. QuEra Computing and university researchers have developed a method to expand the optimization calculations possible with neutral-atom quantum computers. T…", "url": "https://scitechdaily.com/encoding-breakthrough-unlocks-new-potential-in-neutral-atom-quantum-computing/", "urlToImage": "https://scitechdaily.com/images/Artist-Concept-Quantum-Computer.jpg", "publishedAt": "2023-05-01T10:39:01Z", "content": "ByQuEra Computing Inc.May 1, 2023\r\nQuEra Computing, creator of the worlds first neutral-atom quantum computer named Aquila, in collaboration with researchers from Harvard and Innsbruck Universities, … [+4603 chars]"}]}