{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This money-stealing scam app was BANNED by Google Play Store! Did you download it? DELETE - HT Tech", "description": "A money-stealing scam app was found to be downloaded more than 10,000 times from the Google Play Store. If you still have this app, you should delete it now!", "url": "https://tech.hindustantimes.com/tech/news/this-money-stealing-scam-app-was-banned-by-google-play-store-did-you-download-it-delete-71646465145632.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/03/05/1600x900/woman-gab666acf2_1920_1644657744429_1646465219008.jpg", "publishedAt": "2022-03-05T07:31:29Z", "content": "A particularly malicious banking trojan app for Android phones has just been exposed. This money-stealing scam app was targeting banking apps, online wallets, insurance apps, crypto wallets and more … [+2652 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Xiaomi Watch S1 Active renders reveal some differences - TechNave", "description": "As some of you may remember, the&nbsp;Xiaomi Watch S1&nbsp;launched at the end of December 2021. It hasn't made its way to Malaysia, but&nbsp;Xiaomi&nbsp;might", "url": "https://technave.com/gadget/Xiaomi-Watch-S1-Active-renders-reveal-some-differences-28851.html", "urlToImage": "https://technave.com/data/files/article/202203050439429468.jpg", "publishedAt": "2022-03-05T04:56:02Z", "content": "As some of you may remember, the Xiaomi Watch S1 launched at the end of December 2021. It hasn't made its way to Malaysia, but Xiaomi might be holding it back for the global launch of the Xiaomi 12 s… [+1487 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Deng Li", "title": "Week 7: Grabbed Huawei EMUI 12 on your device? - HC Newsroom", "description": "On March 11, Huawei will launch its first 108 camera phone – Nova 9 SE in the global market. The phone comes equipped with a number of new technologies including EMUI 12 along with new smart features. EMUI 12 has new features that derive focus on the addition…", "url": "https://www.huaweicentral.com/week-7-grabbed-huawei-emui-12-on-your-device/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/03/huawei-emui-12-week-7-1000x576.jpg", "publishedAt": "2022-03-05T02:55:34Z", "content": "On March 11, Huawei will launch its first 108 camera phone – Nova 9 SE in the global market. The phone comes equipped with a number of new technologies including EMUI 12 along with new smart features… [+1964 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Event horizons are tunable factories of quantum entanglement: Physicists' research findings open a promising avenue for confirming the quantum origin of the Hawking radiation - Science Daily", "description": "Physicists have leveraged quantum information theory techniques to reveal a mechanism for amplifying, or 'stimulating,' the production of entanglement in the Hawking effect in a controlled manner. Furthermore, these scientists propose a protocol for testing t…", "url": "https://www.sciencedaily.com/releases/2022/03/220304182946.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-05T00:00:55Z", "content": "LSU physicists have leveraged quantum information theory techniques to reveal a mechanism for amplifying, or \"stimulating,\" the production of entanglement in the Hawking effect in a controlled manner… [+3661 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Samsung responds to app-throttling discovery, promises to ship an off switch - Ars Technica", "description": "If this is really needed for heat management, why would you let users turn it off?", "url": "https://arstechnica.com/gadgets/2022/03/samsung-says-app-throttling-is-for-heat-management-will-let-users-disable-it/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/02/Samsung_Galaxy-S22-Ultra_Burgundy-760x380.jpg", "publishedAt": "2022-03-04T19:30:44Z", "content": "Enlarge/ The Galaxy S22 Ultra. It has a pen. \r\n75 with 42 posters participating\r\nSamsung has responded to reports that it is throttling thousands of apps on the Galaxy line of smartphones.\r\nWith the … [+4579 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "TechSpot Deals", "title": "Get Microsoft Office on Windows or Mac for 85% off - TechSpot", "description": "There are plenty of reasons to be fed up with corporate America, from excessive job demands to companies paying people to extoll their virtues online. Fortunately, people...", "url": "https://www.techspot.com/news/93627-get-microsoft-office-windows-or-mac-85-off.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-04-image-9.jpg", "publishedAt": "2022-03-04T14:39:19Z", "content": "TL;DR: Microsoft Office needs no introduction. The industry stalwart gives you everything you need to operate your side hustle or business from home. This deal includes lifetime licenses for Word, Ex… [+1856 chars]"}, {"source": {"id": null, "name": "Techeconomy.ng"}, "author": "TechEconomyNG", "title": "Inworld AI Raises $10m from BITKRAFT Ventures, 5 other Angel Investors - TechEconomy.ng", "description": "Prominent angels including the family office of Riot Games Co-Founder, Marc Merrill; Twitch Co-Founder, Kevin Lin; Oculus Co-Founder, Nate Mitchell; and Animoca Brands Co-Founder, Yat Siu participated", "url": "https://techeconomy.ng/2022/03/inworld-ai-raises-10m-from-bitkraft-ventures-5-other-angel-investors/", "urlToImage": "https://i0.wp.com/techeconomy.ng/wp-content/uploads/2022/03/Inworld-AI-funding.jpg?resize=1000%2C600&ssl=1", "publishedAt": "2022-03-04T12:45:00Z", "content": "Inworld AI, offering a platform to create AI-powered characters for virtual worlds, including VR/AR, games and metaverse applications, has announced a $10 million strategic funding led by BITKRAFT Ve… [+2906 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The US Embassy calls for South Africa to take a stance against Russia; bottlenecks because of Transnet infrastructure has had a major impact on South Africa’s largest coal supplier; The City of Tshwane continues its campaign of cutting off utilities; and work…", "url": "https://businesstech.co.za/news/government/564874/5-important-things-happening-in-south-africa-today-1233/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/51903015163_a482f19f64_c.jpg", "publishedAt": "2022-03-04T06:04:41Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 1,853 new cases of Covid-19, taking the total reported to 3,679,539. Deaths have reached 9… [+3558 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "'Fingerprint' machine learning technique identifies different bacteria in seconds - EurekAlert", "description": "Bacterial identification can take hours and often longer — precious time when diagnosing infections and selecting appropriate treatments. There may be a quicker, more accurate process, according to researchers at KAIST. By teaching a deep learning algorithm t…", "url": "https://www.eurekalert.org/news-releases/945374", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/df675314-9a99-4039-86e5-317d39fb1654/Rendition/thumbnail/Content/Public", "publishedAt": "2022-03-04T00:11:15Z", "content": "image: Schematics of the general process of Raman data collection and analysis where a single spectrum is attained from a single cell and classified via deep learning.view more \r\nCredit: KAIST\r\nBacte… [+4802 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Miller", "title": "How can computer engineering predict the future of gene synthesis? - Phys.org", "description": "Computer programming and gene synthesis appear to share little in common. But according to University of Cincinnati professor Andrew Steckl, an Ohio Eminent Scholar, leaps forward in technology in the former make him optimistic that wide scale gene manufactur…", "url": "https://phys.org/news/2022-03-future-gene-synthesis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/how-can-the-computer-c.jpg", "publishedAt": "2022-03-03T21:14:48Z", "content": "Computer programming and gene synthesis appear to share little in common. But according to University of Cincinnati professor Andrew Steckl, an Ohio Eminent Scholar, leaps forward in technology in th… [+5366 chars]"}, {"source": {"id": null, "name": "Cdc.gov"}, "author": "CDC", "title": "Effectiveness of COVID-19 Pfizer-BioNTech BNT162b2 mRNA Vaccination in Preventing COVID-19–Associated Emergency Department and Urgent Care Encounters and Hospitalizations Among Nonimmunocompromised Children and Adolescents Aged 5–1 - cdc.gov", "description": "This report describes mRNA COVID-19 vaccine effectiveness in ..", "url": "https://www.cdc.gov/mmwr/volumes/71/wr/mm7109e3.htm", "urlToImage": "https://www.cdc.gov/mmwr/volumes/71/wr/social-media/mm7109e3__mRNAVEChildEDVisits_IMAGE_01March22_1200x675.jpg?_=62264", "publishedAt": "2022-03-03T20:41:33Z", "content": "On March 1, 2022, this report was posted online as an MMWR Early Release.\r\nNicola P. Klein, MD1; Melissa S. Stockwell, MD2,3,4; Maria Demarco, PhD5; Manjusha Gaglani, MBBS6,7; Anupam B. Kharbanda, MD… [+53369 chars]"}, {"source": {"id": null, "name": "Taipei Times"}, "author": "台北時報", "title": "Smartphones to return to design classic foldables - 台北時報", "description": "The “snap” of a shutting phone is the nostalgic sound resonating from the giant stands of Samsung Electronics Co, Oppo Mobile Telecommunications Corp (歐珀) and Huawei Technologies Co (華為) at the Mobile World Congress in Barcelona, Spain, this week.\r\nStar of th…", "url": "https://www.taipeitimes.com/News/biz/archives/2022/03/04/2003774141", "urlToImage": "https://www.taipeitimes.com/assets/images/TaipeiTimesLogo-1200X1200px_new.jpg", "publishedAt": "2022-03-03T16:00:00Z", "content": "The snap of a shutting phone is the nostalgic sound resonating from the giant stands of Samsung Electronics Co, Oppo Mobile Telecommunications Corp () and Huawei Technologies Co () at the Mobile Worl… [+2948 chars]"}]}