{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Links ADHD to Significantly Shorter Life Expectancy - SciTechDaily", "description": "A study has found that adults with ADHD may have reduced life expectancy due to lack of diagnosis and support. Many struggle with managing their condition, facing social and health challenges that could be mitigated with better services. Researchers call for …", "url": "https://scitechdaily.com/new-research-links-adhd-to-significantly-shorter-life-expectancy/", "urlToImage": "https://scitechdaily.com/images/Hourglasses-Time-Comparison.jpg", "publishedAt": "2025-01-26T11:41:55Z", "content": "Research indicates that adults with ADHD may live significantly shorter lives, with underdiagnosis and inadequate support contributing to poorer health outcomes.\r\nA study has found that adults with A… [+5609 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Heart Shrinkage Linked to Popular Weight-Loss Drug Ozempic/Semaglutide - SciTechDaily", "description": "Recent findings indicate that widely used weight-loss medications might lead to muscle loss, including vital heart muscle, potentially leading to serious health complications over time. Experts call for more research and a cautious approach to using these dru…", "url": "https://scitechdaily.com/heart-shrinkage-linked-to-popular-weight-loss-drug-ozempic-semaglutide/", "urlToImage": "https://scitechdaily.com/images/Obese-Man-Using-Semaglutide-Ozempic.jpg", "publishedAt": "2025-01-26T04:02:42Z", "content": "Research reveals that popular weight-loss drugs could diminish muscle mass, including heart muscle, raising concerns about their long-term safety.\r\nRecent findings indicate that widely used weight-lo… [+6354 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Timothy Malcolm", "title": "NASA Curiosity rover finds proof pointing toward a habitable Mars - Chron", "description": "Caltech scientists published a study using NASA Curiosity rover imagery showing the past existence of warm water on Mars.", "url": "https://www.chron.com/news/space/article/mars-nasa-curiosity-rover-life-20055602.php", "urlToImage": "https://s.hdnux.com/photos/01/46/63/40/26949685/3/rawImage.jpg", "publishedAt": "2025-01-25T19:32:07Z", "content": "NASA's Curiosity rover has found evidence that conditions on the planet Mars may have been hospitable for life.\r\nHeritage Images/Getty Images\r\nIt has been a trying time for NASA, what with astronauts… [+2452 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": null, "title": "PowerColor Officially Debuts AMD Radeon RX 9070 XT Hellhound And Reaper GPU Variants, Featuring Elegant Triple-Fan Designs - Wccftech", "description": "PowerColor introduces two more cards in the RX 9000 lineup: Hellhound and Reaper RX 9070 XT officially prepared on the website.", "url": "https://wccftech.com/powercolor-officially-debuts-amd-radeon-rx-9070-xt-hellhound-and-reaper-gpu-variants-featuring-elegant-triple-fan-designs/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2025/01/PowerColor-Hellhound-and-Reaper-RX-9070-XT.jpg", "publishedAt": "2025-01-25T18:07:00Z", "content": "PowerColor prepared two more Radeon RX 9070 XT AIB models, which are now available on the official website.\r\nOne of the major board partners of AMD has added two more RDNA 4 GPUs to its inventory. If… [+1950 chars]"}]}