{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Alzheimer’s Damage Found To Happen Quietly, Long Before Symptoms Appear - SciTechDaily", "description": "A brain mapping study funded by the NIH reveals which cell types may be the first to be affected. New research funded by the National Institutes of Health (NIH) suggests that Alzheimer’s disease may impact the brain in two distinct stages. Using advanced brai…", "url": "https://scitechdaily.com/?p=428525", "urlToImage": "https://scitechdaily.com/images/Alzheimer-Disease-Neurons-With-Amyloid-Plaques.jpg", "publishedAt": "2024-11-11T03:41:39Z", "content": "New NIH-funded research indicates that Alzheimer’s disease damages the brain in two distinct phases. The first phase is gradual, affecting only specific cell types before symptoms arise, while the se… [+7800 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Infection Aftershock: COVID-19’s Long-Term Impact on Your Heart - SciTechDaily", "description": "New research indicates that people who contracted COVID-19 early in the pandemic faced a significantly elevated risk of heart attack, stroke, and death for up to three years post-infection. Those with severe cases saw nearly quadruple the risk, especially in …", "url": "https://scitechdaily.com/infection-aftershock-covid-19s-long-term-impact-on-your-heart/", "urlToImage": "https://scitechdaily.com/images/Human-Heart-Cardiology-Concept.jpg", "publishedAt": "2024-11-10T09:20:33Z", "content": "Research shows that early COVID-19 infections significantly increased the risk of cardiovascular events over three years, suggesting severe cases could be as detrimental as diabetes to heart health.\r… [+6132 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Anthony Ha", "title": "OpenAI reportedly developing new strategies to deal with AI improvement slowdown - TechCrunch", "description": "OpenAI’s next flagship model might not represent as big a leap forward as its predecessors, according to a new report in The Information. Employees who", "url": "https://techcrunch.com/2024/11/09/openai-reportedly-developing-new-strategies-to-deal-with-ai-improvement-slowdown/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/08/gpt4o-feature-jpg.jpg?resize=1200,675", "publishedAt": "2024-11-09T23:26:46Z", "content": "OpenAIs next flagship model might not represent as big a leap forward as its predecessors, according to a new report in The Information.\r\nEmployees who tested the new model, code-named Orion, reporte… [+869 chars]"}]}