{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Samsung could finally upgrade to 45W fast charging for Galaxy S22 series - TechNave", "description": "With the launch of the&nbsp;Samsung Galaxy S22 series&nbsp;coming soon, details about the new flagship series have been popping up fast. Specs like the chipset", "url": "https://technave.com/gadget/Samsung-could-finally-upgrade-to-45W-fast-charging-for-Galaxy-S22-series-28093.html", "urlToImage": "https://technave.com/data/files/article/202201170312583805.jpg", "publishedAt": "2022-01-17T03:20:10Z", "content": "With the launch of the Samsung Galaxy S22 series coming soon, details about the new flagship series have been popping up fast. Specs like the chipset and storage capacity are all that surprising for … [+1035 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Sneha Saha", "title": "Apple makes it mandatory for employees to get COVID-19 booster shot - BGR India", "description": "As per the latest report the tech giant Apple has sent an email to employees to inform them about mandatory booster dose proof for corporate and retail employees. Read to know more details.", "url": "https://www.bgr.in/news/apple-makes-it-mandatory-for-employees-to-get-covid-19-booster-shot-1036410/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2021/12/corona-vaccine.jpg", "publishedAt": "2022-01-17T03:19:34Z", "content": "Tech companies are urging employees to get the booster shot for COVID-19 as early as possible. Joining the bandwagon is Apple that asks employees to carry proof of COVID-19 booster shot to enter offi… [+2023 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem codes for January 17, 2022: Get Green Star Token, Brave Crystal, Sky Crystal - HT Tech", "description": "Garena Free Fire Redeem codes for January 17, 2022: Get Redeem codes at reward.ff.garena.com", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-january-17-2022-get-green-star-token-brave-crystal-sky-crystal-71642385480871.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/17/1600x900/bda3ef1394e93d39b36a9aa6305e7c64jpg_1638674694688_1642385625086.jpg", "publishedAt": "2022-01-17T02:18:41Z", "content": "Free Fire is one of the favourite games of e-gamers. The game became popular among Indian gamers after the Indian government banned the very popular PUBG Mobile India in Sept, 2020. The game is known… [+1633 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Sumit Chakraborty", "title": "Stocks to Watch: HDFC Bank, HCL Tech, Maruti, Oil India - Mint", "description": "Shares of companies like UltraTech Cement, Angel One, Tata Steel Long Products, Tatva Chintan Pharma Chem, Hathway, and KPI Global Infra will be in focus as they announce their December quarter earnings today", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-hdfc-bank-hcl-tech-maruti-oil-india-11642358459951.html", "urlToImage": "https://images.livemint.com/img/2022/01/16/600x338/stock-kItE--621x414@LiveMint_1642358488019.jpg", "publishedAt": "2022-01-17T02:00:03Z", "content": "HDFC Bank: India's largest private sector bank has reported an 18.1 per cent rise in its standalone net profit at 10,342.20 crore for the third quarter ended December 31, 2021, on improvement in loan… [+4018 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Type of “Strange Metal” – Material That Shares Fundamental Quantum Attributes With Black Holes - SciTechDaily", "description": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black holes. Scientists understand quite well how temperature affects…", "url": "https://scitechdaily.com/newly-discovered-type-of-strange-metal-material-that-shares-fundamental-quantum-attributes-with-black-holes/", "urlToImage": "https://scitechdaily.com/images/Strange-Metals-New-State-of-Matter.gif", "publishedAt": "2022-01-17T01:35:02Z", "content": "A new discovery could help scientists to understand “strange metals,” a class of materials that are related to high-temperature superconductors and share fundamental quantum attributes with black hol… [+6135 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Black Hole at Center of Milky Way Is Unpredictable and Chaotic – Mysterious Flares Erupt Every Day - SciTechDaily", "description": "An international team of researchers, led by postgraduate student Alexis Andrés, has found that the black hole at the center of our galaxy, Sagittarius A*, not only flares irregularly from day to day but also in the long term. The team analyzed 15 years’ wort…", "url": "https://scitechdaily.com/black-hole-at-center-of-milky-way-is-unpredictable-and-chaotic-mysterious-flares-erupt-every-day/", "urlToImage": "https://scitechdaily.com/images/Supermassive-Black-Hole-Artists-Concept-Illustration-scaled.jpg", "publishedAt": "2022-01-17T00:25:00Z", "content": "ByRoyal Astronomical SocietyJanuary 16, 2022\r\nArtist’s concept illustration of a supermassive black hole emitting an x-ray jet. Credit: NASA/JPL-Caltech\r\nAn international team of researchers, led by … [+3652 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Derek Strickland", "title": "GTA V may be delayed on PS5, Xbox Series X over technical difficulties - TweakTown", "description": "Rockstar Games has reportedly delayed the new next-gen GTA V E&E on PS5 and Xbox Series X due to development complications.", "url": "https://www.tweaktown.com/news/84035/gta-may-be-delayed-on-ps5-xbox-series-over-technical-difficulties/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84035_323_gta-may-be-delayed-on-ps5-xbox-series-over-technical-difficulties_full.png", "publishedAt": "2022-01-16T23:37:00Z", "content": "Rockstar Games may have delayed the new next-gen version of GTA V by as much as two months.\r\nA bit ago, Rockstar Games pushed its GTA V Expanded &amp; Enhanced version to March 2022. Now according to… [+1278 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Ciaran McGrath, Paul Withers", "title": "Brexit LIVE: City of London bosses launch masterplan to draw talent after EU exit - Daily Express", "description": "BREXIT BRITAIN could receive a huge with City of London chiefs reportedly putting together plans to inject massive momentum in the capital's listing structure to attract fast-growing tech companies", "url": "https://www.express.co.uk/news/politics/1550754/brexit-live-news-liz-truss-boris-johnson-sefcovic-eu-news-france-macron", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/139/750x445/1550754.jpg", "publishedAt": "2022-01-16T19:53:00Z", "content": "The Prime Minister has come under renewed attack after being accused of backtracking over his Brexit pledge to \"take back control\".\r\nThe Africa and the Zeeland - two of the largest fishing vessels in… [+732 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Webb Space Telescope Will “Revolutionize Our Understanding” of the Universe - SciTechDaily", "description": "On December 25, the largest and most powerful space telescope ever constructed by NASA was successfully launched from Earth. With unprecedented technology, the James Webb Space Telescope (JWST) will peer both near and far, from the planets and bodies in our s…", "url": "https://scitechdaily.com/webb-space-telescope-will-revolutionize-our-understanding-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/NASAs-James-Webb-Space-Telescope.gif", "publishedAt": "2022-01-16T18:08:30Z", "content": "ByCalifornia Institute of TechnologyJanuary 16, 2022\r\nArianespace’s Ariane 5 rocket launches with NASA’s James Webb Space Telescope onboard December 25, 2021, from the ELA-3 Launch Zone of Europe’s S… [+8466 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Grace Browne", "title": "Pregnant people are still not getting vaccinated against Covid - Ars Technica", "description": "Misinformation and muddled public health messaging have failed expectant parents. Now Omicron's surge is putting both carriers and babies at risk.", "url": "https://www.wired.com/story/pregnant-people-still-not-getting-vaccinated-covid/", "urlToImage": "https://media.wired.com/photos/61e0a474844ec857b7138274/191:100/w_1280,c_limit/Science_pregnant_vaccine_GettyImages-1211125659.jpg", "publishedAt": "2022-01-16T12:24:09Z", "content": "Calendar year three into the pandemic, and vaccination coverage among pregnant people remains staggeringly low. \r\nAccording to data from the US Centers for Disease Control and Prevention, as of Janua… [+3008 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Citizen Scientists Discover Giant Jupiter-Like Planet in NASA TESS Data - SciTechDaily", "description": "Tom Jacobs of Bellevue, Washington, loves treasure hunts. Since 2010, the former U.S. naval officer has participated in online volunteer projects that allow anyone who is interested — “citizen scientists” — to look through NASA telescope data for signs of exo…", "url": "https://scitechdaily.com/citizen-scientists-discover-giant-jupiter-like-planet-in-nasa-tess-data/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-TOI-2180-b-scaled.jpg", "publishedAt": "2022-01-16T10:22:05Z", "content": "ByNASAJanuary 16, 2022\r\nThis illustration depicts a Jupiter-like exoplanet called TOI-2180 b. It was discovered in data from NASA’s Transiting Exoplanet Survey Satellite. Credit: NASA/JPL-Caltech/R. … [+14100 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "WhatsApp update: 2 new photo tools under development! - HT Tech", "description": "WhatsApp is working on two new drawing tools- 2 new pencils and a blur tool. These features can be used to draw on the images and videos.", "url": "https://tech.hindustantimes.com/tech/news/whatsapp-update-2-new-photo-tools-under-development-71642300812191.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/16/1600x900/FACEBOOK-OUTAGE-17_1638082215769_1642300882828.jpg", "publishedAt": "2022-01-16T02:46:19Z", "content": "WhatsApp is continuously undergoing updates to bring new features or to solve the bugs faced by users in the application. As per the latest information the messaging application is working on two new… [+2138 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth’s Interior Is Cooling “Much Faster Than Expected” - SciTechDaily", "description": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat may dissipate sooner than previously thought. The evolution of…", "url": "https://scitechdaily.com/earths-interior-is-cooling-much-faster-than-expected/", "urlToImage": "https://scitechdaily.com/images/Earth-Core-Animation.gif", "publishedAt": "2022-01-16T01:35:57Z", "content": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat ma… [+3896 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Dr. Adrian Wong", "title": "Can SIM Swap Attack Empty Bank Accounts Without Warning? - Tech ARP", "description": "Can a SIM swap attack clear out your bank accounts without warning?Take a look at the viral warning, and find out what the facts really are!", "url": "https://www.techarp.com/internet/sim-swap-bank-warning/", "urlToImage": "https://www.techarp.com/wp-content/uploads/2022/01/SIM-Swap-Attack-fact-check.jpg", "publishedAt": "2022-01-15T20:16:15Z", "content": "Can a SIM swap attack clear out your bank accounts without warning?\r\nTake a look at the viral warning, and find out what the facts really are!\r\nClaim : SIM Swap Attack Can Empty Bank Accounts Without… [+4817 chars]"}, {"source": {"id": null, "name": "Theamusetech.com"}, "author": "Sarah Maria", "title": "VALORANT PAATCH 4.0 RELEASED DATE - HERE'S WHEN ACT 4 LAUNCHES - The Amuse Tech", "description": "VALORANT PATCH 4.0 RELEASED DATE – HERE’S WHEN ACT 4 LAUNCHES The content train is never stopped for a Valorant free-to-play first-person shooter. The next step in its post-launch journey will be patch4.0’s release. This kicks off Episode 4, Act 1 with an Age…", "url": "https://theamusetech.com/2022/01/15/valorant-paatch-4-0-released-date-heres-when-act-4-launches/", "urlToImage": "https://theamusetech.com/wp-content/uploads/2022/01/VALORANT-PAATCH-4.0-RELEASED-DATE-HERES-WHEN-ACT-4-LAUNCHES.jpg", "publishedAt": "2022-01-15T13:16:28Z", "content": "VALORANT PATCH 4.0 RELEASED DATE – HERE’S WHEN ACT 4 LAUNCHES\r\nThe content train is never stopped for a Valorant free-to-play first-person shooter. The next step in its post-launch journey will be pa… [+1112 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Major Milestone for the James Webb Space Telescope, a “Mini” Monster Black Hole [Video] - SciTechDaily", "description": "A major milestone for the James Webb Space Telescope, what astronomers could learn from a “mini” monster black hole, and the latest assessment of our planet’s global surface temperature … a few of the stories to tell you about – This Week at NASA! https://you…", "url": "https://scitechdaily.com/a-major-milestone-for-the-james-webb-space-telescope-a-mini-monster-black-hole-video/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-01-15T12:37:43Z", "content": "Video transcript:\r\nA major milestone for the James Webb Space Telescope, what astronomers could learn from a mini monster black hole, and the latest assessment of our planet’s global surface temperat… [+2536 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "From pandemic to endemic: Covid forecast for 2022 - BusinessTech", "description": "After two years of contagion and death, Covid is shifting again. Omicron is spreading faster than any previous variant, but it’s also proving less malevolent. There’s growing talk that the worst pandemic of the past century may soon be known in another way — …", "url": "https://businesstech.co.za/news/trending/551008/from-pandemic-to-endemic-covid-forecast-for-2022/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/Covid-Vaccine-e1639040310267.jpg", "publishedAt": "2022-01-15T10:24:31Z", "content": "After two years of contagion and death, Covid is shifting again. Omicron is spreading faster than any previous variant, but its also proving less malevolent. Theres growing talk that the worst pandem… [+6010 chars]"}]}