{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Bqprime.com"}, "author": "PTI", "title": "Bharat Biotech, University Of Sydney Partner For Vaccine Research Collaboration - BQ Prime", "description": "Bharat Biotech has signed a MoU with the University of Sydney Infectious Diseases Institute to build strong sectoral and cross-organisational collaborations to design novel methodologies to tackle future epidemics and infectious diseases.", "url": "https://www.bqprime.com/business/bharat-biotech-university-of-sydney-partner-for-vaccine-research-collaboration", "urlToImage": "https://gumlet.assettype.com/thequint-fit%2F2020-11%2F4b1eb54c-044f-43d5-bc09-b2807c39859d%2FiStock_879828254.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-11-28T09:39:43Z", "content": "Vaccines major Bharat Biotech International Ltd on Tuesday said it has entered into a collaboration with the University of Sydney Infectious Diseases Institute to advance vaccine research initiatives… [+1513 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Administrator Bill Nelson in India, set to strengthen NASA-ISRO partnership - HT Tech", "description": "NASA Administrator Bill Nelson will be in India for a week of collaborative meetings and events focused on strengthening the partnership between NASA and ISRO.", "url": "https://tech.hindustantimes.com/tech/news/nasa-administrator-bill-nelson-in-india-set-to-strengthen-nasa-isro-partnership-71701149972209.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/28/1600x900/nhq202306210059medium_1701150302686_1701150330901.jpg", "publishedAt": "2023-11-28T05:50:03Z", "content": "India has increasingly been focusing on international collaboration in the field of space exploration. The Indian space agency ISRO has been collaborating with NASA and JAXA for its major space explo… [+2390 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "ISRO-powered Venus mission: Top 5 things to know about the Shukrayaan mission - HT Tech", "description": "ISRO Chairman S Somanath has shared an update about the upcoming Venus mission at the Indian National Science Academy in Delhi. Know the significance of conducting the Shukrayaan mission.", "url": "https://tech.hindustantimes.com/tech/news/isropowered-venus-mission-top-5-things-to-know-about-the-shukrayaan-mission-71701146657727.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/28/1600x900/143Venus-800x601_1701146692124_1701146692269.jpg", "publishedAt": "2023-11-28T04:49:56Z", "content": "After the success of the Chandrayaan-3 mission as well as the Aditya-L1 mission, ISRO is all set to launch its upcoming Venus mission. The ISRO Venus mission has been dubbed as the Shukrayaan mission… [+2207 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI tips: Know how to aim like a pro and increase your killing count - HT Tech", "description": "Want to improve BGMI skills? Check out the best BGMI tips for aiming like a pro player and winning the chicken dinner.", "url": "https://tech.hindustantimes.com/how-to/bgmi-tips-know-how-to-aim-like-a-pro-and-increase-your-killing-count-71701140578028.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/28/1600x900/euy_1652444600968_1701140615995.PNG", "publishedAt": "2023-11-28T03:07:41Z", "content": "Battlegrounds Mobile India (BGMI) is one of the popular Battle Royale games which is known for its real-time battlefield experience, intense gameplay, variety of gaming modes, rewards, maps, and more… [+2342 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Nature's Surprise: Plants Might Be Able To Absorb More CO2 Than Expected - SciTechDaily", "description": "A new study reveals that plants might absorb more CO2 than expected, offering hope in combating climate change. However, reducing emissions remains crucial, as planting trees alone isn't a sufficient solution. New research published on November 17 in Science …", "url": "https://scitechdaily.com/natures-surprise-plants-might-be-able-to-absorb-more-co2-than-expected/", "urlToImage": "https://scitechdaily.com/images/Forest-Absorbs-Carbon-Dioxide-Like-Lungs-Concept-Art.jpg", "publishedAt": "2023-11-26T21:19:55Z", "content": "ByTrinity College DublinNovember 26, 2023\r\nRecent research indicates that plants could absorb more atmospheric CO2 than previously believed, providing a hopeful perspective on climate change mitigati… [+6390 chars]"}]}