{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Mackenzie Hawkins", "title": "US Readies China Chip Curbs That Stop Short of Earlier Proposals - Bloomberg", "description": "The Biden administration is weighing additional curbs on sales of semiconductor equipment and AI memory chips to China that would escalate the US crackdown on Beijing’s tech ambitions but stop short of some stricter measures previously considered, according t…", "url": "https://www.bloomberg.com/news/articles/2024-11-28/us-readies-china-chip-curbs-that-stop-short-of-earlier-proposals", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iHxQCL2cbMSA/v0/1200x793.jpg", "publishedAt": "2024-11-28T01:43:00Z", "content": "The Biden administration is weighing additional curbs on sales of semiconductor equipment and AI memory chips to China that would escalate the US crackdown on Beijings tech ambitions but stop short o… [+557 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elisabeth Buchwald, Clare Duffy", "title": "FTC opens wide-ranging antitrust probe into Microsoft - CNN", "description": "Microsoft is set to go under the microscope of the nation’s top antitrust watchdog, the Federal Trade Commission, which is launching a sweeping investigation into the tech giant’s practices.", "url": "https://www.cnn.com/2024/11/27/business/microsoft-ftc-investigation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2159867247-copy.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-11-28T00:33:00Z", "content": "Microsoft is set to go under the microscope of the nations top antitrust watchdog, the Federal Trade Commission, which is launching a sweeping investigation into the tech giants practices.\r\nThe FTC, … [+2306 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Alibaba releases an ‘open’ challenger to OpenAI’s o1 reasoning model - TechCrunch", "description": "A new, open \"reasoning\" AI model, QwQ-32B-Preview, has arrived on the scene, developed by Alibaba's Qwen team.", "url": "https://techcrunch.com/2024/11/27/alibaba-releases-an-open-challenger-to-openais-o1-reasoning-model/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/06/GettyImages-1285877166.jpg?resize=1200,675", "publishedAt": "2024-11-27T21:30:55Z", "content": "A new so-called “reasoning” AI model, QwQ-32B-Preview, has arrived on the scene. It’s one of the few to rival OpenAI’s o1, and it’s the first available to download under a permissive license.\r\nDevelo… [+3711 chars]"}]}