{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Quantum Leap: Physicists Turn Schrödinger's Cat on Its Head - SciTechDaily", "description": "Researchers from the University of Warsaw's Faculty of Physics, in collaboration with experts from the QOT Centre for Quantum Optical Technologies, have pioneered an innovative technique that allows the fractional Fourier Transform of optical pulses to be per…", "url": "https://scitechdaily.com/groundbreaking-quantum-leap-physicists-turn-schrodingers-cat-on-its-head/", "urlToImage": "https://scitechdaily.com/images/Quantum-Physics-Waves-Illustration-Concept.jpg", "publishedAt": "2023-09-10T20:16:55Z", "content": "ByUniversity of WarsawSeptember 10, 2023\r\nResearchers have developed a groundbreaking method to perform the fractional Fourier Transform of optical pulses using quantum memory. This unique achievemen… [+4393 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katie Balevic", "title": "Energy Secretary Couldn't Find Enough EV Chargers on Green Tech Trip - Business Insider", "description": "Energy Secretary Jennifer Granholm's road trip highlighted a major problem in the push for more electric cars: There are still not enough chargers.", "url": "https://www.businessinsider.com/energy-secretary-couldnt-find-enough-ev-chargers-green-tech-trip-2023-9", "urlToImage": "https://i.insider.com/64fe1e16a39a1b00190cc9cd?width=1200&format=jpeg", "publishedAt": "2023-09-10T20:04:00Z", "content": "When the US Secretary of Energy and her team embarked on a road trip to promote electric vehicles, they ran into a predictable yet frustrating obstacle: a lack of electric vehicle chargers. \r\nIndeed,… [+1431 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Paula Sambo, Sudhi Ranjan Sen, Laura Dhillon Kane", "title": "Trudeau Is Stuck in India With Faulty Aircraft After Hearing Criticism From Modi - Bloomberg", "description": "Prime Minister Justin Trudeau and the Canadian delegation are stuck in New Delhi after his aircraft experienced technical issues, an inauspicious end to a trip that included criticism from the Indian government.", "url": "https://www.bloomberg.com/news/articles/2023-09-10/trudeau-is-stuck-in-india-with-faulty-aircraft-after-hearing-criticism-from-modi", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ikvuSCIkjUMU/v1/1200x800.jpg", "publishedAt": "2023-09-10T16:52:48Z", "content": "Prime Minister Justin Trudeau and the Canadian delegation are stuck in New Delhi after his aircraft experienced technical issues, an inauspicious end to a trip that included criticism from the Indian… [+391 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Gadgets 360 with Technical Guruji: Tech Tips - NDTV", "description": "If you suddenly receive a message from Google informing you that an unrecognised device has signed into your account, there's no need to panic. You can simpl...", "url": "https://www.youtube.com/watch?v=yVnyT-sifXM", "urlToImage": "https://i.ytimg.com/vi/yVnyT-sifXM/maxresdefault.jpg", "publishedAt": "2023-09-10T12:30:37Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Reveals That Lonely People Process the World Differently - SciTechDaily", "description": "A researcher from USC Dornsife in psychology comparing brain images has found significant differences in the brain processing patterns of lonely individuals when compared to those who aren't lonely. The Russian writer and philosopher Leo Tolstoy may have been…", "url": "https://scitechdaily.com/?p=306765", "urlToImage": "https://scitechdaily.com/images/Simple-Brain-Waves-Signals-Illustration.jpg", "publishedAt": "2023-09-10T05:32:09Z", "content": "ByUniversity of Southern CaliforniaSeptember 9, 2023\r\nNew researchers reveals that lonely individuals have distinct and varied brain processing patterns when compared to those who arent lonely, which… [+6952 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot, Grace Eliza Goodwin, Jenny McGrath", "title": "Scientists uncover ancient 3D cave drawings, previously unknown - Business Insider", "description": "Using a simplistic 3-D viewing technique, archaeologists discovered three new cave drawings that they believe were originally intended to appear 3-D.", "url": "https://www.businessinsider.com/scientists-uncover-ancient-three-dimensional-cave-drawings-2023-9", "urlToImage": "https://i.insider.com/64fb6bcea39a1b00190c1b54?width=1200&format=jpeg", "publishedAt": "2023-09-08T23:32:00Z", "content": "Archaeologists have discovered new Paleolithic animal paintings from tens of thousands of years ago hidden in a cave using an updated photography technique.\r\nThere are over 700 paintings lining the r… [+2462 chars]"}]}