{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Firm promotes Africa art, launches charity auction - Punch Newspapers", "description": "To commemorate Nelson Madela Internation Day, an art technology company, Artgidi.com, has launched a charity art auction to promote contemporary African art.", "url": "https://punchng.com/firm-promotes-african-art-launches-charity-auction/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/07/18143003/Mandela-Day-Auction.jpeg", "publishedAt": "2022-07-18T13:42:51Z", "content": "To commemorate Nelson Madela Internation Day, an art technology company, Artgidi.com, has launched a charity art auction to promote contemporary African art.\r\nThe charity auction, which is in its fir… [+3683 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm warning; Direct hit on Earth expected by snake-like filament, blackouts feared - HT Tech", "description": "Space science expert predicts that a massive Solar storm could hit Earth directly and cause damage to communications and GPS blackout.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-warning-direct-hit-on-earth-expected-by-snake-like-filament-blackouts-feared-71658145088380.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/18/1600x900/34b37fd044c086eaf5cad7b613b70ce5_1645332046312_1658145324306_1658145324306.jpg", "publishedAt": "2022-07-18T11:57:31Z", "content": "A few days back a giant sunspot erupted on the solar surface that has left scientists and researchers worried about a possible geomagnetic storm directed at Earth. On Friday, a massive solar flare wa… [+1724 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Humza Aamir", "title": "Great Phones For Less Than $500 - TechSpot", "description": "You won't get the latest SoC, camera tech, and a few other bells and whistles with our great value choices, however, these phones are capable of handling almost everything you can throw at them.", "url": "https://www.techspot.com/article/2496-great-value-phones/", "urlToImage": "https://static.techspot.com/articles-info/2496/images/2022-07-18-image-2.jpg", "publishedAt": "2022-07-18T11:05:00Z", "content": "Google's phone ambitions took a big, bold leap with the Pixel 6 and 6 Pro, leaving the Pixel 5a as the company's last Pixel to sport that Nexus-like understated, classy look. Although the aesthetics … [+1509 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Mick Chan", "title": "Proton X50 now available with ATLAS OS by ACO Tech - paultan.org - Paul Tan's Automotive News", "description": "The Proton X50 can now receive ATLAS (ACO Tech Local Automotive Services) through an over-the-air update, ACO Tech has announced. The update may take up to 14 days to be received by all applicable vehicles, …", "url": "https://paultan.org/2022/07/18/proton-x50-now-available-with-atlas-os-by-aco-tech/", "urlToImage": "https://paultan.org/image/2022/06/ACO_Atlas-27-1200x800.jpg", "publishedAt": "2022-07-18T09:45:08Z", "content": "The Proton X50 can now receive ATLAS (ACO Tech Local Automotive Services) through an over-the-air update, ACO Tech has announced. The update may take up to 14 days to be received by all applicable ve… [+1115 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Research Shows a Lower Protein Diet Could Be the Key to Healthier Eating Habits - SciTechDaily", "description": "Introducing infants and toddlers to a lower-protein Nordic-style diet that places an emphasis on plant-based foods could allow them to obtain healthy eating habits New research recently presented at the 54th Annual Meeting of the European Society of Paediatri…", "url": "https://scitechdaily.com/research-shows-a-lower-protein-diet-could-be-the-key-to-healthier-eating-habits/", "urlToImage": "https://scitechdaily.com/images/Healthy-Food-Selection-scaled.jpg", "publishedAt": "2022-07-18T08:38:24Z", "content": "ByThe European Society for Paediatric Gastroenterology, Hepatology and Nutrition (ESPGHAN)July 18, 2022By the time they were 18 months old, infants who began receiving taster portions of the new Nord… [+4466 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom wants another massive power price hike: report - BusinessTech", "description": "Eskom has asked the National Energy Regulator of South Africa (Nersa) for a 32.66% price hike, according to City Press. And, if the power utility is granted the exorbitant increase from Nersa, it will reportedly request an additional 10% increase the followin…", "url": "https://businesstech.co.za/news/energy/607500/eskom-wants-another-massive-power-price-hike-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/01/Eskom-e1578385678253.png", "publishedAt": "2022-07-18T07:11:17Z", "content": "Eskom has asked the National Energy Regulator of South Africa (Nersa) for a 32.66% price hike, the City Press reports. And, if the power utility is granted the exorbitant increase from Nersa, it will… [+3167 chars]"}, {"source": {"id": null, "name": "Theinformant.co.nz"}, "author": "Daniel Jacobs", "title": "Twitch: This hot bath has become popular thanks to a rather unusual technology Twitch - theinformant.co.nz", "description": "When we talk about the category Twitch and the Pools, Hot Tubs and Beaches, we", "url": "https://theinformant.co.nz/twitch-this-hot-bath-has-become-popular-thanks-to-a-rather-unusual-technology/", "urlToImage": "https://theinformant.co.nz/wp-content/uploads/2022/07/Twitch-This-hot-bath-has-become-popular-thanks-to-a.jpg", "publishedAt": "2022-07-18T06:04:20Z", "content": "When we talk about the category Twitch and the Pools, Hot Tubs and Beaches, we often think of Amoranth, one of the most popular streamers in this category. But it is not the only one that offers this… [+2085 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Sasol outage means all South African oil refineries are now shut - BusinessTech", "description": "Sasol, South Africa’s largest fuel producer, declared force majeure on the supply of petroleum products due to delays in deliveries of crude to the Natref refinery it owns with TotalEnergies SE, leaving just a fraction of the country’s fuel-production capacit…", "url": "https://businesstech.co.za/news/energy/607490/sasol-outage-means-all-south-african-oil-refineries-are-now-shut/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/Sasol-e1631015118873.jpg", "publishedAt": "2022-07-18T05:23:52Z", "content": "Sasol South Africas largest fuel producer, declared force majeure on the supply of petroleum products due to delays in deliveries of crude to the Natref refinery it owns with TotalEnergies SE, leavin… [+1895 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "MIT Engineers Find a Way To Save Energy and Make Water Boil More Efficiently - SciTechDaily", "description": "New surface treatments could save energy for systems used in many industries. At the heart of a wide range of industrial processes, including most electricity generating plants, many chemical production systems, and even cooling systems for electronics, is an…", "url": "https://scitechdaily.com/mit-engineers-find-a-way-to-save-energy-and-make-water-boil-more-efficiently/", "urlToImage": "https://scitechdaily.com/images/Faster-Boiling-High-Speed-Video.gif", "publishedAt": "2022-07-17T18:55:58Z", "content": "ByJennifer Chu, Massachusetts Institute of TechnologyJuly 17, 2022\r\nMIT engineers design new surface treatments that make water boil more efficiently.\r\nNew surface treatments could save energy for sy… [+8550 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Canada has restarted its residency draws – what South Africans should know - BusinessTech", "description": "After a more than 18-month break due to the Covid-19 pandemic, Immigration, Refugees and Citizenship Canada (IRCC) has restarted its Express Entry draws, allowing candidates from outside of Canada to be invited to apply for permanent residency.", "url": "https://businesstech.co.za/news/lifestyle/605486/canada-has-restarted-its-residency-draws-what-south-africans-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/AirCanada-e1615993950104.jpg", "publishedAt": "2022-07-17T05:01:02Z", "content": "After a more than 18-month break due to the Covid-19 pandemic, Immigration, Refugees and Citizenship Canada (IRCC) has restarted its ‘Express Entry’ draws, allowing candidates from outside of Canada … [+1961 chars]"}, {"source": {"id": null, "name": "Cryptotvplus.com"}, "author": "Ifeoma Joy Okorie", "title": "RunNation: A Move-to-earn Metaverse App; Run, Battle, and Earn - CryptoTvplus", "description": "Did you ever imagine mere exercise could yield rewards? The application of Blockchain technology is innovating the approach to traditional lifestyle. The sports industry is becoming more profitable with the concept of an earning mechanism that rewards individ…", "url": "https://cryptotvplus.com/2022/07/runnation-a-move-to-earn-metaverse-app-run-battle-and-earn/", "urlToImage": "https://cryptotvplus.com/wp-content/uploads/2022/07/wp-1657985614496-1000x600.jpg", "publishedAt": "2022-07-16T18:41:54Z", "content": "Did you ever imagine mere exercise could yield rewards? \r\nThe application of Blockchain technology is innovating the approach to traditional lifestyle. The sports industry is becoming more profitable… [+4129 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "When NASA probe almost sank into Asteroid Bennu, a big secret was revealed - HT Tech", "description": "The OSIRIS-REX probe spacecraft almost sank into the Asteroid Bennu! It thereby, revealed a hidden secret about the asteroid.", "url": "https://tech.hindustantimes.com/tech/news/when-nasa-probe-almost-sank-into-asteroid-bennu-a-big-secret-was-revealed-71657990546541.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/16/1600x900/NASA_DART_1633579074740_1657990664405_1657990664405.jpg", "publishedAt": "2022-07-16T16:58:26Z", "content": "NASA launched its OSIRIS-REX mission back in 2020 in which it sent a probe to asteroid Bennu with an aim to secure at least 60 grams of surface material and bring it back to Earth in 2023. Well, it a… [+2008 chars]"}]}