{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Invention Triggers One of Quantum Mechanics' Strangest and Most Useful Phenomena - SciTechDaily", "description": "Through the Quantum Looking Glass By helping scientists control a strange but useful phenomenon of quantum mechanics, an ultrathin invention could make future computing, sensing, and encryption technologies remarkably smaller and more powerful. The device is …", "url": "https://scitechdaily.com/new-invention-triggers-one-of-quantum-mechanics-strangest-and-most-useful-phenomena/", "urlToImage": "https://scitechdaily.com/images/Metasurface-Entangled-Photons.jpg", "publishedAt": "2022-09-19T22:23:58Z", "content": "BySandia National LaboratoriesSeptember 19, 2022\r\nIn this artists rendering of a metasurface, light passes through tiny, rectangular structures the building blocks of the metasurface and creates pair… [+7503 chars]"}, {"source": {"id": null, "name": "9to5Mac"}, "author": "Chance Miller", "title": "iPhone 14 Pro camera shaking and rattling in TikTok, Snapchat, and other apps [Update: Fix coming next week] - 9to5Mac", "description": "It appears that many popular third-party apps weren’t quite prepared for the iPhone 14 Pro’s new camera technology. A number of iPhone 14 Pro users are unable to take pictures and images using third-party apps like Snapchat, TikTok, and Instagram. These probl…", "url": "https://9to5mac.com/2022/09/19/iphone-14-pro-camera-module-shaking-and-rattling/", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/09/iPhone-14-update-iOS-16.0.1-1.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2022-09-19T20:00:00Z", "content": "It appears that many popular third-party apps weren’t quite prepared for the iPhone 14 Pro’s new camera technology. A number of iPhone 14 Pro users are unable to take pictures and images using third-… [+2636 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA preparing for cryogenic test of Artemis 1 moon rocket! - HT Tech", "description": "NASA is planning to conduct a cryogenic demonstration test by loading cold liquid hydrogen and liquid oxygen into the Space Launch System (SLS) ahead of launch.", "url": "https://tech.hindustantimes.com/tech/news/nasa-preparing-for-cryogenic-test-of-artemis-1-moon-rocket-71663602373108.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/19/1600x900/FILES-US-SPACE-MOON-LAUNCH-0_1663602445671_1663602445671_1663602469341_1663602469341.jpg", "publishedAt": "2022-09-19T15:48:46Z", "content": "NASA is preparing to launch Artemis 1 on September 27. However, the US space agency will conduct a cryogenic test of Artemis 1 ahead of the launch to confirm that the fuel leak has been resolved. The… [+1569 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This trick will let you save FLAT $400 on iPhone 14 Pro; No Trade-in required! - HT Tech", "description": "iPhone 14 Pro is available with a discount of $400 on Xfinity. Here's how to avail this deal.", "url": "https://tech.hindustantimes.com/mobile/news/this-trick-will-let-you-save-flat-400-on-iphone-14-pro-no-trade-in-required-71663599613293.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/19/1600x900/US-TECHNOLOGY-APPLE-25_1662899393498_1662899393498_1663599714856_1663599714856.jpg", "publishedAt": "2022-09-19T15:02:09Z", "content": "As soon as iPhone 14 series sales kicked off, several e-commerce websites, online retailers and service providers introduced some exciting iPhone deals. Now, there are a plethora of deals available i… [+2066 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Say Refreezing Earth’s Poles Is Feasible and Remarkably Cheap - SciTechDaily", "description": "Earth’s poles are warming several times faster than the global average. In fact, record-smashing heatwaves were reported earlier this year in both the Arctic and Antarctic. Melting ice and collapsing glaciers at high latitudes would accelerate sea level rise …", "url": "https://scitechdaily.com/scientists-say-refreezing-earths-poles-is-feasible-and-remarkably-cheap/", "urlToImage": "https://scitechdaily.com/images/Planet-Earth-Panoramic-Arctic.jpg", "publishedAt": "2022-09-19T12:39:18Z", "content": "ByIOP PublishingSeptember 19, 2022\r\nAccording to new research, refreezing the poles by reducing incoming sunlight would be both feasible and remarkably cheap.\r\nEarths poles are warming several times … [+4145 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Zealand’s Mount Ruapehu Captured in Stunning Image by Space Station Astronaut - SciTechDaily", "description": "A lake at the summit of the volcano provides the main clues to what is happening below. While passing over the North Island of New Zealand, an astronaut onboard the International Space Station (ISS) took a photograph of Mount Ruapehu, offering a nadir (straig…", "url": "https://scitechdaily.com/?p=207677", "urlToImage": "https://scitechdaily.com/images/New-Zealand-Mount-Ruapehu-scaled.jpg", "publishedAt": "2022-09-19T10:03:14Z", "content": "ByNASA Earth ObservatorySeptember 19, 2022\r\nNew Zealands Mount Ruapehu. September 23, 2021.\r\nA lake at the summit of the volcano provides the main clues to what is happening below.\r\nWhile passing ove… [+3965 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "What’s Next in Cloud – Tarsus CEO Anton Herbst discusses how the cloud has evolved - MyBroadband", "description": "Anton Herbst has over 25 years of experience in the IT Industry and has watched how cloud technology has evolved over the past few years.", "url": "https://mybroadband.co.za/news/cloud-hosting/460906-whats-next-in-cloud-tarsus-ceo-anton-herbst-discusses-how-the-cloud-has-evolved.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/09/Tarsus-header-image.jpg", "publishedAt": "2022-09-19T09:16:27Z", "content": "Anton Herbst is the CEO of Tarsus On Demand and Tarsus Technology Group and has over 25 years of IT industry experience.\r\nDuring his tenure in the MB Technologies Group, Herbst has held multiple posi… [+935 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "CellResearch Corporation announces positive results of phase I diabetic foot ulcer study - Labiotech.eu", "description": "CellResearch Corporation has closed the first phase I study for CorLiCyte, a stem cell therapy derived from umbilical cord lining stem cells.", "url": "https://www.labiotech.eu/trends-news/positive-results-cellresearch-diabetic-foot-ulcer-study/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2022/09/shutterstock-685184773.jpg", "publishedAt": "2022-09-19T08:56:45Z", "content": "CellResearch Corporation, a Singapore-based biopharma company says it has successfully closed the first phase I study for CorLiCyte, a stem cell therapy derived from umbilical cord lining stem cells,… [+2644 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What to expect from South Africa’s interest rate hike this week - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary forces.", "url": "https://businesstech.co.za/news/government/626338/what-to-expect-from-south-africas-interest-rate-hike-this-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-09-19T08:32:10Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary f… [+3057 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Singapore and India to partner in fintech innovations - CNA", "description": "The Monetary Authority of Singapore (MAS) and India’s International Financial Services Centres Authority (IFSCA) signed an agreement on Sunday (Sep 18) to facilitate regulatory collaboration and partnership in fintech.  The agreement will promote regulatory s…", "url": "https://www.channelnewsasia.com/singapore/mas-india-partner-fintech-innovations-dpm-lawrence-wong-2947081", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--ni176Ohz--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/09/18/MCI3_FinTech Co-operation Agreement.jpg?itok=bHtUACHj", "publishedAt": "2022-09-18T13:01:36Z", "content": "The Monetary Authority of Singapore (MAS) and Indias International Financial Services Centres Authority (IFSCA) signed an agreement on Sunday (Sep 18) to facilitate regulatory collaboration and partn… [+1316 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Thought a Bacteria Was Harmless – They Were Wrong - SciTechDaily", "description": "An international study led by Singapore scientists discovers bacteria previously thought harmless can worsen existing lung disease. A team of international scientists has discovered that Neisseria — a genus of bacteria that lives in the human body – is not as…", "url": "https://scitechdaily.com/scientists-thought-a-bacteria-was-harmless-they-were-wrong/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Scan-Pneumonia-Lung-Infection.jpg", "publishedAt": "2022-09-18T04:59:39Z", "content": "Scientists have discovered that a type of bacteria is not as harmless as previously thought. It can actually cause infections in patients with bronchiectasis, asthma, and chronic obstructive pulmonar… [+11042 chars]"}]}