{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "When Telescopes Fall: The Daring Recovery of NASA's Dark Matter Data - SciTechDaily", "description": "And the recovery journey involving a smashed telescope, a cougar scare, and police. Data from a NASA mission to map dark matter around galaxy clusters has been saved by a new recovery system designed by scientists at the University of Sydney. The system allow…", "url": "https://scitechdaily.com/when-telescopes-fall-the-daring-recovery-of-nasas-dark-matter-data/", "urlToImage": "https://scitechdaily.com/images/Tarantula-Nebula-SuperBIT-scaled.jpg", "publishedAt": "2023-11-19T05:21:06Z", "content": "ByUniversity of SydneyNovember 18, 2023\r\nThe Tarantula Nebula taken by the Super Pressure Balloon Imaging Telescope (SuperBIT). Credit: NASA/SuperBIT\r\nAnd the recovery journey involving a smashed tel… [+6796 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Dell, HP among 27 firms granted approval under PLI 2.0 scheme: Union IT Minister Ashwini Vaishnaw - ANI News", "description": "27 companies have been approved for the Production Linked Incentive Scheme (PLI) scheme for IT hardware, informed Union Electronics and Information Technolog...", "url": "https://www.youtube.com/watch?v=4BwStoyXzH4", "urlToImage": "https://i.ytimg.com/vi/4BwStoyXzH4/maxresdefault.jpg", "publishedAt": "2023-11-18T12:07:29Z", "content": null}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "An active stellar corpse shows signs of life after the star’s explosive death - Tech Explorist", "description": "With unprecedented flares, stellar corpse shows signs of life.", "url": "https://www.techexplorist.com/active-stellar-corpse-shows-signs-life-stars-explosive-death/77450/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/11/AT2022tsd.jpg", "publishedAt": "2023-11-18T10:27:58Z", "content": "A Cornell-led team reveals that following the cataclysmic death of a distant star, an active stellar corpse was most likely the cause of many intense flares recorded over several months. This was a s… [+3964 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mars Unveils Its Nighttime Secret: Mesmerizing Green Glow Discovered - SciTechDaily", "description": "ESA's ExoMars Trace Gas Orbiter has discovered a green nightglow in the Martian atmosphere, providing crucial data on atmospheric processes and potential illumination for future Martian missions. This phenomenon, distinct from auroras, marks a significant adv…", "url": "https://scitechdaily.com/mars-unveils-its-nighttime-secret-mesmerizing-green-glow-discovered/", "urlToImage": "https://scitechdaily.com/images/Green-Glow-in-Martian-Night.jpg", "publishedAt": "2023-11-18T02:55:48Z", "content": "ByEuropean Space Agency (ESA)November 17, 2023\r\nThis image shows an artists impression of what nightglow might look like to an astronaut in the polar winter regions of Mars at night. The green glow o… [+6987 chars]"}]}