{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Gadgets360.com"}, "author": "Gadgets 360 Staff", "title": "Apple iPhone 15 Price in India Drops During Flipkart Mega June Bonanza Sale: Check New Price, Specifications | Technology News - Gadgets 360", "description": "Apple iPhone 15 price in India has received a massive discount during the Flipkart Mega June Bonanza sale. During the sale event, Apple's iPhone 15 will be available at a lower price, while customers lower the cost of the iPhone 15 by an additional Rs. 1,000 …", "url": "https://www.gadgets360.com/mobiles/news/apple-iphone-15-price-india-discount-flipkart-mega-june-bonanza-deal-offer-5910446", "urlToImage": "https://i.gadgets360cdn.com/large/iphone_15_apple_1707541948744.jpg", "publishedAt": "2024-06-17T15:14:20Z", "content": "Apple iPhone 15 price in India has dropped once again, as part of an ongoing sale event on Flipkart. Customers can purchase Appe's latest iPhone model via the e-commerce platform at a deeply discount… [+2412 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss the Strawberry Moon in June's Night Sky! - SciTechDaily", "description": "The Next Full Moon is the Strawberry Moon; the Flower, Hot, Hoe, or Planting Moon; the Mead or Honey Moon; the Rose Moon; Vat Purnima; Poson Poya; and the LRO Moon. On June 21, 2024, the full \"Strawberry Moon\" will be visible, marked by various cultural celeb…", "url": "https://scitechdaily.com/dont-miss-the-strawberry-moon-in-junes-night-sky/", "urlToImage": "https://scitechdaily.com/images/Full-Strawberry-Moon-Illustration.jpg", "publishedAt": "2024-06-17T13:23:50Z", "content": "The name “Strawberry Moon” isn’t from the color of the Moon, despite what you see in this artist’s illustration. It comes from the Algonquin tribes of North America, marking the time of year when wil… [+20694 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unexpected Find: Webb Discovers Mystery Sulfur on Distant Planet - SciTechDaily", "description": "GJ 3470 b is a gas dwarf with unexpected sulfur dioxide in its atmosphere. This discovery provides insights into planet formation and chemical reactions. A surprising yellow haze of sulfur dioxide in the atmosphere of a gas “dwarf” exoplanet about 96 light ye…", "url": "https://scitechdaily.com/unexpected-find-webb-discovers-mystery-sulfur-on-distant-planet/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-GJ-3470-b.jpg", "publishedAt": "2024-06-17T00:57:32Z", "content": "The sulfur-laden atmosphere discovered on gaseous exoplanet GJ 3470 b, shown here in an illustration orbiting its star in the constellation Cancer, could help researchers figure out how it (and simil… [+5332 chars]"}]}