{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 price hike: Big blow for fans! Latest leak reveals what Apple is set to do - HT Tech", "description": "Apple fans are a worried lot. It has been hinted at recently that iPhone 15 price hike is very much likely. Now, Dan Ives has revealed that there is a high chance of a price hike.", "url": "https://tech.hindustantimes.com/tech/news/iphone-15-price-hike-big-blow-for-fans-latest-leak-reveals-what-apple-is-set-to-do-71686504949573.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/11/1600x900/jetbu-pVC1WaokqLM-unsplash_1677994704557_1686505110906.jpg", "publishedAt": "2023-06-11T17:41:17Z", "content": "iPhone 15 design changes have been repeatedly leaked. Changes are massive and none of them have created any backlash - so far. However, the major concern has been around whether Apple will increase i… [+1000 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exotic Matter Uncovered: Physicists Stumble Upon a Material Composed of Bosons - SciTechDaily", "description": "Take a lattice — a flat section of a grid of uniform cells, like a window screen or a honeycomb — and lay another, similar lattice above it. But instead of trying to line up the edges or the cells of both lattices, give the top grid a twist so that you can se…", "url": "https://scitechdaily.com/?p=284932", "urlToImage": "https://scitechdaily.com/images/Abstract-Physics-Exotic-Material.jpg", "publishedAt": "2023-06-11T17:32:22Z", "content": "Scientists have discovered a new state of matter, termed a bosonic correlated insulator, through the interaction of bosonic particles called excitons. This research could pave the way for new underst… [+5197 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Lost in Space? Why – and How – NASA Gives a Name to Every Spot It Studies on Mars - SciTechDaily", "description": "Martian maps are full of monikers recognizing places on Earth, explorers, and even cartoon characters. NASA’s Perseverance rover is currently investigating rock outcrops alongside the rim of Mars’ Belva Crater. Some 2,300 miles (3,700 kilometers) away, NASA’s…", "url": "https://scitechdaily.com/lost-in-space-why-and-how-nasa-gives-a-name-to-every-spot-it-studies-on-mars/", "urlToImage": "https://scitechdaily.com/images/Belva-Crater-Mars-Close-Up.jpg", "publishedAt": "2023-06-11T16:18:09Z", "content": "ByJet Propulsion LaboratoryJune 11, 2023\r\nThis image from a map of Jezero Crater shows the area NASAs Perseverance Mars rover is currently exploring, including Belva Crater, just below the center of … [+7715 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Investing.com", "title": "This week in tech: Wall Street cautious on Apple's Vision Pro; Coinbase sued - Investing.com India", "description": "The Financial News section features stock market news in addition to stories about bonds, forex, commodities and economic releases.", "url": "https://in.investing.com/news/this-week-in-tech-wall-street-cautious-on-apples-vision-pro-coinbase-sued-3680266", "urlToImage": "https://i-invdn-com.investing.com/news/https://d1-invdn-com.investing.com/content/picf5eaaa7280da1d2fa850a1f59db3ec2c.png", "publishedAt": "2023-06-11T13:21:05Z", "content": "By Louis Juricic and Sarina Isaacs\r\nInvesting.com -- Here is your weekly Pro Recap on the biggest headlines out of a big earnings week for tech: reactions to Apple's Vision Pro launch; the SEC's laws… [+6359 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cause and Cure Discovered for Common Type of High Blood Pressure - SciTechDaily", "description": "Clinicians at Queen Mary University of London and Barts Hospital have identified a gene variant that causes a common type of hypertension (high blood pressure) and a way to cure it, new research published in the journal Nature Genetics shows. The cause is a t…", "url": "https://scitechdaily.com/cause-and-cure-discovered-for-common-type-of-high-blood-pressure/", "urlToImage": "https://scitechdaily.com/images/Measuring-Blood-Pressure-Heart-Cardiology.jpg", "publishedAt": "2023-06-11T10:43:07Z", "content": "A recently discovered gene variant, found in benign nodules in 5% of people with hypertension, leads to an overproduction of the hormone aldosterone, causing high blood pressure. The condition can be… [+5197 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Another Power Generating Spacewalk Outside the Space Station - SciTechDaily", "description": "Another power-generating spacewalk outside the space station … A commercial resupply spacecraft heads to the station … And sharing the experience of a ride aboard the space station … A few of the stories to tell you about – This Week at NASA! https://youtu.be…", "url": "https://scitechdaily.com/this-week-nasa-another-power-generating-spacewalk-outside-the-space-station/", "urlToImage": "https://scitechdaily.com/images/Another-Power-Generating-Spacewalk-Outside-Space-Station.jpg", "publishedAt": "2023-06-11T09:33:22Z", "content": "ByNASAJune 11, 2023\r\nNASA astronauts Steve Bowen and Woody Hoburg successfully completed a spacewalk to install a new solar array (IROSA) on the ISS, improving its power generation by 30%. Credit: NA… [+5215 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Waugh Tech Correspondent", "title": "This is what the space colonies of the near future might look like, according to experts - Daily Mail", "description": "Human exploration of space will begin with 'technauts' building structures near Earth, experts say.", "url": "https://www.dailymail.co.uk/sciencetech/article-12177475/This-space-colonies-near-future-look-like-according-experts.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/06/09/12/71951947-0-image-a-2_1686309202836.jpg", "publishedAt": "2023-06-11T09:31:07Z", "content": "From Interstellar to the Martian, human space exploration has been a key feature in science fiction blockbusters throughout the years. \r\nBut what will human colonies in space look like in reality?  \r… [+9435 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 11 June 2023: What is the TRUE colour of the Sun? - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day shows the wide-colour spectrum of the Sun.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-11-june-2023-what-is-the-true-colour-of-the-sun-71686469893592.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/11/1600x900/sunspectrum_mpso_960_1686469966200_1686469974791.jpg", "publishedAt": "2023-06-11T07:53:29Z", "content": "What Color is the Sun? The answer to this question seems obvious -- yellow. That's what we see on a daily basis, right? But you would be surprised to know, that the true colour of the Sun is not abso… [+1971 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "474-meter Asteroid 2001 LD to speed past Earth at 18952 km/second today - HT Tech", "description": "Asteroid 2001 LD will zoom past Earth today and it will come within 8.84 million kilometers. Next time it comes will be 61 years later in 2084.", "url": "https://tech.hindustantimes.com/tech/news/474meter-asteroid-2001-ld-to-speed-past-earth-at-18952-km-second-today-71686467687713.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/11/1600x900/asteroids_1686468007649_1686468007850.jpg", "publishedAt": "2023-06-11T07:25:42Z", "content": "It is going to be a remarkable Sunday for cosmic enthusiasts as Asteroid 2001 LD, belonging to the Apollo group, will have a chillingly close encounter with Earth. This colossal celestial body, estim… [+819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Logitech M240 Silent review: Soft touch and smooth rolls - The Indian Express", "description": "Full review of the Logitech M240 a compact wireless mouse that's also silent.", "url": "https://indianexpress.com/article/technology/tech-reviews/logitech-m240-silent-review-8656799/", "urlToImage": "https://images.indianexpress.com/2023/06/logitech-m240-1.jpg", "publishedAt": "2023-06-11T05:47:47Z", "content": "I rarely use a mouse along with my MacBook. But there are times, especially when working on large Google Sheets or on Canva when I am craving for one. And also, as someone who used to make lots of pa… [+1275 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "COVID-19 Can Cause Brain Cells To Fuse – Leading to Chronic “Long COVID” Neurological Symptoms - SciTechDaily", "description": "Researchers have discovered viruses such as SARS-CoV-2 can cause brain cells to fuse, initiating malfunctions that lead to chronic neurological symptoms. Scientists at The University of Queensland have discovered viruses such as SARS-CoV-2 can cause brain cel…", "url": "https://scitechdaily.com/covid-19-can-cause-brain-cells-to-fuse-leading-to-chronic-long-covid-neurological-symptoms/", "urlToImage": "https://scitechdaily.com/images/Neuronal-Fusion.gif", "publishedAt": "2023-06-11T03:33:04Z", "content": "ByUniversity of QueenslandJune 10, 2023\r\nScientists discovered that viruses like SARS-CoV-2 can cause brain cells to fuse, leading to chronic neurological symptoms. This process, where neurons either… [+5277 chars]"}, {"source": {"id": null, "name": "Citylife.capetown"}, "author": "André De Bonis", "title": "21st Century Technologies: Predictive Analytics in Astronomical Observations - CityLife", "description": "21st Century Technologies: Predictive Analytics in Astronomical Observations - CityLife", "url": "https://citylife.capetown/uncategorized/21st-century-technologies-predictive-analytics-in-astronomical-observations/32444/", "urlToImage": "https://citylife.capetown/wp-content/uploads/2023/05/mfrack_realistic_photo_of_robotic_high_resolution_91228c45-283c-4d8f-b4f4-b4662a186bff.jpeg", "publishedAt": "2023-06-10T16:19:26Z", "content": "In the 21st century, technology has become an indispensable part of our lives, shaping and transforming various industries and sectors. One such area that has witnessed significant advancements is th… [+4007 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Newly Discovered Dinosaur Iani May Have Been Species' “Last Gasp” in a Changing Planet - SciTechDaily", "description": "The newly discovered dinosaur, Iani smithi, lived during the climatic upheavals of the mid-Cretaceous era and might be the last of its lineage, replaced by duckbill dinosaurs. This dinosaur, found in Utah, represents a critical transitional period in dinosaur…", "url": "https://scitechdaily.com/newly-discovered-dinosaur-iani-may-have-been-species-last-gasp-in-a-changing-planet/", "urlToImage": "https://scitechdaily.com/images/Iani-Smithi-scaled.jpg", "publishedAt": "2023-06-10T15:29:29Z", "content": "ByNorth Carolina State UniversityJune 10, 2023\r\nArtists reconstruction of Iani smithi. This recently discovered early ornithopod dinosaur may represent a species final stand during a period of global… [+6646 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Have Mapped the Ground Beneath Antarctica's Most Vulnerable Glacier for the First Time - SciTechDaily", "description": "For the first time, a team including an expert from Swansea has charted the ground beneath Antarctica's most at-risk glacier, providing vital insights into its susceptibility to climate change. The team's study of the sub-glacial geology of West Antarctica's …", "url": "https://scitechdaily.com/scientists-have-mapped-the-ground-beneath-antarcticas-most-vulnerable-glacier-for-the-first-time/", "urlToImage": "https://scitechdaily.com/images/Glimpse-of-Future-of-Thwaites-Glacier.jpg", "publishedAt": "2023-06-10T08:20:04Z", "content": "BySwansea UniversityJune 10, 2023\r\nBritish Antarctic Survey Twin Otter aircraft flies over Thwaites Glacier with instrumentation attached to the wing. Credit: Carl Robinson/British Antarctic Survey\r\n… [+5599 chars]"}]}