{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tunnel Rescue Official Was Told Rat-Hole Mining Is Illegal. Watch His Response - NDTV", "description": "Uttarkashi Tunnel Rescue Live: The rat-hole mining technique, which was outlawed in 2014, was used to clear the last few meters in the operation to rescue 41 workers trapped in the collapsed Silkyara tunnel in Uttarakhand for the last 17 days.", "url": "https://www.ndtv.com/india-news/uttarkashi-tunnel-rescue-live-tunnel-rescue-official-was-told-rat-hole-mining-is-illegal-watch-his-response-4614045", "urlToImage": "https://c.ndtvimg.com/2023-11/kinlpbgg_tunnel-rescue-latest-photo-1200_625x300_28_November_23.jpg", "publishedAt": "2023-11-28T14:34:00Z", "content": "The mining practice came to the rescue after heavy machines broke down.\r\nThe rat-hole mining technique, which was outlawed in 2014, was used to clear the last few meters in the operation to rescue 41… [+3636 chars]"}, {"source": {"id": null, "name": "Bqprime.com"}, "author": "PTI", "title": "Bharat Biotech, Sydney ID Announce MoU To Advance Vaccine Research Initiative - BQ Prime", "description": "The agreement aims to build strong sectoral and cross-organizational collaborations to design novel methodologies to tackle future epidemics and infectious diseases, Bharat Biotech said in a statement.", "url": "https://www.bqprime.com/business/bharat-biotech-sydney-id-announce-mou-to-advance-vaccine-research-initiative", "urlToImage": "https://gumlet.assettype.com/bloombergquint%2F2023-11%2Fd05f0f78-53b7-4fcc-867a-e2e588c46447%2Fsasun_bughdaryan_RlIppR1I3E8_unsplash.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2023-11-28T11:58:50Z", "content": "Professor Jamie Triccas, the deputy director at Sydney ID said, \"Positioning Sydney ID on a global scale to drive innovation and highlight our expertise in the development of new vaccines and biother… [+305 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Jade Chung-Lee", "title": "200+ Editor-Approved Cyber Monday Deals in 15 Key Tech Categories - PCMag", "description": "Prices aren't going to get much lower this year. Don't miss your last chance to score major savings on everything from laptops, monitors and TVs to headphones, smartwatches, and robot vacuums.", "url": "https://www.pcmag.com/news/best-cyber-monday-computer-electronics-deals", "urlToImage": "https://i.pcmag.com/imagery/articles/05h5IoIDLHsTiOdVySysurU-1.fit_lim.size_1200x630.v1701032135.png", "publishedAt": "2023-11-28T11:54:22Z", "content": null}, {"source": {"id": null, "name": "Geospatial World"}, "author": "Jeffy Jacob", "title": "Geospatial Technologies for Disaster Management: A Data-Driven Approach - Geospatial World", "description": "At the AGI GeoResilience Symposium, Dr. Mrutunjay Mohapatra, Director General of Meteorology at IMD, emphasized the critical role of high-resolution geospatial data in disaster management. He stated, \"We have the framework but need better data.\"", "url": "https://www.geospatialworld.net/news/data-driven-approach-disaster-mitigation/", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2023/11/MicrosoftTeams-image-138.jpg", "publishedAt": "2023-11-28T10:43:53Z", "content": "In today’s world, where natural disasters are becoming increasingly frequent and severe, the need for effective disaster management strategies is more crucial than ever. Geospatial technologies, such… [+4405 chars]"}, {"source": {"id": null, "name": "Endpoints News"}, "author": "Ryan Cross", "title": "Feng Zhang's latest gene editing trawl reels in 188 new CRISPR systems - Endpoints News", "description": "The next wave of gene editing technology could come from bacteria living in Antarctic lakes, coal mines or even dog saliva, and those are just a few of the odd places where scientists have identified 188 new CRISPR systems that could be repurposed as gene edi…", "url": "https://endpts.com/feng-zhangs-latest-gene-editing-trawl-reels-in-188-new-crispr-systems/", "urlToImage": "https://endpts.com/wp-content/uploads/2023/11/Feng-Zhang-Credit_-MIT-McGovern-Institute.jpg", "publishedAt": "2023-11-27T16:24:00Z", "content": "The next wave of gene edit­ing tech­nol­o­gy could come from bac­te­ria liv­ing in Antarc­tic lakes, coal mines or even dog sali­va, and those are just a few of the odd places where sci­en­tists have… [+759 chars]"}]}