{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Discover Hidden Biological Culprit Responsible for Middle-Aged Obesity - SciTechDaily", "description": "Researchers at Nagoya University and their colleagues in Japan have discovered that obesity in middle age is due to age-related alterations in the form of neurons in the hypothalamus, the brain region responsible for regulating metabolism and appetite. A prot…", "url": "https://scitechdaily.com/scientists-discover-hidden-biological-culprit-responsible-for-middle-aged-obesity/", "urlToImage": "https://scitechdaily.com/images/Brain-Obesity-Weight-Loss.jpg", "publishedAt": "2024-03-17T15:22:27Z", "content": "A study by Nagoya University reveals that middle-age obesity may be caused by the shortening of specific brain structures that regulate metabolism, suggesting that dietary management could be key to … [+4754 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 asteroids will pass Earth in the coming days, reveals NASA; Know the size, speed, and more - HT Tech", "description": "Check out the 5 upcoming asteroids that will pass near to Earth, according to NASA statistics. Know their speed, size, distance, and more.", "url": "https://tech.hindustantimes.com/photos/5-asteroids-will-pass-earth-in-the-coming-days-reveals-nasa-know-the-size-speed-and-more-71710682343105.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/17/1600x900/Asteroid_2024_EP3_1710682450095_1710682450442.jpg", "publishedAt": "2024-03-17T13:35:58Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "WhatsApp update set to enhance your experience, allow you to pin multiple chats and messages - HT Tech", "description": "WhatsApp is rolling out a new feature allowing users to pin multiple chats and messages to streamline the organization and enhance accessibility for important conversations. This WhatsApp update is available to some beta testers now.", "url": "https://tech.hindustantimes.com/tech/news/whatsapp-update-set-to-enhance-your-experience-allow-you-to-pin-multiple-chats-and-messages-71710661827725.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/17/1600x900/WhatsApp_1710662154217_1710662154419.jpg", "publishedAt": "2024-03-17T07:58:58Z", "content": "WhatsApp, under Meta's umbrella, is testingout a new feature that will allow users to pin multiple chats and messages simultaneously. This functionality is currently in the testing phase and is avail… [+1732 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "LinkedIn gaming? Microsoft-owned platform looks to spark new interactions and engagement - HT Tech", "description": "Microsoft-owned LinkedIn, a platform synonymous with professional networking, is set to introduce a new feature to boost engagement and spark new interactions. Check what LinkedIn gaming may offer.", "url": "https://tech.hindustantimes.com/gaming/news/linkedin-gaming-microsoft-owned-platform-looks-to-spark-new-interactions-and-engagement-71710658299623.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/17/1600x900/LinkedIn_1710658509313_1710658509458.jpg", "publishedAt": "2024-03-17T06:57:38Z", "content": "In a bid to enhance user engagement and inject a dose of entertainment into its professional networking domain, LinkedIn, under the umbrella of Microsoft, is gearing up to introduce gaming features t… [+2785 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Quantum Leap in Material Science: Researchers Unveil AI-Powered Atomic Fabrication Technique - SciTechDaily", "description": "Researchers at the National University of Singapore (NUS) have developed an innovative method for creating carbon-based quantum materials atom by atom. This method combines the use of scanning probe microscopy with advanced deep neural networks. The achieveme…", "url": "https://scitechdaily.com/quantum-leap-in-material-science-researchers-unveil-ai-powered-atomic-fabrication-technique/", "urlToImage": "https://scitechdaily.com/images/Quantum-Material-Manufacturing.jpg", "publishedAt": "2024-03-17T05:38:15Z", "content": "This allows for precise engineering of their -electron topology and spin configurations in an automated manner, mirroring the capabilities of human chemists.very goodPlease consider:1. Can spin creat… [+4596 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extensive Research Reveals 32 Health Risks Linked to Ultra-Processed Foods - SciTechDaily", "description": "Findings underscore need for urgent research to understand how ultra-processed foods affect health and measures to target and reduce exposure. Consistent evidence shows that higher exposure to ultra-processed foods is associated with an increased risk of 32 d…", "url": "https://scitechdaily.com/extensive-research-reveals-32-health-risks-linked-to-ultra-processed-foods/", "urlToImage": "https://scitechdaily.com/images/Assorted-Unhealthy-Junk-Food.jpg", "publishedAt": "2024-03-16T13:34:33Z", "content": "A new study highlights the link between high consumption of ultra-processed foods and an increased risk of various health issues, including cancer, heart and lung diseases, mental health problems, an… [+5798 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jupiter Unveiled: Hubble Captures the Giant's Roaring Storms and Volcanic Moon Io - SciTechDaily", "description": "Cyclones, Wind Shear, Violent Storms Churn in Jupiter's Atmosphere The largest and nearest of the giant outer planets, Jupiter's colorful clouds present an ever-changing kaleidoscope of shapes and colors. This is a planet where there is always stormy weather:…", "url": "https://scitechdaily.com/jupiter-unveiled-hubble-captures-the-giants-roaring-storms-and-volcanic-moon-io/", "urlToImage": "https://scitechdaily.com/images/Hubble-2024-Jupiter-scaled.jpg", "publishedAt": "2024-03-16T02:58:06Z", "content": "NASA’s Hubble Space Telescope captured new images of Jupiter on January 5-6, 2024, revealing dynamic weather patterns and notable storms like the Great Red Spot and Red Spot Jr. The observations are … [+6761 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Wildlife threats can be identified using AI technology - Earth.com", "description": "These platforms enhance our comprehension of wildlife threats on a global scale, thereby steering conservation efforts in new directions.", "url": "https://www.earth.com/news/global-wildlife-threats-can-be-identified-using-ai-technology/", "urlToImage": "https://cff2.earth.com/uploads/2024/03/15164906/Wildlife-threats.jpg", "publishedAt": "2024-03-15T22:53:28Z", "content": "A groundbreaking study led by the University of Sussex reveals how artificial intelligence (AI) and social media are becoming invaluable tools in detecting threats to wildlife around the world. \r\nThe… [+4149 chars]"}]}