{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Views of Mars Captured by Ultraviolet Eye Aboard NASA's MAVEN Spacecraft - SciTechDaily", "description": "NASA's MAVEN spacecraft has produced two captivating ultraviolet images of Mars, taken during opposite points in the planet's orbit around the Sun in 2022 and 2023. These images, vividly colorized for visibility, give unique insights into the Martian atmosphe…", "url": "https://scitechdaily.com/stunning-views-of-mars-captured-by-ultraviolet-eye-aboard-nasas-maven-spacecraft/", "urlToImage": "https://scitechdaily.com/images/NASA-MAVEN-Spacecraft-Ultraviolet-Views-of-Mars.jpg", "publishedAt": "2023-06-25T21:14:41Z", "content": "ByWillow Reed, LASP, University of Colorado BoulderJune 25, 2023\r\nNASAs MAVEN mission has captured two remarkable ultraviolet images of Mars at different points in its orbit in 2022 and 2023, offerin… [+6054 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Coolest Rocky Exoplanet Ever: James Webb Reveals Surprising Atmosphere of TRAPPIST-1 C - SciTechDaily", "description": "Infrared measurements of TRAPPIST-1 c indicate that it is probably not as Venus-like as once imagined. NASA’s James Webb Space Telescope has successfully measured the heat radiating from TRAPPIST-1 c, an exoplanet orbiting a red dwarf star 40 light-years from…", "url": "https://scitechdaily.com/coolest-rocky-exoplanet-ever-james-webb-reveals-surprising-atmosphere-of-trappist-1-c/", "urlToImage": "https://scitechdaily.com/images/Rocky-Exoplanet-Illustration.jpg", "publishedAt": "2023-06-25T15:25:29Z", "content": "BySpace Telescope Science InstituteJune 25, 2023\r\nNASAs James Webb Space Telescope has discovered that exoplanet TRAPPIST-1 c, despite being the same size as Venus and receiving similar radiation, do… [+18400 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 huge Asteroids approaching Earth, NASA warns - HT Tech", "description": "As per NASA, 5 asteroids are approaching Earth. NASA's telescopes have provided insight into their approach including speed, dimensions, and more.", "url": "https://tech.hindustantimes.com/photos/5-huge-asteroids-approaches-to-earth-nasa-warns-71687690851053.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/25/1600x900/slide1_1687691423159_1687691476322.jpg", "publishedAt": "2023-06-25T11:29:24Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Key Protein Vital for Structural Integrity of Neurons – Without It Axons Break, Synapses Die - SciTechDaily", "description": "Scientists find a protein common to flies and people is essential for supporting the structure of axons that neurons project to make circuit connections. In a study conducted by MIT's Picower Institute for Learning and Memory, researchers found that a protein…", "url": "https://scitechdaily.com/?p=287495", "urlToImage": "https://scitechdaily.com/images/Neuronal-Brain-Cell-Damage-Concept-Illustration.jpg", "publishedAt": "2023-06-25T10:28:18Z", "content": "ByDavid Orenstein, The Picower Institute for Learning and MemoryJune 25, 2023\r\nMIT scientists found that the protein perlecan, found in both flies and humans, is vital for maintaining the structural … [+8249 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "This asteroid was just named in honor of an Indian working at NASA - HT Tech", "description": "Three scientists including Rutu Parekh a planetary geologist have won the honor to have an asteroid named after them.", "url": "https://tech.hindustantimes.com/tech/news/this-asteroid-was-just-named-in-honor-of-an-indian-working-at-nasa-71687680734086.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/25/1600x900/asteroids_1686468007649_1687681016994.jpg", "publishedAt": "2023-06-25T08:19:44Z", "content": "In yet another proud moment for India, Rutu Parekh, a planetary geologist from Gujarat, and three other scientists were honored for their achievements. Rutu Parekh had an an asteroid named after her … [+1883 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Whopping 36% discount available on Poco M4 Pro; buy it for just Rs. 13999 - HT Tech", "description": "Whopping36 discount available on PocoM4Pro buy it for justRs.13999 Planning to buy a new smartphone but the budget is a big problem Then this Poco M4 Pro deal is a great solution for your troubles. Flipkart is offering a massive 36 discount on PocoM4Pro. Acco…", "url": "https://tech.hindustantimes.com/web-stories/whopping-36-discount-available-on-poco-m4-pro-buy-it-for-just-rs-13999-71687672769430.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/25/1600x900/20220303_170826_1646316488184_1647351354100_1687675047559_1687675051964.webp/", "publishedAt": "2023-06-25T01:07:38Z", "content": "Photo Credit: HT Tech\r\n  Planning to buy a new smartphone, but the budget is a big problem? Then this Poco M4 Pro deal is a great solution for your troubles.\r\nPhoto Credit: HT Tech\r\n Flipkart is offe… [+1196 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Radio Revelations: Unraveling the Origins of a Supernova - SciTechDaily", "description": "An international team of astronomers has revealed the origin of a thermonuclear supernova explosion. Strong emission lines of helium and the first detection of such a supernova in radio waves show that the exploding white dwarf star had a helium-rich companio…", "url": "https://scitechdaily.com/radio-revelations-unraveling-the-origins-of-a-supernova/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-06-24T08:32:28Z", "content": "ByUniversity of TurkuJune 24, 2023\r\nArtist impression of the double star system with a compact white dwarf star accreting matter from a helium-rich donor companion, surrounded by dense and dusty circ… [+4646 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "5 Yoga asanas for weight loss and apps to achieve your goal - HT Tech", "description": "5 Yoga asanas for weight loss and apps to achieve your goal Want to lose some extra weight These 5 yoga Asanas will not only help you lose weight but also keep your body and mind healthy. Check the Yoga apps that can help you too. The Virabhadrasana also know…", "url": "https://tech.hindustantimes.com/web-stories/5-yoga-asanas-for-weight-loss-and-apps-to-achieve-your-goal-71687609118267.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/24/1600x900/pexels-karolina-grabowska-4498150_1687612719047_1687612755137.jpg/", "publishedAt": "2023-06-24T07:50:00Z", "content": "Photo Credit: pexels\r\n Want to lose some extra weight? These 5 yoga Asanas will not only help you lose weight but also keep your body and mind healthy. Check the Yoga apps that can help you too.\r\nPho… [+2059 chars]"}]}