{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Danger! 80-foot asteroid hurtling towards Earth today, Sept 20; collision possible? - HT Tech", "description": "A huge asteroid will come terrifyingly close to Earth in a close encounter today. This asteroid has got NASA on alert. Will there be an asteroid collision with Earth?", "url": "https://tech.hindustantimes.com/tech/news/danger-80-foot-asteroid-hurtling-towards-earth-today-sept-20-collision-possible-71663649634411.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/20/1600x900/43cb2d66-f88a-11ec-b6f2-35645806a8b6_1660913599478_1660913599478_1663650431553_1663650431553.jpg", "publishedAt": "2022-09-20T05:08:10Z", "content": "Astonishingly, asteroids are rocky remnants left over from the early formation of our solar system about 4.6 billion years ago. They come in all shapes and sizes, with the largest asteroid measured a… [+2616 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mark Zuckerberg's $71 Billion Wealth Wipeout Puts Focus On Meta Struggle - NDTV", "description": "Mark Zuckerberg's pivot into the metaverse has cost him dearly in the real world. Even in a rough year for just about every US tech titan, the wealth erased from the CEO of Meta Platforms Inc. stands out.", "url": "https://www.ndtv.com/world-news/mark-zuckerbergs-wealth-cut-in-half-drops-by-71-billion-this-year-3359822", "urlToImage": "https://c.ndtvimg.com/2022-04/lcnii4_mark-zuckerberg-bloomberg_625x300_12_April_22.jpg", "publishedAt": "2022-09-20T04:29:39Z", "content": "It was less than two years ago when Mark Zuckerberg, 38, was worth $106 billion. (File)\r\nMark Zuckerberg's pivot into the metaverse has cost him dearly in the real world.\r\nEven in a rough year for ju… [+3111 chars]"}, {"source": {"id": null, "name": "Oneesports.gg"}, "author": "Wanzi Koh", "title": "Valorant's sleek ChronoVoid skin bundle bends space and time - ONE Esports", "description": "Valorant's new ChronoVoid skin bundle features futuristic weapons inspired by an ancient technology that only a precious few wield.", "url": "https://www.oneesports.gg/valorant/valorant-chronovoid-skin-bundle/", "urlToImage": "https://cdn.oneesports.gg/cdn-data/2022/09/Valorant_Chronovoid_Skin_Bundle.jpg", "publishedAt": "2022-09-20T04:19:54Z", "content": "Technological magic.Riot Games has dropped a teaser trailer for its new ChronoVoid skin bundle, featuring futuristic weapons inspired by an ancient technology that only a precious few wield.\r\nAny suf… [+2136 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 12 price drops to Rs. 42999 on Amazon sale! Should you buy this over iPhone SE 3? - HT Tech", "description": "The iPhone 12 price will drop to Rs. 42,999 during the Amazon Great Indian Festival Sale and will go down further with card offers.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-12-price-drops-to-rs-42999-on-amazon-sale-should-you-buy-this-over-iphone-se-3-71663645926854.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/20/1600x900/i12_1648889899640_1663646034326_1663646034326.jpg", "publishedAt": "2022-09-20T03:55:26Z", "content": "The iPhone 12 is going to get an insane price drop during the Amazon Great Indian Festival Sale. Launched in 2020 as Apple's flagship smartphone and positioned as a more affordable variant of the iPh… [+1830 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Mary Izuaka", "title": "383 Nigerian tech startups raised over $2 billion in seven years - Report - Premium Times", "description": "Lagos leads with no fewer than 88.4 per cent of the startups tracked", "url": "https://www.premiumtimesng.com/news/top-news/554968-383-nigerian-tech-startups-raised-over-2-billion-in-seven-years-report.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/09/Disrupt-Africa.jpg", "publishedAt": "2022-09-19T23:33:07Z", "content": "About 383 Nigerian tech startups raised a combined $2 billion in funding between January 2015 and August 2022 more than any other country within that period across Africa, a report has said.\r\nDisrupt… [+4665 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": "Luke Hurst", "title": "Hi-tech face mask with sensor could detect COVID, flu and other viruses - Euronews", "description": "Its developers say the smart mask would be especially useful in enclosed spaces like elevators.", "url": "https://www.euronews.com/next/2022/09/19/hi-tech-face-mask-with-sensor-could-detect-covid-flu-and-other-viruses", "urlToImage": "https://static.euronews.com/articles/stories/07/02/84/00/1000x563_cmsv2_5356ad17-baf4-5d3c-8e21-defab5b8e0aa-7028400.jpg", "publishedAt": "2022-09-19T15:22:30Z", "content": "Scientists have developed a face mask that can detect viruses in the air, including coronavirus and the flu.\r\nThe mask is able to detect the viruses even in ultra-low concentrations in liquid or gas.… [+2479 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Say Refreezing Earth’s Poles Is Feasible and Remarkably Cheap - SciTechDaily", "description": "Earth’s poles are warming several times faster than the global average. In fact, record-smashing heatwaves were reported earlier this year in both the Arctic and Antarctic. Melting ice and collapsing glaciers at high latitudes would accelerate sea level rise …", "url": "https://scitechdaily.com/scientists-say-refreezing-earths-poles-is-feasible-and-remarkably-cheap/", "urlToImage": "https://scitechdaily.com/images/Planet-Earth-Panoramic-Arctic.jpg", "publishedAt": "2022-09-19T12:39:18Z", "content": "ByIOP PublishingSeptember 19, 2022\r\nAccording to new research, refreezing the poles by reducing incoming sunlight would be both feasible and remarkably cheap.\r\nEarths poles are warming several times … [+4145 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Rand eyes R18.00 to the dollar as load shedding and rate uncertainty bite - BusinessTech", "description": "The South African rand has come under immense pressure on Monday (19 September) as the country feels the pressure of stage 6 load shedding, and markets look ahead to interest rate hikes from major central banks.", "url": "https://businesstech.co.za/news/finance/626572/rand-eyes-r18-00-to-the-dollar-as-load-shedding-and-rate-uncertainty-bite/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/02/South-Africa-rand-money-01.png", "publishedAt": "2022-09-19T12:29:44Z", "content": "The rand has come under immense pressure on Monday (19 September) as the country feels the pressure of stage 6 load shedding, and markets look ahead to interest rate hikes from major central banks.\r\n… [+3106 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Why you will probably have to pay 38% more for Eskom power next year - BusinessTech", "description": "Civil action group, Outa says that Eskom’s application to energy regulator Nersa for a 32% price hike in 2023 will end up being closer to 38% once backlogs and court-ordered increases are taken into account.", "url": "https://businesstech.co.za/news/energy/626532/why-you-will-probably-have-to-pay-38-more-for-eskom-power-next-year/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/02/Eskom-e1550211145665.jpg", "publishedAt": "2022-09-19T11:41:49Z", "content": "Civil action group, Outa says that Eskom’s application to energy regulator Nersa for a 32% price hike in 2023 will end up being closer to 38% once backlogs and court-ordered increases are taken into … [+3036 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Somya Agrawal", "title": "Mercedes AMG has released the teaser image of C63, 3 days before the premiere - The Tech Outlook", "description": "AMG brought a C63 prototype that was almost ready for production to the Goodwood Festival of Speed earlier this year. The sporty sedan will now be revealed. There isn't much we don't know about the BMW M3 competitor, but we're curious to see how the", "url": "https://www.thetechoutlook.com/news/new-release/auto/mercedes-amg-has-released-the-teaser-image-of-c63-3-days-before-the-premiere/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/09/Untitled-design-2022-09-19T161219.515.jpg", "publishedAt": "2022-09-19T11:20:31Z", "content": "AMG brought a C63 prototype that was almost ready for production to the Goodwood Festival of Speed earlier this year. The sporty sedan will now be revealed. There isn’t much we don’t know about the B… [+1768 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Zealand’s Mount Ruapehu Captured in Stunning Image by Space Station Astronaut - SciTechDaily", "description": "A lake at the summit of the volcano provides the main clues to what is happening below. While passing over the North Island of New Zealand, an astronaut onboard the International Space Station (ISS) took a photograph of Mount Ruapehu, offering a nadir (straig…", "url": "https://scitechdaily.com/?p=207677", "urlToImage": "https://scitechdaily.com/images/New-Zealand-Mount-Ruapehu-scaled.jpg", "publishedAt": "2022-09-19T10:03:14Z", "content": "ByNASA Earth ObservatorySeptember 19, 2022\r\nNew Zealands Mount Ruapehu. September 23, 2021.\r\nA lake at the summit of the volcano provides the main clues to what is happening below.\r\nWhile passing ove… [+3965 chars]"}, {"source": {"id": null, "name": "Labiotech.eu"}, "author": "Jim Cornall", "title": "CellResearch Corporation announces positive results of phase I diabetic foot ulcer study - Labiotech.eu", "description": "CellResearch Corporation has closed the first phase I study for CorLiCyte, a stem cell therapy derived from umbilical cord lining stem cells.", "url": "https://www.labiotech.eu/trends-news/positive-results-cellresearch-diabetic-foot-ulcer-study/", "urlToImage": "https://www.labiotech.eu/wp-content/uploads/2022/09/shutterstock-685184773.jpg", "publishedAt": "2022-09-19T08:56:45Z", "content": "CellResearch Corporation, a Singapore-based biopharma company says it has successfully closed the first phase I study for CorLiCyte, a stem cell therapy derived from umbilical cord lining stem cells,… [+2644 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What Really Killed Dinosaurs and Other Life on Earth? Maybe NOT an Asteroid Strike - SciTechDaily", "description": "Dartmouth-led research fortifies link between mega volcanoes and mass extinctions. What killed the dinosaurs 66 million years ago at the end of the Cretaceous Period? It has long been the topic of scientific debate, and many researchers have set out to determ…", "url": "https://scitechdaily.com/what-really-killed-dinosaurs-and-other-life-on-earth-maybe-not-an-asteroid-strike/", "urlToImage": "https://scitechdaily.com/images/Dinosaur-Extinction-Asteroid.jpg", "publishedAt": "2022-09-19T08:31:43Z", "content": "ByDartmouth CollegeSeptember 19, 2022\r\nWhile some scientists think that asteroid and comet strikes are the cause of mass extinction events on Earth, new research from Dartmouth points to volcanic eru… [+8330 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Earth’s Newest Secret: Fundamental Changes to What We Know About How Volcanoes Work - SciTechDaily", "description": "Recent discoveries from Iceland’s Fagradalsfjall eruptions alter what we know about how volcanoes work. Learning something that fundamentally changes how we understand our world doesn't happen very often. But for University of California, Santa Barbara Earth …", "url": "https://scitechdaily.com/the-earths-newest-secret-fundamental-changes-to-what-we-know-about-how-volcanoes-work/", "urlToImage": "https://scitechdaily.com/images/Fagradalsfjall-Volcanic-Eruption-at-Night.jpg", "publishedAt": "2022-09-19T01:55:16Z", "content": "Fagradalsfjall volcano in Iceland erupting at night.\r\nRecent discoveries from Icelands Fagradalsfjall eruptions alter what we know about how volcanoes work.\r\nLearning something that fundamentally cha… [+7121 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can We Live Longer? Physicist’s Breakthrough Discovery in Genetic Protective Layer - SciTechDaily", "description": "Researchers have discovered a new structure of telomeric DNA with the aid of physics and a tiny magnet. Telomeres are seen by many scientists as the key to living longer. They protect genes from damage but get a bit shorter each time a cell divides. If they b…", "url": "https://scitechdaily.com/can-we-live-longer-physicists-breakthrough-discovery-in-genetic-protective-layer/", "urlToImage": "https://scitechdaily.com/images/Telomeres-DNA-Genetics-Illustration.jpg", "publishedAt": "2022-09-18T15:46:21Z", "content": "ByLeiden UniversitySeptember 18, 2022\r\nResearchers have discovered a new structure of telomeric DNA, which could be key to living longer.\r\nResearchers have discovered a new structure of telomeric DNA… [+4787 chars]"}]}