{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Investopedia"}, "author": "Timothy Smith", "title": "Nvidia Stock in Spotlight After Drop From Record High - Investopedia", "description": "AI chipmaker Nvidia remains in focus after shares dropped from a record high reached Thursday and news that it will supply Middle Eastern telecommunications giant Ooredoo with its technology. Monitor these important chart levels.", "url": "https://www.investopedia.com/nvidia-stock-in-spotlight-after-drop-from-record-high-8667927", "urlToImage": "https://www.investopedia.com/thmb/gl3B24NHnc7Fj-mPtdeb_Dg0lT8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/NVDAChart-728c2c909550441cbb7d78311e8a1009.GIF", "publishedAt": "2024-06-24T01:58:00Z", "content": "<ul><li>AI chipmaker Nvidia remains in the spotlight after shares dropped from a record high reached Thursday and news that it will supply Middle Eastern telecommunications giant Ooredoo with its tec… [+2728 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 7 breathtaking images of celestial wonders captured by NASA WEBB Space Telescope - HT Tech", "description": "Top 7 breathtaking images of celestial wonders captured by NASA WEBB Space Telescope A vibrant starforming region reveals layers of orange red and blue gas and dust. A bright star casts an hourglass shadow amidst intricate patterns. Sparkling lights with dist…", "url": "https://tech.hindustantimes.com/web-stories/top-7-breathtaking-images-of-celestial-wonders-captured-by-nasa-webb-space-telescope-71719208115068.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/06/24/1600x900/NASA_1716706004117_1719208236682.jpg/", "publishedAt": "2024-06-24T00:33:37Z", "content": "Photo Credit: NASA A vibrant star-forming region reveals layers of orange, red, and blue gas and dust. A bright star casts an hourglass shadow amidst intricate patterns. Sparkling lights with distinc… [+1643 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "Meta makes its AI chatbot available to all users in India - TechCrunch", "description": "After a few months of testing during the general elections, Meta is making its Llama-3-powered AI chatbot available to all users in India. However, Meta", "url": "https://techcrunch.com/2024/06/23/meta-makes-its-ai-chatbot-available-to-all-users-in-india/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Meta-AI.jpg?resize=1200,675", "publishedAt": "2024-06-24T00:30:00Z", "content": "After a few months of testing during the general elections, Meta is making its Llama-3-powered AI chatbot available to all users in India. However, Meta AI currently only supports English and no othe… [+2768 chars]"}]}