{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "The vivo X80 series will be revealed in Malaysia in early May 2022 - TechNave", "description": "vivo Malaysia just launched the vivo T1 5G and T1x today and soon, the vivo X80 series will be launching in the Chinese market. With this, the former has take", "url": "https://technave.com/gadget/The-vivo-X80-series-will-be-revealed-in-Malaysia-in-early-May-2022-29795.html", "urlToImage": "https://technave.com/data/files/article/202204250652032340.jpeg", "publishedAt": "2022-04-25T07:06:34Z", "content": "vivo Malaysia just launched the vivo T1 5G and T1x today and soon, the vivo X80 series will be launching in the Chinese market. With this, the former has taken the opportunity to announce that the up… [+1026 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "India, EU launch new body to tackle challenges in trade, tech - Hindustan Times", "description": "This is the first time that India has agreed to set up such a trade and technology council with any of its partners | Latest News India", "url": "https://www.hindustantimes.com/india-news/india-eu-launch-new-body-to-tackle-challenges-in-trade-tech-101650870156077.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/25/1600x900/India-FM_1650870821971_1650870830791.jpg", "publishedAt": "2022-04-25T07:02:35Z", "content": "New Delhi: India and the European Union (EU) on Monday launched the India-EU Trade and Technology Council, a strategic mechanism to tackle challenges at the nexus of trade, trusted technology, and se… [+1877 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Sale live! Get up to 60% off on iPhone 6s, iPhone 7, iPhone 8, iPhone SE on Flipkart, Amazon - HT Tech", "description": "Flipkart and Amazon bring up to 60% off on refurbished iPhone 6s, iPhone 6s Plus, iPhone SE, iPhone 7 and iPhone 8.", "url": "https://tech.hindustantimes.com/mobile/news/sale-live-get-up-to-60-off-on-iphone-6s-iphone-7-iphone-8-iphone-se-on-flipkart-amazon-71650867122929.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/f923a2c4-7234-11ec-b98a-8de034e018b8_1646835540504_1650867335700.jpg", "publishedAt": "2022-04-25T06:17:07Z", "content": "Refurbished phone sale is live on Flipkart and Amazon! The e-commerce giants are giving away attractive deals on refurbished iPhones as well as android phones from popular brands like Apple, Samsung,… [+1593 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Hubble Space Telescope Spies a Tenuous Diffuse Galaxy - SciTechDaily", "description": "In this image from the NASA/ESA Hubble Space Telescope, the ultra-diffuse galaxy GAMA 526784 appears as a hazy patch of light. This wispy object is located in the constellation Hydra, approximately four billion light-years away from Earth. Ultra-diffuse galax…", "url": "https://scitechdaily.com/hubble-space-telescope-spies-a-tenuous-diffuse-galaxy/", "urlToImage": "https://scitechdaily.com/images/GAMA-526784-scaled.jpg", "publishedAt": "2022-04-25T05:32:51Z", "content": "ByESA/HubbleApril 24, 2022\r\nHubble Space Telescope captured GAMA 526784, an ultra-diffuse galaxy that appears as a tenuous patch of light in this image. This wispy object resides in the constellation… [+2755 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ganymede Casts a Massive Shadow Across Jupiter in Spectacular New Image From NASA’s Juno Spacecraft - SciTechDaily", "description": "NASA’s Juno spacecraft captured this magnificent view of Jupiter during the mission’s 40th close pass by the giant planet on February 25, 2022. The large, dark shadow on the left side of the image was cast by Jupiter’s moon Ganymede. Citizen scientist Thomas …", "url": "https://scitechdaily.com/ganymede-casts-a-massive-shadow-across-jupiter-in-spectacular-new-image-from-nasas-juno-spacecraft/", "urlToImage": "https://scitechdaily.com/images/Juno-Captures-Moon-Shadow-on-Jupiter-scaled.jpg", "publishedAt": "2022-04-25T04:21:29Z", "content": "Figure 1. Citizen scientist Thomas Thomopoulos created this enhanced-color image using raw data from the JunoCam instrument. At the time the raw image was taken, the Juno spacecraft was about 44,000 … [+2849 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Himani Jha", "title": "QR code scam alert! Don't ever get greedy! Check tips to stay safe from online frauds - HT Tech", "description": "Reports of QR code scams have been increasing steadily, especially during the last 2 years. To save yourself from falling victim to online frauds, here is what you should do.", "url": "https://tech.hindustantimes.com/tech/news/qr-code-scam-alert-don-t-ever-get-greedy-check-tips-to-stay-safe-from-online-frauds-71650860033009.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/25/1600x900/2_1650792781459_1650860142774.jpg", "publishedAt": "2022-04-25T04:17:29Z", "content": "With more and more people becoming dependent on the e-payment methods and online transactions, cases of online frauds have increased. Scammers have found ingenious ways to trap users and trick them t… [+2162 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "Sun emits massive solar flare with potential to impact satellite communications: CESSI - HT Tech", "description": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems", "url": "https://tech.hindustantimes.com/tech/news/sun-emits-massive-solar-flare-with-potential-to-impact-satellite-communications-cessi-71650711160202.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/04/23/1600x900/SUn_flares_NASA_pic_1645287521356_1650714493036.jpg", "publishedAt": "2022-04-24T17:48:20Z", "content": "The sun unleashed a massive solar flare on Wednesday, which has the potential to impact satellite communications and global positioning systems, the Centre of Excellence in Space Sciences India (CESS… [+1515 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tom Huddleston", "title": "Some of tech's biggest names want a future without passwords — here's what that would look like - CNBC", "description": "From Google to Microsoft, some of tech's biggest names say the dream of a password-less internet is close to reality. The truth is a little more complicated.", "url": "https://www.cnbc.com/2022/04/24/what-a-future-without-passwords-would-look-like-when-it-might-happen.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106197655-1571819572820gettyimages-866481488.jpeg?v=1571887535&w=1920&h=1080", "publishedAt": "2022-04-24T13:30:01Z", "content": "Managing your online passwords can be a chore.\r\nCreating the sort of long, complicated passwords that best deter cyber-thieves especially for dozens of different online accounts can be tedious. But i… [+4631 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's New “Lunar Backpack” Can Generate a Real-Time 3D Terrain Map To Aid Moon Explorers - SciTechDaily", "description": "Consider a mountaineering expedition in a completely uncharted environment, where the hikers had the ability to generate a real-time 3D map of the terrain. NASA researchers and industry partners have developed a remote-sensing mapping system that will aid exp…", "url": "https://scitechdaily.com/nasas-new-lunar-backpack-can-generate-a-real-time-3d-terrain-map-to-aid-moon-explorers/", "urlToImage": "https://scitechdaily.com/images/UAV-Drone-Landing-KNaCK-Technology.gif", "publishedAt": "2022-04-24T09:06:44Z", "content": "Michael Zanetti, a NASA planetary scientist at NASAs Marshall Space Flight Center in Huntsville, Alabama, hikes the Cinder cone in Potrillo volcanic field in New Mexico in late 2021, testing the back… [+5996 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What a good credit score looks like and how to improve it - BusinessTech", "description": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your ability to continue improving your life over the long term.", "url": "https://businesstech.co.za/news/finance/579878/what-a-good-credit-score-looks-like-and-how-to-improve-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/06/money-e1467040680257.jpg", "publishedAt": "2022-04-24T09:03:21Z", "content": "Whether buying a property or a car, most South Africans need credit to do so. And, knowing how much credit you qualify for and how you can improve your credit score may just be critical to your abili… [+4305 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mike Jennings", "title": "How to choose the right antivirus for your business - TechRadar", "description": "Not sure which security software will be best for your business? Here's our guide to picking the best business antivirus", "url": "https://www.techradar.com/how-to/choose-the-right-antivirus-for-your-business", "urlToImage": "https://cdn.mos.cms.futurecdn.net/mXgVmdeRW6yPgcdLuRKhjm-1200-80.jpg", "publishedAt": "2022-04-22T15:01:37Z", "content": "Businesses have never relied so much on computers and cloud services to get the job done, and that brings opportunities – but it means your firm now faces unprecedented security risks, too\r\nThe numbe… [+6718 chars]"}]}