{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This is what South Africa needs to do to get off the grey list - BusinessTech", "description": "The South African government has responded to being greylisted.", "url": "https://businesstech.co.za/news/government/668125/this-is-what-south-africa-needs-to-do-to-get-off-the-grey-list/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/02/Godongwana-01.jpg", "publishedAt": "2023-02-24T14:07:30Z", "content": "The South African government has “noted” the Financial Action Task Forces (FATFs) decision to list the country as a jurisdiction under increased monitoring – or more commonly referred to as FATFs gre… [+4804 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Saiful Ridzaimi", "title": "MSI Malaysia launches all-new laptops with NVIDIA GeForce RTX 40 series and up to 13th Gen Intel Core HX - TechNave", "description": "MSI Malaysia yesterday officially launched its all-new laptop lineup for the local market. Equipped with the latest NVIDIA GeForce RTX 40 series GPUs, consumers", "url": "https://technave.com/gadget/MSI-Malaysia-launches-all-new-laptops-with-NVIDIA-GeForce-RTX-40-series-and-up-to-13th-Gen-Intel-Core-HX-33561.html", "urlToImage": "https://technave.com/data/files/article/202302240858386444.jpg", "publishedAt": "2023-02-24T09:18:22Z", "content": "MSI Malaysia yesterday officially launched its all-new laptop lineup for the local market. Equipped with the latest NVIDIA GeForce RTX 40 series GPUs, consumers in our country can enjoy FREE USD100 o… [+1390 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Google Photos’ AI-powered ‘Magic Eraser’ is now a Google One subscription perk - TechCrunch", "description": "One of the Google Pixel’s best photo-editing features, “Magic Eraser,” is now making its way to other Android and iOS devices. But it won’t be free. Today, Google announced that the popular tool, which uses AI to remove unwanted content from images, will beco…", "url": "https://techcrunch.com/2023/02/23/google-photos-ai-powered-magic-eraser-is-now-a-google-one-subscription-perk/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/12/GettyImages-887454024.jpg?resize=1200,797", "publishedAt": "2023-02-23T19:38:28Z", "content": "One of the Google Pixel’s best photo-editing features, “Magic Eraser,” is now making its way to other Android and iOS devices. But it won’t be free. Today, Google announced that the popular tool, whi… [+2936 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Alfonso Maruccia", "title": "This parasitic fungus could inspire strong yet ultralight materials - TechSpot", "description": "In the award-winning video game and TV series The Last of Us, a parasitic fungus turned into an apocalyptic brain infection that wiped civilization from the planet....", "url": "https://www.techspot.com/news/97707-parasitic-fungus-could-inspire-strong-ultralight-materials.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/02/2023-02-23-image-16.jpg", "publishedAt": "2023-02-23T18:35:51Z", "content": "In context: Weirdly shaped like a horse's hoof, F. fomentarius is a species of fungal parasite that grows on the side of trees which it infects through broken bark. When the tree dies, the fungus con… [+2491 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Emma Lawson", "title": "E-skin developed to boost self-awareness in soft robots - Yahoo Singapore News", "description": "A team from the University of Edinburgh has described it as a technological breakthrough.", "url": "https://www.independent.co.uk/tech/university-of-edinburgh-b2288292.html", "urlToImage": "https://media.zenfs.com/en/the_independent_635/06899ffdd5e135c67398785488182f86", "publishedAt": "2023-02-23T16:00:00Z", "content": "The E-skin can help soft robots better understand their own movements (Yunjie Yang/PA)\r\nA team of scientists has developed electronic skin that could pave the way for flexible robotic devices to assi… [+2374 chars]"}, {"source": {"id": null, "name": "Cointelegraph"}, "author": "Cointelegraph", "title": "Policymakers and financial leaders to convene on generative AI, digital assets and ESG tech - Cointelegraph", "description": "The Swiss State Secretariat for International Finance (SIF) and Elevandi, a company set up by the Monetary Authority of Singapore (MAS), announced today the agenda for the second edition of the Point Zero Forum", "url": "https://cointelegraph.com/press-releases/policymakers-and-financial-leaders-to-convene-on-generative-ai-digital-assets-and-esg-tech", "urlToImage": "https://s3.cointelegraph.com/storage/uploads/view/e39f948963d46d831c1205cf6b509844.jpg", "publishedAt": "2023-02-23T14:42:33Z", "content": "The Swiss State Secretariat for International Finance (SIF) and Elevandi, a company set up by the Monetary Authority of Singapore (MAS), announced today the agenda for the second edition of the Point… [+4842 chars]"}]}