{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Deadline"}, "author": "Patrick Hipes", "title": "Carrie Underwood Sings A Cappella At Donald Trump Inauguration After Tech Glitch – Watch - Deadline", "description": "Carrie Underwood sung \"America the Beautiful\" during the inauguration of Donald Trump, performing a cappella after a tech glitch.", "url": "http://deadline.com/2025/01/carrie-underwood-sings-america-the-beautiful-trump-inauguration-1236261814/", "urlToImage": "https://deadline.com/wp-content/uploads/2025/01/Carrie-Underwood-Inauguration.jpg?w=1024", "publishedAt": "2025-01-20T20:23:00Z", "content": "Carrie Underwood sung “America the Beautiful” during the inauguration of Donald Trump on Monday, performing it a cappella after a tech glitch over the piped-in music couldn’t be resolved.\r\nThe eight-… [+1637 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Jack Dunn", "title": "‘The Brutalist’ Director Brady Corbet Says Adrien Brody and Felicity Jones’ ‘Performances Are Completely Their Own’ Amid AI Dialogue Backlash - Variety", "description": "Director Brady Corbet is defending the use of AI in 'The Brutalist' after facing heavy backlash for utilizing the controversial tech.", "url": "https://variety.com/2025/film/news/director-brady-corbet-defends-ai-use-the-brutalist-adrien-brody-felicity-jones-1236279504/", "urlToImage": "https://variety.com/wp-content/uploads/2025/01/brutalist.jpg?w=1000&h=563&crop=1", "publishedAt": "2025-01-20T19:36:00Z", "content": "Director Brady Corbet is defending the use of AI in “The Brutalist” after facing heavy backlash for utilizing the controversial tech to alter Adrien Brody and Felicity Jones’ Hungarian dialect and to… [+1774 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "100x Faster: Light-Powered Memory That’s Revolutionizing Computing - SciTechDaily", "description": "A new era in computing is emerging as researchers overcome the limitations of Moore's Law through photonics. This cutting-edge approach boosts processing speeds and slashes energy use, potentially revolutionizing AI and machine learning applications. Photonic…", "url": "https://scitechdaily.com/100x-faster-light-powered-memory-thats-revolutionizing-computing/", "urlToImage": "https://scitechdaily.com/images/Photonic-Memory-Array-Artist-Concept.jpg", "publishedAt": "2025-01-19T03:31:23Z", "content": "Artist’s concept illustration of a photonic memory array. Credit: Brian Long\r\nA new era in computing is emerging as researchers overcome the limitations of Moore’s Law through photonics.\r\nThis cuttin… [+4010 chars]"}]}