{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Chandrababu Naidu persuaded Bill Gates for Microsoft's Hyderabad office in just 40 minutes - Hindustan Times", "description": "During the AP AgTech Summit in 2017, Chandrababu Naidu recalled how he managed to get an appointment with Bill Gates in the late 1990s.", "url": "https://www.hindustantimes.com/business/when-chandrababu-naidu-persuaded-bill-gates-for-microsofts-hyderabad-office-in-a-40-minute-meeting-101718158631910.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/12/1600x900/DO127xZV4AEn6OR_1718159067721_1718159070116.jpeg", "publishedAt": "2024-06-13T03:19:00Z", "content": "TDP chief N Chandrababu Naidu is set to be sworn today as the chief minister of Andhra Pradesh for a fourth term. The swearing-in ceremony will be attended by Prime Minister Narendra Modi, Union Home… [+2093 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Joe Rossignol", "title": "Tim Cook Discusses Apple Intelligence and More in Videos With iJustine, MKBHD, and Others - MacRumors", "description": "Following the WWDC keynote on Monday, Apple CEO Tim Cook discussed Apple Intelligence and more with popular tech content creators Justine Ezarik...", "url": "https://www.macrumors.com/2024/06/12/tim-cook-apple-intelligence-interviews/", "urlToImage": "https://images.macrumors.com/t/0_RX2LavEjJuQ-0X2xyGDUxYsv4=/1600x/article-new/2024/06/Tim-Cook-WWDC-2024.jpg", "publishedAt": "2024-06-12T16:23:28Z", "content": "Following the WWDC keynote on Monday, Apple CEO Tim Cook discussed Apple Intelligence and more with popular tech content creators Justine Ezarik (iJustine), Marques Brownlee (MKBHD), and Safwan Ahmed… [+893 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Christine Hall", "title": "Here’s everything Apple announced at the WWDC 2024 keynote, including Apple Intelligence, Siri makeover - TechCrunch", "description": "The TechCrunch the team runs down all of the biggest news from the Apple WWDC 2024 keynote in an easy-to-skim digest.", "url": "https://techcrunch.com/2024/06/12/everything-apple-announced-wwdc-2024/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Tim-Cook-Apple-WWDC.png?resize=1200,678", "publishedAt": "2024-06-12T13:35:00Z", "content": "Its WWDC 2024 keynote time! Each year Apple kicks off its Worldwide Developers Conference with a few hours of just straight announcements, like the long-awaited Apple Intelligence and a makeover for … [+13146 chars]"}]}