{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb's Surprising Look at Fomalhaut's Asteroid Belt, TROPICS CubeSats Launched - SciTechDaily", "description": "A spacecraft changes parking spots at the space station … A surprising look at a star in another solar system … And small satellites that could be a big help tracking tropical storms … A few of the stories to tell you about – This Week at NASA! https://youtu.…", "url": "https://scitechdaily.com/this-week-nasa-webbs-surprising-look-at-fomalhauts-asteroid-belt-tropics-cubesats-launched/", "urlToImage": "https://scitechdaily.com/images/Two-Planetesimals-Colliding.jpg", "publishedAt": "2023-05-14T17:36:28Z", "content": "ByNASAMay 14, 2023\r\nThis artists illustration depicts a collision of two icy, dusty bodies orbiting the bright star Fomalhaut, located 25 light-years away. This may have caused an expanding cloud of … [+5393 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Google Quantum AI Braids Non-Abelian Anyons – A Breakthrough That Could Revolutionize Quantum Computing - SciTechDaily", "description": "Google Quantum AI has observed non-Abelian anyons for the first time, a breakthrough that could revolutionize quantum computing by making it more robust to noise and leading to topological quantum computation. Our intuition tells us that it should be impossib…", "url": "https://scitechdaily.com/?p=277928", "urlToImage": "https://scitechdaily.com/images/Non-Abelian-Braiding.jpg", "publishedAt": "2023-05-14T16:25:01Z", "content": "ByGoogle Quantum AIMay 14, 2023\r\nResearchers were able to observe the curious effects of braiding non-Abelian anyons for the first time. Credit: Google Quantum AI\r\nGoogle Quantum AI has observed non-… [+5697 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Revolutionary Stretchable OLED Display Bends and Expands – “An Entirely New Display Technology” - SciTechDaily", "description": "Researchers have developed a highly flexible and stretchable digital display material that emits a fluorescent pattern. The material, which can bend in half and stretch to more than twice its original length, has potential applications in wearable electronics…", "url": "https://scitechdaily.com/revolutionary-stretchable-oled-display-bends-and-expands-an-entirely-new-display-technology/", "urlToImage": "https://scitechdaily.com/images/Stretchable-OLED-Display.jpg", "publishedAt": "2023-05-14T15:15:46Z", "content": "ByUniversity of ChicagoMay 14, 2023\r\nA material developed by Asst. Prof. Sihong Wang and Prof. Juan de Pablo can stretch more than twice its original length without disrupting its ability to emit lig… [+7035 chars]"}, {"source": {"id": null, "name": "CTech"}, "author": "Omer Kabir", "title": "Google goes on the AI offensive with a new and improved Bard - CTech", "description": "Google has made its chatbot available in 180 countries with a slew of new features", "url": "https://www.calcalistech.com/ctechnews/article/skb0011srnn", "urlToImage": "https://images1.calcalist.co.il/picserver3/crop_images/2023/03/21/SkM2jDwl3/SkM2jDwl3_0_18_832_468_0_large.jpg", "publishedAt": "2023-05-14T11:42:00Z", "content": "14:42, 14.05.23 \r\nGoogle has launched a new and improved Bard, its AI chatbot, and made it available to anyone in over 180 countries, after conducting trials for several weeks during which it was acc… [+6925 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Manshi Singh", "title": "Asteroid speeding towards close encounter with Earth today, says NASA - HT Tech", "description": "Asteroid speeding towards close encounter with Earth today says NASA The asteroid is travelling at 72871 kmph NASA said. NASA has warned about the bussized Asteroid 2023 JR1. Asteroid 2023 JR1 is a member of the Apollo group of asteroids.  NASA discovered thi…", "url": "https://tech.hindustantimes.com/web-stories/asteroid-speeding-towards-close-encounter-with-earth-today-says-nasa-71684061301891.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/14/cropped/16-9/asteroid_1681212528521_1684061754139.jpg?impolicy=new-ht-20210112&width=1600/", "publishedAt": "2023-05-14T10:56:15Z", "content": "Photo Credit: NASA\r\n The asteroid is travelling at 72871 kmph, NASA said. \r\nPhoto Credit: Pixabay\r\n NASA has warned about the bus-sized Asteroid 2023 JR1. \r\nPhoto Credit: Pixabay\r\n Asteroid 2023 JR1 … [+867 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 14 May 2023: Iconic first free flight in space! - HT Tech", "description": "NASA Astronomy Picture of the Day for May 14 has remembered the iconic and first image of a free flight in space. Who is in this image? Read on.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-14-may-2023-iconic-first-free-flight-in-space-71684057689856.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/14/cropped/16-9/freeflyer_nasa_960_1684057775190_1684057784801.jpg?impolicy=new-ht-20210112&width=1600", "publishedAt": "2023-05-14T09:50:32Z", "content": "How does it feel to fly in space without any attachments to a spaceship? Surreal, right? The experience can be literally out of this world - flying freely in the vastness of the cosmos! Such untether… [+1896 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Sea Star Study provides an essential toolkit for organ development - Tech Explorist", "description": "Tube formation is important for understanding genetics and mechanics.", "url": "https://www.techexplorist.com/sea-star-study-provides-essential-toolkit-organ-development/60193/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/05/sea-star.jpg", "publishedAt": "2023-05-14T06:56:12Z", "content": "The coordinated organization of cells into a precise three-dimensional architecture is important for creating functional organs. Tubulogenesis, or the formation of hollow tubes, is a critical tempora… [+3982 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Weight Loss Medications Could Be Sold for Lower Prices: Semaglutide, Bupropion, Naltrexone, Tirzepatide - SciTechDaily", "description": "Change in cost may improve affordability and access to treatment. New research shows that several anti-obesity medications could be manufactured and profitability sold worldwide at far lower estimated lower prices compared to their high costs, according to a …", "url": "https://scitechdaily.com/weight-loss-medications-could-be-sold-for-lower-prices-semaglutide-bupropion-naltrexone-tirzepatide/", "urlToImage": "https://scitechdaily.com/images/Happy-Weight-Loss-Scale.jpg", "publishedAt": "2023-05-13T17:25:16Z", "content": "New research suggests that anti-obesity medications can be produced and sold at much lower prices worldwide than their current high costs. The study calls for a public health approach to obesity mana… [+7174 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Pangenome Breakthrough: A Crystal Clear Image of Human Genomic Diversity - SciTechDaily", "description": "In a major advance, scientists have assembled genomic sequences of 47 people from diverse backgrounds to create a pangenome, which offers a more accurate representation of human genetic diversity than the existing reference genome. This new pangenome will hel…", "url": "https://scitechdaily.com/?p=277594", "urlToImage": "https://scitechdaily.com/images/Human-Genetic-Diversity-Concept-Image.jpg", "publishedAt": "2023-05-13T10:20:19Z", "content": "ByRockefeller UniversityMay 13, 2023\r\nThe Human Pangenome Reference Consortium has made significant progress in creating a more inclusive human reference genome by assembling genomic sequences of 47 … [+17108 chars]"}]}