{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Best smartphones under 25000: Realme 10 Pro Plus, Oppo F21 Pro, Motorola Edge 30, more - HT Tech", "description": "Here are the 5 best smartphones you can buy now under Rs. 25000. From Realme 10 Pro Plus, Oppo F21 Pro to Motorola Edge 30, check the full list.", "url": "https://tech.hindustantimes.com/mobile/news/best-smartphones-under-25000-realme-10-pro-plus-oppo-f21-pro-motorola-edge-30-more-71673683401598.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/14/1600x900/smartphones_under_25000_1673684602808_1673684620515_1673684620515.jpg", "publishedAt": "2023-01-14T08:24:52Z", "content": "When it comes to smartphones, you don't need to spend a huge amount to enjoy flagship-like features and performance. All you have to do is choose the best smartphone that can fulfill your daily needs… [+1918 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Deng Li", "title": "Red Flag smart supercharger gets OpenHarmony compatibility - HC Newsroom", "description": "OpenSource HarmonyOS, OpenHarmony has now extended support for China’s Red Flag Smart Technology Smart Supercharger with compatibility certification of OpenHarmony 3.1. This Smart Supercharger is a high-power DC liquid-cooled supercharger positioned in the ne…", "url": "https://www.huaweicentral.com/red-flag-smart-supercharger-gets-openharmony-compatibility/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2023/01/red-flag-supercharger-oh1-1000x576.jpg", "publishedAt": "2023-01-14T03:36:11Z", "content": "The open-source HarmonyOS, OpenHarmony is expanding its partners across the industry, and Huawei is helping the OpenHarmony manager, OpenAtom to further establish its roots in the ground. As recently… [+2530 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Tanushree Shenwai, Tanushree Shenwai", "title": "This Artificial Intelligence (AI) Research Proposes A New Poisoning Attack That Could Trick AI-Based Coding Assistants Into Suggesting Dangerous Code - MarkTechPost", "description": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit 'AI pair programmer' called GitHub Copilot was unveiled in June 2021 by GitHub and OpenAI. Depending on the surrounding code and c…", "url": "https://www.marktechpost.com/2023/01/13/this-artificial-intelligence-ai-research-proposes-a-new-poisoning-attack-that-could-trick-ai-based-coding-assistants-into-suggesting-dangerous-code/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/01/Screen-Shot-2023-01-13-at-12.06.15-PM.png", "publishedAt": "2023-01-13T20:07:25Z", "content": "Automatic code suggestion is now a common software engineering tool thanks to recent developments in deep learning. A for-profit “AI pair programmer” called GitHub Copilot was unveiled in June 2021 b… [+4516 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Brian Heater", "title": "The mixed messaging of mixed reality - Yahoo Philippines News", "description": "In the years since, I've become far more disciplined in my meditation practice, and I can say that these sorts of VR demos are the closet tech has come to...", "url": "https://ph.news.yahoo.com/mixed-messaging-mixed-reality-190034415.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/vbMirmOGoo5gORcDb3SSCg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Nzk-/https://media.zenfs.com/en/techcrunch_350/44208a80b8b706b0946e29f0645732e7", "publishedAt": "2023-01-13T19:00:34Z", "content": "I vividly remember my first Vive experience. It was many CESes ago. I was managing a different site. Budgets were tight and I had the most on-the-ground experience, so I went solo. I had a different … [+7036 chars]"}, {"source": {"id": null, "name": "Technocio.com"}, "author": "technocio", "title": "CES 2023: Un futuro sostenible gracias a la conectividad - Technocio", "description": "CES 2023, futuro sostenible, conectividad, Samsung, SmartWork, Health & Wellness, Galaxy Watch, SmartThings, Pet Care, ReadyCare, Blockchain, Knox Matrix, Net Zero Home", "url": "https://technocio.com/ces-2023-un-futuro-sostenible-gracias-a-la-conectividad/", "urlToImage": "http://technocio.com/wp-content/uploads/2023/01/Samsung-CES-2023.jpg", "publishedAt": "2023-01-13T17:28:59Z", "content": "Samsung presentó sus innovaciones para este año en la feria más importante de la tecnología en el mundo. \r\nEl CES 2023 finalizó con éxito. Más de 115.000 asistentes visitaron la feria más importante … [+7511 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Gerard Ramos", "title": "The Huawei Mate 50 Pro: An excellent, exciting reflection of things to come | Gerard Ramos - BusinessMirror", "description": "THE punishing trade restrictions the US government slapped in 2017 on prominent China-based technology companies that included Huawei and ZTE, ostensibly due to possible national security threats, have not eased, and there appears to be no indication the blac…", "url": "https://businessmirror.com.ph/2023/01/14/the-huawei-mate-50-pro-an-excellent-exciting-reflection-of-things-to-come/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2023/01/digitallife01-011423.jpg", "publishedAt": "2023-01-13T16:00:00Z", "content": "THE punishing trade restrictions the US government slapped in 2017 on prominent China-based technology companies that included Huawei and ZTE, ostensibly due to possible national security threats, ha… [+9705 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "Hong Kong consolidates global financial hub status with innovation, green finance initiatives - Macau Business", "description": "China, MNA | Israeli entrepreneur Guy Sheena came all the way from the Middle Eastern country to the Hong Kong Special Administrative Region (HKSAR) of China to look for potential partners for his fintech startup, and the trip was proven fruitful.", "url": "https://www.macaubusiness.com/hong-kong-consolidates-global-financial-hub-status-with-innovation-green-finance-initiatives/", "urlToImage": null, "publishedAt": "2023-01-13T15:58:08Z", "content": "Israeli entrepreneur Guy Sheena came all the way from the Middle Eastern country to the Hong Kong Special Administrative Region (HKSAR) of China to look for potential partners for his fintech startup… [+2913 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA scientists study origin of life after simulating cosmic evolution - HT Tech", "description": "NASA scientists simulate the cosmic evolution in labs to study the origin of life from amino acids and amines.", "url": "https://tech.hindustantimes.com/tech/news/nasa-scientists-study-origin-of-life-after-simulating-cosmic-evolution-71673606304458.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/13/1600x900/AP07-12-2022-000029A-0_1657615352083_1657615352083_1673606430392_1673606430392.jpg", "publishedAt": "2023-01-13T10:42:11Z", "content": "NASA scientists have performed a new experiment that enables them to study the evolution of life. At the NASA Goddard Space Flight Center in Greenbelt, Maryland, scientists wanted to explore how amin… [+2895 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Artificial nerve cells - almost like biological - Nanowerk", "description": "Researchers have created an artificial organic neuron that closely mimics the characteristics of biological nerve cells. This artificial neuron can stimulate natural nerves, making it a promising technology for various medical treatments in the future.", "url": "https://www.nanowerk.com/news2/biotech/newsid=62152.php", "urlToImage": "https://www.nanowerk.com/news2/biotech/id62152_1.jpg", "publishedAt": "2023-01-13T09:45:04Z", "content": "Nanowerk Newsletter\r\nGet our Biotechnology News updates to your inbox!"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Peter John", "title": "WATCH | Suzuki unveils electric eVX concept SUV in India and shows off more new cars headed for SA - News24", "description": "Unveiled at India's Auto Expo, the futuristic Suzuki eVX hints at a beguiling combination of Suzuki's off-road DNA, styling cues and nascent battery technology.", "url": "https://www.news24.com/wheels/news/gear_and_tech/watch-suzuki-unveils-electric-evx-concept-suv-in-india-and-shows-off-more-new-cars-headed-for-sa-20230113-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/211/74309288133a4be6ba8c0d4102473842.jpg", "publishedAt": "2023-01-13T03:44:50Z", "content": "<ul><li>Suzuki has revealed several new cars at India's Auto Expo, including their first global electric vehicle, the eVX, and a five-door Jimny. </li><li>The eVX has a claimed range of 550 kilometre… [+1729 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 354 answer for January 13: Guesses won’t help! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 354 answer for January 13: Don’t just make random guesses. Solve the puzzle with a strategy using these Quordle hints, clues and solutions.", "url": "https://tech.hindustantimes.com/how-to/quordle-354-answer-for-january-13-guesses-won-t-help-check-quordle-hints-clues-solutions-71673576104177.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/01/13/1600x900/HT_Tech_34_1673576125319_1673576125496_1673576125496.jpg", "publishedAt": "2023-01-13T02:32:23Z", "content": "Quordle 354 answer for January 13: It is quite rare when you can use easy' and Quordle in the same sentence. The game is known for being 4 times as tough as Wordle' and that's what people expect from… [+1947 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Lori Dajose", "title": "New results reveal surprising behavior of minerals deep in the Earth - Phys.org", "description": "As you are reading this, more than 400 miles below you is a massive world of extreme temperatures and pressures that has been churning and evolving for longer than humans have been on the planet. Now, a detailed new model from Caltech researchers illustrates …", "url": "https://phys.org/news/2023-01-results-reveal-behavior-minerals-deep.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/new-results-reveal-sur.jpg", "publishedAt": "2023-01-12T14:33:36Z", "content": "As you are reading this, more than 400 miles below you is a massive world of extreme temperatures and pressures that has been churning and evolving for longer than humans have been on the planet. Now… [+4391 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Reveals Startling Connection Between Hearing Loss and Dementia in Older Adults - SciTechDaily", "description": "Findings highlight the potential benefit of hearing aids. A new study found that older adults with greater severity of hearing loss were more likely to have dementia, but the likelihood of dementia was lower among hearing aid users compared to non-users. Scie…", "url": "https://scitechdaily.com/new-research-reveals-startling-connection-between-hearing-loss-and-dementia-in-older-adults/", "urlToImage": "https://scitechdaily.com/images/Senior-Couple-Hearing-Dementia-Concept.jpg", "publishedAt": "2023-01-12T14:16:31Z", "content": "A recent study led by researchers at the Johns Hopkins Bloomberg School of Public Health found that older adults with severe hearing loss were more likely to have dementia, however, the likelihood of… [+4288 chars]"}]}