{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "From Samsung Galaxy Z Fold 5 to Galaxy Tab S9: Know the expected launches at Samsung Galaxy Unpacked 2023 - HT Tech", "description": "With the Samsung Galaxy Unpacked 2023 event inching closer, check out everything that could be announced at the event including Samsung Galaxy Z Fold 5, Galaxy Z Flip 5, Galaxy Watch 6, and more.", "url": "https://tech.hindustantimes.com/photos/from-samsung-galaxy-z-fold-5-to-galaxy-tab-s9-know-the-expected-launches-at-samsung-galaxy-unpacked-2023-71688632804566.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/mika-baumeister-vI8_06RmSC0-unsplash_1688632944642_1688633002566.jpg", "publishedAt": "2023-07-06T08:49:13Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Groundbreaking Study Shakes Up Established Views on Mountain Formation - SciTechDaily", "description": "New research led by Colorado State University indicates the answers to how and why mountains form are buried deeper than once thought. \"Mountain building is a fundamental process of how Earth behaves,” said Sean Gallen, lead author and CSU assistant professor…", "url": "https://scitechdaily.com/groundbreaking-study-shakes-up-established-views-on-mountain-formation/", "urlToImage": "https://scitechdaily.com/images/Green-Mysterious-Mountain.jpg", "publishedAt": "2023-07-06T08:44:02Z", "content": "A new study suggests that the formation of mountains, particularly in subduction zones like southern Italy, might be significantly influenced by the descension of a tectonic plate through Earths mant… [+4697 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "AWESOME! NASA will let you engrave your name on the historic Europa Clipper spacecraft for FREE - HT Tech", "description": "Grab an amazing opportunity to have your name engraved on a NASA spacecraft heading to Jupiter’s Europa moon as part of the Message in a Bottle project. Here’s how.", "url": "https://tech.hindustantimes.com/tech/news/awesome-nasa-will-let-you-engrave-your-name-on-the-historic-europa-clipper-spacecraft-for-free-71688626883804.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/space_exploratory_missions_1688627236743_1688627236978.jpeg", "publishedAt": "2023-07-06T07:09:42Z", "content": "NASA has several space exploratory missions to planets such as Mars and Jupiter in place, and now the space agency is offering a unique opportunity for the public to have their name etched on a NASA … [+2504 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid warning! Aircraft-sized space rock approaching Earth at fearsome speed TODAY - HT Tech", "description": "Asteroids have been threatening Earth with extremely close approaches recently, and now another one is set to pass the planet today. Know its speed, distance, size, and more.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-warning-aircraft-sized-space-rock-approaching-earth-at-fearsome-speed-today-71688618848435.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/06/1600x900/ygy_1637905928669_1688618998360.jpg", "publishedAt": "2023-07-06T04:50:30Z", "content": "Asteroids have the potential to cause armageddon on Earth, especially if they crash in a densely populated area. To counter this very threat to life, space agencies keep developing technology for ast… [+2314 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "Fairphone’s repairable smartphone goes on sale in US for the first time — in a ‘deGoogled’ Murena e/OS variant - TechCrunch", "description": "It will be interesting to see how much U.S. interest there is in an iPhone and (Google) Android alternative that packs sustainable and ethical smarts.", "url": "https://techcrunch.com/2023/07/05/fairphones-repairable-smartphone-goes-on-sale-in-us-for-the-first-time-in-a-degoogled-murena-e-os-variant/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/09/FP4-Speckled-Nine-Grass.jpg?resize=1200,800", "publishedAt": "2023-07-05T16:29:15Z", "content": "European sustainable smartphone brand Fairphone is dipping a toe in the U.S. market by making its flagship repairable handset available to buy there for the first time via another collaboration with … [+3362 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Researchers discover unique blood plasma protein patterns in patients with long COVID - Medical Xpress", "description": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID that could improve patient outcomes. This research, which used…", "url": "https://medicalxpress.com/news/2023-07-unique-blood-plasma-protein-patterns.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/fatigue-1.jpg", "publishedAt": "2023-07-05T14:07:50Z", "content": "Using advanced research techniques, including a form of artificial intelligence, a team of researchers has discovered unique patterns of blood plasma proteins in patients with suspected long COVID th… [+4047 chars]"}]}