{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "110-foot Asteroid 2023 LL speeding at 49095 kmph towards Earth, NASA data shows - HT Tech", "description": "Asteroid 2023 LL is set to make a dangerously close approach to Earth at a blistering speed of 49095 km per hour, NASA warned.", "url": "https://tech.hindustantimes.com/tech/news/nasa-alert-asteroid-2023-hj2-set-to-buzz-earth-from-dangerously-close-distance-today-71686377676464.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/10/1600x900/SPACE-ASTRONOMY-ASTEROID-0_1683132681194_1686377816098.jpg", "publishedAt": "2023-06-10T06:17:28Z", "content": "A majority of asteroids come from the asteroid belt located between Mars and Jupiter after they are dislodged from their original orbit. These asteroids exhibit an elliptical orbit and often have err… [+2559 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Bard reveals its top 5 smartphones of 2023; Number 3 will surprise you! - HT Tech", "description": "We asked Google Bard, the AI conversational chatbot, about the top 5 smartphones in 2023 so far. Its answer was quite surprising. Check the list.", "url": "https://tech.hindustantimes.com/mobile/news/google-bard-reveals-its-top-5-smartphones-of-2023-number-3-will-surprise-you-71686376027580.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/10/1600x900/Untitled_design_-_2023-02-01T194648195_1686376091136_1686376091288.png", "publishedAt": "2023-06-10T05:58:18Z", "content": "Smartphone enthusiasts can be quite opinionated and probably the biggest debate of all time is which smartphone is the best. You can find fans of each brand making convincing arguments to prove that … [+1375 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Way To Develop Drugs Without Side Effects – To Treat Obesity, Pain, Osteoporosis, and Neurological Disorders - SciTechDaily", "description": "Researchers discovered a novel method to activate G-protein coupled receptors from inside the cells, and it helps develop drugs without side effects. The team identified a molecule, PCO371, that interacts with the intracellular region of a specific GPCR, offe…", "url": "https://scitechdaily.com/new-way-to-develop-drugs-without-side-effects-to-treat-obesity-pain-osteoporosis-and-neurological-disorders/", "urlToImage": "https://scitechdaily.com/images/GPCR-Trageted-Response.jpg", "publishedAt": "2023-06-10T02:26:36Z", "content": "An artists impression of the GPCR activation from inside the cell. Credit: Kobayashi and Kawakami et al., 2023\r\nResearchers discovered a novel method to activate G-protein coupled receptors from insi… [+4508 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for June 10: Complete your outfit collection - HT Tech", "description": "Garena Free Fire MAX Redeem Codes for June 10: You can win bundles, diamond vouchers, skins, weapon crates, pets and new characters. Don’t forget to claim today’s rewards.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-june-10-complete-your-outfit-collection-71686363358389.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/10/1600x900/048_1654217194104_1686363402777.jpg", "publishedAt": "2023-06-10T02:23:10Z", "content": "Garena Free Fire MAX Redeem Codes for June 10: Do you only focus on your HP during the game or do you also focus on the EP? Ethical Power (EP) is a crucial tool that can keep you from dying during co… [+2362 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Tom Krisher", "title": "With GM and Ford embracing Tesla's EV charging technology, here's what it means for consumers - The Associated Press", "description": "DETROIT (AP) — Starting next year, owners of electric vehicles made by General Motors and Ford will be able to charge their EVs at many of Tesla's charging stations, the largest such network in the country.", "url": "https://apnews.com/article/tesla-connector-gm-ford-electric-vehicle-charging-a180cc55bbe3d7d7738a2690ca22ab0d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/cb6818f381d647188a6ddb43620b3595/3000.webp", "publishedAt": "2023-06-10T02:05:57Z", "content": "DETROIT (AP) Starting next year, owners of electric vehicles made by General Motors and Ford will be able to charge their EVs at many of Teslas charging stations, the largest such network in the coun… [+4301 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Research takes first steps towards realizing mechanical qubits - Phys.org", "description": "Quantum information (QI) processing may be the next game changer in the evolution of technology, by providing unprecedented computational capabilities, security and detection sensitivities. Qubits, the basic hardware element for quantum information, are the b…", "url": "https://phys.org/news/2023-06-mechanical-qubits.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/first-steps-towards-re.jpg", "publishedAt": "2023-06-09T16:40:49Z", "content": "Quantum information (QI) processing may be the next game changer in the evolution of technology, by providing unprecedented computational capabilities, security and detection sensitivities. Qubits, t… [+7571 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 9 June 2023: Webb Telescope snaps Pandora Cluster - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of Abell 2744, also known as the Pandora’s Cluster of galaxies which is located about 4 billion light-years away towards the constellation of Sculptor.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-9-june-2023-webb-telescope-snaps-pandora-cluster-71686309004223.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/09/1600x900/Untitled_design_1686309185416_1686309191921.jpg", "publishedAt": "2023-06-09T11:18:18Z", "content": "Most galaxies exist in groups or clusters with dozens or hundreds of members, and these cluster galaxies are all in constant motion, pulled and twisted by their neighbour's gravity. Galaxies exist in… [+2514 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "First Sketch Map of the Subglacial Geology of Thwaites Glacier Revealed - AZoCleantech", "description": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affecting it.", "url": "https://www.azocleantech.com/news.aspx?newsID=33532", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_33532_16863038512135959.jpg", "publishedAt": "2023-06-09T09:44:00Z", "content": "The ground beneath Antarctica’s most fragile glacier has been mapped for the very first time by a group headed by a Swansea expert allowing researchers to better understand how climate change is affe… [+3961 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Furqan Shahid", "title": "YouTuber Shows Just How Good Apple’s Customer Service Is Compared To Samsung As Apple Took Just 5 Days To Repair And Return The Device Whereas Samsung Took Almost A Month - Wccftech", "description": "Have you ever wondered how just how good Samsung or Apple's customer service is when it comes to repairing phones? Here's your chance to understand things.", "url": "https://wccftech.com/youtuber-shows-just-how-good-apples-customer-service-is-compared-to-samsung-as-apple-took-just-5-days-to-repair-and-return-the-device-whereas-samsung-took-almost-a-month/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2023/06/anton-maksimov-5642-su-R2ljPFJju1s-unsplash.jpg", "publishedAt": "2023-06-08T16:02:00Z", "content": "Experiencing damage to your phone is never really a good thing. Especially if that is the only device you own because, in such a case, you would have to send the device away for repairs. When it come… [+2433 chars]"}]}