{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Cracking the code that relates brain and behavior in a simple animal - Medical Xpress", "description": "To understand the full relationship between brain activity and behavior, scientists have needed a way to map this relationship for all of the neurons across a whole brain—a so far insurmountable challenge. But after inventing new technologies and methods for …", "url": "https://medicalxpress.com/news/2023-08-code-brain-behavior-simple-animal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2016/56e9b84c79118.jpg", "publishedAt": "2023-08-21T15:33:21Z", "content": "To understand the full relationship between brain activity and behavior, scientists have needed a way to map this relationship for all of the neurons across a whole braina so far insurmountable chall… [+8025 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Paytm eyes India-scale AI system; fintech investing to build AI-based software stack | Mint - Mint", "description": "One97 Communications Limited, which owns the brand Paytm, India’s leading payments and financial services company and the pioneer of QR and mobile payments, filed its annual report for 2022-23 with the exchanges", "url": "https://www.livemint.com/companies/news/paytm-eyes-india-scale-ai-system-ceo-sharma-says-company-investing-to-build-ai-based-software-stack-11692629182577.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/08/21/600x338/pay_1692629810841_1692629811188.jpg", "publishedAt": "2023-08-21T15:12:51Z", "content": "One97 Communications Limited, which owns the brand Paytm, is investing in artificial intelligence (AI) with an eye on building artificial general intelligence software stack. Indias leading payments … [+2324 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Visualizing the mysterious dance: Quantum entanglement of photons captured in real-time - Phys.org", "description": "Researchers at the University of Ottawa, in collaboration with Danilo Zia and Fabio Sciarrino from the Sapienza University of Rome, recently demonstrated a novel technique that allows the visualization of the wave function of two entangled photons, the elemen…", "url": "https://phys.org/news/2023-08-visualizing-mysterious-quantum-entanglement-photons.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/visualizing-the-myster.jpg", "publishedAt": "2023-08-21T15:06:53Z", "content": "Researchers at the University of Ottawa, in collaboration with Danilo Zia and Fabio Sciarrino from the Sapienza University of Rome, recently demonstrated a novel technique that allows the visualizati… [+5190 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "190-foot Asteroid 2023 PM to make close approach to Earth, says NASA - HT Tech", "description": "According to NASA, an asteroid called 2023 PM is set to make a close approach to Earth tomorrow. Check the asteroid’s speed, size, distance, and more.", "url": "https://tech.hindustantimes.com/photos/190foot-asteroid-2023-pm-to-make-close-approach-to-earth-says-nasa-71692605823563.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/21/1600x900/g357f4_1692605903382_1692605903600.png", "publishedAt": "2023-08-21T08:21:57Z", "content": "Top SectionsExplore Tech Copyright © HT Media Limited All rights reserved."}, {"source": {"id": null, "name": "Zee Business"}, "author": "IANS", "title": "Madhav Sheth brings Honor brand to India with 100% local licensing, Rs 1,000 crore investment - Zee Business", "description": "As the government pushes consumer electronics companies towards local manufacturing, former realme India chief Madhav Sheth on Monday announced a new venture called HonorTech, which is a 100 per cent Indian joint venture (JV) collaboration, and will infuse Rs…", "url": "https://www.zeebiz.com/companies/news-madhav-sheth-brings-honor-brand-to-india-with-100-local-licensing-rs-1000-crore-investment-249753", "urlToImage": "https://cdn.zeebiz.com/sites/default/files/2023/08/21/257003-madhav-sheth.jpg", "publishedAt": "2023-08-21T05:49:16Z", "content": "As the government pushes consumer electronics companies towards local manufacturing, former realme India chief Madhav Sheth on Monday announced a new venture called HonorTech, which is a 100 per cent… [+2759 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 Pro Max set to be dropped in favour of iPhone 15 Ultra; may get Galaxy S23 Ultra feature - HT Tech", "description": "Apple could bring the ‘Ultra’ moniker to its top-end iPhone 15 model, and it could get one of the most sought-after camera features of the Galaxy S23, according to a new leak.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-pro-max-set-to-be-dropped-in-favour-of-iphone-15-ultra-may-get-galaxy-s23-ultra-feature-71692593771458.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/21/1600x900/quinn-battick-SKVblbjg_VU-unsplash_1692594052671_1692594061332.jpg", "publishedAt": "2023-08-21T05:03:15Z", "content": "Over the past few months, we've heard just about every rumour regarding the upcoming iPhone 15 series. From an action button, titanium frame, and solid-state buttons to a periscope camera and A17 Bio… [+1975 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "In a special moment, NASA rover on Mars snaps Ingenuity Mars Helicopter in flight - HT Tech", "description": "NASA has captured astounding footage of its Mars helicopter, defying thin Martian air, as it completed its 54th flight successfully.", "url": "https://tech.hindustantimes.com/tech/news/in-a-special-moment-nasa-rover-on-mars-snaps-ingenuity-mars-helicopter-in-flight-71692586094919.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/21/1600x900/NASA_mars_helicopter_1692586293639_1692586294217.jpg", "publishedAt": "2023-08-21T02:55:34Z", "content": "In a special moment, NASA rover on Mars has captured remarkable video footage of its helicopter flying and landing. The Martian atmosphere is very thin, just around one percent of Earth's, which make… [+1791 chars]"}]}