{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid to pass Earth by just 721,000 km today, reveals NASA; Know how big it is - HT Tech", "description": "NASA has revealed details about an asteroid that is expected to pass Earth by a close margin today, April 1. From its size to the speed at which it is approaching the planet, know all about it.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-to-pass-earth-by-just-721-000-km-today-reveals-nasa-know-how-big-it-is-71711944460216.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/02/1600x900/asteroid_1683002420925_1683002421133.jpg", "publishedAt": "2024-04-01T05:20:53Z", "content": "The first day of April is set to get a celestial visitor in the form of an asteroid. With the help of its advanced ground and space-based telescopes, NASA has shed light on an asteroid that has been … [+2008 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "Tech picks: Cipla, ICICI Bank among 8 stocks to buy in first week of FY25 for robust returns - Money Making Ideas - The Economic Times", "description": "Indian markets ended FY24 on a bullish note, although it retreated significantly from its peak levels. Going forward, investors will keep an eye on RBI policy outcome scheduled later this week and auto sales numbers.Technically, analysts said Nifty witnessed …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/tech-picks-cipla-icici-bank-among-8-stocks-to-buy-in-first-week-of-fy25-for-robust-returns/money-making-ideas/slideshow/108929513.cms", "urlToImage": "https://img.etimg.com/thumb/msid-108929513,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2024-04-01T03:09:22Z", "content": "Indian markets ended FY24 on a bullish note, although it retreated significantly from its peak levels. Going forward, investors will keep an eye on RBI policy outcome scheduled later this week and au… [+277 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 phones launching in April 2024: OnePlus Nord CE4, Motorola Edge 50 Pro, Realme 12X, and more - HT Tech", "description": "Get ready for April 2024 as top smartphone brands like OnePlus, Motorola, Realme, and Samsung gear up for exciting new releases, promising innovation and value for consumers.", "url": "https://tech.hindustantimes.com/mobile/news/top-5-phones-launching-in-april-2024-oneplus-nord-ce4-motorola-edge-50-pro-realme-12x-and-more-71711868291980.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/31/1600x900/Smartphones_1711868763197_1711868763502.jpg", "publishedAt": "2024-04-01T01:57:28Z", "content": "April 2024 is shaping up to be another exciting month for smartphone enthusiasts, with major brands like OnePlus, Motorola, Realme, and others gearing up for new releases. While some brands have unve… [+3020 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Cosmic Lighthouses” – Webb Unlocks the Secrets of the Universe's First Light - SciTechDaily", "description": "Groundbreaking JWST observations reveal the pivotal role of low-mass galaxies in the early universe's reionization, challenging existing cosmic evolution theories. Scientists working with data from NASA's James Webb Space Telescope (JWST) have obtained the fi…", "url": "https://scitechdaily.com/cosmic-lighthouses-webb-unlocks-the-secrets-of-the-universes-first-light/", "urlToImage": "https://scitechdaily.com/images/Astrophysics-Cosmic-Wonder-Concept-Art.jpg", "publishedAt": "2024-04-01T00:44:57Z", "content": "Utilizing data from NASA’s James Webb Space Telescope, scientists have unveiled the earliest starlight spectra, revealing low-mass galaxies’ central role in the universe’s dawn. Credit: SciTechDaily.… [+6861 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "10 images of Earth captured from the International Space Station that will amaze you - HT Tech", "description": "10 images of Earth captured from the International Space Station that will amaze you Check out these beautiful images of Earth captured from the International Space Station. The first image was captured from the International Space Stations window to the worl…", "url": "https://tech.hindustantimes.com/web-stories/10-images-of-earth-captured-from-the-international-space-station-that-will-amaze-you-71711950260860.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/04/01/1600x900/53572553927_95cc236501_o_1711950993962_1711950999735.jpg/", "publishedAt": "2024-04-01T00:27:16Z", "content": "Photo Credit: Pixabay\r\n Check out these beautiful images of Earth captured from the International Space Station. \r\nPhoto Credit: NASA\r\n The first image was captured from the International Space Stati… [+1265 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Arjun Kharpal", "title": "Samsung says it needs to 'redefine' its voice assistant Bixby with generative AI upgrade - CNBC", "description": "Samsung could add generative artificial intelligence technology to its voice assistant Bixby, a top executive at the company told CNBC.", "url": "https://www.cnbc.com/2024/04/01/samsung-says-it-could-upgrade-bixby-with-generative-ai-.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107364873-1706251336811-gettyimages-1933268460-SKOREA_SAMSUNG_GALAXY_S24.jpeg?v=1711631330&w=1920&h=1080", "publishedAt": "2024-03-31T23:13:41Z", "content": "Samsung could add generative artificial intelligence technology to its voice assistant Bixby, a top executive at the company told CNBC, as the South Korean giant looks to enhance the appeal of its de… [+2404 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "James Capell", "title": "Huge backdoor discovered that could compromise SSH logins on Linux - TechRadar", "description": "Updates required for Debian sid, Fedora 40, Fedora Rawhide, openSUSE Tumbleweed, and openSUSE MicroOS", "url": "https://www.techradar.com/pro/website-hosting/huge-backdoor-discovered-that-could-compromise-ssh-logins-on-linux", "urlToImage": "https://cdn.mos.cms.futurecdn.net/JeZfhWRSa7Uhq2f6QRNkgF-1200-80.png", "publishedAt": "2024-03-31T20:50:00Z", "content": "On Friday March 29, Microsoft employee Andres Freund shared that he had found odd symptoms in the xz package on Debian installations. Freund noticed that ssh login was requiring a lot of CPU and deci… [+1802 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Pushing the Limit of the Periodic Table – “Superheavy” Elements Challenge Theory - SciTechDaily", "description": "Scientists from Massey University in New Zealand, the University of Mainz in Germany, Sorbonne University in France, and the Facility for Rare Isotope Beams (FRIB) discuss the limit of the periodic table and revising the concept of the “island of stability” w…", "url": "https://scitechdaily.com/pushing-the-limit-of-the-periodic-table-superheavy-elements-challenge-theory/", "urlToImage": "https://scitechdaily.com/images/Periodic-Table-Graphic.jpg", "publishedAt": "2024-03-31T12:29:52Z", "content": "The progress of atomic structure theory focuses on superheavy elements and their predicted electronic ground state configurations, which are important for an elements placement in the periodic table.… [+6020 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Anadolu Agency", "title": "Health experts advocate digital health tech for cancer care revolution | Daily Sabah - Daily Sabah", "description": "Healthcare professionals urged for the availability of digital health technologies in the fight against cancer, aiming to enhance the likelihood of...", "url": "https://www.dailysabah.com/life/health/health-experts-advocate-digital-health-tech-for-cancer-care-revolution", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2024/03/31/thumbs/800x531/321781.jpg", "publishedAt": "2024-03-31T08:46:06Z", "content": "Healthcare professionals urged for the availability of digital health technologies in the fight against cancer, aiming to enhance the likelihood of diagnosing, treating and potentially curing the dis… [+2283 chars]"}]}