{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Twisting Physics: MIT's Quasicrystal Superconductivity Breakthrough - SciTechDaily", "description": "A new flexible platform could produce enigmatic materials and lead to new studies of exotic phenomena. In research that could jump-start interest into an enigmatic class of materials known as quasicrystals, MIT scientists and colleagues have discovered a rela…", "url": "https://scitechdaily.com/twisting-physics-mits-quasicrystal-superconductivity-breakthrough/", "urlToImage": "https://scitechdaily.com/images/Quasicrystal-Superconductivity-Breakthrough-Art-Concept.jpg", "publishedAt": "2023-10-18T08:27:21Z", "content": "Predicting exotic new magnetic phenomena, complete with a recipe for realizing them. (The scientists involved in that work, reported in 2023, included MIT professor of physics Liang Fu and Nisarga Pa… [+4360 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Webinar: implementation of HIV testing services by lay providers – the challenge of human resources and quality assurance - World Health Organization", "description": "Special webinar to present the operational and technical challenges of implementing HIV testing services (HTS) by lay providers, with a specific focus on human resources and quality assurance in sub-Saharan Africa.", "url": "https://www.who.int/news-room/events/detail/2023/10/18/default-calendar/webinar-implementation-of-hiv-testing-services-by-lay-providers-the-challenge-of-hr-and-qa", "urlToImage": "https://www.who.int/images/default-source/departments/hiv/hiv-testing-artemgetman-undpukraine.tmb-1200v.jpg?Culture=en&sfvrsn=744db2ca_2", "publishedAt": "2023-10-18T06:37:00Z", "content": "Special webinar to present the operational and technical challenges of implementing HIV testing services (HTS) by lay providers, with a specific focus on human resources and quality assurance in sub-… [+3833 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Magnetic filament eruption on the Sun may spark solar storm tomorrow, says NASA - HT Tech", "description": "A magnetic filament has erupted on an active sunspot, shooting out a CME. While not entirely Earth-directed, NASA models have shown that it is likely to spark a solar storm and deliver a glancing blow to the Earth.", "url": "https://tech.hindustantimes.com/tech/news/magnetic-filament-eruption-on-the-sun-may-spark-solar-storm-tomorrow-says-nasa-71697610104271.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/Solar_storm_1697177201358_1697610177566.jpg", "publishedAt": "2023-10-18T06:27:10Z", "content": "On Monday, October 16, a powerful magnetic filament erupted on the Sun. In particular, the explosion of plasma took place on the active sunspot AR3467, which was earlier reported to have displayed si… [+2205 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo group asteroid to come closer than the Moon; Know details of approach - HT Tech", "description": "An Apollo group Near-Earth Asteroid could pass Earth on October 20, NASA has revealed. It will reportedly come closer than the Moon during its approach.", "url": "https://tech.hindustantimes.com/tech/news/apollo-group-asteroid-to-come-closer-than-the-moon-know-details-of-approach-71697608683281.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/18/1600x900/asteroid_1681966013956_1697608794485.jpg", "publishedAt": "2023-10-18T06:00:30Z", "content": "NASA has recently issued details about an asteroid designated as Asteroid 2023 TK15 that is expected to make its closest approach to Earth on October 20. This asteroid has been discovered and tracked… [+2175 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Kat Bailey", "title": "Diablo 4 Season 2 Delayed at Last Second as Blizzard Scrambles to Address Technical Issues - IGN", "description": "Blizzard delayed the release of Diablo IV Season 2 as it worked to address technical issues. Now that Season of Blood is available, fans are complaining about broken progression, battle pass issues, and other problems.", "url": "https://www.ign.com/articles/diablo-4-season-2-delayed-blizzard", "urlToImage": "https://assets-prd.ignimgs.com/2023/10/06/diablo-4-season-2-1696605044398.jpg?width=1280", "publishedAt": "2023-10-17T18:04:10Z", "content": "Diablo IV fans had to wait longer than expect to dig into Season of Blood, which launched earlier today. Blizzard said that technical issues forced it to delay the new vampire-driven season's release… [+1754 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Ray-Ban Meta sunglasses have ‘influencer’ written all over them - TechCrunch", "description": "Somewhere between the Ray-Ban Meta and Meta Quest 3 sits an ideal mixed-reality headset. The Meta Quest Ray-Ban is a fantasy at the moment.", "url": "https://techcrunch.com/2023/10/17/ray-ban-meta-review/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/10/IMG_9641.jpg?resize=1200,900", "publishedAt": "2023-10-17T07:12:51Z", "content": "Somewhere between the Ray-Ban Meta and Meta Quest 3 sits an ideal mixed-reality headset. Its slim, light, offers hand tracking and passthrough and livestreams video when the moment calls for it. Its … [+9925 chars]"}]}