{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "A popular technique to make AI more efficient has drawbacks - TechCrunch", "description": "One of the most widely used techniques to make AI models more efficient, quantization, has limits — and the industry could be fast approaching them. In", "url": "https://techcrunch.com/2024/11/17/a-popular-technique-to-make-ai-more-efficient-has-drawbacks/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/11/GettyImages-1495979689.jpg?resize=1200,750", "publishedAt": "2024-11-17T15:00:00Z", "content": "One of the most widely used techniques to make AI models more efficient, quantization, has limits and the industry could be fast approaching them. \r\nIn the context of AI, quantization refers to lower… [+5979 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MICHAEL LIEDTKE", "title": "Will the antitrust showdown launched under Biden turn into 'Let's Make A Deal' under Trump? - The Associated Press", "description": "The U.S. antitrust watchdogs that pounced on Big Tech and deterred dealmaking throughout corporate America during President Joe Biden’s administration may be tamer and kept on a shorter leash by President-elect Donald Trump after he returns to the White House…", "url": "https://apnews.com/article/antitrust-big-tech-deals-monopoly-biden-trump-d508d61e9deeeefcf89765f17a69f493", "urlToImage": "https://dims.apnews.com/dims4/default/dc0fb3d/2147483647/strip/true/crop/3759x2114+0+196/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa5%2F36%2Fc35cc2e6b5ffe2f49b1ded3420b8%2F3371c329820c4bcf8b6b420022fbad28", "publishedAt": "2024-11-17T14:07:00Z", "content": "SAN FRANCISCO (AP) The U.S. antitrust watchdogs that pounced on Big Tech and deterred corporate deal making throughout President Joe Bidens administration may be kept on a shorter leash by Donald Tru… [+7996 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Omar Sohail", "title": "Samsung To Release Its Own Version Of AR Glasses In Q3 2025, Research Firm Suggests New Device Will Sport A Qualcomm SoC And Will Only Weigh 50 Grams - Wccftech", "description": "A tipster has revealed that a research firm believes that a pair of Samsung AR glasses will launch in Q3 2025 while sharing potential specifications", "url": "https://wccftech.com/samsung-ar-glasses-specifications-weight-and-release-date-estimated-by-research-firm/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/11/Samsung-AR-glasses.jpg", "publishedAt": "2024-11-16T12:46:00Z", "content": "A Chinese research firm estimates that Samsung will introduce its first AR glasses in the third quarter of 2025, while also providing some specifications of the upcoming device. Apparently, it will b… [+2220 chars]"}]}