{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Bluetooth audio for gaming, Yay or Nay? - NL Tech", "description": "Seriously, audio jacks are irreplaceable when it comes to fast-paced games. It is especially important for gaming phones.The app we used to test the audio de...", "url": "https://www.youtube.com/watch?v=5xErSxZP8Ro", "urlToImage": "https://i.ytimg.com/vi/5xErSxZP8Ro/maxresdefault.jpg", "publishedAt": "2022-07-10T12:30:04Z", "content": null}, {"source": {"id": null, "name": "CNET"}, "author": "Ian Sherr", "title": "Apple's Lockdown Mode: Why There's a New Level of Security for Your iPhone - CNET", "description": "The tech giant has always talked the talk about security. Now it's walking the walk.", "url": "https://www.cnet.com/tech/mobile/apples-lockdown-mode-why-theres-new-level-of-security-for-your-iphone/", "urlToImage": "https://www.cnet.com/a/img/resize/384ed9d02e3c44da644144751e668e67060ac38f/2022/07/08/e0662743-e10e-48ae-a425-7faf1a354e2a/lockdown-apple-security-6136.jpg?auto=webp&fit=crop&height=630&width=1200", "publishedAt": "2022-07-10T12:00:11Z", "content": "This story is part of Focal Point iPhone 2022, CNET's collection of news, tips and advice around Apple's most popular product. \r\nApple will be offering a new \"Lockdown Mode\" for its iPhones, iPads an… [+10334 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apple to kill off iPhone 13 Pro and iPhone 13 Pro Max after iPhone 14 launch? - HT Tech", "description": "iPhone 14 launch may lead to the discontinuation of some iPhones from the current iPhone lineup! At risk are iPhone 13 Pro and iPhone 13 Pro Max, the premium phones in the iPhone 13 series.", "url": "https://tech.hindustantimes.com/mobile/news/apple-to-kill-off-iphone-13-pro-and-iphone-13-pro-max-after-iphone-14-launch-71657449990526.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/10/1600x900/iPhone_13_Pro_Max_(3)_1632411430598_1657450240705.jpg", "publishedAt": "2022-07-10T10:51:52Z", "content": "The best iPhone that you can get right now is none other than the iPhone 13 Pro and iPhone 13 Pro Max, the flagship phones Apple launched last year. But within a few months, you will have a choice of… [+2202 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Chartered accountants under the lens as India ups Chinese scrutiny - Economic Times", "description": "The Ministry of Corporate Affairs has started the process of inspecting books of accounts of more than 500 Chinese companies, a person with knowledge of the matter told Bloomberg recently. Apart from ZTE and Vivo, this includes Xiaomi, Oppo, Huawei Technologi…", "url": "https://economictimes.indiatimes.com/news/company/corporate-trends/chartered-accountants-under-the-lens-as-india-ups-chinese-scrutiny/articleshow/92783296.cms", "urlToImage": "https://img.etimg.com/thumb/msid-92783281,width-1070,height-580,imgsize-38982,overlay-economictimes/photo.jpg", "publishedAt": "2022-07-10T09:53:00Z", "content": "India has tightened scrutiny of China-based firms since 2020, and one of the areas that has brought into focus is the role of CAs or chartered accountants in setting-up shell companies to launder mon… [+2827 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI bans over 45000 accounts in India! Check full list here - HT Tech", "description": "Battlegrounds Mobile India (BGMI) has banned 47,624 accounts in India within a week! Know what are the reasons. Check the full list too.", "url": "https://tech.hindustantimes.com/gaming/news/bgmi-bans-over-45000-accounts-in-india-check-full-list-here-71657443132650.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/10/1600x900/BGMI_1657443423132_1657443439748.PNG", "publishedAt": "2022-07-10T08:57:46Z", "content": "Battlegrounds Mobile India (BGMI) has taken the most extreme step of banning a huge number of accounts in India. BGMI developer Krafton took this strict action against the gamers who were found to be… [+2284 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Sohini Das", "title": "Bharat Biotechs Zika vaccine set to go to Phase 2 clinical trials soon - Business Standard", "description": "Doctors point out to lack of testing tools even as they attend to suspected Zika cases", "url": "https://www.business-standard.com/article/companies/bharat-biotech-s-zika-vaccine-set-to-go-to-phase-2-clinical-trials-soon-122071000223_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2017-06/03/full/1496504981-1795.jpg", "publishedAt": "2022-07-10T07:56:00Z", "content": "Business Standard has always strived hard to provide up-to-date information and commentary on developments that are of interest to you and have wider political and economic implications for the count… [+1029 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Saurabh Sinha", "title": "Mass leave: Now, IndiGo faces trouble from technicians at Hyderabad & Delhi - Times of India", "description": "India Business News: “Some technicians did not report for night shift at Hyderabad on July 8. The airline is monitoring the situation at Hyderabad and Delhi closely. It sa", "url": "https://timesofindia.indiatimes.com/business/india-business/mass-leave-now-indigo-faces-trouble-from-technicians-at-hyderabad-delhi/articleshow/92781178.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92781252,width-1070,height-580,imgsize-68178,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-07-10T07:22:00Z", "content": "Cabin crew 'shortage' sent IndiGo punctuality plunging Saturday; DGCA seeks report from airlineIn the past few months, crew discontent has been brewing amid IndiGo over continued pandemic time pay cu… [+143 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This country has opened up its golden visa programme again – and it’s popular among South Africans - BusinessTech", "description": "The Portugal Golden Visa programme is once again accepting new applications, following a five-month freeze, notes Sable International. The programme is popular among South Africans looking for an exit, with 416 visas issued to local investors by the end of 20…", "url": "https://businesstech.co.za/news/business/603820/this-country-has-opened-up-its-golden-visa-programme-again-and-its-popular-among-south-africans/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/07/Portugal1-e1657115057135.jpg", "publishedAt": "2022-07-10T06:31:40Z", "content": "The Portugal Golden Visa programme is once again accepting new applications, following a five-month freeze, notes Sable International. The programme is popular among South Africans looking for an exi… [+4979 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "I Really Wanted the Technics EAH-AZ40 Earbuds to Live Up to The Hype - Gizmodo Australia", "description": "Technics EAH-AZ40 earbuds are billed as delivering sound with amazing range. It's a bold claim, one that isn't quite accurate.", "url": "https://www.gizmodo.com.au/2022/07/technics-eah-az40-earbuds-review/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/07/06/technics-copy.png?quality=80&resize=1280,720", "publishedAt": "2022-07-10T02:00:00Z", "content": "At Gizmodo, we independently select and write about stuff we love and think you'll like too. We have affiliate and advertising partnerships, which means we may collect a share of sales or other compe… [+7973 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Healthy Plant-Based Diet Can Reduce Cancer Risk for Middle Aged Women - SciTechDaily", "description": "Research shows that diet quality is important in the prevention of breast cancer There is evidence that the foods we eat can affect how likely we are to develop cancer, but it's not always clear which foods or dietary habits are most effective in lowering can…", "url": "https://scitechdaily.com/a-healthy-plant-based-diet-can-reduce-cancer-risk-for-middle-aged-women/", "urlToImage": "https://scitechdaily.com/images/Woman-Cooking-Vegetables.jpg", "publishedAt": "2022-07-09T23:22:51Z", "content": "The study found that a healthy plant-based diet could reduce breast cancer risk by 14%.\r\nResearch shows that diet quality is important in the prevention of breast cancer\r\nThere is evidence that the f… [+3240 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb Space Telescopes First Full Color Images, Important Mission to the Moon - SciTechDaily", "description": "Ready to showcase the Webb space telescope’s first full-color images … Back in touch with a spacecraft on an important mission to the Moon …. And our Artemis I Moon rocket and spacecraft move a step closer to launch … a few of the stories to tell you about – …", "url": "https://scitechdaily.com/this-week-nasa-webb-space-telescopes-first-full-color-images-important-mission-to-the-moon/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Webb-First-Full-Color-Images.gif", "publishedAt": "2022-07-09T14:37:33Z", "content": "ByNASAJuly 9, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisory… [+2452 chars]"}, {"source": {"id": null, "name": "Technologytimes.pk"}, "author": "Ghulam din", "title": "Africa: There's No Cure for Sickle Cell Disease, but Spotting It Early Can Improve Treatment - Technology Times Pakistan", "description": "Sickle cell disease is a genetic disorder that causes misshapen red blood cells to clog blood vessels. The condition can cause...", "url": "https://technologytimes.pk/2022/07/09/africa-theres-no-cure-for-sickle-cell-disease-but-spotting-it-early-can-improve-treatment/", "urlToImage": "https://technologytimes.pk/wp-content/uploads/2022/07/Africa-Theres-No-Cure-for-Sickle-Cell-Disease-but-Spotting-It-Early-Can-Improve-Treatment.jpg", "publishedAt": "2022-07-09T11:57:15Z", "content": "Sickle cell disease is a genetic disorder that causes misshapen red blood cells to clog blood vessels. The condition can cause extreme pain. People with sickle cell disease are at risk of life-threat… [+4002 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Do you have these iPhones? Beware! You are at a Major risk from hackers - HT Tech", "description": "Millions of iPhone devices are going to become the favorite destination for hackers in just a couple of months. Find out if your device is part of it.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-6s-iphone-7-iphone-se-apple-iphones-hackers-risk-71657361006558.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/09/1600x900/IMG_3208_1648264949329_1657361074391.jpg", "publishedAt": "2022-07-09T10:08:51Z", "content": "In just a couple of months, millions of iPhone devices across the world are going to become vulnerable and dangerous to their users. This will happen because once the iOS 16 update rolls out, older m… [+2093 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africans are still semigrating to these coastal towns - BusinessTech", "description": "Meridian Realty reveals two coastal towns to the new semigration hotspot.", "url": "https://businesstech.co.za/news/property/601816/south-africans-are-semigrating-to-this-coastal-town/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/06/Screenshot-2022-06-30-120128-e1656583329410.png", "publishedAt": "2022-07-09T08:01:51Z", "content": "South Africans are increasingly moving to the Garden Route, pushing asking prices in the region sharply upwards, says Antonie Goosen, principal and founder of Meridian Realty.\r\nDomestic semigration p… [+4989 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The rand is being tested as fears of a US recession mount - BusinessTech", "description": "The rand’s 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportive.", "url": "https://businesstech.co.za/news/finance/604862/the-rand-is-being-tested-as-fears-of-a-us-recession-mount/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2022-07-09T06:20:18Z", "content": "The rands 9% plunge in the past month may be just the beginning for the South African currency, whose resilience is being tested by fears of a US recession even as local fundamentals remain supportiv… [+4123 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Creatures Fill Puzzling Gap in the Fossil Record - SciTechDaily", "description": "Research reveals yunnanozoans as the oldest known stem vertebrates. New findings answer questions in the fossil record. The puzzling gap in the fossil record that would explain the evolution of invertebrates to vertebrates has long perplexed scientists. Verte…", "url": "https://scitechdaily.com/extinct-creatures-fill-puzzling-gap-in-the-fossil-record/", "urlToImage": "https://scitechdaily.com/images/Yunnanozoan-Artistic-Reconstruction-scaled.jpg", "publishedAt": "2022-07-09T03:36:51Z", "content": "Artistic reconstruction of the yunnanozoan from the Cambrian Chengjiang biota shows basket-like pharyngeal skeletons. Credit: Dinghua Yang\r\nResearch reveals yunnanozoans as the oldest known stem vert… [+4848 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "April Fowell", "title": "Japan Plans to Create a Laser Beam to Eliminate Satellite Debris in Space - Tech Times", "description": "Japan Aerospace Exploration Agency is experimenting with a laser beam to deal with space junk.", "url": "https://www.techtimes.com/articles/277825/20220708/japan-plans-to-create-a-laser-beam-to-eliminate-satellite-debris-in-space.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/407955/textures-with-negative-space.jpg", "publishedAt": "2022-07-09T03:00:00Z", "content": "Japan is looking for ways to deal with space debris. Ever since the space age began, space junk that consists of satellites, rocket parts, and wreckage from collisions has been piling up. It is even … [+2821 chars]"}, {"source": {"id": null, "name": "Womenlovetech.com"}, "author": "Alice Duthie", "title": "How To Get The Most Out Of Your iPhone Camera - Women Love Tech ", "description": "Here are some of our best tips and tricks to make your iPhone photos look like they were taken on a professional camera.", "url": "https://womenlovetech.com/how-to-get-the-most-out-of-your-iphone-camera/", "urlToImage": "https://womenlovetech.com/wp-content/uploads/2022/07/26552_iPhone-Camera.jpeg", "publishedAt": "2022-07-08T20:06:27Z", "content": "The iPhone camera allows you to take stunning photos, however are we truly harnessing its full potential? Here are some of our best tips and tricks to make your photos look like they were taken on a … [+2738 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Case Solved: The Biosynthesis of Strychnine - SciTechDaily", "description": "Researchers from Jena show how the poison nut tree forms strychnine. A team of scientists from the Max Planck Institute for Chemical Ecology in Jena disclosed the complete biosynthetic pathway for the formation of strychnine in the plant species Strychnos nux…", "url": "https://scitechdaily.com/case-solved-the-biosynthesis-of-strychnine/", "urlToImage": "https://scitechdaily.com/images/Strychnos-nux-vomica-scaled.jpg", "publishedAt": "2022-07-08T14:56:30Z", "content": "Poison nut tree Strychnos nux-vomica. Credit: Danny Kessler, Max Planck Institute for Chemical Ecology\r\nResearchers from Jena show how the poison nut tree forms strychnine.\r\nA team of scientists from… [+5712 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Christopher Carbone", "title": "Watch the ISS dump 172 pounds of trash in space as waste removal gets upgraded - Daily Mail", "description": "Taking out the trash on the International Space Station just got much easier. Nanoracks has tested a new technology that will streamline the process of waste disposal in outer space.", "url": "https://www.dailymail.co.uk/sciencetech/article-10995299/Taking-garbage-International-Space-Station-just-got-easier.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/08/15/60039985-0-image-a-32_1657290161492.jpg", "publishedAt": "2022-07-08T14:44:48Z", "content": "Taking out the trash on the International Space Station just got much easier.\r\nNanoracks, a private space company based in Houston, successfully tested a new technology that will streamline the proce… [+4616 chars]"}]}