{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 3 April 2023: Olympus Mons volcano on Mars - HT Tech", "description": "Today's NASA Astronomy Picture of the Day is an aerial snapshot of Olympus Mons, the largest volcano in the solar system which is located on Mars.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-3-april-2023-olympus-mons-volcano-on-mars-71680502592908.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/03/1600x900/Mars_olympus_mons_volcano_1680502715765_1680502716012_1680502716012.jpg", "publishedAt": "2023-04-03T06:19:39Z", "content": "A volcano is an opening on the surface of a planet or moon that allows material hotter than its surroundings to escape from its interior. Although numerous volcanoes exist on Earth, the biggest volca… [+1958 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Spectacular Hubble Image Captures Aftermath of Catastrophic Supernova Explosion - SciTechDaily", "description": "The Hubble Space Telescope captured an image of the aftermath of a Type II supernova explosion in the spiral galaxy UGC 2890, which is located 30 million light-years away in the Camelopardalis constellation. While the supernova occurred in 2009, Hubble recent…", "url": "https://scitechdaily.com/spectacular-hubble-image-captures-aftermath-of-catastrophic-supernova-explosion/", "urlToImage": "https://scitechdaily.com/images/Exploding-Supernova-Concept.jpg", "publishedAt": "2023-04-03T04:20:34Z", "content": "ByESA/HubbleApril 2, 2023\r\nHubble Space Telescope image of spiral galaxy UGC 2890. Located in the Camelopardalis constellation, the UGC 2890 galaxy is approximately 30 million light-years away from E… [+4361 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 12 Mini deal! Flipkart drops price to just 23999 with exciting offers - HT Tech", "description": "Grab the opportunity to buy the iPhone 12 Mini at a highly discounted price on Flipkart. Know more about the offer.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-12-mini-deal-flipkart-drops-price-to-just-23999-with-exciting-offers-71680494994469.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/03/1600x900/iphone-12-finish-select-202207-green_AV2_1680495249475_1680495263085_1680495263085.jpg", "publishedAt": "2023-04-03T04:14:59Z", "content": "With Apple confirming its WWDC 2023 where it will reveal the upcoming iOS 17, there's no better time to own an iPhone. If you're looking for a smartphone that offers flagship performance in a small f… [+1830 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "82-feet wide Asteroid 2023 FS11 hurtling towards Earth at a fiery 42275 kmph, NASA says - HT Tech", "description": "Asteroid 2023 FS11 has been tracked heading towards Earth by NASA and could make a close approach to Earth today, April 3.", "url": "https://tech.hindustantimes.com/tech/news/82foot-wide-asteroid-2023-fs11-hurtling-towards-earth-at-a-fiery-42275-kmph-nasa-says-71680484970292.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/03/1600x900/asteroid_freepik_1679838636836_1680485052833_1680485052833.jpg", "publishedAt": "2023-04-03T01:24:54Z", "content": "An asteroid named Asteroid 2023 FS11 has been receiving a lot of attention lately from space agencies around the world as it is all set to make a close approach with Earth today. Although smaller ast… [+1959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Unlocking the Mysteries of Superionic Ice: Deciphering the Magnetic Anomalies of Neptune and Uranus - SciTechDaily", "description": "A key aspect of the study was the deployment of density functional theory (DFT), a method derived from quantum mechanics and used in solid-state physics to resolve complex crystalline structures. Researchers used density functional theory to study the mechani…", "url": "https://scitechdaily.com/unlocking-the-mysteries-of-superionic-ice-deciphering-the-magnetic-anomalies-of-neptune-and-uranus/", "urlToImage": "https://scitechdaily.com/images/Superionic-Ice-XVIII.jpg", "publishedAt": "2023-04-03T00:36:24Z", "content": "BySão Paulo Research Foundation (FAPESP)April 2, 2023\r\nImage from simulation of ice XVIII. Oxygen ions (red) occupy a regular crystal lattice, while protons (white) diffuse like a liquid. Credit: Mau… [+7757 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Biz Carson, Karen Breslau, John Gittelsohn", "title": "San Francisco's Feeling the Pain of the Banking Crisis, Big Tech Layoffs - Bloomberg", "description": "Troubles at Silicon Valley Bank and First Republic are hitting at the worst possible time for a city already struggling to recover from the pandemic.", "url": "https://www.bloomberg.com/news/articles/2023-04-02/san-francisco-s-feeling-the-pain-of-the-banking-crisis-big-tech-layoffs", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ih39f23rhjag/v1/1200x772.jpg", "publishedAt": "2023-04-02T23:00:35Z", "content": "The worst was meant to be over for San Francisco. Coders were returning from Lake Tahoe and Miami, ChatGPT was all the rage and a downtown emptied out by the pandemic was showing signs of life. \r\nThe… [+29 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don't Miss: Mercury, Moon and Planets, and Lyrid Meteor Shower! - SciTechDaily", "description": "What are some skywatching highlights in April 2023? Mercury reaches its highest in the evening sky for the year for Northern Hemisphere observers. The Moon makes its monthly rounds to pair up beautifully with several planets. And viewing conditions may be ide…", "url": "https://scitechdaily.com/?p=265602", "urlToImage": "https://scitechdaily.com/images/Meteor-Shower-Artist-Depiction.jpg", "publishedAt": "2023-04-02T20:48:09Z", "content": "April 26-27 The Moon is at its first-quarter phase, which is a great time to observe with binoculars or a telescope if you have access to them. Around this time you can observe details in the lunar c… [+2758 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 15 Pro to get CRAZY button makeover! Will work with GLOVES - HT Tech", "description": "The iPhone 15 Pro models are tipped to get solid-state buttons instead of physical ones. The amazing part is what they will do. Check out this amazing feature.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-15-pro-to-get-crazy-button-makeover-will-work-with-gloves-71680447537659.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/02/1600x900/iPhone_14_Pro_Max_rear_1664429141689_1680447625047_1680447625047.jpg", "publishedAt": "2023-04-02T15:00:57Z", "content": "The iPhone 15 Pro is set to bring some major changes this year! The current flagship iPhone 14 Pro lineup was launched a major change in terms of its design. A pill-shaped Dynamic Island was rolled o… [+1542 chars]"}, {"source": {"id": null, "name": "Chron.com"}, "author": "Ariana Garcia", "title": "Astronomers find ultramassive black hole 30 times larger than the Sun - Chron", "description": "Astronomers located an ultramassive black hole using a new technique called gravitational lensing.", "url": "https://www.chron.com/news/space/article/ultramassive-black-hole-gravitational-lensing-17871997.php", "urlToImage": "https://s.hdnux.com/photos/01/32/11/64/23633155/3/rawImage.jpg", "publishedAt": "2023-04-02T10:39:48Z", "content": "An artists impression of a black hole, where the black holes intense gravitational field distorts the spacearound it.\r\nESA/Hubble, Digitized Sky Survey, Nick Risinger (skysurvey.org), N. Bartmann\r\nA … [+2393 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dancing aurora seen from International Space Station; check NASA clip - HT Tech", "description": "A breathtaking view of the dancing aurora can be seen from the International Space Station in the latest video shared by NASA.", "url": "https://tech.hindustantimes.com/tech/news/dancing-aurora-seen-from-international-space-station-check-nasa-clip-71680363365690.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/01/1600x900/NASA_auroras_1680363484610_1680363491520_1680363491520.PNG", "publishedAt": "2023-04-01T15:38:49Z", "content": "An aurora is a natural phenomenon that never fails to mesmerize. And now, NASA's latest video has taken the beauty of the Northern Lights to another level! The US space agency has shared a breathtaki… [+1658 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "450-meter asteroid Bennu samples to come back to Earth on NASA's OSIRIS-REx; know when - HT Tech", "description": "NASA has revealed the return date for its OSIRIS-REx spacecraft which is currently traveling with samples from asteroid Bennu. Know when it will reach Earth.", "url": "https://tech.hindustantimes.com/tech/news/450meter-asteroid-bennu-samples-to-come-back-to-earth-on-nasa-s-osiris-rex-know-when-71680349259333.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/01/1600x900/Asteroid_Bennu_NASA_1657195243730_1680349290803_1680349290803.png", "publishedAt": "2023-04-01T11:43:49Z", "content": "More than six years have passed since the NASA OSIRIS-REx spacecraft embarked on its unique mission. Unlike most NASA expeditions, the spacecraft's destination was not a planet or a moon, but a 450-m… [+2402 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Jurassic Makeover: Revealing the True Faces of Predatory Dinosaurs Like T. rex - SciTechDaily", "description": "A recent study challenges the depiction of predatory dinosaurs like Tyrannosaurus rex with exposed teeth, suggesting they had scaly, lizard-like lips instead. By examining tooth structure, wear patterns, and jaw morphology of reptile groups, researchers concl…", "url": "https://scitechdaily.com/?p=264958", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-Lipped-Mouth-Eating-Edmontosaurus-scaled.jpg", "publishedAt": "2023-04-01T10:32:53Z", "content": "ByUniversity of PortsmouthApril 1, 2023\r\nA juvenile Edmontosaurus disappears into the enormous, lipped mouth of Tyrannosaurus. Credit: Mark Witton\r\nA recent study challenges the depiction of predator… [+8968 chars]"}]}