{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Tech Xplore"}, "author": "L.f. Carver", "title": "Don't try to replace pets with robots; design robots to be more like service animals - Tech Xplore", "description": "Robopets are artificially intelligent machines created to look like an animal (usually a cat or dog, but they can be any animal). There are numerous robopets on the market right now, being sold to consumers as \"pets\" or companions. There is an especially ferv…", "url": "https://techxplore.com/news/2021-07-dont-pets-robots-animals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/dont-try-to-replace-pe.jpg", "publishedAt": "2021-07-19T11:13:30Z", "content": "Robopets are artificially intelligent machines created to look like an animal (usually a cat or dog, but they can be any animal). There are numerous robopets on the market right now, being sold to co… [+4476 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Clean Science & Technology stock ends 76% higher on listing day; time to book profits? - Moneycontrol.com", "description": "Despite the better-than-expected listing gains, experts advise remaining invested in the stock for the long-term given the company's strong financials and fundamentals, international presence, and leading position in several critical products.", "url": "https://www.moneycontrol.com/news/business/ipo/clean-science-time-to-book-profits-7192321.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/02/Budget-2018_chemicals2-770x433.jpg", "publishedAt": "2021-07-19T10:49:45Z", "content": "Clean Science &amp; Technology made a strong debut on bourses, opening at a massive 98.3 percent premium over its issue price. On NSE, the scrip got listed at Rs 1,755, up 95 percent. This was ahead … [+2645 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Cat Ellis", "title": "Brompton recalls thousands of e-bikes over safety bug – here's what to do - TechRadar", "description": "First of all, don't panic", "url": "https://www.techradar.com/news/brompton-recalls-thousands-of-e-bikes-over-safety-bug-heres-what-to-do", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dWHfoTX8KdGgmQHKwh5xzH-1200-80.jpg", "publishedAt": "2021-07-19T10:27:00Z", "content": "Brompton has recalled thousands of folding e-bikes after discovering a firmware problem that could lead to a systems failure. The motor on a Brompton e-bike usually only kicks while you're pedaling, … [+2411 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Alice Marshall", "title": "How to watch Love Island in 2021 online: stream UK, USA and Australia versions at home and abroad - TechRadar", "description": "Couple up with Love Island around the world", "url": "https://www.techradar.com/news/watch-love-island-2021", "urlToImage": "https://cdn.mos.cms.futurecdn.net/traP8e2edxikA8YRU5dTrg-1200-80.jpg", "publishedAt": "2021-07-19T10:26:36Z", "content": "Whether you're committed to getting to know everyone, or want to put all your eggs in one basket, we've got the details on how to watch Love Island and stream seasons around the globe, whether you're… [+13829 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "319Tbps — The new Internet speed record - MyBroadband", "description": "Researchers from Japan’s National Institute of Information and Communication Technology have achieved an astounding new Internet speed record of 319 terabits per second over 3,001km.", "url": "https://mybroadband.co.za/news/internet/406558-319tbps-the-new-internet-speed-record.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/07/Fibre-speed-record-image.png", "publishedAt": "2021-07-19T10:13:43Z", "content": "Researchers from Japan’s National Institute of Information and Communication Technology (NICT) have achieved an astounding new Internet speed record of 319 Terabits per second (Tbps) over 3,001km.\r\nT… [+3523 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Aakash Jhaveri", "title": "Samsung Galaxy Z Fold 3 and Z Flip 3 could arrive with major screen upgrades - Techradar", "description": "Probably the right thing to focus on", "url": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-and-z-flip-3-could-arrive-with-major-screen-upgrades", "urlToImage": "https://cdn.mos.cms.futurecdn.net/CEu82euxBsxqt39NGFhrWU-1200-80.jpg", "publishedAt": "2021-07-19T09:26:09Z", "content": "The Samsung Galaxy Z Fold 3 could be the most advanced foldable smartphone yet when it launches, likely next month, and a new leak suggests that it will also be far more durable than not just its pre… [+2349 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jasper Jolly", "title": "China’s Tencent agrees to buy UK video games firm Sumo for more than £900m - The Guardian", "description": "Move expands Chinese tech company’s presence in the global video games market", "url": "https://amp.theguardian.com/business/2021/jul/19/china-tencent-uk-video-games-developer-sumo", "urlToImage": null, "publishedAt": "2021-07-19T08:13:00Z", "content": "Technology sectorMove expands Chinese tech companys presence in the global video games market\r\nChinas Tencent has agreed to buy the British video games developer Sumo Group at a valuation of more tha… [+2556 chars]"}, {"source": {"id": null, "name": "Dealstreetasia.com"}, "author": "Mars W. Mosqueda Jr.", "title": "Philippines-based TV network GMA launches new venture for tech investments - DealStreetAsia", "description": "GVI will also engage in M&As, strategic partnerships, and fund investments, within or outside the Philippines.", "url": "https://www.dealstreetasia.com/stories/gma-network-ventures-251568/", "urlToImage": "https://dealstreetwebsite.s3.amazonaws.com/uploads/2021/07/mari-gimenez-YrbGAeXFvCo-unsplash-scaled-e1626680022915.jpg", "publishedAt": "2021-07-19T07:34:50Z", "content": "Philippines-listed media company GMA Network has announced the launch of a new holding company GMA Ventures Inc (GVI), looking to join other local conglomerates, which have diversified their business… [+2294 chars]"}, {"source": {"id": null, "name": "Gadget.co.za"}, "author": null, "title": "The magazine of personal technology - Gadget", "description": "Huawei has launched HMS Core 6.0 to app developers in Africa, introducing multiple new capabilities and updating existing services and features. HMS Core (APK) on all user devices has now been updated to the 6.0 version, and consumers can access Huawei Develo…", "url": "https://gadget.co.za/huawei-launches-hms-core-6-0/", "urlToImage": "https://i1.wp.com/gadget.co.za/wp-content/uploads/2021/07/HMS-Core-6.0.jpg?resize=1000%2C600&ssl=1", "publishedAt": "2021-07-19T06:57:07Z", "content": "Huawei has launched HMS Core 6.0 to app developers in Africa, introducing multiple new capabilities and updating existing services and features. HMS Core (APK) on all user devices has now been update… [+2235 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Woolworths on looting impact and financial results - BusinessTech", "description": "Clothing and grocery retailer Woolworths says the recent civil unrest in KwaZulu Natal (KZN) and parts of Gauteng, which escalated into widespread looting and destruction of property in those areas, has had a significant impact on its operations.", "url": "https://businesstech.co.za/news/business-opinion/506916/woolworths-on-looting-impact-and-financial-results/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/08/Woolworths-e1472223181725.jpg", "publishedAt": "2021-07-19T06:33:27Z", "content": "Clothing and grocery retailer Woolworths says the recent civil unrest in KwaZulu-Natal (KZN) and parts of Gauteng, which escalated into widespread looting and destruction of property in those areas, … [+4573 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Defence minister Nosiviwe Mapisa-Nqakula says there is no evidence that a coup attempt or insurrection took place in South Africa over the past week; figures being put out around expected damages as a result of last week’s looting are massively underestimated…", "url": "https://businesstech.co.za/news/government/506910/5-important-things-happening-in-south-africa-today-1083/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Nonsiviwe-Mapisa-Nqakula-South-African-Minister-of-Defence-and-Military-Veterans.jpg", "publishedAt": "2021-07-19T06:15:03Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 11,215 new cases of Covid-19, taking the total reported to 2,295,095. Deaths have reached … [+3236 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Government considers basic income grant after riots and looting in South Africa - BusinessTech", "description": "President Cyril Ramaphosa says that government is currently investigating the feasibility of introducing a basic income grant in South Africa.", "url": "https://businesstech.co.za/news/finance/506914/government-considers-basic-income-grant-after-riots-and-looting-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/Money-south-africa-rand.png", "publishedAt": "2021-07-19T05:52:54Z", "content": "President Cyril Ramaphosa says that the government is currently investigating the feasibility of introducing a basic income grant in South Africa.\r\nSpeaking at a Mandela Day memorial lecture on Sunda… [+1800 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Pfizer-BioNTech and Moderna COVID-19 vaccines establish recall responses to reinfection - News-Medical.Net", "description": "Researchers in the United States have conducted a study showing that the coronavirus disease 2019 (COVID-19) vaccines developed by Pfizer-BioNTech and Moderna generate a coordinated adaptive immune response that is capable of eliciting recall responses to fut…", "url": "https://www.news-medical.net/news/20210718/Pfizer-BioNTech-and-Moderna-COVID-19-vaccines-establish-recall-responses-to-reinfection.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/7/49534865371_05ecf26c90_o.jpg", "publishedAt": "2021-07-19T03:05:00Z", "content": "Researchers in the United States have conducted a study showing that the coronavirus disease 2019 (COVID-19) vaccines developed by Pfizer-BioNTech and Moderna generate a coordinated adaptive immune r… [+4695 chars]"}]}