{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Ahead of iPhone 14 launch, pre-book it NOW! Check whopping price and know how to do it - HT Tech", "description": "THIS website is accepting pre-booking for iPhone 14! Know the details.", "url": "https://tech.hindustantimes.com/how-to/ahead-of-iphone-14-launch-pre-book-it-now-check-whopping-price-and-know-how-to-do-it-71657125287765.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/06/1600x900/iPhone_13_Pro_Max_(2)_1633406699232_(1)_1652617213091_1657125383428.jpg", "publishedAt": "2022-07-06T16:37:20Z", "content": "Apples much-anticipated iPhone 14 launch is expected to happen sometime in September. We already heard so many rumors and leaks giving us insight about the designs and major upgrades and we just cant… [+1547 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "NASA: Contact lost with $32.7 mn Capstone spacecraft on way to test moon orbit, but hope floats - HT Tech", "description": "NASA said it has lost contact with a $32.7 million spacecraft headed to the moon to test out a lopsided lunar orbit, but agency engineers are hopeful they can fix the problem.", "url": "https://tech.hindustantimes.com/tech/news/nasa-contact-lost-with-32-7-mn-capstone-spacecraft-on-way-to-test-moon-orbit-71657099286254.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/07/06/1600x900/Rocket-Launch-Moon-0_1657122328548_1657122372389.jpg", "publishedAt": "2022-07-06T15:47:42Z", "content": "NASA said Tuesday it has lost contact with a $32.7 million spacecraft headed to the moon to test out a lopsided lunar orbit, but agency engineers are hopeful they can fix the problem.\r\nAfter one succ… [+960 chars]"}, {"source": {"id": null, "name": "Medtechdive.com"}, "author": "Nick Paul Taylor", "title": "'Little sign' that digital tools are being deployed effectively in fight against COVID outbreak, study finds - MedTech Dive", "description": "To help reduce the spread of the next pandemic, there is “a substantial practical advantage” to integrating the features of multiple smartphone apps, a Scripps Research Translational Institute team found.", "url": "https://www.medtechdive.com/news/little-sign-that-digital-tools-are-being-deployed-effectively-in-fight-ag/626605/", "urlToImage": "https://www.medtechdive.com/imgproxy/6uHeLoacHiwkFYGteO32SFgH-tc-CJxbAWvrsjUqFx8/g:ce/rs:fill:770:364:0/bG9jYWw6Ly8vZGl2ZWltYWdlL0NvdmlkVHJhY2luZ19BcHBfR2V0dHkuanBn.jpg", "publishedAt": "2022-07-06T15:44:52Z", "content": "Dive Brief:\r\n<ul><li>While smartphone applications have been used to track COVID-19 outbreaks, screen patients and trace contacts, a Scripps Research Translational Institute team found a lack of data… [+2368 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Loukia Papadopoulos", "title": "Goodbye, space junk! Chinese engineers successfully use 'drag sail' technology - Interesting Engineering", "description": "The drag sail is a kite-like membrane that measures 25 sq meters (269 sq feet) when fully unfurled.", "url": "https://interestingengineering.com/chinese-engineers-drag-sail-technology", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/y5wWXAydOX/sizes/space-junk_md.jpg", "publishedAt": "2022-07-06T14:50:38Z", "content": "Did you know that up to date, some 8,950 satellites have been launched into orbit? Based on the most recent estimates, about 5,000 of these satellites remain in orbit despite the fact that they have … [+2453 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Single-Step, Lithography-Free Synthesis of High-Density Nanoribbon Arrays - AZoNano", "description": "New research presents a single-step, lithography-free fabrication technique for producing high-density MoTe2 nanoribbon arrays on a standard SiO2/Si platform directly, without the need for specifically stepped substrates or post-processing methods.", "url": "https://www.azonano.com/news.aspx?newsID=39377", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/news/SocialSharingImage_39377_1657116115958505.jpg", "publishedAt": "2022-07-06T14:03:00Z", "content": "A paper published in the journal Materials Today describes a single-step, lithography-free chemical vapor deposition (CVD) fabrication approach for producing single-crystalline molybdenum ditelluride… [+5392 chars]"}, {"source": {"id": null, "name": "FOX 31 Denver"}, "author": "Kirk Yuhnke", "title": "Tech Junkie – New Samsung Galaxy A53 proves budget phones require few sacrifices - FOX 31 Denver", "description": "There was a time when budget phones were awful. Downright hard to use. Those days are gone and the “budget” options are better than ever before. The newest from Samsung is the Galaxy S53, I took it for a test. The A53 is a budget phone that feels high-end. Th…", "url": "https://kdvr.com/news/technology/tech-junkie-new-samsung-galaxy-a53-proves-budget-phones-require-few-sacrifices/", "urlToImage": "https://kdvr.com/wp-content/uploads/sites/11/2022/07/20220706_063300.jpg?w=1280", "publishedAt": "2022-07-06T13:31:47Z", "content": "There was a time when budget phones were awful. Downright hard to use. Those days are gone and the “budget” options are better than ever before. The newest from Samsung is the Galaxy S53, I took it f… [+2250 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Gareth John Macdonald", "title": "Achieving QbD with Machine Learning - Genetic Engineering & Biotechnology News", "description": "Machine learning algorithms currently are process specific. However, if industry is willing to invest in expertise and collaborate it may be able to create models that are useful to multiple parties. The holy grail would be machine learning algorithms that ha…", "url": "https://www.genengnews.com/artificial-intelligence/achieving-qbd-with-machine-learning/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2020/10/Nov4_2019_Getty_1153658163_ComputerNodes-scaled-e1602099299662.jpg", "publishedAt": "2022-07-06T13:00:44Z", "content": "Regulators favor processes designed with drug quality in mind. The challenge is that as production methods become more complex, established modeling techniques are struggling to cope.\r\nSo says Ian Wa… [+3495 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "The Cabal", "title": "The top smartphone apps in Africa - TechCabal", "description": "In June 2020 the article “Africa's most popular apps & the insights they reveal” gave insight into internet use trends in Africa.", "url": "https://techcabal.com/2022/07/06/the-top-smartphone-apps-in-africa/", "urlToImage": "https://x7d4c5z5.stackpathcdn.com/wp-content/uploads/tc/2022/07/smarthone-app.jpg", "publishedAt": "2022-07-06T12:48:59Z", "content": "This insightful op-ed was contributed to TechCabal by Emeka Ajene. Emeka Ajene co-founded Gozem alongside Raphael Dana in 2018.\r\nWhile the African continent is often discussed as a single united enti… [+11707 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Doctors Warn of Vitamin D Supplement “Overdosing” – Man Hospitalized After Losing 28 Pounds - SciTechDaily", "description": "‘Hypervitaminosis D’ is on the rise and linked to a wide range of potentially serious health issues. Doctors are warning that ‘Overdosing’ on vitamin D supplements is both possible and harmful after they treated a man who needed hospital admission for his exc…", "url": "https://scitechdaily.com/doctors-warn-of-vitamin-d-supplement-overdosing-man-hospitalized-after-losing-28-pounds/", "urlToImage": "https://scitechdaily.com/images/Vitamin-D-Softgel-Supplements-Bottle.jpg", "publishedAt": "2022-07-06T12:29:55Z", "content": "Doctors warn that Overdosing on vitamin D supplements is both possible and harmful.\r\nHypervitaminosis D is on the rise and linked to a wide range of potentially serious health issues.\r\nDoctors are wa… [+4582 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "New CCMA ruling throws a spanner in the works for mandatory vaccine policies at work - BusinessTech", "description": "In the past year, the Commission for Conciliation, Mediation and Arbitration (CCMA) has delivered several arbitration awards which have upheld the dismissals of employees who refused to get vaccinated against Covid.", "url": "https://businesstech.co.za/news/business/603754/new-ccma-ruling-throws-a-spanner-in-the-works-for-mandatory-vaccine-policies-at-work/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Vaccine-e1625982135407.jpg", "publishedAt": "2022-07-06T12:27:24Z", "content": "In the past year, the Commission for Conciliation, Mediation and Arbitration (CCMA) has delivered several arbitration awards which have upheld the dismissals of employees who refused to get vaccinate… [+6103 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Health Ministry reduces gap between second vaccine dose and booster dose - Moneycontrol", "description": "The COVID-19 booster dose gap for adult beneficiaries in India has been lowered from the previously decided nine-month period to a six-month period by the Union Health Ministry. The National Technical Advisory Group on Immunization's advice served as the foun…", "url": "https://www.moneycontrol.com/news/india/health-ministry-reduces-gap-between-second-vaccine-dose-and-booster-dose-8788961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/000_9QN3FE-653x435.jpg", "publishedAt": "2022-07-06T12:12:43Z", "content": "The Union health ministry has reduced the gap for COVID 19 booster dose from existing nine months to six months for all adults in India. The decision has been taken based on a recommendation by the N… [+1490 chars]"}, {"source": {"id": null, "name": "Taproot.news"}, "author": "Karen Unland", "title": "Neuroscience hackathon offers chance to solve real-life problems - Taproot Edmonton", "description": "If you have been thinking about a challenge that might be tackled with neurotechnology, this summer provides an opportunity to get some help from students and recent grads who are looking for real-world problems to solve.", "url": "https://edmonton.taproot.news/news/2022/07/06/neuroscience-hackathon-offers-chance-to-solve-real-life-problems", "urlToImage": "https://mcusercontent.com/cf49a42db023942d337b0dabf/images/1204c37a-0981-bdd2-ab75-de1035984607.jpg", "publishedAt": "2022-07-06T12:00:00Z", "content": "At the heart of neurotechnology is BCI, or brain-computer interface. Translating a person's brain activity into external responses has numerous applications, such as enabling recovery from a stroke o… [+2998 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - How to see Webb's new images - ESA Science & Technology", "description": "As excitement mounts for the unveiling of Webb’s first full-colour images on Tuesday 12 July, here’s how to participate in the global celebration via ESA’s channels. Choose from watching a livestream, attending an in-person event, or joining our social media …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/How_to_see_Webb_s_new_images", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2021/03/artist_s_impression_of_the_james_webb_space_telescope/23231075-5-eng-GB/Artist_s_impression_of_the_James_Webb_Space_Telescope_pillars.jpg", "publishedAt": "2022-07-06T10:16:06Z", "content": "Science &amp; Exploration05/07/202211098 views32 likes\r\nAs excitement mounts for the unveiling of Webbs first full-colour images on Tuesday 12 July, heres how to participate in the global celebration… [+3516 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Warning over pension change for South Africa - BusinessTech", "description": "Retirement funds will have to invest in upskilling trustees to empower them to navigate the complex world of infrastructure investing opened up by the gazetting of the amendments to Regulation 28 of the Pensions Fund Act, says Andrew Davison, chair of the Inv…", "url": "https://businesstech.co.za/news/business/603482/warning-over-pension-change-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/03/Money-e1532513254275.png", "publishedAt": "2022-07-06T08:57:27Z", "content": "Retirement funds will have to invest in upskilling trustees to empower them to navigate the complex world of infrastructure investing opened up by the gazetting of the amendments to Regulation 28 of … [+4705 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Large Hadron Collider Successfully Restarted at Record Energy: Revving Up the Search for Dark Matter - SciTechDaily", "description": "The Large Hadron Collider is once again delivering proton collisions to experiments, this time at an unprecedented energy of 13.6 TeV, marking the start of the accelerator’s third run of data taking for physics. A burst of applause erupted in the CERN Control…", "url": "https://scitechdaily.com/large-hadron-collider-successfully-restarted-at-record-energy-revving-up-the-search-for-dark-matter/", "urlToImage": "https://scitechdaily.com/images/Physics-Particle-Accelerator-Collider-Illustration.jpg", "publishedAt": "2022-07-06T08:39:39Z", "content": "ByCERNJuly 6, 2022\r\nThe Large Hadron Collider detectors started recording high-energy collisions at the unprecedented energy of 13.6 TeV.\r\nThe Large Hadron Collider is once again delivering proton co… [+6138 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Anjali A. Sarkar, PhD", "title": "Tick-Bite Induced Mammalian Meat Allergy Unraveled - Genetic Engineering & Biotechnology News", "description": "New findings may open up strategies toward antibody therapeutics for alpha-gal syndrome in mammalian meat allergy, malaria, and xenotransplantation.", "url": "https://www.genengnews.com/topics/translational-medicine/infectious-diseases/tick-bite-induced-mammalian-meat-allergy-unraveled/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/07/Low-Res_Daniel-Christ-antibody-screen.jpg.png", "publishedAt": "2022-07-06T08:00:02Z", "content": "Scientists at the Garvan Institute of Medical Research in Australia have gained mechanistic insights on a life-threatening mammalian meat allergy brought on by tick bites that could pave the way for … [+4169 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Bad news for back to the office – latest petrol price hike compels South Africans to stay home - BusinessTech", "description": "The petrol price increase that kicked in from today (6 July) is likely to have an impact on the country’s property market, says John Loos, property sector strategist at FNB Commercial Property Finance", "url": "https://businesstech.co.za/news/property/603350/bad-news-for-back-to-the-office-latest-petrol-price-hike-compels-south-africans-to-stay-home/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/08/Work-from-home.jpg", "publishedAt": "2022-07-06T06:09:50Z", "content": "The petrol price increase that kicked in from Wednesday (6 July) will force South Africans to reprioritise their budgets – including steering clear of going out to restaurants and sticking to working… [+2619 chars]"}, {"source": {"id": null, "name": "CyclingTips"}, "author": "Ronan Mc Laughlin", "title": "What bike tech can we expect for the Tour's 'Roubaix stage'? - CyclingTips", "description": "We look back at the tech from this year's Paris-Roubaix to see what stage 5 of the Tour might have in store.", "url": "http://cyclingtips.com/2022/07/what-bike-tech-can-we-expect-for-the-tours-roubaix-stage/", "urlToImage": "https://cyclingtips.com/wp-content/uploads/2022/04/Paris-Roubaix-2022-mens-tech-5.jpg", "publishedAt": "2022-07-06T01:46:20Z", "content": "Team mechanics have a tough job at Le Tour. They’ve got early mornings, long days in the back of a team car, and they’re last to finish at night. But for some, the 24 to 36 hours between the finish o… [+7593 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Cynthia Eller", "title": "What comes after the Higgs boson - Phys.org", "description": "Ten years ago this week, two international collaborations of groups of scientists, including a large contingent from Caltech, confirmed that they had found conclusive evidence for the Higgs boson, an elusive elementary particle, first predicted in a series of…", "url": "https://phys.org/news/2022-07-higgs-boson.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/what-comes-after-the-h.jpg", "publishedAt": "2022-07-05T13:32:55Z", "content": "Ten years ago this week, two international collaborations of groups of scientists, including a large contingent from Caltech, confirmed that they had found conclusive evidence for the Higgs boson, an… [+8928 chars]"}, {"source": {"id": null, "name": "MobileSyrup"}, "author": null, "title": "Check out these tech deals ahead of Amazon Prime Day - MobileSyrup", "description": "Amazon Prime Day, one other largest sales days for the retailer, is on July 12th and 13th. Ahead of this, its partners have discounted some of its most popular tech.", "url": "https://mobilesyrup.com/2022/07/05/amazon-prime-day-tech-deals-google-apple-samsung-2022/", "urlToImage": "https://cdn.mobilesyrup.com/wp-content/uploads/2022/05/2nd-gen-airpods-scaled.jpg", "publishedAt": "2022-07-05T13:23:00Z", "content": "Amazon Prime Day, one other largest sales days for the retailer, is on July 12th and 13th. Ahead of this, its partners have discounted some of its most popular tech. Here is a rundown of what you can… [+267 chars]"}]}