{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Eurogamer.net"}, "author": "Richard Leadbetter", "title": "AMD reveals long-awaited FSR 3 tech and frame gen for every DX11/DX12 game - Eurogamer.net", "description": "DF goes 'eyes on' with FSR 3 - and a new AMD frame-gen solution that works with every DX11 and DX12 game.", "url": "https://www.eurogamer.net/digitalfoundry-2023-amd-reveals-long-awaited-fsr-3-tech-and-frame-gen-for-every-dx11dx12-game", "urlToImage": "https://assetsio.reedpopcdn.com/fsr3_a0mBm0R.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp", "publishedAt": "2023-08-25T15:30:00Z", "content": "Following Nvidia's DLSS 3.5 announcements at Gamescom, AMD has finally revealed FSR 3 - along with a separate frame generation solution that works on all DX11 and DX12 titles. In a meeting with AMD, … [+9591 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovery of 8.7-Million-Year-Old Fossil Ape Challenges Long-Accepted Ideas of Human Origins - SciTechDaily", "description": "Anadoluvius existed nearly 9 million years ago and is ancestral to living African apes and humans. A recent discovery of a fossilized ape from a site in Turkey, aged 8.7 million years, is challenging long-accepted ideas of human origins. This finding supports…", "url": "https://scitechdaily.com/discovery-of-8-7-million-year-old-fossil-ape-challenges-long-accepted-ideas-of-human-origins/", "urlToImage": "https://scitechdaily.com/images/Anadoluvius-turkae.jpg", "publishedAt": "2023-08-25T12:28:06Z", "content": "A new face and partial brain case of Anadoluvius turkae, a fossil hominine the group that includes African apes and humans from the Çorakyerler fossil site located in Central Anatolia, Türkiye. Credi… [+7078 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Arka Mukherjee", "title": "Sony PlayStation Portal doesn't work with any Bluetooth headphones, slammed to be massively anti-consumer - Sportskeeda", "description": "Yesterday, finer details on the Sony PlayStation Portal (previously the Project Q) were confirmed as tech outlets got hands-on time with the Sony handheld.", "url": "https://www.sportskeeda.com/gaming-tech/sony-playstation-portal-work-bluetooth-headphones-slammed-massively-anti-consumer", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/08/18c82-16929563347004-1920.jpg", "publishedAt": "2023-08-25T10:02:00Z", "content": "Yesterday, finer details on the Sony PlayStation Portal (previously the Project Q) were confirmed as tech outlets got hands-on time with the Sony handheld. The device lets PS5 gamers stream their fav… [+3048 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "Scientists uncovered a previously unknown mechanism for protein degradation in cells - Tech Explorist", "description": "The mechanism degrades short-lived proteins that support brain and immune functions.", "url": "https://www.techexplorist.com/previously-unknown-mechanism-protein-degradation-cells/67853/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/08/cells-bg.jpg", "publishedAt": "2023-08-25T06:38:28Z", "content": "Short-lived proteins regulate gene expression in cells to carry out various crucial functions. These proteins are created in the nucleus and, after performing their function, are promptly eliminated.… [+4631 chars]"}]}