{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "ISRO's Chandrayaan-4 mission to unlock amazing new avenues for space research by India - HT Tech", "description": "ISRO is building on the success of the Chandryaan-3 misison with the Chandrayaan-4 mission and it will actually send four modules to the lunar south pole in search of water ice.", "url": "https://tech.hindustantimes.com/tech/news/isros-chandrayaan-4-mission-to-unlock-amazing-new-avenues-for-space-research-by-india-71702368831176.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/12/1600x900/Chandrayaan-3_1695540921635_1702368858446.jpg", "publishedAt": "2023-12-12T08:20:00Z", "content": "In space exploration, where meticulous planning is the norm, objectives set the course for any mission. However, the Indian Space Research Organisation (ISRO) has recently demonstrated a remarkable a… [+4639 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "WSJ", "title": "At COP28, Hopes Dim For Fossil Fuel Phaseout | Mint - Mint", "description": "The latest draft by U.A.E. negotiators calls for energy technologies such as carbon capture to substitute for some burning of fossil fuels.", "url": "https://www.livemint.com/industry/energy/at-cop28-hopes-dim-for-fossil-fuel-phaseout-11702348212298.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/12/1600x900/UAE-UN-CLIMATE-COP28-1_1702348273482_1702348306351.jpg", "publishedAt": "2023-12-12T02:34:00Z", "content": "DUBAICountries pushing for a United Nations agreement to phase out fossil fuels saw their hopes dim Monday as United Arab Emirates officials who are leading the talks dropped the idea in the final st… [+3248 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Eco-friendly technologies for plastic production and biodegradation? - Science Daily", "description": "A new article covering an overview and trends of plastic production and degradation technology using microorganisms has been published. Eco-friendly and sustainable plastic production and degradation technology using microorganisms as a core technology to ach…", "url": "https://www.sciencedaily.com/releases/2023/12/231211114623.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-12-12T00:39:07Z", "content": "Plastic is one of the important materials in modern society, with approximately 460 million tons produced annually and with expected production reaching approximately 1.23 billion tons in 2060. Howev… [+3778 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Best gaming console: Sony PlayStation 5 to Nintendo Switch OLED, check the top 11 - HT Tech", "description": "Explore the gaming universe with our guide to the best gaming console! From Sony PlayStation 5 to Nintendo Switch OLED, discover immersive gaming experiences for all ages and preferences.", "url": "https://tech.hindustantimes.com/gaming/news/best-gaming-console-sony-playstation-5-to-nintendo-switch-oled-check-the-top-11-71702217042585.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/12/10/1600x900/gaming_console_1702217277492_1702217277760.JPG", "publishedAt": "2023-12-10T14:22:58Z", "content": "In the world of high-class entertainment, gaming has become more than just a pastime; it's a portal to new dimensions, a realm where you can be the hero or explore fantastical landscapes. While high-… [+13076 chars]"}]}