{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Daily Sun"}, "author": "Rapheal", "title": "Capital market collaboration can build digital economy –NGX - Daily Sun", "description": "By Chinwendu Obienyi The Nigerian Exchange Limited (NGX) has said that the collaboration between FinTech and the capital market would", "url": "https://www.sunnewsonline.com/capital-market-collaboration-can-build-digital-economy-ngx/", "urlToImage": "https://sunnewsonline.com/wp-content/uploads/2021/04/NGX-Logo.png", "publishedAt": "2021-08-23T01:54:41Z", "content": "By Chinwendu Obienyi\r\nThe Nigerian Exchange Limited (NGX) has said that the collaboration between FinTech and the capital market would effectively create a digital economy, increase financial inclusi… [+2157 chars]"}, {"source": {"id": null, "name": "Illinoisnewstoday.com"}, "author": "danielkuhn", "title": "New discoveries remove important design barriers - Illinoisnewstoday.com", "description": "There are many obstacles that must be overcome before quantum computers become commonplace. However, UNSW in Sydney A new technology for controlling millions of spin qubits takes that step one step fu", "url": "https://illinoisnewstoday.com/new-discoveries-remove-important-design-barriers/352818/", "urlToImage": "https://www.redsharknews.com/hubfs/NNSW_quantum_computing.jpg#keepProtocol", "publishedAt": "2021-08-22T21:49:56Z", "content": "There are many obstacles that must be overcome before quantum computers become commonplace. However, UNSW in Sydney A new technology for controlling millions of spin qubits takes that step one step f… [+2872 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Adam Bankhurst", "title": "Dragon Age: Origins Developer Shares Their Biggest 'What-If\" Moments From Its Development - IGN", "description": "Daniel Fedor, the lead technical artist on Dragon Age: Origins, has revealed some of the biggest \"What-If\" moments from the game's development, including that the first entry in the franchise could have had multiplayer and dungeon-master modes.", "url": "https://www.ign.com/articles/dragon-age-origins-developer-shares-their-biggest-what-if-moment-from-its-development", "urlToImage": "https://assets-prd.ignimgs.com/2021/08/22/dragon-age-origins-1jpg-3edee9-1629656236842.jpg?width=1280", "publishedAt": "2021-08-22T18:25:05Z", "content": "Daniel Fedor, the lead technical artist on Dragon Age: Origins, has revealed some of the biggest \"What-If\" moments from the game's development, including that the first entry in the franchise could h… [+2445 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mackenzie Frazier", "title": "Amazon's huge device sale ends today: deals on Fire TV Stick, Kindle, tablets and more - TechRadar", "description": "Score epic deals on Amazon's best-selling devices", "url": "https://www.techradar.com/news/amazon-huge-device-sale-deals-fire-tv-stick-kindle-tablets", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Axkrw5BubuXSe5LBpCSsRD-1200-80.jpg", "publishedAt": "2021-08-22T18:21:30Z", "content": "Amazon's latest sale is blowing out its best-selling devices, including Fire TV Sticks, Blink security cameras, Fire tablets, Kindles, and more. You'll have to hurry though, these incredible device d… [+5873 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don’t Miss: Rare Seasonal “Blue Moon” Rises Tonight - SciTechDaily", "description": "This month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. The name was given to the Moon because the large sturgeon fish of the Great Lakes, and other major …", "url": "https://scitechdaily.com/dont-miss-rare-seasonal-blue-moon-rises-tonight/", "urlToImage": "https://scitechdaily.com/images/Blue-Moon.jpg", "publishedAt": "2021-08-22T18:01:45Z", "content": "ByLance D. Davis, NASAAugust 22, 2021\r\nThis month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. … [+2883 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Lumb", "title": "iOS 15 beta still hasn't fixed decade-old bug - Techradar", "description": "Sending a photo in Messages? Nope, can’t, sorry.", "url": "https://www.techradar.com/news/ios-15-beta-still-hasnt-fixed-decade-old-bug", "urlToImage": "https://cdn.mos.cms.futurecdn.net/NbVBT9bpcScQ9KAVx2EWgW-1200-80.jpg", "publishedAt": "2021-08-22T18:00:04Z", "content": "Ive been really enjoying the iOS 15 public beta for weeks now, and the new features like Live Text and UX refinements like clustered notifications already make it a better experience\r\n than iOS 14. B… [+2789 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google bans 8 dangerous apps from Play Store; DELETE them from your phone now, check list - HT Tech", "description": "Google has banned as many as 8 dangerous apps from its Play Store including BitFunds, Bitcoin Miner, Bitcoin,Bitcoin (BTC) and more. You must delete them from your smartphone too; check the full list.", "url": "https://tech.hindustantimes.com/tech/news/google-bans-8-dangerous-apps-from-play-store-delete-them-from-your-phone-now-check-list-71629565818495.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/08/21/1600x900/2021-08-19T213453Z_1050667361_RC2L8P9B1G4Y_RTRMADP_3_TECH-ANTITRUST-GOOGLE-EPICGAMES_1629565873348_1629565886792.JPG", "publishedAt": "2021-08-22T01:30:08Z", "content": "Cryptocurrency mining has been garnering everyone's interest especially over the span of the last couple of months. However, hackers are using this public interest in cryptocurrencies to trick innoce… [+3055 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Jeremy Laird", "title": "Small TV vs PC monitor: what’s the best display technology? - TechRadar", "description": "Small TVs and PC monitors are similar in scale but built to do very different jobs", "url": "https://www.techradar.com/news/small-tv-or-pc-monitor", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dFWBikNwgGAnNvzZpquveU-1200-80.jpg", "publishedAt": "2021-08-21T18:00:56Z", "content": "For years, it was easy to decide between a small TV and a PC monitor they had different kinds of inputs and served different functions. For computing of any kind you wanted a monitor; for watching mo… [+12993 chars]"}, {"source": {"id": null, "name": "Globalriskinsights.com"}, "author": "by  Jordan Dobney", "title": "Technological pull or competitive drive? China’s rover landing sends a message to the United States - Global Risk Insights", "description": "On Friday 14th May, China’s Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hopes their Zhurong rover will give them 90 days of service as…", "url": "https://globalriskinsights.com/2021/08/technological-pull-or-competitive-drive-chinas-rover-landing-sends-a-message-to-the-united-states/", "urlToImage": "https://i0.wp.com/globalriskinsights.com/wp-content/uploads/2021/08/50144550853_9e78484352_b.jpg?fit=800%2C440&ssl=1", "publishedAt": "2021-08-21T15:12:13Z", "content": "On Friday 14th May, Chinas Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hop… [+5400 chars]"}, {"source": {"id": null, "name": "Themarketwriteup.com"}, "author": null, "title": "Lung Cancer Screening Software Market is Booming Worldwide | PenRad Technologies, Thynk Health, ProVation Medical - The Market Writeuo - The Market Writeuo", "description": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Market research report shows the latest market insights; curren…", "url": "https://themarketwriteup.com/lung-cancer-screening-software-market-is-booming-worldwide-penrad-technologies-thynk-health-provation-medical/", "urlToImage": null, "publishedAt": "2021-08-21T13:38:58Z", "content": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Mar… [+5073 chars]"}]}