{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "200-foot asteroid, 3 other asteroids to pass Earth tomorrow, says NASA; Check size, speed and more - HT Tech", "description": "NASA has shed light on as many as four asteroids that are set to pass by Earth tomorrow, March 8. From their speed, and size to distance of approach, know all about these asteroid approaches.", "url": "https://tech.hindustantimes.com/tech/news/200foot-asteroid-3-other-asteroids-to-pass-earth-tomorrow-says-nasa-check-size-speed-and-more-71709785821396.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/07/1600x900/cosmos-7051165_1280_1675313973292_1709785955835.jpg", "publishedAt": "2024-03-07T04:52:10Z", "content": "The last 3 days have been rare, with no asteroid passing by Earth. However, that trend is set to break as NASA has shed light on as many as four asteroids that are set to fly past Earth tomorrow, Mar… [+3017 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "David Propper", "title": "Biotech company reveals breakthrough that could lead to revival of extinct woolly mammoth - New York Post ", "description": "“It will walk like a Woolly Mammoth, look like one, sound like one, but most importantly it will be able to inhabit the same ecosystem previously abandoned by the Mammoth’s extinction,” the company…", "url": "https://nypost.com/2024/03/06/us-news/breakthrough-reached-that-could-lead-to-revival-of-woolly-mammoth/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/03/purchase-order-77834050.jpg?quality=75&strip=all&w=1024", "publishedAt": "2024-03-07T04:08:00Z", "content": "The woolly mammoth could roam the Earth once again.\r\nThats the goal of Colossal Biosciences as the biotech company announced a major breakthrough Wednesday in its mission to revive the 6-ton, 16-foot… [+2633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft Worker Says AI Tool Tends To Create \"Sexually Objectified\" Images - NDTV", "description": "A Microsoft Corp. software engineer sent letters to the company's board, lawmakers and the Federal Trade Commission warning that the tech giant is not doing enough to safeguard its AI image generation tool, Copilot Designer.", "url": "https://www.ndtv.com/world-news/microsoft-worker-says-ai-tool-tends-to-create-sexually-objectified-images-5191221", "urlToImage": "https://c.ndtvimg.com/2024-03/rv9tuiuk_copilot-bloomberg_625x300_07_March_24.jpeg?ver-20240117.08", "publishedAt": "2024-03-07T01:49:58Z", "content": "A Microsoft Corp. software engineer sent letters to the company's board, lawmakers and the Federal Trade Commission warning that the tech giant is not doing enough to safeguard its AI image generatio… [+3459 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "Russia's next-generation rocket is a decade old and still flying dummy payloads - Ars Technica", "description": "Russia's heavy-lift Angara A5 rocket is about to launch on its fourth test flight.", "url": "https://arstechnica.com/space/2024/03/russias-next-generation-rocket-is-a-decade-old-and-still-flying-dummy-payloads/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2024/03/angara-a5-vostochny-pre-760x380.jpeg", "publishedAt": "2024-03-07T01:33:24Z", "content": "Enlarge/ Technicians assemble an Angara A5 rocket at the Vostochny Cosmodrome in Russia's Far East.\r\n17\r\nBy some measures, Russia's next-generation flagship rocket programthe Angarais now three decad… [+4602 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Eva Dou", "title": "Former Google AI engineer charged with stealing trade secrets for China firm - The Washington Post", "description": "The Justice Department alleged that a former Google AI engineer stole information about advanced technologies with the intention of setting up his own company in China.", "url": "https://www.washingtonpost.com/technology/2024/03/06/google-ai-doj-arrest/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DYT76MS6IZZTT3OPM6FCALR6QE.JPG&w=1440", "publishedAt": "2024-03-07T01:28:00Z", "content": "The Justice Department on Wednesday announced the arrest of a former Google AI engineer, alleging he stole information about the companys advanced technologies while planning to set up his own compan… [+3243 chars]"}]}