{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ozempic and Wegovy: Scientists Uncover New Risks of Popular Weight-Loss “Miracle Drugs” - SciTechDaily", "description": "GLP-1 medications linked to a lower risk of dementia and addiction but higher risk of kidney, pancreatic, and gastrointestinal issues. Demand for weight-loss medications, including popular brands like Ozempic and Wegovy, continues to rise. A recent study reve…", "url": "https://scitechdaily.com/?p=451157", "urlToImage": "https://scitechdaily.com/images/Weight-Loss-Drugs-Scale.jpg", "publishedAt": "2025-01-23T03:57:00Z", "content": "GLP-1RA drugs like Ozempic offer significant health benefits, including weight loss, improved brain health, and reduced addiction risks, but also pose risks like pancreatitis and kidney issues. Resea… [+6141 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Samsung Unpacked: Samsung teased an extra-thin S25 model at Unpacked - TechCrunch", "description": "Samsung Unpacked’s “one more thing” was a bit of a weird one. After the presentation ended, the company rolled a brief pre-packaged video of the Galaxy", "url": "https://techcrunch.com/2025/01/22/samsung-unpacked-samsung-teased-an-extra-thin-s25-model-at-unpacked/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2025/01/galaxy-25-edge.jpg?resize=1200,734", "publishedAt": "2025-01-22T21:25:11Z", "content": "Samsung Unpackeds one more thing was a bit of a weird one. After the presentation ended, the company rolled a brief pre-packaged video of the Galaxy Edge not to be confused with the “Star Wars” theme… [+960 chars]"}, {"source": {"id": null, "name": "9to5google.com"}, "author": "Ben Schoon", "title": "Galaxy S25 is ready for Qi2, but there’s a problem with MagSafe accessories - 9to5Google", "description": "Samsung is technically adopting Qi2 on the Galaxy S25 series, but only through a case, and there's a problem...", "url": "http://9to5google.com/2025/01/22/samsung-galaxy-s25-qi2-accessories-problem/", "urlToImage": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/01/galaxy-s25-qi2-3.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2025-01-22T18:10:00Z", "content": "Qi2 is finally happening. Two years after it was announced, Samsung is adopting the latest Qi2 standard in the Galaxy S25 series, but it’s not in the way you probably hoped, and you’re going to run i… [+2633 chars]"}]}