{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "DailyFX"}, "author": "Nick Cawley", "title": "Gold (XAU), Oil (USOIL) Bitcoin (BTC) Technical Outlooks and Prices - DailyFX", "description": "Gold continues to push higher, oil is nearly 3% higher on geopolitical concerns and Bitcoin is at a fresh 21-month high ahead of the SEC’s ETF decision", "url": "https://www.dailyfx.com/news/gold-xau-oil-usoil-bitcoin-btc-technical-outlooks-and-prices-20240102.html", "urlToImage": "https://a.c-dn.net/b/1TUQqX/bullish+chart.png", "publishedAt": "2024-01-02T15:00:12Z", "content": "Gold (XAU), Oil (USOIL) Bitcoin (BTC) Technical Outlooks and Prices\r\n<ul><li>Gold looking to push ahead, higher US Treasury yields weigh for now.</li><li>Oil breaks recent sell-off on fresh geopoliti… [+3077 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Aging's Antidote? The Crucial Role of HKDC1 in Keeping Cells Youthful - SciTechDaily", "description": "Researchers from Osaka University have identified a protein called HKDC1 that’s crucial to maintaining two subcellular structures, mitochondria and lysosomes, thereby preventing cellular senescence. Just as healthy organs are vital to our well-being, healthy …", "url": "https://scitechdaily.com/agings-antidote-the-crucial-role-of-hkdc1-in-keeping-cells-youthful/", "urlToImage": "https://scitechdaily.com/images/Cell-Biology-Art-Concept-1.jpg", "publishedAt": "2024-01-02T14:50:37Z", "content": "Osaka University research highlights the protein HKDC1’s critical role in preserving mitochondria and lysosomes, thus preventing cellular aging and related diseases. This finding opens potential new … [+4279 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Emily Mae Czachor", "title": "Remains of mother who vanished in 2012 found in pond near Disney World, family says - CBS News", "description": "Searchers say the sonar technology used to find Sandra Lemire's remains was not available when she disappeared while driving her grandmother's minivan in 2012.", "url": "https://www.cbsnews.com/news/sandra-lemire-missing-mother-2012-remains-found-pond-disney-world-florida-family/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/01/02/efa1dbfb-79ab-46b4-ae99-dca85de6bf76/thumbnail/1200x630/81ae739fc1fc7f164ffbb83e21dfca1f/sandra-lemire.jpg?v=bc5e97361bb9e6142df5dbc26086568a", "publishedAt": "2024-01-02T14:47:00Z", "content": "A missing woman's remains were finally found in Florida over the weekend, almost 12 years after she disappeared while driving home from a date near Disney World, according to her family.\r\nSandra Lemi… [+3305 chars]"}]}