{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Natasha Lomas", "title": "EU looking into Apple’s decision to kill Epic Games’ developer account - TechCrunch", "description": "The European Union has confirmed it's looking into Apple's decision to close Epic Games' developer account -- citing three separate regulations which may The European Union has confirmed it's looking into Apple's decision to close Epic Games' developer accoun…", "url": "https://techcrunch.com/2024/03/07/apple-epic-dev-account-dma/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/08/fortnite-epic-GettyImages-957063528.jpg?resize=1200,800", "publishedAt": "2024-03-07T10:25:34Z", "content": "The European Union has confirmed it’s looking into Apple’s decision to close Epic Games’ developer account — citing three separate regulations which may apply.\r\nYesterday the Fortnite maker revealed … [+5585 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Dreaming of space? NASA now accepting astronaut applications; Know requirements for signing up - HT Tech", "description": "NASA has announced the opening of applications for aspiring astronauts, offering the chance to participate in missions to the moon and potentially Mars. Know the requirements for signing up for NASA’s space missions.", "url": "https://tech.hindustantimes.com/tech/news/dreaming-of-space-nasa-now-accepting-astronaut-applications-know-requirements-for-signing-up-71709803225872.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/07/1600x900/6_1708610681378_1709803407582.jpg", "publishedAt": "2024-03-07T09:25:26Z", "content": "NASA has called for new astronauts, offering the opportunity to journey to the moon and potentially even Mars! With applications due on April 2, U.S. citizens with a passion for space exploration are… [+2564 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "China’s Mars sample return mission ‘progressing smoothly’ while Nasa struggles - South China Morning Post", "description": "NPC deputy and spacecraft designer Sun Zezhou says key technologies needed for Tianwen-3 mission are ‘in place’ while the US Mars Sample Return programme is battling soaring costs.", "url": "https://www.scmp.com/news/china/science/article/3254491/chinas-mars-sample-return-mission-progressing-smoothly-while-nasa-struggles-behind-schedule", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/03/07/82bc294b-dd03-404c-a51b-2b66cea13774_564f1b29.jpg?itok=x9f298Rh&v=1709790000", "publishedAt": "2024-03-07T06:00:47Z", "content": "One is to retrieve rock samples and then take off from the Martian surface. The second is an in-orbit rendezvous and transfer of the samples to the return capsule. They require our spacecraft to be h… [+2127 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "200-foot asteroid, 3 other asteroids to pass Earth tomorrow, says NASA; Check size, speed and more - HT Tech", "description": "NASA has shed light on as many as four asteroids that are set to pass by Earth tomorrow, March 8. From their speed, and size to distance of approach, know all about these asteroid approaches.", "url": "https://tech.hindustantimes.com/tech/news/200foot-asteroid-3-other-asteroids-to-pass-earth-tomorrow-says-nasa-check-size-speed-and-more-71709785821396.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/07/1600x900/cosmos-7051165_1280_1675313973292_1709785955835.jpg", "publishedAt": "2024-03-07T04:52:10Z", "content": "The last 3 days have been rare, with no asteroid passing by Earth. However, that trend is set to break as NASA has shed light on as many as four asteroids that are set to fly past Earth tomorrow, Mar… [+3017 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "David Propper", "title": "Biotech company reveals breakthrough that could lead to revival of extinct woolly mammoth - New York Post ", "description": "“It will walk like a Woolly Mammoth, look like one, sound like one, but most importantly it will be able to inhabit the same ecosystem previously abandoned by the Mammoth’s extinction,” the company…", "url": "https://nypost.com/2024/03/06/us-news/breakthrough-reached-that-could-lead-to-revival-of-woolly-mammoth/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/03/purchase-order-77834050.jpg?quality=75&strip=all&w=1024", "publishedAt": "2024-03-07T04:08:00Z", "content": "The woolly mammoth could roam the Earth once again.\r\nThats the goal of Colossal Biosciences as the biotech company announced a major breakthrough Wednesday in its mission to revive the 6-ton, 16-foot… [+2633 chars]"}]}