{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Preparation and Assessment of Antimicrobial Effect of Strontium and Copper Co-substituted Hydroxyapatite Nanoparticle-Incorporated Orthodontic Composite: A Preliminary In Vitro Study - Cureus", "description": "Background and aims\r\n\r\nEnamel demineralization and white spot lesions (WSLs) during orthodontic treatment have always been a challenge to orthodontists. The advancement of nanotechnology has paved the way for the incorporation of bioactive compounds in orthod…", "url": "https://www.cureus.com/articles/188622-preparation-and-assessment-of-antimicrobial-effect-of-strontium-and-copper-co-substituted-hydroxyapatite-nanoparticle-incorporated-orthodontic-composite-a-preliminary-in-vitro-study?score_article=true", "urlToImage": "https://assets.cureus.com/uploads/figure/file/756166/article_river_9c9a1a70537811ee8ca481703c387c7a-Screenshot-2023-09-02-at-2.22.45-PM.png", "publishedAt": "2023-10-23T05:52:07Z", "content": "Enter your email address to receive your free PDF download.\r\nPlease note that by doing so you agree to be added to our monthly email newsletter distribution list."}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Debunking Myths: Women Were Prehistoric Hunters, Not Just Gatherers - SciTechDaily", "description": "Team discovered little evidence to support the idea that roles were assigned specifically to each sex. It’s a familiar story to many of us: In prehistoric times, men were hunters and women were gatherers. Women were not physically capable of hunting because t…", "url": "https://scitechdaily.com/debunking-myths-women-were-prehistoric-hunters-not-just-gatherers/", "urlToImage": "https://scitechdaily.com/images/Cave-Painting-Hunters-Art-Concept.jpg", "publishedAt": "2023-10-23T02:05:01Z", "content": "University of Delaware anthropology professor Sarah Lacy has proposed a new theory that challenges the familiar story that labor roles during ancient times were divided by sex and that men evolved to… [+6105 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 Erangel locations in BGMI that can help you win your battle royale - HT Tech", "description": "Discover the top drop spots in BGMI's Erangel map to get a winning edge. Loot, challenges, and strategies await in these areas.", "url": "https://tech.hindustantimes.com/how-to/top-5-erangel-locations-in-bgmi-that-can-help-you-win-your-battle-royale-71698024133717.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/23/1600x900/bgmi_1688345159608_1698024294095.png", "publishedAt": "2023-10-23T01:26:20Z", "content": "Battlegrounds Mobile India (BGMI) players know that Erangel, the iconic map, promises a dynamic and immersive gaming adventure. With diverse terrains and strategic locales, where you land can dictate… [+2532 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Mangalyaan-2 mission: ISRO prepares to embark on journey to Mars after 9 years - HT Tech", "description": "Mangalyaan2 mission ISRO prepares to embark on journey to Mars after 9 years ISRO is planning Mangalyaan2 mission Know what the mission aims to find about the red planet. After the success of Chandrayaan3 and sending AdityaL1 spacecraft to space ISRO is now e…", "url": "https://tech.hindustantimes.com/web-stories/mangalyaan2-mission-isro-prepares-to-embark-on-journey-to-to-mars-after-9-years-71698031728724.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/23/1600x900/gaf95fc8d341ce2_1698032413905_1698032414054.jpg/", "publishedAt": "2023-10-22T22:10:47Z", "content": "Photo Credit: Pixabay\r\n ISRO is planning Mangalyaan-2 mission! Know what the mission aims to find about the red planet.\r\nPhoto Credit: Pixabay\r\n After the success of Chandrayaan-3 and sending Aditya-… [+1668 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4: Know in-depth details about ISRO’s next Lunar mission - HT Tech", "description": "Chandrayaan4 Know indepth details about ISROs next Lunar mission ISRO Indian Space Research Organization and JAXA Japan Aerospace Exploration Agency are collaborating on an ambitious international lunar mission called LUPEX or Chandrayaan4 mission to gather c…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-know-in-depth-details-about-isro-s-next-lunar-mission-71698028355751.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/23/1600x900/moon_pixabay_1698028919405_1698028933833.jpg/", "publishedAt": "2023-10-22T21:14:14Z", "content": "Photo Credit: JAXA\r\n  ISRO (Indian Space Research Organization) and JAXA (Japan Aerospace Exploration Agency) are collaborating on an ambitious international lunar mission called LUPEX or Chandrayaan… [+1950 chars]"}]}