{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Smart rings set to shine with Noise, boAT gizmos as India named world’s largest smartwatch market - HT Tech", "description": "With the smartwatch segment in India now flooded with a plethora of options from several brands, companies like Noise and boAt have introduced a new product - smart rings.", "url": "https://tech.hindustantimes.com/wearables/news/smart-rings-set-to-shine-with-noise-boat-gizmos-as-india-named-world-s-largest-smartwatch-market-71692088569006.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/15/1600x900/smart_ring_1691719620169_1692089300956.jpg", "publishedAt": "2023-08-15T08:49:13Z", "content": "Wearable technology has become extremely popular in the last few years, especially since the emergence of smartwatches. Equipped with various sensors such as heart rate monitor, ECG, SpO2, step and s… [+2946 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Boost your productivity with Microsoft OneNote app, impress your boss - HT Tech", "description": "Microsoft OneNote app is a versatile digital note-taking application designed to streamline the process for you.", "url": "https://tech.hindustantimes.com/tech/news/boost-your-productivity-with-microsoft-onenote-app-impress-your-boss-71692087978421.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/15/1600x900/note_1692088296071_1692088328047.png", "publishedAt": "2023-08-15T08:35:10Z", "content": "In today's fast-paced world, the need to organize, store, and access information efficiently has become extremely important. To solve this problem you can use various digital note-taking apps and one… [+2643 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA clocks Asteroid 2023 PX at 27252 kmph and it is hurtling towards Earth - HT Tech", "description": "An Aten group asteroid is expected to make its closest approach to Earth today, August 15. According to details revealed by NASA, it is already hurtling towards the planet and will pass by very closely!", "url": "https://tech.hindustantimes.com/tech/news/nasa-clocks-asteroid-2023-px-at-27252-kmph-and-it-is-hurtling-towards-earth-71692073902379.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/15/1600x900/asteroid-6149674_640_1686902438536_1692073989855.jpg", "publishedAt": "2023-08-15T04:34:15Z", "content": "Asteroids are space rocks mostly present in the main asteroid belt between the orbits of Mars and Jupiter. Since these bodies are so far, how do NASA and other space agencies track them? Sometimes, i… [+2839 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Best GTA V cheat codes for PC, PS5, and Xbox; Check the list - HT Tech", "description": "When you are stuck at certain points in GTA V, utilizing cheat codes could be your solution. Know these cheat codes and how to activate them on PS5, PC and Xbox.", "url": "https://tech.hindustantimes.com/gaming/news/best-gta-v-cheat-codes-for-pc-ps5-and-xbox-check-the-list-71692071571038.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/08/15/1600x900/_0f3052c8-e4f3-11e9-bf1a-4811dd02bcdc_1692071597480.jpg", "publishedAt": "2023-08-15T03:55:32Z", "content": "GTA V cheat codes: Grand Theft Auto V is played by millions of gamers around the world. Ever since its launch, it has been one of the most played games in the period and is immensely popular. However… [+2147 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Megastorms on Saturn: 100-Year-Long Storms Challenge Our Understanding of Gas Giants - SciTechDaily", "description": "Megastorms leave marks on Saturn’s atmosphere for centuries. Researchers have discovered long-lasting megastorms on Saturn, similar to Jupiter's Great Red Spot, through the study of radio emissions and ammonia gas disruptions. The research uncovers significan…", "url": "https://scitechdaily.com/?p=300492", "urlToImage": "https://scitechdaily.com/images/Radio-Image-of-Saturn-Impact-of-Megastorm.jpg", "publishedAt": "2023-08-15T02:05:56Z", "content": "ByUniversity of California - BerkeleyAugust 14, 2023\r\nDuring its seven-year Solstice Mission, Cassini watched as a huge storm erupted and encircled Saturn. Scientists think storms like this are relat… [+7429 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nanyang Technological University", "title": "New way to read data in antiferromagnets unlocks their use as computer memory - Phys.org", "description": "Scientists led by Nanyang Technological University, Singapore (NTU Singapore) investigators have made a significant advance in developing alternative materials for the high-speed memory chips that let computers access information quickly and that bypass the l…", "url": "https://phys.org/news/2023-08-antiferromagnets-memory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/new-way-to-read-data-i-2.jpg", "publishedAt": "2023-08-14T09:11:10Z", "content": "Scientists led by Nanyang Technological University, Singapore (NTU Singapore) investigators have made a significant advance in developing alternative materials for the high-speed memory chips that le… [+8126 chars]"}]}