{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Shocked by Mysterious Ultra-High-Energy Cosmic Ray – “What the Heck Is Going On?” - SciTechDaily", "description": "Second only to the Oh-My-God particle, the newly dubbed Amaterasu particle deepens the mystery of the origin, propagation and particle physics of rare, ultra-high-energy cosmic rays. In 1991, the University of Utah Fly’s Eye experiment detected the highest-en…", "url": "https://scitechdaily.com/?p=331143", "urlToImage": "https://scitechdaily.com/images/Cosmic-Ray-Strikes-Earth-Concept-Illustration.jpg", "publishedAt": "2023-11-25T09:58:07Z", "content": "ByUniversity of UtahNovember 25, 2023\r\nAstrophysicists at the University of Utah and the Telescope Array have detected cosmic rays with energies beyond theoretical limits, challenging existing unders… [+7148 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "Timsy Jaipuria", "title": "ED conducts search at DLF headquarters in Gurgaon, cross-verifies documents involving Super Tech and Gopal Kan - CNBCTV18", "description": "It has been clarified that the search was not related to DLF's financial accounts. However, ED officials were keen on cross-verifying specific documents concerning land purchases made by DLF from Super Tech and the involvement of Gopal Kanda, a key political …", "url": "https://www.cnbctv18.com/india/ed-conducts-search-dlf-headquarters-gurgaon-super-tech-gopal-kanda-transactions-18410461.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/11/enforcementdirectorate1-1019x573.jpg", "publishedAt": "2023-11-25T07:59:55Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Asit Manohar", "title": "Tata Technologies IPO: GMP jumps after strong subscription status. How to chech allotment, all eyes set on listing date | Mint - Mint", "description": "Tata Technologies IPO GMP today: Shares of the Tata group company are available at a premium of  ₹402 in grey market today", "url": "https://www.livemint.com/market/ipo/tata-technologies-ipo-gmp-jumps-after-strong-subscription-status-how-to-chech-allotment-all-eyes-set-on-listing-date-11700879602279.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/11/25/1600x900/Tata_Technologies_IPO_GMP_subscription_listing_dat_1700879800218_1700879800366.JPG", "publishedAt": "2023-11-25T02:48:39Z", "content": "Tata Technologies IPO: After closure of subscription of the initial public offering (IPO) of Tata Technologies Ltd, all eyes are now set on Tata Technologies IPO allotment date and Tata Technologies … [+3230 chars]"}, {"source": {"id": null, "name": "Azomining.com"}, "author": null, "title": "Mining Equipment in Space: The Future of Extraterrestrial Resource Extraction - AZoMining", "description": "With the resources present on Earth depleting at an alarming rate, scientists have shifted their focus toward space. In this regard, space mining, which involves extracting precious resources, is considered the future. The space mining industry and technology…", "url": "https://www.azomining.com/Article.aspx?ArticleID=1773", "urlToImage": "https://d2c0zrx8qw0prh.cloudfront.net/images/Article_Images/ImageForArticle_1773_17007502858706510.jpg", "publishedAt": "2023-11-23T15:12:00Z", "content": "With the resources present on Earth depleting at an alarming rate, scientists have shifted their focus toward space. In this regard, space mining, which involves extracting precious resources, is con… [+12086 chars]"}]}