{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Scarlett Johansson's AI row has echoes of Silicon Valley's bad old days - BBC.com", "description": "A clash with the actor has echoes of the macho tech giants of the past, says Zoe Kleinman.", "url": "https://www.bbc.com/news/articles/cgrr70zm41mo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/902f/live/86a16540-184c-11ef-baa7-25d483663b8e.png", "publishedAt": "2024-05-22T23:09:11Z", "content": "Move fast and break things is a motto that continues to haunt the tech sector, some 20 years after it was coined by a young Mark Zuckerberg.\r\nThose five words came to symbolise Silicon Valley at its … [+8170 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "iPhone 16 Pro leaks: Larger megapixel count and new reflective technology expected | Mint - Mint", "description": "Rumors hint at iPhone 16 Pro models featuring 48MP ultra-wide cameras with improved macro mode. iPhone 16 Pro Max may have a 5x zoom camera while iPhone 16 Pro may include anti-reflective technology.", "url": "https://www.livemint.com/technology/gadgets/iphone-16-pro-leaks-larger-megapixel-count-and-new-reflective-technology-expected-11716395505142.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/05/22/1600x900/dickson_1714411212227_1716396200057.jpg", "publishedAt": "2024-05-22T16:46:23Z", "content": "With the anticipated launch of the iPhone 16 drawing closer, slated for just a few months away, new leaks and speculations are gaining traction. Production for the iPhone 16 Pro and standard iPhone 1… [+2364 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aria Alamalhodaei", "title": "Boeing, NASA indefinitely delay crewed Starliner launch - TechCrunch", "description": "If you've been looking forward to seeing Boeing’s Starliner capsule carry two astronauts to the International Space Station for the first time, you'll", "url": "https://techcrunch.com/2024/05/22/boeing-nasa-indefinitely-delay-crewed-starliner-launch/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/03/GettyImages-1240755724.jpg?resize=1200,704", "publishedAt": "2024-05-22T14:53:49Z", "content": "If you’ve been looking forward to seeing Boeings Starliner capsule carry two astronauts to the International Space Station for the first time, you’ll have to wait a bit longer.\r\nThe mission, which ha… [+2097 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Rob Thubron", "title": "Snapdragon X Elite-powered Microsoft Surface laptop tests show impressive results, with a caveat - TechSpot", "description": "Signal 65's Ryan Shrout put the Snapdragon X Elite SoC through a series of tests and benchmarks to see if it lives up to the promises Microsoft...", "url": "https://www.techspot.com/news/103096-snapdragon-x-elite-powered-microsoft-surface-laptop-tests.html", "urlToImage": "https://www.techspot.com/images2/news/bigimage/2024/05/2024-05-22-image-4.jpg", "publishedAt": "2024-05-22T10:16:00Z", "content": "In brief: Microsoft made a lot of bold claims about the Snapdragon X Elite-powered latest Surface laptop, including that it's up to 58% faster than Apple's M3 MacBook Air while offering excellent bat… [+2729 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 spectacular images of celestial wonders captured on Hubble Space Telescope shared by NASA - HT Tech", "description": "Top 5 spectacular images of celestial wonders captured on Hubble Space Telescope shared by NASA Explore the cosmos through the lens of the Hubble Space Telescope as NASA shares top 5 images of celestial wonders. From galaxies to auroras each image reveals cap…", "url": "https://tech.hindustantimes.com/web-stories/top-5-spectacular-images-of-celestial-wonders-captured-on-hubble-space-telescope-shared-by-nasa-71716285192689.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/21/1600x900/Top_5_spectacular_images_of_celestial_wonders__1716285350597_1716285350970.jpg/", "publishedAt": "2024-05-21T10:00:50Z", "content": "Photo Credit: Pixabay\r\n Explore the cosmos through the lens of the Hubble Space Telescope as NASA shares top 5 images of celestial wonders. From galaxies to auroras, each image reveals captivating in… [+1675 chars]"}]}