{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Milestone Achieved in Unraveling the Universe's Fundamental Forces at the Large Hadron Collider - SciTechDaily", "description": "Researchers at the University of Rochester, working with the CMS Collaboration at CERN, have made significant advancements in measuring the electroweak mixing angle, enhancing our understanding of the Standard Model of Particle Physics. Their work helps expla…", "url": "https://scitechdaily.com/milestone-achieved-in-unraveling-the-universes-fundamental-forces-at-the-large-hadron-collider/", "urlToImage": "https://scitechdaily.com/images/CERN-CMS-Detector.jpg", "publishedAt": "2024-06-30T16:11:32Z", "content": "Building on their extensive involvement at CERN, the University of Rochester team recently achieved “incredibly precise” measures of the electroweak mixing angle, a crucial component of the Standard … [+5725 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Weekly Tech Recap: Meta AI makes India debut, Google Translate adds support for 7 new Indian languages and more | Mint - Mint", "description": "Weekly Tech Recap: Meta AI assistant launched in India, Google Translate adds support for including 7 new Indian languages, OpenAI announces work on CriticGPT language model and more", "url": "https://www.livemint.com/technology/tech-news/weekly-tech-recap-meta-ai-makes-india-debut-google-translate-adds-support-for-7-new-indian-languages-and-more-11719738492686.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/06/30/1600x900/Europe-Meta-0_1716177717040_1719742094699.jpg", "publishedAt": "2024-06-30T10:12:17Z", "content": "In hustle and bustle of daily life, it can be hard to stay up to date with all the latest happenings around you. But fear not! We have got you covered with a roundup of top news stories that made wav… [+5153 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Exclusive: Gemini's data-analyzing abilities aren't as good as Google claims - TechCrunch", "description": "New research shows that Google might be overstating its generative AI's ability to reason over long documents.", "url": "https://techcrunch.com/2024/06/29/geminis-data-analyzing-abilities-arent-as-good-as-google-claims/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/02/GettyImages-1998277195-1.jpg?resize=1200,800", "publishedAt": "2024-06-29T22:30:00Z", "content": "One of the selling points of Google’s flagship generative AI models, Gemini 1.5 Pro and 1.5 Flash, is the amount of data they can supposedly process and analyze. In press briefings and demos, Google … [+8344 chars]"}]}