{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "SpaceX Dragon Docks to Station With Crucial Supplies and Science Cargo - SciTechDaily", "description": "While the International Space Station was traveling more than 262 miles over central Brazil on November 11, a SpaceX Dragon cargo spacecraft autonomously docked to the station’s Harmony module at 5:07 a.m. EST, with NASA astronauts Jasmin Moghbeli and Loral O…", "url": "https://scitechdaily.com/spacex-dragon-docks-to-station-with-crucial-supplies-and-science-cargo/", "urlToImage": "https://scitechdaily.com/images/Space-Station-Viewed-From-Approaching-SpaceX-Dragon-Cargo-Craft.jpg", "publishedAt": "2023-11-12T09:02:10Z", "content": "ByNASANovember 12, 2023\r\nThe station is viewed from the approaching SpaceX Dragon cargo spacecraft. The SpaceX Dragon Endurance crew spacecraft is pictured docked at center top. Credit: NASA TV\r\nWhil… [+8657 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "GTA 6 trailer announcement sparks frenzy about release window - HT Tech", "description": "After a two-year wait, GTA 6 trailer reveal period has been released officially by Rockstar. Now, leaks are hinting at a potential 2025 release window.", "url": "https://tech.hindustantimes.com/gaming/news/gta-6-trailer-announcement-sparks-frenzy-about-release-window-71699778861691.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/12/1600x900/GTA_1699779244175_1699779244408.png", "publishedAt": "2023-11-12T08:56:30Z", "content": "Anticipation has been building for nearly two years since Rockstar Games first confirmed the development of GTA 6 in February 2022, following a wave of leaked gameplays from an early build of the gam… [+1933 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Worried about your child’s screen time? Check how to turn on the iPhone Communication Safety feature - HT Tech", "description": "Are you concerned about your child's safety in terms of what kind of content he or she is viewing? Know how to benefit from the iPhone’s Communication Safety feature.", "url": "https://tech.hindustantimes.com/how-to/worried-about-your-child-s-screen-time-check-how-to-turn-on-the-iphone-communication-safety-feature-71699537551898.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/09/1600x900/iPhone_1698495478701_1699537587919.jpg", "publishedAt": "2023-11-12T08:17:39Z", "content": "Nowadays, parents' biggest concern about their children is the increasing screen time and the type of content they are exposed to on the internet and social media platforms. To solve the problem, App… [+2106 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Phones under 20000: Grab the top brands from Poco to Vivo with these advanced features - HT Tech", "description": "Looking for a new smartphone, but don't want to break the bank? Discover the top 5 budget phones under 20000 packed with advanced features for an immersive and powerful experience.", "url": "https://tech.hindustantimes.com/mobile/news/phones-under-20000-grab-the-top-brands-from-poco-to-vivo-with-these-advanced-features-71699775926297.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/12/1600x900/Phones_1699776388443_1699776388754.jpg", "publishedAt": "2023-11-12T08:07:31Z", "content": "Are you looking for a new smartphone but don't want to break the bank? Look no further than the budget-friendly smartphone market. In the realm of smartphones, the 20000 budget segment opens up a tre… [+2533 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Scientists develop yeast with 50% synthetic DNA - ThePrint", "description": "Scientists have managed to sysnthsise 50 per cent of the DNA of yeasts in lab, an advance that could lead to the development of a new biotechnology platform ...", "url": "https://www.youtube.com/watch?v=AybV11fZM9s", "urlToImage": "https://i.ytimg.com/vi/AybV11fZM9s/maxresdefault.jpg", "publishedAt": "2023-11-12T05:30:05Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Surprise! Oxygen detected on Venus in huge quantities on this hellish planet - HT Tech", "description": "German astronomers have uncovered a surprising twist in Venus's atmosphere, detecting oxygen on both day and night sides. This unexpected find challenges our understanding of the planet's composition.", "url": "https://tech.hindustantimes.com/tech/news/surprise-oxygen-detected-on-venus-in-huge-quantities-on-this-hellish-planet-71699765596682.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/12/1600x900/Venus_mission_1698405663494_1699765850889.jpg", "publishedAt": "2023-11-12T05:13:47Z", "content": "In a surprising twist, German astronomers have uncovered the presence of oxygen in Venus's atmosphere, challenging the conventional understanding of the planet's composition. The revelation, which sp… [+2833 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "BGMI tips: The top 5 high-damage guns in Battlegrounds Mobile India - HT Tech", "description": "Uncover the firepower behind big victories in Battlegrounds Mobile India! Explore the top 5 high-damage guns, from the game-altering AWM to the versatile MK14, shaping the battleground dynamics. Check out these BGMI tips.", "url": "https://tech.hindustantimes.com/how-to/bgmi-tips-the-top-5-high-damage-guns-in-battlegrounds-mobile-india-71699758076130.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/12/1600x900/BGMI_1699758250218_1699758250889.png", "publishedAt": "2023-11-12T03:04:47Z", "content": "In the relentless world of Battlegrounds Mobile India (BGMI), where survival is key, the choice of weaponry can make or break a player's fate. In this Battle Royale game, the damage output of guns of… [+2389 chars]"}]}