{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "HUGE Sunspot facing Earth! Set to trigger solar storms, Auroras - HT Tech", "description": "Earth could face the risk of solar storms after huge sunspot spotted on the Sun which is facing Earth! Here’s more about it.", "url": "https://tech.hindustantimes.com/tech/news/huge-sunspot-facing-earth-set-to-trigger-solar-storms-auroras-71656308543057.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/27/1600x900/latest_1024_hmiic_0_1655873854647_1656308616440.jpg", "publishedAt": "2022-06-27T05:44:46Z", "content": "A massive sunspot on the face of our Sun is facing the Earth and it could pose a big solar storm threat. Although solar storms do not cause any harm directly to people on Earth, they can knockout ele… [+1834 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Recharge with BSNL 107 prepaid plan and get 50 days validity, 3GB data, free Tunes - HT Tech", "description": "If you have a BSNL SIM card, you can get it recharged with Rs. 107 prepaid plan to enjoy several benefits. Check details here.", "url": "https://tech.hindustantimes.com/tech/news/recharge-with-bsnl-107-prepaid-plan-and-get-50-days-validity-3gb-data-free-tunes-71656306637332.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/27/1600x900/Untitled_design_(26)_1656307105730_1656307132277.png", "publishedAt": "2022-06-27T05:23:47Z", "content": "Which company's mobile SIM do you use? BSNL, Jio, Airtel, or Vodafone Idea? Telecom companies have a long list of recharge plans which will not cost your pocket much. If you are a BSNL user, you shou… [+2129 chars]"}, {"source": {"id": null, "name": "Nasilemaktech.com"}, "author": "https://www.facebook.com/KokiYaps, https://www.facebook.com/KokiYaps", "title": "Review - Black Shark 5 Pro: Difficult choice to make - Nasi Lemak Tech", "description": "This video won't be a review of the Black Shark 5 Pro only, but we're also going to compare it a little with the Black Shark 5. I think that Black Shark did such a good job in making the Black Shark 5, why should you pay extra to get the Black Shark 5 Pro?", "url": "https://nasilemaktech.com/review-black-shark-5-pro/", "urlToImage": "https://i0.wp.com/nasilemaktech.com/wp-content/uploads/2022/06/Black-Shark-5-Pro-review-00020.jpg", "publishedAt": "2022-06-27T04:00:40Z", "content": "This video won’t be a review of the Black Shark 5 Pro only, but we’re also going to compare it a little with the Black Shark 5. I think that Black Shark did such a good job in making the Black Shark … [+6247 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Poco F4 5G, Realme C30 to go on sale today; Check price, offers and more - HT Tech", "description": "Recently launched Poco F4 5G and Realme C30 will go on sale today. Flipkart is offering discounts, exchange, and bank offers on the phones. Check details here.", "url": "https://tech.hindustantimes.com/mobile/news/poco-f4-5g-realme-c30-to-go-on-sale-today-check-price-offers-and-more-71656301247308.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/06/27/1600x900/Untitled_design_(25)_1656301320692_1656301365513.png", "publishedAt": "2022-06-27T03:51:00Z", "content": "You will now be able to purchase the two recently launched smartphones- Poco F4 5G, and Realme C30 on Flipkart that too by grabbing exciting offers and deals. Both Poco F4 5G and Realme C30 will go o… [+2416 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Nuclear Power on Moon, Changing Mars Landscape, Black Space Explorers - SciTechDaily", "description": "Looking to power surface exploration on the Moon … New imagery from the surface of Mars …. And our newest flight directors … a few of the stories to tell you about – This Week at NASA! https://youtu.be/c6vpK46pAHo NASA Announces Artemis Concept Awards for Nuc…", "url": "https://scitechdaily.com/this-week-nasa-nuclear-power-on-moon-changing-mars-landscape-black-space-explorers/", "urlToImage": "https://scitechdaily.com/images/This-Week-NASA-Nuclear-Power-on-Moon.gif", "publishedAt": "2022-06-27T03:12:15Z", "content": "ByNASAJune 26, 2022\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succeeded the National Advisor… [+5260 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "https://www.facebook.com/malewar.amit", "title": "Strange star survived the thermonuclear supernova - Tech Explorist", "description": "It actually became even brighter after a supernova.", "url": "https://www.techexplorist.com/strange-star-survived-thermonuclear-supernova/52124/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/06/Galaxy-NGC-1309.jpg", "publishedAt": "2022-06-26T18:00:14Z", "content": "A supernova is the cataclysmic explosion of a star. A thermonuclear supernova explosion of a white dwarf is supposed to be the terminal event in the life of its progenitor star.\r\nThese thermonuclear … [+4899 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom extends stage 4 load shedding – here is the new schedule - BusinessTech", "description": "Unlawful industrial action at various Eskom power stations has impacted planned maintenance and repairs, and at some stations, the full complement of workers has not reported for duty. As a result, stage 4 load shedding will continue to be implemented, says E…", "url": "https://businesstech.co.za/news/energy/600282/eskom-extends-stage-4-load-shedding-here-is-the-new-schedule/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Eskom.jpg", "publishedAt": "2022-06-26T13:55:33Z", "content": "Unlawful industrial action at various Eskom power stations has impacted planned maintenance and repairs, and at some stations, the full complement of workers has not reported for duty. As a result, s… [+2816 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "From Windows 98 to Mars 2022: Major Upgrade for 19-Year-Old Martian Water-Spotter - SciTechDaily", "description": "The MARSIS instrument on the European Space Agency’s Mars Express spacecraft, famous for its role in the discovery of signs of liquid water on the Red Planet, is receiving a major software upgrade that will allow it to see beneath the surfaces of Mars and its…", "url": "https://scitechdaily.com/from-windows-98-to-mars-2022-major-upgrade-for-19-year-old-martian-water-spotter/", "urlToImage": "https://scitechdaily.com/images/Mars-Express-Spacecraft-scaled.jpg", "publishedAt": "2022-06-26T10:26:00Z", "content": "ByEuropean Space Agency (ESA)June 26, 2022\r\nArtists impression of Mars Express. The background is based on an actual image of Mars taken by the spacecrafts high resolution stereo camera. Credit: Spac… [+5732 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa is seeing a big increase in international travel – here are the visa changes you should know - BusinessTech", "description": "The opening of international borders, relaxation of travel restrictions, resumption of international flights, widespread vaccination and reopening of in-campus classes by overseas universities are the major contributors to the increase in outbound traffic fro…", "url": "https://businesstech.co.za/news/lifestyle/598796/south-africa-is-seeing-a-big-increase-in-international-travel-heres-are-the-visa-changes-you-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/Passport.jpg", "publishedAt": "2022-06-26T05:00:58Z", "content": "The opening of international borders, relaxation of travel restrictions, resumption of international flights, widespread vaccination and reopening of in-campus classes by overseas universities are th… [+4886 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Combine the Power of 64 Telescopes To Observe the Structure of the Universe - SciTechDaily", "description": "An international team of astronomers has combined the power of 64 radio telescope dishes for the first time to detect the faint signatures of neutral hydrogen gas across cosmological scales. The feat was achieved using the South African-based MeerKAT telescop…", "url": "https://scitechdaily.com/astronomers-combine-the-power-of-64-telescopes-to-observe-the-structure-of-the-universe/", "urlToImage": "https://scitechdaily.com/images/MeerKAT-Telescope-scaled.jpg", "publishedAt": "2022-06-25T18:29:38Z", "content": "South Africas MeerKAT telescope. Credit: South African Radio Astronomy Observatory (SARAO)\r\nAn international team of astronomers has combined the power of 64 radio telescope dishes for the first time… [+4492 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "15 fuel-efficient cars, bakkies and SUVs you can buy in South Africa right now - BusinessTech", "description": "With the seemingly never-ending fuel price increases, consumers continue to search for ways to minimise monthly costs. This has translated into an influx of requests from customers looking for fuel-efficient cars, says vehicle retailer WeBuyCars.", "url": "https://businesstech.co.za/news/motoring/599592/15-fuel-efficient-cars-bakkies-and-suvs-you-can-buy-in-south-africa-right-now/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/WeBuyCars-scaled-e1639489495790.jpg", "publishedAt": "2022-06-25T15:06:54Z", "content": "With the seemingly never-ending fuel price increases, consumers continue to search for ways to minimise monthly costs. This has translated into an influx of requests from customers looking for fuel-e… [+1920 chars]"}]}