{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "Market Trading Guide: Tata Motors among 7 stock recommendations for Monday - Stock Ideas - The Economic Times", "description": "Indian equity markets ended lower on Friday, dragged by information technology and bank stocks, with the BSE Sensex falling 0.2% to 66,282, while its NSE counterpart Nifty50 closed just above the 19,750 level.  The positive chart pattern like higher tops and …", "url": "https://economictimes.indiatimes.com/markets/stocks/news/market-trading-guide-tata-motors-among-7-stock-recommendations-for-monday/stock-ideas/slideshow/104441175.cms", "urlToImage": "https://img.etimg.com/thumb/msid-104441175,width-1070,height-580,overlay-etmarkets/photo.jpg", "publishedAt": "2023-10-15T09:25:37Z", "content": "Target Price: Rs 700-720Stop Loss: Rs 660The stock has experienced a fresh breakout from a sideways consolidation pattern, marked by a sharp increase in volumes on both smaller and larger time frames… [+314 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Sayan Ghosh", "title": "The Quickest Way to Hydrate: Is It Effective? - Sportskeeda", "description": "Even though there are quite a lot of effective hydration techniques that you may be aware of, the quickest way to hydrate is drinking water.", "url": "https://www.sportskeeda.com/health-and-fitness/the-quickest-way-hydrate-is-it-effective", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/10/6a893-16973190429091-1920.jpg", "publishedAt": "2023-10-15T03:41:00Z", "content": "Even though there are quite a lot of effective hydration techniques that you may be aware of, the quickest way to hydrate is drinking water. Your body absorbs it quickly, offering instant relief if y… [+4158 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "mint", "title": "Q2 Results outlook: After TCS, Infosys and HCL Tech, here is what to expect from India Inc's scorecard | Mint - Mint", "description": "Q2 Earnings: Q1FY24 results exceed expectations with 30% Nifty PAT growth. Q2FY24 expected to continue the positive trend with 21% YoY growth, says Vinod Nair of Geojit Financial Services", "url": "https://www.livemint.com/companies/company-results/q2-results-outlook-after-tcs-infosys-and-hcl-tech-here-is-what-to-expect-from-india-incs-scorecard-11697333050000.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/10/15/1600x900/An-NRE-account-can-be-used-to-transfer-foreign-ear_1695316125542_1697335283706.jpg", "publishedAt": "2023-10-15T02:03:05Z", "content": "Q2 Results Outlook: In the struggle of a global economic slowdown, India is witnessing a stroke of fortune. Post initial hurdles, the outlook for FY24 is poised for a gradual, yet promising, transfor… [+4488 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Richard Waters, Arjun Neil Alim", "title": "How Brad Smith used Microsoft's $1bn law and lobbying machine to win Activision battle - Financial Times", "description": "Company’s top legal officer has honed diplomatic skills to recast the US tech giant’s reputation", "url": "https://www.ft.com/content/07c507bd-2ce7-4345-85bd-0c27f408afbe", "urlToImage": null, "publishedAt": "2023-10-14T12:00:05Z", "content": "What is included in my trial?\r\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\r\nStandard Digital includ… [+1494 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Know how to create AI images with Google search using text descriptions - HT Tech", "description": "Google Search now lets you create AI images by typing a description. Know how to bring your ideas to life.", "url": "https://tech.hindustantimes.com/tech/news/know-how-to-create-ai-images-with-google-search-using-text-descriptions-71697281904884.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/14/1600x900/Google_1697282156894_1697282157224.jpg", "publishedAt": "2023-10-14T11:17:42Z", "content": "In the world of AI, generating images from words has become quite a trend. You might have heard of tools like DALL-E and Midjourney, which turn text into pictures. Well, Google, the search giant, is … [+1605 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Signal Acquired! NASA's Psyche Spacecraft Begins Its Epic Journey of Discovery - SciTechDaily", "description": "The Psyche spacecraft, headed to the asteroid Psyche, has successfully initiated its solar-powered propulsion. During its six-year journey, it will utilize advanced optical communication via NASA's DSOC and is expected to orbit the asteroid by 2029. Psyche mi…", "url": "https://scitechdaily.com/signal-acquired-nasas-psyche-spacecraft-begins-its-epic-journey-of-discovery/", "urlToImage": "https://scitechdaily.com/images/NASA-Psyche-Spacecraft-Illustration.jpg", "publishedAt": "2023-10-14T07:36:57Z", "content": "ByNASAOctober 14, 2023\r\nNASAs Psyche spacecraft has begun its journey to the asteroid Psyche, believed to be an exposed planetary core in the asteroid belt. Through this mission, NASA aims to study t… [+3552 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Zeeshan Khan", "title": "Battlegrounds Mobile India (BGMI) vertical recoil guide for October 2023 - Sportskeeda", "description": "Vertical recoil control is critical for maintaining accuracy during intense firefights in BGMI, and excelling in the game requires a comprehensive command of this technique.", "url": "https://www.sportskeeda.com/bgmi/battlegrounds-mobile-india-bgmi-vertical-recoil-guide-october-2023", "urlToImage": "https://staticg.sportskeeda.com/editor/2023/10/7bf8d-16972599166683-1920.jpg", "publishedAt": "2023-10-14T06:07:05Z", "content": "Vertical recoil control is critical for maintaining accuracy during intense firefights in BGMI, and excelling in the game requires a comprehensive command of this technique. Due to the title's freque… [+3326 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X", "title": "Scientists begin building AI for scientific discovery using tech behind ChatGPT - Tech Xplore", "description": "An international team of scientists, including from the University of Cambridge, have launched a new research collaboration that will leverage the same technology behind ChatGPT to build an AI-powered tool for scientific discovery.", "url": "https://techxplore.com/news/2023-10-scientists-ai-scientific-discovery-tech.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/particle-graphic.jpg", "publishedAt": "2023-10-13T15:13:38Z", "content": "An international team of scientists, including from the University of Cambridge, have launched a new research collaboration that will leverage the same technology behind ChatGPT to build an AI-powere… [+5474 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Caterpillars Chubby Legs May Have Evolved From Crabs - Technology Networks", "description": "The existence of extra legs in caterpillars has long posed an evolutionary mystery to biologists. A recent study by researchers from the National University of Singapore (NUS) linked this novel trait to crustaceans.", "url": "https://www.technologynetworks.com/genomics/news/caterpillars-chubby-legs-may-have-evolved-from-crabs-379876", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/379876/caterpillars-chubby-legs-may-have-evolved-from-crabs-379876-640x360.jpg?cb=20231013", "publishedAt": "2023-10-13T15:10:13Z", "content": "Adult insects, including butterflies and moths, typically have only three pairs of legs. But the existence of extra legs in caterpillars chubby abdominal appendeages also known as prolegs has long po… [+2953 chars]"}]}