{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Alphabet won’t talk about the Google-Apple AI deal, even to investors - TechCrunch", "description": "Alphabet CEO skipped an analyst's question about Apple on the company's earnings call.", "url": "https://techcrunch.com/2026/02/04/alphabet-wont-talk-about-the-google-apple-ai-deal-even-to-investors/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2026/02/imgi_38_mp840x830mattef8f8f8t-pad1000x1000f8f8f8.jpg?w=1000", "publishedAt": "2026-02-04T23:28:31Z", "content": "Alphabet declined to answer one of its investors during questions about Google’s AI deal with Apple on Wednesday’s fourth-quarter earnings call. Instead of responding to an analyst’s question about h… [+2288 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lucas Ropek", "title": "The Wayback Machine debuts a new plug-in designed to fix the internet's broken links problem - TechCrunch", "description": "Should a linked web page go offline, the new feature will then redirect readers to the archived versions, so that there is no drop in service. The tool also archives a user's own posts, helping to ensure their longevity.", "url": "https://techcrunch.com/2026/02/04/the-wayback-machine-debuts-a-new-plugin-designed-to-fix-the-internets-broken-links-problem/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/GettyImages-114847550.jpg?resize=1200,780", "publishedAt": "2026-02-04T22:27:12Z", "content": "The Internet Archive is a nonprofit that as you might expect is devoted to archiving the internet and preserving digital context for future generations. This week, the platform announced a new tool d… [+1915 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Shona Ghosh, Daniel Basteiro", "title": "Europe Takes On Tech With Social Media Bans and Paris Raid on X - Bloomberg", "description": "European countries are taking their broadest swipe yet at social media, with a growing number weighing bans of the services for minors and setting the stage for a new showdown with some of the biggest US companies.", "url": "https://www.bloomberg.com/news/articles/2026-02-04/europe-takes-on-tech-with-social-media-bans-and-paris-raid-on-x", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iJ_LQv.RQgcQ/v1/1200x800.jpg", "publishedAt": "2026-02-04T15:21:44Z", "content": "European countries are taking their broadest swipe yet at social media, with a growing number weighing bans of the services for minors and setting the stage for a new showdown with some of the bigges… [+371 chars]"}]}