{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire MAX Redeem Codes for April 21: Don't miss out on VSS and Groza - Heartseeker - HT Tech", "description": "Weekend is almost here and there are several rewards waiting for the Garena Free Fire MAX players. Here is what you can claim and how. Image Caption: From latest redeem codes to rewards- here is all you need to know.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-max-redeem-codes-for-april-21-don-t-miss-out-on-vss-and-groza-heartseeker-71682040835640.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/21/1600x900/048_1654217194104_1682040878911.jpg", "publishedAt": "2023-04-21T01:38:39Z", "content": "Garena Free Fire MAX redeem codes for April 21, 2023: The weekend is almost here and Garena Free Fire is ready with several events for its players. This weekend Free Fire players can get the Grenade-… [+2218 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Wonder Material Graphene Stuns Again: Shatters Magnetoresistance Records - SciTechDaily", "description": "Researchers at The University of Manchester have discovered record-high magnetoresistance in graphene, offering potential breakthroughs in understanding strange metals and applications in magnetic sensors. In a paper published in the journal Nature on April 1…", "url": "https://scitechdaily.com/?p=269286", "urlToImage": "https://scitechdaily.com/images/Abstract-Hex-Graphene-Energy-Concept.jpg", "publishedAt": "2023-04-20T23:53:57Z", "content": "ByUniversity of ManchesterApril 20, 2023\r\nIn a recent publication in Nature, researchers have discovered record-high magnetoresistance in graphene under ambient conditions. The team utilized high-qua… [+6804 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Gut bacteria could be responsible for dampening our immune response to COVID-19 vaccine - News-Medical.Net", "description": "Gut bacteria that break down a sugar called fucose could be dampening our immune response to the COVID-19 mRNA vaccine, according to a study led by researchers from the Okinawa Institute of Science and Technology.", "url": "https://www.news-medical.net/news/20230420/Gut-bacteria-could-be-responsible-for-dampening-immune-response-to-COVID-19-mRNA-vaccine.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg", "publishedAt": "2023-04-20T23:02:00Z", "content": "Gut bacteria that break down a sugar called fucose could be dampening our immune response to the COVID-19 mRNA vaccine, according to a study led by researchers from the Okinawa Institute of Science a… [+3553 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Kyle Wiggers", "title": "Google consolidates AI research divisions into Google DeepMind - TechCrunch", "description": "Google is consolidating several of its AI research divisions into one, Google DeepMind, as it seeks new AI breakthroughs.", "url": "https://techcrunch.com/2023/04/20/google-consolidates-ai-research-divisions-into-google-deepmind/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/01/GettyImages-1243527327.jpg?resize=1200,800", "publishedAt": "2023-04-20T18:00:00Z", "content": "As Google looks to maintain pace in AI with the rest of the tech giants, it’s consolidating its AI research divisions.\r\nGoogle today announced Google DeepMind, a new unit made up of the DeepMind team… [+5101 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Double asteroid flyby today! 2 monster rocks speeding towards Earth, warns NASA - HT Tech", "description": "NASA warned that two bus-sized asteroids are approaching Earth. Should you worry? Know what the space agency said.", "url": "https://tech.hindustantimes.com/tech/news/double-asteroid-flyby-today-2-monster-rocks-speeding-towards-earth-warns-nasa-71681977434559.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/20/1600x900/asteroid_wiki_media_1679805029207_1681977611929.jpg", "publishedAt": "2023-04-20T08:01:25Z", "content": "A number of asteroids pass close to the Earth almost every day, but only a few of them pose risk to humanity. Today, NASA has issued a warning that two dangerous asteroids are ready to make their clo… [+1944 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Low Light Photography Tips to stand out of the crowds with Samsung Galaxy S23 Ultra! - TechNave", "description": "If you only used the Auto Night Mode all this time, you got to try on the Pro Mode and ExpertRAW mode!🔥 Here are some tips and pictures we took out of it📸#...", "url": "https://www.youtube.com/watch?v=K_U6c9b0rRg", "urlToImage": "https://i.ytimg.com/vi/K_U6c9b0rRg/maxresdefault.jpg", "publishedAt": "2023-04-20T04:00:09Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm ALERT! Massive CME clouds, triggered by magnetic filaments on the Sun, can strike the Earth today - HT Tech", "description": "NOAA forecasters have revealed that the Earth can be hit by a CME cloud today, April 20. Know how dangerous this solar storm is likely to be.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-alert-massive-cme-clouds-triggered-by-magnetic-filaments-on-the-sun-can-strike-the-earth-today-71681961741217.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/20/1600x900/Sun_and_the_sea_1681961926459_1681961933380.jpg", "publishedAt": "2023-04-20T03:42:34Z", "content": "In the last two days, we have been discussing the potential danger of these magnetic filaments which have appeared on the Sun. For the unaware, a magnetic filament is a large stream of plasma and mag… [+2239 chars]"}]}