{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers develop simple blood test to quickly diagnose sarcoidosis - ETHealthWorld", "description": "The technique, which uses a simple blood test, may allow for the selective use of more intrusive diagnostic tests that are commonly employed to identify the disease. The results were reported in the American Journal of Respiratory and Critical Care Medicine.", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-develop-simple-blood-test-to-quickly-diagnose-sarcoidosis/108101792", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-108101792,imgsize-55658,width-1200,height=765,overlay-ethealth/industry/researchers-develop-simple-blood-test-to-quickly-diagnose-sarcoidosis.jpg", "publishedAt": "2024-02-29T08:49:35Z", "content": "Los Angeles: A study has created a tool for rapidly and inexpensively diagnosing sarcoidosis, a chronic inflammatory disease characterised by the formation of tiny lumps known as granulomas in the lu… [+2543 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "YouTube’s Create app, a competitor to TikTok’s creative tools, expands to 13 more markets - TechCrunch", "description": "YouTube Create, Google's standalone mobile app aimed at creators, which helps them produce both Shorts and longer videos, is expanding to a broader set of", "url": "https://techcrunch.com/2024/02/28/youtubes-create-app-a-competitor-to-tiktoks-creative-tools-expands-to-13-more-markets/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2023/09/Screenshot-2023-09-21-at-10.50.13-AM.jpg?w=1186", "publishedAt": "2024-02-28T16:25:03Z", "content": "YouTube Create, Google’s standalone mobile app aimed at creators, which helps them produce both Shorts and longer videos, is expanding to a broader set of markets after last fall’s launch into beta t… [+2252 chars]"}, {"source": {"id": null, "name": "Xm.com"}, "author": null, "title": "Intuitive Machines says moon lander collecting data as it continues to generate power - XM", "description": "The XM Research Desk, manned by market expert professionals, provides live daily updates on all the major events of the global markets in the form of market reviews, forex news, technical analysis, investment topics, daily outlook and daily videos.", "url": "https://www.xm.com/research/markets/allNews/reuters/intuitive-machines-says-moon-lander-collecting-data-as-it-continues-to-generate-power-53776949", "urlToImage": "https://cloud.xm-cdn.com/static/xm/common/logos/XM-logo.jpg", "publishedAt": "2024-02-28T14:32:12Z", "content": "What are Cookies?\r\nCookies are small data files. When you visit a website, the website sends the cookie to your computer. Your computer stores it in a file located inside your web browser.\r\nCookies d… [+3361 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says 120-foot asteroid will pass Earth by just 5.2 mn km; Know how fast it is moving - HT Tech", "description": "A Near-Earth Asteroid has been tracked in its orbit and it will come as close as 5.2 million kilometers to Earth today, February 28, NASA has revealed. Know all about this close encounter with the asteroid.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-120-foot-asteroid-will-pass-earth-by-just-5-2-mn-km-know-how-fast-it-is-moving-71709091967514.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/02/28/1600x900/space-1422642_1280_1697709461480_1709092040592.jpg", "publishedAt": "2024-02-28T03:52:38Z", "content": "Like previous months, February has witnessed multiple asteroid approaches. While an asteroid did not pass Earth yesterday, NASA says that two asteroids will come close to the planet today, February 2… [+1954 chars]"}]}