{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Safe, Low-Cost, and Effective Smoking Cessation Treatment - SciTechDaily", "description": "A recent study demonstrates the safety and effectiveness of cytisine. According to a recent study published in the Journal of Thoracic Oncology, cytisine may be a safe and effective smoking cessation treatment in lung cancer screening volunteers. Since the 19…", "url": "https://scitechdaily.com/a-safe-low-cost-and-effective-smoking-cessation-treatment/", "urlToImage": "https://scitechdaily.com/images/Woman-Quit-Smoking-Cigarettes-Concept.jpg", "publishedAt": "2022-09-18T19:29:09Z", "content": "The researchers found that cytisine, a partial agonist-binding nicotine acetylcholine receptor, is a promising cessation intervention.\r\nA recent study demonstrates the safety and effectiveness of cyt… [+2571 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Forget hardware, Google wants user data, Pixelbook laptops to Pixel phone notwithstanding - HT Tech", "description": "Yes, Google does make hardware and we have seen them in the form of Pixelbook or Pixel phones, but hardware is just not central to the big profit picture that Google is actually painting.", "url": "https://tech.hindustantimes.com/tech/news/forget-hardware-google-wants-user-data-pixelbook-laptops-to-pixel-phone-notwithstanding-71663527701552.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/18/1600x900/FILES-FRANCE-EU-US-INTERNET-COURT-GOOGLE-0_1663528324984_1663528324984_1663528349311_1663528349311.jpg", "publishedAt": "2022-09-18T19:14:20Z", "content": "Yes, Google does make hardware and we have seen them in the form of Pixelbook, Pixel phones or even Chromebooks, but hardware is just not central to the big profit picture that Google is actually pai… [+2875 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can We Live Longer? Physicist’s Breakthrough Discovery in Genetic Protective Layer - SciTechDaily", "description": "Researchers have discovered a new structure of telomeric DNA with the aid of physics and a tiny magnet. Telomeres are seen by many scientists as the key to living longer. They protect genes from damage but get a bit shorter each time a cell divides. If they b…", "url": "https://scitechdaily.com/can-we-live-longer-physicists-breakthrough-discovery-in-genetic-protective-layer/", "urlToImage": "https://scitechdaily.com/images/Telomeres-DNA-Genetics-Illustration.jpg", "publishedAt": "2022-09-18T15:46:21Z", "content": "ByLeiden UniversitySeptember 18, 2022\r\nResearchers have discovered a new structure of telomeric DNA, which could be key to living longer.\r\nResearchers have discovered a new structure of telomeric DNA… [+4787 chars]"}, {"source": {"id": null, "name": "Space Daily"}, "author": null, "title": "Researchers pioneer new technique that could help determine habitability of planets - Space Daily", "description": "Tempe AZ (SPX) Sep 18, 2022 - \r\nOur sun is surrounded by multi-million-degree plasma called the corona, beautifully visible during a total solar eclipse. \r\n\r\nAbout once a day, a magnetic explosion on the sun will send a chunk of", "url": "https://www.spacedaily.com/reports/Researchers_pioneer_new_technique_that_could_help_determine_habitability_of_planets_999.html", "urlToImage": "https://www.spxdaily.com/images-hg/sun-stellar-flares-stars-exoplanets-hg.jpg", "publishedAt": "2022-09-18T14:32:15Z", "content": "Our sun is surrounded by multi-million-degree plasma called the corona, beautifully visible during a total solar eclipse.\r\nAbout once a day, a magnetic explosion on the sun will send a chunk of the c… [+6747 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Singapore and India to partner in fintech innovations - CNA", "description": "The Monetary Authority of Singapore (MAS) and India’s International Financial Services Centres Authority (IFSCA) signed an agreement on Sunday (Sep 18) to facilitate regulatory collaboration and partnership in fintech.  The agreement will promote regulatory s…", "url": "https://www.channelnewsasia.com/singapore/mas-india-partner-fintech-innovations-dpm-lawrence-wong-2947081", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--ni176Ohz--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/09/18/MCI3_FinTech Co-operation Agreement.jpg?itok=bHtUACHj", "publishedAt": "2022-09-18T13:01:36Z", "content": "The Monetary Authority of Singapore (MAS) and Indias International Financial Services Centres Authority (IFSCA) signed an agreement on Sunday (Sep 18) to facilitate regulatory collaboration and partn… [+1316 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Prehistoric Reptile That Lived Among Dinosaurs Discovered by Smithsonian Researchers - SciTechDaily", "description": "Discovery sheds light on the tuatara, the last living member of a once-diverse group of reptiles that has almost entirely been supplanted by lizards. A new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand’s living…", "url": "https://scitechdaily.com/?p=206601", "urlToImage": "https://scitechdaily.com/images/Opisthiamimus-gregori-scaled.jpg", "publishedAt": "2022-09-18T12:37:29Z", "content": "BySmithsonianSeptember 18, 2022\r\nAn artistic interpretation of a newly discovered extinct species of lizard-like reptile belonging to the same ancient lineage as New Zealands living tuatara. The newl… [+9135 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Malaysian saved over RM5000 on buying iPhone 14 Pro Max with GrabPay - TechNave", "description": "Although the use of e-wallets has become more prevalent, there are still many who question why we should use them. Some think of e-wallets as a way to avoid car", "url": "https://technave.com/gadget/Malaysian-saved-over-RM5000-on-buying-iPhone-14-Pro-Max-with-GrabPay-31811.html", "urlToImage": "https://technave.com/data/files/article/202209181059355310.jpg", "publishedAt": "2022-09-18T11:13:35Z", "content": "Although the use of e-wallets has become more prevalent, there are still many who question why we should use them. Some think of e-wallets as a way to avoid carrying cash, and they're not wrong, but … [+1251 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Historic Event for Human Spaceflight, New Artemis I Launch Date - SciTechDaily", "description": "Commemorating a historic event for human spaceflight … “We choose to go to the Moon …” An update on plans for Artemis I … And what NASA’s Perseverance rover is up to on Mars … a few of the stories to tell you about – This Week at NASA! https://youtu.be/1Ll0Fd…", "url": "https://scitechdaily.com/this-week-nasa-historic-event-for-human-spaceflight-new-artemis-i-launch-date/", "urlToImage": "https://scitechdaily.com/images/NASA-Historic-Event-for-Human-Spaceflight.gif", "publishedAt": "2022-09-18T10:16:14Z", "content": "ByNASASeptember 18, 2022\r\nMars is the second smallest planet in our solar system and the fourth planet from the sun. It is a dusty, cold, desert world with a very thin atmosphere. Iron oxide is preva… [+5593 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Yushi Nohara", "title": "HarmonyOS vs Android: Which one is good? - HC Newsroom", "description": "Huawei is an independent brand in the market in terms of operating systems, camera technology, and more. On the other hand, Android holds the crown of the affordable smartphone brand around the globe. But what if we compare both brands with each other to mate…", "url": "https://www.huaweicentral.com/harmonyos-vs-android-which-one-is-good/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/09/Huawei-Android-1000x576.jpg", "publishedAt": "2022-09-18T10:02:45Z", "content": "Huawei is an independent brand in the market in terms of operating systems, camera technology, and more. On the other hand, Android holds the crown of the affordable smartphone brand around the globe… [+3126 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Top banking CEO warns of South Africa’s next big own-goal: report - BusinessTech", "description": "FNB CEO Jacques Celliers says that if South Africa cannot get an extension on the possible greylisting by the FATF it may have dire consequences on the economy.", "url": "https://businesstech.co.za/news/business/626210/top-banking-ceo-warns-of-south-africas-next-big-own-goal-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/11/JacquesCelliers-e1636443290924.png", "publishedAt": "2022-09-18T06:06:58Z", "content": "A possible greylisting of financial institutions in South Africa would be another own goal for South Africa after the civil unrest in July last year and a subsequent rating downgrade, says FNB CEO Ja… [+4718 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Thought a Bacteria Was Harmless – They Were Wrong - SciTechDaily", "description": "An international study led by Singapore scientists discovers bacteria previously thought harmless can worsen existing lung disease. A team of international scientists has discovered that Neisseria — a genus of bacteria that lives in the human body – is not as…", "url": "https://scitechdaily.com/scientists-thought-a-bacteria-was-harmless-they-were-wrong/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Scan-Pneumonia-Lung-Infection.jpg", "publishedAt": "2022-09-18T04:59:39Z", "content": "Scientists have discovered that a type of bacteria is not as harmless as previously thought. It can actually cause infections in patients with bronchiectasis, asthma, and chronic obstructive pulmonar… [+11042 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "John Cheng", "title": "US-China Tech Rivalry Adds to Headaches for Stock Investors - Bloomberg", "description": "China’s heated rivalry with the US over tech supremacy is adding fresh pain points to the world’s second-largest stock market, as the Biden administration steps up efforts to reduce economic reliance on the Asian nation.", "url": "https://www.bloomberg.com/news/articles/2022-09-18/us-china-tech-rivalry-adds-to-headaches-for-stock-investors", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iZtNTxU1_76w/v0/1200x800.jpg", "publishedAt": "2022-09-18T01:00:00Z", "content": "China’s heated rivalry with the US over tech supremacy is adding fresh pain points to the world’s second-largest stock market, as the Biden administration steps up efforts to reduce economic reliance… [+358 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Seeks New Astronaut Lunar Landers for Future Artemis Moon Missions - SciTechDaily", "description": "As NASA works toward the goal of a regular cycle of moon landings, they are seeking proposals for sustainable lunar lander development and demonstration. NASA is preparing to return humans to the Moon through Artemis missions. This includes landing the first …", "url": "https://scitechdaily.com/nasa-seeks-new-astronaut-lunar-landers-for-future-artemis-moon-missions/", "urlToImage": "https://scitechdaily.com/images/Blue-Origin-Crewed-Lander-scaled.jpg", "publishedAt": "2022-09-17T20:14:46Z", "content": "ByNASASeptember 17, 2022\r\nArtist concept of the Blue Origin National Team crewed lander on the surface of the Moon as part of the Artemis program. Credit: Blue Origin\r\nAs NASA\r\nEstablished in 1958, t… [+2959 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Sarah Perez", "title": "This Week in Apps: iOS 16 takes off, TikTok clones BeReal, social cos go to Congress - Yahoo Philippines News", "description": "Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy...", "url": "https://ph.news.yahoo.com/week-apps-ios-16-takes-180047482.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/DREVUCrpI8myqt9r6kSr7w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02Mzc-/https://media.zenfs.com/en/techcrunch_350/41e81c3d377cbfe8b8e80c2dafde0573", "publishedAt": "2022-09-17T18:00:47Z", "content": "Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy.\r\nGlobal app spending reached $65 billion in … [+25043 chars]"}, {"source": {"id": null, "name": "Carbuyer.com.sg"}, "author": null, "title": "2022 Audi S8 review: Technology-driven, demonically-quick performance - AsiaOne", "description": "The Audi S8 has always been a stealth fighter (or Q Car) par excellence, with its S8-tanic side always such a joyful, hedonistic contrast to its straight, lux-limousine mien. High-powered A8s are infamous thanks to movies like The Transporter (A8 W12) and Ron…", "url": "https://carbuyer.com.sg/2022-audi-s8-review-singapore-price/", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/2022-Audi-S8-review-CarBuyer-Singapore-8.jpeg?h=10d202d3&itok=VrdX6XWG", "publishedAt": "2022-09-17T06:00:00Z", "content": "The Audi S8 has always been a stealth fighter (or Q Car) par excellence, with its S8-tanic side always such a joyful, hedonistic contrast to its straight, lux-limousine mien.\r\nHigh-powered A8s are in… [+6982 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "The 4-7-8 method that could help you sleep - CNN", "description": "The 4-7-8 breathing technique can calm your mind and body by relaxing your nervous system and decreasing heart rate and blood pressure, which gets your body in the optimal state for sleep.", "url": "https://www.cnn.com/2022/09/16/health/4-7-8-breathing-technique-relaxing-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220915141911-adult-sleeping-stock.jpg?q=w_800,c_fill", "publishedAt": "2022-09-16T18:23:00Z", "content": "Editors Note: Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\nFalling asleep or coming down from anxiety might never be as easy a… [+5937 chars]"}]}