{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Euro zone slips into recession after Germany, Ireland revisions - Reuters", "description": "The euro zone economy was in a technical recession in the first three months of 2023, data from European statistics agency Eurostat showed on Thursday, after downward revisions of growth in both the first quarter and the final quarter of 2022.", "url": "https://www.reuters.com/markets/europe/euro-zone-slips-into-recession-after-german-revision-2023-06-08/", "urlToImage": "https://www.reuters.com/resizer/x0tMH9XJe1Hl85zo3zHjAecN1O0=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/RT6JQHLDIFIWNHLEZ46SDYBKPE.jpg", "publishedAt": "2023-06-08T11:31:00Z", "content": "BRUSSELS, June 8 (Reuters) - The euro zone economy was in a technical recession in the first three months of 2023, data from European statistics agency Eurostat showed on Thursday, after downward rev… [+2435 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Ivan", "title": "Apple Vision Pro's screens run at 90Hz - GSMArena.com news - GSMArena.com", "description": "But it will be able to ramp up as high as 96Hz under specific scenarios. Apple didn't say much in the way of tech specs when it unveiled the Vision Pro...", "url": "https://www.gsmarena.com/apple_vision_pro_will_run_at_90hz_most_of_the_time-news-58810.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/23/06/apple-vision-pro-90hz/-952x498w6/gsmarena_000.jpg", "publishedAt": "2023-06-08T10:48:01Z", "content": "Apple didn't say much in the way of tech specs when it unveiled the Vision Pro headset, aside from the relative resolution of the dual displays being more than 4K.\r\nBut a session on spatial computing… [+645 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 8 June 2023: The amazing Elephant's Trunk Nebula - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is the Elephant’s Trunk Nebula, located about 3000 light-years from Earth towards the constellation of Cepheus.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-8-june-2023-the-amazing-elephants-trunk-nebula-71686216908904.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/06/08/1600x900/nasa_1686217222224_1686217227344.jpg", "publishedAt": "2023-06-08T09:41:20Z", "content": "Nebulas exist in the space between stars, known as the Interstellar space. In fact, there is a Nebula close to Earth which could possibly be the remnant of the dying star, according to NASA. It is ca… [+1607 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Parker Solar Probe Plunges Into Fast Solar Wind and Discovers Its Mysterious Source - SciTechDaily", "description": "NASA's Parker Solar Probe probe got close enough to sun's surface to see hidden granular features. NASA's Parker Solar Probe (PSP) has flown close enough to the sun to detect the fine structure of the solar wind close to where it is generated at the sun's sur…", "url": "https://scitechdaily.com/?p=284640", "urlToImage": "https://scitechdaily.com/images/Parker-Solar-Probe-Touches-Sun.gif", "publishedAt": "2023-06-08T08:38:44Z", "content": "ByUniversity of California - BerkeleyJune 8, 2023\r\nNASAs Parker Solar Probe (PSP) has detected the origin and structure of the solar wind close to the suns surface, observing high-energy particles al… [+9730 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETtech", "title": "Regulation? AI, says OpenAI CEO Sam Altman - Economic Times", "description": "Sam Altman, founder and chief executive officer of OpenAI, the company that developed ChatGPT, thats transforming search and threatens to upend the technological order.", "url": "https://economictimes.indiatimes.com/tech/technology/regulation-ai-says-openai-ceo-sam-altman/articleshow/100830314.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100830477,width-1070,height-580,imgsize-172312,overlay-ettech/photo.jpg", "publishedAt": "2023-06-08T00:30:00Z", "content": "Major companies operating in the artificial intelligence (AI) space including OpenAI should be regulated but not smaller ones and startups, said Sam Altman, founder and chief executive officer of the… [+6899 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "AI system devises first optimizations to sorting code in over a decade - Ars Technica", "description": "Writing efficient code was turned into a game, and the AI played to win.", "url": "https://arstechnica.com/science/2023/06/googles-deepmind-develops-a-system-that-writes-efficient-algorithms/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1403644222-760x380.jpg", "publishedAt": "2023-06-07T21:44:22Z", "content": "59 with \r\nAnyone who has taken a basic computer science class has undoubtedly spent time devising a sorting algorithmcode that will take an unordered list of items and put them in ascending or descen… [+3869 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Ruairi J Mackenzie", "title": "Coos and Snooze: Scientists Decode Pigeons' Dreams - Technology Networks", "description": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a technique called functional magnetic resonance imaging (fMRI) to…", "url": "https://www.technologynetworks.com/neuroscience/news/coos-and-snooze-scientists-decode-pigeons-dreams-374412", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/374412/coos-and-snooze-scientists-decode-pigeons-dreams-374412-640x360.jpg?cb=20230607", "publishedAt": "2023-06-07T15:54:53Z", "content": "The boundless and bizarre content of human dreams has attracted the interest of biological researchers for decades. A new study by German scientists shows that pigeons dream too. The team used a tech… [+5189 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Science X", "title": "ChatGPT designs its first robot - Tech Xplore", "description": "Poems, essays and even books—is there anything the open AI platform ChatGPT can't handle? These new AI developments have inspired researchers at TU Delft and the Swiss technical university EPFL to dig a little deeper: For instance, can ChatGPT also design a r…", "url": "https://techxplore.com/news/2023-06-chatgpt-robot.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/chatgpt-designs-its-fi.jpg", "publishedAt": "2023-06-07T15:36:03Z", "content": "Poems, essays and even booksis there anything the open AI platform ChatGPT can't handle? These new AI developments have inspired researchers at TU Delft and the Swiss technical university EPFL to dig… [+3560 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Demonstrates Superior Performance in Predicting Breast Cancer - SciTechDaily", "description": "AI algorithms outperformed traditional clinical risk models in a large-scale study, predicting five-year breast cancer risk more accurately. These models use mammograms as the single data source, offering potential advantages in individualizing patient care a…", "url": "https://scitechdaily.com/ai-demonstrates-superior-performance-in-predicting-breast-cancer/", "urlToImage": "https://scitechdaily.com/images/Artificial-Intelligence-AI-Success-Art.jpg", "publishedAt": "2023-06-07T08:22:40Z", "content": "In a comprehensive study published in the journal Radiology, artificial intelligence (AI) algorithms demonstrated superior performance to the standard clinical risk model in predicting the five-year … [+6132 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "AI Revolutionizes Antibiotic Discovery: A New Hope Against Evasive Hospital Superbugs - SciTechDaily", "description": "New process could speed the discovery of other much-needed antibiotics. Scientists at McMaster University and the Massachusetts Institute of Technology have used artificial intelligence to discover a new antibiotic that could be used to fight a deadly, drug-r…", "url": "https://scitechdaily.com/ai-revolutionizes-antibiotic-discovery-a-new-hope-against-evasive-hospital-superbugs/", "urlToImage": "https://scitechdaily.com/images/Antibiotic-Destroying-Bacteria-Illustration.jpg", "publishedAt": "2023-06-07T04:35:35Z", "content": "ByMcMaster UniversityJune 6, 2023\r\nUsing artificial intelligence, scientists have discovered a new antibiotic, abaucin, aimed at tackling the dangerous, drug-resistant bacteria Acinetobacter baumanni… [+7253 chars]"}]}