{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Barron's"}, "author": "Callum Keown", "title": "BioNTech CEO Says New Vaccines Needed in 2022. Vaccine Stocks Are Still Falling. - Barron's", "description": "Shares in Covid-19 vaccine makers, including Moderna, Novavax and BioNTech, continued their slide lower early on Monday,", "url": "https://www.barrons.com/articles/biontech-ceo-vaccines-2022-51633349371", "urlToImage": "https://images.barrons.com/im-389685/social", "publishedAt": "2021-10-04T12:10:00Z", "content": "Updated Covid-19 vaccines may be needed next year as the coronavirus that causes the disease mutates to evade immunity, BioNTech CEO Uur ahin said in an interview with the Financial Times.The chief e… [+1625 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "Israel Requires COVID-19 Booster Shots For Stricter 'Green Pass' - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-Israel was an early adopter of Pfizer/BioNtech booster shots - administering them to members of risk groups in July and by the end of August to anyone above the age of 12. Its campaign …", "url": "http://bwhealthcareworld.businessworld.in/article/Israel-Requires-COVID-19-Booster-Shots-For-Stricter-Green-Pass-/04-10-2021-407184", "urlToImage": "http://static.businessworld.in/article/article_large_image/1625216648_ahbUTG_RT_PCR_Test.jpg", "publishedAt": "2021-10-04T11:58:43Z", "content": "Israel was an early adopter of Pfizer/BioNtech booster shots - administering them to members of risk groups in July and by the end of August to anyone above the age of 12. Its campaign is being watch… [+1222 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Almost one-in-three people globally will still be mainly using polluting cooking fuels in 2030 - Phys.org", "description": "In 2030, almost 1 in 3people around the world will still be mainly using polluting cooking fuels and technologies, a major source of disease and environmental destruction and devastation, new research warned.  This rises to more than 4 in 5 in sub-Saharan Afr…", "url": "https://phys.org/news/2021-10-one-in-three-people-globally-polluting-cooking.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/almost-one-in-three-pe.jpg", "publishedAt": "2021-10-04T11:55:17Z", "content": "In 2030, almost 1 in 3people around the world will still be mainly using polluting cooking fuels and technologies, a major source of disease and environmental destruction and devastation, new researc… [+5654 chars]"}, {"source": {"id": null, "name": "Intelligent CIO Africa"}, "author": null, "title": "iiDENTIFii wins Microsoft South Africa 2021 ISV Partner of the Year award - Intelligent CIO Africa", "description": "Biometric digital authentication and automated onboarding technology solution provider, iiDENTIFii, recently added another accolade to its growing list of awards after it was named as the New or Emerging Independent Software Vendor (ISV) Partner of the Year i…", "url": "https://www.intelligentcio.com/africa/2021/10/04/iidentifii-wins-microsoft-south-africa-2021-isv-partner-of-the-year-award/", "urlToImage": "https://www.intelligentcio.com/africa/wp-content/uploads/sites/5/2021/02/Award.jpg", "publishedAt": "2021-10-04T08:23:44Z", "content": "Biometric digital authentication and automated onboarding technology solution provider, iiDENTIFii, recently added another accolade to its growing list of awards after it was named as the New or Emer… [+2472 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Supertech's plea to save one Emerald Court tower rejected by Supreme Court - Hindustan Times", "description": "The two 40-storey towers in Supertech's Emeral Court project in Noida were ordered to be razed over grave illegalities. An SIT formed by UP government found 26 officials of Noida Authority guilty of collusion with the builder. Three of these officials have be…", "url": "https://www.hindustantimes.com/india-news/supertechs-plea-to-save-one-emerald-court-tower-rejected-by-supreme-court-101633333940565.html", "urlToImage": "https://images.hindustantimes.com/img/2021/10/04/1600x900/The_Supreme_Court_has_ordered_demolition_of_both_towers_of_Emerald_Court_1633334040000_1633334040115.jpg", "publishedAt": "2021-10-04T07:58:10Z", "content": "The Supreme Court on Monday dismissed real estate major Supertech's application to save one of the two 40-storey towers in its Emerald Court project in Noida, that were ordered to be razed over grave… [+2647 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "You haven't seen Nothing yet? It's now on Shopee! - TechNave", "description": "Do excuse our attempt at being corny, but do you remember the new company called&nbsp;Nothing&nbsp;that&nbsp;debuted in July? That's right, it's finally coming", "url": "https://technave.com/gadget/You-haven-t-seen-Nothing-yet-It-s-now-on-Shopee-26881.html", "urlToImage": "https://technave.com/data/files/article/202110040651408437.jpg", "publishedAt": "2021-10-04T07:02:57Z", "content": "Do excuse our attempt at being corny, but do you remember the new company called Nothing that debuted in July? That's right, it's finally coming to Malaysia! Shopee Malaysia has confirmed that Nothin… [+1510 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "UK updates red list system for travel – with changes expected for South Africa - BusinessTech", "description": "The UK has officially updated its travel system, effectively scrapping its ‘traffic light’ programme which classified countries as ‘green’, ‘yellow’ and ‘red’ based on their Covid-19 risk.", "url": "https://businesstech.co.za/news/lifestyle/525932/uk-updates-red-list-system-for-travel-with-changes-expected-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/10/UK-e1570108211831.jpeg", "publishedAt": "2021-10-04T06:48:35Z", "content": "The United Kingdom has updated its international travel system, effectively scrapping its ‘traffic light’ programme, which classified countries as ‘green’, ‘yellow’ and ‘red’ based on their Covid-19 … [+2986 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "3 new laws proposed for businesses in South Africa - BusinessTech", "description": "Trade and Industry minister Ebrahim Patel has published the draft Companies Amendment Bill for public comment, promising a major shake-up for businesses in South Africa.", "url": "https://businesstech.co.za/news/business/525912/3-new-laws-proposed-for-businesses-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/01/Sandton-City-2.jpg", "publishedAt": "2021-10-04T06:37:13Z", "content": "Trade and Industry minister Ebrahim Patel has published the draft Companies Amendment Bill for public comment, promising a significant shake-up for businesses in South Africa.\r\nFirst mooted in 2018, … [+3416 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Staff Reporter", "title": "ISPs have a plan to slash mobile data prices – if Icasa will play ball - TechCentral", "description": "The Internet Service Providers’ Association wants Icasa to crack open South Africa’s mobile industry to greater competition.", "url": "https://techcentral.co.za/isps-have-a-plan-to-slash-mobile-data-prices-if-icasa-will-let-them/202992/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2021/09/tower-2156-1120-2.jpg", "publishedAt": "2021-10-04T06:11:13Z", "content": "The Internet Service Providers Association (Ispa) an industry body that represent most of South Africas community of ISPs wants the country’s communications regulator to crack open South Africas mobi… [+1666 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "BioNTech chief predicts need for updated Covid vaccines next year - Financial Times", "description": "Ugur Sahin says the virus is very likely to mutate and evade immunity given by current jabs", "url": "https://www.ft.com/content/d88457da-6bbc-4f07-82a6-4738aa845492", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7400ab46-b98d-4969-97eb-833115dc4e82.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2021-10-03T10:00:09Z", "content": "The chief executive of the biotechnology group behind the first Covid-19 vaccine has said a new formulation is likely to be needed by the middle of next year to protect against the virus as it mutate… [+2457 chars]"}]}