{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mediterranean Diet Linked With 23% Lower Risk of Dementia - SciTechDaily", "description": "Eating a traditional Mediterranean-type diet – rich in foods such as seafood, fruit, and nuts – may help reduce the risk of dementia by almost a quarter, a new study has revealed. Experts at Newcastle University found that individuals who ate a Mediterranean-…", "url": "https://scitechdaily.com/?p=260727", "urlToImage": "https://scitechdaily.com/images/Healthy-Mediterranean-Diet-Food-Concept-Illustration.jpg", "publishedAt": "2023-03-15T21:31:52Z", "content": "According to a study by Newcastle University, consuming a traditional Mediterranean diet consisting of foods such as seafood, fruit, and nuts may decrease the risk of developing dementia by up to 23%… [+4797 chars]"}, {"source": {"id": null, "name": "Guiding Tech"}, "author": "Paurush Chaudhary", "title": "How To Post Voice Note As WhatsApp Status on iPhone and Android - Guiding Tech", "description": "WhatsApp Status just works like Instagram Stories on your iPhone and Android. You can post a text message, an image, a video, or web links to your", "url": "https://www.guidingtech.com/how-to-post-voice-note-as-whatsapp-status-on-iphone-and-android/", "urlToImage": "https://www.guidingtech.com/wp-content/uploads/How_to_Post_Voice_Note_on_WhatsApp_Status_on_iPhone_and_Android.jpg", "publishedAt": "2023-03-15T17:30:36Z", "content": "WhatsApp Status just works like Instagram Stories on your iPhone and Android. You can post a text message, an image, a video, or web links to your WhatsApp Status and share it with your friends. And … [+4327 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ingrid Lunden", "title": "LinkedIn expands its generative AI assistant to recruitment ads and writing profiles - TechCrunch", "description": "Learning, job ads and profiles are the latest to get the AI push at LinkedIn", "url": "https://techcrunch.com/2023/03/15/linkedin-expands-its-generative-ai-assistant-to-recruitment-ads-and-writing-profiles/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/01/linkedin-china-e1547032000499.jpg?resize=1200,636", "publishedAt": "2023-03-15T16:20:54Z", "content": "Earlier this month, when LinkedIn started seeding “AI-powered conversation starters” in people’s news feeds to boost engagement on its platform, the move saw more than little engagement of its own, n… [+3551 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Microsoft-backed OpenAI starts release of powerful AI known as GPT-4 - Arab News", "description": "CALIFORNIA: The startup OpenAI on Tuesday said it is beginning to release a powerful artificial intelligence model known as GPT-4, setting the stage for human-like technology to proliferate and more competition between its backer Microsoft Corp. and Alphabet …", "url": "https://www.arabnews.com/node/2268816", "urlToImage": "https://www.arabnews.com/sites/default/files/styles/660x371_watermarksaudi/public/main-image/2023/03/15/3725551-617208987.jpg?itok=C6fxXFML", "publishedAt": "2023-03-14T22:18:14Z", "content": "King Abdullah University of Science and Technology has launched Dear AI, an International Womens Day campaign and hackathon to tackle gender bias and the under-representation of women in artificial i… [+2871 chars]"}]}