{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Martin Samuel", "title": "Brentford 0-3 Arsenal - Premier League: Gunners go back top of the table - Daily Mail", "description": "MARTIN SAMUEL AT THE GTECH COMMUNITY STADIUM: Here was another display that suggests Arsenal have the mettle to contend this season.", "url": "https://www.dailymail.co.uk/sport/live/article-11215163/Brentford-vs-Arsenal-Premier-League-2022-23-Live-Result.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/18/13/62531155-0-image-a-149_1663503537028.jpg", "publishedAt": "2022-09-18T14:27:51Z", "content": "They are a superstitious lot, football people. So the sight of a player called Vieira scoring for Arsenal in an imperious performance that returns them to the top of the table is going to have a lot … [+7709 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "iPhone 14 looks like iPhone 13 and now eyeing iPhone 15? Check out the game-changer - HT Tech", "description": "iPhone 14 is a clone of iPhone 13. Not much of a difference. And now, those looking for a game-changer iPhone have put their faith in iPhone 15 instead. Here is all we know about iPhone 15 so far.", "url": "https://tech.hindustantimes.com/mobile/news/iphone-14-looks-like-iphone-13-and-now-eyeing-iphone-15-check-out-the-gamechanger-71663507775600.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/18/1600x900/APPLE-IPHONE-CHINA-3_1663438521234_1663438521234_1663507872331_1663507872331.JPG", "publishedAt": "2022-09-18T13:34:52Z", "content": "With the iPhone 14 series being launched just about two weeks back on September 7, people have already started discussing the next Apple launch. You can't blame them. Reason being that the iPhone 14 … [+2729 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Extinct Prehistoric Reptile That Lived Among Dinosaurs Discovered by Smithsonian Researchers - SciTechDaily", "description": "Discovery sheds light on the tuatara, the last living member of a once-diverse group of reptiles that has almost entirely been supplanted by lizards. A new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand’s living…", "url": "https://scitechdaily.com/?p=206601", "urlToImage": "https://scitechdaily.com/images/Opisthiamimus-gregori-scaled.jpg", "publishedAt": "2022-09-18T12:37:29Z", "content": "BySmithsonianSeptember 18, 2022\r\nAn artistic interpretation of a newly discovered extinct species of lizard-like reptile belonging to the same ancient lineage as New Zealands living tuatara. The newl… [+9135 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Darrell Etherington", "title": "Massive GTA 6 gameplay video leak depicts male and female playable characters - TechCrunch", "description": "GTA 6 video leak includes 90 videos of gameplay footage from Rockstar's next Grand Theft Auto Game, including code and screenshots.", "url": "https://techcrunch.com/2022/09/18/gta-6-gameplay-video-leak/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/09/07edb091bb329145ee3f3f01476adb40acc6457b.jpg?resize=1200,675", "publishedAt": "2022-09-18T11:31:44Z", "content": "Rockstar’s next instalment in its Grand Theft Auto series could be one of the most anticipated video games in existence, and a new purported leak could offer us our best look yet at GTA 6. The trove … [+1801 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Malaysian saved over RM5000 on buying iPhone 14 Pro Max with GrabPay - TechNave", "description": "Although the use of e-wallets has become more prevalent, there are still many who question why we should use them. Some think of e-wallets as a way to avoid car", "url": "https://technave.com/gadget/Malaysian-saved-over-RM5000-on-buying-iPhone-14-Pro-Max-with-GrabPay-31811.html", "urlToImage": "https://technave.com/data/files/article/202209181059355310.jpg", "publishedAt": "2022-09-18T11:13:35Z", "content": "Although the use of e-wallets has become more prevalent, there are still many who question why we should use them. Some think of e-wallets as a way to avoid carrying cash, and they're not wrong, but … [+1251 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Once-in-a-lifetime event! Jupiter to be closest to Earth in 70 years on THIS day! NASA reveals date - HT Tech", "description": "Jupiter and Earth will be closest in 70 years next week! Know when and how to spot Jupiter at its largest.", "url": "https://tech.hindustantimes.com/tech/news/onceinalifetime-event-jupiter-to-be-closest-to-earth-in-70-years-on-this-day-nasa-reveals-date-71663491384545.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/09/18/1600x900/Space-Telescope-Jupiter-0_1663491452594_1663491452594_1663491470648_1663491470648.jpg", "publishedAt": "2022-09-18T08:58:11Z", "content": "Skywatchers will have the once-in-a-lifetime opportunity to catch a glimpse of Jupiter at its biggest next week! The largest planet of the solar system, Jupiter is ready to make its closest and oppos… [+2257 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Top banking CEO warns of South Africa’s next big own-goal: report - BusinessTech", "description": "FNB CEO Jacques Celliers says that if South Africa cannot get an extension on the possible greylisting by the FATF it may have dire consequences on the economy.", "url": "https://businesstech.co.za/news/business/626210/top-banking-ceo-warns-of-south-africas-next-big-own-goal-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/11/JacquesCelliers-e1636443290924.png", "publishedAt": "2022-09-18T06:06:58Z", "content": "A possible greylisting of financial institutions in South Africa would be another own goal for South Africa after the civil unrest in July last year and a subsequent rating downgrade, says FNB CEO Ja… [+4718 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Thought a Bacteria Was Harmless – They Were Wrong - SciTechDaily", "description": "An international study led by Singapore scientists discovers bacteria previously thought harmless can worsen existing lung disease. A team of international scientists has discovered that Neisseria — a genus of bacteria that lives in the human body – is not as…", "url": "https://scitechdaily.com/scientists-thought-a-bacteria-was-harmless-they-were-wrong/", "urlToImage": "https://scitechdaily.com/images/X-Ray-Scan-Pneumonia-Lung-Infection.jpg", "publishedAt": "2022-09-18T04:59:39Z", "content": "Scientists have discovered that a type of bacteria is not as harmless as previously thought. It can actually cause infections in patients with bronchiectasis, asthma, and chronic obstructive pulmonar… [+11042 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "John Cheng", "title": "US-China Tech Rivalry Adds to Headaches for Stock Investors - Bloomberg", "description": "China’s heated rivalry with the US over tech supremacy is adding fresh pain points to the world’s second-largest stock market, as the Biden administration steps up efforts to reduce economic reliance on the Asian nation.", "url": "https://www.bloomberg.com/news/articles/2022-09-18/us-china-tech-rivalry-adds-to-headaches-for-stock-investors", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iZtNTxU1_76w/v0/1200x800.jpg", "publishedAt": "2022-09-18T01:00:00Z", "content": "China’s heated rivalry with the US over tech supremacy is adding fresh pain points to the world’s second-largest stock market, as the Biden administration steps up efforts to reduce economic reliance… [+358 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Seeks New Astronaut Lunar Landers for Future Artemis Moon Missions - SciTechDaily", "description": "As NASA works toward the goal of a regular cycle of moon landings, they are seeking proposals for sustainable lunar lander development and demonstration. NASA is preparing to return humans to the Moon through Artemis missions. This includes landing the first …", "url": "https://scitechdaily.com/nasa-seeks-new-astronaut-lunar-landers-for-future-artemis-moon-missions/", "urlToImage": "https://scitechdaily.com/images/Blue-Origin-Crewed-Lander-scaled.jpg", "publishedAt": "2022-09-17T20:14:46Z", "content": "ByNASASeptember 17, 2022\r\nArtist concept of the Blue Origin National Team crewed lander on the surface of the Moon as part of the Artemis program. Credit: Blue Origin\r\nAs NASA\r\nEstablished in 1958, t… [+2959 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "This Week in Apps: iOS 16 takes off, TikTok clones BeReal, social cos go to Congress - TechCrunch", "description": "This Week in Apps offers a way to keep up with the latest from the world of apps, including news, updates, startup fundings, M&A and much more.", "url": "https://techcrunch.com/2022/09/17/this-week-in-apps-ios-16-takes-off-tiktok-clones-bereal-social-cos-go-to-congress/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/07/this-week-in-apps-splash-2022.webp?resize=1200,637", "publishedAt": "2022-09-17T18:01:07Z", "content": "Welcome back to This Week in Apps, the weekly TechCrunch series that recaps the latest in mobile OS news, mobile applications and the overall app economy.\r\nGlobal app spending reached $65 billion in … [+24846 chars]"}, {"source": {"id": null, "name": "Carbuyer.com.sg"}, "author": null, "title": "2022 Audi S8 review: Technology-driven, demonically-quick performance - AsiaOne", "description": "The Audi S8 has always been a stealth fighter (or Q Car) par excellence, with its S8-tanic side always such a joyful, hedonistic contrast to its straight, lux-limousine mien. High-powered A8s are infamous thanks to movies like The Transporter (A8 W12) and Ron…", "url": "https://carbuyer.com.sg/2022-audi-s8-review-singapore-price/", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/2022-Audi-S8-review-CarBuyer-Singapore-8.jpeg?h=10d202d3&itok=VrdX6XWG", "publishedAt": "2022-09-17T06:00:00Z", "content": "The Audi S8 has always been a stealth fighter (or Q Car) par excellence, with its S8-tanic side always such a joyful, hedonistic contrast to its straight, lux-limousine mien.\r\nHigh-powered A8s are in… [+6982 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Team Tech Outlook", "title": "Who Killed the Dinosaurs years ago? - Volcanic Disruptions, or Asteroids - Read here - The Tech Outlook", "description": "Million years ago the fact that dinosaurs were killed because of the asteroids striking on the ground,has actually come to a new conclusion after a deep- research. The breaking news, which once claimed that 66 million years ago, asteroids had striked", "url": "https://www.thetechoutlook.com/fact-check/who-killed-the-dinosaurs-years-ago-volcanic-disruptions-or-asteroids-read-here/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/09/Untitled-design-18-4.jpg", "publishedAt": "2022-09-16T18:55:22Z", "content": "Million years ago the fact that dinosaurs were killed because of the asteroids striking on the ground,has actually come to a new conclusion after a deep- research. The breaking news, which once claim… [+1248 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "The 4-7-8 method that could help you sleep - CNN", "description": "The 4-7-8 breathing technique can calm your mind and body by relaxing your nervous system and decreasing heart rate and blood pressure, which gets your body in the optimal state for sleep.", "url": "https://www.cnn.com/2022/09/16/health/4-7-8-breathing-technique-relaxing-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220915141911-adult-sleeping-stock.jpg?q=w_800,c_fill", "publishedAt": "2022-09-16T18:23:00Z", "content": "Editors Note: Sign up for the Sleep, But Better newsletter series. Our seven-part guide has helpful hints to achieve better sleep.\r\nFalling asleep or coming down from anxiety might never be as easy a… [+5937 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "John Timmer", "title": "Lots of strange things about Saturn can be explained by a destroyed moon - Ars Technica", "description": "Simulations appear to tie up lots of loose ends.", "url": "https://arstechnica.com/science/2022/09/lots-of-strange-things-about-saturn-can-be-explained-by-a-destroyed-moon/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/stsci-h-p1943a-f-2076x1484-760x380.png", "publishedAt": "2022-09-16T18:13:57Z", "content": "59 with 37 posters participating\r\nSaturn is an unusual planet in some obvious ways, most notably its extensive ring system. But it's also strange in some less obvious ways: The rings appear to be far… [+2820 chars]"}]}