{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Shouvik Das", "title": "Alphabet Employees' Letter on Workplace Harassment Serves Reminder of Issues with Big Tech - News18", "description": "Google and Alphabet employees have addressed an open letter to company chief Sundar Pichai, speaking about the lack of action from the company in acting against those accused of harassment.", "url": "https://www.news18.com/news/tech/alphabet-employees-letter-on-workplace-harassment-serves-reminder-of-issues-with-big-tech-3627608.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618064225_alphabet-google-workplace-harassment-employee-letter.jpeg", "publishedAt": "2021-04-10T14:17:39Z", "content": "Google and Alphabet employees have addressed an open letter to company chief Sundar Pichai, speaking about the lack of action from the company in acting against those accused of harassment. The lette… [+3531 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Microsoft Surface Laptop 4 could launch this month with AMD CPUs from ~RM5900 - TechNave", "description": "When you think of&nbsp;Microsoft&nbsp;laptops, the first thing you would think is that it has an Intel CPU. But this time around, the company could switch thing", "url": "https://technave.com/gadget/Microsoft-Surface-Laptop-4-could-launch-this-month-with-AMD-CPUs-from-RM5900-24252.html", "urlToImage": "https://technave.com/data/files/mall/article/202104101201111121.jpg", "publishedAt": "2021-04-10T12:03:34Z", "content": "When you think of Microsoft laptops, the first thing you would think is that it has an Intel CPU. But this time around, the company could switch things up. A reliable source has claimed that the Surf… [+1908 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "What’s the Buzz About Bitcoin Cryptocurrency and Blockchain Technology? - SciTechDaily", "description": "We know Elon Musk is a fan, but what’s all the fuss about, and when will the Bitcoin bubble burst? Just like the stock market, the cryptocurrency market is frequently subjected to extreme price fluctuations – both upwards and downwards. Tesla recently purchas…", "url": "https://scitechdaily.com/whats-the-buzz-about-bitcoin-cryptocurrency-and-blockchain-technology/", "urlToImage": "https://scitechdaily.com/images/Bitcoin-Blockchain-Cryptocurrency.gif", "publishedAt": "2021-04-10T10:48:42Z", "content": "We know Elon Musk is a fan, but what’s all the fuss about, and when will the Bitcoin bubble burst?\r\nJust like the stock market, the cryptocurrency market is frequently subjected to extreme price fluc… [+3400 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Bogdan Popa", "title": "Huawei's First Car Will Be a Luxury Sedan Powered by Harmony OS - autoevolution", "description": "Just like Apple, Xiaomi, and most likely other tech giants too, Huawei is also working on a car, and while the Chinese firm has always denied such a project, it looks like it’s now just a matter of days until its first EV sees the daylight.", "url": "https://www.autoevolution.com/news/huawei-s-first-car-will-be-a-luxury-sedan-powered-by-harmony-os-159097.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/huawei-s-first-car-will-be-a-luxury-sedan-powered-by-harmony-os-159097-7.jpg", "publishedAt": "2021-04-10T08:12:00Z", "content": "A teaser that the company itself posted on Chinese social network Weibo confirms the first Huawei EV would be announced on April 17, and while the official information hasn’t been shared, a few tidbi… [+1467 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Astronaut and Two Russian Cosmonauts Arrive Safely at International Space Station - SciTechDaily", "description": "NASA astronaut Mark Vande Hei and two Russian cosmonauts arrived at the International Space Station Friday, bringing its number of residents to 10 for the coming week. The Soyuz MS-18 spacecraft carrying Vande Hei and cosmonauts Oleg Novitskiy and Pyotr Dubro…", "url": "https://scitechdaily.com/nasa-astronaut-and-two-russian-cosmonauts-arrive-safely-at-international-space-station/", "urlToImage": "https://scitechdaily.com/images/Soyuz-MS-18-Rocket-Expedition-65.jpg", "publishedAt": "2021-04-10T07:48:00Z", "content": "The Soyuz MS-18 rocket is launched with Expedition 65 NASA astronaut Mark Vande Hei, Roscosmos cosmonauts Pyotr Dubrov and Oleg Novitskiy, Friday, April 9, 2021, at the Baikonur Cosmodrome in Kazakhs… [+2140 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Michael Hicks", "title": "Samsung Galaxy A82 release date, price, news, leaks and what the phone may bring - TechRadar", "description": "The return of Samsung's pop-up selfie cam?", "url": "https://www.techradar.com/news/samsung-galaxy-a82", "urlToImage": "https://cdn.mos.cms.futurecdn.net/U6tLw5tTLZCqKMLm5UNsmP-1200-80.jpg", "publishedAt": "2021-04-10T06:00:01Z", "content": "For thrifty buyers who found the Galaxy S21 too expensive, the Samsung Galaxy A82 is on its way with similar flagship specs but a more mid-range price though we're still waiting on Samsung's official… [+6643 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Richbon Quevedo", "title": "PH biotech firm, pharma group eye clinical trials for ivermectin use against COVID-19 - INQUIRER.net", "description": "MANILA, Philippines — IP Biotech Inc. (IPB), in partnership with Ambica International Inc., announced on Saturday they are interested in applying for clinical trials for ivermectin with the Food", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/04/News137485-620x413.jpg", "publishedAt": "2021-04-10T04:10:00Z", "content": "TO USE OR NOT TO USE A number of physicians swear by the effectiveness of Ivermectin, an antiparasitic drug commercially available only for veterinary use, as a treatment or preventivemedicine agains… [+2991 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "Hands on: Xiaomi Mi 11 Ultra review - TechRadar", "description": "Turning up to Mi 11", "url": "https://www.techradar.com/reviews/xiaomi-mi-11-ultra", "urlToImage": "https://cdn.mos.cms.futurecdn.net/4TRSnYEwmaUExPcDH2fED3-1200-80.jpg", "publishedAt": "2021-04-09T17:00:48Z", "content": "If you told us the Xiaomi Mi 11 Ultra was a parody of the Samsung Galaxy S21 Ultra and iPhone 12 Pro Max-style superphones, we'd probably believe you. Its feature-set and design evoke those luxury ph… [+6474 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "The Nokia X20 brings 5G phones down to $415 - Ars Technica", "description": "The new Snapdragon 480 SoC brings 5G downmarket.", "url": "https://arstechnica.com/gadgets/2021/04/the-nokia-x20-brings-5g-phones-down-to-415/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2021/04/chrome_Ky37wT0npD-760x380.png", "publishedAt": "2021-04-09T16:51:30Z", "content": "27 with 18 posters participating\r\n<ul><li>\r\n The Nokia X20, showing a lovely stock Android home screen. \r\n</li><li>\r\n</li><li>\r\n Four cameras seems like too many cameras for a midrange phone, but the… [+2375 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "Korean firm sets PH vaccine clinical trial - Manila Bulletin", "description": "Eubiologics, the South Korean vaccine manufacturer and joint venture partner of Filipino pharmaceutical Glovax Biotech Corp., is targeting to start clinical trial in the country this month for its EuCorVac-19 Covid vaccine. \n\n\n\nPhoto credit: http://eubiologic…", "url": "https://mb.com.ph/2021/04/09/korean-firm-sets-ph-vaccine-clinical-trial/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/04/EUBIO.jpg", "publishedAt": "2021-04-08T22:00:37Z", "content": "Eubiologics, the South Korean vaccine manufacturer and joint venture partner of Filipino pharmaceutical Glovax Biotech Corp., is targeting to start clinical trial in the country this month for its Eu… [+4244 chars]"}]}