{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "Sony Xperia 5 III Malaysia pre-order - SD888 chipset with a free pair of wireless earbuds, priced at RM4599 - TechNave", "description": "In early late August,&nbsp;Sony Malaysia&nbsp;released the pre-order of the&nbsp;Xperia 10 III&nbsp;and it certainly took them a while for the&nbsp;Xperia 5 III", "url": "https://technave.com/gadget/Sony-Xperia-5-III-Malaysia-pre-order-SD888-chipset-with-a-free-pair-of-wireless-earbuds-priced-at-RM4599-27507.html", "urlToImage": "https://technave.com/data/files/article/202111220133202347.jpg", "publishedAt": "2021-11-22T01:37:44Z", "content": "In early late August, Sony Malaysia released the pre-order of the Xperia 10 III and it certainly took them a while for the Xperia 5 III. Just over the weekend, the Xperia 5 III pre-order just got ann… [+1006 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprising New Information on How Salt Affects Blood Flow in the Brain - SciTechDaily", "description": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the brain is affected by salt consumption. When neurons are activa…", "url": "https://scitechdaily.com/surprising-new-information-on-how-salt-affects-blood-flow-in-the-brain/", "urlToImage": "https://scitechdaily.com/images/Brain-Blood-Flow-MRI.jpg", "publishedAt": "2021-11-22T01:33:02Z", "content": "A first-of-its-kind study led by researchers at Georgia State reveals surprising new information about the relationship between neuron activity and blood flow deep in the brain, as well as how the br… [+4912 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Charlie Ridgely", "title": "Spider-Man: No Way Home Fans Freaking Out Over Electro's Usage of Stark Tech - Comicbook.com", "description": "There is a lot more going on with the the villains in Spider-Man: No Way Home than we initially thought. The newest trailer for No Way Home made it look like there was some kind of nano-tech enhancement on Doc Ock's suit arms, and it had fans wondering where …", "url": "https://comicbook.com/marvel/news/spider-man-no-way-home-ectro-arc-reactor-tony-stark/", "urlToImage": "https://sportshub.cbsistatic.com/i/2021/11/17/945ac499-9e66-4f64-809e-bbce55437a10/spider-man-no-way-home-villains-return-header.jpg", "publishedAt": "2021-11-22T00:13:00Z", "content": "There is a lot more going on with the the villains in Spider-Man: No Way Home than we initially thought. The newest trailer for No Way Home made it look like there was some kind of nano-tech enhancem… [+1110 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exotic New Material Could Be Two Superconductors in One – With Serious Quantum Computing Applications - SciTechDaily", "description": "Work has potential applications in quantum computing, and introduces new way to plumb the secrets of superconductivity. MIT physicists and colleagues have demonstrated an exotic form of superconductivity in a new material the team synthesized only about a yea…", "url": "https://scitechdaily.com/exotic-new-material-could-be-two-superconductors-in-one-with-serious-quantum-computing-applications/", "urlToImage": "https://scitechdaily.com/images/Advanced-Quantum-Computer-Concept.gif", "publishedAt": "2021-11-21T22:08:50Z", "content": "ByElizabeth A. Thomson, MIT Materials Research LaboratoryNovember 21, 2021\r\nWork has potential applications in quantum computing, and introduces new way to plumb the secrets of superconductivity.\r\nMI… [+8259 chars]"}, {"source": {"id": null, "name": "Pistonheads.com"}, "author": "Matt Bird", "title": "Ferrari announces 840hp V12 Daytona SP3 - Pistonheads.com", "description": "Most powerful Ferrari V12 ever, Can-Am inspired styling, LaFerrari tech - and you thought the 812 Comp was bold...", "url": "https://www.pistonheads.com/news/ph-eurocars/ferrari-announces-840hp-v12-daytona-sp3/44964", "urlToImage": "https://images.pistonheads.com/nimg/44964/Daytona_SP3_01.jpg", "publishedAt": "2021-11-21T20:05:44Z", "content": "The bar was set extremely high for the Ferrari Icona cars after the Monza SP1 and SP2. They looked sensational and were powered by arguably the greatest V12 in production, which was more than enough.… [+4962 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Clever Physics Experiment That Produces “Something From Nothing” - SciTechDaily", "description": "New theory ‘detects’ light in the darkness of a vacuum. Black holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundaries of these massive objects, including light. The precise natu…", "url": "https://scitechdaily.com/clever-physics-experiment-that-produces-something-from-nothing/", "urlToImage": "https://scitechdaily.com/images/Black-Hole-Event-Horizon.gif", "publishedAt": "2021-11-21T18:27:40Z", "content": "New theory ‘detects’ light in the darkness of a vacuum.\r\nBlack holes are regions of space-time with huge amounts of gravity. Scientists originally thought that nothing could esca­­­­­pe the boundarie… [+5968 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Stunning Telephoto Snapshot of an Almost Total Lunar Eclipse - SciTechDaily", "description": "Predawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the lunar disk is not quite entirely immersed in Earth's dark umbral shadow during a long partial lunar eclipse. The partial eclipse w…", "url": "https://scitechdaily.com/stunning-telephoto-snapshot-of-an-almost-total-lunar-eclipse/", "urlToImage": "https://scitechdaily.com/images/Almost-Total-Lunar-Eclipse-Crop.jpg", "publishedAt": "2021-11-21T12:10:17Z", "content": "An Almost Total Lunar Eclipse. Credit &amp; Copyright: Robert Fedez\r\nPredawn hours of November 19 found the Moon in partly cloudy skies over Cancun, Mexico. Captured in this telephoto snapshot, the l… [+517 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Chukwuemeka Fred Agbata Jnr", "title": "Deploying technology to address food insecurity - The Punch", "description": null, "url": "https://punchng.com/deploying-technology-to-address-food-insecurity/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2020/05/31173538/Chukwuemeka-Fred-Agbata1.jpg", "publishedAt": "2021-11-20T23:20:28Z", "content": "Extreme poverty and hunger continue to fuel increases in food thefts and other petty crimes. If this ugly development is left unaddressed, the situation could become volatile causing an uprising agai… [+6426 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa faces a massive car problem, analysts warn - BusinessTech", "description": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030 which means there is an urgent need for added investment to shift to electric vehicle (EV) manufacturin…", "url": "https://businesstech.co.za/news/motoring/533744/south-africa-faces-a-massive-car-problem-analysts-warn/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/03/I-pace-electric-car.png", "publishedAt": "2021-11-20T10:01:14Z", "content": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030, which means there is an urgent need for ad… [+4181 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Daryl Baxter", "title": "iOS 16 release date rumors, supported iPhones and 5 features we want to see - TechRadar", "description": "What could be next for iOS?", "url": "https://www.techradar.com/news/ios-16-release-date-rumors-supported-iphones-and-5-features-we-want-to-see", "urlToImage": "https://cdn.mos.cms.futurecdn.net/vnbWZdpBazALtJQPc7rMN3-1200-80.jpg", "publishedAt": "2021-11-20T09:34:25Z", "content": "After seeing the releases of iOS 15\r\n and the subsequent iPhone 13\r\n series, we’re in the midst of .1 updates that are slowly refining features we’ve been seeing since June, back at WWDC\r\n.\r\nHowever,… [+6210 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Alex Whitelock", "title": "Best Samsung Black Friday deals: save on QLED TVs, Galaxy S21, and more today - TechRadar", "description": "Huge discounts on some of the best tech in the business", "url": "https://www.techradar.com/news/best-samsung-black-friday-deals-save-on-qled-tvs-galaxy-s21-and-more-today", "urlToImage": "https://cdn.mos.cms.futurecdn.net/ZQeUxYt5KUDXHR6wenbttA-1200-80.jpg", "publishedAt": "2021-11-19T23:00:55Z", "content": "We may be a week away from the big day itself, but you don't have to wait if you're looking for Samsung Black Friday deals - there are already a ton of excellent early discounts available on the main… [+1628 chars]"}]}