{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Can You Last a Year on Mars? NASA Is Recruiting Crew Members for Analog Mission - SciTechDaily", "description": "Want to try living on Mars, but not sure you want to experience the nine-month flight time to get there? NASA is looking for applicants to serve as crew members for a one-year analog mission in a habitat to simulate life on the Red Planet, beginning in Fall 2…", "url": "https://scitechdaily.com/can-you-last-a-year-on-mars-nasa-is-recruiting-crew-members-for-analog-mission/", "urlToImage": "https://scitechdaily.com/images/NASA-Desert-Rats-Suit.jpg", "publishedAt": "2021-08-22T12:37:41Z", "content": "ByNancy AtkinsonAugust 22, 2021\r\nCredit: NASA\r\nWant to try living on Mars\r\nMars is the second smallest planet in our solar system and the fourth planet from the sun. Iron oxide is prevalent in Mars' … [+5339 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lewis Gordon", "title": "How Season on PS5 is taking in-game photography back to the future - Techradar", "description": "Inside the making of Season's timeless photographic world", "url": "https://www.techradar.com/news/how-season-on-ps5-is-taking-in-game-photography-back-to-the-future", "urlToImage": "https://cdn.mos.cms.futurecdn.net/LFKpwn4PqMQoGi2xX4PWiT-1200-80.jpg", "publishedAt": "2021-08-22T09:00:00Z", "content": "How can a camera change the way you see the world? This is the foundational question of photography, but also an increasing number of photo-centric games, including the much-anticipated PS5 and PC ro… [+9213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, CNN", "title": "Full FDA approval for the Pfizer/BioNTech vaccine will likely drive up vaccination rates, experts say - CNN", "description": "With the Pfizer/BioNTech vaccine expected to be given full approval by the US Food and Drug Administration in the coming days, health experts say the decision may drive more Americans toward receiving Covid-19 vaccines.", "url": "https://www.cnn.com/2021/08/22/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210822021048-florida-vaccination-0813-super-tease.jpg", "publishedAt": "2021-08-22T07:49:00Z", "content": "(CNN)With the Pfizer/BioNTech vaccine expected to be given full approval by the US Food and Drug Administration in the coming days, health experts say the decision may drive more Americans toward rec… [+5123 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "CapitalSage Raises $ 4 Million to Deepen Financial Inclusion - BollyInside - BollyInside", "description": "This makes CapitalSage the first fintech company to be noted on a Private Markets platform and the fintech company which has raised the highest debt", "url": "https://www.bollyinside.com/news/capitalsage-raises-4-million-to-deepen-financial-inclusion", "urlToImage": null, "publishedAt": "2021-08-22T07:01:05Z", "content": "This makes CapitalSage the first fintech company to be noted on a Private Markets platform and the fintech company which has raised the highest debt amount in the Nigerian capital markets. The compan… [+1524 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Push for mandatory Covid-19 vaccines in South Africa: report - BusinessTech", "description": "The ministerial advisory committee on Covid-19 is discussing the possibility of introducing mandatory Covid-19 vaccines for certain groups of people, the Sunday Times reports.", "url": "https://businesstech.co.za/news/trending/514888/push-for-mandatory-covid-19-vaccines-in-south-africa-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Vaccine-e1625982135407.jpg", "publishedAt": "2021-08-22T06:02:01Z", "content": "The ministerial advisory committee on Covid-19 is discussing the possibility of mandatory Covid-19 vaccines for specific groups of people, the Sunday Times reports.\r\nScientists and health activists t… [+3824 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "The Canadian Press", "title": "Yordenis Ugas beats Manny Pacquiao - TSN", "description": "Yordenis Ugás beat Manny Pacquiao by unanimous decision on Saturday night, putting on an impressive technical performance on 11 days’ notice and retaining his WBA welterweight title.", "url": "https://www.tsn.ca/yordenis-ugas-beats-manny-pacquiao-1.1684552", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1684553!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/manny-pacquiao-yordenis-ugas.jpg", "publishedAt": "2021-08-22T05:30:41Z", "content": "LAS VEGAS (AP) Yordenis Ugás beat Manny Pacquiao by unanimous decision on Saturday night, putting on an impressive technical performance on 11 days notice and retaining his WBA welterweight title.\r\nU… [+2885 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Genshin Impact 2.1 update announced with new characters, islands and fishing; get free Primogem redeem codes too - HT Tech", "description": "Genshin Impact 2.1 update. The game is set to receive new and updated in-game content as part of the upcoming version 2.1 update. Here’s everything you need to know and how to claim free Primogem rewards right away.", "url": "https://tech.hindustantimes.com/gaming/news/genshin-impact-2-1-update-announced-with-new-characters-islands-and-fishing-get-free-primogem-redeem-codes-too-71629609515370.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/08/22/1600x900/2021082119245498236_1629609486920_1629609512602.jpg", "publishedAt": "2021-08-22T05:18:35Z", "content": "Genshin Impact 2.1 update has just been announced. Popular online action roleplaying game Genshin Impact will receive an update to version 2.1 which will bring important changes to the game, develope… [+2675 chars]"}, {"source": {"id": null, "name": "bdnews24.com"}, "author": null, "title": "Is an exoskeleton suit in your future? - bdnews24.com", "description": "Those of us who are slow or reluctant runners or walkers might soon be able to slip on a lightweight, lower-body exoskeleton and up the speed and ease of our exercise, according to several new studies examining the effects of these high-tech robotic devices. …", "url": "https://bdnews24.com/science/2021/08/22/is-an-exoskeleton-suit-in-your-future", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2021/08/22/exoskeleton-220821-01.jpg/ALTERNATES/w640/exoskeleton-220821-01.jpg", "publishedAt": "2021-08-22T04:08:35Z", "content": "But the latest exoskeleton research also raises provocative questions about what we want from exercise and whether making it easier necessarily makes it better.\r\nExoskeletons have been staples of sci… [+5189 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "NM Press", "title": "Techstars backs Awabah - Nairametrics", "description": "Awabah, a digital platform providing pension access to Africa’s self-employed, today announced that it has been accepted into the Techstars", "url": "https://nairametrics.com/2021/08/21/techstars-backs-awabah/", "urlToImage": "https://nairametrics-prod-s3.s3.eu-west-2.amazonaws.com/wp-content/uploads/2021/08/21173402/Awabah-3.png", "publishedAt": "2021-08-21T16:46:32Z", "content": "Awabah, a digital platform providing pension access to Africas self-employed, today announced that it has been accepted into the Techstars London accelerator program. The startup is dedicated to maki… [+4108 chars]"}, {"source": {"id": null, "name": "Globalriskinsights.com"}, "author": "by  Jordan Dobney", "title": "Technological pull or competitive drive? China’s rover landing sends a message to the United States - Global Risk Insights", "description": "On Friday 14th May, China’s Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hopes their Zhurong rover will give them 90 days of service as…", "url": "https://globalriskinsights.com/2021/08/technological-pull-or-competitive-drive-chinas-rover-landing-sends-a-message-to-the-united-states/", "urlToImage": "https://i0.wp.com/globalriskinsights.com/wp-content/uploads/2021/08/50144550853_9e78484352_b.jpg?fit=800%2C440&ssl=1", "publishedAt": "2021-08-21T15:12:13Z", "content": "On Friday 14th May, Chinas Zhurong rover landed on Mars, becoming the first Chinese spacecraft to do so and only the second nation, behind the US, to land a spacecraft successfully on Mars. China hop… [+5400 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Daniel Sims", "title": "AMD's upcoming AM5 socket for Raphael processors appears to lack PCIe 5.0 support - TechSpot", "description": "TechPowerUp's sources familiar with the ransomware attack on Gigabyte provided them with a block diagram of the AM5 socket, showing its connections to other components. AM5 is...", "url": "https://www.techspot.com/news/90888-amd-upcoming-am5-socket-raphael-processors-appears-lack.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2020/11/2020-11-06-image-33.jpg", "publishedAt": "2021-08-21T14:07:00Z", "content": "In brief: According to TechPowerUp, the socket for AMD's next generation of CPUs will not support PCIe 5.0. This information reportedly came from the ransomware attack Gigabyte suffered earlier this … [+1459 chars]"}, {"source": {"id": null, "name": "Themarketwriteup.com"}, "author": null, "title": "Lung Cancer Screening Software Market is Booming Worldwide | PenRad Technologies, Thynk Health, ProVation Medical - The Market Writeuo - The Market Writeuo", "description": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Market research report shows the latest market insights; curren…", "url": "https://themarketwriteup.com/lung-cancer-screening-software-market-is-booming-worldwide-penrad-technologies-thynk-health-provation-medical/", "urlToImage": null, "publishedAt": "2021-08-21T13:38:58Z", "content": "Latest released the research study on Global Lung Cancer Screening Software Market, offers a detailed overview of the factors influencing the global business scope. Lung Cancer Screening Software Mar… [+5073 chars]"}, {"source": {"id": null, "name": "The Irish News"}, "author": "", "title": "China's Mars rover soldiers on after finishing initial programme - The Irish News", "description": "The National Space Administration said the Zhurong rover completed its 90-day programme on August 15 and was in excellent technical condition.", "url": "https://www.irishnews.com/magazine/science/2021/08/21/news/china-s-mars-rover-soldiers-on-after-finishing-initial-programme-2424556/", "urlToImage": "http://www.irishnews.com/picturesarchive/irishnews/irishnews/2021/08/21/160059862-69c0ddba-0ca5-4281-90c2-568c676933f8.jpg", "publishedAt": "2021-08-21T10:07:03Z", "content": "China’s Mars rover is soldiering on after completing its initial programme to explore the red planet and search for frozen water that could provide clues to whether it once supported life.\r\nThe Natio… [+1762 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "https://www.facebook.com/TechRadar", "title": "Samsung Galaxy Watch 4 review: The return of Wear OS - TechRadar", "description": "Samsung embraces Wear OS once again", "url": "https://www.techradar.com/uk/reviews/samsung-galaxy-watch-4-review", "urlToImage": "https://cdn.mos.cms.futurecdn.net/oyJAAFYVTVbzf3RKXSUQ7W-1200-80.jpg", "publishedAt": "2021-08-20T16:27:11Z", "content": "Two-minute review\r\nThe Samsung Galaxy Watch 4 is a sequel to one of our favorite smartwatches ever, and its the first time in a while that weve seen the company embrace Wear OS software. Its not your… [+12422 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "World’s first plasmid DNA vaccine against Covid-19 gets emergency approval in India - RT", "description": "India’s drug regulator has approved a three-dose Covid-19 vaccine which uses plasmid DNA technology developed by indigenous drugmaker Zydus Cadila, after trials indicated it was 66.6% effective.", "url": "https://www.rt.com/news/532650-cadila-india-covid-plasmid-vaccine/", "urlToImage": "https://cdni.rt.com/files/2021.08/article/611fd17385f54058d23e8ae9.JPG", "publishedAt": "2021-08-20T16:01:00Z", "content": "On Friday, the Drug Controller General of India gave the green light to Zydus Cadila’s Covid-19 vaccine. The inoculation, now the sixth such to be approved in India, has received Emergency Use Author… [+2009 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How hesitant are South Africans about getting vaccinated? - BusinessTech", "description": "Large surveys offer different views on vaccine acceptance in South Africa.", "url": "https://businesstech.co.za/news/trending/514816/how-hesitant-are-south-africans-about-getting-vaccinated/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Vaccine-e1625982135407.jpg", "publishedAt": "2021-08-20T13:11:40Z", "content": "Vaccinations are now open to all adult South Africans at long last. In recent weeks, there has been growing concern that demand for vaccines among people over 35 is waning. Large surveys on peoples v… [+8636 chars]"}]}