{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ANI", "title": "Zika Virus: Work is being done to manufacture vaccine, says NTAGI Chief Dr NK Arora - Economic Times", "description": "Talking about Zika Virus, National Technical Advisory Group on Immunisation (NTAGI) chief Dr NK Arora on December 13 said that work is being done to manufacture a vaccine for Zika Virus. Pregnant women and their children are being monitored. “Cervical cancer …", "url": "https://economictimes.indiatimes.com/news/india/zika-virus-work-is-being-done-to-manufacture-vaccine-says-ntagi-chief-dr-nk-arora/videoshow/96205590.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96205590,width-1070,height-580,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-13T15:44:00Z", "content": "Talking about Zika Virus, National Technical Advisory Group on Immunisation (NTAGI) chief Dr NK Arora on December 13 said that work is being done to manufacture a vaccine for Zika Virus. Pregnant wom… [+765 chars]"}, {"source": {"id": null, "name": "Westernu.ca"}, "author": null, "title": "Western News - Expert Insight: Canada's space technology a crucial contribution to the Artemis missions - Western News", "description": "Following the Artemis I mission, Canada is now poised to embark on a new era of lunar exploration", "url": "https://news.westernu.ca/2022/12/expert-insight-canadas-space-technology-a-crucial-contribution-to-the-artemis-missions/", "urlToImage": "https://news.westernu.ca/wp-content/uploads/sites/2/2022/12/Artemis_1_at_maximum_distance_from_Earth.jpg", "publishedAt": "2022-12-13T15:30:22Z", "content": "Fifty years ago this month was the last time humans walked on the surface of the moon, during the Apollo 17 mission. NASA recently took the first major step in returning humans to the moon with the A… [+6128 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Eric Berger", "title": "After Russia’s exit from the Lunar Gateway, NASA has found a new partner in UAE - Ars Technica", "description": "The United Arab Emirates is a founding member of the Artemis Accords.", "url": "https://arstechnica.com/science/2022/12/nasa-is-negotiating-with-uae-to-provide-an-airlock-for-the-lunar-gateway/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2022/12/51669007347_e15d528149_k-760x380.jpg", "publishedAt": "2022-12-13T14:50:01Z", "content": "Enlarge/ An artist's concept of the Lunar Gateway that includes elements from international partners.\r\n53 with 0 posters participating\r\nRelations between NASA and Russia's state-owned space corporati… [+3667 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Ryugu asteroid samples continue to reveal solar system history - Tech Explorist", "description": "These primitive samples from Ryugu represent the best estimate of the solar composition to date.", "url": "https://www.techexplorist.com/ryugu-asteroid-samples-continue-reveal-solar-system-history/55378/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/12/Samples-of-asteroid-Ryugu.jpg", "publishedAt": "2022-12-13T12:41:33Z", "content": "Initial analyses showed that asteroid Ryugu’s composition is close to CI (Ivuna-like) carbonaceous chondrites (CCs) the chemically most primitive meteorites, characterized by near-solar abundances fo… [+2191 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "From Sony, Apple, Samsung to JBL, 10 Best Wireless Earphones for iPhones and Smartphones - HT Tech", "description": "Looking for great wireless earphones to buy? From Sony, Apple to Bose, check out the 10 Best Wireless Earphones for iPhones and Smartphones from options like Sony, Apple, Samsung, JBL and more.", "url": "https://tech.hindustantimes.com/web-stories/from-sony-apple-samsung-to-jbl-10-best-wireless-earphones-for-iphones-and-smartphones-71670933407304.html", "urlToImage": null, "publishedAt": "2022-12-13T12:38:31Z", "content": "Great earphones not only provide supreme audio quality but are also built to last. Features like wireless connectivity, Active Noise Cancellation, great battery life, water and sweat resistance, and … [+45 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Women Experience More Adverse Drug Reactions – A New Mouse Study May Explain Why - Technology Networks", "description": "A new study in mice has shown that the biomedical assumption that women are \"smaller males\" is not well supported for most clinical traits, and adverse drug reactions are unlikely to be alleviated by simply adjusting for body weight.", "url": "https://www.technologynetworks.com/drug-discovery/news/women-experience-more-adverse-drug-reactions-a-new-mouse-study-may-explain-why-368393", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/368393/women-experience-more-adverse-drug-reactions-a-new-mouse-study-may-explain-why-368393-640x360.jpg?cb=20221213", "publishedAt": "2022-12-13T09:52:21Z", "content": "Compared to men, we know much less about how women experience disease.\r\nBiomedical research helps us understand the timeline of diseases and how we can treat them. In the past, most of it has been co… [+5530 chars]"}, {"source": {"id": null, "name": "Bizcommunity.com"}, "author": "Marce Bester", "title": "Access over ownership - subscription models are dominating the tech industry - ASUS - Bizcommunity.com", "description": "The subscription economy is forever changing how consumers interact with brands. As a result, we're raising a generation that'll have a complicated relationship with ownership...", "url": "https://www.bizcommunity.com/Article/196/743/234434.html", "urlToImage": "https://biz-file.com/c/2212/681658.png", "publishedAt": "2022-12-13T09:33:46Z", "content": "And tech industry behemoths are heavily invested. Last month, Sony’s PlayStation announced its newly revamped PlayStation Plus subscription service for games. The new offering is positioned in direct… [+5824 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Saiful Ridzaimi", "title": "OnePlus Monitor X27 and E24 release: 165Hz refresh rate, 1ms response time and QHD resolution at ~RM1501 - TechNave", "description": "After being teased by OnePlus, the company has finally released its first-ever gaming monitors, the OnePlus Monitor X27 and OnePlus Monitor E24. The former will", "url": "https://technave.com/gadget/OnePlus-Monitor-X27-and-E24-release-165Hz-refresh-rate-1ms-response-time-and-QHD-resolution-at-RM1501-32767.html", "urlToImage": "https://technave.com/data/files/article/202212130634049403.jpg", "publishedAt": "2022-12-13T06:38:58Z", "content": "After being teased by OnePlus, the company has finally released its first-ever gaming monitors, the OnePlus Monitor X27 and OnePlus Monitor E24. The former will be available for purchase in India thi… [+1919 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Find the mystery asteroid! ESA sends Christmas challenge over humongous asteroid - HT Tech", "description": "The ESA has thrown a Christmas challenge for astronomy enthusiasts and has asked them to find a 262-foot wide mystery asteroid which will come dangerously close to the Earth. It is called the Christmas asteroid.", "url": "https://tech.hindustantimes.com/tech/news/find-the-mystery-asteroid-esa-sends-christmas-challenge-over-humongous-asteroid-71670911222205.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/12/13/1600x900/asteroid_1669302391906_1670911268413_1670911268413.webp", "publishedAt": "2022-12-13T06:02:57Z", "content": "The 12 days of Christmas have begun and while many are preparing for the festivities, the European Space Agency (ESA) is adding to the excitement with its Christmas challenge. It has thrown a strange… [+2278 chars]"}, {"source": {"id": null, "name": "Geek Culture"}, "author": null, "title": "Yahoo Year In Review Shares The Tech That Dominated Singapore In 2022 - Geek Culture", "description": "Yahoo Year in Review 2022 reveals the top tech-related online searches in Singapore, and Apple products top the list.", "url": "https://geekculture.co/yahoo-year-in-review-shares-the-tech-that-dominated-singapore-in-2022/", "urlToImage": "https://geekculture.co/wp-content/uploads/2022/10/iphone-14-feature-image.jpg", "publishedAt": "2022-12-13T05:15:53Z", "content": "With the year winding down to a close, it’s a time for reflection and retrospection. You might ask yourself questions like “I wonder what tech products people were buying this year?” or “What was the… [+2043 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Stocks to Watch: Paytm, Dalmia, ICICI Bank, Tata Motors, HCL Tech | Mint - Mint", "description": "NSE maintains Delta Corp, Bhel, Gujarat Narmada Valley Fertilizers & Chemicals, and Punjab National Bank stocks on the list of banned securities under the F&O segment for Tuesday trading as they have crossed 95% of the market-wide position limit.", "url": "https://www.livemint.com/market/stock-market-news/stocks-to-watch-paytm-dalmia-icici-bank-tata-motors-hcl-tech-11670892155985.html", "urlToImage": "https://images.livemint.com/img/2022/12/13/600x338/stock-kpeE--621x414LiveMint_1670892256082_1670892256193_1670892256193.jpg", "publishedAt": "2022-12-13T02:01:06Z", "content": "One 97 Communications: The board of One 97 Communications Ltd, the operator of the country's largest digital payments provider Paytm, will meet today to consider a share buyback proposal after the fi… [+4489 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Matt Shipman", "title": "Fossil-sorting robots will help researchers study oceans and climate - Phys.org", "description": "Researchers have developed and demonstrated a robot capable of sorting, manipulating, and identifying microscopic marine fossils. The new technology automates a tedious process that plays a key role in advancing our understanding of the world's oceans and cli…", "url": "https://phys.org/news/2022-12-fossil-sorting-robots-oceans-climate.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/fossil-sorting-robots.jpg", "publishedAt": "2022-12-12T19:44:39Z", "content": "Researchers have developed and demonstrated a robot capable of sorting, manipulating, and identifying microscopic marine fossils. The new technology automates a tedious process that plays a key role … [+4530 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Ari Natter and Will Wade", "title": "‘Game changer’: US says scientists have made breakthrough in nuclear fusion energy - Sydney Morning Herald", "description": "The fusion reaction generated more energy than it consumed. Though that is still many years away, the technology offers the promise of abundant carbon-free electricity.", "url": "https://www.smh.com.au/world/north-america/us-says-scientists-have-made-breakthrough-in-nuclear-fusion-energy-20221213-p5c5sz.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2942%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_86/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/8ad1551fd603d65ea83da728f3a09f59ca569740", "publishedAt": "2022-12-12T18:57:42Z", "content": "A spokeswoman for the Lawrence Livermore National Laboratory said the analysis was still ongoing and it would share more details on Tuesday (US time).\r\nWhile the results represent a breakthrough, its… [+1259 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "200,000 square metres of new shopping malls in South Africa – with more to come - BusinessTech", "description": "South African retailers and consumers are feeling the pinch, but that has done little to stop the country’s obsession with shopping malls.", "url": "https://businesstech.co.za/news/finance/650953/200000-square-metres-of-new-shopping-malls-in-south-africa-with-more-to-come/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/12/mall-of-africa.jpg", "publishedAt": "2022-12-12T10:52:30Z", "content": "Update: BrandMapp has corrected the figure to 200,000 square metres.\r\nSouth Africa added over 200,000 square metres of new regional shopping mall space in 2022, showing an incredibly resilient retail… [+4699 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Download Huawei AppGallery App (12.7.1.200 beta) - HC Newsroom", "description": "AppGallery allows you to download a bunch of apps on Huawei smartphones and other platforms. This app is designed and developed by the Chinese tech maker for EMUI and HarmonyOS software. Over the past three years, Huawei has boasted the app distribution platf…", "url": "https://www.huaweicentral.com/download-huawei-appgallery-app-1/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/11/appgallery-img-download-1-1000x576.jpg", "publishedAt": "2022-12-12T08:48:18Z", "content": "AppGallery allows you to download a bunch of apps on Huawei smartphones and other platforms. This app is designed and developed by the Chinese tech maker for EMUI and HarmonyOS software.\r\nOver the pa… [+2306 chars]"}]}