{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Asteroid 2023 JL hurtling towards Earth for very close approach; Know details - HT Tech", "description": "An asteroid is on its way towards Earth, travelling at a fearsome speed and it could make its closest approach to the planet today. Check out its speed, distance and other details, as revealed by NASA.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2023-jl-hurtling-towards-earth-for-very-close-approach-know-details-71683779439739.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/11/cropped/16-9/asteroid-6075441_640_1683023282496_1683779516514.jpg?impolicy=new-ht-20210112&width=1600", "publishedAt": "2023-05-11T04:32:28Z", "content": "Every day, asteroids come close to Earth, but how is it possible to observe and track these space rocks which are millions of kilometers away in space? NASA uses telescopes, such as Pans-STARRS1 in M… [+1976 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Shiny, Steamy Surprise: NASA's Webb Takes Closest Look Yet at Mysterious Planet - SciTechDaily", "description": "NASA's James Webb Space Telescope has observed a steamy, highly reflective mini-Neptune exoplanet, GJ 1214 b, using its Mid-Infrared Instrument (MIRI) to reveal details about its atmosphere. The watery atmosphere suggests that the planet formed farther from i…", "url": "https://scitechdaily.com/a-shiny-steamy-surprise-nasas-webb-takes-closest-look-yet-at-mysterious-planet/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-GJ-1214-b-and-Its-Star-scaled.jpg", "publishedAt": "2023-05-11T03:22:36Z", "content": "ByPat Brennan, NASA's Exoplanet Exploration ProgramMay 10, 2023\r\nThis artists concept depicts the planet GJ 1214 b, a mini-Neptune with what is likely a steamy, hazy atmosphere. A new study based on … [+11708 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Engineered Bacteria Offer a Powerful New Way To Combat Climate Change - SciTechDaily", "description": "Researchers have uncovered a novel pathway in bacteria that holds the potential to decarbonize various industries. This breakthrough could significantly decrease the emission of greenhouse gases generated during the production of fuels, drugs, and chemicals. …", "url": "https://scitechdaily.com/?p=276124", "urlToImage": "https://scitechdaily.com/images/Streptomyces-Sample.jpg", "publishedAt": "2023-05-10T23:16:21Z", "content": "ByLawrence Berkeley National LaboratoryMay 10, 2023\r\nDuring experiments at DOEs Joint BioEnergy Institute, researchers observed an engineered strain of the bacteria Streptomyces as it produced cyclop… [+4996 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA Astronomy Picture of the Day 10 May 2023: Milky Way Galaxy visible in Egyptian skies - HT Tech", "description": "Today’s NASA Astronomy Picture of the Day is a snapshot of the Milky Way Galaxy shot in the Egyptian Desert.", "url": "https://tech.hindustantimes.com/tech/news/nasa-astronomy-picture-of-the-day-10-may-2023-milky-way-galaxy-visible-in-egyptian-skies-71683697456112.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/10/cropped/16-9/Untitled_design_1683697889990_1683697895618.jpg?impolicy=new-ht-20210112&width=1600", "publishedAt": "2023-05-10T05:52:41Z", "content": "The Milky Way Galaxy is our home galaxy. Our solar system, with the Sun at the centre and 8 other planets, reside in an obscure part of the Galaxy. It is a barred spiral galaxy which spans about 100,… [+1731 chars]"}]}