{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nishtha Awasthi", "title": "India Cements shares rally 10% as UltraTech buys non controlling stake via block deal - The Economic Times", "description": "India Cements' shares jumped 13.7% in early Thursday, hitting a new 52-week high of Rs 299. This surge followed UltraTech Cement's approval to acquire a non-controlling 23% stake, crossing the company's market capitalization past the $1 billion mark. The deal…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/india-cements-shares-rally-10-as-ultratech-buys-non-controlling-stake-via-block-deal/articleshow/111304340.cms", "urlToImage": "https://img.etimg.com/thumb/msid-111304318,width-1200,height-630,imgsize-97734,overlay-etmarkets/photo.jpg", "publishedAt": "2024-06-27T05:41:53Z", "content": "(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets… [+317 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "Google improves search experience in the Chrome mobile app - TechCrunch", "description": "Facing new competition from startups like Arc, Google announced on Wednesday that it’s bringing five new features to the Chrome browser on mobile devices, Google is bringing new features to the Chrome browser on mobile devices, designed to enhance the search …", "url": "https://techcrunch.com/2024/06/26/google-chrome-mobile-app-updates-ios-android/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/06/Chrome-app-updates-2024.png?w=1200", "publishedAt": "2024-06-26T19:16:10Z", "content": "Facing new competition from startups like Arc, Google announced on Wednesday that its bringing five new features to the Chrome browser on mobile devices, each designed to enhance the search experienc… [+2000 chars]"}]}