{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "CRN"}, "author": "Mark Haranas", "title": "Why Accenture Is Laying Off 19,000 Employees: 5 Things To Know - CRN", "description": "Here’s why Accenture is laying off 19,000 employees as the IT services and consultancy tech company continues to grow sales and acquisitions.", "url": "https://www.crn.com/news/channel-news/why-accenture-is-laying-off-19-000-employees-5-things-to-know", "urlToImage": "https://www.crn.com/resources/027c-16e18a67f524-b55fbf6feb29-1000/accenture-sign-new.jpeg", "publishedAt": "2023-03-23T19:39:00Z", "content": "Over the next 18 months, these actions are expected to result in the departure of approximately 19,000 people (or 2.5 percent of our current workforce), and we expect over half of these departures wi… [+2111 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Alien Sandstorms: NASA's Webb Unravels the Mysteries of Planet VHS 1256 b's Silicate Clouds - SciTechDaily", "description": "Weather report: Expect scattered, patchy clouds made up of silicates on planet VHS 1256 b. Ever had hot sand whip across your face? That’s a soothing experience compared to the volatile conditions discovered high in the atmosphere of planet VHS 1256 b. Resear…", "url": "https://scitechdaily.com/alien-sandstorms-nasas-webb-unravels-the-mysteries-of-planet-vhs-1256-bs-silicate-clouds/", "urlToImage": "https://scitechdaily.com/images/Exoplanet-VHS-1256-b-and-Its-Stars-scaled.jpg", "publishedAt": "2023-03-23T17:21:36Z", "content": "BySpace Telescope Science InstituteMarch 23, 2023\r\nThis illustration conceptualizes the swirling clouds identified by the James Webb Space Telescope in the atmosphere of exoplanet VHS 1256 b. The pla… [+13949 chars]"}, {"source": {"id": null, "name": "Techtarget.com"}, "author": "Esther Ajao", "title": "Don’t count out Google and its AI chatbot Bard from AI race - TechTarget", "description": "The tech giant may have been forced to respond as Microsoft and OpenAI dominate the generative AI market. However, it might still come out on top of its competitors.", "url": "https://www.techtarget.com/searchenterpriseai/news/365533755/Dont-count-out-Google-and-its-AI-chatbot-Bard-from-AI-race", "urlToImage": "https://cdn.ttgtmedia.com/rms/onlineimages/chatbot_g1150454068.jpg", "publishedAt": "2023-03-23T14:54:24Z", "content": "After Google expanded the availability of its AI chatbot Bard this week, the AI arms race has become more of a comparison game than ever before.\r\nGoogles opening access to the generative AI chatbot c… [+2953 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Jacob Roach", "title": "One of the largest tech YouTube channels was killed by crypto scammers - Digital Trends", "description": "The Linus Tech Tips YouTube channel, along with several related channels, has been terminated after being hijacked by a crypto scam.", "url": "https://www.digitaltrends.com/computing/linus-tech-tips-offline-after-cryptoscam/", "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/03/youtube-sad-linus.jpg?resize=1200%2C630&p=1", "publishedAt": "2023-03-23T14:25:11Z", "content": "Multiple YouTube channels under the Linus Media Group (LMG) brand have been taken offline after being hijacked by crypto scammers. The main Linus Tech Tip YouTube channel, which has amassed over 15 m… [+2120 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Nikhil Agarwal", "title": "Tech View: Nifty charts indicate sell on rise pattern. What should traders do on Friday - Economic Times", "description": "“The market could find a range of around 17,200-16,950 levels in the next few sessions. The lower area of 16,950-16,900 is expected to offer support for the market during the present weakness. A decisive move above 17200-17250 levels is likely to bring streng…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/tech-view-nifty-charts-indicate-sell-on-rise-pattern-what-should-traders-do-on-friday/articleshow/98944943.cms", "urlToImage": "https://img.etimg.com/thumb/msid-98945004,width-1070,height-580,imgsize-146227,overlay-etmarkets/photo.jpg", "publishedAt": "2023-03-23T12:31:00Z", "content": "NEW DELHI: Nifty today formed a small red candle with a long upper shadow on the daily charts. Chart readers said this pattern indicates that the market is on a sell on rise mode from near the crucia… [+2579 chars]"}]}