{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Solar storm threat for Earth continues amid NOAA satellites detecting sunspot decay - HT Tech", "description": "NOAA satellites have spotted a decay in the magnetic field of sunspot AR3311. As a result, it has reduced the chances of an X-class solar flare eruption from 30% to 20%. However, it may be too early to write off the solar storm threat.", "url": "https://tech.hindustantimes.com/tech/news/solar-storm-threat-for-earth-continues-amid-noaa-satellites-detecting-sunspot-decay-71684907748247.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/24/1600x900/Sun_and_the_sea_1681961926459_1684907778392.jpg", "publishedAt": "2023-05-24T05:58:38Z", "content": "Yesterday, it was reported that a highly unstable sunspot, AR3311, which was responsible for an X-class solar flare eruption last week, has now entered the full view of Earth. The National Oceanic an… [+2005 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Ancient Saber-Toothed Predator Sheds Light on the “Great Dying” Extinction Event - SciTechDaily", "description": "A recent study reveals intriguing insights into the catastrophic \"Great Dying\" extinction event 252 million years ago, focusing on the role of a tiger-sized, saber-toothed creature called Inostrancevia. Unearthed fossils indicate that this creature migrated 7…", "url": "https://scitechdaily.com/ancient-saber-toothed-predator-sheds-light-on-the-great-dying-extinction-event/", "urlToImage": "https://scitechdaily.com/images/Giant-Gorgonopsian-Inostrancevia-With-Dicynodont-Prey.jpg", "publishedAt": "2023-05-23T09:17:02Z", "content": "ByField MuseumMay 23, 2023\r\nGiant gorgonopsian Inostrancevia with its dicynodont prey, scaring off the much smaller African species Cyonosaurus. Credit: Art by Matt Celeskey\r\nA recent study reveals i… [+8435 chars]"}]}