{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Sarah Perez", "title": "Snapchat’s parent lays off 10% of workforce in order to ‘reduce hierarchy,’ says company - TechCrunch", "description": "Snapchat maker Snap is the latest tech company to conduct layoffs with its newly announced plans for a 10% workforce reduction, the company said on", "url": "https://techcrunch.com/2024/02/05/snapchats-parent-lays-off-10-of-workforce-in-order-to-reduce-hierarchy-says-company/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/01/GettyImages-1172921170.jpg?w=1024", "publishedAt": "2024-02-05T16:07:30Z", "content": "Snapchat maker Snap is the latest tech company to conduct layoffs with its newly announced plans for a 10% workforce reduction, the company said on Monday. The layoffs would impact roughly 500-plus e… [+3597 chars]"}, {"source": {"id": null, "name": "Dst.gov.in"}, "author": null, "title": "New algorithm can produce better images to study ultracold atoms that exhibit quantum mechanics governed properties - Department Of Science & Technology", "description": "The Department of Science & Technology plays a pivotal role in promotion of science & technology in the country.", "url": "https://dst.gov.in/new-algorithm-can-produce-better-images-study-ultracold-atoms-exhibit-quantum-mechanics-governed", "urlToImage": null, "publishedAt": "2024-02-05T12:01:26Z", "content": "Scientists have designed a new image-correction technique capable of getting better images during the study of cold atoms or atoms at absolute zero temperature.  \r\nThe technique can get rid of 50 per… [+4340 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Rethinking Human Ancestry: New Study Challenges Homo naledi Burial Claims - SciTechDaily", "description": "Recent research challenges the assertions that Homo naledi, an ancient human relative with a smaller brain dating back to 335-241,000 years ago, intentionally buried their deceased and created rock art in Rising Star Cave, South Africa. Three pre-print articl…", "url": "https://scitechdaily.com/rethinking-human-ancestry-new-study-challenges-homo-naledi-burial-claims/", "urlToImage": "https://scitechdaily.com/images/Neanderthal-Caveman-Close-Up-Concept.jpg", "publishedAt": "2024-02-04T21:18:55Z", "content": "A recent study challenges previous claims that Homo naledi, a species dating back to between 335-241,000 years ago, deliberately buried their dead and created rock art in Rising Star Cave, South Afri… [+3638 chars]"}]}