{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "usa-today", "name": "USA Today"}, "author": "Felecia Wellington Radel", "title": "Recent Apple updates focus on health tech. Experts think that's a big deal. - USA TODAY", "description": "What do updates like the ones Apple introduced actually mean for consumers and fit into an existing healthcare culture? Experts weigh in.", "url": "https://www.usatoday.com/story/tech/2024/10/03/apple-updates-health-tech/75478460007/", "urlToImage": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/09/09/USAT/75146474007-image-8.png?crop=2497,1404,x27,y0&width=2497&height=1404&format=pjpg&auto=webp", "publishedAt": "2024-10-03T09:12:19Z", "content": "Forget flying cars, the most promising personal tech trend of the future might focus on health.\r\nDuring Apple's iPhone event in September, the announcements that sparked initial buzz weren't the new … [+5957 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Brian Heater", "title": "Oura Ring 4 debuts slimmer design, additional sizes, and improved sensing starting at $349 - TechCrunch", "description": "The Oura Ring 4 is up for preorder starting Thursday and starts shipping October 15. Users get one month of membership to its software offering for free.", "url": "https://techcrunch.com/2024/10/03/oura-ring-4-debuts-slimmer-design-additional-sizes-and-improved-sensing-starting-at-349/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/10/05-Oura-Ring-Lifestyle.jpg?resize=1200,775", "publishedAt": "2024-10-03T07:01:00Z", "content": "Oura on Thursday unveiled the fourth generation of its popular smart ring. The Oura Ring 4 arrives just under three years after its predecessors debut. Despite the gap, the new wearable largely refin… [+3687 chars]"}, {"source": {"id": null, "name": "Wccftech"}, "author": "Ali Salman", "title": "Base Variant Of Samsung’s Galaxy S25 Lineup To Feature Dimensity 9400 Chip Instead Of Snapdragon 8 Gen 4, Possibly Due To Lower Cost - Wccftech", "description": "The base variant of Samsung's Galaxy S25 lineup is tipped to feature MediaTek's Dimensity 9400 chip instead of Snapdragon 8 Gen 4.", "url": "https://wccftech.com/base-galaxy-s25-to-feature-dimensuty-chip-instead-of-snapdragon/", "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2024/10/S25.jpg", "publishedAt": "2024-10-03T06:03:00Z", "content": "Samsung is expected to launch its highly anticipated Galaxy S25 series early next year and the devices are rumored to bring some notable changes to the lineup. Externally, we can expect rounded edges… [+2280 chars]"}]}