{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Navdeep Singh", "title": "Sensex, Nifty drop tracking negative cues from Asian markets - The Economic Times", "description": "From the Sensex pack, Kotak Mahindra Bank and JSW Steel were the top losers, falling 1-2%. HUL, Titan, Tata Steel, Reliance Industries, Maruti and Tata Steel also opened in the red. Whereas, L&T, Infosys, ITC, IndusInd Bank, Wipro, SBI, and UltraTech Cement o…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sensex-nifty-drop-tracking-negative-cues-from-asian-markets/articleshow/102067675.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102067715,width-1070,height-580,imgsize-2028952,overlay-etmarkets/photo.jpg", "publishedAt": "2023-07-24T04:01:00Z", "content": "Following negative cues from Asian peers, Indian equity markets opened marginally lower on Monday, dragged by index heavyweight Reliance Industries and FMCG stocks.The BSE Sensex was trading 124 poin… [+3286 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Race for Nuclear Time – Scientists Make Important Advance - SciTechDaily", "description": "Nuclear clocks could potentially enable scientists to delve into the universe's fundamental forces in future research endeavors. A critical step forward in this field has been taken by researchers at LMU as part of an international collaboration. Atomic clock…", "url": "https://scitechdaily.com/the-race-for-nuclear-time-scientists-make-important-advance/", "urlToImage": "https://scitechdaily.com/images/Atomic-Clock-Nuclear-Physics.jpg", "publishedAt": "2023-07-24T02:23:31Z", "content": "ByLudwig Maximilian University of MunichJuly 23, 2023\r\nNuclear clocks, which are even more precise than atomic clocks, could offer scientists new avenues to explore fundamental forces of the universe… [+11324 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "After debris breaks off DART target asteroid, NASA tracks another asteroid heading for Earth - HT Tech", "description": "Asteroid 2015 MA54 will make an extremely close approach to Earth today, and NASA has revealed details such as its speed, size, and distance of approach. Here’s everything we know so far.", "url": "https://tech.hindustantimes.com/tech/news/after-debris-breaks-off-dart-target-asteroid-nasa-tracks-another-asteroid-heading-for-earth-71690164234864.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/24/1600x900/orbit-viewer-snapshot_1690164317575_1690164326675.jpg", "publishedAt": "2023-07-24T02:06:32Z", "content": "The National Aeronautics and Space Administration (NASA) made history on September 26, 2022, as it successfully carried out its first-ever planetary defense test to protect Earth against potential as… [+2055 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Garena Free Fire Redeem Codes for July 24: Get battle-ready with in-game freebies! - HT Tech", "description": "Garena Free Fire Redeem Codes for July 24: Give your character a unique cosmetic makeover! Know how to claim Garena Free Fire redeem codes.", "url": "https://tech.hindustantimes.com/how-to/garena-free-fire-redeem-codes-for-july-24-get-battle-ready-with-in-game-freebies-71690161039642.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/24/1600x900/4b38309054a4ce4c71d2e947b2424d1ajpg_1650242981056_1690161286738.jpg", "publishedAt": "2023-07-24T01:16:26Z", "content": "Garena Free Fire Redeem Codes for July 24: In Garena Free Fire, players require special items like weapons, gloo walls and others to survive longer and win the game. While most of these items can be … [+1907 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "maheen soomro", "title": "The Future of Space Exploration: Upcoming Missions, Technologies, and Human Colonization - Medium", "description": "Space exploration has always captivated humanity’s imagination, and in recent years, advancements in technology have brought us closer to exploring the cosmos like never before. From ambitious…", "url": "https://medium.com/@maheensoomro183/the-future-of-space-exploration-upcoming-missions-technologies-and-human-colonization-ca0f3b119eb1", "urlToImage": "https://miro.medium.com/v2/resize:fit:1200/1*bhUe5phx8rdGNiHvkfnhDA.png", "publishedAt": "2023-07-23T16:07:57Z", "content": "Prologue:\r\nSpace exploration has always captivated humanitys imagination, and in recent years, advancements in technology have brought us closer to exploring the cosmos like never before. From ambiti… [+3499 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Marijuana Use May Alter Your DNA Methylation - SciTechDaily", "description": "Recent and long-term marijuana use is linked to changes in the human epigenome, a new Northwestern Medicine study published in the journal Molecular Psychiatry has found. Marijuana ranks as the most widely used drug in the United States. Data from the Centers…", "url": "https://scitechdaily.com/warning-marijuana-use-may-alter-your-dna-methylation/", "urlToImage": "https://scitechdaily.com/images/Marijuana-Body-Effects-Art-Concept.jpg", "publishedAt": "2023-07-23T02:33:02Z", "content": "ByNorthwestern UniversityJuly 22, 2023\r\nA study by Northwestern Medicine links recent and long-term marijuana use to changes in the human epigenome. The research identified significant epigenetic cha… [+5543 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Warning: GPS Data Could Detect Large Earthquakes Hours Before They Happen - SciTechDaily", "description": "A systematic global analysis of GPS time-series data from nearly 100 large earthquakes suggests the existence of a precursory phase of fault slip that occurs about two hours before seismic rupture. The analysis of Global Positioning System (GPS) time-series d…", "url": "https://scitechdaily.com/early-warning-gps-data-could-detect-large-earthquakes-hours-before-they-happen/", "urlToImage": "https://scitechdaily.com/images/GPS-Earthquake-Art.jpg", "publishedAt": "2023-07-22T15:41:50Z", "content": "ByWalter Beckwith, American Association for the Advancement of Science (AAAS)July 22, 2023\r\nA comprehensive analysis of GPS time-series data suggests a precursory phase of fault slip occurs two hours… [+3751 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Samsung Galaxy S24 rumored to be missing out on one key camera upgrade - TechRadar", "description": "The same selfies", "url": "https://www.techradar.com/phones/samsung-galaxy-phones/samsung-galaxy-s24-rumored-to-be-missing-out-on-one-key-camera-upgrade", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5v5fDnsJP2DxVyLzRC7y76-1200-80.jpg", "publishedAt": "2023-07-22T11:30:39Z", "content": "We're hoping that the Samsung Galaxy S24 will be with us in the early part of 2024, but the latest rumor to reach our ears suggests that there's one key component that won't be getting an upgrade nex… [+1699 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Into the Unknown: NASA's GEDI Space Laser Provides Answers to Rainforest Canopy Mystery - SciTechDaily", "description": "NASA's GEDI, a space laser, has provided a groundbreaking, detailed structural view of the world's rainforests, enabling researchers to further understand these complex ecosystems. Uncovering the Secrets of Rainforest Canopies We know less about the rainfores…", "url": "https://scitechdaily.com/into-the-unknown-nasas-gedi-space-laser-provides-answers-to-rainforest-canopy-mystery/", "urlToImage": "https://scitechdaily.com/images/Lasers-Measuring-Rainforest.jpg", "publishedAt": "2023-07-22T09:12:20Z", "content": "ByNorthern Arizona UniversityJuly 22, 2023\r\nNASAs space laser, GEDI, has revolutionized our understanding of rainforests, revealing a simpler structure with a peak leaf concentration at 15 meters. Th… [+6748 chars]"}]}