{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Top 5 latest breathtaking images of galaxies, nebulae, dwarf stars and black holes shared by NASA - HT Tech", "description": "Top 5 latest breathtaking images of galaxies nebulae dwarf stars and black holes shared by NASA NASA has shared stunning new images of celestial wonders captured by the Hubble Space Telescope showcasing spiral galaxies nebulae and black holes revealing the un…", "url": "https://tech.hindustantimes.com/web-stories/top-5-latest-breathtaking-images-of-galaxies-nebulae-dwarf-stars-and-black-holes-shared-by-nasa-71716705965837.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/26/1600x900/NASA_1716706004117_1716706058890.jpg/", "publishedAt": "2024-05-27T08:23:57Z", "content": "Photo Credit: NASA\r\n NASA has shared stunning new images of celestial wonders captured by the Hubble Space Telescope, showcasing spiral galaxies, nebulae, and black holes, revealing the universe's be… [+1859 chars]"}, {"source": {"id": null, "name": "Gadgets360.com"}, "author": "Akash Dutta, Siddharth Suvarna", "title": "Apple Could Add AI-Powered Emoji Generation, App Icon Customisation With iOS 18: Report - Gadgets 360", "description": "Apple is reportedly planning some major new introductions for the iPhone with the iOS 18 update. The Cupertino-based tech giant is expected to unveil the new operating system at the Worldwide Developers Conference (WWDC) 2024 event, scheduled for June 10. A n…", "url": "https://www.gadgets360.com/mobiles/news/apple-ios-18-ai-generated-emoji-app-icon-customisation-wwdc-2024-report-5754459", "urlToImage": "https://i.gadgets360cdn.com/large/iphone4_1716788945642.jpg", "publishedAt": "2024-05-27T06:21:10Z", "content": "Apple is reportedly planning some major new introductions for the iPhone with the iOS 18 update. The Cupertino-based tech giant is expected to unveil the new operating system at the Worldwide Develop… [+2263 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "mRNA vaccine technology changes cancer treatment landscape, offering promising potential beyond COVID-19 - MENAFN.COM", "description": "(MENAFN) The COVID-19 pandemic has served as a pivotal proving ground for the efficacy of messenger RNA (mRNA) vaccines in combating viral", "url": "https://menafn.com/1108258655/mRNA-vaccine-technology-changes-cancer-treatment-landscape-offering-promising-potential-beyond-COVID-19", "urlToImage": "https://menafn.com/updates/pr/Menafn_News_Images/Local_PharmaHealth_65.jpg", "publishedAt": "2024-05-26T13:21:46Z", "content": "(MENAFN) The COVID-19 pandemic has served as a pivotal proving ground for the efficacy of messenger RNA (mRNA) vaccines in combating viral outbreaks. However, the pioneers behind this revolutionary t… [+2894 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA James Webb Space Telescope captures 5 spectacular images of distinct galaxies- details - HT Tech", "description": "NASA James Webb Space Telescope captures 5 spectacular images of distinct galaxies details Check out these beautiful images of space captured by the NASA James Webb Space Telescope.  NASAs James Webb Space Telescope is equipped with powerful instruments and t…", "url": "https://tech.hindustantimes.com/web-stories/nasa-james-webb-space-telescope-captures-5-spectacular-images-of-distinct-galaxies-details-71716539374441.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/05/24/1600x900/potm2208a_1716539847844_1716539850040.jpg/", "publishedAt": "2024-05-25T07:00:00Z", "content": "Photo Credit: Pixabay\r\n Check out these beautiful images of space captured by the NASA James Webb Space Telescope. \r\nPhoto Credit: Pixabay\r\n NASA's James Webb Space Telescope is equipped with powerfu… [+1023 chars]"}]}