{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Heat.com"}, "author": null, "title": "Pool Report on Technical Fouls and Ejection in Second Quarter of Tonight’s San Antonio at Philadelphia Game - NBA Official", "description": "The Pool Report interview was conducted by Keith Pompey of the Philadelphia Inquirer with Crew Chief Curtis Blair following today’s San Antonio at Philadelphia game. December 23, 2024 QUESTION: The main question is about Joel Embiid and the ejection. I know h…", "url": "https://official.nba.com/pool-report-on-technical-fouls-and-ejection-in-second-quarter-of-tonights-san-antonio-at-philadelphia-game/", "urlToImage": null, "publishedAt": "2024-12-24T03:31:40Z", "content": "The Pool Report interview was conducted by Keith Pompey of the Philadelphia Inquirer with Crew Chief Curtis Blair following todays San Antonio at Philadelphia game.\r\nDecember 23, 2024\r\nQUESTION: The … [+975 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Lucy Buglass", "title": "7 underrated movies released in 2024 that you shouldn't miss streaming on Netflix, Hulu, Max and more - TechRadar", "description": "Clint Eastwood's latest movie seemed to fall under the radar, and it wasn't alone", "url": "https://www.techradar.com/streaming/7-underrated-movies-released-in-2024-that-you-shouldnt-miss-streaming", "urlToImage": "https://cdn.mos.cms.futurecdn.net/qNxLPi479k3RiydjrWBUiJ-1200-80.jpg", "publishedAt": "2024-12-23T17:00:00Z", "content": "We were truly spoiled for choice in 2024 as so many great new movies were released in theaters and across the best streaming services. But with so many options out there, it's very easy to miss certa… [+7122 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Hidden Culprit Behind Alzheimer’s Revealed: Microglia Under the Microscope - SciTechDaily", "description": "Researchers at the CUNY Graduate Center have made a groundbreaking discovery in Alzheimer's disease research, identifying a critical link between cellular stress in the brain and disease progression. Their study focuses on microglia, the brain's immune cells,…", "url": "https://scitechdaily.com/the-hidden-culprit-behind-alzheimers-revealed-microglia-under-the-microscope/", "urlToImage": "https://scitechdaily.com/images/Neuroglia-Brain-Cells-Art-Concept.jpg", "publishedAt": "2024-12-23T16:00:35Z", "content": "Exciting findings from CUNY researchers reveal a novel target in the fight against Alzheimer’s — harmful microglia activated by cellular stress. This could lead to therapies that reverse the damaging… [+4626 chars]"}]}