{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SemiEngineering"}, "author": "Technical Paper Link", "title": "Ferroelectric Polarization in an Elementary Substance or Single-Element Compound - SemiEngineering", "description": "A technical paper titled “Two-dimensional ferroelectricity in a single-element bismuth monolayer” was published by researchers at National University of Singapore, Zhejiang University, Tianjin University, and University of Chinese Academy of... » read more", "url": "https://semiengineering.com/ferroelectric-polarization-in-an-elementary-substance-or-single-element-compound/", "urlToImage": "https://semiengineering.com/wp-content/uploads/AdobeStock_373262549-scaled.jpeg", "publishedAt": "2023-04-09T19:57:22Z", "content": "A technical paper titled “Two-dimensional ferroelectricity in a single-element bismuth monolayer” was published by researchers at National University of Singapore, Zhejiang University, Tianjin Univer… [+1995 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Catalysis Breakthrough Could Unlock Massive Energy Savings - SciTechDaily", "description": "In a significant breakthrough for the field of computational chemistry, chemical engineers from the University of Wisconsin-Madison have created a model that elucidates how catalytic reactions work at the atomic level. This newfound understanding could enable…", "url": "https://scitechdaily.com/?p=266560", "urlToImage": "https://scitechdaily.com/images/Energy-Conversion-Abstract.jpg", "publishedAt": "2023-04-09T19:06:05Z", "content": "University of Wisconsin-Madison chemical engineers have made a breakthrough in computational chemistry by developing a model of catalytic reactions at the atomic scale. This new understanding could l… [+6539 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "https://www.india.com/author/ians/", "title": "iPhone 15 Pro Design Discloses New Buttons, Titanium Frame. Details Inside - India.com", "description": "According to previous speculations, the iPhone 15 Pro's cameras will have all-new sensor technology that will capture more light and reduce overexposure or underexposure in certain settings.", "url": "https://www.india.com/technology/iphone-15-pro-design-discloses-new-buttons-titanium-frame-details-inside-5988654/", "urlToImage": "https://static.india.com/wp-content/uploads/2023/04/iphone.jpg", "publishedAt": "2023-04-09T14:49:06Z", "content": "According to previous speculations, the iPhone 15 Pro's cameras will have \"all-new sensor technology that will capture more light and reduce overexposure or underexposure in certain settings\".\r\nThe m… [+1813 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "HISTORIC! NASA's IXPE captures Crab Nebula like never before - HT Tech", "description": "The Crab Nebula has been seen like never before, courtesy NASA's IXPE techniques.", "url": "https://tech.hindustantimes.com/tech/news/historic-nasa-s-ixpe-captures-crab-nebula-like-never-before-71681042597184.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/09/1600x900/crab_nebula2-cxc-ixpe_1681042685671_1681042694095_1681042694095.jpg", "publishedAt": "2023-04-09T12:19:04Z", "content": "The Crab Nebula has been part of several studies by astronomers. It began back on February 22, 1971, when a sounding rocket took off carrying specialized sensors directed towards the Crab Nebula from… [+2274 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "120-foot asteroid zooming towards Earth today at astonishing speed of 50796 kmph, says NASA - HT Tech", "description": "Not just one asteroid, as many as three massive asteroids are on their way to planet Earth today. How close will they come? Here is what NASA informs.", "url": "https://tech.hindustantimes.com/tech/news/120foot-asteroid-zooming-towards-earth-today-at-astonishing-speed-of-50796-kmph-says-nasa-71681022431895.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/09/1600x900/ygy_1637905928669_1681022586569_1681022586569.jpg", "publishedAt": "2023-04-09T06:45:15Z", "content": "It is a scary day today! A gigantic 120-foot, airplane sized asteroid named 2023 FP5 is moving at a rapid speed towards planet Earth today, according to NASA's Jet Propulsion Laboratory (JPL). NASA i… [+1787 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Tech ARP", "title": "Did Switzerland Stop All COVID-19 Vaccinations?! - Tech ARP", "description": null, "url": "https://www.techarp.com/facts/switzerland-covid-19-vaccinations/", "urlToImage": null, "publishedAt": "2023-04-08T20:34:20Z", "content": null}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "Tecno Phantom V Fold complete specs listed on Tecno website , just ahead of it’s launch - The Tech Outlook", "description": "Tecno will officially be launching its highly anticipated foldable smartphone - the Phantom V Fold in India on April 11. This smartphone has been a part of quite a few rumors and speculations and was also much awaited by many. This upcoming smartphon", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/tecno-phantom-v-fold-complete-specs-listed-on-tecno-website-just-ahead-of-its-launch/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/04/jpg_20230408_202148_00001.jpg", "publishedAt": "2023-04-08T15:32:06Z", "content": "Tecno will officially be launching its highly anticipated foldable smartphone – the Phantom V Fold in India on April 11. This smartphone has been a part of quite a few rumors and speculations and was… [+1696 chars]"}]}