{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "After Many Years of Searching – Potential First Traces of the Universe’s Earliest Stars Discovered - SciTechDaily", "description": "Evidence of a first-generation star that died in a \"super-supernova\" explosion is discovered by Gemini's observation of a far-away quasar. The ancient chemical remains of the first stars to light the universe may have been found by astronomers. The researcher…", "url": "https://scitechdaily.com/after-many-years-of-searching-potential-first-traces-of-the-universes-earliest-stars-discovered/", "urlToImage": "https://scitechdaily.com/images/Quasar-May-Hold-the-Chemical-Fingerprint-of-a-Population-III-Star-scaled.jpg", "publishedAt": "2022-10-23T13:06:35Z", "content": "ByAssociation of Universities for Research in Astronomy (AURA)October 23, 2022\r\nThis artists impression shows a field of Population III stars as they would have appeared a mere 100 million years afte… [+8502 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "On iPhone, extract text from videos! Just try this amazing trick - HT Tech", "description": "Now, you can copy, translate and paste any text from a video with the help of this iPhone trick. Know the secret here.", "url": "https://tech.hindustantimes.com/how-to/on-iphone-extract-text-from-videos-just-try-this-amazing-trick-71666528705015.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/23/1600x900/IMG_4236_1657625118252_1666528837172_1666528837172.jpg", "publishedAt": "2022-10-23T12:41:44Z", "content": "Did you know that you can extract text from videos as well as photos! Just like magic, thanks to the iPhone Live Text feature, you can do exactly that. It will make the photos and videos exceedingly … [+1827 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Eating Omega-3 Fatty Acids in Midlife May Sharpen Thinking Skills and Improve Brain Structure - SciTechDaily", "description": "People who eat more foods with omega-3 fatty acids in midlife may have superior thinking skills and even better brain structure than people who eat few foods containing the fatty acids. This is according to an exploratory study that was recently published in …", "url": "https://scitechdaily.com/eating-omega-3-fatty-acids-in-midlife-may-sharpen-thinking-skills-and-improve-brain-structure/", "urlToImage": "https://scitechdaily.com/images/Omega-3-Fish-Oil-Supplement.jpg", "publishedAt": "2022-10-23T10:45:40Z", "content": "ByAmerican Academy of NeurologyOctober 23, 2022\r\nFish oil, krill oil, or cod liver oil supplements are one way to improve your intake of Omega-3 fatty acids. One of the richest dietary sources of Ome… [+4577 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Kat Lonsdorf", "title": "Young Ukrainians volunteer to clean up destroyed homes — and try to make it fun - NPR", "description": "Young volunteers blast techno music while helping people in destroyed villages and then hold dance parties to blow off steam. \"Listening to music keeps us balanced, so we can keep working,\" one says.", "url": "https://www.npr.org/2022/10/23/1129011752/ukrainian-volunteers-clean-up-destroyed-villages", "urlToImage": "https://media.npr.org/assets/img/2022/10/17/rebuild_npr_0048_wide-6cc2ec8fe3edbe03456db7d292d25d1f3d865cec-s1400-c100.jpg", "publishedAt": "2022-10-23T09:02:11Z", "content": "Repair Together volunteers dance to music in Anysiv, Ukraine, after a day of cleaning up destroyed homes in nearby Kolychivka on Oct 1. The after-party took place in a theater damaged by shelling. Re… [+7476 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moonlighting Unacceptable, \"Few\" Employees Fired Over It: IT Firm - NDTV Profit", "description": "IT company Happiest Minds Technologies has said moonlighting is unacceptable as it amounts to violation of job contract and that \"few\" employees found engaging in such practices have been fired over the last 6-12 months.", "url": "https://www.ndtv.com/business/moonlighting-unacceptable-few-employees-fired-over-it-happiest-minds-3456554", "urlToImage": "https://i.ndtvimg.com/i/2017-06/it-sector_650x400_71498458027.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675?ver-20220723.02", "publishedAt": "2022-10-23T08:35:00Z", "content": "Several firms have waded into the issue making it clear that they do not approve of it.(Representational)\r\nNew Delhi: IT company Happiest Minds Technologies has said moonlighting is unacceptable as i… [+4665 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Got gift cards collecting dust? Now's the time to use them - CBC.ca", "description": "Square, a financial technology company that sell mobile payment devices, found Canadians are sitting on more than $33 million worth of unspent gift cards through its platform alone.", "url": "https://www.cbc.ca/radio/costofliving/use-your-gift-cards-1.6620807", "urlToImage": "https://i.cbc.ca/1.6285719.1666287997!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pei-gift-cards.jpg", "publishedAt": "2022-10-23T08:00:00Z", "content": "The gift cards are stacking up for Neil Cooper. After a count, he says he has 19 cards kicking around his home. \r\n\"I have no idea how much are on any of these,\" said Cooper, whose collection of gift … [+4779 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Aman Niranjan", "title": "Huawei to Launch its Watch D in UK on 25th October - The Tech Outlook", "description": "In December 2021 Huawei launched its initial blood pressure-monitoring smartwatch for the indigenous market. However, after launching in Germany a few weeks ago. The company is set to launch the Watch D in the UK expected to release on 25th October a", "url": "https://www.thetechoutlook.com/news/new-release/huawei-to-launch-its-watch-d-in-uk-on-25th-october/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2022/10/Watch-q0.jpg", "publishedAt": "2022-10-23T07:43:41Z", "content": "In December 2021 Huawei launched its initial blood pressure-monitoring smartwatch for the indigenous market. However, after launching in Germany a few weeks ago. The company is set to launch the Watc… [+1023 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Huawei EMUI October 2022 Updates List - HC Newsroom", "description": "In October 2022, Huawei is all set to launch new EMUI software updates for devices and it brings a number of features for smartphone owners. On the other hand, the Chinese tech maker has already released the latest security patch details as well as a list of …", "url": "https://www.huaweicentral.com/huawei-emui-october-2022-updates-list-2/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/10/huawei-october-emui-2022-updates-1000x576.jpg", "publishedAt": "2022-10-23T06:21:56Z", "content": "Recently, Huawei listed all of the EMUI 13 features and the excitement among Huawei phone users is overwhelming. Yeah, it’s a matter of joy and EMUI 13 is the one that you are looking forward to incl… [+1941 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Massive property boom in this area in South Africa, thanks to wealthy semigrants - BusinessTech", "description": "The Umhlanga property market continues to perform well, says Brett Botsis, Seeff’s licensee for the area. Since the onset of the pandemic there has been a significant uptick in sales in the R5 million to R10 million range.", "url": "https://businesstech.co.za/news/trending/636449/massive-property-boom-in-this-area-in-south-africa-thanks-to-wealthy-semigrants/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/Umhlanga-beachfront-area-e1666338031160.jpg", "publishedAt": "2022-10-23T06:07:02Z", "content": "The Umhlanga property market continues to perform well, says Brett Botsis, Seeffs licensee for the area. Since the onset of the pandemic, there has been a significant uptick in sales in the R5 millio… [+3298 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "This Week @NASA: Webb’s Supreme Look at a “Star Factory” and Artemis Moonwalks - SciTechDaily", "description": "A new look at a “star factory” … Practicing Moonwalks here on Earth … And an Earthly assist for a NASA spacecraft … a few of the stories to tell you about – This Week at NASA! https://youtu.be/KYQhDRxVXYA Webb’s New Star-Filled “Pillars of Creation” Image A n…", "url": "https://scitechdaily.com/this-week-nasa-webbs-supreme-look-at-a-star-factory-and-artemis-moonwalks/", "urlToImage": "https://scitechdaily.com/images/NASA-Webb-Star-Factory-Artemis-Moonwalks.gif", "publishedAt": "2022-10-22T19:27:09Z", "content": "ByNASAOctober 22, 2022\r\nA new look at a star factory \r\nPracticing Moonwalks here on Earth \r\nAnd an Earthly assist for a NASA\r\nEstablished in 1958, the National Aeronautics and Space Administration (N… [+2264 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "NASA's Webb Telescope takes star-filled portrait of pillars of creation - HT Tech", "description": "NASA's James Webb Space Telescope has captured highly detailed landscape the Pillars of Creation where new stars are forming.", "url": "https://tech.hindustantimes.com/tech/news/nasas-webb-telescope-takes-star-filled-portrait-of-pillars-of-creation-71666434702552.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/10/22/1600x900/AP10-19-2022-000286A-0_1666435726258_1666435726258_1666435896256_1666435896256.jpg", "publishedAt": "2022-10-22T19:22:51Z", "content": "NASA's James Webb Space Telescope has captured a lush, highly detailed landscape the iconic Pillars of Creation where new stars are forming within dense clouds of gas and dust. The three-dimensional … [+2802 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The chance to lower interest rates is in government’s hands: Kganyago - BusinessTech", "description": "South Africa’s central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.", "url": "https://businesstech.co.za/news/trending/636989/the-chance-to-lower-interest-rates-is-in-governments-hands-kganyago/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-10-22T05:41:04Z", "content": "South Africas central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.\r\nFiscal c… [+1694 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How South Africa’s tax rates compare to Australia, the UK and other countries - BusinessTech", "description": "Data from the Organisation for Economic Cooperation and Development’s (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with the rest of the world – but the devil’s in the details.", "url": "https://businesstech.co.za/news/business-opinion/635987/how-south-africas-tax-rates-compare-to-australia-the-uk-and-other-countries/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/the-SA-rand.jpg", "publishedAt": "2022-10-22T05:06:35Z", "content": "Data from the Organisation for Economic Cooperation and Developments (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with … [+4511 chars]"}, {"source": {"id": null, "name": "Wustl.edu"}, "author": "Brandie Jefferson", "title": "Multi-scale imaging technique may enable objective assessment of myofascial pain - The Source - Washington University in St. Louis - Washington University in St. Louis", "description": "Washington University in St. Louis researchers Song Hu, Yong Wang team up to find quantitative biomarkers for clinical pain management", "url": "https://source.wustl.edu/2022/10/multi-scale-imaging-technique-may-enable-objective-assessment-of-myofascial-pain/", "urlToImage": "https://source.wustl.edu/wp-content/uploads/2022/10/Song-Wang.jpg", "publishedAt": "2022-10-21T16:15:00Z", "content": "About 50 million Americans experience chronic pain. For many, the pain involves the muscle and the fascia surrounding it, creating myofascial pain with trigger points. This chronic pain syndrome sign… [+1332 chars]"}, {"source": {"id": null, "name": "Complete Sports Nigeria"}, "author": "Adekemi Olatunji", "title": "What Tech Influencers Have To Say About Infinix ZERO 20 - Complete Sports", "description": "A key feature, smartphone lovers look out for in smartphones is the camera Megapixel. Infinix has earned a bragging right with the launch ...", "url": "https://www.completesports.com/what-tech-influencers-have-to-say-about-infinix-zero-20/", "urlToImage": "https://www.completesports.com/wp-content/uploads/Infinix-ZERO-20.png", "publishedAt": "2022-10-21T14:13:52Z", "content": "A key feature, smartphone lovers look out for in smartphones is the camera Megapixel. Infinix has earned a bragging right with the launch of its Zero 20 device, the tech giant launched industrys firs… [+1573 chars]"}]}