{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Wireless device makes magnetism appear in non-magnetic materials - Science Daily", "description": "Researchers have succeeded in bringing wireless technology to the fundamental level of magnetic devices. The emergence and control of magnetic properties in cobalt nitride layers (initially non-magnetic) by voltage, without connecting the sample to electrical…", "url": "https://www.sciencedaily.com/releases/2023/10/231030110652.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-10-30T15:56:23Z", "content": "Researchers at the Universitat Autònoma de Barcelona (UAB) and ICMAB have succeeded in bringing wireless technology to the fundamental level of magnetic devices. The emergence and control of magnetic… [+3623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Breakthrough! In a first, infrared auroras on Uranus confirmed - HT Tech", "description": "Scientists have made a groundbreaking discovery, confirming the existence of infrared auroras on Uranus, shedding light on the planet's mysterious heat.", "url": "https://tech.hindustantimes.com/tech/news/breakthrough-in-a-first-infrared-auroras-on-uranus-confirmed-71698678719519.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/Uranus_1698679202744_1698679202995.jpg", "publishedAt": "2023-10-30T15:20:58Z", "content": "In a remarkable breakthrough, scientists have, after nearly two decades of research, confirmed the presence of stunning infrared auroras gracing the northern regions of Uranus. This revelation not on… [+2619 chars]"}, {"source": {"id": null, "name": "TechHive"}, "author": "Michael Brown", "title": "Klipsch debuts Music City series of portable Bluetooth speakers - TechHive", "description": "Austin, Detroit, and Nashville are renowned for their recording studios and live music scenes. Klipsch pays tribute with 3 new speakers named after them.", "url": "https://www.techhive.com/article/2119505/klipsch-debuts-music-city-series-of-portable-bluetooth-speakers.html", "urlToImage": "https://www.techhive.com/wp-content/uploads/2023/10/Klipsch-Detroit.jpg?quality=50&strip=all&w=1024", "publishedAt": "2023-10-30T13:00:00Z", "content": "Skip to contentType your search and hit enter\r\nWhen you purchase through links in our articles, we may earn a small commission. This doesn't affect our editorial independence\r\n.\r\nKlipsch has announce… [+3120 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Shukrayaan-1 mission: What are the aims and objectives of ISRO's Venus endeavor? - HT Tech", "description": "Shukrayaan1 mission What are the aims and objectives of ISROs Venus endeavor Just a month after Indias historic space achievement in the form of Chandrayaan3 mission ISRO is ready for its next projectShukrayaan1 mission. Aims and ObjectivesShukrayaan1 mission…", "url": "https://tech.hindustantimes.com/web-stories/shukrayaan-1-mission-what-are-the-aims-and-objectives-of-isros-venus-endeavor-71698658529678.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/Venus_1696761851332_1698658717116.png/", "publishedAt": "2023-10-30T04:17:50Z", "content": "Photo Credit: Pixabay\r\n Just a month after India's historic space achievement in the form of Chandrayaan-3 mission, ISRO is ready for its next project: Shukrayaan-1 mission.\r\nPhoto Credit: NASA\r\n Aim… [+1111 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-3 mission: What is ejecta halo that Vikram Lander created on the Moon - HT Tech", "description": "Chandrayaan3 mission What is ejecta halo that Vikram Lander created on the Moon ISRO revealed an awesome event of the Chandrayaan3 mission. Know how the Vikram lander created ejecta halo. Know what the term means. ISRO recently made an announcement that Vikra…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan3-mission-what-is-ejecta-halo-that-vikram-lander-created-on-the-moon-71698637052307.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/30/1600x900/CVK_8_1698637568885_1698637575809.png/", "publishedAt": "2023-10-29T22:16:59Z", "content": "Photo Credit: ISRO\r\n  ISRO revealed an awesome event of the Chandrayaan-3 mission. Know how the Vikram lander created ejecta halo. Know what the term means.\r\nPhoto Credit: ISRO\r\n ISRO recently made a… [+1518 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Discovering Uranus' Glow: New Hints for Life on Icy Exoplanets - SciTechDaily", "description": "University of Leicester astronomers confirm the existence of an infrared (IR) aurora on Uranus. The presence of an infrared aurora on the cold, outer planet of Uranus has been confirmed for the first time by University of Leicester astronomers. The discovery …", "url": "https://scitechdaily.com/?p=322736", "urlToImage": "https://scitechdaily.com/images/Uranus-Aurora.jpg", "publishedAt": "2023-10-29T14:31:04Z", "content": "ByUniversity of LeicesterOctober 29, 2023\r\nAn artistic representation of how the northern infrared aurora would have looked in 2006 (marked in red). The darker red locations indicate confirmed aurora… [+7707 chars]"}, {"source": {"id": null, "name": "Knowablemagazine.org"}, "author": "Viviane Callier, Knowable Magazine", "title": "Where the heck did all those structures inside complex cells come from? - Ars Technica", "description": "There are competing theories about the origin of the nucleus and endoplasmic reticulum.", "url": "https://knowablemagazine.org/article/living-world/2023/how-endomembrane-system-of-eukaryotic-cells-evolved", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/GettyImages-1407267429-760x380.jpg", "publishedAt": "2023-10-29T11:07:53Z", "content": "Enlarge/ Computer illustration of mitochondria, membrane-enclosed cellular organelles that produce energy.\r\n8 with \r\nMore than 1.5 billion years ago, a momentous thing happened: Two small, primitive … [+5404 chars]"}]}