{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Successfully Genetically Modify Individual Cells in Living Animals - SciTechDaily", "description": "One proven method for tracking down the genetic origins of diseases is to knock out a single gene in animals and study the consequences this has for the organism. The problem is that for many diseases, the pathology is determined by multiple genes, complicati…", "url": "https://scitechdaily.com/scientists-successfully-genetically-modify-individual-cells-in-living-animals/", "urlToImage": "https://scitechdaily.com/images/Mosaic-Mouse.jpg", "publishedAt": "2023-09-24T09:34:16Z", "content": "ByETH ZurichSeptember 24, 2023\r\nResearchers have developed a technique using CRISPR-Cas to simultaneously modify multiple genes in the cells of adult animals, creating a mosaic-like pattern that simp… [+8613 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Google Pixel 8: New leaked teaser video reveals stunning AI camera features and more - HT Tech", "description": "A sneak peek into Google's Pixel 8 series reveals revolutionary AI camera features, including the transformative Magic Editor and DSLR-style manual controls. It is poised to redefine smartphone photography.", "url": "https://tech.hindustantimes.com/mobile/news/google-pixel-8-new-leaked-teaser-video-reveals-stunning-ai-camera-features-and-more-71695534610594.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/09/24/1600x900/Google_Pixel_8_1695534760130_1695534760397.jpg", "publishedAt": "2023-09-24T05:56:28Z", "content": "Google's iconic Pixel series has long been celebrated for its gold-standard camera technology. In 2021, with the Pixel 6 series, Google raised the bar in the world of smartphone photography, leaving … [+2840 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "VIR-1388: Clinical Trial of Preventive HIV Vaccine Begins - SciTechDaily", "description": "Novel vaccine includes NIH-funded technology in development since 2004. A trial of a preventive HIV vaccine candidate has begun enrollment in the United States and South Africa. The Phase 1 trial will evaluate a novel vaccine known as VIR-1388 for its safety …", "url": "https://scitechdaily.com/?p=311063", "urlToImage": "https://scitechdaily.com/images/HIV-1-Virus-Particle.jpg", "publishedAt": "2023-09-24T04:46:00Z", "content": "ByNational Institutes of Health (NIH)September 23, 2023\r\nColorized transmission electron micrograph of an HIV-1 virus particle (yellow/gold) budding from the plasma membrane of an infected H9 T cell … [+6817 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Scientists regenerate neurons that restore walking in mice after paralysis from spinal cord injury - Phys.org", "description": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after spinal cord injury. The neuroscientists have shown that re-gr…", "url": "https://phys.org/news/2023-09-scientists-regenerate-neurons-mice-paralysis.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/spinalcord.jpg", "publishedAt": "2023-09-23T18:09:33Z", "content": "In a new study in mice, a team of researchers from UCLA, the Swiss Federal Institute of Technology, and Harvard University have uncovered a crucial component for restoring functional activity after s… [+3605 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Tata Projects to construct Micron's advanced semiconductor facility in Sanand, roll out semiconductor chips by next year | Mint - Mint", "description": "Tata Projects collaborates with Micron Technology to build a semiconductor assembly and test plant in Gujarat.", "url": "https://www.livemint.com/companies/news/tata-projects-to-construct-microns-advanced-semiconductor-facility-in-sanand-roll-out-semiconductor-chips-by-next-year-11695463863770.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/09/23/600x338/micron_1695464076115_1695464085212.jpg", "publishedAt": "2023-09-23T10:17:31Z", "content": "Tata Projects on Saturday announced its collaboration with Micron Technology to construct an advanced semiconductor assembly and test plant in Sanand, Gujarat. The company in a statement said the con… [+2967 chars]"}]}