{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Arjun Kharpal", "title": "Tencent, the $370 billion Chinese tech giant, posts first ever revenue decline - CNBC", "description": "Tencent posted its first ever quarterly year-on-year revenue decline as stricter regulations around gaming in China and a resurgence of Covid hit the tech giant.", "url": "https://www.cnbc.com/2022/08/17/tencent-earnings-q2-chinese-tech-giant-posts-first-ever-revenue-decline.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106654047-15968011032020-08-07t024629z_1259459155_rc2q8i93o3ww_rtrmadp_0_usa-wechat-trump.jpeg?v=1660720765&w=1920&h=1080", "publishedAt": "2022-08-17T08:51:18Z", "content": "Tencent posted its first ever quarterly year-on-year revenue decline as stricter regulations around gaming in China and a resurgence of Covid-19 in the world's second-largest economy hit the technolo… [+4079 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "Printing Commercially Viable Perovskite Solar Cells - AZoNano", "description": "In this interview, we discuss a nanoparticle ink used to produce low-cost printable perovskite solar cells, helping to catalyze the technology transition toward commercial viable perovskite-based devices.", "url": "https://www.azonano.com/article.aspx?ArticleID=6240", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6240_16606445734701544.jpg", "publishedAt": "2022-08-17T08:24:00Z", "content": "Solar cells are pinned as one of the key sources of renewable energy; however, commercial options remain reliant upon silicon solar cells. In this interview, we speak with Professor Jacek Jasieniak a… [+11725 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Way Invented To Produce Oxygen on Mars for Future Explorers - SciTechDaily", "description": "Converting carbon dioxide into oxygen and producing fuels, fertilizers on the red planet using a plasma-based method. A plasma-based way to produce and separate oxygen within the Martian environment has been devised by an international team of researchers. It…", "url": "https://scitechdaily.com/new-way-invented-to-produce-oxygen-on-mars-for-future-explorers/", "urlToImage": "https://scitechdaily.com/images/Astronaut-at-Mars-Base.jpg", "publishedAt": "2022-08-17T08:22:36Z", "content": "ByAmerican Institute of PhysicsAugust 17, 2022\r\nResearchers have come up with a plasma-based way to produce and separate oxygen within the Martian environment.\r\nConverting carbon dioxide into oxygen … [+4722 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Amit Malewar", "title": "Scientists discovered the first armored bipedal dinosaur in Patagonia - Tech Explorist", "description": "The specimen had rows of dermal bones that protected it as shields.", "url": "https://www.techexplorist.com/scientists-discovered-first-armored-bipedal-dinosaur-patagonia/53127/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2022/08/akapil-kaniukura.jpg", "publishedAt": "2022-08-17T07:59:56Z", "content": "Conicet specialists have discovered a species of bipedal, armored dinosaur from the thyreophoran family in South America. They found the fossils in the town of Cerro Police, province of Río Negro.\r\nT… [+4239 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Abel Wong", "title": "Lenovo Legion 5 series Malaysia release: 12th Gen Intel & AMD Ryzen processors, starting price from RM5299 - TechNave", "description": "Today,&nbsp;Lenovo Malaysia&nbsp;has finally launched the much-awaited and latest Lenovo Legion lineup. There are a total of four variants - the&nbsp;Lenovo Leg", "url": "https://technave.com/gadget/Lenovo-Legion-5-series-Malaysia-release-12th-Gen-Intel-AMD-Ryzen-processors-starting-price-from-RM5299-31317.html", "urlToImage": "https://technave.com/data/files/article/202208170706324804.jpg", "publishedAt": "2022-08-17T07:12:51Z", "content": "Today, Lenovo Malaysia has finally launched the much-awaited and latest Lenovo Legion lineup. There are a total of four variants - the Lenovo Legion 5i Pro, Legion 5 Pro, Legion 5i and Legion 5 from … [+2673 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shaurya Tomer", "title": "Asteroid 2019 AV13, big as a skyscraper, to come terrifyingly close to Earth tomorrow - HT Tech", "description": "A humongous asteroid named Asteroid 2019 AV13 is expected to pass by Earth closely on August 20.", "url": "https://tech.hindustantimes.com/tech/news/asteroid-2019-av13-big-as-a-skyscraper-to-come-terrifyingly-close-to-earth-tomorrow-71660714094177.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/08/17/1600x900/ygy_1637905928669_1660714161605_1660714161605.jpg", "publishedAt": "2022-08-17T05:30:24Z", "content": "In the midst of frequent small asteroid sightings, a massive 420-foot asteroid is expected to come terrifyingly close to Earth tomorrow, August 20. The asteroid, named Asteroid 2019 AV13 is expected … [+1544 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Moon Discovered Around Asteroid Polymele by NASA's Lucy Team - SciTechDaily", "description": "Even before its launch in October 2021, NASA’s Lucy mission was already on course to break records by visiting more asteroids than any previous mission. Now, the mission can add one more asteroid to the list, after a surprise result from a long-running observ…", "url": "https://scitechdaily.com/moon-discovered-around-asteroid-polymele-by-nasas-lucy-team/", "urlToImage": "https://scitechdaily.com/images/Lucy-Trojan-Asteroid-Mission.jpg", "publishedAt": "2022-08-17T03:05:12Z", "content": "ByKatherine Kretke, Southwest Research InstituteAugust 16, 2022\r\nLucy will explore the Jupiter Trojan asteroids thought to be fossils of planet formation. Credit: NASAs Goddard Space Flight Center\r\nE… [+3968 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "First possible case of human-to-dog monkeypox transmission 'not surprising,' WHO says - CNN", "description": "The first possible case of human-to-dog transmission of monkeypox -- recently reported in two men and their pet in Paris -- had been a theoretical risk up till now, said Dr. Rosamund Lewis, technical lead on the monkeypox response for the World Health Organiz…", "url": "https://www.cnn.com/2022/08/16/health/monkeypox-transmission-human-pet-dog/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220816114707-monkeypox-transmission-human-pet-super-tease.jpg", "publishedAt": "2022-08-17T02:58:00Z", "content": "(CNN)The first possible case of human-to-dog transmission of monkeypox -- recently reported in two men and their pet in Paris -- had been a theoretical risk up till now, said Dr. Rosamund Lewis, tech… [+4493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Says Its Ship Docking At Lanka Port Doesn't Affect Any Country - NDTV", "description": "China on Tuesday said the activities of its high-tech research vessel will not affect the security of any country and should not be \"obstructed\" by any \"third party,\" as the ship berthed at Sri Lanka's Hambantota port amid Indian and US concerns.", "url": "https://www.ndtv.com/world-news/china-says-its-ship-docking-at-hambantota-port-in-sri-lanka-doesnt-affect-any-country-3259897", "urlToImage": "https://c.ndtvimg.com/2022-08/eqe2394_china-ship-in-lanka-afp_625x300_17_August_22.jpg", "publishedAt": "2022-08-17T02:30:24Z", "content": "China said the ship 'Yuan Wang 5' has \"successfully berthed\"at Hambantota Port.\r\nBeijing: China on Tuesday said the activities of its high-tech research vessel will not affect the security of any cou… [+6318 chars]"}, {"source": {"id": null, "name": "9to5Mac"}, "author": "Filipe Espósito", "title": "WhatsApp launches native Windows app, and new macOS version is on the way - 9to5Mac", "description": "WhatsApp on Tuesday launched a completely new app for Windows users. This time, instead of using the old Electron technology (which is web-based), the app has been completely rebuilt using native Windows technologies, which should result in better performance…", "url": "https://9to5mac.com/2022/08/16/whatsapp-native-app-for-windows/", "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2022/08/WhatsApp-Windows-app.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2022-08-16T23:52:00Z", "content": "WhatsApp on Tuesday launched a completely new app for Windows users. This time, instead of using the old Electron technology (which is web-based), the app has been completely rebuilt using native Win… [+1900 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Jeffrey Cooke", "title": "Scientists are turning data into sound to listen to the whispers of the universe (and more) - The Conversation Indonesia", "description": "Listening for events like black hole collisions is important in astronomy research – and the technology is only getting better.", "url": "https://theconversation.com/scientists-are-turning-data-into-sound-to-listen-to-the-whispers-of-the-universe-and-more-188699", "urlToImage": "https://images.theconversation.com/files/479315/original/file-20220816-22-o373py.png?ixlib=rb-1.1.0&rect=20%2C22%2C1897%2C948&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-08-16T20:04:11Z", "content": "We often think of astronomy as a visual science with beautiful images of the universe. However, astronomers use a wide range of analysis tools beyond images to understand nature at a deeper level. \r\n… [+6093 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Aisha Malik", "title": "Meta rolls out new Reels features on Instagram and Facebook, including an ‘Add Yours’ sticker - TechCrunch", "description": "Meta announced today that it’s launching new Reels features for Instagram and Facebook. Most notably, the company is rolling out an “Add Yours” sticker for Reels on both social networks. The sticker allows users to respond to other users’ Reels with their own…", "url": "https://techcrunch.com/2022/08/16/meta-new-reels-features-instagram-and-facebook-including-add-yours-sticker/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2022/08/insgaram-facebook-reels.png?w=711", "publishedAt": "2022-08-16T16:28:44Z", "content": "Meta announced today that it’s launching new Reels features for Instagram and Facebook. Most notably, the company is rolling out an “Add Yours” sticker for Reels on both social networks. The sticker … [+3810 chars]"}, {"source": {"id": null, "name": "DevOps.com"}, "author": "Alan Shimel", "title": "Techstrong TV: Applications of AI in the Real World - DevOps.com", "description": "Alan and Christelle talk about the \"hello, Human\" podcast series from FortressIQ where they discuss the latest topics in artificial intelligence and how", "url": "https://devops.com/techstrong-tv-applications-of-ai-in-the-real-world/", "urlToImage": "https://devops.com/wp-content/uploads/2020/09/artificialintelligence.jpg", "publishedAt": "2022-08-16T16:18:44Z", "content": "Alan and Christelle talk about the “hello, Human” podcast series from FortressIQ where they discuss the latest topics in artificial intelligence and how its being applied in the real world. The video… [+17184 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom announces stage 2 load shedding on Tuesday – here is the schedule - BusinessTech", "description": "Power utility Eskom has announced that stage 2 load shedding will be implemented on Tuesday evening, with a high chance of it being extended to Wednesday and Thursday.", "url": "https://businesstech.co.za/news/energy/617385/eskom-announces-stage-2-load-shedding-on-tuesday-here-is-the-schedule/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/08/Eskom-1-e1630386296818.png", "publishedAt": "2022-08-16T12:23:02Z", "content": "Power utility Eskom has announced that stage 2 load shedding will be implemented on Tuesday evening (16 August), with a high chance of it being extended to Wednesday and Thursday.\r\nStage 2 load shedd… [+1119 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Duncan McLeod", "title": "Rain in embarrassing climbdown over Telkom statement - TechCentral", "description": "Rain has withdrawn its press release of 11 August in which it announced a plan to approach Telkom's board about a merger.", "url": "https://techcentral.co.za/rain-in-embarrassing-climbdown-over-telkom-statement/214223/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2022/08/embarrassed-1500-800.jpg", "publishedAt": "2022-08-16T10:33:04Z", "content": "Following strong criticism by the Takeover Regulation Panel (TRP), telecommunications operator Rain has withdrawn its press release of 11 August in which it announced a plan to approach Telkom’s boar… [+1565 chars]"}, {"source": {"id": null, "name": "AZoNano"}, "author": null, "title": "A Guide to Scanning Transmission Electron Microscopy (STEM) - AZoNano", "description": "In this article, a guide to Scanning Transmission Electron Microscopy (STEM) is provided along with its applications in nanotechnology.", "url": "https://www.azonano.com/article.aspx?ArticleID=6232", "urlToImage": "https://d1otjdv2bf0507.cloudfront.net/images/Article_Images/SocialSharingImage_6232_16595391098972051.jpg", "publishedAt": "2022-08-16T09:25:00Z", "content": "High resolution images of microscopic samples can be obtained experimentally using Scanning Electron Transmission Microscopy (STEM). It is an effective method for examining the intricate structure of… [+7168 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Rocket Debris Could Have Disastrous Consequences – However, There Is a Solution - SciTechDaily", "description": "If governments don't act, space rocket junk might have deadly consequences. According to a recent University of British Columbia research, there is a six to ten percent chance that re-entering rocket stages that have been abandoned during space flights will s…", "url": "https://scitechdaily.com/space-rocket-debris-could-have-disastrous-consequences-however-there-is-a-solution/", "urlToImage": "https://scitechdaily.com/images/Space-Junk.gif", "publishedAt": "2022-08-15T16:15:55Z", "content": "Dangerous space junk illustration.\r\nIf governments dont act, space rocket junk might have deadly consequences.\r\nAccording to a recent University of British Columbia research, there is a six to ten pe… [+4648 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Radiation damage is spotted using calorimetry technique – Physics World - physicsworld.com", "description": "New analysis method could help prolong the lives of nuclear reactors", "url": "https://physicsworld.com/a/radiation-damage-is-spotted-using-calorimetry-technique/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/08/nuclear-power-station-Grohnde-4996479-iStock_RelaxFoto.de_.jpg", "publishedAt": "2022-08-15T14:42:56Z", "content": "Longer life: the new analysis technique could help extend the lives of some nuclear power plants. (Courtesy: iStock/RelaxFoto.de)\r\nMaterial defects caused by radiation damage can be characterized by … [+3230 chars]"}]}