{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cocoa Extract: A Cognitive Boost for Older Adults With Poor Diets - SciTechDaily", "description": "Recent research shows cocoa extract supplements may benefit cognition in older adults with poor diets, but not in those with healthy diets, according to a study within the larger COSMOS trial. Cocoa extract has shown a potential protective effect on cognition…", "url": "https://scitechdaily.com/cocoa-extract-a-cognitive-boost-for-older-adults-with-poor-diets/", "urlToImage": "https://scitechdaily.com/images/Cacao-Fruit-Cocoa-Beans-Powder.jpg", "publishedAt": "2023-12-31T16:39:58Z", "content": "A study published in The American Journal of Clinical Nutrition, involving 573 older adults, found that cocoa extract supplements improved cognition in participants with poor diets but had no effect … [+3969 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Good news you may have missed in 2023 - CBS Sunday Morning", "description": "Bad news can break suddenly, but good news can be found everywhere, all the time—if you know where to look. From technology and medicine to the environment, ...", "url": "https://www.youtube.com/watch?v=4oXK8tAZdsc", "urlToImage": "https://i.ytimg.com/vi/4oXK8tAZdsc/maxresdefault.jpg", "publishedAt": "2023-12-31T14:09:00Z", "content": null}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Mark Wilson", "title": "Tech Resolutions 2024 – 14 inspiring ways to boost your life with tech this year - TechRadar", "description": "Upgrade your life's firmware in 2024 with these handy tips", "url": "https://www.techradar.com/tech/tech-resolutions-2024", "urlToImage": "https://cdn.mos.cms.futurecdn.net/72brgmnDbHAza3iVyY6S7i-1200-80.jpg", "publishedAt": "2023-12-31T13:00:11Z", "content": "No-one really wants to make a New Year's resolution, so this year we recommend committing to a tech resolution instead. These friendlier commitments aren't about self-improvement, giving up indulgenc… [+8454 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": null, "title": "Week in tech: Aditya L1 set to reach Lagrange point on 6 January - Mint Lounge", "description": "The Lagrange point 1 will give Isro's Aditya L1 spacecraft an uninterrupted view of the Sun and allow it to study the Sun's corona and Chromosphere", "url": "https://lifestyle.livemint.com/smart-living/innovation/aditya-l1-lagrange-point-isro-apple-watch-xiaomi-ev-111704024815036.html", "urlToImage": "https://images.livemint.com/img/2023/12/31/1140x641/Isro-aditya-l1-solar-mission_1693638561455_1704025277915.jpg", "publishedAt": "2023-12-31T12:45:47Z", "content": "Heres a look at what made news in the world of science and technology this week.\r\nAditya L1 set to reach Lagrange point on 6 January\r\nIndia's maiden solar mission, Aditya L1, is all set to reach the … [+2519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Tech News Today: Copilot iOS app launch, Surface laptops with AI features, and more - The Indian Express", "description": "Tech News Today (December 31, 2023): Microsoft's GPT-4 powered chatbot Copilot app is now available for iPhones and iPads just a few days after the launch of the same for Android devices, similarly,  next-generation Surface laptops are reported to include a h…", "url": "https://indianexpress.com/article/technology/tech-news-today-31-december-2023-copilot-app-surface-ai-pc-iphone-15-discount-9089500/", "urlToImage": "https://images.indianexpress.com/2023/12/copilot-app-android-ios.jpg", "publishedAt": "2023-12-31T07:41:09Z", "content": "<li>01Copilot now available for iPads and iPhones\r\nMicrosoft's GPT-4 powered Copilot app is now available for iPads and iPhones. Users can log in using a Microsoft account to access the latest genera… [+1266 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Redefining Molecular Physics: The Surprising Phenomenon of Kinetic Asymmetry - SciTechDaily", "description": "Scientists have found that molecules can interact in a non-reciprocal manner without external forces, a discovery that could change our understanding of molecular interactions and the evolution of life. Researchers from the University of Maine and Penn State …", "url": "https://scitechdaily.com/redefining-molecular-physics-the-surprising-phenomenon-of-kinetic-asymmetry/", "urlToImage": "https://scitechdaily.com/images/Molecular-Asymmetry-Art-Concept.jpg", "publishedAt": "2023-12-31T04:36:34Z", "content": "A team of researchers has uncovered a novel way that molecules can interact non-reciprocally without external forces, through a mechanism involving kinetic asymmetry. This discovery challenges tradit… [+5545 chars]"}]}