{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA to collaborate with ISRO on space station development, says Bill Nelson - HT Tech", "description": "NASA Administrator Bill Nelson announced a collaboration with India for a space station and astronaut exchange. His week-long visit aims to strengthen ties in space exploration and technology.", "url": "https://tech.hindustantimes.com/tech/news/nasa-to-collaborate-with-isro-on-space-station-development-says-bill-nelson-71701187497330.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/11/28/1600x900/space_station_1701187666983_1701187667252.jpg", "publishedAt": "2023-11-28T16:09:16Z", "content": "In a significant diplomatic overture, NASA Administrator Bill Nelson announced on Tuesday the United States' readiness to partner with the Indian space agency ISRO in the construction of its very own… [+2498 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "PTI", "title": "Bharat Biotech, Sydney ID announce MoU to advance vaccine research initiative - CNBCTV18", "description": "The agreement aims to build strong sectoral and cross-organisational collaborations to design novel methodologies to tackle future epidemics and infectious diseases, Bharat Biotech said in a statement.", "url": "https://www.cnbctv18.com/healthcare/bharat-biotech-sydney-id-announce-mou-to-advance-vaccine-research-initiative-18427461.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/06/coronavirus-vaccine-COVID-19-vaccine.jpg", "publishedAt": "2023-11-28T15:53:19Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tunnel Rescue Official Was Told Rat-Hole Mining Is Illegal. Watch His Response - NDTV", "description": "Uttarkashi Tunnel Rescue Live: The rat-hole mining technique, which was outlawed in 2014, was used to clear the last few meters in the operation to rescue 41 workers trapped in the collapsed Silkyara tunnel in Uttarakhand for the last 17 days.", "url": "https://www.ndtv.com/india-news/uttarkashi-tunnel-rescue-live-tunnel-rescue-official-was-told-rat-hole-mining-is-illegal-watch-his-response-4614045", "urlToImage": "https://c.ndtvimg.com/2023-11/kinlpbgg_tunnel-rescue-latest-photo-1200_625x300_28_November_23.jpg", "publishedAt": "2023-11-28T14:34:00Z", "content": "The mining practice came to the rescue after heavy machines broke down.\r\nThe rat-hole mining technique, which was outlawed in 2014, was used to clear the last few meters in the operation to rescue 41… [+3636 chars]"}, {"source": {"id": null, "name": "Geospatial World"}, "author": "Jeffy Jacob", "title": "Geospatial Technologies for Disaster Management: A Data-Driven Approach - Geospatial World", "description": "At the AGI GeoResilience Symposium, Dr. Mrutunjay Mohapatra, Director General of Meteorology at IMD, emphasized the critical role of high-resolution geospatial data in disaster management. He stated, \"We have the framework but need better data.\"", "url": "https://www.geospatialworld.net/news/data-driven-approach-disaster-mitigation/", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2023/11/MicrosoftTeams-image-138.jpg", "publishedAt": "2023-11-28T10:43:53Z", "content": "In today’s world, where natural disasters are becoming increasingly frequent and severe, the need for effective disaster management strategies is more crucial than ever. Geospatial technologies, such… [+4405 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Jinit Parmar", "title": "PSBs hiring senior tech experts in bid to ramp up cybersecurity - Moneycontrol", "description": "The increasing number of digital transactions has made it necessary for banks to put stringent cybersecurity measures in place. Banks such as SBI, Bank of Maharashtra and IOB are hiring senior technical experts to put systems in place, to avoid a recurrence o…", "url": "https://www.moneycontrol.com/news/business/psbs-hiring-senior-tech-experts-in-bid-to-ramp-up-cybersecurity-11820781.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/cyber-attack2.jpg", "publishedAt": "2023-11-28T08:57:59Z", "content": "Public sector banks (PSBs) are looking to hire tech and cyber security specialists after the recent issues in the digital banking services of some PSBs, three top bankers told Moneycontrol.\r\nAfter th… [+4396 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Strange Chemistry: Webb Reveals “Teenage Galaxies” Are Unusually Hot, Glowing With Unexpected Elements - SciTechDaily", "description": "JWST unexpectedly reveals nickel and oxygen, which are typically difficult to observe. Similar to human teenagers, teenage galaxies are awkward, experience growth spurts and enjoy heavy metal — nickel, that is. A Northwestern University-led team of astrophysi…", "url": "https://scitechdaily.com/strange-chemistry-webb-reveals-teenage-galaxies-are-unusually-hot-glowing-with-unexpected-elements/", "urlToImage": "https://scitechdaily.com/images/Teenage-Galaxy-Concept.jpg", "publishedAt": "2023-11-27T09:31:24Z", "content": "ByNorthwestern UniversityNovember 27, 2023\r\nAstrophysicists using NASAs James Webb Space Telescope have discovered that teenage galaxies, emerging within the first 2-3 billion years after the Big Ban… [+10014 chars]"}]}