{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "Covaxin trials on children expected to start in June: Bharat Biotech - Hindustan Times", "description": "Bharat Biotech's Dr Raches Ella also said that the company expects approval from the World Health Organization for Covaxin by the end of the third or fourth quarter. | Latest News India", "url": "https://www.hindustantimes.com/india-news/covaxin-trials-on-children-expected-to-start-in-june-bharat-biotech-101621826763212.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/24/1600x900/AFP_99L3Q8_1620771223104_1621826816759.jpg", "publishedAt": "2021-05-24T03:30:29Z", "content": "Bharat Biotech, the maker of coronavirus disease vaccine Covaxin, is expected to start paediatric trials from June, the company's Business Development and International Advocacy Head Dr Raches Ella o… [+2112 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "Joe Devanesan", "title": "China self-develops brain-computer interface to bypass US tech sanctions - Tech Wire Asia", "description": "Chinese researchers have had to be innovative to develop working brain-computer interface applications, despite tech supply chain limitations in recent", "url": "https://techwireasia.com/2021/05/china-self-develops-brain-computer-interface-to-bypass-us-tech-sanctions/", "urlToImage": "https://cdn.techwireasia.com/wp-content/uploads/2021/05/000_Hkg10184749.jpg", "publishedAt": "2021-05-24T02:54:58Z", "content": "<ul><li>Chinese researchers have had to be innovative to develop working brain-computer interface applications, despite tech supply chain limitations in recent years</li></ul>Neuralink, a US-based te… [+3369 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "Renders of Apple M1-powered iMac Pro leaked online - TechNave", "description": "Back in March, it was suggested that&nbsp;Apple&nbsp;is planning to&nbsp;discontinue&nbsp;the&nbsp;iMac Pro. However, that may not be the case after all. The co", "url": "https://technave.com/gadget/Renders-of-Apple-M1-powered-iMac-Pro-leaked-online-24903.html", "urlToImage": "https://technave.com/data/files/mall/article/202105240219422811.jpg", "publishedAt": "2021-05-24T02:21:43Z", "content": "Back in March, it was suggested that Apple is planning to discontinue the iMac Pro. However, that may not be the case after all. The company launched new iMacs last month powered by the Apple M1 and … [+1160 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Joshua Tsi", "title": "vivo X60 might get a curved display like the pro version soon! - TechNave", "description": "The&nbsp;vivo X60 series&nbsp;which consist of the&nbsp;vivo X60&nbsp;and&nbsp;vivo X60 Pro&nbsp;was&nbsp;launched&nbsp;in Malaysia during March 22. One of the", "url": "https://technave.com/gadget/vivo-X60-might-get-a-curved-display-like-the-pro-version-soon-24900.html", "urlToImage": "https://technave.com/data/files/mall/article/202105240109243654.jpg", "publishedAt": "2021-05-24T01:17:50Z", "content": "The vivo X60 series which consist of the vivo X60 and vivo X60 Pro was launched in Malaysia during March 22. One of the key differences between the both will be a flat and a curved display. Today, a … [+971 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Human Coronavirus CCoV-HuPn-2018 Identified – Originated in Dogs - SciTechDaily", "description": "Discovery shows need to monitor animal viruses, researchers say. Researchers have identified and completed the genetic analysis of a newly discovered coronavirus – one that has evolved from a coronavirus that afflicts dogs to infect humans and may contribute …", "url": "https://scitechdaily.com/new-human-coronavirus-ccov-hupn-2018-identified-originated-in-dogs/", "urlToImage": "https://scitechdaily.com/images/Anastasia-Vlasova-Newly-Discovered-Coronavirus.jpg", "publishedAt": "2021-05-24T01:06:05Z", "content": "Anastasia Vlasova (right) did the genetic analysis of a newly discovered coronavirus. Credit: Ken Chamberlain\r\nDiscovery shows need to monitor animal viruses, researchers say.\r\nResearchers have ident… [+5631 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Could podcast transcription help with moderation? - The Star Online", "description": "Giants of the tech world are doubling down on innovations to stand out in the highly competitive podcast market. To this end, Spotify is working on bringing auto-transcription to its audio formats, an initiative that will no-doubt boost inclusivity, but which…", "url": "https://www.thestar.com.my/tech/tech-news/2021/05/24/could-podcast-transcription-help-with-moderation", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/23/1158395.jpg", "publishedAt": "2021-05-24T00:00:00Z", "content": "Giants of the tech world are doubling down on innovations to stand out in the highly competitive podcast market. To this end, Spotify is working on bringing auto-transcription to its audio formats, a… [+3555 chars]"}, {"source": {"id": null, "name": "ChannelNews"}, "author": "Nathan Jolly", "title": "Steve Wozniak Being Sued For Stealing The Idea Of Woz University – channelnews - ChannelNews", "description": "Apple co-founder Steve Wozniak is being sued for stealing the idea to launch Woz University, a tech school that was allegedly dreamed up by a Connecticut business professor. According to Insider, Woz is facing a million-dollar lawsuit filed by professor Ralph…", "url": "https://www.channelnews.com.au/steve-wozniak-being-sued-for-stealing-the-idea-of-woz-university/", "urlToImage": "https://www.channelnews.com.au/wp-content/uploads/2017/12/Steve-Wozniak.jpg", "publishedAt": "2021-05-23T23:48:43Z", "content": "Apple co-founder Steve Wozniak is being sued for stealing the idea to launch Woz University, a tech school that was allegedly dreamed up by a Connecticut business professor.\r\nAccording to Insider, Wo… [+884 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Matt Swider", "title": "The PS5 will be even harder to buy soon – here's why and how to find it in stock - TechRadar", "description": "Analysis: Finding PS5 in stock has gone from bad to worse. Here's one solution to finding a restock right away.", "url": "https://www.techradar.com/news/ps5-is-it-in-stock", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fP9n7TiXYWHXquBZVcNcnD-1200-80.jpeg", "publishedAt": "2021-05-23T18:04:59Z", "content": "News about PS5 is about to get even grimmer if you intend to find a PS5 restock in the latter half of 2021, according to tech-industry analysts and our PS5 restock Twitter tracker Matt Swider. Matt s… [+4564 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "The Canadian Press", "title": "Strong demand for COVID-19 vaccines for kids 12 to 17, Montreal health unit says - National Post", "description": "MONTREAL — A health unit in Montreal has ordered extra doses of the Pfizer-BioNTech vaccine after experiencing what a spokesman described as exceptional demand…", "url": "https://nationalpost.com/pmn/news-pmn/canada-news-pmn/strong-demand-for-covid-19-vaccines-for-kids-12-to-17-montreal-health-unit-says", "urlToImage": null, "publishedAt": "2021-05-23T15:50:55Z", "content": "MONTREAL A health unit in Montreal has ordered extra doses of the Pfizer-BioNTech vaccine after experiencing what a spokesman described as exceptional demand from teens and their families.\r\nCarl Ther… [+877 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Windows 10 ‘News and Interests’ taskbar feature now rolling out more widely - HT Tech", "description": "The feature is designed to show a feed-like feature worked into the Taskbar, and is probably the most significant change to the Windows Taskbar since the arrival of the Cortana button.", "url": "https://tech.hindustantimes.com/laptops-pc/news/windows-10-news-and-interests-taskbar-feature-now-rolling-out-more-widely-71621764759767.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/05/23/1600x900/image_-_2021-01-16T090450.316_1610768097265_1610768104858_1621764826733.jpg", "publishedAt": "2021-05-23T10:12:39Z", "content": "Microsoft is yet to roll out the 21H1 update, its first major release of the year to Windows 10 computers, but one of the most useful feature additions to the operating system in recent history has a… [+1583 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Dave Stevenson", "title": "How to photograph the super blood moon with your camera or phone - TechRadar", "description": "Capture the blood moon in all its copper-tinged glory", "url": "https://www.techradar.com/how-to/how-to-photograph-the-super-blood-moon-with-your-camera-or-phone", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rPHodx8GL3kKePBRPdnPYg-1200-80.jpg", "publishedAt": "2021-05-23T09:00:00Z", "content": "Whether you call it the super blood moon, the super flower blood moon or a lunar eclipse of the heart, a very special celestial event will be taking place this week and now's the perfect time to make… [+11528 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Musk tweets supports for crypto - The Star Online", "description": "ELON Musk is again tweeting about technology and cryptocurrencies, and this time he’s clear on where his support is at.", "url": "https://www.thestar.com.my/business/business-news/2021/05/23/musk-tweets-supports-for-crypto", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/23/1158062.jpg", "publishedAt": "2021-05-23T02:08:00Z", "content": "ELON Musk is again tweeting about technology and cryptocurrencies, and this time hes clear on where his support is at.\r\nIn a thread started by Musk himself comparing magic to technology where someone… [+1334 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "Samsung Galaxy Z Fold 3 could arrive without any physical buttons - TechRadar", "description": "A new patent filing reveals all", "url": "https://www.techradar.com/news/samsung-galaxy-z-fold-3-could-arrive-without-any-physical-buttons", "urlToImage": "https://cdn.mos.cms.futurecdn.net/PM4rVad9dXJAKNeWJFWgqA-1200-80.jpg", "publishedAt": "2021-05-22T17:30:06Z", "content": "The Samsung Galaxy Z Fold 3 is widely expected to arrive within the next few months, and when it does turn up it might not have any physical buttons attached or at least that's the suggestion from a … [+1952 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Esat Dedezade", "title": "5 of the best Android phones you can’t buy - Techradar", "description": "Whether it's because of location or other problems", "url": "https://www.techradar.com/news/5-of-the-best-android-phones-you-cant-buy", "urlToImage": "https://cdn.mos.cms.futurecdn.net/3uuf9kiXiG5BtnZiS4hcw-1200-80.jpg", "publishedAt": "2021-05-22T07:00:13Z", "content": "If you wanted to, you could, right now, start binge watching an entire series while ordering food, power tools, and a Bob Ross waffle maker, simply by asking a smart speaker to do so. Its safe that i… [+6787 chars]"}]}