{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Specialists have discovered a planetary collision 200 thousand years ago - SwordsToday.ie", "description": "Astronomers Massachusetts Institute of Technology (MIT) Evidence found in the United States, the National University of Ireland and the University of Cambridge Planetary effect...", "url": "https://swordstoday.ie/specialists-have-discovered-a-planetary-collision-200-thousand-years-ago/", "urlToImage": null, "publishedAt": "2021-10-23T23:30:03Z", "content": "AstronomersMassachusetts Institute of Technology (MIT) Evidence found in the United States, the National University of Ireland and the University of CambridgePlanetary effect It happened near the ear… [+2072 chars]"}, {"source": {"id": null, "name": "WRAL.com"}, "author": "Ryan Bisesi", "title": "Wake Co. to offer all 3 COVID-19 vaccine boosters starting on Monday - WRAL.com", "description": "Wake County Public Health will offer COVID-19 vaccine booster doses of Moderna, Johnson & Johnson and Pfizer-BioNTech by appointment on Monday, Oct. 25.", "url": "https://www.wral.com/coronavirus/wake-co-to-offer-all-3-covid-19-vaccine-boosters-starting-on-monday/19940957/", "urlToImage": "https://wwwcache.wral.com/asset/news/local/2021/10/23/19940958/NA36S04172021_thumb.0000006-DMID1-5sn82k5rr-768x432.jpg", "publishedAt": "2021-10-23T23:01:00Z", "content": "Wake County, N.C. — Wake County Public Health will offer COVID-19 vaccine booster doses of Moderna, Johnson &amp; Johnson and Pfizer-BioNTech shots by appointment starting on Monday, Oct. 25.\r\nThe Fo… [+1438 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Kathleen de Villa", "title": "DOH approves COVID-19 booster shots for health workers, seniors - INQUIRER.net", "description": "MANILA, Philippines — Health Secretary Francisco Duque III has approved a recommendation by the Health Technology Assessment Council (HTAC) to give booster shots and additional jabs against", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/08/News180279-e1630183288990-620x453.jpg", "publishedAt": "2021-10-23T21:48:00Z", "content": "Department of Health Secretary Francisco Duque III (Photo by EDWIN BACASMAS / Philippine Daily Inquirer)\r\nMANILA, Philippines Health Secretary Francisco Duque III has approved a recommendation by the… [+6566 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Rishi Sunak to spend billions to digitise NHS - Telegraph.co.uk", "description": "Chancellor to give the health service another boost by paying for new technology, hospitals and maintenance", "url": "https://www.telegraph.co.uk/politics/2021/10/23/rishi-sunak-spend-billions-digitise-nhs/", "urlToImage": "https://www.telegraph.co.uk/content/dam/politics/2021/10/23/TELEMMGLPICT000275383630_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=logo-overlay", "publishedAt": "2021-10-23T20:00:00Z", "content": "The Health Secretary also wants to encourage the rollout of new measures used during the Covid-19 pandemic, which were shown to improve the service offered by medics, including the increased use of d… [+1408 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Apple updates App Store payment rules, but unlikely to satisfy firms like 'Fortnite' developer Epic - HT Tech", "description": "Firms like \"Fortnite\" developer Epic Games will not be satisfied though - the tech giant has been grappling with Epic in a drawn-out dispute over its payments policy.", "url": "https://tech.hindustantimes.com/gaming/news/apple-updates-app-store-payment-rules-but-unlikely-to-satisfy-firms-like-fortnite-developer-epic-71635016588200.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/10/23/1600x900/FILES-US-INTERNET-COURT-GAMES-SOFTWARE-1_1635016774369_1635016815410.jpg", "publishedAt": "2021-10-23T19:16:27Z", "content": "Apple has updated its App Store rules to allow developers to contact users directly about payments, a concession in a legal settlement with companies challenging its tightly controlled marketplace.\r\n… [+1243 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Vast “Magnetic Tunnel” May Surround Earth and Our Entire Solar System - SciTechDaily", "description": "A University of Toronto astronomer’s research suggests the solar system is surrounded by a magnetic tunnel that can be seen in radio waves. Jennifer West, a research associate at the Dunlap Institute for Astronomy & Astrophysics, is making a scientific case t…", "url": "https://scitechdaily.com/a-vast-magnetic-tunnel-may-surround-earth-and-our-entire-solar-system/", "urlToImage": "https://scitechdaily.com/images/Space-Tunnel-Concept.gif", "publishedAt": "2021-10-23T19:11:20Z", "content": "Space tunnel artist’s concept.\r\nA University of Toronto astronomer’s research suggests the solar system is surrounded by a magnetic tunnel that can be seen in radio waves.\r\nJennifer West, a research … [+4872 chars]"}, {"source": {"id": null, "name": "COGconnected"}, "author": "Nolan Bell", "title": "Epic Games Removes Popular Staff Benefit - COGconnected", "description": "Epic Games, the tech giant behind Fortnite and the Epic Games Store, introduced a policy that allowed staff to take every second Friday off. According to a report by Bloomberg, Epic repealed this policy earlier this week much to the chagrin of employees.", "url": "https://cogconnected.com/2021/10/epic-games-removes-popular-staff-benefit/", "urlToImage": "https://cogconnected.com/wp-content/uploads/2019/07/epic-games-store-feature-min.jpg", "publishedAt": "2021-10-23T15:49:14Z", "content": "The COVID-19 pandemic caused a seismic shift in the day-to-day operations of companies around the world. Working from home became standard for over a year, and many firms are offering their employees… [+1907 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Pranob Mehrotra", "title": "This week in Tech: New MacBook Pros, Pixel 6 series, Android apps on Windows, and more - XDA Developers", "description": "This week in tech was an absolute blast compared to the previous one. Check out this post to learn all about the recent developments.", "url": "https://www.xda-developers.com/this-week-in-tech-october-23/", "urlToImage": "https://www.xda-developers.com/files/2021/10/This-week-in-tech-featured-Oct-18-23.jpg", "publishedAt": "2021-10-23T14:55:00Z", "content": "Compared to last week, this week in tech was an absolute blast. Apple launched its latest MacBook Pro models, the AirPods 3, and more. Google unveiled the Pixel 6 series, the second-gen Pixel Stand, … [+3131 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Your Google Meet, Calendar, Gmail have changed; check top new features now - HT Tech", "description": "Google Meet, Google calendar, Gmail have been changed with a number of features added that are intended to enhance cooperation and improve productivity.", "url": "https://tech.hindustantimes.com/tech/news/your-google-meet-calendar-gmail-have-changed-check-top-new-features-now-71634996282926.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2021/10/23/1600x900/Google_1634996309443_1634996330819.JPG", "publishedAt": "2021-10-23T13:38:02Z", "content": "Google rolled out a host of features on Google Meet, Google Chat, Google Docs and other services this week. These are expected to come in useful as the world increasingly opens up after the stringent… [+3544 chars]"}, {"source": {"id": null, "name": "TechNave"}, "author": "Matthew Yap", "title": "OPPO foldable phone could launch in Nov 2021 - TechNave", "description": "Way back in&nbsp;December 2020, it was rumoured that&nbsp;OPPO&nbsp;would launch a&nbsp;foldable phone&nbsp;in 2021. In March, sources claimed that the device w", "url": "https://technave.com/gadget/OPPO-foldable-phone-could-launch-in-Nov-2021-27148.html", "urlToImage": "https://technave.com/data/files/article/202110231302202680.jpg", "publishedAt": "2021-10-23T13:12:52Z", "content": "Way back in December 2020, it was rumoured that OPPO would launch a foldable phone in 2021. In March, sources claimed that the device would be released in June but that didn't happen. This time aroun… [+853 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Eamonn Forde", "title": "20 years of the iPod: how it shuffled music and tech into a new era - The Guardian", "description": "In October 2001, the music industry was riven by piracy and had no idea how to solve it. Enter Steve Jobs, whose new device created a digital music market – and made Apple into a titan", "url": "https://amp.theguardian.com/music/2021/oct/23/20-years-of-the-ipod-how-music-and-tech-new-era-steve-jobs", "urlToImage": null, "publishedAt": "2021-10-23T10:00:00Z", "content": "MusicIn October 2001, the music industry was riven by piracy and had no idea how to solve it. Enter Steve Jobs, whose new device created a digital music market and made Apple into a titan\r\nSat 23 Oct… [+12348 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "John Loeffler", "title": "Dog-sized scorpions, dinosaur shrimp, and exoplanet collisions lead the week in science - TechRadar", "description": "Prehistoric fauna and pursuing absolute zero made our week", "url": "https://www.techradar.com/news/dog-sized-scorpions-dinosaur-shrimp-and-exoplanet-collisions-lead-the-week-in-science", "urlToImage": "https://cdn.mos.cms.futurecdn.net/MW3BtCEk4iNPwNM75y93T9-1200-80.jpg", "publishedAt": "2021-10-22T20:50:59Z", "content": "From megafauna and massive anthropods to an exoplanet that got hit so hard it had the wind literally knocked out of it, science news has definitely been lively this week.\r\nOn the biology front, a new… [+10243 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "Jon Mundy", "title": "iPhone 13 Pro Max vs Samsung Galaxy S21 Ultra: which 2021 flagship phone is for you? - Techradar", "description": "A clash of smartphone kings", "url": "https://www.techradar.com/news/iphone-13-pro-max-vs-samsung-galaxy-s21-ultra", "urlToImage": "https://cdn.mos.cms.futurecdn.net/2GKLqpfZ2tXUMRZeQtimtQ-1200-80.jpg", "publishedAt": "2021-10-22T15:44:56Z", "content": "Apple’s iPhone 13 range is out now, and the iPhone 13 Pro Max is the big and shiny flagship phone leading the charge.\r\nIf it’s to win over the public ahead of the lucrative end of year period, howeve… [+12921 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This passport index claims to be different – and ranks South Africa third in Africa - BusinessTech", "description": "Global Citizen Solutions has launched its Global Passport Index, a comprehensive tool that allows individuals to discover a passport’s true strength using a number of different metrics.", "url": "https://businesstech.co.za/news/business/531250/this-passport-index-claims-to-be-different-and-ranks-south-africa-third-in-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/PassportAirport-e1634886652542.jpg", "publishedAt": "2021-10-22T13:35:34Z", "content": "UK-based immigration consultancy firm Global Citizen Solutions has launched its Global Passport Index, a comprehensive tool that allows individuals to discover a passports true strength using a numbe… [+5198 chars]"}]}