{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Telecom", "title": "Discord to roll out AI-powered chatbot, messaging features - ETTelecom", "description": "Discord, which lets groups of users chat by text, video and voice, said it will revamp a bot called Clyde, who will now be powered by OpenAI technology. Discord users can invoke the AI-powered Clyde to answer trivia questions, help schedule meetings or recomm…", "url": "https://telecom.economictimes.indiatimes.com/news/discord-to-roll-out-ai-powered-chatbot-messaging-features/98530292", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-98530292,imgsize-31516,width-1200,height-628,overlay-ettelecom/discord-to-roll-out-ai-powered-chatbot-messaging-features.jpg", "publishedAt": "2023-03-10T02:11:00Z", "content": "FILE PHOTO: Discord logo is seen in this illustration taken November 7, 2022. REUTERS/Dado Ruvic/Illustration\r\nBy Sheila DangChat app Discord said on Thursday it will introduce new artificial intelli… [+1814 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Disturbing Truth: Opioids Dominate as Primary Cause of Poisoning Deaths in Children - SciTechDaily", "description": "Researchers find rate of fatal opioid poisonings among children more than doubled over 13-year span Over-the-counter drugs also continue to pose fatal risks to young children despite measures to reduce exposure. Researchers from Children’s Hospital of Philade…", "url": "https://scitechdaily.com/disturbing-truth-opioids-dominate-as-primary-cause-of-poisoning-deaths-in-children/", "urlToImage": "https://scitechdaily.com/images/Opioid-Drug-Addiction-Death-Concept.jpg", "publishedAt": "2023-03-09T22:30:05Z", "content": "A study conducted by researchers from Childrens Hospital of Philadelphia (CHOP) found that opioids were responsible for more than half of all fatal poisonings in children under the age of 5, a number… [+4958 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Andrew Cunningham", "title": "Apple will launch a new app exclusively for classical music later this month - Ars Technica", "description": "Classical music app will be included with an Apple One or Apple Music sub.", "url": "https://arstechnica.com/gadgets/2023/03/apple-will-launch-a-new-app-exclusively-for-classical-music-later-this-month/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/apple-music-classical-760x380.jpg", "publishedAt": "2023-03-09T22:21:40Z", "content": "Enlarge/ The Apple Music Classical logo and app icon.\r\n42 with \r\nApple is launching a version of Apple Music specifically for classical music later this month, the company announced today. The Apple … [+1776 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Short covering, position evening in gold ahead of U.S. jobs data - Kitco NEWS", "description": "Senior Technical Analyst Jim Wyckoff prepares investors with an overview of how the markets opened and closed. What moved metal prices? How do the technicals look? By looking at important developments", "url": "https://www.kitco.com/news/2023-03-09/Short-covering-position-evening-in-gold-ahead-of-U-S-jobs-data.html", "urlToImage": "https://www.kitco.com/news/2023-03-09/images/goldchart_0309_pm.png", "publishedAt": "2023-03-09T17:29:00Z", "content": "(Kitco News) - Gold prices are higher in midday U.S. trading Wednesday, with silver near steady. Short covering and some position squaring are featured in the precious metals futures markets just ahe… [+2615 chars]"}, {"source": {"id": null, "name": "Kotaku"}, "author": "Ethan Gach", "title": "Sony Microsoft's Battle Over Activision Is A Full Blown Circus - Kotaku", "description": "The fight over the biggest tech merger in U.S. history continues to be really goofy", "url": "https://kotaku.com/activision-call-duty-mwii-sony-microsoft-playstation-1850207404", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8db9aeb4512739a3f1e8ad0e44096ac6.jpg", "publishedAt": "2023-03-09T16:05:00Z", "content": "Over a year after it was first announced, Microsofts $69 billion Activision Blizzard deal is being picked apart under a microscope by regulators. It still appears to be crawling towards its inexorabl… [+3783 chars]"}, {"source": {"id": null, "name": "Expatguideturkey.com"}, "author": "Ece Nagihan", "title": "Google Translate Now Translates Texts in Pictures! How to Used? - Expat Guide Turkey", "description": "Google Translate can now translate the text on the picture. For this, it will be enough to upload your picture to the Translate site. The rest is Google Lens technology. Although the ChatGPT platform", "url": "https://expatguideturkey.com/google-translate-now-translates-texts-in-pictures-how-to-used/", "urlToImage": null, "publishedAt": "2023-03-09T14:46:42Z", "content": "Google Translate can now translate the text on the picture. For this, it will be enough to upload your picture to the Translate site. The rest is Google Lens technology.\r\nAlthough the ChatGPT platfor… [+1512 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Vidya Nagalwade", "title": "Nanotube sensors can detect and distinguish gibberellin plant hormones - Tech Explorist", "description": "The nondestructive nanosensors could have wide applications in agricultural science.", "url": "https://www.techexplorist.com/nanotube-sensors-detect-distinguish-gibberellin-plant-hormones/57452/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/03/SMART-DiSTAP-nanotube-fluorescence.jpg", "publishedAt": "2023-03-09T06:56:31Z", "content": "Gibberellins (GAs) are a family of phytohormones that are essential for plant development but are challenging to recognize due to their identical chemical structures. MIT researchers build and manufa… [+5657 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Beth Mole", "title": "COVID survivors at increased risk of long-term gastrointestinal conditions - Ars Technica", "description": "Although people with severe COVID had highest risk, mild cases also upped risks.", "url": "https://arstechnica.com/science/2023/03/having-covid-ups-risk-of-many-long-term-gut-problems-study-finds/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-151046607-760x380.jpeg", "publishedAt": "2023-03-08T23:00:12Z", "content": "37 with \r\nSurviving a bout of COVID-19 can significantly increase the risk of developing a range of long-term gastrointestinal symptoms and conditionsfrom constipation and diarrhea to chronic acid re… [+4527 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Georgia Institute of Technology: Super-fast Insect Urination Powered by the Physics of Superpropulsion - India Education Diary", "description": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail and then launched it away so quickly that it seemed", "url": "https://indiaeducationdiary.in/georgia-institute-of-technology-super-fast-insect-urination-powered-by-the-physics-of-superpropulsion/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/03/visit-tech.png?fit=1024%2C444&ssl=1", "publishedAt": "2023-03-08T13:02:55Z", "content": "Saad Bhamla was in his backyard when he saw something he had never seen before: an insect urinating. Though nearly impossible to see, the insect formed an almost perfectly round droplet on its tail a… [+117 chars]"}]}