{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Dark Mysteries of the Cosmos: Unraveling the Secrets of an Invisible Galaxy - SciTechDaily", "description": "A mysterious and very distant object, in a universe as it was ‘just’ two billion years after the Big Bang, that hides from even the most advanced instruments. Its features have finally been described by a SISSA study published in The Astrophysical Journal. An…", "url": "https://scitechdaily.com/?p=265338", "urlToImage": "https://scitechdaily.com/images/Galaxy-Astrophysics-Mystery-Concept-Art.jpg", "publishedAt": "2023-04-10T01:46:30Z", "content": "BySISSA (International School for Advanced Studies)April 9, 2023\r\nResearchers from SISSA have identified the main properties of a mysterious, distant celestial object using the ALMA interferometer. T… [+8627 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "110-foot Asteroid 2023 FT1 hurtling towards Earth, says NASA; travelling at blistering speed - HT Tech", "description": "NASA has warned of an asteroid that is approaching Earth speedily and it will come extremely close to Earth as soon as today, as per NASA.", "url": "https://tech.hindustantimes.com/tech/news/110foot-asteroid-2023-ft1-hurtling-towards-earth-says-nasa-travelling-at-blistering-speed-71681089160230.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/10/1600x900/asteroid-6010220_960_720_1669362561139_1679319215140_1681089279716_1681089279716.jpg", "publishedAt": "2023-04-10T01:15:16Z", "content": "A huge asteroid is headed towards Earth and could make its closest approach to the planet soon. Although asteroids pass closely to Earth on a daily basis, none of them come close enough to impact the… [+1943 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Trading gold closed Friday, but market participants await the jobs report - Kitco NEWS", "description": "Exclusive to Kitco News, technical analyst Gary Wagner provides a daily recap of what happened in the gold market, highlighting important events that captured investors' attention during the U.S. trading session. Wagner's commentary features a mix of fundamen…", "url": "https://www.kitco.com/commentaries/2023-04-09/Trading-gold-closed-Friday-but-market-participants-await-the-jobs-report.html", "urlToImage": "https://www.kitco.com/commentaries/2023-04-09/images/Chart_23-04-06_12-03-42t.gif", "publishedAt": "2023-04-09T22:34:00Z", "content": "Although trading in the futures markets for precious metals, energies, grains, and other commodities is closed for trading tomorrow in honor of “Good Friday”, in this case, the government never rests… [+2202 chars]"}, {"source": {"id": null, "name": "SemiEngineering"}, "author": "Technical Paper Link", "title": "Ferroelectric Polarization in an Elementary Substance or Single-Element Compound - SemiEngineering", "description": "A technical paper titled “Two-dimensional ferroelectricity in a single-element bismuth monolayer” was published by researchers at National University of Singapore, Zhejiang University, Tianjin University, and University of Chinese Academy of... » read more", "url": "https://semiengineering.com/ferroelectric-polarization-in-an-elementary-substance-or-single-element-compound/", "urlToImage": "https://semiengineering.com/wp-content/uploads/AdobeStock_373262549-scaled.jpeg", "publishedAt": "2023-04-09T19:57:22Z", "content": "A technical paper titled “Two-dimensional ferroelectricity in a single-element bismuth monolayer” was published by researchers at National University of Singapore, Zhejiang University, Tianjin Univer… [+1995 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Catalysis Breakthrough Could Unlock Massive Energy Savings - SciTechDaily", "description": "In a significant breakthrough for the field of computational chemistry, chemical engineers from the University of Wisconsin-Madison have created a model that elucidates how catalytic reactions work at the atomic level. This newfound understanding could enable…", "url": "https://scitechdaily.com/?p=266560", "urlToImage": "https://scitechdaily.com/images/Energy-Conversion-Abstract.jpg", "publishedAt": "2023-04-09T19:06:05Z", "content": "University of Wisconsin-Madison chemical engineers have made a breakthrough in computational chemistry by developing a model of catalytic reactions at the atomic scale. This new understanding could l… [+6539 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "Jimmy Pezzone", "title": "Hacking multi-tool Flipper Zero gets banned from Amazon, classified for card skimming - TechSpot", "description": "The device allows users to locate, troubleshoot, test, and debug different types of digital interfaces and hardware devices via radio, radio frequency identification (RFID), near field communication...", "url": "https://www.techspot.com/news/98248-hacking-multi-tool-flipper-zero-gets-banned-amazon.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2023/04/2023-04-09-image-2.jpg", "publishedAt": "2023-04-09T16:09:00Z", "content": "In a nutshell: The Flipper Zero may look like a harmless child's toy from the 90s, but it's capable of far more. The Tamagotchi-like device has been used for everything from opening parking gates and… [+3534 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "HISTORIC! NASA's IXPE captures Crab Nebula like never before - HT Tech", "description": "The Crab Nebula has been seen like never before, courtesy NASA's IXPE techniques.", "url": "https://tech.hindustantimes.com/tech/news/historic-nasa-s-ixpe-captures-crab-nebula-like-never-before-71681042597184.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/04/09/1600x900/crab_nebula2-cxc-ixpe_1681042685671_1681042694095_1681042694095.jpg", "publishedAt": "2023-04-09T12:19:04Z", "content": "The Crab Nebula has been part of several studies by astronomers. It began back on February 22, 1971, when a sounding rocket took off carrying specialized sensors directed towards the Crab Nebula from… [+2274 chars]"}, {"source": {"id": null, "name": "Techarp.com"}, "author": "Dr. Adrian Wong", "title": "Did Switzerland Stop All COVID-19 Vaccinations?! - Tech ARP", "description": "Did Switzerland just order a stop to all COVID-19 vaccinations?! Take a look at the viral claim, and find out what the facts really are!", "url": "https://www.techarp.com/facts/switzerland-covid-19-vaccinations/", "urlToImage": "https://www.techarp.com/wp-content/uploads/2023/04/Switzerland-stop-COVID-19-vaccination-fact-check.jpg", "publishedAt": "2023-04-08T20:34:20Z", "content": "Did Switzerland just order a stop to all COVID-19 vaccinations?!\r\nTake a look at the viral claim, and find out what the facts really are!\r\nClaim : Switzerland Stops All COVID-19 Vaccinations!\r\nPeople… [+4833 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Journey to the Edge of Time: James Webb Space Telescope Reveals Most Distant Galaxies - SciTechDaily", "description": "Astronomers report most distant known galaxies, detected and confirmed by JWST. An international team of astronomers has discovered the earliest and most distant galaxies confirmed to date using data from the James Webb Space Telescope (JWST). The telescope c…", "url": "https://scitechdaily.com/journey-to-the-edge-of-time-james-webb-space-telescope-reveals-most-distant-galaxies/", "urlToImage": "https://scitechdaily.com/images/JWST-Advanced-Deep-Extragalactic-Survey-JADES-scaled.jpg", "publishedAt": "2023-04-08T19:31:36Z", "content": "ByUniversity of California - Santa CruzApril 8, 2023\r\nThe JWST Advanced Deep Extragalactic Survey (JADES) focused on the area in and around the Hubble Space Telescopes Ultra Deep Field. Using Webbs N… [+9465 chars]"}, {"source": {"id": null, "name": "Thetechoutlook.com"}, "author": "Estuti Bajpai", "title": "Tecno Phantom V Fold complete specs listed on Tecno website , just ahead of it’s launch - The Tech Outlook", "description": "Tecno will officially be launching its highly anticipated foldable smartphone - the Phantom V Fold in India on April 11. This smartphone has been a part of quite a few rumors and speculations and was also much awaited by many. This upcoming smartphon", "url": "https://www.thetechoutlook.com/news/new-release/gadgets-release/mobile/tecno-phantom-v-fold-complete-specs-listed-on-tecno-website-just-ahead-of-its-launch/", "urlToImage": "https://www.thetechoutlook.com/wp-content/uploads/2023/04/jpg_20230408_202148_00001.jpg", "publishedAt": "2023-04-08T15:32:06Z", "content": "Tecno will officially be launching its highly anticipated foldable smartphone – the Phantom V Fold in India on April 11. This smartphone has been a part of quite a few rumors and speculations and was… [+1696 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Worming Their Way Into the Secrets of Cell Differentiation – A “Startling” Discovery - SciTechDaily", "description": "Johns Hopkins University researchers have discovered that the protein histone H3 in roundworm chromosomes influences cell differentiation and pluripotency, challenging traditional views on heredity and potentially offering insights into cancer-related mutatio…", "url": "https://scitechdaily.com/worming-their-way-into-the-secrets-of-cell-differentiation-a-startling-discovery/", "urlToImage": "https://scitechdaily.com/images/Worm-Embryonic-Cells-Development-Potential.jpg", "publishedAt": "2023-04-08T08:39:43Z", "content": "ByJohns Hopkins UniversityApril 8, 2023\r\nResearchers from Johns Hopkins University have discovered how histone H3, a protein in roundworm chromosomes, enables offspring to produce specialized cells g… [+6847 chars]"}]}