{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Bad news! Samsung Galaxy S24 series selfie camera details leaked - HT Tech", "description": "Rumors suggest Samsung's Galaxy S24 series may miss a selfie camera upgrade, but software optimisations could still enhance performance.", "url": "https://tech.hindustantimes.com/tech/news/bad-news-samsung-galaxy-s24-series-selfie-camera-details-leaked-71690088683109.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/Samsung_Galaxy_S24_1690088780029_1690088780259.jpg", "publishedAt": "2023-07-23T05:10:47Z", "content": "Samsung's upcoming Galaxy S24 series, slated for release next year, may not see any improvements in its selfie camera. While the Galaxy S24 Ultra is rumored to feature a 5x telephoto camera, replacin… [+2514 chars]"}, {"source": {"id": null, "name": "MarkTechPost"}, "author": "Dhanshree Shripad Shenwai, Dhanshree Shripad Shenwai", "title": "The 'Finding Neurons in a Haystack' Initiative at MIT, Harvard, and Northeastern University Employs Sparse Probing - MarkTechPost", "description": "It is common to think of neural networks as adaptable 'feature extractors' that learn by progressively refining appropriate representations from initial raw inputs. So, the question arises: what characteristics are being represented, and in what way? To bette…", "url": "https://www.marktechpost.com/2023/07/22/the-finding-neurons-in-a-haystack-initiative-at-mit-harvard-and-northeastern-university-employs-sparse-probing/", "urlToImage": "https://www.marktechpost.com/wp-content/uploads/2023/05/Screenshot-2023-05-10-at-10.32.25-PM.png", "publishedAt": "2023-07-23T05:00:00Z", "content": "It is common to think of neural networks as adaptable “feature extractors” that learn by progressively refining appropriate representations from initial raw inputs. So, the question arises: what char… [+6216 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Shivendra Kumar", "title": "Fed meeting, Q1 earnings among top 10 factors to dictate Dalal Street mood this week - The Economic Times", "description": "Major June quarter earnings are lined up for this week. Tata Steel, Bajaj Auto, Asian Paints, SBI Life Insurance Company, Tata Motors, Larsen & Toubro, Tata Consumer Products, Bajaj Finance, Tech Mahindra, Dr Reddy's Laboratories, Cipla, Axis Bank, Nestle Ind…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/fomc-q1-earnings-among-top-10-factors-to-dictate-dalal-street-mood-this-week/articleshow/102050315.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102050298,width-1070,height-580,imgsize-49998,overlay-etmarkets/photo.jpg", "publishedAt": "2023-07-23T04:26:00Z", "content": "Indian benchmark indices fell sharply on Friday, breaking their six-session winning streak. The fall was triggered by IT stocks, especially Infosys, and others just fell in line. Amid a host of impor… [+6640 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Warning: Marijuana Use May Alter Your DNA Methylation - SciTechDaily", "description": "Recent and long-term marijuana use is linked to changes in the human epigenome, a new Northwestern Medicine study published in the journal Molecular Psychiatry has found. Marijuana ranks as the most widely used drug in the United States. Data from the Centers…", "url": "https://scitechdaily.com/warning-marijuana-use-may-alter-your-dna-methylation/", "urlToImage": "https://scitechdaily.com/images/Marijuana-Body-Effects-Art-Concept.jpg", "publishedAt": "2023-07-23T02:33:02Z", "content": "ByNorthwestern UniversityJuly 22, 2023\r\nA study by Northwestern Medicine links recent and long-term marijuana use to changes in the human epigenome. The research identified significant epigenetic cha… [+5543 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Quordle 545 answers for July 23: Get all green boxes! Check Quordle hints, clues, solutions - HT Tech", "description": "Quordle 545 answer for July 23: You are going to have to work hard for a win today and we recommend you take the help of Quordle hints, clues and solutions to ensure victory.", "url": "https://tech.hindustantimes.com/how-to/quordle-545-answers-for-july-23-get-all-green-boxes-check-quordle-hints-clues-solutions-71690073910287.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/07/23/1600x900/quordle_1654498442093_1690074080103.webp", "publishedAt": "2023-07-23T01:03:33Z", "content": "Quordle 545 answers for July 23: The last thing any player wants on a Sunday morning is to deal with a tricky puzzle. Sunday is the weekend and a time when people finally relax from the stress of the… [+1730 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Early Warning: GPS Data Could Detect Large Earthquakes Hours Before They Happen - SciTechDaily", "description": "A systematic global analysis of GPS time-series data from nearly 100 large earthquakes suggests the existence of a precursory phase of fault slip that occurs about two hours before seismic rupture. The analysis of Global Positioning System (GPS) time-series d…", "url": "https://scitechdaily.com/early-warning-gps-data-could-detect-large-earthquakes-hours-before-they-happen/", "urlToImage": "https://scitechdaily.com/images/GPS-Earthquake-Art.jpg", "publishedAt": "2023-07-22T15:41:50Z", "content": "ByWalter Beckwith, American Association for the Advancement of Science (AAAS)July 22, 2023\r\nA comprehensive analysis of GPS time-series data suggests a precursory phase of fault slip occurs two hours… [+3751 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Into the Unknown: NASA's GEDI Space Laser Provides Answers to Rainforest Canopy Mystery - SciTechDaily", "description": "NASA's GEDI, a space laser, has provided a groundbreaking, detailed structural view of the world's rainforests, enabling researchers to further understand these complex ecosystems. Uncovering the Secrets of Rainforest Canopies We know less about the rainfores…", "url": "https://scitechdaily.com/into-the-unknown-nasas-gedi-space-laser-provides-answers-to-rainforest-canopy-mystery/", "urlToImage": "https://scitechdaily.com/images/Lasers-Measuring-Rainforest.jpg", "publishedAt": "2023-07-22T09:12:20Z", "content": "ByNorthern Arizona UniversityJuly 22, 2023\r\nNASAs space laser, GEDI, has revolutionized our understanding of rainforests, revealing a simpler structure with a peak leaf concentration at 15 meters. Th… [+6748 chars]"}, {"source": {"id": null, "name": "Tech Explorist"}, "author": "Pranjal Mehar", "title": "ATLAS measured Higgs boson's mass with unprecedented precision - Tech Explorist", "description": "New result from the ATLAS experiment at CERN reaches the unprecedented precision of 0.09%.", "url": "https://www.techexplorist.com/atlas-measured-higgs-bosons-mass-unprecedented-precision/", "urlToImage": "https://www.techexplorist.com/wp-content/uploads/2023/07/Higgs-boson.jpg", "publishedAt": "2023-07-22T08:54:29Z", "content": "Since its discovery, the Higgs boson has become an exciting topic for shedding light on the Universe’s fundamental structure. Since the Standard Model cannot predict the Higgs boson’s mass, it must b… [+2607 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "The Fungus Among Us: Defying Nature's Anti-Fungal Arsenal - SciTechDaily", "description": "An anti-fungal compound produced by plants doesn’t work on at least one fungus. RIKEN scientists have discovered how a parasitic fungus renders harmless a powerful anti-fungal compound produced by some plants. As well as providing a fascinating glimpse into t…", "url": "https://scitechdaily.com/the-fungus-among-us-defying-natures-anti-fungal-arsenal/", "urlToImage": "https://scitechdaily.com/images/Aglaia-Flower.jpg", "publishedAt": "2023-07-22T04:54:22Z", "content": "ByRIKENJuly 21, 2023\r\nRIKEN researchers found a parasitic fungus immune to plant-produced anti-fungal compounds called rocaglates due to a gene mutation. This discovery could impact the potential use… [+4744 chars]"}, {"source": {"id": null, "name": "International Atomic Energy Agency"}, "author": null, "title": "How Do Nuclear Techniques Help Crime Investigations? - International Atomic Energy Agency", "description": null, "url": "https://www.iaea.org/newscenter/news/how-do-nuclear-techniques-help-crime-investigations", "urlToImage": "https://www.iaea.org/sites/default/files/nuclearexplainedcrimecover.png", "publishedAt": "2023-07-21T12:51:54Z", "content": "Ion beam analysis (IBA) is another nuclear method gaining ground in criminal investigations. For this kind of analysis, ion beam accelerators are used to speed up ions or electrons, producing a beam … [+1513 chars]"}]}