{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": null, "name": "Biopharminternational.com"}, "author": "Cynthia A. Challener", "title": "Technology for In Vivo CAR T-cell Therapy Advances - BioPharm International", "description": "In vivo CAR-T gene therapies could overcome the challenges faced by autologous and allogeneic treatments.", "url": "https://www.biopharminternational.com/view/technology-for-in-vivo-car-t-cell-therapy-advances", "urlToImage": null, "publishedAt": "2023-02-02T02:11:13Z", "content": "There is no doubt that chimeric antigen receptor (CAR) T-cell therapies have had a tremendous positive impact on patients that have received them; however, autologous cell therapies produced in centr… [+18368 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Amplified search for new forces: Special setup uses polarized rubidium and xenon as transmitter and receiver system for exotic fields - Science Daily", "description": "In the search for new forces and interactions beyond the Standard Model, an international team of researchers has now taken a good step forward. The researchers are using an amplification technique based on nuclear magnetic resonance. They use their experimen…", "url": "https://www.sciencedaily.com/releases/2023/02/230201134227.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-02-02T00:59:32Z", "content": "In the search for new forces and interactions beyond the Standard Model, an international team of researchers involving the PRISMA+ Cluster of Excellence at Johannes Gutenberg University Mainz (JGU) … [+5028 chars]"}, {"source": {"id": null, "name": "PRNewswire"}, "author": null, "title": "Revolutionary automated LiDAR classification now available through Neara's self-service offering - PR Newswire", "description": "/PRNewswire/ -- Neara, a leading climate tech software platform and provider of 3D interactive simulation models of critical infrastructure, today announced...", "url": "https://www.prnewswire.com/news-releases/revolutionary-automated-lidar-classification-now-available-through-nearas-self-service-offering-301736722.html", "urlToImage": null, "publishedAt": "2023-02-01T22:17:00Z", "content": "New solution offers LiDAR-based insights of critical infrastructure 30x faster than manual processing\r\nSEATTLE, Feb. 1, 2023 /PRNewswire/ -- Neara, a leading climate tech software platform and provid… [+3729 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Myles Udland", "title": "Stock market live news updates: Tech stocks soar after Fed's latest rate hike - Yahoo Canada Finance", "description": "U.S. stocks were higher on Wednesday with a tech sector rally punctuating the action following the latest interest rate increase from the Federal Reserve.", "url": "https://finance.yahoo.com/news/stock-market-live-news-updates-february-1-2023-130022098.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0zEpZlsCfH4XNWgYhnEZxQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2022-06/4c929320-ed00-11ec-be9f-2e4502516711", "publishedAt": "2023-02-01T21:07:03Z", "content": "Tech stocks rallied Wednesday following the Federal Reserve's latest interest rate increase after Fed Chair Jerome Powell suggested signs of \"disinflation\" are building in the economy.\r\nWhen the clos… [+4926 chars]"}, {"source": {"id": null, "name": "Insideprecisionmedicine.com"}, "author": "Christina Jackson", "title": "Cancer Vaccines Get Structural Remake - Inside Precision Medicine", "description": "Researchers have combined chemistry and nanotechnology to change the structural location of adjuvants and antigens on and within a nanoscale cancer vaccine to boost potency and performance.", "url": "https://www.insideprecisionmedicine.com/topics/oncology/cancer-vaccines-get-structural-remake/", "urlToImage": "https://www.insideprecisionmedicine.com/wp-content/uploads/2020/03/Vaccine-1135748611-e1663600065499.jpg", "publishedAt": "2023-02-01T20:13:40Z", "content": "Researchers from the International Institute for Nanotechnology (IIN) at Northwestern University have combined chemistry and nanotechnology to change the structural location of adjuvants and antigens… [+4112 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Nicole Gierig", "title": "Learning with all your senses: Multimodal enrichment as the optimal learning strategy of the future - Phys.org", "description": "Neuroscientist Katharina von Kriegstein from Technische Universität Dresden and Brian Mathias from the University of Aberdeen have compiled extensive interdisciplinary findings from neuroscience, psychology, computer modeling and education on the topic of \"le…", "url": "https://phys.org/news/2023-02-multimodal-enrichment-optimal-strategy-future.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/learning-with-all-your.jpg", "publishedAt": "2023-02-01T20:04:03Z", "content": "Neuroscientist Katharina von Kriegstein from Technische Universität Dresden and Brian Mathias from the University of Aberdeen have compiled extensive interdisciplinary findings from neuroscience, psy… [+3522 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Ron Amadeo", "title": "Samsung Galaxy S23 is official, with special-edition Qualcomm chip - Ars Technica", "description": "Samsung dumps the Exynos SoC internationally and gets a higher-binned Qualcomm chip.", "url": "https://arstechnica.com/gadgets/2023/02/samsungs-galaxy-s23-starts-at-800-ships-february-17/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/02/Galaxy_S23_Series_02-1-760x380.jpg", "publishedAt": "2023-02-01T18:27:25Z", "content": "50 with 0 posters participating\r\n<ul><li>\r\n The S23 Series. Everything has a similar camera design this year. \r\n</li><li>\r\n</li><li>\r\n The Ultra model still has an S-Pen. \r\n</li><li>\r\n The Plus and b… [+4740 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Staff Reporter", "title": "Samsung Galaxy S23 launched - South African pricing, specs - TechCentral - TechCentral", "description": "Samsung Electronics has taken the wraps off the Galaxy S23, S23+ and S23 Ultra. This is how much they cost in South Africa.", "url": "https://techcentral.co.za/samsung-galaxy-s23-launched-south-african-pricing-specs/221585/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2023/01/samsung-galaxy-s23-adjusted.jpg", "publishedAt": "2023-02-01T18:00:39Z", "content": "Samsung Electronics on Wednesday took the wraps off its latest flagship smartphone series, the Galaxy S23, S23+ and S23 Ultra.\r\nNot that there was much new to reveal, mind you: almost everything abou… [+2521 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Samsung z velikim padcem dobička - Slo-Tech", "description": "Comprehensive up-to-date news coverage, aggregated from sources all over the world by Google News.", "url": "https://news.google.com/rss/articles/CBMiI2h0dHBzOi8vc2xvLXRlY2guY29tL25vdmljZS90ODExNDk30gEnaHR0cHM6Ly9zbG8tdGVjaC5jb20vbm92aWNlL3Q4MTE0OTcvYW1w", "urlToImage": "https://lh3.googleusercontent.com/J6_coFbogxhRI9iM864NL_liGXvsQp2AupsKei7z0cNNfDvGUmWUy20nuUhkREQyrpY4bEeIBuc=s0-w300-rw", "publishedAt": "2023-02-01T17:53:22Z", "content": null}, {"source": {"id": null, "name": "Nnn.ng"}, "author": "NNN", "title": "Green Comet Last Seen By Neanderthals 50,000 Years Ago To Fly Past Earth Tonight - News Today February 1, 2023 - NNN NEWS NIGERIA", "description": "Green Comet Stargazers hoping to glimpse as ancient green comet are being urged to look to the skies tonight. The rare celestial visitor is expected to shine brightest during this week after being only visible last month thorough telescope. The technical name…", "url": "https://nnn.ng/green-comet-last-seen-by-neanderthals-50000-years-ago-to-fly-past-earth-tonight/", "urlToImage": "https://i1.wp.com/i2-prod.mirror.co.uk/incoming/article29104825.ece/ALTERNATES/s1200/1_SWNS_DEVON_COMET_03.jpg", "publishedAt": "2023-02-01T16:53:04Z", "content": "Stargazers hoping to glimpse as ancient green comet are being urged to look to the skies tonight.\r\nThe rare celestial visitor is expected to shine brightest during this week after being only visible … [+2453 chars]"}, {"source": {"id": null, "name": "African.business"}, "author": "apofeed", "title": "Dakar 2 Summit: Partnership to deliver technologies to farmers to feed Africa – says Adesina - African Business", "description": "Africa’s push for food sovereignty and resilience depends on investments and partnerships, African Development Bank Group (www.AfDB.org) president", "url": "https://african.business/2023/02/apo-newsfeed/dakar-2-summit-partnership-to-deliver-technologies-to-farmers-to-feed-africa-says-adesina/", "urlToImage": "https://www.africa-newsroom.com/files/thumb/be413315157c7f1/600/418", "publishedAt": "2023-02-01T16:05:57Z", "content": "Africas push for food sovereignty and resilience depends on investments and partnerships, African Development Bank Group (www.AfDB.org) president Akinwumi Adesina said on Thursday at the Dakar 2 Food… [+2886 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "Press Trust of India", "title": "Microsoft to bring new look to Teams Rooms on Windows - The Siasat Daily", "description": "Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays", "url": "https://www.siasat.com/microsoft-to-bring-new-look-to-teams-rooms-on-windows-2516397/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2023/02/wgqgeqge-1.jpg", "publishedAt": "2023-02-01T16:01:00Z", "content": "San Francisco: Tech giant Microsoft has announced that it will bring a new look to its Teams Rooms on Windows consoles and front-of-room displays, by the end of this quarter.\r\n“To make Teams Rooms ev… [+1408 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "Synching Information Speed To Brain Rhythms Enhances Adult Learning - Technology Networks", "description": "Matching the speed of information delivery during a learning task to the natural tempo of the brain can help enhance learning, according to research from the University of Cambridge.", "url": "https://www.technologynetworks.com/neuroscience/news/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/369729/synching-information-speed-to-brain-rhythms-enhances-adult-learning-369729-640x360.jpg?cb=20230201", "publishedAt": "2023-02-01T10:15:13Z", "content": "Scientists have shown for the first time that briefly tuning into a persons individual brainwave cycle before they perform a learning task dramatically boosts the speed at which cognitive skills impr… [+6123 chars]"}, {"source": {"id": null, "name": "ITWeb"}, "author": "DigiCloud", "title": "Google puts more power behind cloud security, ‘shared fate’ model - ITWeb", "description": "Google is evolving a shared responsibility model to a shared fate model in which it actively partners with customers to deploy secure solutions in the cloud, says Louis van Schalkwyk, head of technical operations at Digicloud Africa.", "url": "https://www.itweb.co.za/content/JN1gPvOAblbMjL6m", "urlToImage": "https://www.itweb.co.za/static/pictures/2019/04/-fs-Google-Next-2-2019.jpg", "publishedAt": "2023-02-01T06:32:00Z", "content": "Google Clouds recent acquisition of Mandiant, a leader in dynamic cyber defence, threat intelligence and incident response, will significantly strengthen Googles already robust cloud security. \r\nThis… [+5285 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "UCF researchers uncover key mechanisms for sustainable ammonia production - EurekAlert", "description": "A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing sustainable fertilizer research and thus aiding global food safety efforts.\nAmmonia, a…", "url": "https://www.eurekalert.org/news-releases/978297", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2023-01-31T19:54:28Z", "content": "ORLANDO, Jan. 31, 2022 — A University of Central Florida research team with collaborators at Virginia Tech have published critical findings about the electrochemical synthesis of ammonia, advancing s… [+4796 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers Use Quantum Mechanics To See Objects Without Looking at Them - SciTechDaily", "description": "The newly developed method links quantum and classical worlds and may enhance measurements for quantum computers and other applications. Our vision is made possible by the specialized cells in our retina that absorb light. But, can one see without any absorpt…", "url": "https://scitechdaily.com/researchers-use-quantum-mechanics-to-see-objects-without-looking-at-them/", "urlToImage": "https://scitechdaily.com/images/Researchers-Use-Quantum-Mechanics-To-See-Objects-Without-Looking-at-Them-scaled.jpg", "publishedAt": "2023-01-31T19:31:20Z", "content": "ByAalto UniversityJanuary 31, 2023\r\nAalto University quantum researchers use quantum coherence to detect objects without looking at them. Credit: Mikko Raskinen/Aalto University.\r\nThe newly developed… [+4968 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ogaga Ariemu", "title": "Google unveils first startup accelerator for African women entrepreneurs - Daily Post Nigeria", "description": "Global tech giant Google on Tuesday launched a programme that would provide resources and opportunities for women founders in Africa. The programme is tagged “First Google for Startups Accelerator: Women Founders in Africa” and will facilitate women's inclusi…", "url": "https://dailypost.ng/2023/01/31/google-unveils-first-startup-accelerator-for-african-women-entrepreneurs/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/06/jpg.jpeg", "publishedAt": "2023-01-31T17:07:31Z", "content": "Global tech giant Google on Tuesday launched a programme that would provide resources and opportunities for women founders in Africa.\r\nThe programme is tagged First Google for Startups Accelerator: W… [+2491 chars]"}]}