{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "G7 sanctions aim to starve Russia of tech, equipment. What it means for India - Hindustan Times", "description": "The G7 joint statement said they were imposing further sanctions and measures to increase costs to Russia and those who are supporting its Ukraine war effort | Latest News India", "url": "https://www.hindustantimes.com/india-news/g7-imposes-new-sanctions-on-russia-impacting-india-s-efforts-to-forge-g20-consensus-on-ukraine-invasion-focus-on-nuclear-disarmament-101684513306087.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/05/19/1600x900/Leaders-of-the-seven-largest-economies-meeting-in-_1684514199950.jpg", "publishedAt": "2023-05-19T16:21:45Z", "content": "The Group of Seven (G7) nations on Friday unveiled new sanctions against Russia, including measures to starve Moscow of technology and industrial equipment a move that can impact Indias efforts to fo… [+3658 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Earth-like exoplanet with volcanoes found by NASA's TESS and Spitzer telescopes - HT Tech", "description": "Scientists using NASA's TESS and Spitzer telescopes have made a remarkable discovery beyond our solar system.", "url": "https://tech.hindustantimes.com/tech/news/earthlike-exoplanet-with-volcanoes-found-by-nasas-tess-and-spitzer-telescopes-71684494232496.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/19/1600x900/Earth-like_exoplanet_with_volcanoes_found_by_NASA_1684494352916_1684494353150.jpg", "publishedAt": "2023-05-19T11:09:29Z", "content": "Scientists using NASA's TESS (Transiting Exoplanet Survey Satellite) and Spitzer Space Telescope have made a remarkable discovery an Earth sized exoplanet orbiting a star in a neighbouring galaxy. Th… [+1891 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Radio Signal Reveals Origin of a Thermonuclear Supernova Explosion - SciTechDaily", "description": "In the latest issue of the journal Nature, astronomers from Stockholm University reveal the origin of a thermonuclear supernova explosion. Strong emission lines of helium and the first detection of such a supernova in radio waves show that the exploding white…", "url": "https://scitechdaily.com/radio-signal-reveals-origin-of-a-thermonuclear-supernova-explosion/", "urlToImage": "https://scitechdaily.com/images/Helium-Rich-Material-Companion-Star-Accreting-White-Dwarf-scaled.jpg", "publishedAt": "2023-05-19T11:04:42Z", "content": "ByStockholm UniversityMay 19, 2023\r\nArtists impression of helium-rich material from a companion star accreting onto a white dwarf. Before the explosion, a large amount of material is stripped from th… [+5234 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Lauren Haughey", "title": "'Planet killer' asteroids pose 'no threat' to Earth for at least 1000 YEARS, scientists say - Daily Mail", "description": "Scientists at the University of Colorado and the California Institute of Technology claim that giant rock collisions pose no real threat to Earth for at least 1,000 years.", "url": "https://www.dailymail.co.uk/sciencetech/article-12102075/Planet-killer-asteroids-pose-no-threat-Earth-1-000-YEARS-scientists-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/05/19/10/71172871-0-image-a-10_1684487609907.jpg", "publishedAt": "2023-05-19T10:29:24Z", "content": "Planet killing asteroids have been a nerve-wracking prospect ever since we learned of the dinosaurs' demise. \r\nBut scientists claims we can rest easy for now, as giant asteroid collisions pose no rea… [+3415 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Harnessing Energy Waves: Smart Material Prototype Challenges Newton's Laws of Motion - SciTechDaily", "description": "University of Missouri researchers designed a prototype of a small, lightweight active ‘metamaterial’ that can control the direction and intensity of energy waves. Professor Guoliang Huang of the University of Missouri has developed a prototype metamaterial t…", "url": "https://scitechdaily.com/harnessing-energy-waves-smart-material-prototype-challenges-newtons-laws-of-motion/", "urlToImage": "https://scitechdaily.com/images/Swirl-Particle-Physics-Concept.gif", "publishedAt": "2023-05-19T08:28:11Z", "content": "ByUniversity of Missouri-ColumbiaMay 19, 2023\r\nA prototype innovative metamaterial with unconventional properties employs electrical signals to control the direction and intensity of energy waves tra… [+3959 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Master of Disguise: The Ant-Plant-Spider Triple Threat! - SciTechDaily", "description": "The Siler collingwoodi, a jumping spider species, uses camouflage and ant-mimicry as defenses against predators, blending with plants and adopting ant-like movement to evade spider predators, but not praying mantises, a study in iScience revealed. However, li…", "url": "https://scitechdaily.com/master-of-disguise-the-ant-plant-spider-triple-threat/", "urlToImage": "https://scitechdaily.com/images/Siler-collingwoodi-Ant-Mimicking-Spider-scaled.jpg", "publishedAt": "2023-05-19T00:36:26Z", "content": "ByCell PressMay 18, 2023\r\nThis is a photo of Siler collingwoodi, an ant-mimicking spider. This species of jumping spider uses a combination of camouflage and ant-mimicry for protection from predators… [+6917 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Amputees could feel warmth of human touch with new bionic technology - Reuters", "description": "Fabrizio Fidati, who lost his right hand in an accident 25 years ago, had not experienced the sensation of temperature in his missing digits until trials for a bionic technology unlocked the cool of iced water and heat of a stove burner for him.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/amputees-could-feel-warmth-human-touch-with-new-bionic-technology-2023-05-18/", "urlToImage": "https://www.reuters.com/resizer/WeNN_YPsQRos2TXxojTaXdSsLSQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PKKGM3ZJMJKPHGFHMWQOBQM2YI.jpg", "publishedAt": "2023-05-18T21:44:00Z", "content": "GENEVA, May 18 (Reuters) - Fabrizio Fidati, who lost his right hand in an accident 25 years ago, had not experienced the sensation of temperature in his missing digits until trials for a bionic techn… [+3236 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New DNA Research Changes Origin of Human Species - SciTechDaily", "description": "New model for human evolution suggests Homo sapiens arose from multiple closely related populations. A new study in Nature challenges prevailing theories, suggesting that Homo sapiens evolved from multiple diverse populations across Africa, with the earliest …", "url": "https://scitechdaily.com/new-dna-research-changes-origin-of-human-species/", "urlToImage": "https://scitechdaily.com/images/Human-Homo-Sapien-Concept-Art-Illustration.jpg", "publishedAt": "2023-05-18T12:44:46Z", "content": "ByUniversity of California - DavisMay 18, 2023\r\nA new model for human evolution asserts that modern Homo sapiens stemmed from multiple genetically diverse populations across Africa rather than a sing… [+6176 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "3 free alternatives to Microsoft Excel: save money and boost your productivity - HT Tech", "description": "If you're looking to avoid the expense of a Microsoft Office subscription, there are excellent free alternatives to Microsoft Excel available. These alternatives offer comparable features without the price tag, making them ideal for budget-conscious individua…", "url": "https://tech.hindustantimes.com/how-to/3-free-alternatives-to-microsoft-excel-save-money-and-boost-your-productivity-71684395648455.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/05/18/1600x900/Microsoft_excel_alternative_1684395976231_1684395976606.jpg", "publishedAt": "2023-05-18T07:53:00Z", "content": "Spreadsheets have become an integral part of the modern business world, and they offer valuable tools for students and teachers as well. However, Microsoft Office's Excel, while powerful, can be expe… [+2600 chars]"}]}