{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ivan Mehta", "title": "The rabbit r1 will use Perplexity AI’s tech to answer your queries - TechCrunch", "description": "The rabbit r1 will use Perplexity AI's tech to answer user queries, both companies said in an announcement.", "url": "https://techcrunch.com/2024/01/19/the-rabbit-r1-will-use-perplexity-ais-tech-to-answer-your-queries/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/01/rabbit-left.jpg?resize=1200,794", "publishedAt": "2024-01-19T13:36:18Z", "content": "One of the standout gadgets of this year’s Consumer Electronics Show (CES), the rabbit r1, will use Perplexity AI’s tech to answer user queries, both companies said in an announcement.\r\nPerplexity no… [+2265 chars]"}, {"source": {"id": null, "name": "OpIndia"}, "author": "OpIndia Staff", "title": "“Mukhyamantri ji aisa hota rehta hai”: PM Modi quips addressing Siddaramaiah as crowd erupts with ‘Modi, Modi’ chant at Boeing India Engineering & Tech Center launch - OpIndia", "description": "Boeing's new campus in India will become a cornerstone for partnership with the vibrant startup, private and government ecosystem in India, and will help develop next-generation products and services for the global aerospace and defence industry. | OpIndia Ne…", "url": "https://www.opindia.com/2024/01/mukhyamantri-ji-aisa-hota-rehta-hai-pm-modi-quips-addressing-siddaramaiah/", "urlToImage": "https://www.opindia.com/wp-content/uploads/2024/01/modi-sidda.jpg", "publishedAt": "2024-01-19T13:23:37Z", "content": "Prime Minister Narendra Modi today delivered an address at the inauguration of Boeing India Engineering &amp; Tech Center in Bengaluru, Karnataka.\r\nPM Modi spoke about the growth of the Indian econom… [+2455 chars]"}, {"source": {"id": null, "name": "TechNode"}, "author": "Jessie Wu", "title": "Huawei launches HarmonyOS NEXT to break away from Android · TechNode - TechNode", "description": "Huawei announced open applications for its developer preview version of HarmonyOS NEXT, with plans to release a more feature-complete developer beta version in the second quarter and a commercial version by the fourth quarter of 2024 as it looks to cut its ti…", "url": "http://technode.com/2024/01/19/huawei-launches-harmonyos-next-with-ambitious-plans-to-break-away-from-android/", "urlToImage": "https://technode.com/wp-content/uploads/2024/01/next.jpg", "publishedAt": "2024-01-19T09:40:22Z", "content": "Every Wednesday and Friday, TechNodes Briefing newsletter delivers a roundup of the most important news in China tech, straight to your inbox.\r\nOn Thursday, Huawei announced open applications for its… [+3053 chars]"}]}