{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Morgan Little", "title": "Apple vs US antitrust lawsuit: Everything we know so far on the DOJ’s iPhone case - TechCrunch", "description": "The DOJ and Apple are now in a legal battle over a lawsuit alleging the company operates its iPhone business like a monopoly.", "url": "https://techcrunch.com/2024/03/22/apple-vs-us-antitrust-lawsuit-everything-we-know-so-far-on-the-dojs-iphone-case/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/03/apple-antitrust-doj-splash.jpg?resize=1200,675", "publishedAt": "2024-03-22T19:19:57Z", "content": "Apples antitrust scrutiny has reached a fever pitch. The U.S. Department of Justice announced Thursday that it filed a lawsuit accusing the company of behaving like a monopoly in locking in iPhone cu… [+4579 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Progress in the diagnosis of systemic diseases based on ophthalmic imaging artificial intelligence technology - Medical Xpress", "description": "The eye is a unique window to overall health. Its associated medical imaging has great characteristics, such as being non-invasive, convenient, and rich in information, which offers significant potential for developing new technologies for diagnosing systemic…", "url": "https://medicalxpress.com/news/2024-03-diagnosis-diseases-based-ophthalmic-imaging.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/progress-in-the-diagno.jpg", "publishedAt": "2024-03-22T17:53:03Z", "content": "by Sichuan International Medical Exchange and Promotion Association \r\nInterconnections between the eye and systemic health. This schematic illustrates the correlations between the eye's blood vessels… [+4092 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Mohammad Rehan Khan", "title": "Unveiling the Cosmos: Journey through breathtaking images taken by NASA's Hubble Space Telescope - HT Tech", "description": "Unveiling the Cosmos Journey through breathtaking images taken by NASAs Hubble Space Telescope Westerlund 2 Cluster The Hubble Telescope unveils Westerlund 2 a bustling cluster of 3000 stars nestled within the Gum 29 nebula. Galaxy NGC 4535 Behold the beauty …", "url": "https://tech.hindustantimes.com/web-stories/unveiling-the-cosmos-journey-through-breathtaking-images-taken-by-nasas-hubble-space-telescope-71711117070508.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/03/22/1600x900/Hubble_Space_Telescope__1703433789934_1711118081023.jpg/", "publishedAt": "2024-03-22T09:05:43Z", "content": "Photo Credit: Apple\r\n  Westerlund 2 Cluster: The Hubble Telescope unveils Westerlund 2, a bustling cluster of 3,000 stars nestled within the Gum 29 nebula.\r\nPhoto Credit: NASA\r\n Galaxy NGC 4535: Beho… [+1624 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "Muhammad Zulhusni", "title": "Meta, Microsoft, X, and Match back Epic Games in Apple dispute - Tech Wire Asia", "description": "Epic Games and Apple continue their intense legal feud over App Store payment policies; but with Meta, Microsoft, X, and Match joining in.", "url": "https://techwireasia.com/03/2024/meta-microsoft-x-and-match-rally-around-epic-games-in-apple-dispute/", "urlToImage": "https://techwireasia.com/wp-content/uploads/2024/03/16012022_Kaspersky_featured.jpg", "publishedAt": "2024-03-22T01:00:22Z", "content": "<ul><li>Epic Games, joined by Meta, Microsoft, X, and Match, intensifies its legal battle against Apple.</li><li>Recent legal developments see the Supreme Court rejecting appeals from both Apple and … [+5485 chars]"}]}