{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Sparrowsnews.com"}, "author": "Kamlesh Bhati", "title": "DJI Osmo Pocket 3 Official Now: The Ultimate Pocket-Sized Gimbal Camera For Stunning Imagery | SPARROWS NEWS - Sparrows News", "description": "DJI, the global leader in innovative camera technology and civilian drones, has unveiled its latest creation: the Osmo Pocket 3. This compact, pocket-sized gimbal...", "url": "https://sparrowsnews.com/2023/10/25/dji-osmo-pocket-3-official-now/", "urlToImage": "https://i0.wp.com/sparrowsnews.com/wp-content/uploads/2023/10/wp-1698242452040.webp", "publishedAt": "2023-10-25T14:02:45Z", "content": "In a groundbreaking announcement, DJI, the global leader in innovative camera technology and civilian drones, has unveiled its latest creation: the Osmo Pocket 3. This compact, pocket-sized gimbal ca… [+4983 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Physics Unraveled: Accelerating Waves and the Mysteries of Time and Relativity - SciTechDaily", "description": "Researchers have derived a new wave equation, linking wave mechanics with the general theory of relativity and the arrow of time, offering solutions to long-standing physics debates and introducing applications for novel materials. Researchers at Tampere Univ…", "url": "https://scitechdaily.com/physics-unraveled-accelerating-waves-and-the-mysteries-of-time-and-relativity/", "urlToImage": "https://scitechdaily.com/images/Artistic-Depiction-of-Exponentially-Curved-Spacetime.jpg", "publishedAt": "2023-10-25T13:11:13Z", "content": "An artistic depiction of a wave encountering an exponentially curved spacetime. Credit: Matias Koivurova, University of Eastern Finland\r\nResearchers have derived a new wave equation, linking wave mec… [+6323 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Chilling Revelations: Ancient Landscape Discovered Beneath East Antarctic Ice Sheet - SciTechDaily", "description": "Scientists discovered an ancient river-formed landscape beneath the Antarctic ice, offering valuable insights into the ice sheet's long-term stability and reactions to climate shifts. A research team, led by Durham University, UK, used satellite data and radi…", "url": "https://scitechdaily.com/chilling-revelations-ancient-landscape-discovered-beneath-east-antarctic-ice-sheet/", "urlToImage": "https://scitechdaily.com/images/Landscape-of-Antarctica-With-Ice-Lifted-Away.jpg", "publishedAt": "2023-10-25T08:42:19Z", "content": "ByDurham UniversityOctober 25, 2023\r\nThe left and right images show the plane and equipment used to conduct a partial survey of Antarctica during the ICECAP data gathering project, courtesy of ICECAP… [+5211 chars]"}, {"source": {"id": "ars-technica", "name": "Ars Technica"}, "author": "Stephen Clark", "title": "For the first launch of ULA’s Vulcan rocket, it’s Christmas or next year - Ars Technica", "description": "Astrobotic's lunar lander ships to Florida later this week for final launch preps.", "url": "https://arstechnica.com/space/2023/10/for-the-first-launch-of-ulas-vulcan-rocket-its-christmas-or-next-year/", "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/10/52649629958_428ac9403f_k-760x380.jpg", "publishedAt": "2023-10-25T00:11:55Z", "content": "Enlarge/ The first stage for ULA's Vulcan rocket was lifted onto its launch platform at Cape Canaveral in January.\r\n27 with \r\nThree days at Christmastime will be the final chance for United Launch Al… [+3344 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Chandrayaan-4 mission: Will ISRO vehicles survive the lunar night this time? - HT Tech", "description": "Chandrayaan4 mission Will ISRO vehicles survive the lunar night this time Know how many days the Chandrayaan4 mission will survive on the lunar surface and how different it is from the Chandrayaan3 mission. ISRO and JAXA now have all their focus on the Chandr…", "url": "https://tech.hindustantimes.com/web-stories/chandrayaan4-mission-will-isro-vehicles-survive-the-lunar-night-this-time-71698211232714.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2023/10/25/1600x900/jaxas_092_02_01_en_1698211593952_1698211597863.png/", "publishedAt": "2023-10-24T23:57:43Z", "content": "Photo Credit: JAXA\r\n  Know how many days the Chandrayaan-4 mission will survive on the lunar surface and how different it is from the Chandrayaan-3 mission.\r\nPhoto Credit: ISRO\r\n ISRO and JAXA now ha… [+1644 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Astrophysicists scan the galaxy for signs of life - Phys.org", "description": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would provide support for the existence of intelligent, alien life.", "url": "https://phys.org/news/2023-10-astrophysicists-scan-galaxy-life.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/astrophysicists-scan-t.jpg", "publishedAt": "2023-10-24T17:06:35Z", "content": "The astrophysicists, from Trinity and the Breakthrough Listen team and Onsala Space Observatory in Sweden, are scanning the universe for \"technosignatures\" emanating from distant planets that would p… [+4084 chars]"}]}