{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CNBCTV18"}, "author": "Reuters", "title": "Time for the moon? White House directs NASA to establish unified lunar standard - CNBCTV18", "description": "The head of the White House Office of Science and Technology Policy (OSTP), according to a memo seen by Reuters, instructed the space agency to work with other parts of the U.S. government to devise a plan by the end of 2026 for setting what it called a Coord…", "url": "https://www.cnbctv18.com/science/time-for-the-moon-white-house-directs-nasa-to-establish-unified-lunar-standard-19391789.htm", "urlToImage": "https://www.cnbctv18.com/assets/images/logo-600x314.jpg?im=FitAndFill,width=500,height=300", "publishedAt": "2024-04-03T15:33:51Z", "content": "The White House on Tuesday directed NASA to establish a unified standard of time for the moon and other celestial bodies, as the United States aims to set international norms in space amid a growing … [+4559 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Vibhuti Sanchala, Isha Mehrotra", "title": "How pharma rivals Bharat Biotech, SII have joined forces to fight polio globally - Firstpost", "description": "Bharat Biotech has collaborated with the Netherlands-based Bilthoven Biologicals B.V, a wholly-owned subsidiary of Serum Institute of India, to strengthen production and ensure supply of oral polio vaccines. This news comes three years after a the two pharma …", "url": "https://www.firstpost.com/explainers/pharma-rivals-bharat-biotech-sii-polio-vaccine-13755642.html", "urlToImage": "https://images.firstpost.com/uploads/2024/04/2020-11-29T132442Z_924831709_RC20DK9O45O9_RTRMADP_3_YEMEN-SECURITY-POLIO-1-2024-04-5e567f8f1b13f8a21c758817f2f69510.jpg?im=FitAndFill=(1200,675)", "publishedAt": "2024-04-03T13:30:27Z", "content": "Top vaccine makers and rivals Bharat Biotech and Serum Institute of India (SII), putting aside disagreements, have teamed up to eradicate polio globally.\r\nThis news comes three years after a heated p… [+7184 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "Apollo asteroid to pass Earth today, reveals NASA; From size to speed, know details - HT Tech", "description": "NASA says an Apollo asteroid is expected to pass Earth by a close margin today, April 3. From size, speed to distance of approach, know all about Asteroid 2024 FL3.", "url": "https://tech.hindustantimes.com/tech/news/apollo-asteroid-to-pass-earth-today-reveals-nasa-from-size-to-speed-know-details-71712122952677.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/04/03/1600x900/asteroid_1698721002814_1712123073968.jpg", "publishedAt": "2024-04-03T05:51:48Z", "content": "In recent months, Asteroids have been passing by Earth in large numbers. Just yesterday, as many as three asteroids passed the planet by a close margin. Two of them were 100 feet wide, making them al… [+1874 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Lauren Forristal", "title": "Meta now requires users to verify their age to use its Quest VR headsets - TechCrunch", "description": "During the congressional online safety hearing in January, Meta CEO Mark Zuckerberg argued that mobile app store providers like Apple and Google should be Meta is prompting Quest users to confirm their age by reentering their birthdays so it can provide age-a…", "url": "https://techcrunch.com/2024/04/02/meta-quest-age-verification/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/04/meta-quest-vr-preteen-age-verification.jpg?w=1200", "publishedAt": "2024-04-02T15:28:00Z", "content": "During the congressional online safety hearing in January, Meta CEO Mark Zuckerberg argued that mobile app store providers like Apple and Google should be the ones to implement parental controls for … [+1561 chars]"}]}