{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Priya Kumari", "title": "Get help! How to add emergency information on your phone's locked screen - HT Tech", "description": "Your Android phone can help you during emergencies. You can add emergency information, messages on your phone's lock screen for the same.", "url": "https://tech.hindustantimes.com/how-to/get-help-how-to-add-emergency-information-on-your-phone-s-lock-screen-71642306709535.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/16/1600x900/man-holding-a-smartphone-with-blank-screen_ebc06ff2-04e8-11e9-b709-b8f5f1e83cec_1642306790346.jpg", "publishedAt": "2022-01-16T04:23:58Z", "content": "Emergency-like situations can happen anytime and at anyplace. You may not always be surrounded by people who can help you at the time of an emergency. But, what you always have with you is your smart… [+1564 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "PUBG New State coupon code released! Get new 'Party' crate, 5 chicken medals- Know how - HT Tech", "description": "PUBG New State coupon codes have been released! Now, players can grab a new 'Party' crate and 5 chicken medals. Here is how to redeem the codes.", "url": "https://tech.hindustantimes.com/gaming/news/pubg-new-state-coupon-code-released-get-new-party-crate-5-chicken-medals-know-how-71642304697895.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/16/1600x900/FJLokuKVIAIuedx_1642304735338_1642305190274.jpg", "publishedAt": "2022-01-16T03:50:19Z", "content": "PUBG New State has released exclusive coupon code to redeem a new \"Party\" crate. The game keeps on releasing codes by redeeming which players can claim rewards and that too for free. The coupon code … [+1911 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Earth’s Interior Is Cooling “Much Faster Than Expected” - SciTechDaily", "description": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat may dissipate sooner than previously thought. The evolution of…", "url": "https://scitechdaily.com/earths-interior-is-cooling-much-faster-than-expected/", "urlToImage": "https://scitechdaily.com/images/Earth-Core-Animation.gif", "publishedAt": "2022-01-16T01:35:57Z", "content": "Researchers at ETH Zurich have demonstrated in the lab how well a mineral common at the boundary between the Earth’s core and mantle conducts heat. This leads them to suspect that the Earth’s heat ma… [+3896 chars]"}, {"source": {"id": null, "name": "Victoria News"}, "author": "Bailey Moreton", "title": "Space travel can improve everyone's lives, says Canadian astronaut Chris Hadfield – Victoria News - Victoria News", "description": "<p>Improvements in space technology accelerating, having major impact on life on Earth </p>", "url": "https://www.vicnews.com/news/space-travel-can-improve-everyones-lives-says-canadian-astronaut-chris-hadfield/", "urlToImage": "https://www.vicnews.com/wp-content/uploads/2022/01/27808516_web1_25788207-8af8c497f3a548acb6ee68d58168c9db-1024x677.jpg", "publishedAt": "2022-01-15T23:00:00Z", "content": "Space exploration continues to deliver benefits to life on Earth, despite criticism of recent private ventures into the beyond by billionaires, according to Canadian astronaut Cmdr. Chris Hadfield.\r\n… [+3525 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Sixth Mass Extinction of Global Biodiversity Is Already in Progress - SciTechDaily", "description": "The history of life on Earth has been marked five times by events of mass biodiversity extinction caused by extreme natural phenomena. Today, many experts warn that a Sixth Mass Extinction crisis is underway, this time entirely caused by human activities. A c…", "url": "https://scitechdaily.com/sixth-mass-extinction-of-global-biodiversity-is-already-in-progress/", "urlToImage": "https://scitechdaily.com/images/Recently-Extinct-Snails-scaled.jpg", "publishedAt": "2022-01-15T20:40:48Z", "content": "Shells of land snails from Rurutu (Austral Islands, French Polynesia) — recently extinct before they were collected and described scientifically. Credit: O. Gargominy, A. Sartori\r\nThe history of life… [+3710 chars]"}, {"source": {"id": "techradar", "name": "TechRadar"}, "author": "David Nield", "title": "All iPhone 14 models tipped to get 120Hz displays, 6GB of RAM - TechRadar", "description": "Upgrades on the way", "url": "https://www.techradar.com/news/all-iphone-14-models-tipped-to-get-120hz-displays-6gb-of-ram", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7qeBL9rBcucTwFMP4DqTPn-1200-80.jpg", "publishedAt": "2022-01-15T16:30:24Z", "content": "We probably won't see the iPhone 14 handsets appear until September, but we're seeing plenty of leaks and rumors in the meantime. Now we've got news of upgrades potentially coming to all the models i… [+2393 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "A Major Milestone for the James Webb Space Telescope, a “Mini” Monster Black Hole [Video] - SciTechDaily", "description": "A major milestone for the James Webb Space Telescope, what astronomers could learn from a “mini” monster black hole, and the latest assessment of our planet’s global surface temperature … a few of the stories to tell you about – This Week at NASA! https://you…", "url": "https://scitechdaily.com/a-major-milestone-for-the-james-webb-space-telescope-a-mini-monster-black-hole-video/", "urlToImage": "https://scitechdaily.com/images/NASAs-Webb-Space-Telescope.gif", "publishedAt": "2022-01-15T12:37:43Z", "content": "Video transcript:\r\nA major milestone for the James Webb Space Telescope, what astronomers could learn from a mini monster black hole, and the latest assessment of our planet’s global surface temperat… [+2536 chars]"}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "Earth Isn't 'Super' Because the Sun Had Rings - ExtremeTech", "description": "By modeling our solar system with a supercomputer, astrophysicist André Izidoro and his colleagues have shown that the early formation of rings around the sun influenced the size of the resulting planets.", "url": "https://www.extremetech.com/extreme/330589-earth-isnt-super-because-the-sun-had-rings", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2018/08/638831main_globe_east_1344-640x360.jpg", "publishedAt": "2022-01-14T20:25:00Z", "content": "As we explore the cosmos, astronomers have spotted a lot of so-called “super-Earths.” These rocky planets may be several times as massive as Earth, and there’s no analog in our solar system. But why … [+2815 chars]"}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "Ayub", "title": "2022 Lexus NX 350 burnishes brand with great tech - Toys Matrix", "description": "Reputations are a hard thing to build and an even harder thing to shake. When the Lexus NX arrived in 2014, the compact crossover was intended to bring some youthful swagger to a brand favored by a quieter, comfier, stay-off-my-lawn kinda own", "url": "https://toysmatrix.com/2022-lexus-nx-350-burnishes-brand-with-great-tech/", "urlToImage": "https://images.hgmsites.net/hug/2022-lexus-nx_100809032_h.jpg", "publishedAt": "2022-01-14T14:09:06Z", "content": "Reputations are a hard thing to build and an even harder thing to shake. When the Lexus NX arrived in 2014, the compact crossover was intended to bring some youthful swagger to a brand favored by a q… [+6518 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "James Webb Space Telescope: Mirror, Mirror…On Its Way! - SciTechDaily", "description": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the beginning of a several-month phase of aligning the telescop…", "url": "https://scitechdaily.com/james-webb-space-telescope-mirror-mirroron-its-way/", "urlToImage": "https://scitechdaily.com/images/James-Webb-Space-Telescope-Primary-Mirror-in-Space.gif", "publishedAt": "2022-01-14T12:14:03Z", "content": "With major deployments complete, Webb continues its journey to its final halo orbit around L2. In the meantime, there are several smaller deployments in the next couple of weeks, which constitute the… [+3139 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Civil society groups and opposition parties welcome the court’s ruling against Aarto; new research shows Omicron is four times less deadly; Mantashe says an attack on cadre deployment is an attack on democracy; and pressure mounts on Sisulu to withdraw her co…", "url": "https://businesstech.co.za/news/government/550704/5-important-things-happening-in-south-africa-today-1198/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Lindiwe-Sisulu.png", "publishedAt": "2022-01-14T06:16:24Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 5,920 new cases of Covid-19, taking the total reported to 3,546,808. Deaths have reached 9… [+3600 chars]"}]}