{"status": "ok", "totalResults": 442, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Michael Jones", "title": "Newcastle vs Manchester United LIVE: Premier League latest score, goals and updates from fixture tonight - The Independent", "description": "Follow all the action live from St James’ Park in the Red Devils’ first game in over two weeks", "url": "https://www.independent.co.uk/sport/football/newcastle-man-utd-live-stream-premier-league-2021-b1982869.html", "urlToImage": "https://static.independent.co.uk/2021/12/27/20/newFile-1.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-12-27T20:37:16Z", "content": "Newcastle United welcome Manchester United to St James Park this evening as the visitors take to the pitch for the first time in over two weeks.\r\nCovid-related disruptions to the Premier Leagues cale… [+5067 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Marc Tracy, Daniel Victor, Adeel Hassan, Ana Ley", "title": "Covid-19 and Omicron News: Live Updates - The New York Times", "description": "Staffing shortages largely caused by a spike in coronavirus cases have led to thousands of flights being canceled. In some U.S. states, cases are surpassing last winter’s peaks.", "url": "https://www.nytimes.com/live/2021/12/27/world/omicron-covid-vaccine-tests", "urlToImage": "https://static01.nyt.com/images/2021/12/27/world/27virus-briefing-lede-item/27virus-briefing-lede-item-facebookJumbo.jpg", "publishedAt": "2021-12-27T20:26:37Z", "content": "Flight disruptions in the United Statescontinued on Monday as many people embarked on their first trips in almost two years, and Dr. Anthony S. Fauci, the nations top infectious disease expert, again… [+4426 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Team proposes 'nano-chocolates' as a new way to store hydrogen - Phys.org", "description": "An innovative approach could turn nanoparticles into simple reservoirs for storing hydrogen. The highly volatile gas is considered a promising energy carrier for the future, which could provide climate-friendly fuels for airplanes, ships and trucks, for examp…", "url": "https://phys.org/news/2021-12-team-nano-chocolates-hydrogen.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/nano-chocolates-that-s.jpg", "publishedAt": "2021-12-27T20:06:52Z", "content": "An innovative approach could turn nanoparticles into simple reservoirs for storing hydrogen. The highly volatile gas is considered a promising energy carrier for the future, which could provide clima… [+3803 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "How Ancient Human and Animal DNA Is Preserved in Archaeological Sediments for Thousands of Years - SciTechDaily", "description": "Ancient human and animal DNA can remain stably localized in sediments, preserved in microscopic fragments of bone and feces. Sediments in which archaeological finds are embedded have long been regarded by most archaeologists as unimportant by-products of exca…", "url": "https://scitechdaily.com/how-ancient-human-and-animal-dna-is-preserved-in-archaeological-sediments-for-thousands-of-years/", "urlToImage": "https://scitechdaily.com/images/Sediment-Block-for-Ancient-DNA-Analysis-scaled.jpg", "publishedAt": "2021-12-27T20:00:17Z", "content": "ByMax Planck Institute for Evolutionary AnthropologyDecember 27, 2021\r\nSampling of an undisturbed block of impregnated sediment for ancient DNA analyses. Credit: MPI f. Evolutionary Anthropology\r\nAnc… [+5252 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "How DNA is preserved in archaeological sediments for thousands of years - Phys.org", "description": "Sediments in which archaeological finds are embedded have long been regarded by most archaeologists as unimportant by-products of excavations. However, in recent years it has been shown that sediments can contain ancient biomolecules, including DNA. \"The retr…", "url": "https://phys.org/news/2021-12-dna-archaeological-sediments-thousands-years.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/how-dna-is-preserved-i.jpg", "publishedAt": "2021-12-27T20:00:02Z", "content": "Sediments in which archaeological finds are embedded have long been regarded by most archaeologists as unimportant by-products of excavations. However, in recent years it has been shown that sediment… [+4778 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Contorted oceanic plate caused complex quake off New Zealand's East Cape - Phys.org", "description": "Subduction zones, where a slab of oceanic plate is pushed beneath another tectonic plate down into the mantle, cause the world's largest and most destructive earthquakes. Reconstructing the geometry and stress conditions of the subducted slabs at subduction z…", "url": "https://phys.org/news/2021-12-contorted-oceanic-plate-complex-quake.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2017/tectonicplat.jpg", "publishedAt": "2021-12-27T19:52:42Z", "content": "Subduction zones, where a slab of oceanic plate is pushed beneath another tectonic plate down into the mantle, cause the world's largest and most destructive earthquakes. Reconstructing the geometry … [+3265 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Miriam Berger", "title": "UN calls for investigation after report of more than 30 massacred by Myanmar military - The Washington Post", "description": "The U.S. Embassy in Myanmar called the killings a “barbaric attack.”", "url": "https://www.washingtonpost.com/world/2021/12/27/myanmar-massacre-save-the-children/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CRTMQWTFPUI6ZG2ROEY7UGIMLY.jpg&w=1440", "publishedAt": "2021-12-27T19:52:30Z", "content": "I condemn this grievous incident and all attacks against civilians throughout the country, which are prohibited under international humanitarian law, U.N. humanitarian affairs chief Martin Griffiths … [+3075 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Corey Callaghan", "title": "Manitoba’s premier, top doctor to hold COVID-19 update - Globalnews.ca", "description": "Manitoba's Premier and Chief Provincial Public Health Officer tightened up the gathering limits during a Monday COVID-19 update as COVID-19 cases spike.", "url": "https://globalnews.ca/news/8475437/manitobas-premier-top-doctor-to-hold-covid-19-update/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2020/04/jgw10956029-1.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-12-27T19:47:31Z", "content": "Gathering limits are being tightened in Manitoba as COVID-19 cases continue to spike.\r\nManitoba Premier Heather Stefanson and Chief Provincial Public Health Officer Dr. Brent Roussin held a press con… [+2207 chars]"}, {"source": {"id": null, "name": "Liverpool Echo"}, "author": "Tom Duffy", "title": "'Vile bullying' gangster who terrorised town and relief now he is behind bars - Liverpool Echo", "description": "Leon Cullen became embroied in an underworld dispute which led to a spate of violence across the region", "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/vile-bullying-gangster-who-terrorised-22581738", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article21610958.ece/ALTERNATES/s1200/0_Cullen_02.jpg", "publishedAt": "2021-12-27T19:43:59Z", "content": "Residents are 'relieved' that a notorious gang boss is no longer a presence in their town.\r\nLeon Cullen was jailed for 22 and half years earlier this year after he admitted running a Warrington based… [+8015 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": "Kevin Seifert", "title": "Matt Nagy under assumption he'll coach Chicago Bears' final two games this season - ESPN", "description": "Matt Nagy said Monday he's under the assumption he'll be the Bears' head coach for the team's final two games this season.", "url": "https://www.espn.com/nfl/story/_/id/32946986/matt-nagy-assumption-coach-chicago-bears-final-two-games-season", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F1208%2Fr948153_1296x729_16%2D9.jpg", "publishedAt": "2021-12-27T19:41:25Z", "content": "Amid swirling rumors about his job security, Chicago Bears coach Matt Nagy said Monday he is operating under the assumption that he will coach the team's final two games of the regular season.\r\nThe B… [+1608 chars]"}, {"source": {"id": null, "name": "WABC-TV"}, "author": "Eyewitness News", "title": "COVID Omicron Updates: 1 in 60 people in Manhattan tested positive for COVID-19 last week - WABC-TV", "description": "In Manhattan, one in 60 people tested positive for COVID-19 last week.", "url": "https://abc7ny.com/covid-headlines-updates-latest-news-coronavirus/11392649/", "urlToImage": "https://cdn.abcotvs.com/dip/images/11392717_122721-wabc-nyc-covid-img.jpg?w=1600", "publishedAt": "2021-12-27T19:41:15Z", "content": "NEW YORK (WABC) -- The omicron variant has led to an unprecedented spread of COVID-19 in New York City's central borough.Last week, one in 60 people tested positive for COVID-19 in Manhattan.\r\nEyewit… [+9091 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Yaron Steinbuch", "title": "COVID virus can spread to heart, brain days after infection, study says - New York Post ", "description": "Scientists at the US National Institutes of Health studied tissues taken from 44 people who had died after contracting the illness during the first year of the pandemic.", "url": "https://nypost.com/2021/12/27/covid-virus-can-spread-to-heart-brain-and-survive-for-months/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/12/corona-virus-organs-comp.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-12-27T19:38:00Z", "content": "The virus that causes COVID-19 can spread to a patients heart and brain days after infection — and survive for months in organs, according to a new study that may shed light on the so-called long COV… [+3767 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Premium Times", "title": "Lai Mohammed denies having COVID-19, as presidency speaks on outbreak at Aso Villa - Premium Times", "description": "Many presidential aides have tested positive for COVID-19 but the presidency has declined to provide details..................", "url": "https://www.premiumtimesng.com/news/top-news/502824-lai-mohammed-denies-having-covid-19-as-presidency-speaks-on-outbreak-at-aso-villa.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2020/06/IMG_20200603_130511_577-e1597315662502.jpg", "publishedAt": "2021-12-27T19:35:51Z", "content": "The Minister of Information and Culture, Lai Mohammed, on Sunday denied being infected with COVID-19.\r\nThe minister spoke via a statement by his spokesperson in reaction to reports Saturday that he w… [+8660 chars]"}, {"source": {"id": null, "name": "Millenniumpost.in"}, "author": "Satvika Mahajan", "title": "Civic bodies report 6 more dengue deaths - Millennium Post", "description": "New Delhi: As Dengue cases witness a dip in the Delhi-NCR region, municipal authorities on Monday...", "url": "http://www.millenniumpost.in/delhi/civic-bodies-report-6-more-dengue-deaths-463196", "urlToImage": "http://www.millenniumpost.in/images/logo.png", "publishedAt": "2021-12-27T19:29:35Z", "content": "New Delhi: As Dengue cases witness a dip in the Delhi-NCR region, municipal authorities on Monday reported six more deaths from the vector-borne disease in the last few months, bringing the total num… [+1911 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": null, "title": "MSI Katana GF66 - Review 2021 - PCMag AU", "description": "A gaming laptop with more pep than you pay for", "url": "https://au.pcmag.com/laptops/91633/msi-katana-gf66", "urlToImage": "https://sm.pcmag.com/t/pcmag_au/review/m/msi-katana/msi-katana-gf66_vcj6.1200.jpg", "publishedAt": "2021-12-27T19:29:33Z", "content": "Count on a gaming laptop named after a legendary blade to define the cutting edge in budget gear. The MSI Katana GF66 (starts at $799; $1,199 for the in-store Micro Center model tested here) is an im… [+9966 chars]"}, {"source": {"id": null, "name": "App Trigger"}, "author": "Matthew Liebl", "title": "Fall Guys: Ultimate Knockout will hopefully arrive on Nintendo Switch in 2022 - App Trigger", "description": "Fall Guys: Ultimate Knockout was one of 2020's biggest surprise hits, but it was limited to only PC and PlayStation consoles. Earlier this year, it was ann...", "url": "https://apptrigger.com/2021/12/27/fall-guys-nintendo-switch-2022/", "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fapptrigger.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2017%2F07%2F1138056560.jpeg", "publishedAt": "2021-12-27T19:22:00Z", "content": "Fall Guys: Ultimate Knockout was one of 2020’s biggest surprise hits, but it was limited to only PC and PlayStation consoles. Earlier this year, it was announced that the obstacle-based multiplayer b… [+2254 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jamie Grierson", "title": "Boris Johnson a drag on Tories and Sunak would do better, poll shows - The Guardian", "description": "Exclusive: Party would be 60 seats worse off under current PM than chancellor, Opinium survey finds", "url": "https://amp.theguardian.com/politics/2021/dec/27/boris-johnson-a-drag-on-tories-and-sunak-would-do-better-poll-shows", "urlToImage": null, "publishedAt": "2021-12-27T19:20:00Z", "content": "ConservativesExclusive: Party would be 60 seats worse off under current PM than chancellor, Opinium survey finds\r\nBoris Johnson is a significant drag on Tory fortunes, according to a poll that tested… [+4650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr and Devan Cole, CNN", "title": "Richard Marcinko, the first head of the elite SEAL Team Six, has died - CNN", "description": "Richard Marcinko, a legendary military figure known for leading SEAL Team Six when the covert special operations unit was in its infancy, died Saturday, according to his son and the National Navy SEAL Museum. He was 81.", "url": "https://www.cnn.com/2021/12/27/politics/richard-marcinko-dead-seal-team-six/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211227124630-file-richard-marcinko-2006-super-tease.jpg", "publishedAt": "2021-12-27T19:20:00Z", "content": "(CNN)Richard Marcinko, a legendary military figure known for leading SEAL Team Six when the covert special operations unit was in its infancy, died Saturday, according to his son and the National Nav… [+1779 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "DentalSlim Diet Control: Researchers Develop World-First Weight Loss Device - SciTechDaily", "description": "University of Otago and UK researchers have developed a world-first weight-loss device to help fight the global obesity epidemic. DentalSlim Diet Control is an intra-oral device fitted by a dental professional to the upper and lower back teeth. It uses magnet…", "url": "https://scitechdaily.com/dentalslim-diet-control-researchers-develop-world-first-weight-loss-device/", "urlToImage": "https://scitechdaily.com/images/DentalSlim-Diet-Control-Device-scaled.jpg", "publishedAt": "2021-12-27T19:14:39Z", "content": "DentalSlim Diet Control is an intra-oral device fitted by a dental professional to the upper and lower back teeth. It is a world-first weight-loss device to help fight the global obesity epidemic. Cr… [+4675 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "'We have more work to do,' Biden says as Omicron surge looms - Reuters", "description": "U.S. President Joe Biden on Monday pledged to ease a shortage of COVID-19 tests as the Omicron variant threatened to overwhelm hospitals and stifle travel plans as it spread across U.S. states this holiday week.", "url": "https://www.reuters.com/world/us/biden-governors-meet-states-brace-holiday-omicron-spike-2021-12-27/", "urlToImage": "https://www.reuters.com/resizer/cONltv6WipQ7vUA823ug4d2Gnzw=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/RXML2PNWIJLE7LKKBNZ4UXD6PE.jpg", "publishedAt": "2021-12-27T19:13:00Z", "content": "WASHINGTON, Dec 27 (Reuters) - U.S. President Joe Biden on Monday pledged to ease a shortage of COVID-19 tests as the Omicron variant threatened to overwhelm hospitals and stifle travel plans as it s… [+3944 chars]"}]}