{"status": "ok", "totalResults": 446, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, Jeremy Diamond, Kevin Liptak, Phil Mattingly and Kate Sullivan, CNN", "title": "Biden announces ban on Russian energy imports - CNN", "description": "President Joe Biden on Tuesday announced his administration is banning Russian oil, natural gas and coal imports to the US in response to the Russian invasion of Ukraine.", "url": "https://www.cnn.com/2022/03/08/politics/russian-energy-import-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308113248-biden-russian-oil-030822-super-tease.jpg", "publishedAt": "2022-03-08T16:39:00Z", "content": null}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "PHL moves to cushion oil shock impact - BusinessWorld Online - BusinessWorld Online", "description": "ECONOMIC MANAGERS approved the implementation of several measures to cushion the impact of the Russia-Ukraine crisis on the Philippine economy, such as temporarily allowing more imports of rice, pork and fish, increasing coal supply, and raising fuel subsidie…", "url": "https://www.bworldonline.com/phl-moves-to-cushion-oil-shock-impact/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/03/Bottled-Petroluem-products.jpg", "publishedAt": "2022-03-08T16:34:22Z", "content": "Several bottles are filled with petroleum products in San Jose, Rodriguez, Rizal, March 4. Fuel retailers raised pump prices on Tuesday. PHILIPPINE STAR/ MICHAEL VARCAS\r\nECONOMIC MANAGERS approved th… [+3607 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Yaroslav Trofimov, Brett Forrest", "title": "Ukraine Evacuates Civilians From Besieged Sumy, but Millions Remain Trapped by Fighting With Russia - The Wall Street Journal", "description": "Mariupol faces humanitarian crisis as Russian attacks kill civilians throughout Ukraine", "url": "https://www.wsj.com/articles/ukraine-russia-set-cease-fire-to-evacuate-besieged-city-as-war-toll-grows-11646735890", "urlToImage": "https://images.wsj.net/im-500228/social", "publishedAt": "2022-03-08T16:32:00Z", "content": "Ukraine evacuated convoys of civilians from the besieged northeastern city of Sumy on Tuesday, as renewed Russian shelling forced an interruption in evacuations and millions of people remained trappe… [+471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple Event Live Updates: Event starts at 11.30 pm, how to watch livestream - The Indian Express", "description": "Apple Event live Streaming: Apple is hosting its Spring event later tonight where the iPhone SE 3, iPad Air and other devices are expected.", "url": "https://indianexpress.com/article/technology/mobile-tabs/apple-spring-event-iphone-se-3-ipad-air-live-updates-7806736/", "urlToImage": "https://images.indianexpress.com/2022/03/Apple_iPhoneSE1.jpg", "publishedAt": "2022-03-08T16:31:29Z", "content": "Apples hosting its big event today where new devices are expected. The focus will be on the iPhone SE 3 or the iPhone SE 2022, which is expected to come with 5G connectivity. Apple has already added … [+901 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Emily Morrow", "title": "Apex Legends Mobile gets limited release in 10 countries - Digital Trends", "description": "The highly-anticipated mobile port of the popular battle royale is being beta tested in several regions across the globe.", "url": "https://www.digitaltrends.com/gaming/apex-legends-mobile-beta/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/apex-legends-bloodhound-2.jpg", "publishedAt": "2022-03-08T16:24:25Z", "content": "After months of rumors and development updates, Apex Legends Mobile is finally getting a limited release ahead of its worldwide launch. In a blog post shared yesterday, Respawn revealed that players … [+1743 chars]"}, {"source": {"id": null, "name": "Evening Standard"}, "author": "Marc Mayo", "title": "Liverpool XI vs Inter Milan: Confirmed team news, predicted lineup, injury latest for Champions League today - Evening Standard", "description": "Liverpool could be tempted to rest a couple of their key stars against Inter Milan in the Champions League last-16 later today.", "url": "https://www.standard.co.uk/sport/football/liverpool-xi-vs-inter-milan-confirmed-team-news-predicted-lineup-injury-latest-champions-league-2022-today-b986408.html", "urlToImage": "https://static.standard.co.uk/2021/08/16/11/LiverpoolPredictedXISalahv1.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2022-03-08T16:23:33Z", "content": "A 2-0 first-leg lead is being brought back to Anfield by the Reds, who are on a winning streak of 12 matches following Saturdays narrow victory over West Ham.\r\nThiago Alcantara and Roberto Firmino bo… [+1431 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Massive bubbles at center of Milky Way caused by supermassive black hole - Phys.org", "description": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy.", "url": "https://phys.org/news/2022-03-massive-center-milky-supermassive-black.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/massive-bubbles-at-cen.jpg", "publishedAt": "2022-03-08T16:20:01Z", "content": "In 2020, the X-ray telescope eRosita took images of two enormous bubbles extending far above and below the center of our galaxy.\r\nSince then, astronomers have debated their origin. Now, a study inclu… [+6559 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Steve Karnowski", "title": "Minneapolis teachers go on strike after contract talks fail - The Associated Press - en Español", "description": "MINNEAPOLIS (AP) — Teachers in the Minneapolis School District walked off the job on Tuesday in a dispute over wages, class sizes and mental health support for students coping with two years of the coronavirus pandemic, at least temporarily pausing classes fo…", "url": "https://apnews.com/article/covid-health-business-minneapolis-mental-health-c4e1c35fc92188e3f849eb5847d68d3b", "urlToImage": "https://storage.googleapis.com/afs-prod/media/e06467a82e424d859eb509c1064fcc69/3000.jpeg", "publishedAt": "2022-03-08T16:18:45Z", "content": "MINNEAPOLIS (AP) Teachers in the Minneapolis School District walked off the job on Tuesday in a dispute over wages, class sizes and mental health support for students coping with two years of the cor… [+5133 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Michael Muchmore", "title": "How to Connect Your Android Phone to Your Windows 11 PC - PCMag", "description": "Connecting the two lets you send answer text messages, see notifications, and instantly grab photos from your Android on your Windows 11 PC. We walk you through the simple process of getting started.", "url": "https://www.pcmag.com/how-to/how-to-connect-your-android-phone-to-your-windows-11-pc", "urlToImage": "https://i.pcmag.com/imagery/articles/02GFgxtttXVK4bs7dnqFXAR-7.fit_lim.size_1200x630.v1646673812.jpg", "publishedAt": "2022-03-08T16:16:32Z", "content": "You take a picture on your phone, and now you want to see it on a bigger screen. You get a text message, but you don't want to dig out your phone to reply to it while you're working on your PC. Windo… [+5945 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Rachel Laurence", "title": "Fewer new cancer research projects were funded during the COVID-19 pandemic - Medical Xpress", "description": "New figures from the National Cancer Research Institute (NCRI) show that fewer new cancer research projects were funded in 2020/21. This is the first time NCRI's cancer research funding database has shown a drop in funding caused by the COVID-19 pandemic.", "url": "https://medicalxpress.com/news/2022-03-cancer-funded-covid-pandemic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/pandemic-1.jpg", "publishedAt": "2022-03-08T16:03:26Z", "content": "New figures from the National Cancer Research Institute (NCRI) show that fewer new cancer research projects were funded in 2020/21. This is the first time NCRI's cancer research funding database has … [+4307 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Simon Carswell, Martin Wall, Jack Horgan-Jones, Cormac McQuinn", "title": "Russia summons Irish ambassador in Moscow over truck incident at Dublin embassy - The Irish Times", "description": "Varadkar criticises ‘foolish and unhelpful’ ramming of Russian Embassy gates", "url": "https://www.irishtimes.com/news/politics/russia-summons-irish-ambassador-in-moscow-over-truck-incident-at-dublin-embassy-1.4821416", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4821414&origw=1440", "publishedAt": "2022-03-08T16:01:51Z", "content": "Russia has summoned Irelands ambassador in Moscow over the ramming of a truck into the gates of its embassy in Dublin, seeking an official apology and the cost of repairs.\r\nIrish diplomat Brian McEld… [+3768 chars]"}, {"source": {"id": null, "name": "NBC10 Boston"}, "author": "Susan Tran", "title": "Boston Hospitals Seek Participants in Long COVID Study - NBC10 Boston", "description": "Six Boston-area hospital are joining a national effort to study long COVID, a condition in which patients suffer from symptoms for weeks, months, and even years…", "url": "https://www.nbcboston.com/news/local/boston-hospitals-seek-participants-in-long-covid-study/2663425/", "urlToImage": "https://media.nbcboston.com/2022/03/GettyImages-1210464732.jpg?quality=85&strip=all&resize=1200%2C675", "publishedAt": "2022-03-08T16:01:19Z", "content": "Six Boston-area hospital are joining a national effort to study long COVID, a condition in which patients suffer from symptoms for weeks, months, and even years after initial infection.\r\nA recent stu… [+1230 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Study: Body organs, systems age differently, based on lifestyle, genetic factors - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-03-08T16:00:27Z", "content": ""}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Tom Fletcher", "title": "Meet the ten-armed, 325-million-year-old octopus fossil named after President Joe Biden - The Conversation Indonesia", "description": "The fossil is the oldest known vampyropod to date.", "url": "https://theconversation.com/meet-the-ten-armed-325-million-year-old-octopus-fossil-named-after-president-joe-biden-178566", "urlToImage": "https://images.theconversation.com/files/450476/original/file-20220307-27-rnkcwc.jpeg?ixlib=rb-1.1.0&rect=0%2C167%2C1800%2C900&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-03-08T16:00:06Z", "content": "In an ancient shallow bay of what is now Montana, the body of an octopus-like creature the size of a fist was buried on the seafloor. Some 325-328 million years later, a new paper published in Nature… [+4728 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New species of extinct vampire-squid–like cephalopod is the first of its kind with ten functional arms - Phys.org", "description": "New research led by scientists at the American Museum of Natural History and Yale shows that the oldest ancestors of the group of animals that includes octopuses and vampire squids had not 8 but 10 arms. The study, which describes a new species of vampyropod …", "url": "https://phys.org/news/2022-03-species-extinct-vampire-squidlike-cephalopod-kind.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-species-of-extinct.jpg", "publishedAt": "2022-03-08T16:00:05Z", "content": "New research led by scientists at the American Museum of Natural History and Yale shows that the oldest ancestors of the group of animals that includes octopuses and vampire squids had not 8 but 10 a… [+3979 chars]"}, {"source": {"id": null, "name": "Tom's Guide"}, "author": "Philip Michaels, Marc McLaren, Mark Spoonauer", "title": "Apple March event live blog — iPhone SE 3, Mac Studio, iPad Air 5 and more - Tom's Guide", "description": "Our Apple event live blog is here to bring you all the new Apple product news, including a possible iPhone SE 3, iPad Air 5, and new Macs with M2 chips.", "url": "https://www.tomsguide.com/news/live/apple-event-march-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/fV5YexNpm5YFDSEAnZrMgV-1200-80.jpg", "publishedAt": "2022-03-08T15:59:02Z", "content": "2022-03-08T16:50:49.450Z\r\n(Image credit: Future)\r\nIt's just about an hour until showtime for the Apple Event, which means you should juice up your AirPods to watch Peek Performance with spatial audio… [+17463 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Animals evolved the ability to gallop 472 million years ago - Phys.org", "description": "Few human adults gallop; the equine gait tends to be the preserve of little kids mimicking horses or exercise classes. But for camels, lions and giraffes, galloping is a key fixture of their repertoire as they shift up through the gears. However, Eric McElroy…", "url": "https://phys.org/news/2022-03-animals-evolved-ability-gallop-million.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/animals-evolved-the-ab.jpg", "publishedAt": "2022-03-08T15:57:32Z", "content": "Stochastic character mapping for the best fit evolutionary model (ARD) showing the probability of having an asymmetrical gait. Branch color is the probability of having an asymmetrical gait (red) or … [+4600 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "Umahi, Kelechi-Igwe: How Ebonyi residents reacted to sack of Governor, Deputy - Daily Post Nigeria", "description": "Mixed reactions have trailed the removal of Gov. Dave Umahi of Ebonyi and his Deputy, Dr Eric Kelechi-Igwe from office by a Federal High Court in Abuja. While some residents saw it as a welcome development, others expressed disappointment with the judgement. …", "url": "https://dailypost.ng/2022/03/08/umahi-kelechi-igwe-how-ebonyi-residents-reacted-to-sack-of-governor-deputy/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/06/umahi-1280x720-1.jpg", "publishedAt": "2022-03-08T15:54:26Z", "content": "Mixed reactions have trailed the removal of Gov. Dave Umahi of Ebonyi and his Deputy, Dr Eric Kelechi-Igwe from office by a Federal High Court in Abuja.\r\nWhile some residents saw it as a welcome deve… [+2797 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Using Plankton Shells to Gauge the Accuracy of Climate Models - AZoCleantech", "description": "Earth scientists have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s history. The results from this study help bridge the gap between empirical observations and existing cli…", "url": "https://www.azocleantech.com/news.aspx?newsID=31292", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31292_16467543670315250.jpg", "publishedAt": "2022-03-08T15:50:57Z", "content": "Earth scientists in the United States and the United Kingdom have compiled a comprehensive record of latitudinal sea-surface temperature (SST) gradients over the last 95 million years of the Earth’s … [+5395 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Srishti Choudhary", "title": "Even Mild Covid May Cause Brain Damage, Finds New Oxford Study - News18", "description": "A team of scientists has identified some distinct changes in the human brain, especially in the region associated with smell and memory, in people who recovered from Covid in the last two years.", "url": "https://www.news18.com/news/world/even-mild-covid-may-cause-brain-damage-finds-new-oxford-study-4851965.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/covid-shutterstock-representative_1622644309-164403774216x9.jpg", "publishedAt": "2022-03-08T15:42:24Z", "content": "With people already facing an uphill battle recovering from the after-effects of Covid, now a new study has shed light on its potentially deleterious impact on the brain.\r\nA team of scientists from t… [+3172 chars]"}]}