{"status": "ok", "totalResults": 472, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Japan PM Kishida boosted by surprisingly comfortable election win - Reuters", "description": "Japanese Prime Minister Fumio Kishida said on Monday he would make full use of his surprisingly strong election win as he tackles major policy decisions, including trying to pass an extra budget to accelerate the recovery from the pandemic.", "url": "https://www.reuters.com/world/asia-pacific/japan-pm-kishida-surprises-with-comfortable-election-win-2021-11-01/", "urlToImage": "https://www.reuters.com/resizer/7TcRaLHAeoLYxVy04NqKem00gGI=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/CDPTMJO4N5JZZF2LVC7EBAWZIY.jpg", "publishedAt": "2021-11-01T06:33:00Z", "content": "TOKYO, Nov 1 (Reuters) - Japanese Prime Minister Fumio Kishida said on Monday he would make full use of his surprisingly strong election win as he tackles major policy decisions, including trying to … [+3818 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": "Christopher Lloyd Caliwan", "title": "Eleazar wants more cops in streets to curb holiday crimes - pna.gov.ph", "description": "MANILA – The Philippine National Police (PNP) on Monday directed all units to enhance visibility and patrol activities to prevent a spike in street crimes during the holiday season.“I am directing all police units nationwide to sustain enhanced visibility and…", "url": "https://www.pna.gov.ph/articles/1158383", "urlToImage": "https://files01.pna.gov.ph/ograph/2021/11/01/2-riders-snatchers-nabbed-in-manilapnp-photo.jpg", "publishedAt": "2021-11-01T06:32:00Z", "content": "(File photo courtesy of PNP)\r\nMANILA – The Philippine National Police (PNP) on Monday directed all units to enhance visibility and patrol activities to prevent a spike in street crimes during the hol… [+973 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Ajibola Akamo", "title": "NGX stocks reverse losing streak, post YTD gains first time since January - Nairametrics", "description": "The Nigerian equity market ended its Year-to-Date losing streak to what turned out to be a bullish October. The All-Share", "url": "https://nairametrics.com/2021/11/01/350236/", "urlToImage": "https://i1.wp.com/nairametrics.com/wp-content/uploads/2021/08/Stock-Exchange-Stockbrokers.jpg?fit=900%2C505&ssl=1", "publishedAt": "2021-11-01T06:29:52Z", "content": "The Nigerian equity market ended its Year-to-Date losing streak to what turned out to be a bullish October. The All-Share Index (ASI) gained 4.52% for the month starting at 40,221.17 basis points and… [+5088 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Expose \"After Diwali\": Devendra Fadnavis Hits Back At NCP's Nawab Malik - NDTV", "description": "\"Those who have relations with the Underworld should not speak about me. I will present evidence of Nawab Malik's relations with the Underworld. I am just waiting for Diwali to pass,\" Devendra Fadnavis said in a press conference today.", "url": "https://www.ndtv.com/india-news/devendra-fadnavis-vs-nawab-malik-will-expose-his-relations-with-underworld-says-former-chief-minister-2595406", "urlToImage": "https://c.ndtvimg.com/2021-11/nl6andko_devendra-fadnavis_625x300_01_November_21.jpg", "publishedAt": "2021-11-01T06:26:00Z", "content": "Devendra Fadnavis rubbished allegations by Nawab Malik in a press conference today.\r\nMumbai: Senior Nationalist Congress Party (NCP) leader Nawab Malik has relations with the Underworld, former Mahar… [+2062 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Light rail, Basin Reserve traffic revamp mooted in capital transport overhaul - Stuff.co.nz", "description": "The end of one of New Zealand's most well-known roundabouts is a prominent feature of proposed plans to reshape Wellington's transport network.", "url": "https://www.stuff.co.nz/dominion-post/news/wellington/126846880/light-rail-basin-reserve-traffic-revamp-mooted-in-capital-transport-overhaul", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/v/j/l/m/image.related.StuffLandscapeSixteenByNine.1420x800.23irog.png/1635749205331.jpg", "publishedAt": "2021-11-01T06:23:00Z", "content": "Light rail to Island Bay has been revealed as the centrepiece of Lets Get Wellington Movings plans to reshape the capitals transport network.\r\n The four options to be considered for public consultati… [+5354 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Centre Has Time Until November 26, Else...\": Farmer Leader's Warning - NDTV", "description": "Farmer leader Rakesh Tikait today warned the government that there would be an escalation of protest at the Delhi border if the government does not revoke the controversial farm laws by November 26.", "url": "https://www.ndtv.com/india-news/farmer-leader-rakesh-tikait-sets-november-26-deadline-for-government-warns-of-escalation-of-protest-at-delhi-borders-2595378", "urlToImage": "https://c.ndtvimg.com/2021-11/lbtb7gv8_rakesh-tikait-pti_650x400_01_November_21.jpg", "publishedAt": "2021-11-01T06:11:15Z", "content": "Rakesh Tikait's warning came as the as the farmer agitation the agrarian laws near one year.\r\nHighlights\r\n<ul><li>Rakesh Tikait's warning came as agitation against farm laws near one year\r\n</li><li>T… [+1946 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Isolated China Is Cracking Under the Strain of Keeping Covid Out - NDTV", "description": "China has been able to beat back successive waves of Covid-19 thanks to the widespread deployment of snap lockdowns, strict quarantines and some of the world's tightest travel controls. Yet, the strain is showing at its borders.", "url": "https://www.ndtv.com/world-news/coronavirus-the-unhappiness-of-a-chinese-border-village-fighting-to-keep-covid-out-2595343", "urlToImage": "https://c.ndtvimg.com/2021-11/bse94qpo_china-coronavirus-bloomberg_625x300_01_November_21.jpg", "publishedAt": "2021-11-01T06:10:00Z", "content": "China is currently battling its fourth flareup driven by the variant in the past five months.\r\nChina has been able to beat back successive waves of Covid-19 thanks to the widespread deployment of sna… [+5089 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Mark Landler", "title": "Once a Leading Polluter, the U.K. Is Now Trying to Lead on Climate Change - The New York Times", "description": "On the eve of a global climate summit, Britain’s evolution from fossil fuels to clean energy is on display. But experts question whether its commitment is sufficient, and whether it can persuade other nations to meet meaningful goals.", "url": "https://www.nytimes.com/2021/11/01/world/europe/britain-climate-change.html", "urlToImage": "https://static01.nyt.com/images/2021/10/31/world/31uk-climate1/merlin_197026017_8cfdb7ea-0e3c-42d3-8ade-95bd3c058a76-facebookJumbo.jpg", "publishedAt": "2021-11-01T06:09:35Z", "content": "The country that was synonymous with the belching factories of the Industrial Revolution, that once darkened its skies and fouled its rivers, that gave the world the phrase coals to Newcastle, now pr… [+1580 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Non-thermal atmospheric pressure plasma heals bone fractures in animal bone defect models - News-Medical.Net", "description": "Recent technological innovations which have allowed plasma to be generated at room temperature and at ambient atmosphere in what is called non-thermal atmospheric pressure plasma (NTAPP) have given scientists from Japan the opportunity to apply the therapeuti…", "url": "https://www.news-medical.net/news/20211101/Non-thermal-atmospheric-pressure-plasma-heals-bone-fractures-in-animal-bone-defect-models.aspx", "urlToImage": "https://www.news-medical.net/image-handler/picture/2018/7/Osteoporosis_stage_3_of_4_-_upper_limb_bones_-_3d_rendering_-_Crevis_M1_62ee9a3e223b497ca6798e45d894de93-620x480.jpg", "publishedAt": "2021-11-01T06:09:00Z", "content": "Recent technological innovations which have allowed plasma to be generated at room temperature and at ambient atmosphere in what is called non-thermal atmospheric pressure plasma (NTAPP) have given s… [+3655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Gadgets 360 Newsdesk", "title": "Elon Musk Praises Starlink India Director Sanjay Bhargava, Says He Deserves Credit For PayPal's Success - Gadgets 360", "description": "Elon Musk has praised Starlink India Director Sanjay Bhargava for his ambitious project to provide high-speed Internet to rural areas, saying he has “much respect” for Bhargava. Musk said Bhargava deserves a lot of credit for PayPal's success and that he is n…", "url": "https://gadgets.ndtv.com/internet/news/spacex-starlink-india-elon-musk-sanjay-bhargava-respect-tweet-country-director-2595379", "urlToImage": "https://i.gadgets360cdn.com/large/Starlink_India_underway_1630480699554.jpg", "publishedAt": "2021-11-01T06:08:56Z", "content": "Elon Musk has praised Starlink India Director Sanjay Bhargava for his ambitious project to provide high-speed Internet to rural areas, saying he has much respect for Bhargava. Musk said Bhargava dese… [+2339 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Residents evacuated amid health warning after fire rages at water treatment plant - Stuff.co.nz", "description": "Almost 50 firefighters tackled the blaze, which destroyed the roofs of two buildings, sent a huge plume of acrid smoke across the city.", "url": "https://www.stuff.co.nz/national/300403791/residents-evacuated-amid-health-warning-after-fire-rages-at-water-treatment-plant", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/v/j/m/m/image.related.StuffLandscapeSixteenByNine.1420x800.4yup1r.png/1635747275925.jpg", "publishedAt": "2021-11-01T06:05:00Z", "content": "Residents were evacuated and health officials issued a public health warning after a large fire erupted at a wastewater treatment plant in east Christchurch.\r\n The blaze broke out at the Christchurch… [+7940 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Emine Saner", "title": "Caroline Lucas on climate, consumerism and Cop26: ‘Boris Johnson is an absolute disaster’ - The Guardian", "description": "The UK’s only Green MP has spent a lifetime battling the climate emergency. She discusses carbon emissions, personal responsibility, political action – and how to veer off our collision course with catastrophe", "url": "https://amp.theguardian.com/environment/2021/nov/01/caroline-lucas-on-climate-consumerism-and-cop26-boris-johnson-is-an-absolute-disaster", "urlToImage": null, "publishedAt": "2021-11-01T06:00:00Z", "content": "Cop26The UKs only Green MP has spent a lifetime battling the climate emergency. She discusses carbon emissions, personal responsibility, political action and how to veer off our collision course with… [+13536 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Larry Elliott", "title": "The road to net zero: Aberdeen looks to a future without oil - The Guardian", "description": "Can the Granite city diversify into non-fossil fuel industries in time to avoid the fate of UK coal-mining areas?", "url": "https://amp.theguardian.com/business/2021/nov/01/the-road-to-net-zero-aberdeen-looks-to-a-future-without-oil", "urlToImage": null, "publishedAt": "2021-11-01T06:00:00Z", "content": "EconomicsCan the Granite city diversify into non-fossil fuel industries in time to avoid the fate of UK coal-mining areas?\r\nThe oil companies know it. The car dealers selling top of the range Porsche… [+6955 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Oliver Wainwright", "title": "‘This is the age of waste’: the show about our throwaway addiction and how to cure it - The Guardian", "description": "It is now 100 times more lucrative to mine gold from e-dumps than from the ground. Yet 70 years ago, we barely threw anything away at all. Can design change our disposable culture?", "url": "https://amp.theguardian.com/artanddesign/2021/nov/01/waste-age-exhibition-design-museum", "urlToImage": null, "publishedAt": "2021-11-01T06:00:00Z", "content": "DesignIt is now 100 times more lucrative to mine gold from e-dumps than from the ground. Yet 70 years ago, we barely threw anything away at all. Can design change our disposable culture?\r\nHow will th… [+7659 chars]"}, {"source": {"id": null, "name": "Fox Sports"}, "author": "Jacob Polychronis", "title": "Daunting equation for great Aus WC escape - and how Poms could blow it up in one move - Fox Sports", "description": "Daunting equation for great Aus WC escape - and how Poms could blow it up in one move", "url": "https://www.foxsports.com.au/cricket/t20-world-cup-2021/t20-world-cup-2021-cricket-australia-icc-table-india-fixtures-super-12-who-will-play-semi-finals-schedule/news-story/c38d8a81099a5d6d78908070815326ea", "urlToImage": "https://content.api.news/v3/images/bin/4a41306d4de50b9796c1e4dc36350640", "publishedAt": "2021-11-01T05:59:00Z", "content": "Just one more loss will likely end Australias hopes of a maiden mens T20 World Cup title with the tournament effectively turning into a knockout competition for Justin Langers side.\r\nThe group of dea… [+5070 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Reuters", "title": "Indonesian researchers breed 'good' mosquitoes to combat dengue - Hindustan Times", "description": "The trial results, published by the New England Journal of Medicine in June, showed that deploying mosquitoes with Wolbachia reduced dengue cases by as much as 77% and hospitalisations by up to 86%.", "url": "https://www.hindustantimes.com/science/indonesian-researchers-breed-good-mosquitoes-to-combat-dengue-101635745300667.html", "urlToImage": "https://images.hindustantimes.com/img/2021/11/01/1600x900/c474ffc8-3670-11ec-8ebc-44dc78da1a73_1635261914566_1635747332908.jpg", "publishedAt": "2021-11-01T05:53:01Z", "content": "Researchers in Indonesia have found a way to fight disease-bearing mosquitoes by breeding a species of the insect which carries a kind of bacteria that prevents viruses like dengue from growing insid… [+1783 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Woman dies in Vancouver hit and run incident; man arrested away from scene - CBC.ca", "description": "Police say the 66-year-old was walking near East Broadway and Commercial Drive when a driver struck her with a vehicle, then continued to proceed eastward without stopping.", "url": "https://www.cbc.ca/news/canada/british-columbia/woman-dies-vancouver-hit-and-run-1.6232411", "urlToImage": "https://i.cbc.ca/1.5897955.1635449070!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/vpd-logo.jpg", "publishedAt": "2021-11-01T05:50:00Z", "content": "Vancouver Police say they are investigating a hit-and-run incident that resulted in the death of a woman on Saturday night.\r\nPolice say the 66-year-old was walking near East Broadway and Commercial D… [+1019 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid booster jabs available at walk-in sites in England - BBC News", "description": "The NHS hopes to bolster uptake ahead of a \"challenging\" winter, with hundreds of sites available.", "url": "https://www.bbc.co.uk/news/health-59116051", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/BF8D/production/_115773094_5cb1ebb2-0eec-4636-ad64-e16aa1368505.jpg", "publishedAt": "2021-11-01T05:49:59Z", "content": "Booster jabs to protect against Covid are now available at walk-in sites in England as the NHS hopes to bolster uptake ahead of a \"challenging\" winter.\r\nAbout 30 million people who had their second v… [+2455 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "P480,000 worth of fake banknotes seized - Manila Bulletin", "description": "The Nation's Leading Newspaper", "url": "https://mb.com.ph/2021/11/01/p480000-worth-of-fake-banknotes-seized/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/11/41770.jpeg", "publishedAt": "2021-11-01T05:36:00Z", "content": "The central bank has confiscated some P480,000 worth of counterfeit banknotes in the first nine months of this year, bringing to P7.69 million the amount of all seized fake money in the last 10 years… [+3032 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "Jimmy Ellingham", "title": "Dead woman found to have suffered 76 injuries, high court told - RNZ", "description": "A woman, who allegedly died at the hands of a man on trial for her manslaughter, was found to have suffered 76 injuries, a court has been told.", "url": "https://www.rnz.co.nz/news/national/454687/dead-woman-found-to-have-suffered-76-injuries-high-court-told", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/116039/eight_col_201120_WIRI-WOMENS-PRISON-COURT014.jpg?1610428425", "publishedAt": "2021-11-01T05:33:06Z", "content": "Warning: This story contains details of violence and abuse.\r\nA woman, who allegedly died at the hands of a man on trial for her manslaughter, was found to have suffered 76 injuries, including those c… [+3179 chars]"}]}