{"status": "ok", "totalResults": 453, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Michael Jones", "title": "Tottenham vs Chelsea LIVE: Carabao Cup latest score and goal updates from semi-final tonight - The Independent", "description": "Follow all the action from the semi-final second leg at the Tottenham Hotspur Stadium", "url": "https://www.independent.co.uk/sport/football/tottenham-chelsea-live-stream-carabao-cup-2022-b1991614.html", "urlToImage": "https://static.independent.co.uk/2022/01/12/20/newFile.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2022-01-12T20:39:32Z", "content": "Follow all the action as Tottenham host Chelsea in their Carabao Cup semi-final second leg this evening. \r\nAntonio Contes side were resoundingly beaten at Stamford Bridge in the first leg, with a 2-0… [+5639 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Sharon LaFraniere, Noah Weiland", "title": "Omicron, Testing and Vaccines News: Covid-19 Live Updates - The New York Times", "description": "The Biden administration is also giving schools millions of free virus tests, a move that aims to help keep schools open. As countries race to keep up with the Omicron variant, many are relying on self-administered antigen tests rather than P.C.R. testing, wh…", "url": "https://www.nytimes.com/live/2022/01/12/world/omicron-covid-testing-vaccines", "urlToImage": "https://static01.nyt.com/images/2022/01/12/multimedia/12virus-briefing-promo2/12virus-briefing-uk-contracts-facebookJumbo.jpg", "publishedAt": "2022-01-12T20:31:55Z", "content": "The White House on Wednesday said that it was considering a program to offer high-quality masks to Americans as the highly transmissible Omicron variant of the coronavirus spreads through the nation.… [+4371 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Cosmic 'spider' found to be source of powerful gamma-rays - Phys.org", "description": "Using the 4.1-meter SOAR Telescope in Chile, astronomers have discovered the first example of a binary system where a star in the process of becoming a white dwarf is orbiting a neutron star that has just finished turning into a rapidly spinning pulsar. The p…", "url": "https://phys.org/news/2022-01-cosmic-spider-source-powerful-gamma-rays.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/cosmic-spider-found-to-1.jpg", "publishedAt": "2022-01-12T20:25:28Z", "content": "Using the 4.1-meter SOAR Telescope in Chile, astronomers have discovered the first example of a binary system where a star in the process of becoming a white dwarf is orbiting a neutron star that has… [+6598 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Bevan Hurley", "title": "Prince Andrew hearing: Virginia Giuffre sexual abuse case can move ahead to trial, judge rules - The Independent", "description": "Decision clears way for Ms Giuffre’s attorneys to move into a discovery phase of the trial, causing more embarrassment for Prince Andrew and the royal family", "url": "https://www.independent.co.uk/news/world/americas/prince-andrew-hearing-virginia-giuffre-verdict-b1986097.html", "urlToImage": "https://static.independent.co.uk/2021/12/31/14/Prince%20Andrew%20cropped.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2022-01-12T20:24:29Z", "content": "Prince Andrew faces the prospect of a civil trial over accusations that he sexually abused Virginia Roberts Giuffre when she was underage after a judge denied his attempt to have her lawsuit dismisse… [+5412 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Listening to the leaves: Adding bioinspired veins to foamed polymers - Science Daily", "description": "Vascular systems found in trees transport vital nutrients from root, to branch, to leaf. In a new study, researchers have developed a chemical process to mimic this arboreal architecture in foamed polymers, enabling directional fluid transport and adding stru…", "url": "https://www.sciencedaily.com/releases/2022/01/220112145126.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-12T20:00:13Z", "content": "Many lessons learned in life are learned from trees. Stand firm. Good things take time. Bend, don't break. But metaphors aside, our stately arboreal neighbors offer a wealth of scientific wisdom -- a… [+6337 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": null, "title": "43-year-old man charged with murder over death of Christchurch woman - New Zealand Herald", "description": "Police were called to reports of an assault in New Brighton at 10.40pm last night.", "url": "https://www.nzherald.co.nz/nz/43-year-old-man-charged-with-murder-over-christchurch-death/V52UB3S3XJHW54JNQABYQDZ7LY/", "urlToImage": "https://www.nzherald.co.nz/resizer/iY8ZGTURzvQLG3-HVheeZEgMTlM=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/4AOJP2J4NBN7VSCYCKCURU5JKQ.jpg", "publishedAt": "2022-01-12T20:00:12Z", "content": "A member of the ANZAC Fire Station lays flowers at the scene. Photo / George HeardA homicide investigation is under way in Christchurch after the death of a woman.\r\nPolice were called to reports of a… [+456 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Kate McKenna, Lexy Hamilton-Smith", "title": "Queensland health workers struggle with weight of 'full-blown crisis' of COVID-19's Omicron surge - ABC News", "description": "Acute workforce shortages are being experienced across the spectrum of Queensland health services as today marks a month since interstate borders reopened to COVID-19 hotspots. In just 31 days, the number of active cases has skyrocketed from 56 on December 13…", "url": "https://www.abc.net.au/news/2022-01-13/qld-coronavirus-covid19-strain-on-health-sector-staff-omicron/100750292", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/c86c55e8137dfd5ff24cafb976de97f4?impolicy=wcms_crop_resize&cropH=843&cropW=1499&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2022-01-12T19:57:17Z", "content": "Acute workforce shortages are being experienced across the spectrum of Queensland health services, from general practice to hospitals and residential aged care, with the worst of COVID-19's Omicron w… [+6759 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "UK PM Boris Johnson apologizes for attending lockdown party - CBC News", "description": "British Prime Minister Boris Johnson apologized on Wednesday for attending a \"bring your own booze\" gathering at his official residence during the first coronavirus lockdown, as a senior figure in his party and opponents said he should resign.", "url": "https://www.cbc.ca/news/world/united-kingdom-boris-johnson-lockdown-party-downing-street-1.6311972", "urlToImage": "https://i.cbc.ca/1.6311975.1641990827!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/britain-politics.jpg", "publishedAt": "2022-01-12T19:56:06Z", "content": "British Prime Minister Boris Johnson apologized on Wednesday for attending a \"bring your own booze\" gathering at his official residence during the first coronavirus lockdown, while a senior figure in… [+4925 chars]"}, {"source": {"id": null, "name": "ZME Science"}, "author": "Tibi Puiu", "title": "Tasmanian Devils are picky eaters — and they may just have broken the laws of scavenging - ZME Science", "description": "A scavenger that is a specialist? That's unique in the world.", "url": "https://www.zmescience.com/science/news-science/tasmanian-devils-are-picky-eaters-and-they-may-just-have-broken-the-laws-of-scavenging/", "urlToImage": "https://cdn.zmescience.com/wp-content/uploads/2022/01/24170311598_0177958c24_k.jpg", "publishedAt": "2022-01-12T19:55:23Z", "content": "Credit: Mathias Appel, Flickr.\r\nAs the largest carnivorous marsupial in the world, the Tasmanian devil is strictly carnivorous, hunting frogs, birds, fish, and insects. But most of their meals actual… [+5204 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Baz Ruddick", "title": "Some Queensland schools dismissing delayed term date due to COVID-19, kicking off online learning in January - ABC News", "description": "Some Queensland schools are rejecting Premier Annastacia Palaszczuk's recommendation to delay the start of the school year by two weeks due to the COVID-19 Omicron outbreak, and will instead use remote learning from the original term date of January 24.", "url": "https://www.abc.net.au/news/2022-01-13/qld-coronavirus-covid19-schools-reject-term-start-delay/100750566", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2b33e8a9b7b783d462a550d28c22ab4b?impolicy=wcms_crop_resize&cropH=1680&cropW=2983&xPos=17&yPos=111&width=862&height=485", "publishedAt": "2022-01-12T19:53:59Z", "content": "Some Queensland schools are rejecting Annastacia Palaszczuk's recommendation to delay the start of the school year by two weeks to February 7 due to the COVID-19 Omicron outbreak, and will instead us… [+5151 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": "Reuters", "title": "Apple pulls Wordle knockoffs from App Store - Financial Post", "description": "Apple Inc said on Wednesday it has removed from its App Store several knockoffs of Wordle, a website-only word game that has seen a recent surge in popularity…", "url": "https://financialpost.com/pmn/business-pmn/apple-pulls-wordle-knockoffs-from-app-store", "urlToImage": null, "publishedAt": "2022-01-12T19:50:20Z", "content": "Article content\r\nApple Inc said on Wednesday it has removed from its App Store several knockoffs of Wordle, a website-only word game that has seen a recent surge in popularity thanks to celebrities l… [+1080 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Cannabis compounds can stop the virus that causes COVID-19 from entering human cells, study finds - Daily Mail", "description": "A pair of cannabinoid acids were identified in cannabis that are able to bind with the SARS-CoV-2 spike protein, blocking it from infecting human cells. The compounds can also be taken orally.", "url": "https://www.dailymail.co.uk/sciencetech/article-10395689/Cannabis-compounds-stop-virus-causes-COVID-19-entering-human-cells-study-finds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/12/19/52852949-0-image-a-58_1642016793911.jpg", "publishedAt": "2022-01-12T19:46:57Z", "content": "Specific cannabis compounds can prevent the virus that causes COVID-19 from entering human cells.\r\nResearchers at Oregon State University identified a pair of cannabinoid acids that bind to the SARS-… [+3508 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Benjamin Weiser", "title": "Epstein Accuser’s Lawsuit Against Prince Andrew Can Proceed, Judge Rules - The New York Times", "description": "Virginia Giuffre has sued Andrew, the second son of Queen Elizabeth II, accusing him of raping her when she was a teenager.", "url": "https://www.nytimes.com/2022/01/12/nyregion/prince-andrew-epstein-lawsuit-virginia-giuffre.html", "urlToImage": "https://static01.nyt.com/images/2022/01/12/nyregion/12PrinceAndrew/12PrinceAndrew-facebookJumbo.jpg", "publishedAt": "2022-01-12T19:43:32Z", "content": "A lawyer for Andrew, the Duke of York, did not respond to a request for comment. Buckingham Palace declined to comment on the ruling.\r\nMs. Giuffres lawyer, David Boies, said his client was pleased th… [+885 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jon Henley", "title": "Novak Djokovic faces fine or prison for breaking isolation while Covid positive - The Guardian", "description": "Star is due to play at Australian Open but faces possibility of deportation", "url": "https://amp.theguardian.com/sport/2022/jan/12/novak-djokovic-faces-fine-or-prison-for-breaking-isolation-while-covid-positive", "urlToImage": null, "publishedAt": "2022-01-12T19:38:00Z", "content": "Novak DjokovicStar is due to play at Australian Open but faces possibility of deportation\r\nNovak Djokovic could face a fine or even prison in Serbia after his admission that he broke isolation while … [+4920 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kylie Stevens", "title": "Australian Open 2021: Novak Djokovic could be jailed over discrepancy as government decides fate - Daily Mail", "description": "The federal government is expected to announced on Thursday whether it will launch a new bid to deport the defending Australian Open champion.", "url": "https://www.dailymail.co.uk/news/article-10395717/Australian-Open-2021-Novak-Djokovic-jailed-discrepancy-government-decides-fate.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/12/20/52853757-0-image-a-22_1642018384243.jpg", "publishedAt": "2022-01-12T19:33:48Z", "content": "Defending Australian Open champion Novak Djokovic could be deported from the country as early as today after inconsistencies between sworn evidence and social media posts emerged.\r\nThe world number o… [+20382 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "US consumer prices rise at fastest rate in nearly 40 years - BBC News", "description": "Inflation jumped 7% in December, piling pressure on the US central bank to raise interest rates.", "url": "https://www.bbc.com/news/business-59969864", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/53DB/production/_122676412_hi072541589.jpg", "publishedAt": "2022-01-12T19:28:45Z", "content": "Prices in the US are rising at their fastest rate in almost 40 years, with inflation up 7% year-on-year in December.\r\nStrong demand and scarce supply for key items such as cars are driving the increa… [+4166 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Ameh Ejekwonyilo", "title": "Nnamdi Kanu writes US, UK envoys over his trial, Buhari's comment - Premium Times", "description": "Nnamdi Kanu's lawyer explained to the diplomats that President Muhammadu's recent extrajudicial comment necessitated the letters.", "url": "https://www.premiumtimesng.com/news/top-news/505521-nnamdi-kanu-writes-u-s-uk-envoys-over-his-trial-buharis-comment.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/01/Nnamdi-Kanu.jpg", "publishedAt": "2022-01-12T19:21:36Z", "content": "The leader of the proscribed Indigenous People of Biafra (IPOB), Nnamdi Kanu, has written to the United States Ambassador in Nigeria, Mary Beth Leonard, urging her to send representatives to observe … [+6802 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Policeman-turned-governor – Obasanjo praises Alao-Akala - Daily Post Nigeria", "description": "Former President Olusegun Obasanjo has declared his admiration of the life of the late Adebayo Alao-Akala. The politician died on Tuesday at the age of 71. He had been ill since 2021. Obasanjo praised the deceased for not limiting himself, becoming a governor…", "url": "https://dailypost.ng/2022/01/12/policeman-turned-governor-obasanjo-praises-alao-akala/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/08/adebayo-alao-akala.jpg", "publishedAt": "2022-01-12T19:21:28Z", "content": "Former President Olusegun Obasanjo has declared his admiration of the life of the late Adebayo Alao-Akala.\r\nThe politician died on Tuesday at the age of 71. He had been ill since 2021.\r\nObasanjo prai… [+1402 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Li Yuan", "title": "The Army of Millions Who Enforce China’s Zero-Covid Policy - The New York Times", "description": "As the troubled lockdown in Xi’an has shown, many Chinese people remain willing to work diligently toward the government’s goal of eliminating the virus, no matter the consequences.", "url": "https://www.nytimes.com/2022/01/12/business/china-zero-covid-policy-xian.html", "urlToImage": "https://static01.nyt.com/images/2022/02/01/business/0112Newworld-illo/0112Newworld-illo-facebookJumbo.jpg", "publishedAt": "2022-01-12T19:21:26Z", "content": "Since Wuhan, the Chinese internet has devolved into a parochial platform for nationalists to praise China, the government and the Communist Party. No dissent or criticism is tolerated, with online gr… [+1360 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Tech founder worth $20bn as payments company hits record value - Telegraph.co.uk", "description": "Checkout.com overtakes Revolut to be worth $40bn after new funding round, making founder Guillaume Pousaz even richer", "url": "https://www.telegraph.co.uk/business/2022/01/12/payments-company-overtakes-revolut-uks-valuable-start-up/", "urlToImage": "https://www.telegraph.co.uk/content/dam/business/2022/01/12/TELEMMGLPICT000282609621_trans_NvBQzQNjv4Bq-vlazOz04yHusVGh830vPn4ihL9D5G77hk2Gx25ScXg.jpeg?impolicy=logo-overlay", "publishedAt": "2022-01-12T19:21:00Z", "content": "A university dropout who entered the payments industry to fund his surfing lifestyle has become one of the richest owners of a British business after his tech start-up was valued at $40bn (£29bn).\r\nL… [+1057 chars]"}]}