{"status": "ok", "totalResults": 450, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe and Dakin Andone, CNN", "title": "100 million fully vaccinated people are helping the US reopen. But many millions more are needed - CNN ", "description": "The United States has fully vaccinated more than 100 million people against Covid-19, according to the US Centers for Disease Control and Prevention -- a milestone that comes with optimism about the future.", "url": "https://www.cnn.com/2021/05/01/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210501002409-0430-us-coronavirus-saturday-super-tease.jpg", "publishedAt": "2021-05-01T16:28:00Z", "content": "(CNN)The United States has fully vaccinated more than 100 million people against Covid-19, according to the US Centers for Disease Control and Prevention -- a milestone that comes with optimism about… [+6804 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Neelav Chakravarti", "title": "MI vs CSK IPL Live Score 2021: Rohit Sharma, Quinton de Kock In Full Flow, Mumbai Indians Off To Goo.. - NDTVSports.com", "description": "MI vs CSK IPL Live Score 2021, Mumbai Indians vs Chennai Super Kings: Rohit Sharma and Quinton de Kock have started strongly in their chase of 219 runs for MI in Match 27 of IPL 2021, at the Arun Jaitley Stadium.", "url": "https://sports.ndtv.com/ipl-2021/live-ipl-2021-mi-vs-csk-score-online-mumbai-indians-vs-chennai-super-kings-live-ipl-score-2425947", "urlToImage": "https://c.ndtvimg.com/2021-05/488gu25o_de-kock-bcci-ipl_625x300_01_May_21.jpg", "publishedAt": "2021-05-01T16:27:50Z", "content": "Chasing a target of 219 runs, Mumbai Indians (MI) are gaining momentum vs Chennai Super Kings (CSK) in Match 27 of the ongoing Indian Premier League (IPL) 2021, at the Arun Jaitley Stadium on Saturda… [+1007 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/jon-fingas", "title": "Google will freeze auto-renewing Play Store subscriptions in India | Engadget - Engadget", "description": "The Google Play Store is freezing auto-renewing subscriptions and free trials in India following new rules in the country..", "url": "https://www.engadget.com/google-play-store-india-halts-auto-renewing-subscriptions-162021215.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/68aa2e70-aa93-11eb-bfac-fb911d510654", "publishedAt": "2021-05-01T16:26:47Z", "content": "You might take your automatic Android app subscriptions for granted, but people in India won't have it so easy. XDA has learned that Google is suspending signups for auto-renewing subscriptions and f… [+991 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "TIMOTHY GOH", "title": "Patient in TTSH Covid-19 cluster dies; Edgefield Secondary School student among 7 community cases - The Straits Times", "description": "The 88-year-old S'porean woman had been warded in Ward 9D from April 14, and was confirmed to have Covid-19 on April 28.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/health/ttsh-patient-dies-of-covid-19-edgefield-secondary-school-student-tests-positive-for", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/05/01/md-moh-010521.jpg?itok=RMJu00vj", "publishedAt": "2021-05-01T16:21:16Z", "content": "SINGAPORE - An 88-year-old Singaporean woman, who was a Tan Tock Seng Hospital (TTSH) patient, died from Covid-19 complications on Saturday (May 1).\r\nThe Ministry of Health (MOH) said on Saturday nig… [+7714 chars]"}, {"source": {"id": null, "name": "Extra.ie"}, "author": null, "title": "HSE boss rejoices as record number of vaccines administered in a day - Extra.ie", "description": "HSE CEO Paul Reid was overjoyed to share that this weekend saw a new record of COVID vaccines administered in a day.", "url": "https://extra.ie/2021/05/01/news/irish-news/record-vaccines-hse-boss-paul-reid", "urlToImage": "https://cdn.extra.ie/wp-content/uploads/2021/03/05075822/Paul-Reid-GPs-Vaccine-Rollout-Feature.jpg", "publishedAt": "2021-05-01T16:20:37Z", "content": "HSE CEO Paul Reid was overjoyed to share that this weekend saw a new record of COVID vaccines administered in a day.\r\nOn Friday, 44,000 vaccinations took place at Dublin City University’s The Helix.\r… [+2382 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "DILG sounds alarm on ‘fake’ Pfizer vaccine – The Manila Times - The Manila Times", "description": "The Department of the Interior and Local Government (DILG) on Saturday warned all local government units (LGUs) of the presence of fake Pfizer Covid-19 vaccines in the market. “While there is no information yet on the presence of the fake vaccines in the coun…", "url": "https://www.manilatimes.net/2021/05/02/news/national/dilg-sounds-alarm-on-fake-pfizer-vaccine/869269/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2020/03/170220_año2_martinez-1.jpg", "publishedAt": "2021-05-01T16:13:09Z", "content": "The Department of the Interior and Local Government (DILG) on Saturday warned all local government units (LGUs) of the presence of fake Pfizer Covid-19 vaccines in the market.\r\nWhile there is no info… [+1840 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Bloomberg News", "title": "Vaccine hoarding may backfire on rich nations as India reels | Bloomberg News - Business Mirror", "description": "For months, developed economies have hoarded Covid-19 vaccines and the raw materials needed to make them. Now, they’re being forced to act as an explosive outbreak in India raises the risk of new virus mutations that could threaten the wider world. Under moun…", "url": "https://businessmirror.com.ph/2021/05/02/vaccine-hoarding-may-backfire-on-rich-nations-as-india-reels/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/04/world01-050221.jpg", "publishedAt": "2021-05-01T16:12:00Z", "content": "For months, developed economies have hoarded Covid-19 vaccines and the raw materials needed to make them. Now, theyre being forced to act as an explosive outbreak in India raises the risk of new viru… [+7180 chars]"}, {"source": {"id": null, "name": "Irish Mirror"}, "author": "Jonathan Coles", "title": "Prince Charles 'still fuming' over Harry and Meghan's bombshell Oprah interview - Irish Mirror", "description": "Royal correspondent and podcast host Christina Garibaldi has said the Prince of Wales is still angry over his son and daughter-in-law's tell-all chat - despite reports of peace talks", "url": "https://www.irishmirror.ie/news/world-news/prince-charles-still-fuming-over-24020252", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23993874.ece/ALTERNATES/s1200/4_The-Funeral-Of-Prince-Philip-Duke-Of-Edinburgh-Is-Held-In-Windsor.jpg", "publishedAt": "2021-05-01T16:11:32Z", "content": "Prince Charles is \"still fuming\" over Prince Harry and Meghan Markle's bombshell interview with Oprah Winfrey, it is claimed.\r\nRoyal correspondent and podcast host Christina Garibaldi has said the Pr… [+2749 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "Increase funding for education – ACT – The Manila Times - The Manila Times", "description": "THE Alliance of Concerned Teachers (ACT Philippines) called for Congress’s support for funding education amid the learning crisis brought about by the pandemic, following the Congress’ joint committee approval of the proposed Bayanihan 3. ACT Philippines said…", "url": "https://www.manilatimes.net/2021/05/02/news/national/increase-funding-for-education-act/869258/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/02/TMTFB_1920x1008.jpg", "publishedAt": "2021-05-01T16:04:07Z", "content": "THE Alliance of Concerned Teachers (ACT Philippines) called for Congresss support for funding education amid the learning crisis brought about by the pandemic, following the Congress joint committee … [+1741 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "PUV drivers to receive Labor Day incentives – The Manila Times - The Manila Times", "description": "TO commemorate Labor Day, The Department of Transportation (DoTr) and the Land Transportation Franchising and Regulatory Board (LTFRB) will be giving additional incentives to public utility vehicle (PUV) drivers who are under the Service Contracting Program. …", "url": "https://www.manilatimes.net/2021/05/02/news/national/puv-drivers-to-receive-labor-day-incentives/869245/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/02/TMTFB_1920x1008.jpg", "publishedAt": "2021-05-01T16:02:14Z", "content": "TO commemorate Labor Day, The Department of Transportation (DoTr) and the Land Transportation Franchising and Regulatory Board (LTFRB) will be giving additional incentives to public utility vehicle (… [+1053 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Kenneth Chang", "title": "SpaceX to Land 4 Astronauts for NASA -- How to Watch - The New York Times", "description": "Crew-1, which launched to the space station in November, will head home in the capsule called Resilience.", "url": "https://www.nytimes.com/2021/05/01/science/nasa-spacex-landing.html", "urlToImage": "https://static01.nyt.com/images/2021/05/01/science/01ASTRONAUTS1/01ASTRONAUTS1-facebookJumbo.jpg", "publishedAt": "2021-05-01T16:00:08Z", "content": "Just before 2 a.m., as it prepares for its return to Earth, the Crew Dragon will jettison what SpaceX calls the trunk section of the spacecraft the cylindrical compartment below the gumpdrop-shaped c… [+1553 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "'This death of a young doctor...': IMA ex-chief blames 'system' as Delhi Covid doctor dies by suicide - Hindustan Times", "description": "Dr Vivek Rai has left a suicide letter but no reason for his suicide was mentioned there, police said.", "url": "https://www.hindustantimes.com/india-news/this-death-of-a-young-doctor-ima-ex-chief-blames-system-as-delhi-covid-doctor-dies-by-suicide-101619884258693.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/01/1600x900/dr_1619884529143_1619884534858.JPG", "publishedAt": "2021-05-01T15:57:49Z", "content": "The former chief of Indian Medical Association, Dr Ravi Wankhedkar, on Saturday said the suicide of Dr Vivek Rai, a resident doctor of a private hospital in Delhi, is nothing short of murder by the \"… [+2057 chars]"}, {"source": {"id": null, "name": "Todayville.com"}, "author": "The Canadian Press", "title": "SpaceX making 1st US crew splashdown in dark since Apollo 8 - Todayville.com", "description": "CAPE CANAVERAL, Fla. — SpaceX this weekend will attempt the first U.S. splashdown of returning astronauts in darkness since the Apollo 8 moonshot in 1968. Elon Musk’s company is targeting the preda…", "url": "https://www.todayville.com/spacex-making-1st-us-crew-splashdown-in-dark-since-apollo-8/", "urlToImage": "https://i0.wp.com/www.todayville.com/wp-content/uploads/2021/05/tvrd-tvrd-space-x-crew-image-2021-05-01.jpg?fit=624%2C351&ssl=1", "publishedAt": "2021-05-01T15:56:15Z", "content": "WASHINGTON Joe Biden’s presidency is entering a new and more perilous phase where he is almost certain to face stiffer Republican opposition and also have difficulty keeping Democrats united as he pu… [+7820 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Philip Whiteside", "title": "COVID-19: Surge testing in east London borough of Tower Hamlets after Brazilian and South African variants found - Sky News", "description": "The latest developments mean that surge testing is under way for people living in areas in the postcodes E1, E2, E3 and E14.", "url": "https://news.sky.com/story/covid-19-surge-testing-in-east-london-borough-of-tower-hamlets-after-brazilian-and-south-african-variants-found-12292334", "urlToImage": "https://e3.365dm.com/21/04/1600x900/skynews-surge-testing-clapham-common_5342097.jpg?20210414170744", "publishedAt": "2021-05-01T15:55:52Z", "content": null}, {"source": {"id": null, "name": "Motorsport.com"}, "author": "Charles Bradley", "title": "Grand Prix qualifying results: Bottas takes F1 pole in Portugal - Motorsport.com", "description": "Valtteri Bottas took pole position for the Portuguese Grand Prix at Portimao for Mercedes on Saturday, the third round of the 2021 Formula 1 World Championship season.", "url": "https://www.motorsport.com/f1/news/grand-prix-qualifying-results-f1-portugal/6500101/", "urlToImage": "https://cdn-1.motorsport.com/images/amp/01Wvd3mY/s6/formula-1-portuguese-gp-2021-v-3.jpg", "publishedAt": "2021-05-01T15:49:15Z", "content": "Bottas will start ahead of Mercedes teammate Lewis Hamilton and Red Bull's Max Verstappen after the one-hour qualifying session, which is split into three segments with five cars each being knocked o… [+2751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "The facts around leaked audio about John Kerry - CNN ", "description": "Republicans have seized on a recent claim that former Secretary of State John Kerry told Iranian Foreign Minister Javad Zarif about Israeli strikes on Iranian interests in Syria. Zarif made the allegation in leaked audio, a claim which, if true, would undermi…", "url": "https://www.cnn.com/2021/05/01/politics/kerry-audio-facts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210423112916-01-john-kerry-0422-super-tease.jpg", "publishedAt": "2021-05-01T15:46:00Z", "content": "Washington (CNN)Republicans have seized on a recent claim that former Secretary of State John Kerry told Iranian Foreign Minister Javad Zarif about Israeli strikes on Iranian interests in Syria. Zari… [+3482 chars]"}, {"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "SpaceX splashdown: Four astronauts to return from record-breaking mission - CNN Philippines", "description": "Four astronauts are preparing to return home from the International Space Station aboard a SpaceX Crew Dragon capsule, ending their five-month mission to the orbiting laboratory.", "url": "http://www.cnnphilippines.com/business/2021/5/1/spacex-astronauts-return.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/5/1/ISS-astronauts_CNNPH.jpg/jcr:content/ISS-astronauts_CNNPH.jpg", "publishedAt": "2021-05-01T15:44:49Z", "content": "(CNN) -- Four astronauts are preparing to return home from the International Space Station aboard a SpaceX Crew Dragon capsule, ending their five-month mission to the orbiting laboratory. The astrona… [+6064 chars]"}, {"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Hubble observes a giant planet growing as it gobbles up dust and gas - Digital Trends", "description": "Hubble has made a rare direct observation of giant planet PDS 70b to learn about how such large planets grow.", "url": "https://www.digitaltrends.com/news/hubble-giant-planet-pds-70b/", "urlToImage": "https://img.dtcn.com/image/digitaltrends/stsci-01f3t87yxv78zrd2n7fyzs4xf81-1200x630-c-ar1.91.jpg", "publishedAt": "2021-05-01T15:43:23Z", "content": "This illustration of the newly forming exoplanet PDS 70b shows how material may be falling onto the giant world as it builds up mass. By employing Hubbles ultraviolet light (UV) sensitivity, research… [+2611 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Humungous, Record-Breaking Stellar Flare From Sun’s Nearest Neighbor - SciTechDaily", "description": "Scientists have spotted the largest flare ever recorded from the sun’s nearest neighbor, the star Proxima Centauri. The research, which was published recently in The Astrophysical Journal Letters, was led by CU Boulder and could help to shape the hunt for lif…", "url": "https://scitechdaily.com/humungous-record-breaking-stellar-flare-from-suns-nearest-neighbor/", "urlToImage": "https://scitechdaily.com/images/Violent-Stellar-Flare-Proxima-Centauri.jpg", "publishedAt": "2021-05-01T15:29:11Z", "content": "Artist’s conception of a violent stellar flare erupting on neighboring star, Proxima Centauri. The flare is the most powerful ever recorded from the star, and is giving scientists insight into the hu… [+6905 chars]"}, {"source": {"id": null, "name": "Racing Post"}, "author": "Matt Rennie", "title": "Class acts: Manning and Bolger at their best as Poetic Flare triumphs - Racing Post", "description": "xxx This race report is being updated and more news will follow shortly", "url": "https://www.racingpost.com/news/race-reports/like-father-like-son-poetic-flare-gets-the-verdict-in-thrilling-2000-guineas/487639", "urlToImage": null, "publishedAt": "2021-05-01T15:21:31Z", "content": "By Matt Rennie \r\n UPDATED 4:21PM, MAY 1 2021\r\nPoetic Flare emulated his sire Dawn Approach and came out on top in a thrilling finish to the Qipco 2,000 Guineas to provide Kevin Manning and Jim Bolger… [+2418 chars]"}]}