{"status": "ok", "totalResults": 434, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "iPhone 14 release live: Apple reveals iPhone 14 Pro, Watch Ultra and AirPods Pro - The Telegraph", "description": "Apple has revealed a new emergency satellite connectivity service for its iPhone 14 smartphone that can send text messages for help even when a user has no mobile phone signal.", "url": "https://www.telegraph.co.uk/technology/2022/09/07/iphone-14-release-apple-event-far-time-latest-updates/", "urlToImage": "https://img.youtube.com/vi/ux6zXguiqxM/maxresdefault.jpg", "publishedAt": "2022-09-07T18:42:30Z", "content": "Apple has revealed a new emergency satellite connectivity service for its iPhone 14 smartphone that can send text messages for help even when a user has no mobile phone signal.\r\nThe company launched … [+1323 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Education and Careers Desk", "title": "NEET Result 2022 Declared! LIVE Updates: Rajasthan's Tanishka Tops Exam, 993069 Students Pass - News18", "description": "NEET Result 2022 LIVE Updates: Rajasthan's Tanishka has topped the exam with 99.9997733 percentile score. A total of 993069 students have passed the exam.", "url": "https://www.news18.com/news/education-career/neet-result-2022-live-updates-merit-list-cut-off-toppers-air-1-scorecard-direct-link-neet-nta-nic-in-ntaresults-nic-in-livenews-5905183.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/neetugresult2022-166252172416x9.jpg", "publishedAt": "2022-09-07T18:30:59Z", "content": "Sep 08, 2022 00:00 ISTMeet Tanishka, NEET 2022 Topper\r\nTanishka has secured All India Rank -1 in NEET-UG 2022. A native of Haryana, she has been training with of Allen career institute Kota as well a… [+8495 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Researchers develop assistive robot to prevent falls and assist in physiotherapy for the elderly - Medical Xpress", "description": "Researchers at Nanyang Technological University, Singapore (NTU Singapore) and Tan Tock Seng Hospital (TTSH) have developed a wearable assistive robot that can detect and prevent a fall before it happens, reducing the user's risk of sustaining injuries.", "url": "https://medicalxpress.com/news/2022-09-robot-falls-physiotherapy-elderly.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/researchers-develop-as.jpg", "publishedAt": "2022-09-07T18:30:22Z", "content": "Researchers at Nanyang Technological University, Singapore (NTU Singapore) and Tan Tock Seng Hospital (TTSH) have developed a wearable assistive robot that can detect and prevent a fall before it hap… [+6033 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "Study Finds", "title": "Men more likely to take financial risks and gamble after getting good news from a fortune teller! - Study Finds", "description": "Men appear to be much more superstitious than women -- especially when it comes to money.", "url": "https://studyfinds.org/men-financial-risks-fortune-teller/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2022/09/pexels-cottonbro-7179426.jpg", "publishedAt": "2022-09-07T18:30:19Z", "content": "ROTTERDAM, Netherlands — Men appear to be much more superstitious than women — especially when it comes to money! A new study reveals they are more likely to take financial risks or gamble after rece… [+2539 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Christian Davenport", "title": "Timing of NASA's moon launch may depend on emergency detonation system - The Washington Post", "description": "The system, which is designed to destroy the SLS rocket if it veers off course and threatens population centers, needs to be recharged every few weeks.", "url": "https://www.washingtonpost.com/technology/2022/09/07/artemis-launch-nasa-detonation-system/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WNFARHBK6MI63KIK7TSACXP4R4.jpg&w=1440", "publishedAt": "2022-09-07T18:29:05Z", "content": "Like all big rockets, NASAs Space Launch System is outfitted with powerful engines and thousands of gallons of highly combustible propellants capable of lifting a booster the size of a tall building … [+4908 chars]"}, {"source": {"id": null, "name": "Sky Sports"}, "author": "Paul Merson", "title": "Paul Merson Says: Zinedine Zidane best fit for Chelsea not Graham Potter; why back Thomas Tuchel then sack him? - Sky Sports", "description": "Paul Merson discusses Chelsea's sacking of Thomas Tuchel and why Graham Potter would be going from high school to Oxford University.", "url": "https://www.skysports.com/football/news/11095/12692249/paul-merson-says-zinedine-zidane-best-fit-for-chelsea-not-graham-potter-why-back-thomas-tuchel-then-sack-him", "urlToImage": "https://e0.365dm.com/22/06/1600x900/skysports-paul-merson-merson-says_5816246.jpg?20220627143057", "publishedAt": "2022-09-07T18:20:37Z", "content": "In his latest Sky Sports column, Paul Merson discusses Chelseas decision to sack Thomas Tuchel and why he believes appointing Zinedine Zidane would have made more sense than turning to Brighton boss … [+6657 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Alberta men accused in plot to murder Mounties saw undercover cops as 'girls' who could help: court records - CBC.ca", "description": "Newly released records show police believed the Alberta men now accused of plotting to murder RCMP officers debated having two women smuggle a hockey bag filled with guns into a protest against pandemic-related restrictions.", "url": "https://www.cbc.ca/news/canada/calgary/coutts-blockade-charges-court-documents-unsealed-itos-1.6565837", "urlToImage": "https://i.cbc.ca/1.6332660.1643493387!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/truck-protest.jpg", "publishedAt": "2022-09-07T18:16:16Z", "content": "Newly released records show police believed the Alberta men now accused of plotting to murder RCMP officers debated having two women smuggle a hockey bag filled with guns into a protest against pande… [+10147 chars]"}, {"source": {"id": null, "name": "Sky Sports"}, "author": "Jamie Carragher", "title": "Chelsea sack Thomas Tuchel: Jamie Carragher fears for Graham Potter and says Mauricio Pochettino would be his preferred choice - Sky Sports", "description": "Jamie Carragher fears for Graham Potter if he becomes Chelsea's next head coach following Thomas Tuchel's \"shock\" sacking.", "url": "https://www.skysports.com/football/news/11095/12691985/chelsea-sack-thomas-tuchel-jamie-carragher-fears-for-graham-potter-and-says-mauricio-pochettino-would-be-his-preferred-choice", "urlToImage": "https://e0.365dm.com/22/09/1600x900/skysports-carragher-chelsea_5890589.jpg?20220907124510", "publishedAt": "2022-09-07T18:16:12Z", "content": "Jamie Carragher fears for Graham Potter if he becomes Chelsea's next head coach following Thomas Tuchel's \"shock\" sacking, suggesting Mauricio Pochettino would be his preferred choice to take charge … [+8312 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "‘Far Out’ 2022 LIVE: Apple unveils iPhone 14 Pro, third in smartphone series - Hindustan Times", "description": "Apple iPhone 14 Launch Event 2022 Live Updates: The ‘Far Out’ event at the Steve Jobs Theatre in California's Cupertino witnessed the launch of several high-end products including the Apple iPhone 14 series, AirPods Pro 2 among others.", "url": "https://www.hindustantimes.com/technology/apple-event-2022-live-updates-tim-cook-iphone-14-apple-watch-airpod-pro-2-101662561554820.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/07/1600x900/Apple_iPhone_14_1662573992688_1662573992951_1662573992951.jpeg", "publishedAt": "2022-09-07T18:15:02Z", "content": "Apple iPhone 14 Launch Event 2022 Live Updates: The wait for iPhone has finally ended. Tim Cook, the chief executive officer of the Cupertino-based tech giant unveiled the latest series of its flagsh… [+7307 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Rod Pyle", "title": "A month on 'Mars': Living on the EDGES - Space.com", "description": "Devon Island is one of the most radio-quiet places in the northern hemisphere, a perfect place for the Haughton-Mars Project to conduct the EDGES experiment.", "url": "https://www.space.com/month-on-mars-living-on-the-edges", "urlToImage": "https://cdn.mos.cms.futurecdn.net/7rtKEv9DST3RPaXUhmXsMo-1200-80.jpg", "publishedAt": "2022-09-07T18:00:55Z", "content": "Science can be a cold, uncaring partner. Oh, your relationship may start out warm and fuzzy, but while your passion for discovery and truth may endure, science may turn its back on you and say, \"find… [+7036 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Aggression de-escalation gene identified in fruit flies - Phys.org", "description": "The brain mechanisms that cause aggressive behavior have been well studied. Far less understood are the processes that tell the body when it's time to stop fighting. Now, a new study by Salk scientists identifies a gene and a group of cells in the brain that …", "url": "https://phys.org/news/2022-09-aggression-de-escalation-gene-fruit-flies.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/aggression-de-escalati.jpg", "publishedAt": "2022-09-07T18:00:02Z", "content": "The brain mechanisms that cause aggressive behavior have been well studied. Far less understood are the processes that tell the body when it's time to stop fighting. Now, a new study by Salk scientis… [+4037 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "New antibody shows therapeutic effects in mice with Alzheimer's disease - Medical Xpress", "description": "A newly developed agonistic antibody reduced the amyloid pathology in mice with Alzheimer's disease, signaling its promise as a potential treatment for the disease, according to a team of researchers at UTHealth Houston.", "url": "https://medicalxpress.com/news/2022-09-antibody-therapeutic-effects-mice-alzheimer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/4-brain.jpg", "publishedAt": "2022-09-07T18:00:01Z", "content": "A newly developed agonistic antibody reduced the amyloid pathology in mice with Alzheimer's disease, signaling its promise as a potential treatment for the disease, according to a team of researchers… [+2768 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Kif Leswing, Sofia Pitt, Ashley Capoot, Todd Haselton", "title": "Here's everything Apple just announced at its iPhone 14 event - CNBC", "description": "Apple's holding its iPhone event where it has announced the Apple Watch Ultra, Series 8 and new AirPods Pro. The new iPhone 14 is also expected.", "url": "https://www.cnbc.com/2022/09/07/apple-event-live-updates-iphone.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107114929-1662574328371-iphone-14-pro-colors.jpg?v=1662574407&w=1920&h=1080", "publishedAt": "2022-09-07T17:59:00Z", "content": "Apple announces iPhone 14 Pro and iPhone 14 Pro Max, no price increase\r\nApple CEO Tim Cook just announced the iPhone 14 pro, the high-end models for this year.\r\nThe smaller model with a 6.1-inch scre… [+10238 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "IIT-Mandi researchers find link between fatty liver disease, Type-2 diabetes - Hindustan Times", "description": "The findings offer new diagnostic and therapeutic tools to control or even reverse fatty-liver-induced diabetes", "url": "https://www.hindustantimes.com/cities/chandigarh-news/iitmandi-researchers-find-link-between-fatty-liver-disease-type-2-diabetes-101662573402437.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/07/1600x900/3ad1adde-2ed6-11ed-b360-96b459ca4506_1662573401367.jpg", "publishedAt": "2022-09-07T17:56:42Z", "content": "The researchers at the Indian Institute of Technology, Mandi, found a biochemical relationship between fatty liver disease and Type 2 diabetes mellitus (T2DM).\r\nThis understanding enables newer techn… [+2522 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Cricketnext Staff", "title": "Pakistan vs Afghanistan Highlights Asia Cup 2022 Super Four: PAK Beat AFG in a Last-over Thriller, IND Out - News18", "description": "Pakistan vs Afghanistan Live Score, Asia Cup 2022 Super Four Updates: Check here for all the live score, live match text updates from PAK vs AFG 2022 Super Four clash at the Sharjah Cricket Stadium", "url": "https://www.news18.com/cricketnext/news/pakistan-vs-afghanistan-live-score-cricket-updates-streaming-t20-asia-cup-2022-super-four-pak-vs-afg-latest-scorecard-today-sharjah-livenews-5909659.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/pakistan-vs-afghanistan-asia-cup-2022-live-score-166255460816x9.jpg", "publishedAt": "2022-09-07T17:51:57Z", "content": "blows in the death overs. With 11 needed off the final over, Naseem Shah was offered two juicy full tosses and he smoked them for consecutive sixes to send Pakistan dressing room into wild celebratio… [+3232 chars]"}, {"source": {"id": null, "name": "This Is Anfield"}, "author": "Jack Lusby", "title": "Confirmed Liverpool lineup vs. Napoli here - This Is Anfield", "description": "Full team news from the Champions League!", "url": "https://www.thisisanfield.com/2022/09/confirmed-liverpool-lineup-vs-napoli-firmino-returns-with-thiago-on-bench/", "urlToImage": "https://www.thisisanfield.com/wp-content/uploads/2022-07-21-075-Leipzig_Liverpool.jpg", "publishedAt": "2022-09-07T17:50:03Z", "content": "Liverpool visit Napoli in their opening Champions League clash this evening, with Thiago among the substitutes as they look to get off to a winning start in Europe.\r\nIt is a familiar story for the Re… [+1353 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Geographical clusters of dengue outbreak in Singapore during the Covid-19 nationwide lockdown of 2020 | Scientific Data - Nature.com", "description": "Measurement(s) dengue infection locations Technology Type(s) NEA’s disclosured report Factor Type(s) Singapore’s dengue in in 2020", "url": "https://www.nature.com/articles/s41597-022-01666-y", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41597-022-01666-y/MediaObjects/41597_2022_1666_Fig1_HTML.png", "publishedAt": "2022-09-07T17:40:45Z", "content": "Dengue infection locations in subzones over weeks\r\nAll dengue clusters are recorded in 21 weeks from 15 February to 9 July, which covers the nationwide lockdown period from 7 April to 1 June. The dat… [+4469 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel skin imaging technology improves the accuracy of basal cell carcinoma diagnosis - News-Medical.Net", "description": "A novel imaging technique significantly improves the accuracy of the diagnosis of basal cell carcinoma (BCC) – the most frequent skin cancer – compared to clinical and dermoscopic examinations alone, according to new research being presented at the 31st Europ…", "url": "https://www.news-medical.net/news/20220907/Novel-skin-imaging-technology-improves-the-accuracy-of-basal-cell-carcinoma-diagnosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Skin_Cancer-620x480.jpg", "publishedAt": "2022-09-07T17:35:00Z", "content": "A novel imaging technique significantly improves the accuracy of the diagnosis of basal cell carcinoma (BCC) – the most frequent skin cancer – compared to clinical and dermoscopic examinations alone,… [+2645 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Pentagon suspends F-35 deliveries after discovering materials from China - POLITICO", "description": "The issue does not affect flight operations of F-35s already in service.", "url": "https://www.politico.com/news/2022/09/07/pentagon-suspends-f-35-deliveries-china-00055202", "urlToImage": "https://static.politico.com/01/fa/e535450a46b5b64a31e40b8c378a/us-military-f-35-crash-03406.jpg", "publishedAt": "2022-09-07T17:33:22Z", "content": "We have confirmed that the magnet does not transmit information or harm the integrity of the aircraft and there are no performance, quality, safety or security risks associated with this issue and fl… [+2138 chars]"}, {"source": {"id": null, "name": "Page Six"}, "author": "Riley Cardoza", "title": "Zac Efron finally addresses what caused his 2021 face transformation - Page Six", "description": "The actor’s mom, Starla Baskett, told him about the plastic surgery speculation he sparked last year after debuting “really, really big” jaw muscles.", "url": "https://pagesix.com/2022/09/07/zac-efron-finally-addresses-cause-of-2021-face-transformation/", "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2022/09/zac-efron-13.jpg?quality=75&strip=all&w=1200", "publishedAt": "2022-09-07T17:24:00Z", "content": "Zac Efron finally set the record straight on his face transformation one year after sparking plastic surgery rumors.\r\nThe actor told Men’s Health in his October 2022 cover story, published Wednesday,… [+2959 chars]"}]}