{"status": "ok", "totalResults": 430, "articles": [{"source": {"id": null, "name": "Indietoaster.com"}, "author": "Beatrice Moss", "title": "Space laser \"Megamaser\" spotted by South Africa telescope - The Indie Toaster", "description": "This massive laser is the most distant ever observed, 5 billion light-years from Earth. The light emitted by the space laser traveled 36 billion billion", "url": "https://www.indietoaster.com/space-laser-megamaser-spotted-by-south-africa-telescope/", "urlToImage": "", "publishedAt": "2022-04-15T14:33:24Z", "content": "This massive laser is the most distant ever observed, 5 billion light-years from Earth. The light emitted by the space laser traveled 36 billion billion miles (58 thousand billion kilometers) to reac… [+2308 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "SRH vs KKR Live Score, IPL 2022: Natarajan removes Venkatesh, Narine in same over; Kolkata suffer early blows - Hindustan Times", "description": "IPL 2022 Sunrisers Hyderabad vs Kolkata Knight Riders Live Score: Kane Williamson won the toss and elected to field against a rejigged Kolkata side featuring debutant Aaron Finch. Follow Live Updates of the SRH vs KKR Match Today at the Brabourne Stadium, Mum…", "url": "https://www.hindustantimes.com/cricket/srh-vs-kkr-live-score-ipl-2022-sunrisers-hyderabad-vs-kolkata-knight-riders-t20-match-25-live-updates-101650019024883.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/15/1600x900/462f66d6-ef7d-46a5-ac63-b70903929323_1650033062400_1650033073124.jpg", "publishedAt": "2022-04-15T14:31:26Z", "content": "SRH vs KKR Live Score: Kolkata Knight Riders squad\r\nShreyas Iyer (captain), Aaron Finch, Abhijeet Tomar, Ajinkya Rahane, Baba Indrajith, Nitish Rana, Pratham Singh, Rinku Singh, Ashok Sharma, Pat Cum… [+225 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Andrew Restuccia, Andrew Duehren", "title": "Biden to Nominate Michael Barr as Top Fed Banking Regulator - The Wall Street Journal", "description": "If confirmed, former Obama Treasury official would oversee the largest U.S. financial firms", "url": "https://www.wsj.com/articles/biden-to-nominate-michael-barr-as-top-fed-banking-regulator-11650013201", "urlToImage": "https://images.wsj.net/im-524842/social", "publishedAt": "2022-04-15T14:26:00Z", "content": "WASHINGTONPresident Biden will nominate Michael Barr, a former Treasury Department official, to serve as the Federal Reserves top banking regulator, the White House said, after Mr. Bidens first pick … [+295 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a>, <a href=\"/profiles/helen-regan\">Helen Regan</a>, Sana Noor Haq, Jack Bantock, <a href=\"/profiles/laura-smith-spark\">Laura Smith-Spark</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a> and Melissa Macaya, CNN", "title": "Live updates: Russia invades Ukraine, country braces for major Donbas offensive - CNN", "description": "Russian preparations continue in the east for an offensive operation, training additional units and gathering aviation forces, according to Ukraine's armed forces. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/ukraine-russia-putin-news-04-15-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414001151-mariupol-ukraine-burned-building-rivers-0412-super-tease.jpg", "publishedAt": "2022-04-15T14:23:00Z", "content": "A spokesperson for the Ukrainian Armed Forces in southern Ukraine suggested that Russian missile attacks in the south since Thursday night were in retaliation for the sinking of the Russian cruiser M… [+2023 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Hunters fear expedition's sunken truck is contaminating hunting grounds near Taloyoak, Nunavut - CBC.ca", "description": "Leaders of a hunters and trappers association in Taloyoak, Nunavut, fear an Arctic expedition truck that sank in one of their prime hunting grounds is contaminating animals that are known to migrate through the area — including beluga whales, narwhals, seals,…", "url": "https://www.cbc.ca/news/canada/north/contaminating-hunting-grounds-taloyoak-nunavut-1.6420657", "urlToImage": "https://i.cbc.ca/1.6402456.1648657818!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/truck-through-ice.jpg", "publishedAt": "2022-04-15T14:22:53Z", "content": "The manager of the hunters and trappers group in Taloyoak, Nunavut, says a truck sunk by an Arctic expedition in one of his community's prime hunting grounds feels like a \"stab in the back.\" \r\n\"We li… [+5738 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Apple iPhone 14 to have satellite connectivity for emergency situations - The Federal", "description": "Apple is planning to include satellite connectivity for emergency situations in iPhone 14, which it is expected to launch in June this year", "url": "https://thefederal.com/news/apple-iphone-14-to-have-satellite-connectivity-for-emergency-situations/", "urlToImage": "https://thefederal.com/wp-content/uploads/2021/09/iphone-1680360_1920.jpg", "publishedAt": "2022-04-15T14:21:12Z", "content": "Apple is planning to include satellite connectivity for emergency situations in iPhone 14, which the tech giant is expected to launch in June this year.\r\nAlthough, Apple is known for not revealing th… [+895 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Patrick Kingsley, Raja Abdulrahim", "title": "Jerusalem Calms Following Israeli-Palestinian Clashes: Latest News and Live Updates - The New York Times", "description": "Violence broke out at the Aqsa Mosque compound, known to Jews as the Temple Mount, in the morning on the first day of a rare convergence of Ramadan, Easter and Passover.", "url": "https://www.nytimes.com/live/2022/04/15/world/jerusalem-al-aqsa-mosque", "urlToImage": "https://static01.nyt.com/images/2022/04/15/world/15jerusalem-briefing-promo02/merlin_205512273_76eafc23-06cc-4997-b821-3b61466d7222-facebookJumbo.jpg", "publishedAt": "2022-04-15T14:13:37Z", "content": "Palestinians and the Israeli police clashing at the Aqsa Mosque compound in Jerusalem on Friday.Credit...Mahmoud Illean/Associated Press\r\nJERUSALEM The midday Muslim prayers at one of Jerusalems holi… [+4188 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jenn Selby", "title": "WHO monitors rise in cases of hepatitis in children across UK - The Guardian", "description": "Medical watchdog notified of cases of severe acute hepatitis after six children underwent liver transplants", "url": "https://amp.theguardian.com/society/2022/apr/15/who-monitors-rise-in-cases-of-hepatitis-in-children-across-uk", "urlToImage": null, "publishedAt": "2022-04-15T14:13:00Z", "content": "HealthMedical watchdog notified of cases of severe acute hepatitis after six children underwent liver transplants\r\nFri 15 Apr 2022 14.56 BST\r\nThe World Health Organization (WHO) is monitoring growing… [+2777 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Rebekah Valentine", "title": "Elden Ring's Player Messages Are the Most Fascinating Social Media Platform of 2022 - IGN - IGN", "description": "Since Elden Ring’s release, there’s been no shortage of critical praise for its intricately crafted yet expansive open world, its complex combat, and the level of detail found in every corner. But Elden Ring isn't just a superb video game in the many obvious …", "url": "https://www.ign.com/articles/elden-rings-player-messages-fascinating-social-media-platform-2022", "urlToImage": "https://assets-prd.ignimgs.com/2022/04/14/eldenring-messages-blogroll-1649970474538.jpg?width=1280", "publishedAt": "2022-04-15T14:07:05Z", "content": "Since Elden Rings release, theres been no shortage of critical praise for its intricately crafted yet expansive open world, its complex combat, and the level of detail found in every corner. But Elde… [+13687 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "https://www.theguardian.com/profile/joannawalters", "title": "Russia warns US to stop arming Ukraine – US politics live - The Guardian", "description": "Moscow sends Washington ‘formal diplomatic note’ as Psaki says Biden is not planning to go to Ukraine – follow the day’s news", "url": "https://www.theguardian.com/us-news/live/2022/apr/15/joe-biden-russia-ukraine-putin-us-politics-live-latest", "urlToImage": "https://i.guim.co.uk/img/media/3a62ab2126f9df55e4086a54d24aee1768bb6669/0_396_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=e8d9c6082e24c2ccc7fbd0abf354611c", "publishedAt": "2022-04-15T14:04:40Z", "content": "10.04United States warned by Russia to stop arming Ukraine\r\nAmid Russias ongoing attack on Ukraine and fresh US pledges to send more weapons to the embattled Ukrainians, Moscow has sent what is being… [+8549 chars]"}, {"source": {"id": null, "name": "NBCSports.com"}, "author": "Michael David Smith", "title": "Colts sign Stephon Gilmore - NBC Sports", "description": "The top available free agent has found his next team.Veteran cornerback Stephon Gilmore is signing with the Colts.Gilmore was the No. 18 player on our list of the NFL’s Top 100 free agents, and the highest-ranked player who wasn’t already spoken for. (Tyrann …", "url": "https://profootballtalk.nbcsports.com/2022/04/15/colts-sign-stephon-gilmore/", "urlToImage": "https://profootballtalk.nbcsports.com/wp-content/uploads/sites/25/2022/04/GettyImages-1277236370-e1650031375609.jpg", "publishedAt": "2022-04-15T14:03:00Z", "content": "The top available free agent has found his next team.\r\nVeteran cornerback Stephon Gilmore is signing with the Colts.\r\nGilmore was the No. 18 player on our list of the NFLs Top 100 free agents, and th… [+629 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Darren Boyle", "title": "Cost of living crisis: Ofgem threatens to fine energy companies if direct debits are too large - Daily Mail", "description": "Ofgem chief executive Jonathan Brearley, pictured, has warned energy firms the regulator will be more proactive in monitoring their activities to prevent consumers being ripped off.", "url": "https://www.dailymail.co.uk/news/article-10722047/Cost-living-crisis-Ofgem-threatens-fine-energy-companies-direct-debits-large.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/15/14/56652519-0-image-a-2_1650030019480.jpg", "publishedAt": "2022-04-15T13:49:12Z", "content": "Energy regulator Ofgem has warned gas and electricity suppliers that they could face fines and possibly losing their licences if they try to rip off consumers during the cost of living crisis. \r\nThe … [+4043 chars]"}, {"source": {"id": null, "name": "PCMag.com"}, "author": "Sascha Segan", "title": "Will the iPhone 14 Talk to Satellites? - PCMag", "description": "A new report has a more realistic take on last year's overheated 'satellite iPhone' drama.", "url": "https://www.pcmag.com/news/will-the-iphone-14-talk-to-satellites", "urlToImage": "https://i.pcmag.com/imagery/articles/058x62fBusAcIRkbbFAoxSg-1.fit_lim.size_1200x630.v1650027400.jpg", "publishedAt": "2022-04-15T13:48:20Z", "content": "The iPhone 14 may be able to send emergency SOS messages while in cellular dead zones by using satellite connectivity, according to a new report from Bloomberg's Mark Gurman.\r\nThis is a more reasonab… [+3139 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "IANS", "title": "NASA again calls off wet dress rehearsal of moon rocket over fuel leak - The Siasat Daily", "description": "Washington: NASA has for the third time halted Artemis 1 moon rocket's \"wet dress rehearsal\" - this time over fuel leak. Wet dress rehearsal is an opportunity to refine the countdown procedures and validate critical models and software interfaces. The test, e…", "url": "https://www.siasat.com/nasa-again-calls-off-wet-dress-rehearsal-of-moon-rocket-over-fuel-leak-2309456/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/03/NASA.jpg", "publishedAt": "2022-04-15T13:48:00Z", "content": "Washington: NASA has for the third time halted Artemis 1 moon rocket’s “wet dress rehearsal” – this time over fuel leak.\r\nWet dress rehearsal is an opportunity to refine the countdown procedures and … [+2588 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Study suggests Larsen A and B ice shelves collapsed due to atmospheric rivers - Phys.org", "description": "A team of researchers affiliated with multiple institutions across Europe has found evidence that suggests the collapse of the Larsen A and B ice shelves was due to the arrival of atmospheric rivers. In their paper published in the journal Communications Eart…", "url": "https://phys.org/news/2022-04-larsen-ice-shelves-collapsed-due.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/multiapproach-study-su.jpg", "publishedAt": "2022-04-15T13:47:59Z", "content": "A team of researchers affiliated with multiple institutions across Europe has found evidence that suggests the collapse of the Larsen A and B ice shelves was due to the arrival of atmospheric rivers.… [+2704 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Gabriel", "title": "FG in dialogue with abductors of Kaduna-Abuja train passengers – Lai Mohammed - Daily Post Nigeria", "description": "The Federal Government has opened a channel of discussion with terrorists who abducted passengers on a Kaduna-Abuja bound train in March. 2022. DAILY POST recalls that bandits attacked the train, killed eight persons and abducted scores. The bandits had threa…", "url": "https://dailypost.ng/2022/04/15/fg-in-dialogue-with-abductors-of-kaduna-abuja-train-passengers-lai-mohammed/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/06/Lai-Mohammed.jpg", "publishedAt": "2022-04-15T13:46:23Z", "content": "The Federal Government has opened a channel of discussion with terrorists who abducted passengers on a Kaduna-Abuja bound train in March. 2022.\r\nDAILY POST recalls that bandits attacked the train, ki… [+1111 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Astronomers detect powerful radiowave laser - CTV News", "description": "Astronomers have detected a powerful radiowave laser, known as a megamaser, in space. This record-breaking megamaser is the most distant one ever observed at 5 billion light-years away from Earth.", "url": "https://www.ctvnews.ca/sci-tech/powerful-megamaser-space-laser-spotted-by-south-african-telescope-1.5863370", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/4/15/megamaser-illustration-1-5863371-1650030009902.jpg", "publishedAt": "2022-04-15T13:40:07Z", "content": "Astronomers have detected a powerful radiowave laser, known as a megamaser, in space.\r\nThis record-breaking megamaser is the most distant one ever observed at 5 billion light-years away from Earth.\r\n… [+2530 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "South Africa flood toll nears 400 as rescuers search for missing - Guardian Nigeria", "description": "Police, army and volunteer rescuers on Friday widened the search for dozens still missing five days after the deadliest storm to strike South Africa's coastal city of Durban in living memory as the death toll", "url": "https://editor.guardian.ng/news/south-africa-flood-toll-nears-400-as-rescuers-search-for-missing/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/04/000_328D4GX-scaled.jpg", "publishedAt": "2022-04-15T13:38:00Z", "content": "Police, army and volunteer rescuers on Friday widened the search for dozens still missing five days after the deadliest storm to strike South Africa’s coastal city of Durban in living memory as the d… [+4040 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Matt Mathers", "title": "Rwanda plan will save UK money, minister insists - follow live - The Independent", "description": "Senior Tory says plan is ‘unworkable’ and will involve ‘astronomical costs’", "url": "https://www.independent.co.uk/news/uk/politics/boris-johnson-uk-politics-latest-b2058651.html", "urlToImage": "https://static.independent.co.uk/2022/04/15/00/6f60317671a5e4034177996042d64666Y29udGVudHNlYXJjaGFwaSwxNjUwMDYzODgz-2.66383188.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-04-15T13:35:04Z", "content": "Jeremy Clarksons beekeepers raising money to send 4x4s to Ukraine\r\nThe first 4x4 bought as part of a fundraising effort for Ukraine backed by Jeremy Clarkson has been delivered ahead of its journey t… [+561 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Adam Schreck", "title": "Russia loses warship, says attacks on Kyiv will increase - The Associated Press - en Español", "description": "KYIV, Ukraine (AP) — Russia’s Defense Ministry promised Friday to ramp up missile attacks on the Ukrainian capital in response to Ukraine’s alleged aggression on Russian territory, an ominous warning that followed Moscow's stinging symbolic loss of its  navy'…", "url": "https://apnews.com/article/russia-ukraine-zelenskyy-kyiv-business-black-sea-22d7279f32c15d4a7037a2195113fb57", "urlToImage": "https://storage.googleapis.com/afs-prod/media/4f7c5abf0ccb4bfc8be047e04d09d569/3000.jpeg", "publishedAt": "2022-04-15T13:30:00Z", "content": "KYIV, Ukraine (AP) Russias Defense Ministry promised Friday to ramp up missile attacks on the Ukrainian capital in response to Ukraines alleged aggression on Russian territory, an ominous warning tha… [+7841 chars]"}]}