{"status": "ok", "totalResults": 442, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "ASUS ROG Flow Z13: Unboxing The No-Nonsense Gaming Tablet - Lowyat TV", "description": "Announced back at the start of this year, the ASUS ROG Flow Z13 is perhaps what some would describe as the \"next step\" in thin and light gaming machines.Comp...", "url": "https://www.youtube.com/watch?v=knTbxePsJ08", "urlToImage": "https://i.ytimg.com/vi/knTbxePsJ08/hqdefault.jpg", "publishedAt": "2022-06-02T14:33:44Z", "content": null}, {"source": {"id": null, "name": "Sky.com"}, "author": "Alix Culbertson", "title": "Harry and Meghan spotted for first time at Jubilee celebrations - Sky News", "description": "", "url": "https://news.sky.com/story/harry-and-meghan-seen-for-first-time-at-jubilee-celebrations-12625946", "urlToImage": "https://e3.365dm.com/22/06/1600x900/skynews-prince-harr-meghan_5792138.jpg?20220602145143", "publishedAt": "2022-06-02T14:26:15Z", "content": "The Duke and Duchess of Sussex have been seen at the Platinum Jubilee celebrations in their first UK public appearance together since they quit as senior royals more than two years ago.\r\nThe royal co… [+2991 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Bears tighten grip - CNBCAfrica", "description": "Bearish sentiments continued in the Nigerian equities market this week, but the market performance year-to-date is still impressive at over 20 per cent. Feyi...", "url": "https://www.youtube.com/watch?v=fUReY22Ce2I", "urlToImage": "https://i.ytimg.com/vi/fUReY22Ce2I/maxresdefault.jpg", "publishedAt": "2022-06-02T14:20:10Z", "content": null}, {"source": {"id": null, "name": "The Times"}, "author": "Valentine Low, Neil Johnston, Peter Chappell, Henry Zeffman", "title": "Queen's Platinum Jubilee: Royal family watch flypast from Buckingham Palace balcony - The Times", "description": "Key momentsPrince Andrew tests positive for Covid and will miss St Paul’s jubilee serviceQueen watches flypast from Buckingham Palace balconyHarry and Meghan re", "url": "https://www.thetimes.co.uk/article/queen-platinum-jubilee-live-trooping-the-colour-balcony-beacons-lp558mg7q", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fdd6bbd04-e26f-11ec-baab-53d14c642149.jpg?crop=5238%2C2946%2C142%2C55&resize=1200", "publishedAt": "2022-06-02T14:15:00Z", "content": "The Queen has made her first appearance at the Platinum Jubilee celebrations as she came out on to the balcony of Buckingham Palace to watch the flypast of RAF planes.As the first British monarch to … [+16224 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "John Wagner, Eugene Scott", "title": "Post Politics Now: House Judiciary Committee poised to advance emergency gun measures - The Washington Post", "description": "The House package stands little chance in the evenly divided Senate. But Democrats are hoping to pressure Republicans to join them in taking some action in response to recent mass shootings.", "url": "https://www.washingtonpost.com/politics/2022/06/02/house-judiciary-emergency-gun-legislation/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/06-02-2022/t_0ed253b010414f41a3a3589b79f41305_name_2___1920x1080___24p_00_00_49_00_Still003.jpg&w=1440", "publishedAt": "2022-06-02T14:13:00Z", "content": "The House Judiciary Committee is poised Thursday to advance legislation billed as an emergency response to recent mass shootings, including the school massacre in Uvalde, Tex., that left 19 students … [+1133 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shimon Prokupecz, Evan Perez, Jason Hanna and Travis Caldwell, CNN", "title": "Assault-style weapon in deadly Tulsa medical facility shooting was bought that day, sources say - CNN", "description": "An assault-style weapon found at the scene of Wednesday's deadly shooting in an Oklahoma medical building had been bought that day, according to three federal sources briefed on the investigation.", "url": "https://www.cnn.com/2022/06/02/us/tulsa-hospital-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220601171921-05-tulsa-incident-0501-super-tease.jpg", "publishedAt": "2022-06-02T14:12:00Z", "content": "(CNN)An assault-style weapon found at the scene of Wednesday's deadly shooting in an Oklahoma medical building had been bought that day, according to three federal sources briefed on the investigatio… [+5744 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Ronald Adamolekun", "title": "JUST IN: Titan Trust Bank completes takeover of Union Bank - Premium Times", "description": "“With the completion of the transaction, TGI Group, parent of TTB, now becomes the majority shareholder and core investor in Union Bank.\"", "url": "https://www.premiumtimesng.com/news/headlines/534317-just-in-titan-trust-bank-completes-takeover-of-union-bank.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/03/1616156639511blob.png", "publishedAt": "2022-06-02T14:10:58Z", "content": "Titan Trust Bank Limited (TTB) has brought to closure the deal enabling it to purchase a controlling stake in Nigerias second-oldest lender, Union Bank of Nigeria, the latter said Thursday in a regul… [+1634 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Better understanding of people's comfort in urban public spaces - Phys.org", "description": "Comfortable urban public spaces play an important role in shaping healthy behaviors and raising well-being among citizens. Given the context of climate change, unplanned urbanization, and the worldwide air-borne pandemic, there is prominent concern about comf…", "url": "https://phys.org/news/2022-06-people-comfort-urban-spaces.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/city-park.jpg", "publishedAt": "2022-06-02T14:05:35Z", "content": "Comfortable urban public spaces play an important role in shaping healthy behaviors and raising well-being among citizens. Given the context of climate change, unplanned urbanization, and the worldwi… [+2740 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Singer KK May Have Had A Heart Disease: Sources - NDTV", "description": "The singer died while being taken to a hospital after a high-octane performance at a crowded Kolkata auditorium yesterday. Questions have been raised about the alleged lack of ventilation amid the extreme heat during the concert.", "url": "https://www.ndtv.com/india-news/singer-kk-might-have-had-underlying-heart-condition-that-caused-sudden-death-sources-3031270", "urlToImage": "https://c.ndtvimg.com/2022-06/7jhvedms_kk-kolkata-concert_625x300_01_June_22.jpg", "publishedAt": "2022-06-02T14:05:00Z", "content": "The preliminary autopsy report said the iconic singer died of a heart attack.\r\nMumbai: Singer KK's preliminary autopsy report has revealed he might have had underlying heart conditions that caused hi… [+3153 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kashmiri Pandits Protest, Threaten To Leave After Targeted Killings - NDTV", "description": "Hundreds of Kashmiri Pandits came out in Srinagar today in protest against targeted killings. Many of them, especially government employees from the Kashmiri Pandit community, have left the valley and the rest have threatened to migrate to Jammu.", "url": "https://www.ndtv.com/india-news/kashmiri-pandits-protest-threaten-to-leave-after-targeted-killings-3032631", "urlToImage": "https://c.ndtvimg.com/2022-06/4mc81lkg_kashmir-pandits-leaving-for-jammu-650_650x400_02_June_22.jpg", "publishedAt": "2022-06-02T14:04:00Z", "content": "Targeted killings of Kashmiri Pandits have raised a big concern over security (AFP)\r\nSrinagar: Hundreds of Kashmiri Pandits came out in Srinagar today in protest against targeted killings. Many of th… [+1732 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Musliudeen Adebayo", "title": "BREAKING: APC Presidential Primary: Tinubu, Sanwo-Olu, Ganduje others arrive Ibadan, meet Oyo delegates - Daily Post Nigeria", "description": "Former Governor of Lagos State, Bola Ahmed Tinubu, the incumbent, Babajide Sanwo-Olu and his counterparts from Kano State, Abdullahi Ganduje have arrived in Ibadan the Oyo State capital, as part of his electioneering campaign. Tinubu and supporters are said t…", "url": "https://dailypost.ng/2022/06/02/apc-presidential-primary-tinubu-sanwo-olu-ganduje-others-arrive-ibadan-meet-oyo-delegates/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/06/IMG_20220602_132940_823-2.jpg", "publishedAt": "2022-06-02T14:03:53Z", "content": "Former Governor of Lagos State, Bola Ahmed Tinubu, the incumbent, Babajide Sanwo-Olu and his counterparts from Kano State, Abdullahi Ganduje have arrived in Ibadan the Oyo State capital, as part of h… [+887 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "What can I do to boost my memory? | The Dose | CBC Podcasts - CBC.ca", "description": "There are plenty of ads for supplements that supposedly boost our memory. If you’re worried about memory loss, you might be tempted to give them a try. But how well do they work? Dr. Sandra Black, cognitive neurologist at Sunnybrook Health Sciences Centre, ha…", "url": "https://www.cbc.ca/listen/cbc-podcasts/410-the-dose/episode/15916363-what-can-i-do-to-boost-my-memory", "urlToImage": "https://www.cbc.ca/radio/podcasts/images/950x950/thedose-podcast-template.jpg", "publishedAt": "2022-06-02T14:03:24Z", "content": "© CBC/Radio-Canada 2022. All rights reserved."}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kenzi Devine", "title": "Paul McCartney pays tribute to the Queen with a throwback snap ahead of her Platinum Jubilee - Daily Mail", "description": "The 79-year-old has paid tribute to Her Majesty The Queen in a throwback snap, posting picture from 1996 at the royal opening of the Liverpool Institute for Performing Arts to his ⁣3.8million followers.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-10878711/Paul-McCartney-pays-tribute-Queen-throwback-snap-ahead-Platinum-Jubilee.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/02/14/58597007-0-image-a-53_1654177142516.jpg", "publishedAt": "2022-06-02T14:01:41Z", "content": "Paul McCartney has paid tribute to Her Majesty The Queen in a throwback snap, posting to his 3.8million Instagram followers on Thursday.\r\nThe 79-year-old Beatles star posted a snap of him and Her Maj… [+2163 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Lukus Herblet", "title": "Everything in Pokemon Scarlet and Violet's June reveal trailer - Sportskeeda", "description": "Fans across the globe recently received a brand new trailer for Pokemon Scarlet and Violet.", "url": "https://www.sportskeeda.com/pokemon/everything-pokemon-scarlet-violet-s-june-reveal-trailer", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/06/c555a-16541042991457-1920.jpg", "publishedAt": "2022-06-02T13:59:05Z", "content": "Fans across the globe recently received a brand new trailer for Pokemon Scarlet and Violet. In this new video for the title, some of the early-game Pokemon and a few other big reveals were presented … [+2723 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Kristina Maralit", "title": "Lift public health emergency – Concepcion - The Manila Times", "description": "WITH the United States' Centers for Disease Control and Prevention (CDC) putting the Philippines under its lowest travel-risk classification, the government must now consider...", "url": "https://www.manilatimes.net/2022/06/03/news/national/lift-public-health-emergency-concepcion/1845918", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/06/02/76867.jpg", "publishedAt": "2022-06-02T13:43:25Z", "content": "WITH the United States' Centers for Disease Control and Prevention (CDC) putting the Philippines under its lowest travel-risk classification, the government must now consider lifting the state of pub… [+3433 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Cameron Faulkner", "title": "Amazon's new way to sell PS5s starts with an invitation - The Verge", "description": "Amazon has debuted an invite system for people who want a chance to purchase a $499.99 PlayStation 5 gaming console. If you’re chosen, you’ll receive an e-mail with a link to buy one without having to compete with shoppers.", "url": "https://www.theverge.com/2022/6/2/23151466/playstation-5-ps5-invite-amazon-buy-restock", "urlToImage": "https://cdn.vox-cdn.com/thumbor/m95_8IUIZ7cVe5zZkFUaeoh4H8o=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22015295/vpavic_4278_20201030_0041.jpg", "publishedAt": "2022-06-02T13:42:06Z", "content": "It should have always been this easy\r\nIf you buy something from a Verge link, Vox Media may earn a commission. See our ethics statement.\r\nPhoto by Vjeran Pavic / The Verge\r\nAmazon is offering a new a… [+1344 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "John Leicester", "title": "Russia warns West of weapons repercussions, pounds Ukraine - The Associated Press", "description": "KYIV, Ukraine (AP) — Britain pledged Thursday to send sophisticated medium-range rocket systems to Ukraine, joining the United States and Germany in equipping the embattled nation with advanced weapons for shooting down aircraft and knocking out artillery.", "url": "https://apnews.com/article/russia-ukraine-kyiv-government-and-politics-moscow-61ef29e1911bf2e38a19a6110e764e09", "urlToImage": "https://storage.googleapis.com/afs-prod/media/75465ea5d85f401ca327bbbbfb1710e1/3000.jpeg", "publishedAt": "2022-06-02T13:41:15Z", "content": "KYIV, Ukraine (AP) Britain pledged Thursday to send sophisticated medium-range rocket systems to Ukraine, joining the United States and Germany in equipping the embattled nation with advanced weapons… [+7501 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Prince Harry and Meghan not joining the Queen on the balcony: Heres why - Geo News", "description": "Meghan and Harry did not make any attempt to steal the Queen's show during the first day of Platinum Jubilee celebrations", "url": "https://www.geo.tv/latest/420402-prince-harry-and-meghan-not-joining-the-queen-on-the-balcony-heres-why", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2022-06-02/420402_064219_updates.jpg", "publishedAt": "2022-06-02T13:40:00Z", "content": "Queen Elizabeth II has emerged onto the Buckingham Palace balcony once more for Trooping the Colour, but Prince Harry and Meghan Markle did not appear alongside the monarch.\r\nIt was announced that th… [+861 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "Darryn Bonthuys", "title": "Ubisoft Won't Have A Not-E3 Event Until Later This Year - GameSpot", "description": "Don't expect to see Ubisoft sharing the spotlight this month, as it'll be holding an event later this year instead.", "url": "https://www.gamespot.com/articles/ubisoft-wont-have-a-not-e3-event-until-later-this-year/1100-6504052/", "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1601/16018044/3984847-ubisoftforward.jpg", "publishedAt": "2022-06-02T13:33:20Z", "content": "June is shaping up to be the most informative month on the gaming calendar, but don't expect Ubisoft to be joining the dozens of studios and publishers who'll be taking part in Not-E3 month.\r\nWhile t… [+1026 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Matthew Taylor", "title": "Climate activists vow to fight as new gasfield gets go-ahead in North Sea - The Guardian", "description": "Environmentalists threaten legal action over UK permit for Shell to develop Jackdaw field", "url": "https://amp.theguardian.com/environment/2022/jun/02/jackdaw-uk-new-gas-field-shell-north-sea-climate", "urlToImage": null, "publishedAt": "2022-06-02T13:30:00Z", "content": "GasEnvironmentalists threaten legal action over UK permit for Shell to develop Jackdaw field\r\nEnvironmentalists are threatening legal action in an attempt to halt the development of a new gasfield in… [+4688 chars]"}]}