{"status": "ok", "totalResults": 450, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Gamble", "title": "Slovakia vs Spain LIVE: Euro 2020 latest score, goals and updates from fixture today - The Independent", "description": "Follow live coverage with Spain needing a victory to guarantee their progress into the knockout stages", "url": "https://www.independent.co.uk/sport/football/slovakia-spain-live-stream-euro-2020-b1871303.html", "urlToImage": "https://static.independent.co.uk/2021/06/23/17/newFile-15.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-06-23T16:41:01Z", "content": "Spain's finishing practice ahead of decisive game vs Slovakia\r\nFollow live coverage with Spain in last-chance saloon territory at Euro 2020 knowing they need a win against Slovakia to guarantee thems… [+5435 chars]"}, {"source": {"id": null, "name": "Pakistanchristian.tv"}, "author": "Sigmund Shepherd", "title": "Discovery of tectonic masses on Venus - Pakistan Christian TV", "description": "Venus may be the hottest planet in our solar system, but new evidence suggests it may have much in common with Earth. According to the \"Science Alert\"", "url": "https://www.pakistanchristian.tv/discovery-of-tectonic-masses-on-venus/", "urlToImage": null, "publishedAt": "2021-06-23T16:32:01Z", "content": "Venus may be the hottest planet in our solar system, but new evidence suggests it may have much in common with Earth.\r\nAccording to the “Science Alert” website, scientists have found evidence that th… [+1370 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Hair salons, gyms, restaurants can reopen in Manitoba on Saturday - CBC.ca", "description": "Many Manitoba businesses will be able to open at increased capacity, including restaurants, gyms and hair salons, and fully vaccinated people will be able to visit personal care homes starting Saturday as the province takes its next steps in its reopening pla…", "url": "https://www.cbc.ca/news/canada/manitoba/manitoba-reopening-plan-announcement-1.6076768", "urlToImage": "https://i.cbc.ca/1.6076841.1624462923!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-19-lockdown-in-winnipeg-may.jpg", "publishedAt": "2021-06-23T16:27:05Z", "content": "Many Manitoba businesses will be able to open at increased capacity, including restaurants, gyms and hair salons, and fully vaccinated people will be able to visit personal care homes starting Saturd… [+2473 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "MARCA English", "title": "Euro 2020 LIVE: Latest news and build-up to Portugal vs France and Germany vs Hungary - MARCA.com", "description": "Hello everyone and welcome to this Wednesday&apos;s Euro 2020 live blog. We have four fixtures this Wednesday - Sweden vs Poland, Slovakia vs Spain, Portugal vs France and Germany", "url": "https://www.marca.com/en/football/uefa-euro/2021/06/23/60d31db322601db8348b4680.html", "urlToImage": "https://phantom-marca.unidadeditorial.es/f761a867b8cb0cf3db6fd6400c3538b8/resize/1200/f/jpg/assets/multimedia/imagenes/2021/06/23/16244476947177.jpg", "publishedAt": "2021-06-23T16:26:49Z", "content": "Hello everyone and welcome to this Wednesday's Euro 2020 live blog. We have four fixtures this Wednesday - Sweden vs Poland, Slovakia vs Spain, Portugal vs France and Germany vs Hungary - which get u… [+2491 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Bernadette E. Tamayo", "title": "Sotto, Lacson suspect face shield policy 'lobbying' - The Manila Times", "description": "SENATE President Vicente 'Tito' Sotto 3rd and Sen. Panfilo Lacson said they suspected that some influential businessmen have lobbied with the government not to lift the wearing of...", "url": "https://www.manilatimes.net/2021/06/24/news/national/sotto-lacson-suspect-face-shield-policy-lobbying/1804390", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/06/24/5393.jpg", "publishedAt": "2021-06-23T16:23:10Z", "content": "SENATE President Vicente \"Tito\" Sotto 3rd and Sen. Panfilo Lacson said they suspected that some influential businessmen have lobbied with the government not to lift the wearing of face shield policy … [+2697 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jordan Novet", "title": "What to expect from Microsoft's next version of Windows - CNBC", "description": "A build of an operating system named Windows 11 offers hints of what Microsoft could show Thursday when it talks about what's next for its PC operating system.", "url": "https://www.cnbc.com/2021/06/23/windows-11-what-to-expect.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106901172-1624408705315-gettyimages-491551484-MS_WINDOWS_10.jpeg?v=1624408857", "publishedAt": "2021-06-23T16:05:43Z", "content": "Satya Nadella, chief executive officer of Microsoft Corp., speaks during the Windows 10 Devices event in New York on Oct. 6, 2015. Microsoft Corp. introduced its first-ever laptop, three Lumia phones… [+5099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Devan Cole, CNN", "title": "Supreme Court sides with high school cheerleader who cursed online - CNN ", "description": "The Supreme Court ruled in favor of a former high school cheerleader who argued that she could not be punished by her public school for posting a profanity-laced caption on Snapchat when she was off school grounds.", "url": "https://www.cnn.com/2021/06/23/politics/supreme-court-first-amendment-cheerleader/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210427112307-brandi-levy-super-tease.jpg", "publishedAt": "2021-06-23T16:03:00Z", "content": null}, {"source": {"id": null, "name": "Thehealthsite.com"}, "author": "Arushi Bidhuri", "title": "Amid The Covid Pandemic, Experts Caution People Against Swine Flu As Cases Of H1NI Rise - TheHealthSite", "description": "Studies have shown that Covid reinfection is rare and experts have cautioned people to check for swine flu in case they experience symptoms of the virus.", "url": "https://www.thehealthsite.com/news/amid-the-covid-pandemic-experts-caution-people-against-swine-flu-as-cases-of-h1ni-rise-821594/", "urlToImage": "https://st1.thehealthsite.com/wp-content/uploads/2021/06/swine-flu-655x353.jpg", "publishedAt": "2021-06-23T16:00:28Z", "content": "In the midst of the continuing Covid-19 outbreak in Mumbai, cases of influenza H1N1 or swine flu is being reported in the city yet again. Last year, the city witnessed the same problem as swine flu c… [+3054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Halasz, Zahra Ullah, Niamh Kennedy, Anna Chernova, Rob Picheta and Brad Lendon, CNN", "title": "Russia says it fired warning shots on British warship but UK denies the claim - CNN ", "description": "A British naval warship became embroiled in a confrontation with Russian forces off the coast of the disputed territory of Crimea on Wednesday.", "url": "https://www.cnn.com/2021/06/23/europe/russia-warning-shots-hms-defender-uk-denial-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210623093620-hms-defender-0618-super-tease.jpg", "publishedAt": "2021-06-23T16:00:00Z", "content": null}, {"source": {"id": null, "name": "Global News"}, "author": "Alex Cooke", "title": "Protesters continue to shut down N.S.-N.B. border over modified self-isolation rules - Global News", "description": "People have blocked Highway 104 near the Nova Scotia-New Brunswick border in protest of Nova Scotia's new self-isolation rules for the neighbouring province.", "url": "https://globalnews.ca/news/7973361/protesters-continue-to-shut-down-n-s-n-b-border-over-modified-self-isolation-rules/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/06/border1.png?w=720&h=379&crop=1", "publishedAt": "2021-06-23T15:58:27Z", "content": "Nova Scotia Premier Iain Rankin is holding a media availability Wednesday afternoon, where he’s expected to address the ongoing blockade at the Nova Scotia-New Brunswick border in response to the pro… [+6302 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Asian elephants do more than just trumpet -- they buzz their lips to squeak: The animals' sound production does not only come from the trunk - Science Daily", "description": "Communication is crucial for elephants that live in complex multi-tiered social systems. Apart from their iconic trumpets uttered through the trunk, Asian elephants also produce species-specific squeaks by buzzing their lips. This demonstrates once again the …", "url": "https://www.sciencedaily.com/releases/2021/06/210623113829.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-06-23T15:55:56Z", "content": "Communication is crucial for elephants that live in complex multi-tiered social systems. Apart from their iconic trumpets uttered through the trunk, Asian elephants also produce species-specific sque… [+2713 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Epstein-Barr virus reactivation may be the cause of long COVID symptoms - News-Medical.Net", "description": "Epstein-Barr virus (EBV) reactivation resulting from the inflammatory response to coronavirus infection may be the cause of previously unexplained long COVID symptoms -- such as fatigue, brain fog, and rashes -- that occur in approximately 30% of patients aft…", "url": "https://www.news-medical.net/news/20210623/Epstein-Barr-virus-reactivation-may-be-the-cause-of-long-COVID-symptoms.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Antibody-620x480.jpg", "publishedAt": "2021-06-23T15:45:00Z", "content": "Epstein-Barr virus (EBV) reactivation resulting from the inflammatory response to coronavirus infection may be the cause of previously unexplained long COVID symptoms -- such as fatigue, brain fog, a… [+3005 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ian Sample", "title": "Scientists identify 29 planets where aliens could observe Earth - The Guardian", "description": "Astronomers estimate 29 habitable planets are positioned to see Earth transit and intercept human broadcasts", "url": "https://amp.theguardian.com/science/2021/jun/23/scientists-identify-29-planets-where-aliens-could-observe-earth", "urlToImage": null, "publishedAt": "2021-06-23T15:37:00Z", "content": "AstronomyAstronomers estimate 29 habitable planets are positioned to see Earth transit and intercept human broadcasts\r\nFor centuries, Earthlings have gazed at the heavens and wondered about life amon… [+4572 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "COVID-19: UK reports 16,135 new cases - highest number of daily infections since 6 February - Sky News", "description": "This is the highest number of daily infections since 6 February when 18,262 were announced.", "url": "https://news.sky.com/story/covid-19-uk-reports-16-135-new-cases-and-another-19-deaths-12340010", "urlToImage": "https://e3.365dm.com/21/06/1600x900/skynews-covid-19-coronavirus_5425027.jpg?20210623143335", "publishedAt": "2021-06-23T15:33:45Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "High drama during parliamentary panel meet on vaccine development, several BJP MPs walk out - The Indian Express", "description": "When several opposition MPs expressed their desire to ask questions about the Centre's vaccination policy such as increasing the gap between two doses, the BJP MPs strongly opposed it and few of them even demanded postponement of the meeting and walked out, t…", "url": "https://indianexpress.com/article/india/parliamentary-panel-meet-on-vaccine-development-bjp-mps-walkout-7372700/", "urlToImage": "https://images.indianexpress.com/2021/06/Jairam-Ramesh-1.jpg", "publishedAt": "2021-06-23T15:33:33Z", "content": "A parliamentary panel meeting on the issue of vaccine development witnessed high drama on Wednesday as several BJP MPs walked out of it asserting that this is not the appropriate time to discuss the … [+1878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "10,066 New Covid Cases In Maharashtra, Nearly 1,500 Higher Than Tuesday - NDTV", "description": "Maharashtra has reported a spike in coronavirus cases today -- days after experts had warned about this possibility in view of the public disregard for Covid safety norms as the unlock process continued in the state.", "url": "https://www.ndtv.com/india-news/10-066-new-covid-cases-in-maharashtra-in-24-hours-nearly-1-500-higher-than-tuesday-2470891", "urlToImage": "https://c.ndtvimg.com/2021-06/91s73u6g_maharashtra-unlock_625x300_07_June_21.jpg", "publishedAt": "2021-06-23T15:32:29Z", "content": "Nearly 10,066 new Covid cases have been recorded in Maharashtra in 24 hours.\r\nCoronavirus cases have started an upward march in Maharashtra, days after experts warned about this possibility in view o… [+1603 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/jon-fingas", "title": "This could be Samsung's first Wear OS Galaxy Watch - Engadget", "description": "A leak purports to show the Galaxy Watch Active 4, which might be Samsung's first smartwatch using the new Wear OS..", "url": "https://www.engadget.com/samsung-galaxy-watch-active-4-wear-os-leak-152254285.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-06/553d1860-d433-11eb-95fb-a777364b2dc7", "publishedAt": "2021-06-23T15:25:22Z", "content": "You might not have to wait long to see the first Samsung smartwatch using the reworked Wear OS. The Vergereports that OnLeaks and GizNext have published renders of what they say is the Galaxy Watch A… [+1080 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Travis Clark", "title": "'Mass Effect' director says TV better for game adaptions than movies - Business Insider", "description": "Mac Walters, the project director for \"Mass Effect: Legendary Edition,\" thinks TV is the best fit for games adaptations.", "url": "https://www.businessinsider.com/mass-effect-director-on-rise-of-video-game-tv-shows-2021-6", "urlToImage": "https://i.insider.com/60d3432545ef6f00183a611a?width=1200&format=jpeg", "publishedAt": "2021-06-23T15:25:05Z", "content": "The anticipated video game \"Mass Effect: Legendary Edition,\" developed by BioWare and published by its parent company Electronic Arts, was released last month, collecting the original three games of … [+3161 chars]"}, {"source": {"id": null, "name": "GIVEMESPORT"}, "author": "Nathan Linley", "title": "Battlefield 2042: Leaker reveals at least seven more trailers impending - GIVEMESPORT", "description": "Battlefield 2042: Leaker reveals at least seven more trailers impending", "url": "https://www.givemesport.com/1711413-battlefield-2042-leaker-reveals-at-least-seven-more-trailers-impending", "urlToImage": "https://site-cdn.givemesport.com/images/21/06/23/b57fb269a036d4081828622459e08f9b/960.jpg", "publishedAt": "2021-06-23T15:20:51Z", "content": "Battlefield 2042 could be releasing more content in the lead up to its expected release before the end of the year, leakers have revealed.\r\nThe mass warfare game will be taking a giant leap into the … [+1743 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "2nd dose COVID-19 vaccination rates rising in Northwestern Health Unit area - CBC.ca", "description": "Close to half — 46 per cent — of those over the age of 18 in the health unit's area have received their second shot of a COVID-19 vaccine.", "url": "https://www.cbc.ca/news/canada/thunder-bay/northwestern-health-unit-vaccination-rates-1.6076745", "urlToImage": "https://i.cbc.ca/1.6063333.1623960568!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-ns-20210603.jpg", "publishedAt": "2021-06-23T15:20:46Z", "content": "The Northwestern Health Unit has one of the highest second-dose rates for COVID-19 vaccinations in Ontario.Close to half 46 per cent of those over the age of 18 in the health unit's area have receive… [+1328 chars]"}]}