{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": null, "name": "Gothamist"}, "author": "https://gothamist.com/staff/jon-campbell, https://gothamist.com/staff/ramsey-khalifeh", "title": "Did New Jersey fumble congestion pricing negotiations? - Gothamist", "description": "A federal judge allowed the MTA to turn on its congestion pricing tolls Sunday, even though New York and New Jersey failed to come to a settlement in a lawsuit that aimed to halt the program.", "url": "https://gothamist.com/news/did-new-jersey-fumble-congestion-pricing-negotiations", "urlToImage": "https://api-prod.gothamist.com/images/349134/fill-1200x650|format-webp|webpquality-85/", "publishedAt": "2025-01-11T13:58:00Z", "content": "This column originally appeared inOn The Way,a weekly newsletter covering everything you need to know about NYC-area transportation.\r\nSign upto get the full version, which includes answers to reader … [+6627 chars]"}, {"source": {"id": null, "name": "KTLA Los Angeles"}, "author": "Austin Turner", "title": "Palisades Fire shifts targets to San Fernando Valley, forcing new evacuation warnings for Saturday - KTLA Los Angeles", "description": "The Palisades Fire, already one of the most destructive natural disasters in the history of Los Angeles, made a significant and sharp turn toward one of the city’s major population centers late Friday night. After burning the iconic Pacific Palisades neighbor…", "url": "https://ktla.com/news/california/wildfires/palisades-fire-shifts-targets-to-san-fernando-valley-forcing-new-evacuation-warnings-for-saturday/", "urlToImage": "https://ktla.com/wp-content/uploads/sites/4/2025/01/snapshot-13-1.jpg?w=1280", "publishedAt": "2025-01-11T13:55:57Z", "content": "The Palisades Fire, already one of the most destructive natural disasters in the history of Los Angeles, made a significant and sharp turn toward one of the city’s major population centers late Frida… [+2575 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI World Desk", "title": "Major outrage over Harry-Meghan's visit to LA fire victims: 'You are not royals...merely two nitwit celeb - The Times of India", "description": "Meghan Markle and Harry wore hats apparently to keep a low profile -- with their face not fully revealing as they met the Eaton Fire victims. Meghan w", "url": "https://timesofindia.indiatimes.com/world/us/major-outrage-over-harry-meghans-visit-to-la-fire-victims-you-are-not-royals-merely-two-nitwit-celebrities/articleshow/117148945.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-117148960,width-1070,height-580,imgsize-601120,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2025-01-11T12:09:00Z", "content": null}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Spacecraft Captures Spectacularly Detailed Images of Mercury’s Hidden Surface - Gizmodo", "description": "The BepiColombo mission successfully completed its sixth flyby of the innermost planet, moving closer to its final goal of entering its orbit.", "url": "https://gizmodo.com/spacecraft-captures-spectacularly-detailed-images-of-mercurys-hidden-surface-2000548169", "urlToImage": "https://gizmodo.com/app/uploads/2025/01/Best_images_from_BepiColombo_s_sixth_Mercury_flyby.jpg", "publishedAt": "2025-01-11T12:00:48Z", "content": "Europe and Japan’s BepiColombo beamed back close-up images of the solar system’s innermost planet, flying through Mercury’s shadow to peer directly onto craters that are permanently hidden in the sha… [+3332 chars]"}, {"source": {"id": null, "name": "WGHP FOX 8 Greensboro"}, "author": "Emily Byrd, Dolan Reynolds, Justyn Araya DeBusk, Charles Ewing, Alex Schneider, Brayden Stamps", "title": "Live Updates: Winter storm covers a frozen Piedmont Triad in snow, ice - WGHP FOX8 Greensboro", "description": "(WGHP) — The snow appears to have come to an end but the effects of the winter storm are just beginning in the Piedmont Triad. A Hazardous Weather Outlook is in place in the Piedmont Triad and most of central North Carolina. A Winter Storm Warning went into e…", "url": "https://myfox8.com/weather/forecast/live-updates-winter-storm-covers-a-frozen-piedmont-triad-in-snow-ice/", "urlToImage": "https://myfox8.com/wp-content/uploads/sites/17/2025/01/Snow2.gif?w=1280", "publishedAt": "2025-01-11T10:59:22Z", "content": "(WGHP) The snow appears to have come to an end but the effects of the winter storm are just beginning in the Piedmont Triad.\r\nA Hazardous Weather Outlook is in place in the Piedmont Triad and most of… [+2704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De la Fuente", "title": "‘I’ve not wept or wailed like that in several years,’ says Lakers coach JJ Redick after losing his home in the Palisades fire - CNN", "description": "Los Angeles Lakers head coach JJ Redick lamented losing “things that you can’t replace” as he described the pain of seeing his rental home burned down in the Pacific Palisades wildfire.", "url": "https://www.cnn.com/2025/01/11/sport/jj-redick-pacific-palisades-fire-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25010757440104.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-11T10:29:00Z", "content": "Los Angeles Lakers head coach JJ Redick lamented losing things that you cant replace as he described the pain of seeing his rental home burned down in the Pacific Palisades wildfire.\r\nSpeaking to rep… [+3075 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Caroline Frost", "title": "Meta and Amazon Axe Diversity Initiatives Ahead Of Trump’s White House Return - Deadline", "description": "In a memo to staff, Meta cited “a shifting legal and policy landscape\" for the decision.", "url": "http://deadline.com/2025/01/meta-amazon-axe-diversity-initiatives-ahead-of-donald-trump-white-house-return-1236254480/", "urlToImage": "https://deadline.com/wp-content/uploads/2025/01/GettyImages-2019207157.jpg?w=1024", "publishedAt": "2025-01-11T10:26:00Z", "content": "Meta and Amazon are both axing their diversity programs, adding their names to a growing list of firms across corporate America making similar moves in anticipation of Donald Trump’s return to the Wh… [+1757 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Evidence of Life on Mars? NASA’s Bold Strategy to Recover the Proof - SciTechDaily", "description": "NASA unveils a groundbreaking approach to bring Martian rock samples back to Earth by 2026, introducing competition between two strategic plans to enhance cost-efficiency and spark innovation. These Martian samples could revolutionize our understanding of Mar…", "url": "https://scitechdaily.com/evidence-of-life-on-mars-nasas-bold-strategy-to-recover-the-proof/", "urlToImage": "https://scitechdaily.com/images/Multiple-Robots-NASA-Mars-Sample-Return-Mission-scaled.jpg", "publishedAt": "2025-01-11T09:13:46Z", "content": "This illustration shows a concept for multiple robots that would team up to ferry to Earth samples collected from the Mars surface by NASA’s Mars Perseverance rover. Credit: NASA/JPL-Caltech\r\nNASA un… [+4330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy", "title": "Yes, a TikTok ban is closer than ever. No, your app probably won’t just disappear - CNN", "description": "There are a lot of lingering questions about how the ban would work in practice because there’s no precedent for the US government blocking such a major social media platform. But some things are clear, including the fact that TikTok won’t suddenly disappear …", "url": "https://www.cnn.com/2025/01/11/tech/tiktok-ban-what-next/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2192579267.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-11T09:00:00Z", "content": "TikToks fate in the United States is now in the hands of the Supreme Court. And things are not looking good for the app.\r\nThe Supreme Court on Friday heard oral arguments over the law that could ban … [+6072 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gawon Bae, Chris Lau", "title": "‘Black boxes’ from crashed South Korean plane stopped recording about four minutes before disaster, officials say - CNN", "description": "Flight recorders from the passenger jet that crashed in South Korea last month, killing more than 170 people, stopped working minutes before the plane belly-landed and exploded on the runway, investigators said Saturday.", "url": "https://www.cnn.com/2025/01/11/asia/south-korean-airline-black-boxes-stopped-recording-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2025-01-11t052804z-193009803-rc2kzba5fob6-rtrmadp-3-southkorea-crash-jejuair.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-11T08:25:00Z", "content": "Flight recorders from the passenger jet that crashed in South Korea last month, killing more than 170 people, stopped working minutes before the plane belly-landed and exploded on the runway, investi… [+2315 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joshua Partlow", "title": "‘No one has a home’: What fire took from one California neighborhood - The Washington Post", "description": "The mind-bending scale of residential ruin from the Los Angeles fires is slowly coming into focus — particularly in Altadena, a tight-knit community where as many as 7,000 structures burned.", "url": "https://www.washingtonpost.com/weather/2025/01/10/eaton-fire-altadena-los-angeles-destruction/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GHIOZEXEE5MZS3SVQSUEWLUSH4.JPG&w=1440", "publishedAt": "2025-01-11T07:38:07Z", "content": "ALTADENA, Calif. Maral Nazarian has been waking at night thinking about what she could have saved.\r\nFamily passports. Important files. The toddler art of her two grown daughters. The 59-year-old trav… [+7893 chars]"}, {"source": {"id": null, "name": "Heat.com"}, "author": "Michael Kelly | The Associated Press", "title": "Nikola Jokic, Russell Westbrook make triple-double history in Nuggets' victory - NBA.Com", "description": "Denver’s Nikola Jokić and Russell Westbrook become the 1st pair of teammates in NBA history to record a triple-double in the same game multiple times in a single season.", "url": "https://www.nba.com/news/jokic-westbrook-triple-double-history", "urlToImage": "https://cdn.nba.com/manage/2025/01/jokic-westbrook.jpg", "publishedAt": "2025-01-11T06:18:27Z", "content": "Nikola Joki erupts for 35 points, 15 assists and 12 rebounds while Russell Westbrook posts 25 points, 11 rebounds and 10 assists.\r\n Get NBA League Pass TODAY\r\nDENVER (AP) Denvers Nikola Joki and Russ… [+2046 chars]"}, {"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Carly Thomas", "title": "Jennifer Garner Shares “Guilt” After She “Lost a Friend” in L.A. Wildfires - Hollywood Reporter", "description": "The actress was volunteering alongside World Central Kitchen founder José Andrés on Friday to feed those who evacuated due to the fires.", "url": "http://www.hollywoodreporter.com/news/general-news/jennifer-garner-lost-friend-la-palisades-wildfires-1236106974/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/01/Jennifer-Garner-getty-H-2024.png?w=1296&h=730&crop=1", "publishedAt": "2025-01-11T06:07:36Z", "content": "Jennifer Garner has shared that she “lost a friend” in the devastating wildfires continuing to ravage Los Angeles.\r\nThe actress, who was volunteering alongside World Central Kitchen founder José Andr… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Samiran Mishra", "title": "Los Angeles Fires, Limited Hydrants And A Catch-22 Situation In California - NDTV", "description": "As crews battled devastating wildfires across Los Angeles, a major challenge emerged: fire hydrants in some areas ran dry, and low water pressure hampered efforts to contain the blaze.", "url": "https://www.ndtv.com/world-news/los-angeles-wildfire-la-wildfire-california-wildfire-explained-why-hydrants-ran-dry-during-deadly-los-angeles-wildfires-7448282", "urlToImage": "https://c.ndtvimg.com/2025-01/k9anncn8_los-angeles-fire-afp-_625x300_11_January_25.jpeg", "publishedAt": "2025-01-11T05:06:50Z", "content": "New Delhi: As crews battled devastating wildfires across Los Angeles, a major challenge emerged: fire hydrants in some areas ran dry, and low water pressure hampered efforts to contain the blaze. \r\nA… [+3478 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Julian Lee", "title": "Why Biden’s Farewell Russian Oil Trade Sanctions Are a Big Deal - Bloomberg", "description": "The US on Friday announced the most sweeping and aggressive sanctions yet on Russia’s oil trade, just ten days before Joe Biden leaves the White House to be replaced by Donald Trump as president.", "url": "https://www.bloomberg.com/news/articles/2025-01-10/why-biden-s-farewell-sanctions-on-russian-oil-are-a-big-deal", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ib34ZjV5Bsx4/v1/1200x800.jpg", "publishedAt": "2025-01-11T05:00:00Z", "content": "The US on Friday announced the most sweeping and aggressive sanctions yet on Russias oil trade, just ten days before Joe Biden leaves the White House to be replaced by Donald Trump as president. \r\nIf… [+152 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Trump wants to take Greenland: Four ways this saga could go - BBC.com", "description": "The BBC investigates possible scenarios for the huge Arctic territory's future as the US president-elect talks about taking control of it.", "url": "https://www.bbc.com/news/articles/cwy3y8l8nwlo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9a89/live/2e8fc320-cff7-11ef-9fd6-0be88a764111.jpg", "publishedAt": "2025-01-11T04:58:41Z", "content": "Donald Trump's son Donald Jr recently visited Greenland\r\nIn recent weeks, US President-elect Donald Trump has shown renewed interest in taking control of Greenland, a largely autonomous territory of … [+6355 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": "Connor Smith, Karishma Vanjani, Giulia Petroni, Dow Jones Newswires, Sabrina Escobar, Megan Leonhardt, Brian Swint", "title": "Dow Falls About 700 Points After Jobs Report Sends Yields Spiking Again - Barron's", "description": "The Dow, the S&P 500, and the Nasdaq Composite fell Friday as the stock market digested a strong December jobs report.", "url": "https://www.barrons.com/livecoverage/stock-market-today-011025", "urlToImage": "https://images.barrons.com/im-783602/social", "publishedAt": "2025-01-11T04:06:44Z", "content": "The stock market entered the final hour of trading on Friday deep in a hole in the wake of a too-hot December jobs report.\r\nThe Dow was down 640 points, or 1.5%. The S&amp;P 500 was down 1.3%. The Na… [+840 chars]"}, {"source": {"id": null, "name": "11Alive.com WXIA"}, "author": "Addie Haney", "title": "Can you drive in Atlanta now? Here's what to know about current road conditions - 11Alive.com WXIA", "description": "11Alive is monitoring current road conditions below.", "url": "https://www.11alive.com/article/traffic/current-road-conditions-metro-atlanta/85-8d001ac2-7c15-4f6f-bc96-98768b3cb2c6", "urlToImage": "https://media.11alive.com/assets/WXIA/images/68cadb2a-27db-4f24-a89e-b180b649a016/20250109T041327/68cadb2a-27db-4f24-a89e-b180b649a016_1140x641.jpg", "publishedAt": "2025-01-11T00:39:00Z", "content": "ATLANTA After widespread wintry precipitation fell across metro Atlanta Friday, the concern now turns to that moisture freezing onto roads and bridges, setting up for a messy Saturday morning for dri… [+1698 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "NICHOLAS RICCARDI, MICHAEL R. BLOOD", "title": "LA Mayor Karen Bass faces critical leadership test as questions emerge about wildfire response - The Associated Press", "description": "Los Angeles Mayor Karen Bass is facing withering criticism for her response to the firestorm ravaging her city. Bass was part of a White House delegation to Ghana when the fires erupted and had to fly back on military aircraft. She landed more than 24 hours a…", "url": "https://apnews.com/article/mayor-karen-bass-la-fires-leadership-99e52cf69cc656ee7e0328c6b609be74", "urlToImage": "https://dims.apnews.com/dims4/default/2b697b4/2147483647/strip/true/crop/4000x2250+0+287/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F73%2F0e%2F755efacfe776be5411e42f573d47%2F86f422ddcdff4b16b0a05670bb470320", "publishedAt": "2025-01-11T00:03:00Z", "content": "LOS ANGELES (AP) Earlier this week, as hurricane-strength winds blew through bone-dry hillside subdivisions, Los Angeles saw its worst nightmare realized as long-predicted firestorms engulfed wide sw… [+7368 chars]"}, {"source": {"id": null, "name": "Page Six"}, "author": "Bernie Zilio", "title": "Tom Holland’s dad beams while confirming Zendaya engagement, spills secrets about proposal - Page Six", "description": "The “well-prepared” actor “had purchased a ring,” “spoken with her father and gained permission to propose to his daughter,” Dominic Holland shared.", "url": "https://pagesix.com/2025/01/10/celebrity-news/tom-hollands-dad-confirms-zendaya-engagement-spills-secrets-about-proposal/", "urlToImage": "https://pagesix.com/wp-content/uploads/sites/3/2025/01/96520041.jpg?quality=75&strip=all&w=1024", "publishedAt": "2025-01-10T23:42:00Z", "content": "Tom Holland’s dad is spilling the beans.\r\nDominic Holland confirmed in his latest Patreon blog post, “That engagement,” that his eldest son proposed to Zendaya.\r\n“I expect amongst my Patrons are jour… [+5161 chars]"}]}