{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Anubhav Mukherjee", "title": "Maruti Suzuki will continue efforts in low-cost car segment; budget buyers in focus | Company Business News - Mint", "description": "Maruti Suzuki India will continue to put efforts into manufacturing low-cost small cars for budget-concerned buyers, said RC Bhargava, Chairman of Maruti Suzuki India, Moneycontrol reported it first.", "url": "https://www.livemint.com/companies/news/maruti-suzuki-will-continue-efforts-in-low-cost-car-segment-budget-buyers-in-focus-report-11722771297406.html", "urlToImage": "https://images.livemint.com/img/2024/08/04/1600x900/2-0-258245183-oped-0_1680672478255_1722774863685.jpg", "publishedAt": "2024-08-04T13:19:38Z", "content": "India's small car segment market continues to become smaller in the passenger vehicle industry. Maruti Suzuki India will continue to put efforts into manufacturing low-cost small cars for budget-conc… [+2706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "Open war between Uddhav Thackeray, Devendra Fadnavis hits a new low as it reaches a pre-poll flashpoint - The Indian Express", "description": "The latest round of verbal duel between friends-turned-foes seems to have been triggered by Anil Deshmukh’s allegations that he was “coerced into implicating Uddhav and Aaditya in false cases by Fadnavis”", "url": "https://indianexpress.com/article/political-pulse/uddhav-thackeray-devendra-fadnavis-open-war-maharashtra-elections-9494512/", "urlToImage": "https://images.indianexpress.com/2024/08/devendra-fadnavis-uddhav-thackeray.jpg", "publishedAt": "2024-08-04T11:34:05Z", "content": "With the Maharashtra Assembly polls round the corner, the rivalry between former friends, Shiv Sena (UBT) president Uddhav Thackeray and senior BJP leader and Deputy Chief Minister Devendra Fadnavis,… [+3616 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Prasad", "title": "Sony PlayStation Portal launched in India - GSMArena.com news - GSMArena.com", "description": "Plays all your installed PS5 and PS4 games over the home network. Sony has finally launched the PlayStation Portal in India, about nine months after its...", "url": "https://www.gsmarena.com/sony_playstation_portal_launched_in_india-news-63980.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/24/08/ps-portal-india/-952x498w6/gsmarena_001.jpg", "publishedAt": "2024-08-04T01:21:02Z", "content": "Sony has finally launched the PlayStation Portal in India, about nine months after its launch in the US. If you think that's late, it's pretty much par for the course for Sony India as it always laun… [+1154 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "SBI's profits in 4 years higher than previous 64; stock not priced right by investors: Chairman Dinesh Kha - The Economic Times", "description": "Dinesh Kumar Khara, the outgoing chairman of the State Bank of India (SBI), stated that under his leadership, the bank's net profits over the past four years have significantly surpassed the cumulative profits of the previous 64 years. Despite this financial …", "url": "https://economictimes.indiatimes.com/industry/banking/finance/banking/sbis-profits-in-4-years-higher-than-previous-64-stock-not-priced-right-by-investors-chairman-dinesh-khara/articleshow/112250108.cms", "urlToImage": "https://img.etimg.com/thumb/msid-112250405,width-1200,height-630,imgsize-83374,overlay-economictimes/photo.jpg", "publishedAt": "2024-08-03T14:17:30Z", "content": "Mumbai: Outgoing SBI chairman Dinesh Kumar Khara on Saturday said the country's largest lender's net profits in the past four years under him have been higher than the cumulative figures for 64 years… [+2054 chars]"}]}