{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Sandip Das", "title": "Stock Market Today: Top 10 things to know before the market opens today - Moneycontrol", "description": "Stock Market News: Trends in SGX Nifty indicate a negative opening for the broader index in India with a loss of 80 points.", "url": "https://www.moneycontrol.com/news/business/markets/stock-market-today-top-10-things-to-know-before-the-market-opens-today-96-9358651.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/11/BSE_Sensex-e1542611342127-770x433.jpg", "publishedAt": "2022-10-20T01:35:09Z", "content": "The market is expected to open in the red as trends in SGX Nifty indicate a negative opening for the broader index in India with a loss of 80 points.\r\nThe BSE Sensex climbed nearly 150 points to 59,1… [+5643 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Puts On Hold India, US' Move At UN To Blacklist Hafiz Saeed's Son - NDTV", "description": "China on Wednesday put a hold on a proposal by India and the US at the United Nations to blacklist Pakistan-based terrorist Hafiz Talah Saeed, the son of Lashkar-e-Taiba chief Hafiz Saeed, in the second such move within two days.", "url": "https://www.ndtv.com/india-news/china-puts-on-hold-india-us-move-at-un-to-blacklist-hafiz-saeeds-son-hafiz-talha-saeed-3447268", "urlToImage": "https://c.ndtvimg.com/2019-07/5256cmsg_hafiz-saeed-reuters_650x400_17_July_19.jpg", "publishedAt": "2022-10-19T18:29:39Z", "content": "It is the second time in less than two days that Beijing put a hold on the bid submitted by India, US\r\nUnited Nations: China on Wednesday put a hold on a proposal by India and the US at the United Na… [+7070 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "Leave Ukraine, India tells its citizens as Russia steps up missile strikes - Hindustan Times", "description": "The Indian advisory on Thursday followed one issued on October 10 that only urged Indians to avoid all non-essential travel to and within Ukraine. On Thursday, New Delhi asked all citizens to leave by available means | Latest News India", "url": "https://www.hindustantimes.com/india-news/leave-ukraine-india-tells-its-citizens-as-russia-steps-up-missile-strikes-101666199763703.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/19/1600x900/890e08a0-4fd1-11ed-8a59-5e5f37abaae9_1666201439460.jpg", "publishedAt": "2022-10-19T17:16:03Z", "content": "NEW DELHI: India on Wednesday advised its nationals in Ukraine to leave the country at the earliest following a deterioration in the security situation and an escalation in hostilities.\r\nThe advisory… [+3114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One ignored a pain, the other a knot: Breast cancer survivors on what not to ignore - The Indian Express", "description": "‘Women above 40, especially those with a family history of cancer, should go for a mammogram, once every two or three years. This is the Indian recommendation. In America, they do it once a year. We do not want to expose our bodies to unnecessary radiation be…", "url": "https://indianexpress.com/article/lifestyle/health-specials/one-ignored-a-pain-the-other-a-knot-breast-cancer-survivors-on-what-not-to-ignore-8219240/", "urlToImage": "https://images.indianexpress.com/2022/10/Max-Breast-Cancer-Awareness-1.jpeg", "publishedAt": "2022-10-19T13:46:40Z", "content": "Back in 1995, 66-year-old Sucheta Sachdev did not do what she asks women to do now. A guide in a breast cancer support group, she talks of her journey 27 years ago. I had an excruciating pain in my r… [+5025 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Can Impact Pakistan's Visit To India For The World Cup\": PCB Responds To Jay Shah's Asia Cup In Neu.. - NDTV Sports", "description": "In it's statement PCB mentioned that it was \"surprised and disappointed\" at the comments made by Mr Shah and that such a step could impact Pakistan's participation in the upcoming ICC Cricket World Cup in India in 2023.", "url": "https://sports.ndtv.com/cricket/can-impact-pakistans-visit-to-india-for-the-world-cup-pcb-responds-to-jay-shahs-asia-cup-in-neutral-venue-comment-3445123", "urlToImage": "https://c.ndtvimg.com/2021-05/j4o5ec48_jay-shah-bcci_650x400_04_May_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-10-19T13:35:00Z", "content": "The Pakistan Cricket Board on Wednesday issued a strong statement in response to Asia Cricket Council president Jay Shah's comments on Tuesday about the possibility of shifting the 2023 Asia Cup out … [+2286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Congress presidential polls over, focus back on Rajasthan: What will Kharge do? - The Indian Express", "description": "Congress insiders say Rajasthan issue “still open”, party yet to take a call on Ashok Gehlot-Sachin Pilot divide.", "url": "https://indianexpress.com/article/political-pulse/new-congress-president-in-place-focus-back-on-rajasthan-what-will-kharge-do-8218992/", "urlToImage": "https://images.indianexpress.com/2022/10/ashok-gehlot-2.jpg", "publishedAt": "2022-10-19T12:51:23Z", "content": "The high-decibel election for the Congress presidency is over. And now the focus will now be back on Rajasthan. New Congress president Mallikarjun Kharge and the senior leadership will have to take a… [+2986 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Cyclone Sitrang to Form over West-Central Bay of Bengal By October 24, Per IMD; To Throw a Diwali Dampener on East India - The Weather Channel", "description": "The forecasting models are yet to agree on where and when the cyclone will make landfall.", "url": "https://weather.com/en-IN/india/news/news/2022-10-19-cyclone-sitrang-to-form-over-bay-of-bengal-by-october-24-diwali", "urlToImage": "https://s.w-x.co/in-cyclone_9.jpg", "publishedAt": "2022-10-19T12:39:54Z", "content": "Wednesday, October 19\r\n: As India gears up for the auspicious festival of Diwali to celebrate the victory of light over darkness, dark clouds, heavy rains and stormy conditions look set to approach t… [+1656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Apple cuts production of iPhone 14 Plus | Technology News - The Indian Express", "description": "Apple told at least one manufacturer in China to immediately halt production of iPhone 14 Plus components.", "url": "https://indianexpress.com/article/technology/mobile-tabs/apple-iphone-14-plus-production-8218893/", "urlToImage": "https://images.indianexpress.com/2022/10/Apple-iPhone-12-Plus.jpeg", "publishedAt": "2022-10-19T11:44:48Z", "content": "Apple Inc is cutting production of iPhone 14 Plus within weeks of starting shipments as it re-evaluates demand for the mid-range model, the Information reported on Tuesday, citing two people involved… [+911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Researchers at IIT-Delhi develop Covid virus-like particles to further develop vaccine treatment - The Indian Express", "description": "Virus-like particles or VLPs are molecular mimics that look and act like a certain virus without being infectious.", "url": "https://indianexpress.com/article/cities/delhi/researchers-iit-delhi-covid-virus-like-particles-further-develop-vaccine-treatment-8217539/", "urlToImage": "https://images.indianexpress.com/2022/10/iit-delhi-1.jpg", "publishedAt": "2022-10-19T05:02:37Z", "content": "Researchers at IIT-Delhi have developed Covid virus-like particles (VLPs), which they say are a possible vaccine candidate against the virus.Vaccines offer a great deal of protection against the viru… [+1924 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Divya Bhati", "title": "Tech Tips: How to transfer your WhatsApp data from Android to iOS or vice versa - India Today", "description": "If you are changing your smartphone from Android to iPhone or either way, then you cannot get access to WhatsApp backup saved in your Google Drive or Apple Cloud. Here is a step-by-step guide to transfer your WhatsApp data if you change to a new smartphone OS.", "url": "https://www.indiatoday.in/technology/tech-tips/story/transfer-whatsapp-data-from-iphone-to-android-ios-data-transfer-2287102-2022-10-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/whatsapp_3-sixteen_nine.jpg?VersionId=AAO6Ga_Jm7u2kHK6GUPCJkjrjuO5F2PK", "publishedAt": "2022-10-19T04:18:52Z", "content": "By Divya Bhati: Getting a new smartphone is always tempting. You go to the store and buy a new gadget and get our hands on the latest tech and features. Even data transferring from your old device to… [+2460 chars]"}]}