{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "7 habits that improve bone health in kids - The Times of India", "description": "This title suggests that there is information available about the health of children's bones that goes beyond the commonly known sources of milk and supplements. The description will likely cover alternative ways to promote strong bones in children. It may in…", "url": "https://timesofindia.indiatimes.com/videos/lifestyle/health-fitness/7-habits-that-improve-bone-health-in-kids/videoshow/111960467.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-111960467,imgsize-866092.cms", "publishedAt": "2024-07-23T10:57:15Z", "content": "Your Privacy\r\nWe process your data to deliver content or advertisements and measure the delivery of such content or advertisements to extract insights about our website. We share this information wit… [+2411 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Vivo V40 Pro appears on Geekbench and Bluetooth SIG ahead of India launch: Here’s what to expect - HT Tech", "description": "Vivo is set to launch its V40 series in India. The Vivo V40 Pro recently appeared on Geekbench and Bluetooth SIG, revealing key specifications ahead of its debut.", "url": "https://tech.hindustantimes.com/mobile/news/vivo-v40-pro-appears-on-geekbench-and-bluetooth-sig-ahead-of-india-launch-here-s-what-to-expect-71721715819320.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/23/1600x900/Vivo_V40_Pro_appears_on_Geekbench_and_Bluetooth_SI_1721716113508_1721716113730.PNG", "publishedAt": "2024-07-23T06:31:40Z", "content": "Vivo is preparing to introduce its V40 series in India, a successor to the V30 lineup. The new series is anticipated to include the Vivo V40 and Vivo V40 Pro models. Recent findings by Mysmartprice s… [+2625 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Mishra3", "title": "Explore the Cosmos: A summer road trip with Nasa's Chandra and Webb - The Times of India", "description": "The tour begins with Rho Ophiuchi, about 390 light-years away. This nearby star-forming region features a mix of gas and stars. Chandra's X-rays, shown in purple, highlight young stars, while Webb's infrared data in various colors reveal intricate gas and dus…", "url": "https://timesofindia.indiatimes.com/science/explore-the-cosmos-a-summer-road-trip-with-nasas-chandra-and-webb/photostory/111921417.cms", "urlToImage": "https://static.toiimg.com/photo/111921558.cms", "publishedAt": "2024-07-22T09:25:22Z", "content": "Your Privacy\r\nWhen you visit our website, we store cookies on your browser to collect information. The information collected might relate to you, your preferences or your device, and is mostly used t… [+2093 chars]"}]}