{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Air India to hire over 5,100 cabin crew, pilots after record aircraft deal - Hindustan Times", "description": "The announcement comes close on the heels of the carrier placing an order to buy 470 aircraft from Boeing and Airbus under deals potentially worth tens of billions of dollars.", "url": "https://www.hindustantimes.com/business/air-india-to-hire-over-5-100-cabin-crew-pilots-after-record-aircraft-deal-101677239842890.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/02/24/1600x900/air_india_hiring_pilots_cabin_crew_1677240022670_1677240022840_1677240022840.jpg", "publishedAt": "2023-02-24T12:23:01Z", "content": "Air India on Friday announced its plan to hire over 4,200 cabin crew trainees and 900 pilots this year as the airline expands its domestic and international operations. The cabin crew will undergo a … [+1434 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Silky Skin Skin Tag Remover Reviews: Scam or Legit Mole & Skin Tag Corrector Serum? - The Tribune India", "description": "We often consider skin tags and moles harmless, especially when minor and not bothersome. However, these growths can sometimes be indicative of more serious underlying issues. There are a variety of skincare serums available that can diminish the appearance o…", "url": "https://www.tribuneindia.com/news/brand-connect/silky-skin-skin-tag-remover-reviews-scam-or-legit-mole-skin-tag-corrector-serum-482489", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/2/2023_2$largeimg_1494173541.jpg", "publishedAt": "2023-02-23T15:08:00Z", "content": "We often consider skin tags and moles harmless, especially when minor and not bothersome. However, these growths can sometimes be indicative of more serious underlying issues. There are a variety of … [+6666 chars]"}]}