{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Johnny Depp Wins Libel Case Against Amber Heard, Gets $15 Million in damages; Courtroom Memes; More - India Today", "description": "Johnny Depp News Today: Johnny Depp breathed a sigh of relief after winning the defamation lawsuit against ex-wife Amber Heard. The six-week-long trial saw m...", "url": "https://www.youtube.com/watch?v=d-djLt057HI", "urlToImage": "https://i.ytimg.com/vi/d-djLt057HI/maxresdefault.jpg", "publishedAt": "2022-06-06T12:18:10Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bharat Sharma", "title": "This Ancient Molecule Is The Root Cause Of All Life On Earth... And Mars! - Indiatimes.com", "description": "Could life on Earth and Mars have originated from similar components? Scientists have found some evidence of the same in a giant breakthrough for questions about life's origin on Earth.According to scientists at the Foundation for Applied Molecular Evolution,…", "url": "https://www.indiatimes.com/technology/science-and-future/molecule-life-on-earth-and-mars-571487.html", "urlToImage": "https://im.indiatimes.in/content/2022/Jun/33_629ded56ee167.jpg", "publishedAt": "2022-06-06T12:02:16Z", "content": "Could life on Earth and Mars have originated from similar components? Scientists have found some evidence of the same in a giant breakthrough for questions about life's origin on Earth.\r\nAccording to… [+2126 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "7 food tips for thyroid patients for weight loss - Times of India", "description": "You will be alarmed to know that 1 in every 10 Indians suffer from hypothyroidism. Here are some food tips that people with hypothyroidism can follow for maintaining a healthy and fit body.", "url": "https://timesofindia.indiatimes.com/life-style/food-news/7-food-tips-for-thyroid-patients-for-weight-loss/photostory/92037570.cms", "urlToImage": "https://static.toiimg.com/photo/92037788.cms", "publishedAt": "2022-06-06T11:30:00Z", "content": "Iodine is one such mineral that helps in stimulating the thyroid gland to function properly. When the body doesn’t receive enough iodine, it leads to an under-active or overactive thyroid gland. As p… [+297 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "LIC's Flop Show Continues, Shares Hit New Low, Valuation Dives: 5 Points - NDTV Profit", "description": "Shares of Life Insurance Corporation of India (LIC), the country's biggest insurer and largest domestic financial investor, plunged 2.86 per cent to settle at record closing low of Rs 777.40. The stock touched an all-time intraday low of Rs 775.40 on the BSE …", "url": "https://www.ndtv.com/business/lics-flop-show-continues-shares-hit-new-low-valuation-dives-5-points-3042511", "urlToImage": "https://c.ndtvimg.com/2022-02/cttm1th8_lic-new_625x300_14_February_22.jpg", "publishedAt": "2022-06-06T10:41:10Z", "content": "<li>The slump has dragged LIC's market capitalisation below Rs 5 lakh crore for the first time. The market capitalisation of LIC fell to Rs 4.91 lakh crore on Monday. At the issue price of Rs 949, LI… [+800 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "How to stop monkeypox? WHO expert lists key measures - India Today", "description": "Monkeypox, which spreads through close contact and was first found in monkeys, has been detected in around 30 countries where it is not endemic, with over 780 confirmed cases.", "url": "https://www.indiatoday.in/science/story/how-to-stop-monkeypox-who-expert-lists-key-measures-1959022-2022-06-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Monkeypox_a-647x363.jpeg?15sN5tQDBaxg4p2aoSw6nqtQyUXJjX2Z", "publishedAt": "2022-06-06T10:35:03Z", "content": "The monkeypox virus has been reported in around 30 countries where the infection is not endemic in what is the biggest outbreak of the virus. More than 780 confirmed or suspected infections of the vi… [+2574 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "UP Police release photos of 40 'rioters' in Kanpur violence case - India Today", "description": "The police have released a grid of 40 alleged rioters and announced that the identities of people who share any information will be protected.", "url": "https://www.indiatoday.in/india/story/up-police-release-photos-40-rioters-kanpur-violence-1959019-2022-06-06", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202206/Kanpur-647x363-647x363.jpeg?nXxZPkQ.HuBpdF4s2MSYnSPZrL_w6s3t", "publishedAt": "2022-06-06T10:29:25Z", "content": "The Kanpur Police has released the pictures of 40 men after scouring through hours of CCTV and video footage in connection with the clashes and stone pelting reported from the city last Friday. The p… [+1757 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "‘Nupur Sharma, Naveen Jindal not original creators of Islamophobia’: Chidambaram - Hindustan Times", "description": "The BJP has suspended its national spokesperson Sharma and expelled its Delhi media head Naveen Kumar Jindal as the row over their remarks against the Prophet escalated with protests from some Muslim countries. | Latest News India", "url": "https://www.hindustantimes.com/india-news/nupur-sharma-naveen-jindal-not-original-creators-of-islamophobia-chidambaram-101654509420938.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/06/1600x900/Nupur-Sharma-BJP-media-chief-Naveen_1654509704234_1654509724066.jpg", "publishedAt": "2022-06-06T10:06:49Z", "content": "Senior Congress leader P Chidambaram on Monday joined the battery of Opposition leaders to criticise the Centre over the recent controversial remarks on Prophet Mohammed by BJP leaders Nupur Sharma a… [+2853 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sheikh Saaliq", "title": "Muslim nations slam India over insulting remarks about Islam - The Associated Press - en Español", "description": "NEW DELHI (AP) — India is facing major diplomatic outrage from Muslim-majority countries after top officials in the governing Hindu nationalist party made derogatory references to Islam and the Prophet Muhammad, drawing accusations of blasphemy across some Ar…", "url": "https://apnews.com/article/afghanistan-middle-east-india-new-delhi-pakistan-364cd94bd3b9895be5a4857f68262a9d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/e3b3dd07f213455dba8d421977eeacea/3000.jpeg", "publishedAt": "2022-06-06T09:56:15Z", "content": "NEW DELHI (AP) India is facing major diplomatic outrage from Muslim-majority countries after top officials in the governing Hindu nationalist party made derogatory references to Islam and the Prophet… [+5640 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "CCTV footage showing two boys taking selfies seconds after Sidhu Moosewala left his house under scanner - The Tribune India", "description": "Police are probing a video footage that shows Punjabi singer Sidhu Moosewala leaving his house on May 29 sometime before he was shot dead by unidentified men.", "url": "https://www.tribuneindia.com/news/punjab/cctv-shows-man-who-took-selfie-with-sidhu-moosewala-before-his-killing-calling-up-shooters-police-401500", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/6/2022_6$largeimg_1050675053.jpg", "publishedAt": "2022-06-06T09:31:00Z", "content": "The Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and i… [+505 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "FP Trending", "title": "Here are 5 Indian superfoods you must add to your diet - Firstpost", "description": "Many might not be aware of superfoods that can aid our health and give us an instant boost. These items are a rich source of several vitamins, mineral and other nutrients and help boost our immunity levels", "url": "https://www.firstpost.com/living/here-are-5-indian-superfoods-you-must-add-to-your-diet-10764441.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/GettyImages-1188654262-1-e1654507350225.jpg", "publishedAt": "2022-06-06T09:24:37Z", "content": "Many might not be aware of superfoods that can aid our health and give us an instant boost. These items are a rich source of several vitamins, mineral and other nutrients and help boost our immunity … [+2182 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "etimes.in", "title": "Bobby Deol, Sunny Deol rubbish reports of dad Dharmendra getting hospitalized; confirm he's at home and ' - Times of India", "description": "Actor Bobby Deol, who is making a lot of noise with his recently released series, 'Aashram 3', has reacted to the r", "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/bobby-deol-rubbishes-reports-of-dad-dharmendra-getting-hospitalized-confirms-hes-at-home-and-recovering-well/articleshow/92035534.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-92035516,width-1070,height-580,overlay-toi_sw,pt-32,y_pad-40,resizemode-75,imgsize-64188/92035516.jpg", "publishedAt": "2022-06-06T09:21:00Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: How COVID impacts bone health; Key symptoms to look out - Times of India", "description": "COVID has an impact on each and every body organ from which the disease-causing virus, the coronavirus, enters the body through the receptors that facilitate its entry. Though it is seen as a respiratory tract infection, its impact is seen on almost every bod…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-how-covid-impacts-bone-health-key-symptoms-to-look-out/photostory/92033344.cms", "urlToImage": "https://static.toiimg.com/photo/92033460.cms", "publishedAt": "2022-06-06T08:30:00Z", "content": "Bone issues are treatable only if the symptoms are traced early. This will help arrest the progress of the disease and ensure proper treatment is given to the patient.\r\nThe common symptoms of bone is… [+332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live: Schools in Maharashtra to reopen on June 15 with Covid-appropriate measures, masks not mandatory: Minister - The Indian Express", "description": "Mumbai news live: \"New SOPs will be issued to schools. Further decision to be taken in accordance with the situation,\" State School Education Minister Varsha Gaikwad said.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-updates-weather-rains-ncb-traffic-covid-7954694/", "urlToImage": "https://images.indianexpress.com/2020/12/Varsha-Gaikwad.jpg", "publishedAt": "2022-06-06T08:24:33Z", "content": "ON SUNDAY, the test positivity rate (TPR) the number of positive cases out of the total tests conducted stood at 11 per cent in Mumbai with 961 new Covid-19 cases identified out of the 8,778 conducte… [+586 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "Rupam Jain, Saurabh Sharma", "title": "India rushes to quell outrage after insulting remarks on Islam - The Star Online", "description": "MUMBAI (Reuters) -     India's government sought on Monday to calm anger at home and abroad after two officials of the ruling BJP party made remarks about the Prophet Mohammed, with 38 people arrested for rioting in a northern city and a protest planned later…", "url": "https://www.thestar.com.my/news/world/2022/06/06/india-rushes-to-quell-outrage-after-insulting-remarks-on-islam", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/06/06/1612709.jpg", "publishedAt": "2022-06-06T08:04:00Z", "content": "MUMBAI (Reuters) - India's government sought on Monday to calm anger at home and abroad after two officials of the ruling BJP party made remarks about the Prophet Mohammed, with 38 people arrested fo… [+1924 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of California Irvine: UCI-led astronomy team finds evidence of galactic metal shrouded in dust - India Education Diary", "description": "A thorough understanding of galaxy evolution depends in part on an accurate measurement of the abundance of metals in the intergalactic medium – the space between stars – but dust can impede observations in optical wavelengths. An international team", "url": "https://indiaeducationdiary.in/university-of-california-irvine-uci-led-astronomy-team-finds-evidence-of-galactic-metal-shrouded-in-dust/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-California-Irvine.png", "publishedAt": "2022-06-06T08:03:22Z", "content": "A thorough understanding of galaxy evolution depends in part on an accurate measurement of the abundance of metals in the intergalactic medium the space between stars but dust can impede observations… [+5042 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Md Waquar Haider", "title": "WhatsApp to add another verification code to prevent fraud: Check details - BGR India", "description": "According to WABetaInfo the “Double Verification Code” feature will reportedly show up another step of verification code when you are trying to log into your WhatsApp account from another smartphone.", "url": "https://www.bgr.in/apps/whatsapp-security-update-whatsapp-to-add-another-verification-code-to-prevent-fraud-1280088/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2022/06/WhatsApp-2.jpg", "publishedAt": "2022-06-06T07:34:10Z", "content": "WhatsApp is reportedly planning to introduce some important changes when logging into an account. In particular, the company is now working on a new feature that adds an extra layer of security befor… [+1829 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "God has gifted me pace and that's bringing me the love of people around India: Umran Malik - The Indian Express", "description": "Umran Malik is easily the fastest bowler to emerge from India in recent years. His 150 kph-plus deliveries during the recent Indian Premier League have left both fans and experts in awe.", "url": "https://indianexpress.com/article/idea-exchange/umran-malik-at-idea-exchange-bowling-team-india-cricket-7954574/", "urlToImage": "https://images.indianexpress.com/2022/06/umran-malik.jpg", "publishedAt": "2022-06-06T06:44:06Z", "content": "The countrys latest pace sensation Umran Malik talks about his first full IPL season with Sunrisers Hyderabad, his family, his early years in Jammu &amp; Kashmir,and his love for fast bowling. This s… [+16028 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Indian government in the eye of a diplomatic storm after hate remarks about Prophet - ABC News", "description": "Iran, Qatar and Kuwait summon the countries' Indian ambassadors, to lodge protests after remarks made by India's ruling party spokeswoman about the Prophet Mohammed.", "url": "https://www.abc.net.au/news/2022-06-06/india-bjp-suspends-official-over-hate-remarks-against-prophet/101129752", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2e9b811c328a178adafc497fa63d49e9?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=17&width=862&height=485", "publishedAt": "2022-06-06T06:34:55Z", "content": "India's ruling Bharatiya Janata Party (BJP) has suspended its spokeswoman, Nupur Sharma, after comments she made during a TV debate about the Prophet Mohammed.\r\nKey points:\r\n<ul><li>Several Muslim co… [+2615 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "As Rafael Nadal Clinches 14th French Open Title, Wasim Jaffer's Tweet Is The Winner - NDTV Sports", "description": "While social media was flooded with congratulatory messages for the 22-time Grand Slam champion, former India batter Wasim Jaffer also praised Rafael Nadal in his own witty style.", "url": "https://sports.ndtv.com/french-open-2022/as-rafael-nadal-clinches-14th-french-open-title-wasim-jaffers-tweet-is-the-winner-3041573", "urlToImage": "https://c.ndtvimg.com/2022-06/57vn8tlg_rafael-nadal-afp_625x300_05_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T06:26:31Z", "content": "Rafael Nadal made it 14 wins from as many finals at Roland Garros after he defeated eight seed Norwegian Casper Ruud in the French Open men's singles final on Sunday. After taking the first two sets … [+1516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple WWDC 2022 LIVE Updates: iOS 16, macOS 13, AR/VR and everything else - The Indian Express", "description": "Apple Worldwide Developers Conference 2022, Apple WWDC 2022 Live Streaming: Apple WWDC 2022 kicks off today. Follow our live blog for all the top announcements on iOS 16, macOS 13, new MacBook Air and more.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-wwdc-2022-keynote-event-live-updates-7954757/", "urlToImage": "https://images.indianexpress.com/2022/06/Apple_WWDC_2022_LIVE.jpg", "publishedAt": "2022-06-06T06:25:36Z", "content": "Apple's big keynote will start at 10.30 pm IST. According to Bloomberg, Apple will introduce some key features for iOS 16, including the ability to customise the lock screen further. Apple previously… [+1190 chars]"}]}