{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": null, "title": "UK hands sovereignty of Chagos Islands to Mauritius - BBC.com", "description": "In a historic move, the UK gives up sovereignty of a strategic group of islands in the Indian Ocean.", "url": "https://www.bbc.com/news/articles/c98ynejg4l5o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/ec2d/live/c7e10970-819c-11ef-b732-9d507d15282c.jpg", "publishedAt": "2024-10-03T15:23:54Z", "content": "The UK has announced it is giving up sovereignty of a remote but strategically important cluster of islands in the Indian Ocean after more than half a century.\r\nThe deal reached after years of negoti… [+7560 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Google taps India’s love for gold to boost its credit play - TechCrunch", "description": "Google is leveraging India's deep-rooted affinity for gold to expand its reach in the lending market of the world's most populous nation. The company said Google is leveraging India's deep-rooted affinity for gold to expand its reach in the lending market.", "url": "https://techcrunch.com/2024/10/03/google-taps-india-love-for-gold-to-boost-its-credit-play/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2024/10/GettyImages-1244158870.jpg?resize=1200,825", "publishedAt": "2024-10-03T07:30:38Z", "content": "Google is leveraging India’s deep-rooted affinity for gold to expand its reach in the lending market of the world’s most populous nation.\r\nThe company said on Thursday that Google Pay has partnered w… [+2775 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle", "title": "Mexico: Soldiers open fire on migrant truck, killing 6 - DW (English)", "description": "Mexican soldiers fired guns on a truck carrying 33 migrants, killing six and injuring ten. The migrants hailed from Egypt, Nepal, Cuba, India and Pakistan.", "url": "https://www.dw.com/en/mexico-soldiers-open-fire-on-migrant-truck-killing-6/a-70392589", "urlToImage": "https://static.dw.com/image/70392524_6.jpg", "publishedAt": "2024-10-03T04:36:53Z", "content": "Mexican soldiers opened fire on a group of 33 migrants, killing six, said the defense ministry in a statement on Wednesday.\r\nThe migrants were in a truck which tried to evade a military patrol on Tue… [+2070 chars]"}]}