{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OLA Electric Car Launch Live updates: Ola announces its first EV car with 500 km range, 0 to 100 in four seconds - The Indian Express", "description": "OLA Electric Car Launch Live: Ola Electric has announced its first Electric Car and new S1 scooter.", "url": "https://indianexpress.com/article/technology/tech-news-technology/ola-electric-car-launch-live-updates-independence-day-announcement-8090788/", "urlToImage": "https://images.indianexpress.com/2022/08/Ola-Electric-car-1.jpeg", "publishedAt": "2022-08-15T09:47:38Z", "content": "So yes, electric cars were developed around the same time as fossil fuel-powered vehicles. In fact, electric vehicles accounted for one in three of all the vehicles on the road in the United States i… [+989 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: India's Flag 30 Km Above Earth Marks 75 Years Of Independence - NDTV", "description": "The Indian national flag was unfurled at an altitude of over 30 kms today as the country marked its 75 years of Independence.", "url": "https://www.ndtv.com/india-news/watch-indias-flag-30-km-above-earth-marks-75-years-of-independence-3255769", "urlToImage": "https://c.ndtvimg.com/2022-08/3d6vd9d8_flag-space-kidz-india_625x300_15_August_22.jpg", "publishedAt": "2022-08-15T07:12:37Z", "content": "The unfurling of the flag was part of the Azadi ka Amrit Mahotsav celebrations.\r\nNew Delhi: The Indian national flag was unfurled at an altitude of over 30 kms today as the country marked its 75 year… [+2100 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kunal Gaurav", "title": "Bihar CM promises 10 lakh jobs, Giriraj Singh hits back with old video of Nitish - Hindustan Times", "description": "Nitish Kumar had earlier said that his government will “try” to fulfil the promise of 10-lakh jobs that Tejashwi Yadav had made during the 2020 Bihar assembly election campaign. | Latest News India", "url": "https://www.hindustantimes.com/india-news/bihar-cm-nitish-kumar-announced-10-lakh-additional-jobs-tejashwi-yadav-101660541510095.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/15/1600x900/Nitish_Kumar_Tejashwi_Yadav_job_promise_1660545332778_1660545332938_1660545332938.jpg", "publishedAt": "2022-08-15T06:50:36Z", "content": "Bihar chief minister Nitish Kumar announced an additional 10 lakh jobs under various arrangements, his deputy Tejashwi Yadav said on Monday. Yadav said that the announcement was made during Nitish Ku… [+2409 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com News Desk", "title": "29 Pharma Cos Shortlisted By ICMR For Monkeypox Vax, Kits: Report - India.com", "description": "After the ICMR invited Expression of Interest (EOI) from the experienced vaccine manufacturer/pharma companies/R&D Institutions/In-vitro Diagnostic (IVD) kit manufacturers, it has now shortlisted 29 companies for vaccine and diagnostic kits.", "url": "https://www.india.com/business/29-pharma-cos-shortlisted-by-icmr-for-monkeypox-vax-kits-report-5572990/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/Collage-Maker-03-Aug-2022-11.56-AM-1.jpg", "publishedAt": "2022-08-15T06:47:22Z", "content": "New Delhi: The Indian Council of Medical Research (ICMR) has shortlisted 29 pharmaceutical companies as part of of its initial screening for developing a monkeypox vaccine and diagnostic kits in coll… [+1845 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Self-obsessed govt hell-bent on trivialising freedom fighters' sacrifices: Sonia Gandhi - The Indian Express", "description": "Gandhi's attack came a day after the BJP released a video narrating its version of events that led to India's partition in 1947 in which it tangentially accused the top Congress leadership at the time and showed pictures of Jawaharlal Nehru and Muhammad Ali J…", "url": "https://indianexpress.com/article/cities/delhi/self-obsessed-govt-hell-bent-on-trivialising-freedom-fighters-sacrifices-sonia-gandhi-8090941/", "urlToImage": "https://images.indianexpress.com/2022/08/sonia-gandhi-2.jpg", "publishedAt": "2022-08-15T05:20:50Z", "content": "Congress president Sonia Gandhi on Monday alleged that a “self-obsessed” government is hell-bent on “trivialising” the sacrifices of freedom fighters and the party will strongly oppose such attempts … [+1683 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Garena Free Fire Max August 15 Redeem Codes: Live FF Max diamonds, skins, pets and more - DNA India", "description": "Use these free FF MAX Redeem Codes and enjoy your Independence Day 2022 holiday.", "url": "https://www.dnaindia.com/gaming/report-how-to-garena-free-fire-max-august-15-redeem-codes-live-ff-max-diamonds-skins-pets-and-more-2976713", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/15/2530302-garena-free-fire-max-redeem-codes.png", "publishedAt": "2022-08-15T04:21:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 15, 2022, 09:54 AM ISTHere are the Garena Free Fire Max redeem codes for August 15. Garena Free Fire Max is a multiplayer onl… [+1641 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rezaul H Laskar", "title": "Netaji’s daughter calls for remains to be brought to India, says ready for DNA tests - Hindustan Times", "description": "Anita Bose Pfaff said she is ready for an attempt to extract DNA from the remains preserved at the shrine in the Japanese capital, which she described as ashes, including bones and teeth, in order to carry out tests | Latest News India", "url": "https://www.hindustantimes.com/india-news/netajis-daughter-calls-for-remains-to-be-brought-to-india-says-ready-for-dna-tests-101660536916086.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/15/1600x900/756d16e2-1c50-11ed-bfbb-46b3285c66bd_1660541590297.jpg", "publishedAt": "2022-08-15T04:15:15Z", "content": "Netaji Subhas Chandra Boses daughter Anita Bose Pfaff on Monday called for his remains to be brought back to India on the 75th anniversary of independence, saying she is convinced the remains at Toky… [+3790 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Daily Voice | This investment strategy chief believes equities to stay rangebound till hope of Fed pivot... - Moneycontrol", "description": "The future trajectory of FII flow, to a large extent, depends on the inflation in US and in India. Higher interest rates in the US typically lead to flows moving to the world's largest economy, resulting in the strengthening of the US dollar at the cost of em…", "url": "https://www.moneycontrol.com/news/business/markets/daily-voice-this-investment-strategy-chief-believes-equities-to-stay-rangebound-till-hope-of-fed-pivot-turns-real-9027951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/07/KunalValia-770x433.jpg", "publishedAt": "2022-08-15T04:04:03Z", "content": "Kunal Valia of Waterfield Advisors feels the current turnaround in stance of FII with regards to India is yet to be confirmed, but he believes a large part of FII selling in India is past us.\r\nFIIs h… [+5919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Taliban: Asked India to complete its development projects in Afghanistan - The Indian Express", "description": "August 15 has been declared a holiday but celebrations by the Taliban regime will be low-key, restricted to an official media event. The main events may take place on September 1, the day the last foreign troops left Afghanistan last year.", "url": "https://indianexpress.com/article/world/asked-india-to-complete-its-projects-in-afghanistan-taliban-8090476/", "urlToImage": "https://images.indianexpress.com/2022/08/kab-dam-4col.jpg", "publishedAt": "2022-08-14T23:15:43Z", "content": "THE TALIBAN regime in Afghanistan has asked India to complete the development projects it had started in that country, Foreign Ministry spokesman Abdul Qahar Balkhi said on Sunday.We are hopeful that… [+5455 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Rushdie attack a threat to freedom of speech: Ignatieff - CTV News", "description": "After Indian-born British novelist Salman Rushdie was attacked during a writing conference in western New York on Friday, current and former Canadian politicians are weighing in on what such attacks mean for freedom of expression and thought.", "url": "https://www.ctvnews.ca/world/fanaticism-is-a-danger-to-free-expression-everywhere-ignatieff-on-rushdie-attack-1.6026775", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/8/13/salman-rushdie-1-6026166-1660412841633.jpg", "publishedAt": "2022-08-14T16:36:00Z", "content": "After Indian-born British novelist Salman Rushdie was attacked during a writing conference in western New York on Friday, current and former Canadian politicians are weighing in on what such attacks … [+2773 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "After Nancy Pelosi, more US lawmakers visit Taiwan amid tensions with China - India Today", "description": "US lawmakers Ed Markey, John Garamendi, Alan Lowenthal, Don Beyer and Aumua Amata have arrived in Tawain, 12 days after Nancy Pelosi's visit drew sharp reactions from China.", "url": "https://www.indiatoday.in/world/story/after-nancy-pelosi-more-us-lawmakers-visit-taiwan-amid-tensions-with-china-1987923-2022-08-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/US_lawmakers_in_Taiwan-647x363.jpeg?WZT__UgJNT3L4ajN2uEK7WG3fu5DiH7H", "publishedAt": "2022-08-14T12:24:36Z", "content": "A delegation of US lawmakers arrived in Taiwan 12 days after House Speaker Nancy Pelosi's one-day trip to Taipei angered China, which claims the island as its own. This development also comes amid in… [+2336 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Taiwan 'Sincerely Thanks' 50 Nations, Including India, for Voicing Concern on China's Military Activities - News18", "description": "Providing a background to the sovereignty debate, Taiwan said it was entitled to make friends and maintain relationships with countries around the world", "url": "https://www.news18.com/news/world/taiwan-sincerely-thanks-50-nations-including-india-for-voicing-concern-on-chinas-military-activities-5750269.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/taiwan-flag-1-164604295616x9.png", "publishedAt": "2022-08-14T09:16:37Z", "content": "Taiwan on Sunday conveyed sincere gratitude to all countries that have voiced their grave concern regarding Chinas recent belligerent military posturing across the Taiwan Strait.\r\nBeijing last week s… [+2804 chars]"}]}