{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "India vs West Indies, 2nd Test, Day 2 Highlights: West Indies 86/1 At Stumps After Virat Kohli Century Powers India To 438 - NDTV Sports", "description": "IND vs WI, 2nd Test, Day 2 Highlights: West Indies were 86 for 1, trailing India by 352 runs at Stumps on Day 2 of the second Test.", "url": "https://sports.ndtv.com/west-indies-vs-india-2023/ind-vs-wi-live-score-2nd-test-day-2-india-vs-west-indies-live-cricket-scorecard-4229408", "urlToImage": "https://c.ndtvimg.com/2023-07/qaoiuam8_kraigg-brathwaite-tagenarine-chanderpaul-afp_625x300_22_July_23.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-07-21T21:41:23Z", "content": "IND vs WI, 2nd Test, Day 2 Highlights: West Indies were 86 for 1, trailing India by 352 runs at Stumps on Day 2 of the second Test in Port of Spain, Trinidad. Openers Kraigg Brathwaite and Tagenarine… [+869 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "6 healthy habits that decrease your risk of diabetes - IndiaTimes", "description": "Diabetes is a lifestyle disease that has taken over the Indian population. These health measures and lifestyle changes may help prevent the looming risk of diabetes.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/6-healthy-habits-that-decrease-your-risk-of-diabetes/photostory/101985857.cms", "urlToImage": "https://static.toiimg.com/photo/101985980.cms", "publishedAt": "2023-07-21T18:30:00Z", "content": "Our way of life is drastically altering in the quickly evolving world of today, which, regrettably, has resulted in a lifestyle that is becoming less and less sustainable. Among the many health probl… [+527 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kanishka Singharia", "title": "‘Ripped my clothes’: BJP worker alleges sexual assault during Bengal rural polls - Hindustan Times", "description": "The saffron party worker claimed that she was forcibly dragged by her hair by unknown individuals associated with the rival party. | Latest News India", "url": "https://www.hindustantimes.com/india-news/ripped-my-clothes-threw-me-bjp-worker-alleges-being-sexually-assaulted-by-tmc-workers-during-bengal-rural-polls-101689949220294.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/07/21/1600x900/F1kPy_GaEAE-Wxx_1689951450256_1689951465406.jpg", "publishedAt": "2023-07-21T15:02:39Z", "content": "A Bharatiya Janata Party worker alleged she was sexuall assaulted by ruling Trinamool Congress (TMC) workers in Howrah the day West Bengal voted in panchayat elections on July 8. The saffron party wo… [+1708 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "India vs West Indies: Virat Kohli equals Don Bradman's record, slams 29th Test hundred in Port of Spain - IndiaTimes", "description": "Cricket News: India's run machine, Virat Kohli, who is playing his 500th international match, continued his exceptional form in the series against West Indies as he", "url": "https://timesofindia.indiatimes.com/sports/cricket/india-in-west-indies/india-vs-west-indies-virat-kohli-equals-don-bradman-slams-29th-test-hundred-in-port-of-spain/articleshow/102020764.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-102020957,width-1070,height-580,imgsize-31518,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-07-21T14:42:00Z", "content": null}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Maharashtra weather update: Heavy rains continue in Mumbai, suburbs, water-logging in several areas - DNA India", "description": "As per India Meteorological Department's weather warning issued at 1 pm, 'moderate to intense spells of rain are very likely to occur at isolated places' in Mumbai in the next three to four hours, a civic official said.", "url": "https://www.dnaindia.com/india/report-maharashtra-weather-update-heavy-rains-continue-in-mumbai-suburbs-water-logging-in-several-areas-3052828", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/07/21/2600294-mumbai-rains.jpg", "publishedAt": "2023-07-21T14:32:00Z", "content": "As per India Meteorological Department's weather warning issued at 1 pm, \"moderate to intense spells of rain are very likely to occur at isolated places\" in Mumbai in the next three to four hours, a … [+1899 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Nag Ashwin compares Thor and Hulk with Hanuman at San Diego Comic-Con. Watch - Hindustan Times", "description": "At the San Diego Comic-Con 2023 event launch, director Nag Ashwin compared superheroes with Indian Gods. Kalki 2898 AD will release next year.", "url": "https://www.hindustantimes.com/entertainment/nag-ashwin-compares-thor-and-hulk-with-hanuman-101689946296241.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/07/21/1600x900/NAG_1689946704874_1689946705225.jpg", "publishedAt": "2023-07-21T14:26:03Z", "content": "After the first look of Prabhas and Deepika Padukone was released, the makers unveiled the first glimpse of Project K at San Diego Comic-Con. The film team has titled Project K as Kalki 2898 AD. The … [+2295 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "Deepika Padukone hugs Mukesh Ambani, Isha Ambani, greets Kokilaben Ambani at Manish Malhotra's event, pics go - DNA India", "description": "Now, a video of the event is going viral on social media that shows Deepika Padukone happily greeting Isha Ambani, Mukesh Ambani, and Kokilaben Ambani. In the photos that are going viral, Deepika Padukone can be seen hugging Kokilaben Ambani, Isha Ambani, and…", "url": "https://www.dnaindia.com/lifestyle/report-deepika-padukone-hugs-mukesh-ambani-isha-ambani-greets-kokilaben-ambani-manish-malhotra-event-viral-pics-jio-3052806", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2023/07/21/2600288-deepika-padukone-isha-ambani.jpg", "publishedAt": "2023-07-21T13:13:00Z", "content": "Now, a video of the event is going viral on social media that shows Deepika Padukone happily greeting Isha Ambani, Mukesh Ambani, and Kokilaben Ambani. In the photos that are going viral, Deepika Pad… [+1346 chars]"}, {"source": {"id": null, "name": "Cardekho.com"}, "author": "Rohit", "title": "Kia Seltos Facelift vs Hyundai Creta, Maruti Grand Vitara, Skoda Kushaq And Others: Price Comparison - CarDekho", "description": "With the facelift, the Kia Seltos has become one of the most equipped offerings in its segment, thus climbing up the price ladder by a big margin over its rivals  The Kia Seltos facelift has been launched in India, and is being offered in three broad variant …", "url": "https://www.cardekho.com/india-car-news/kia-seltos-facelift-vs-hyundai-creta-maruti-grand-vitara-skoda-kushaq-and-others-price-comparison-31166.htm", "urlToImage": "https://stimg2.cardekho.com/images/carNewsimages/userimages/650X420/31165/1689946307249/GeneralNew.jpg", "publishedAt": "2023-07-21T12:54:00Z", "content": "With the facelift, the Kia Seltos has become one of the most equipped offerings in its segment, thus climbing up the price ladder by a big margin over its rivals\r\nThe Kia Seltos facelift has been lau… [+11431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OpenAI introduces custom instructions feature offering users greater control over ChatGPT - The Indian Express", "description": "The new feature allows users to give ChatGPT any custom requests that they would want to apply to all their conversations.", "url": "https://indianexpress.com/article/technology/artificial-intelligence/openai-introduces-custom-instructions-chatgpt-8852915/", "urlToImage": "https://images.indianexpress.com/2023/07/OpenAI-Custom-Instructions.jpg", "publishedAt": "2023-07-21T12:43:17Z", "content": "AI powerhouse OpenAI has rolled out custom instructions, a feature intended to give the user greater control over ChatGPT. With the new feature, users can set their preferences, and the AI chatbot wi… [+1491 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manveena Suri, Vedika Sud, Sania Farooqui, Tara John, Sahar Akbarzai, Heather Chen", "title": "Shocking video emerges of sexual assault in India’s Manipur state amid ethnic violence - CNN", "description": "A graphic video showing two women forced by a baying mob to walk naked in the northeastern Indian state of Manipur has sparked outrage after it emerged on social media and prompted the country’s leader Narendra Modi to break his silence on the months-long sec…", "url": "https://www.cnn.com/2023/07/20/asia/india-manipur-sexual-violence-video-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230720113415-01-modi-speaks-manipur-0720.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-07-21T11:57:00Z", "content": "Editors Note: This report includes details of sexual assaults and violence.\r\nA graphic video showing two women forced by a baying mob to walk naked in the northeastern Indian state of Manipur has spa… [+5923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukalp Sharma", "title": "DGCA gives nod to Go First flight resumption plan, but with riders - The Indian Express", "description": "The acceptance of the resumption plan by the DGCA takes Go First one step closer to restarting operations.", "url": "https://indianexpress.com/article/business/aviation/dgca-approves-go-first-flight-resumption-plan-8852709/", "urlToImage": "https://images.indianexpress.com/2023/07/gofirst2.jpg", "publishedAt": "2023-07-21T10:50:48Z", "content": "The Directorate General of Civil Aviation (DGCA) has accepted the flight resumption plan submitted by the embattled low-cost carrier Go First, with some riders. According to the approved resumption p… [+3500 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Devdutt Pattanaik claims Bhagavad Gita quote in Oppenheimer was misinterpreted - Economic Times", "description": "Indian mythologist and writer Devdutt Pattanaik has recently challenged this interpretation, asserting that Oppenheimer misconstrued the original quote from the ancient text. ​​Speaking with The Indian Express, Pattanaik elucidated the accurate translation as…", "url": "https://economictimes.indiatimes.com/news/new-updates/devdutt-pattanaik-claims-bhagavad-gita-quote-in-oppenheimer-was-misinterpreted/articleshow/102011803.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102011978,width-1070,height-580,imgsize-53398,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-21T09:53:00Z", "content": "Renowned filmmaker Christopher Nolan has once again captivated audiences with his latest film, \"Oppenheimer,\" hailed by fans as one of the greatest cinematic achievements of the century. The movie re… [+2522 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today News Desk", "title": "Parliament Monsoon Session: Both Houses adjourned amid uproar over Manipur issue - India Today", "description": "The Lok Sabha and the Rajya Sabha were on Friday adjourned amid an uproar over the Manipur issue. The development came as the Opposition demanded a statement from Prime Minister Narendra Modi and a discussion on the Manipur violence. The session started a day…", "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-updates-manipur-women-video-uproar-bills-pm-modi-opposition-2409624-2023-07-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/breaking_news/202307/collage_maker-21-jul-2023-09-41-am-314-sixteen_nine.jpg?VersionId=T9njAHdcpOMNBrr_DBZ6.5te_cT23EPX", "publishedAt": "2023-07-21T08:51:00Z", "content": "#WATCH | On Manipur situation, Congress MP Pramod Tiwari says, \"I would like to say just one thing, especially for BJP, PM and others - Samar shesh hai, nahi paap ka bhaagi keval vyaaghra, jo tatasth… [+128 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Mausam Jha", "title": "India-Sri Lanka to explore petroleum line, land bridge to boost economic ties | Mint - Mint", "description": "India and Sri Lanka have agreed to conduct feasibility studies on a petroleum pipeline and a land bridge connectivity project between the two countries. The decision was made during Sri Lankan President Ranil Wickremesinghe's visit to India, where he engaged …", "url": "https://www.livemint.com/news/world/india-sri-lanka-president-ranil-wickremesinghe-pm-modi-petrol-pipeline-bilateral-ties-11689926477381.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/21/600x338/F1i1EsdaIAA90ZL_1689928150751_1689928153757.jpg", "publishedAt": "2023-07-21T08:33:02Z", "content": "Prime Minister Narendra Modi on Friday said that India and Sri Lanka have decided to carry out feasibility studies on establishing a petroleum pipeline and a land bridge connectivity project between … [+3709 chars]"}, {"source": {"id": null, "name": "Webindia123.com"}, "author": null, "title": "As Chandrayaan-3 braces to land on moon, here's why Pakistan lagged behind - webindia123", "description": "While Chandrayaan-3  Indias moon mission is paving its way through the space towards Moon, neighbouring country Pakistan is still struggling with a dwindling economy, the huge pile of debt and religious extremism-fuelled politics.", "url": "https://news.webindia123.com/news/articles/World/20230721/4100935.html", "urlToImage": null, "publishedAt": "2023-07-21T02:12:49Z", "content": "<tr><td></td></tr><tr><td>\r\nWhile Chandrayaan-3 Indias moon mission is paving its way through the space towards Moon, neighbouring country Pakistan is still struggling with a dwindling economy, the h… [+6708 chars]"}]}