{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Tarush Bhalla", "title": "Groww to acquire Indiabulls Housing Fin’s MF business - Mint", "description": "The deal includes a cash equivalent of  ₹100 crore, to be invested by Groww, and is subject to regulatory approvals by Securities and Exchange Board of India", "url": "https://www.livemint.com/companies/news/groww-to-acquire-indiabulls-mutual-funds-business-11620722294462.html", "urlToImage": "https://images.livemint.com/img/2021/05/11/600x338/groww1_1617816200663_1620722760981.jpg", "publishedAt": "2021-05-11T17:48:46Z", "content": "BENGALURU :\r\nNextbillion Technology Pvt. Ltd, which operates wealth management platform Groww, has entered into a definitive agreement with Indiabulls Housing Finance Ltd (IBHFL) to acquire the mutua… [+2551 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "18 states report decline in Covid-19 cases; numbers rising in 16 states - Times of India", "description": "India News: NEW DELHI: After days of unfolding horror unleashed by the second Covid wave, there is a glimmer of hope.", "url": "https://timesofindia.indiatimes.com/india/18-states-report-decline-in-covid-19-cases-numbers-rising-in-16-states/articleshow/82555696.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-82556826,width-1070,height-580,imgsize-411612,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-05-11T17:37:00Z", "content": "Prioritise vaccinating those due for second dose of Covid-19 vaccine: Centre to statesNEW DELHI: The Centre appealed to states on Tuesday to prioritise vaccinating those due for second dose of Covid-… [+180 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Covid-19: Anger over Japan govt grows as people die at home - India Today", "description": "There is also a wave of growing anger among citizens over the way the Covid crisis has been handled by the Japanese government. The vaccination drive, too, has failed to pick up pace.", "url": "https://www.indiatoday.in/world/story/covid-19-anger-over-japan-govt-grows-as-people-die-at-home-1801468-2021-05-11", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202105/WhatsApp_Image_2021-05-11_at_1_1-647x363.jpeg?mwWByvcX_k1u3EC26JKKZ9POq082v.Tq", "publishedAt": "2021-05-11T17:10:05Z", "content": "An alarming number of people in Japan are losing their life to Covid as more infectious variants of the disease trigger a fourth wave of infections in the country and hospital resources are stretched… [+2032 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi, Karnataka, Others Take Global Tender Route To Procure Covid Vaccine - NDTV", "description": "Delhi, along with a bunch of southern Indian states, today joined several others in taking the global-tender route to procure COVID-19 vaccines as domestic supply fails to keep up with rising demand.", "url": "https://www.ndtv.com/india-news/delhi-karnataka-others-take-global-tender-route-to-procure-covid-vaccine-2439773", "urlToImage": "https://c.ndtvimg.com/2021-04/kufejci_coronavirus-india-vaccine-afp_650x400_29_April_21.jpg", "publishedAt": "2021-05-11T16:47:08Z", "content": "The Centre says it's so far provided over 18 crore doses to states and Union Territories for free.\r\nNew Delhi: Delhi, along with a bunch of southern Indian states, today joined several others in taki… [+3956 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "What is `Black Fungus` or `Mucormycosis`?: Symptoms and treatment - WION", "description": "Mucormycosis, commonly called black fungus, is a serious and rare fungal infection affecting those suffering from coronavirus in India.", "url": "https://www.wionews.com/india-news/what-is-black-fungus-or-mucormycosis-symptoms-and-treatment-384366", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/05/11/194580-untitled-design-3.jpg", "publishedAt": "2021-05-11T16:30:00Z", "content": "Mucormycosis, commonly called black fungus, is a serious and rare fungal infection affecting those suffering from coronavirus in India.\r\nThe black fungus that invades the brain is being increasingly … [+2839 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss story: \"I had sprouts and salads for dinner everyday and here's the workout that helped me lose weight\" | The Times of India - Times of India", "description": "21-year-old Pranay had started to lose confidence in himself after being joked around and bullied for his looks. He wanted to prove naysayers wrong, and aimed to lose weight at any cost before he returned back to college. By making a few simple dietary swaps,…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/weight-loss-story-i-had-sprouts-and-salads-for-dinner-everyday-and-heres-the-workout-that-helped-me-lose-weight/photostory/82549371.cms", "urlToImage": "https://static.toiimg.com/photo/82550113.cms", "publishedAt": "2021-05-11T16:30:00Z", "content": "My breakfast: I wake up at 5-5:30 a.m., start my day by having a glass of lukewarm water and then begin my workout.\r\nLater, post my workout in the morning, I have 1 cup of black coffee without sugar,… [+585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Rockets kill 2 Israelis; 26 die in Gaza as Israel hits Hamas - The Indian Express", "description": "As localized violence in Jerusalem escalated into cross border conflict,  Hamas launched a rocket attack at Israel which killed two people . Israel responded with airstrikes in Gaza in which 26 Palestinians , including nine children were killed.", "url": "https://indianexpress.com/article/world/rockets-kill-2-israelis-26-die-in-gaza-as-israel-hits-hamas-7311237/", "urlToImage": "https://images.indianexpress.com/2021/05/ISRAEL-1.jpg", "publishedAt": "2021-05-11T15:43:46Z", "content": "A confrontation between Israel and Hamas sparked by weeks of tensions in contested Jerusalem escalated Tuesday. Israel unleashed new airstrikes on Gaza, killing a number of militants and civilians, w… [+5602 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cloudburst hits Devprayag in Uttarakhand - The Indian Express", "description": "Two municipality buildings, including the multi-purpose Nagar Palika Bhawan, caved in after being hit by the rubble brought down by the cloudburst, he added.", "url": "https://indianexpress.com/article/india/cloudburst-hits-devprayag-in-uttarakhand-7311227/", "urlToImage": "https://images.indianexpress.com/2021/05/UTTARAKHAND-1.jpg", "publishedAt": "2021-05-11T15:27:05Z", "content": "A cloudburst hit Devprayag in Tehri district of Uttarakhand on Tuesday, razing two municipal buildings to the ground and damaging several shops.\r\nIt also damaged pedestrian bridges, water pipelines a… [+755 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Prakash Rai", "title": "\"Virat Kohli Has Supported Me Through Thick And Thin, I Owe My Career To Him\": Mohammed Siraj - NDTV Sports", "description": "Mohammed Siraj's international career has seem a meteoric rise in the past few months and he credits India skipper Virat Kohli for always believing in him.", "url": "https://sports.ndtv.com/cricket/virat-kohli-has-supported-me-through-thick-and-thin-i-owe-my-career-to-him-mohammed-siraj-2439747", "urlToImage": "https://c.ndtvimg.com/2021-05/42rrsf2_virat-kohli-mohammed-siraj-test-afp_625x300_11_May_21.jpg", "publishedAt": "2021-05-11T15:12:33Z", "content": "Ever since he played a key role in India's historic Test triumph in Australia earlier this year, Mohammed Siraj's international career has seem a meteoric rise in the past few months. While he is rea… [+2085 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Peter", "title": "Asus cancels tomorrow's Zenfone 8 event for India, ROG Flow X13 and Zephyrus reveals also delayed - GSMArena.com news - GSMArena.com", "description": "The global Zenfone 8 reveal should go on as scheduled, however.", "url": "https://www.gsmarena.com/asus_cancels_tomorrows_zenfone_8_event_for_india_rog_flow_x13_and_zephyrus_reveals_also_delayed-news-49054.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/05/asus-cancels-may-12-event-for-india/-476x249w4/gsmarena_000.jpg", "publishedAt": "2021-05-11T15:01:01Z", "content": "Asus was planning on making several major reveals in India tomorrow, but those plans have been scuttled as much of the country goes into lockdown. The event was supposed to introduce the Zenfone 8 se… [+1924 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Leading nutritionist shares a tea recipe to reduce excess mucous - Times of India", "description": "Practising some breathing exercises and sipping expert recommended herbal concoctions are the two most effective ways to keep your lungs healthy and cut down the risk of infection.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/home-remedies/leading-nutritionist-shares-a-tea-recipe-to-reduce-excess-mucous/photostory/82550221.cms", "urlToImage": "https://static.toiimg.com/photo/82550252.cms", "publishedAt": "2021-05-11T14:30:00Z", "content": "This tea is made from spices commonly available in our pantry. Spices as we all know not only gives a distinct aroma to our curries and food but have been used in Ayurveda for several years due to th… [+440 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "NASA's OSIRIS-REx spacecraft way back to Earth with asteroid sample - India TV News", "description": "After nearly five years in space, NASA's Origins, Spectral Interpretation, Resource Identification, Security, Regolith Explorer (OSIRIS-REx) spacecraft is on its way back to Earth with an abundance of rocks and dust from the near-Earth asteroid Bennu, the US …", "url": "https://www.indiatvnews.com/science/nasa-osiris-rex-spacecraft-way-back-to-earth-with-asteroid-bennu-sample-703970", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/05/nasa-osiris-rex-spacecraft-1620742459.jpg", "publishedAt": "2021-05-11T14:29:46Z", "content": "Image Source : NASANASA's OSIRIS-REx spacecraft way back to Earth with asteroid sample\r\nAfter nearly five years in space, NASA's Origins, Spectral Interpretation, Resource Identification, Security, R… [+2227 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Scores of dead bodies found floating in India's Ganges River - The Associated Press", "description": "NEW DELHI (AP) — Scores of dead bodies have been found floating down the Ganges River in eastern India as the country battles a ferocious surge in coronavirus infections. Authorities said Tuesday they haven't yet determined the cause of death...", "url": "https://apnews.com/article/india-coronavirus-pandemic-health-1836d194eb36c16f39b1d5227ed8063a", "urlToImage": "https://storage.googleapis.com/afs-prod/media/0830cf228c3541b9ba60bdcc68849798/3000.jpeg", "publishedAt": "2021-05-11T14:25:18Z", "content": "NEW DELHI (AP) Scores of dead bodies have been found floating down the Ganges River in eastern India as the country battles a ferocious surge in coronavirus infections. Authorities said Tuesday they … [+1453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "India Uses Video Conferencing Most for Education and Social Gatherings: Zoom Study - Gadgets 360", "description": "To be a part of this Zoom study, over 7,689 users participated from the USA, UK, Mexico, Brazil, France, Germany, Japan, India, Singapore and Australia. Out of this total, 1,007 respondents were from India. These users were surveyed online from March 15 to Ma…", "url": "https://gadgets.ndtv.com/apps/news/india-video-conferencing-education-most-social-gatherings-next-zoom-study-finds-2439684", "urlToImage": "https://i.gadgets360cdn.com/large/zoom_chinese_govt_tianamen_square_activists_blocked_reuters_1591938417385.jpg", "publishedAt": "2021-05-11T12:59:13Z", "content": "Zoom and Qualtrics Research released a new study titled How Virtual Do We Want Our Future to Be?' and it shows stats based on 10 countries worldwide, including India. The report says that the most co… [+1911 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Moody's cuts India's growth forecast to 9.3 pc, risks of longer-term economic recovery scarring - Economic Times", "description": "India is experiencing a severe second wave of coronavirus infections which will slow the near-term economic recovery and could weigh on longer-term growth dynamics, it said.  As of now, we expect the negative impact on economic output to be limited to the Apr…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/moodys-slashes-india-growth-forecast-to-9-3-pc/articleshow/82549351.cms", "urlToImage": "https://img.etimg.com/thumb/msid-82549428,width-1070,height-580,imgsize-163310,overlay-economictimes/photo.jpg", "publishedAt": "2021-05-11T12:49:00Z", "content": "Moody's Investors Service on Tuesday slashed India's growth forecast for the current financial year to 9.3 per cent saying that the second wave of coronavirus infections hampers economic recovery and… [+5384 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Photogallery Team", "title": "#ETimesCelebTracker: Today's 20 best celeb moments - Times of India", "description": "#ETimesCelebTracker: Today's 20 best celeb moments Photos: Find out the latest pictures, still from movies, of #ETimesCelebTracker: Today's 20 best celeb moments on ETimes Photogallery. Including #ETimesCelebTracker: Today's 20 best celeb moments Portifolio, …", "url": "https://photogallery.indiatimes.com/celebs/etimescelebtracker/etimescelebtracker-todays-20-best-celeb-moments/articleshow/82546534.cms", "urlToImage": "https://static.toiimg.com/photo/82549281.cms", "publishedAt": "2021-05-11T12:44:12Z", "content": "Willow Smith, the daughter of Will Smith and Jada Pinkett Smith, who launched her music career with the single \"Whip My Hair\", which peaked at number 11 on the Billboard Hot 100, is creating waves on… [+29 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vineet Washington", "title": "Mi FlipBuds Pro With Active Noise Reduction, Stem Design to Be Launched by Xiaomi on May 13 - Gadgets 360", "description": "Xiaomi FlipBuds Pro or Mi FlipBuds Pro are the company’s upcoming true wireless stereo (TWS) earbuds with “active noise reduction”. They will be unveiled on May 13 in China. But it is unclear if they will be launched in India as of yet.", "url": "https://gadgets.ndtv.com/audio/news/xiaomi-mi-flipbuds-pro-launch-date-may-13-specifications-stem-design-active-noise-reduction-40db-2439667", "urlToImage": "https://i.gadgets360cdn.com/large/Flipbuds_Pro_teaser_1620736098672.jpg", "publishedAt": "2021-05-11T12:35:34Z", "content": "Mi FlipBuds Pro or Xiaomi FlipBuds Pro are the company's upcoming true wireless stereo (TWS) earbuds that have been teased to come with active noise reduction. Xiaomi recently shared a poster teasing… [+2058 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "India, where World Cup was supposed to take place, is also affected: Miandad lashes out at PCB for PSL resumption plans - Hindustan Times", "description": "PCB and six franchise owners had a 360-degree discussion, which also considered feedback from the National Command and Operation Centre. UAE emerged as a preferred venue for the remaining 20 matches during the conference.", "url": "https://www.hindustantimes.com/cricket/india-where-wct20-was-supposed-to-take-place-is-also-affected-javed-miandad-lashes-out-at-pakistan-cricket-board-for-psl-resumption-plans-101620733681644.html", "urlToImage": "https://images.hindustantimes.com/img/2021/05/11/1600x900/_6b2c95f0-28a0-11ea-a3f7-989b44b77166_1620734825352.JPG", "publishedAt": "2021-05-11T12:08:40Z", "content": "It has been reported that Pakistan Super League could hold their remaining matches in the United Arab Emirates. The Pakistan Cricket Board (PCB) and the franchise owners met on Friday to discuss the … [+2559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India’s tour of Sri Lanka: Hardik Pandya, Shikhar Dhawan in line for captaincy - The Indian Express", "description": "India will be playing three T20Is and as many ODIs in Sri Lanka during the second half of July when the likes of Virat Kohli and Rohit Sharma will be in England for a five-match Test series.", "url": "https://indianexpress.com/article/sports/cricket/hardik-pandya-shikhar-dhawan-india-vs-sri-lanka-series-captaincy-7311022/", "urlToImage": "https://images.indianexpress.com/2021/05/hardik-pandya-shikhar-dhawan.jpg", "publishedAt": "2021-05-11T11:45:43Z", "content": "Veteran opener Shikhar Dhawan and flamboyant allrounder- turned specialist batsman Hardik Pandya will be locked in a two-way fight for India captaincy if Shreyas Iyer doesn’t get fit in time for the … [+2131 chars]"}, {"source": {"id": null, "name": "The Malaysian Reserve"}, "author": "Dayang Norazhar", "title": "Deadly Fungus Infection Found in Covid-19 Patients in India - The Malaysian Reserve", "description": "by BLOOMBERG India’s health authorities warned about a fungal infection seen in some Covid-19 patients which can disfigure facial features and even kill, as the country continues to grapple with the world’s fastest-growing coronavirus outbreak. Mucormycosis, …", "url": "https://themalaysianreserve.com/2021/05/11/deadly-fungus-infection-found-in-covid-19-patients-in-india/", "urlToImage": "https://themalaysianreserve.com/wp-content/uploads/2021/05/371639730.jpg", "publishedAt": "2021-05-11T11:23:04Z", "content": "by BLOOMBERG\r\nIndias health authorities warned about a fungal infection seen in some Covid-19 patients which can disfigure facial features and even kill, as the country continues to grapple with the … [+1877 chars]"}]}