{"status": "ok", "totalResults": 27, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Gopal B Kateshiya", "title": "Explained: What we know of the mysterious lights, boom in Gujarat night skies - The Indian Express", "description": "While officials have said the most likely explanation is aircraft that could have taken off from the Jamnagar airbase, defence authorities are yet to confirm this.", "url": "https://indianexpress.com/article/explained/gujarat-mysterious-lights-air-force-7370610/", "urlToImage": "https://images.indianexpress.com/2021/06/gujarat-sky-explained.jpg", "publishedAt": "2021-06-22T13:27:34Z", "content": "Mysterious lights flickering in the night sky on Monday in Junagadh, Upleta, and nearby regions of Saurashtra in Gujarat have left residents excited and perplexed. Videos of these events have gone vi… [+2964 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Detection of multiple Covid variants puts Jharkhand on high alarm - The New Indian Express", "description": "Jharkhand is committed to taking all necessary steps to stop the spread of the virus to protect its citizens by adopting evidence-based containment measures, the state health secretary said.", "url": "https://www.newindianexpress.com/nation/2021/jun/22/detection-of-multiple-covid-variants-puts-jharkhand-on-high-alarm-2319929.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/6/22/w600X390/coronavirus-_PTI.jpg", "publishedAt": "2021-06-22T13:16:00Z", "content": "RANCHI: Alarmed by the detection of several variants of coronavirus in Jharkhand with 328 confirmed cases surfacing so far, the state government has directed the authorities to despatch samples withi… [+3988 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Kerala HC stays Lakshadweep admin orders to shut dairy farms, exclude meat from school kids’ menu - The Indian Express", "description": "In the last several months, a slew of proposals of the UT administration has sparked anger on the islands leading to protests and arrests.", "url": "https://indianexpress.com/article/india/kerala/kerala-hc-stays-lakshadweep-admin-orders-to-shut-dairy-farms-exclude-meat-from-school-kids-menu-7370836/", "urlToImage": "https://images.indianexpress.com/2021/06/kerala-high-court-1.jpg", "publishedAt": "2021-06-22T12:37:15Z", "content": "The Kerala High Court Tuesday imposed a stay on two controversial orders of the Lakshadweep UT administration headed by Praful Patel.\r\nA division bench headed by Chief Justice S Manikumar and Justice… [+1174 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Hawking was right: Black holes do not shrink over time, new study confirms - India Today", "description": "Gravitational waves detected from the merger of two black holes led to confirmation of one of Hawking's most talked about theorems.", "url": "https://www.indiatoday.in/science/story/black-hole-stephen-hawking-theory-einstein-ligo-physics-1818057-2021-06-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202106/Black_holes-647x363.jpeg?2gZrfpOy7r2bf1XFy_nRWiNvdm.5XSKT", "publishedAt": "2021-06-22T12:04:34Z", "content": "Black holes have always been the ultimate villains in the story of the universe. The dark mass of objects that does not even allow light to pass through them is present in almost every galaxy. Our ve… [+2401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Harsh Rajput", "title": "World Test Championship Final: Michael Vaughan Says New Zealand Would Have Won If Match Played Up No.. - NDTVSports.com", "description": "WTC Final: Michael Vaughan tweeted that had the match been played up North, it would have been completed and New Zealand would have won by now. Indian fans reacted as usual.", "url": "https://sports.ndtv.com/icc-world-test-championship-2021/wtc-final-michael-vaughan-takes-another-jibe-at-indian-team-see-reactions-2469864", "urlToImage": "https://c.ndtvimg.com/2021-06/fq8u4a2o_indian-team-afp_625x300_22_June_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2021-06-22T12:03:49Z", "content": "With rain playing havoc with the World Test Championship final, with two days being washed out due to rain. On Day 5 today, again the start was delayed due to a drizzle. Social media was abuzz with m… [+2096 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Stock Market Highlights: Sensex ends flat, Nifty holds above 15,750; banks, FMCG drag; smallcaps outperform - CNBCTV18", "description": "Stock Market Highlights: Indian equity indices, Sensex and Nifty erased the day's gains to end flat Tuesday dragged by selling banking and FMCG stocks. Broader markets were mixed with the midcap index flat while smallcap index up 0.5 percent. Among sectors, g…", "url": "https://www.cnbctv18.com/market/stocks/stock-market-live-update-sensex-today-nifty-stocks-shares-indian-bank-info-edge-earnings-trading-news-9737161.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2020/12/1sakdfkas.jpg", "publishedAt": "2021-06-22T10:35:22Z", "content": "Market At Close | Here are the highlights of today's trading session\r\n- Market Fails To Hold Opening Gains As Banks &amp; RIL Slip\r\n- Sensex Slips From Intra-day Record High Of 53,057 To Close Near F… [+764 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Tech Desk", "title": "Battlegrounds Mobile India Not Sharing Data With Chinese Servers Anymore After U - News18", "description": "Battlegrounds Mobile India's Early Access build was launched last week.", "url": "https://www.news18.com/news/tech/battlegrounds-mobile-india-not-sharing-data-with-chinese-servers-anymore-after-update-report-3878165.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/06/1624358008_featured-image-2021-06-22t160205.652.jpg", "publishedAt": "2021-06-22T10:34:32Z", "content": "Battlegrounds Mobile India’s Early Access build was launched last week. The much-awaited Indian avatar of PUBG Mobile was launched for Android users after months of speculation and rumours of the gam… [+1899 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ashley Collman", "title": "WHO: Delta is 'fittest' coronavirus strain, will 'pick off' vulnerable - Business Insider", "description": "The Delta variant, which was first identified in India, accounted for an estimated 90% and 31% of new coronavirus cases in the UK and US recently.", "url": "https://www.businessinsider.com/delta-fittest-coronavirus-variant-who-warns-vulnerable-2021-6", "urlToImage": "https://i.insider.com/5f9830974743a3001216bdf4?width=1200&format=jpeg", "publishedAt": "2021-06-22T10:32:18Z", "content": "World Health Organization officials said Monday that the Delta coronavirus variant was the fastest-moving and \"fittest\" variant to date, with the ability to find and kill the weakest people.\r\nAt a Mo… [+2421 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Vaccinated people may share this \"common\" symptom if they're COVID+ | The Times of India - Times of India", "description": "Given the implication of the second wave and the underlying dangers of a possible third wave, it is extremely important for everyone to get themselves 'fully vaccinated' against COVID-19. While vaccination does not mean that you won't contract the deadly viru…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-vaccinated-people-may-share-this-common-symptom-if-theyre-covid/photostory/83743974.cms", "urlToImage": "https://static.toiimg.com/photo/83744017.cms", "publishedAt": "2021-06-22T10:30:00Z", "content": "As of now, getting yourself vaccinated is the only way to protect yourself, your family and the most vulnerable in society. However, this does not mean that you cannot contract the virus. You can sti… [+641 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Australia struggles to quash persistent coronavirus outbreaks - Eyewitness News", "description": "The outbreak is thought to have started when a man who works as a driver for international flight crews contracted the highly contagious Delta variant of the virus, which was first identified in India.", "url": "https://ewn.co.za/2021/06/22/australia-struggles-to-quash-persistent-coronavirus-outbreaks", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/ialvuwzbrkdmplhboofx", "publishedAt": "2021-06-22T10:10:13Z", "content": "The outbreak is thought to have started when a man who works as a driver for international flight crews contracted the highly contagious Delta variant of the virus, which was first identified in Indi… [+2210 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "New Zealand vs India Live: Day five of the World Test Championship cricket final - Stuff.co.nz", "description": "New Zealand loses three wickets early on day five as they edge closer to India's first innings score.", "url": "https://www.stuff.co.nz/sport/cricket/black-caps/300333432/new-zealand-vs-india-live-day-five-of-the-world-test-championship-cricket-final", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/t/9/t/g/image.related.StuffLandscapeSixteenByNine.1420x800.4yt6rc.png/1624369087046.jpg", "publishedAt": "2021-06-22T09:15:00Z", "content": "The Black Caps take on India in the World Test Championship final at the Ageas Bowl in Southampton.\r\n You can follow our live coverage from 9pm on Friday (NZT), simply bookmark this page and come bac… [+2925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ankita Garg", "title": "How to remotely log out of your Google or Gmail account - The Indian Express", "description": "Remotely log out of Google and Gmail account: There are times when one forgets to log out of their Google or Gmail account from another device. Here's how one can do this remotely, even if they don't have access to the device.", "url": "https://indianexpress.com/article/technology/techook/how-to-remotely-log-out-of-your-google-or-gmail-account-7370461/", "urlToImage": "https://images.indianexpress.com/2021/06/Google-account.jpg", "publishedAt": "2021-06-22T09:06:09Z", "content": "There are times when you forget to log out of your Google or Gmail account from another device, and you fear that someone might access important documents and other data. Well, you don’t need to worr… [+2838 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus Vaccine: When can we expect Pfizer and Moderna COVID vaccines to arrive in India? - Times of India", "description": "Pfizer BioNTech and Moderna's mRNA COVID-19 vaccines, which are amongst the most popular and sought-after vaccines globally are reported to be making their way to India.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-when-can-we-expect-pfizer-and-moderna-covid-vaccines-to-arrive-in-india/photostory/83741965.cms", "urlToImage": "https://static.toiimg.com/photo/83742153.cms", "publishedAt": "2021-06-22T08:49:00Z", "content": "The recent change in guidelines by government authorities will now allow foreign vaccine manufacturers to be sold and used in India, which will be a great step in ramping up vaccination drives in Ind… [+1356 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Narada case: SC judge Aniruddha Bose recuses from hearing pleas of Mamata Banerjee, Bengal law minister - The Indian Express", "description": "Justice Gupta, presiding over the bench, said the issue would be now placed before Chief Justice N V Ramana who may take the decision and the pleas may be listed for hearing during the day itself.", "url": "https://indianexpress.com/article/india/narada-case-sc-judge-aniruddha-bose-recuses-from-hearing-pleas-of-mamata-banerjee-bengal-law-minister-7370181/", "urlToImage": "https://images.indianexpress.com/2021/06/mamata-banerjee-1200.jpg", "publishedAt": "2021-06-22T08:02:27Z", "content": "Supreme Court judge Justice Aniruddha Bose on Tuesday recused himself from hearing appeals of West Bengal Chief Minister Mamata Banerjee and state law minister Moloy Ghatak about their role on the da… [+931 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Vanshika Malhotra", "title": "Realme Narzo 30, Buds Q2 price leaked two days before India launch - BGR India", "description": "Realme is all set to launch the new Narzo 30 (both 4G and 5G variants) the Buds Q2 TWS earbuds and a new smart TV on June 24 in India.", "url": "https://www.bgr.in/news/realme-narzo-30-buds-q2-price-leaked-before-india-launch-price-features-specs-and-more-968364/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2021/06/realme-Narzo-30-5G.png", "publishedAt": "2021-06-22T07:47:21Z", "content": "Realme is all prepped up to launch a new member in its Narzo 30 series, a new pair of earbuds, and a new smart TV in India at an event scheduled for June 24. Ahead of the launch, we now have leaked d… [+2017 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Taapsee Pannu turns the lane of Saint Petersburg into a runway as she pairs sari with sneakers | Hindi Movie News - Bollywood - Times of India", "description": "Actress Taapsee Pannu is an avid social media user and enjoys a massive fan following. The actress who is known for voicing her views on social media over pertinent issues is currently enjoying a holiday in Russia, along with her sister Shagun Pannu, and is f…", "url": "https://timesofindia.indiatimes.com/videos/entertainment/hindi/taapsee-turns-the-lane-of-saint-petersburg-into-a-runway-as-she-pairs-sari-with-sneakers/videoshow/83741214.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/83741214/size-1031852/83741214.jpg", "publishedAt": "2021-06-22T07:44:17Z", "content": "Actress Taapsee Pannu is an avid social media user and enjoys a massive fan following. The actress who is known for voicing her views on social media over pertinent issues is currently enjoying a hol… [+971 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Mi Watch Revolve Active With SpO2 Monitoring, 14-Day Battery Life Launched in India - Gadgets 360", "description": "Mi Watch Revolve Active is more or less similar to the Mi Watch Revolve. It comes with silicone straps and a buckle closure for better grip on the wrist. The main highlight is the addition of blood oxygen saturation (SpO2) monitoring. SpO2 measurement can pro…", "url": "https://gadgets.ndtv.com/wearables/news/mi-watch-revolve-active-price-in-india-rs-9999-launched-sale-date-june-25-specifications-features-smartwatch-xiaomi-2469556", "urlToImage": "https://i.gadgets360cdn.com/large/mi_watch_revolve_active_main_1624346202812.jpg", "publishedAt": "2021-06-22T07:35:16Z", "content": "Mi Watch Revolve Active smartwatch has launched in India alongside the Mi 11 Lite. The smartwatch is an iteration of the Mi Watch Revolve that launched last year. The new smartwatch comes with the ad… [+2747 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Is Covid wave 2 over? Positivity rate below 5% for 15 days, but experts say end still far - Times of India", "description": "India News: NEW DELHI: India has crossed the important milestone of a Covid positivity rate of less than 5% for 15 consecutive days, conforming to the WHO's recom.", "url": "https://timesofindia.indiatimes.com/india/is-covid-wave-2-over-positivity-rate-below-5-per-cent-for-15-days-but-experts-say-end-still-far/articleshow/83740703.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-83740736,width-1070,height-580,imgsize-71206,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-06-22T07:24:00Z", "content": "Is Covid wave 2 over? Positivity rate below 5% for 15 days, but experts say end still far\r\n<ul><li>News</li>\r\n<li>India News</li>\r\n<li>Is Covid wave 2 over? Positivity rate below 5% for 15 days, but … [+34 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reuters", "title": "Flash Sales Proposed to Be Banned on E-Commerce Websites as Government Plans to Tighten Rules - Gadgets 360", "description": "India proposed banning flash sales on e-commerce websites and said their affiliate entities should not be listed as sellers on their platforms, in a proposed tightening of rules that could hit Amazon and Walmart's Flipkart.", "url": "https://gadgets.ndtv.com/internet/news/flash-sale-ban-amazon-flipkart-e-commerce-rule-tight-strict-plan-propose-ministry-of-consumer-affairs-2469463", "urlToImage": "https://i.gadgets360cdn.com/large/amazon_main_reuters_1624341211300.jpg", "publishedAt": "2021-06-22T06:05:39Z", "content": "India proposed banning flash sales on e-commerce websites and said on Monday their affiliate entities should not be listed as sellers on their platforms, in a proposed tightening of rules that could … [+2392 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "hindustantimes.com", "title": "WTC Final: Virender Sehwag takes a funny dig at ICC after Day 4 gets washed out due to rain - Hindustan Times", "description": "Sehwag, in his latest tweet, drew a parallel between the ICC’s timeline for hosting the WTC final and the timing of Indian batsmen in the first innings of the crucial face-off. | Cricket", "url": "https://www.hindustantimes.com/cricket/wtc-final-virender-sehwag-takes-a-funny-dig-at-icc-after-day-4-gets-washed-out-due-to-rain-101624339841755.html", "urlToImage": "https://images.hindustantimes.com/img/2021/06/22/1600x900/Untitled_design_(1)_1624340219125_1624340231769.jpg", "publishedAt": "2021-06-22T05:38:46Z", "content": "Former Indian opener Virender Sehwag has been pretty active on social media and has his own style of acknowledging things. On Monday, he took a funny jibe at the International Cricket Council (ICC) f… [+1777 chars]"}]}