{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "The Manila Times"}, "author": "Marit Stinus-Cabugon", "title": "PH world No. 4 in TB cases - The Manila Times", "description": "THE Philippines has the unenviable distinction of being the 'fourth largest contributor to the number of tuberculosis cases worldwide,' after India, China and Indonesia, 'with 500...", "url": "https://www.manilatimes.net/2022/08/22/opinion/columns/ph-world-no-4-in-tb-cases/1855490", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/08/21/100399.jpg", "publishedAt": "2022-08-21T16:10:35Z", "content": "THE Philippines has the unenviable distinction of being the \"fourth largest contributor to the number of tuberculosis cases worldwide,\" after India, China and Indonesia, \"with 500 people affected per… [+5087 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Pak govt prepares for former PM Imran Khan's arrest, blocks his live speech - India Today", "description": "An FIR has been filed against former Pakistan Prime Minister Imran Khan under the Anti-Terrorism Act.", "url": "https://www.indiatoday.in/world/story/former-pakistan-pm-imran-khan-booked-under-anti-terrorism-charges-1990769-2022-08-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Imran_Khan_PTI-647x363.jpeg?eKLINQxtZ43xsRqC6wAOxS2ViZ4S.Hbk", "publishedAt": "2022-08-21T15:46:36Z", "content": "An FIR has been filed against former Pakistan Prime Minister Imran Khan under the Anti-Terrorism Act (ATA). Imran Khan was booked for threatening a judge and two top officials while addressing a rall… [+1897 chars]"}, {"source": {"id": null, "name": "Fox 59"}, "author": "Fox 59", "title": "3 Indiana State University students die in crash - FOX 59 Indianapolis", "description": "TERRE HAUTE, Ind. — Three Indiana State University students died in a crash Sunday morning, the university announced. According to Terre Haute Police, there were five people total in the car, they are all believed to be ISU students, including some football p…", "url": "https://fox59.com/indiana-news/3-indiana-state-university-students-die-in-crash/", "urlToImage": "https://fox59.com/wp-content/uploads/sites/21/2017/04/terre-haute-police.jpg?w=1280", "publishedAt": "2022-08-21T15:35:39Z", "content": "TERRE HAUTE, Ind. — Three Indiana State University students died in a crash Sunday morning, the university announced.\r\nAccording to Terre Haute Police, there were five people total in the car, they a… [+565 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "ANI", "title": "'Tomato fever' misleading colloquial name for Hand Foot and Mouth Disease, says doctor - The New Indian Express", "description": "Tomato fever looks like a form of hand foot and mouth disease with additional symptoms of joint pains and high-grade fever, said Dr Dhiren Gupta, Senior Consultant, Sir Gangaram hospital.", "url": "https://www.newindianexpress.com/lifestyle/health/2022/aug/21/tomato-fever-misleading-colloquial-name-for-hand-foot-and-mouth-disease-say-doctor-2489862.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/8/18/w600X390/Doctors112.jpg", "publishedAt": "2022-08-21T15:32:00Z", "content": "NEW DELHI: A medical professional has called \"Tomato fever\" a misleading colloquial name for hand, foot and mouth Disease.\r\nAccording to Dr Rajeev Jayadevan, co-chairman of IMA's National task force … [+5406 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "India in advanced stage of talks with US for procuring MQ-9B drones - Hindustan Times", "description": "The MQ-9B drone is a variant of the MQ-9 \"Reaper\" which was used to launch a modified version of the Hellfire missile that eliminated al-Qaeda leader Ayman al-Zawahiri in the heart of Kabul last month. | Latest News India", "url": "https://www.hindustantimes.com/india-news/india-in-advanced-stage-of-talks-with-us-for-procuring-mq-9b-drones-101661091889594.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/drnne_1661095593097_1661095600933_1661095600933.jpg", "publishedAt": "2022-08-21T15:29:54Z", "content": "India is in an \"advanced stage\" of negotiations with the US to procure 30 MQ-9B Predator armed drones for over USD 3 billion to crank up its surveillance apparatus along the frontier with China as we… [+5782 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Singapore will decriminalise sex between men, prime minister says - India Today", "description": "Singapore will decriminalise sex between men, the prime minister said on Sunday, adding that society in the city-state was becoming more accepting of gay people.", "url": "https://www.indiatoday.in/world/story/singapore-decriminalise-sex-between-men-pm-lee-hsien-loong-1990754-2022-08-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/singapore_men_sex-647x363.jpeg?ctACeFZ6dTuwHC4IeT9lm8LGQ.ZSHzVM", "publishedAt": "2022-08-21T14:28:08Z", "content": "Singapore will decriminalise sex between men but has no plans to change the legal definition of marriage as being between a man and a woman, Prime Minister Lee Hsien Loong said on Sunday.\r\nLee said S… [+2426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Problem Has Not Been Resolved\": S Jaishankar On Border Row With China - NDTV", "description": "While attending an Indian community event in Sao Paulo in Brazil, External Affairs Minister S Jaishankar said that China has disregarded the border pacts.", "url": "https://www.ndtv.com/india-news/problem-has-not-been-resolved-s-jaishankar-on-border-row-with-china-3273323", "urlToImage": "https://c.ndtvimg.com/2022-08/46orsg84_s-jaishankar-650_625x300_21_August_22.jpg", "publishedAt": "2022-08-21T14:08:45Z", "content": "India and China have been engaged in a standoff since April-May 2020\r\nSao Paulo: While attending an Indian community event in Sao Paulo in Brazil, External Affairs Minister S Jaishankar said that Chi… [+4385 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Anupam Kher takes a dig at Aamir Khan, boycott Laal Singh Chaddha trend | Exclusive - India Today", "description": "Anupam Kher took a jibe at Aamir Khan after boycott calls for Laal Singh Chaddha on Twitter. Speaking to IndiaToday.in, Anupam referred to Aamir's past comment on intolerance.", "url": "https://www.indiatoday.in/movies/bollywood/story/anupam-kher-takes-a-dig-at-aamir-khan-boycott-laal-singh-chaddha-trend-exclusive-1990742-2022-08-21", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/Untitled_design_-_2022-08-21T1_8-647x363.png?8cjfGt8fyJ9vH6VsAIEkO_8t.Wmjh6cJ", "publishedAt": "2022-08-21T14:01:54Z", "content": "Aamir Khan has been receiving flak on social media, even before Laal Singh Chaddha released. With boycott calls amid other controversies, Laal Singh Chaddha went on to become a huge dud. In fact, Anu… [+3322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "iPhone 14 to AirPods Pro 2: What you should expect from Apple's September event - The Indian Express", "description": "From the iPhone 14 to the AirPods Pro 2, here is what you can expect from Apple's September event.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-event-september-7-iphone-14-airpods-pro-2-8103384/", "urlToImage": "https://images.indianexpress.com/2022/08/Apple-iPhone-14-Watch-Series-8-20220821.jpg", "publishedAt": "2022-08-21T12:23:39Z", "content": "Apple will be holding its traditional September event a few weeks from now. If the Cupertino-based tech giant follows past trends, we can expect it to unveil the next generation of iPhone to the star… [+3615 chars]"}, {"source": {"id": null, "name": "123telugu.com"}, "author": null, "title": "Here is the blasting news for Icon Star Allu Arjun’s fans - 123telugu", "description": "From the time the PAN Indian film Pushpa starring Icon Star Allu Arjun was released, people were very excited to witness the second part regarding how the genius director Sukumar would establish the f", "url": "https://www.123telugu.com/mnews/here-is-the-blasting-news-for-icon-star-allu-arjuns-fans.html", "urlToImage": "https://www.123telugu.com/content/wp-content/themes/123telugu/images/logo.gif", "publishedAt": "2022-08-21T11:50:00Z", "content": "From the time the PAN Indian film Pushpa starring Icon Star Allu Arjun was released, people were very excited to witness the second part regarding how the genius director Sukumar would establish the … [+841 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Devasheesh Pandey", "title": "House of The Dragon on Disney+Hotstar: Streaming time, complete season schedule and show details - India TV News", "description": "House of The Dragon, a Game of Thrones spin-off series, is all set to stream on Disney+Hotstar from August 22. Weekly episodes will drop on the streaming app and subscribers can watch and download them.", "url": "https://www.indiatvnews.com/entertainment/ott/house-of-the-dragon-disney-hotstar-streaming-time-episodes-watch-online-free-download-hd-game-of-thrones-2022-08-21-801767", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/iic-1661076529.jpg", "publishedAt": "2022-08-21T10:37:43Z", "content": "House of The Dragon will be streaming on Disney+Hotstar from August 22 in India. After Game of Thrones (2011-2019) became the most-viewed series for HBO globally, the network greenlit several spin-of… [+2827 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "Irfan Pathan's savage response to Waqar Younis' 'Big relief for India' tweet - Hindustan Times", "description": "Waqar Younis was more concerned with Shaheen's absence in the India game in their Asia Cup opener and India great Irfan Pathan has come up with a savage response of the former fast bowler.", "url": "https://www.hindustantimes.com/cricket/irfan-pathan-s-savage-response-to-waqar-younis-big-relief-for-india-tweet-on-shaheen-afridi-s-injury-101661074055872.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/21/1600x900/pathan-hooda_1658750911002_(1)_(1)_1661074714511_1661074765151_1661074765151.jpg", "publishedAt": "2022-08-21T09:59:26Z", "content": "Pakistan legend Waqar Younis' tweet targeting the Indian team in his Twitter post on Shaheen Afridi's injury did not go down well with fans. Shaheen incurred a knee injury during the Sri Lanka Test s… [+1643 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Nitish Kumar may be 'strong candidate' for PM: Tejashwi Yadav - The Indian Express", "description": "Bihar Deputy CM Tejashwi Yadav said that the coming together of the Mahagathbandhan with the JD(U), RJD, the Congress and other parties \"signals that most of the Opposition parties recognise the larger challenge before the country – the hegemony of the BJP.\"", "url": "https://indianexpress.com/article/cities/patna/tejashwi-yadav-bihar-nitish-kumar-pm-8102961/", "urlToImage": "https://images.indianexpress.com/2022/08/nitish-kumar-tejashwi-1.jpg", "publishedAt": "2022-08-21T08:30:34Z", "content": "Following a political churn in Bihar, which saw Nitish Kumar breaking JD(U)’s alliance with the BJP and returning to the ‘Mahagathbandhan’with the Rashtriya Janata Dal (RJD), deputy CM Tejashwi Yadav… [+5653 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mahapanchayat held in support of jailed politician Shrikant Tyagi in UP's Noida - The Indian Express", "description": "The congregation started around 10 am at the Ramlila ground in Gejha village on the call of locals even as hundreds of community members from parts of western Uttar Pradesh like Ghaziabad, Muzaffarnagar, Bulandshahr, Baghpat and Hapur reached here for the pro…", "url": "https://indianexpress.com/article/delhi/mahapanchayat-held-in-support-of-jailed-politician-shrikant-tyagi-tyagi-community-noida-8102916/", "urlToImage": "https://images.indianexpress.com/2022/08/tyagi-2.jpg", "publishedAt": "2022-08-21T08:06:08Z", "content": "A major congregation of the Tyagi community started in Uttar Pradesh’s Noida on Sunday in support of jailed politician Shrikant Tyagi who has been booked for assaulting a woman and misusing state gov… [+1934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA selects potential regions to land crew for Artemis III mission - The Indian Express", "description": "NASA has identified a set of 13 regions where the space agency could potentially land its crew during the Artemis III mission.", "url": "https://indianexpress.com/article/technology/science/nasa-artemis-iii-crewed-moon-mission-landing-region-site-8102629/", "urlToImage": "https://images.indianexpress.com/2022/08/Artemis-III-landing-regions-20220821.jpg", "publishedAt": "2022-08-21T05:41:44Z", "content": "As NASA prepares to send astronauts back to the Moon as part of its Artemis missions, the space agency has identified 13 potential locations for landing crewed missions near the lunar South Pole of E… [+2711 chars]"}, {"source": {"id": null, "name": "Crictracker.com"}, "author": "", "title": "BCCI name 16-member India A squad for New Zealand A series, Shubman Gill to lead - CricTracker", "description": "Get cricket match updates (Domestic & International), team stats, series results, fixtures, latest news, top stories, match preview, predictions, review, results, fantasy tips, statistical highlights, videos and complete cricket analysis along with ICC Cricke…", "url": "https://www.crictracker.com/", "urlToImage": "https://image.crictracker.com/wp-content/uploads/2018/04/CricTracker-Facebook-Preview.png", "publishedAt": "2022-08-21T04:51:00Z", "content": "WI vs NZ Dream11 Prediction, Fantasy Cricket Tips, Dream11 Team, Playing XI, Pitch Report, &amp; Injury Update for 3rd ODI"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Passive smoking 10th biggest risk factor for cancer, reveals study - The Tribune India", "description": "People living in close proximity to those who smoke tobacco may have a higher risk of cancer as a new study published in The Lancet journal has found that second-hand smoking is the tenth biggest risk factor for the disease.", "url": "https://www.tribuneindia.com/news/world/passive-smoking-10th-biggest-risk-factor-for-cancer-reveals-study-423754", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_267787749.jpg", "publishedAt": "2022-08-21T01:18:00Z", "content": "PTI\r\nWashington, August 20\r\nPeople living in close proximity to those who smoke tobacco may have a higher risk of cancer as a new study published in The Lancet journal has found that second-hand smok… [+1502 chars]"}]}