{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Jasprit Bumrah likely to be ruled out of T20 World Cup - The Indian Express", "description": "Bumrah didn’t play the first T20 against South Africa Wednesday and, a day later, flew to the National Cricket Academy in Bengaluru for the back condition to be monitored.", "url": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-ruled-out-of-t20-world-cup-8180399/", "urlToImage": "https://images.indianexpress.com/2022/07/jasprit-bumrah-3.jpg", "publishedAt": "2022-09-30T11:29:31Z", "content": "WITH JUST weeks to go for the T20 World Cup in Australia, Team India suffered a huge setback with ace pacer Jasprit Bumrah rendered doubtful for the tournament after he complained of back pain.Bumrah… [+3159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google Stadia to shut down: What does this mean for cloud gaming? - The Indian Express", "description": "Google Stadia: Three years after its launch, Stadia is set to finally be put to rest. Does this affect the future of cloud gaming?", "url": "https://indianexpress.com/article/technology/gaming/google-stadia-to-shut-down-what-does-this-mean-for-cloud-gaming-8182582/", "urlToImage": "https://images.indianexpress.com/2022/09/Google-Stadia.jpg", "publishedAt": "2022-09-30T10:20:24Z", "content": "Early next year, Google is set to shut down Stadia, its very own cloud gaming platform that the tech giant launched just three years ago. The platform originally had big plans on launch, including in… [+5871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "India 5G launch: Prime Minister Narendra Modi to inaugurate 5G services tomorrow - The Indian Express", "description": "India 5G launch: While the government has not specified the cities that the PM will first launch 5G services in, telecom operators have revealed how they plan to roll out 5G services on their network.", "url": "https://indianexpress.com/article/technology/tech-news-technology/pm-narendra-modi-to-launch-5g-tomorrow-october-1-8182334/", "urlToImage": "https://images.indianexpress.com/2022/09/5g-launch-pm-modi-pixabay-1200.jpg", "publishedAt": "2022-09-30T08:07:28Z", "content": "Prime Minister Narendra Modi will launch 5G services in select cities on Saturday (October 1) and also inaugurate the sixth edition of India Mobile Congress 2022 in New Delhi, the government official… [+2511 chars]"}, {"source": {"id": null, "name": "News18"}, "author": null, "title": "India's 'Pinaka Deal' With Armenia to be Shot in Arm for Nation Amid Conflict With Azerbaijan | Explained - News18", "description": "The Ministry of Defense authorised the export of weapons through a government-to-government channel, and the two countries signed agreements earlier this month to deliver weapons and ammunition to Armenia, reports said", "url": "https://www.news18.com/news/explainers/india-set-to-export-pinaka-missiles-to-armenia-amid-nations-conflict-with-azerbaijan-how-is-the-deal-significant-6070897.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/untitled-design-67-1-166452419316x9.jpg", "publishedAt": "2022-09-30T07:57:00Z", "content": "While Armenia deals with a surge in violence with Azerbaijan in a new flare-up of tensions, India has decided to export missiles, rockets, and ammunition, including indigenous Pinaka multi-barrel roc… [+4994 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Ignite Drops Review (Ignite Amazonian Sunrise Drops Exposed!) Scam or Legit? - The Tribune India", "description": "It may be discouraging when people tell you to lose weight by being healthy. You are probably under a lot of unnecessary pressure to lose this fat, and nobody even realizes it. In addition, obesity is a risk factor for a wide variety of other medical conditio…", "url": "https://www.tribuneindia.com/news/brand-connect/ignite-drops-review-ignite-amazonian-sunrise-drops-exposed-scam-or-legit-436847", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_166195604.jpg", "publishedAt": "2022-09-30T07:46:00Z", "content": "Ignite Amazonian Sunrise Drops\r\nIt may be discouraging when people tell you to lose weight by being healthy. You are probably under a lot of unnecessary pressure to lose this fat, and nobody even rea… [+10404 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "SC collegium recommends transfer of chief justices of two HCs, appointment of three new CJs - The Indian Express", "description": "The collegium recommended the transfer of Orissa HC Chief Justice S Muralidhar as the Chief Justice of the Madras HC. It also recommended the transfer of Chief Justice Pankaj Mithal of the J&K HC as Chief Justice of the Rajasthan HC.", "url": "https://indianexpress.com/article/india/sc-collegium-chief-justice-hc-8182198/", "urlToImage": "https://images.indianexpress.com/2022/09/CJI-Lalitfour-4col-1.jpg", "publishedAt": "2022-09-30T07:28:31Z", "content": "The Supreme Court collegium has recommended the transfer of the chief justices of two high courts and the appointment of three new chief justices.A five-member collegium led by Chief Justice of India… [+1536 chars]"}, {"source": {"id": null, "name": "Livelaw.in"}, "author": "LIVELAW NEWS NETWORK", "title": "BREAKING| Lion Statue Atop New Parliament Building Does Not Violate State Emblem Act : Supreme Court - Live Law - Indian Legal News", "description": "The Supreme Court on Friday held that the lion sculpture installed atop the new Parliament building...", "url": "https://www.livelaw.in/top-stories/lion-statute-atop-new-parliament-building-does-not-violate-state-emblem-act-supreme-court-210659", "urlToImage": "https://www.livelaw.in/h-upload/2022/07/22/427077-national-emblem-at-central-vista-and-sc.jpg", "publishedAt": "2022-09-30T06:38:52Z", "content": "The Supreme Court on Friday held that the lion sculpture installed atop the new Parliament building under construction as part of the Central Vista project does not violate the State Emblem of India … [+3171 chars]"}, {"source": {"id": null, "name": "Livelaw.in"}, "author": "Nupur Thapliyal", "title": "Delhi Court Grants Bail To Sharjeel Imam In 2019 Sedition Case - Live Law - Indian Legal News", "description": "A Delhi Court on Friday granted bail to former JNU student Sharjeel Imam in a sedition case which...", "url": "https://www.livelaw.in/news-updates/delhi-court-bail-sharjeel-imam-2019-sedition-case-210656", "urlToImage": "https://www.livelaw.in/h-upload/2020/07/11/378064-sharjeel-imam.jpg", "publishedAt": "2022-09-30T06:28:19Z", "content": "A Delhi Court on Friday granted bail to former JNU student Sharjeel Imam in a sedition case which accuses him of delivering a \"provocative speech\" that allegedly led to violence in the Jamia Nagar ar… [+2993 chars]"}, {"source": {"id": null, "name": "Motogp.com"}, "author": "MotoGP™", "title": "MotoGP™ to race in India from 2023 - motogp.com", "description": "The country will make its debut on the calendar in 2023 as the paddock gets ready to take on Buddh International Circuit", "url": "https://www.motogp.com/en/news/2022/09/30/motogp-to-race-in-india-from-2023/438681", "urlToImage": "https://photos.motogp.com/2022/09/30/india-3_2.big.jpg", "publishedAt": "2022-09-30T06:26:26Z", "content": "India will make its debut on the MotoGP calendar in 2023 as MotoGP gets ready to take on Buddh International Circuit, as the Grand Prix of Bharat. The country is a true economic and cultural powerhou… [+2293 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "PM Modi flags off Vande Bharat Express in Gujarat's Gandhinagar - India Today", "description": "Prime Minister Narendra Modi flagged off the Gandhinagar-Mumbai Vande Bharat Express train at Gandhinagar railway station.", "url": "https://www.indiatoday.in/india/story/pm-modi-flags-off-vande-bharat-express-gujarat-gandhinagar-2006578-2022-09-30", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/gujarat-647x363.png?x8wss1.Ulb5JMA3irb6aePXDnfme7axv", "publishedAt": "2022-09-30T05:08:25Z", "content": "Prime Minister Narendra Modi flagged off the Gandhinagar-Mumbai Vande Bharat Express train at Gandhinagar railway station on Friday. He will inaugurate phase-I of the Ahmedabad Metro rail project and… [+2173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Watch: Astronaut does 'yoga in weightlessness'; aces this challenging asana in space - The Indian Express", "description": "\"It’s a bit tricky, but with the right poses and some creative freedom you can do it,\" Samantha Cristoforetti, an European Space Agency (ESA) astronaut wrote on Twitter", "url": "https://indianexpress.com/article/lifestyle/fitness/watch-astronaut-yoga-asana-space-samantha-garudasana-eagle-pose-8179959/", "urlToImage": "https://images.indianexpress.com/2022/09/astronaut_3.jpg", "publishedAt": "2022-09-30T04:30:16Z", "content": "Samantha Cristoforetti, a European Space Agency (ESA) astronaut, performed yoga while aboard the International Space Station in zero gravity. As expected, her video, took the internet by surprise. Th… [+2889 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sharmita Kar", "title": "After Bihar IAS officer's condom remark sparks outrage, she expresses 'regret' - Hindustan Times", "description": "The incident took place at a workshop in Patna where a schoolgirl asked the IAS officer if sanitary pads can be made more affordable. | Latest News India", "url": "https://www.hindustantimes.com/india-news/after-bihar-ias-officer-s-condom-remark-sparks-outrage-she-expresses-regret-101664453096014.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/29/1600x900/NEWW_1664383764330_1664458778409_1664458778409.jpg", "publishedAt": "2022-09-29T13:39:58Z", "content": "After triggering a huge uproar, Bihar IAS officer Harjot Kaur Bhamra, who snapped back at a Patna schoolgirl with a \"condom\" remark for asking for cheaper sanitary pads, on Thursday apologised for th… [+2126 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Healthy eating: Four best protein sources your body needs - The Indian Express", "description": "A lot of people who are confused about what kinds of foods to add to their diet so as to meet their daily protein requirement should know that plant-based proteins are easy to digest as compared to animal proteins", "url": "https://indianexpress.com/article/lifestyle/food-wine/healthy-eating-four-protein-sources-plant-based-body-health-8134310/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-protein-sources-1200.jpg", "publishedAt": "2022-09-29T06:00:30Z", "content": "There are many reasons why one should add plenty of protein-rich foods to their diet. It is understood that proteins help to structure and support the cells, build immunity and are useful for hormone… [+3259 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "UCL: New tool assesses which countries need Covid-19 vaccines the most - India Education Diary", "description": "The researchers say the tool considers a far wider range of factors than the current global COVAX facility, which has been criticised by some countries, particularly poorer nations for insufficient access and a lack of flexibility to response to loca", "url": "https://indiaeducationdiary.in/ucl-new-tool-assesses-which-countries-need-covid-19-vaccines-the-most/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2022/01/ucl.png?fit=768%2C480&ssl=1", "publishedAt": "2022-09-28T15:56:15Z", "content": "The researchers say the tool considers a far wider range of factors than the current global COVAX facility, which has been criticised by some countries, particularly poorer nations for insufficient a… [+3797 chars]"}]}