{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Queen Elizabeth II And Independent India: A Journey of 'Shared History' and Pending Apology - News18", "description": "Queen Elizabeth II came to the throne five years after India gained Independence from the British Raj. During her final visit to India in 1997, many expected her to offer an apology on behalf of her country for the 1919 Jallianwala Bagh massacre. That expecta…", "url": "https://www.news18.com/news/india/queen-elizabeth-ii-and-independent-india-a-journey-of-shared-history-and-pending-apology-5924443.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/09/queen-elizabeth-india-166273128216x9.jpg", "publishedAt": "2022-09-09T15:20:00Z", "content": "Britains Queen Elizabeth II started her reign in 1952, five years after India gained Independence from the vast colonial empire she headed. The British monarch, who died on Thursday passing the crown… [+10840 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Replaced as chief ministers, union ministers, BJP leaders’ new roles for 2024 election - India Today", "description": "Senior BJP leaders, including Vijay Rupani, Biplab Deb, Prakash Javadekar , have been assigned new charges by the party leadership.", "url": "https://www.indiatoday.in/india/story/bjp-new-state-incharges-former-chief-ministers-union-ministers-1998514-2022-09-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/nadda_shah_pti-647x363.jpeg?VBPUVr_nmlBizQp3m1vborKjz2FgMWUI", "publishedAt": "2022-09-09T15:07:39Z", "content": "With eyes on the 2024 Lok Sabha polls, the BJP gave new organisational charges to former chief ministers and Union ministers. Senior BJP leaders, including Vijay Rupani, Biplab Kumar Deb, Prakash Jav… [+608 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Sri Lanka vs Pakistan Asia Cup 2022 Super 4 Live Score Updates: PAK stay steady despite losing Rizwan early as powerplay ends - The Indian Express", "description": "Sri Lanka vs Pakistan, Asia Cup 2022, Live Score Updates: Finalists Sri Lanka and Pakistan will lock horns in the last match of the Super 4.", "url": "https://indianexpress.com/article/sports/cricket/sri-lanka-vs-pakistan-asia-cup-2022-super-4-live-score-updates-8140830/", "urlToImage": "https://images.indianexpress.com/2022/09/Sri-Lanka-vs-Pakistan.jpeg", "publishedAt": "2022-09-09T14:30:22Z", "content": "Sri Lanka beat India in their Super 4 encounter in Dubai to cement their place in the final.\r\nSri Lanka vs Afghanistan Live Streaming and Updates:\r\nSquads\r\nSri Lanka: Pathum Nissanka, Kusal Mendis(w)… [+568 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "[Exposed] Maggie Beer Gummies Australia SCAM ALERT Weight Loss Keto Gummy Do Not Buy Before Read! - The Tribune India", "description": "There are no magic pills that you can take to lose weight, but you can use the keto diet to burn fat and shed pounds. The keto diet is a high-fat, low-carb diet that can be very effective at helping you lose weight.", "url": "https://www.tribuneindia.com/news/book-reviews/exposed-maggie-beer-gummies-australia-scam-alert-weight-loss-keto-gummy-do-not-buy-before-read-430137", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/9/2022_9$largeimg_606903870.jpg", "publishedAt": "2022-09-09T13:29:00Z", "content": "There are no magic pills that you can take to lose weight, but you can use the keto diet to burn fat and shed pounds. The keto diet is a high-fat, low-carb diet that can be very effective at helping … [+8914 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "PCOS Awareness Month: Can Women With PCOS Get Pregnant? Expert Answers - India.com", "description": "As per studies, one in five adolescent's girls have PCOS. However, if left untreated, it can lead to serious health issues such as obesity, heart diseases, endometrical cancer, diabetes, insulin resistance, hyperinsulinemia, and hyperandrogenism.", "url": "https://www.india.com/lifestyle/pcos-awareness-month-can-women-with-pcos-get-pregnant-expert-answers-5622109/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/09/Collage-Maker-09-Sep-2022-06.51-PM.jpg", "publishedAt": "2022-09-09T13:22:19Z", "content": "PCOS AWARENESS MONTH: September is marked as a PCOS awareness month. PCOS stands for Polycystic ovary syndrome. This is a disorder which all women marks as soon as they reach their teenage age. PCOS … [+3707 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"No 90m Pressure On Me\": Neeraj Chopra After Becoming First Indian To Win Diamond League Finals - NDTV Sports", "description": "Hours after his latest feat in the Swiss city, the 24-year-old woke up to a posse of Indian scribes waiting to get a quote or two from the country's track & field elite during a virtual interaction", "url": "https://sports.ndtv.com/athletics/no-90m-pressure-on-me-neeraj-chopra-after-becoming-first-indian-to-win-diamond-league-finals-3330687", "urlToImage": "https://c.ndtvimg.com/2022-08/3c7o4f8o_neeraj-chopra-afp_625x300_27_August_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-09-09T12:15:39Z", "content": "Commercial obligations and social commitments took a toll on Neeraj Chopra following his historic Olympic gold. Having \"learned\" from experience, he plans to do things differently heading into next s… [+4304 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Special mention to Virat Kohli for his maiden T20I hundred: Rashid Khan hails India star - India Today", "description": "Rashid Khan thanked fans for their constant support in Asia Cup 2022 after Afghanistan bowed out of the tournament. Rashid also gave special mention to Virat Kohli for his maiden T20I hundred.", "url": "https://www.indiatoday.in/sports/cricket/story/special-mention-to-virat-kohli-for-his-maiden-t20i-hundred-rashid-khan-1998400-2022-09-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/Virat_Kohli_Rashid_Khan-647x363.jpeg?oq0ABSerKbMsK9mnbeVenEfaE3ibgdNj", "publishedAt": "2022-09-09T10:45:42Z", "content": "Afghanistan all-rounder Rashid Khan gave special mention to Virat Kohli in his gratitude post after the star batter hit his maiden T20I hundred during India's 101-run win over Afghanistan in the Asia… [+3266 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "It's a sale, not assistance: US diplomat on supply of F-16 equipment to Pakistan - India Today", "description": "Top US diplomat Donald Lu has said the Biden administration is not providing any new capability and weapons system to Pakistan under the USD 450 million F-16 fighter jet fleet sustainment program.", "url": "https://www.indiatoday.in/world/story/us-pakistan-f-16-sale-assistance-donald-lu-india-china-lac-ukraine-russia-1998352-2022-09-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202209/us_f16_aircraft-647x363.jpeg?X4M7i4_DVapBOaUqKt416zhGKFgxwzj3", "publishedAt": "2022-09-09T09:03:58Z", "content": "The Joe Biden-led US government has approved a USD 450 million F-16 fighter jet fleet sustainment program to Pakistan, reversing a Trump-era order which suspended security aid to Islamabad. However, … [+4033 chars]"}, {"source": {"id": null, "name": "Livelaw.in"}, "author": "LIVELAW NEWS NETWORK", "title": "Bilkis Bano Case Convicts Release- Supreme Court Hearing- LIVE UPDATES - Live Law - Indian Legal News", "description": "Supreme Court to hear today the plea challenging the premature release of 11 convicts in the Bilkis...", "url": "https://www.livelaw.in/top-stories/bilkis-banoo-supreme-court-convicts-release-remission-gujarat-208827", "urlToImage": "https://www.livelaw.in/h-upload/2022/08/23/431759-bilkis-bano-and-sc.jpg", "publishedAt": "2022-09-09T08:11:19Z", "content": "Order: Mr. Rishi Malhotra appears for one of the resp, take instructions for other respondents. Copy of the petition to be served to them. \r\nCopy of petition to served to counsel appearing for State … [+10 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nearly two years in jail, journalist Siddique Kappan gets bail from SC - The Indian Express", "description": "A bench led by Chief Justice U U Lalit granted him the relief 'considering the length of custody undergone and the peculiar facts of the case'. He directed the trial court to 'release him on conditions it deems fit'.", "url": "https://indianexpress.com/article/india/siddique-kappan-uapa-supreme-court-bail-plea-8140252/", "urlToImage": "https://images.indianexpress.com/2022/09/kappan-2-1-1-1.jpeg", "publishedAt": "2022-09-09T07:58:22Z", "content": "The Supreme Court on Friday granted bail to Kerala journalist Siddique Kappan, arrested by the Uttar Pradesh police over his alleged links with the Popular Front of India (PFI) and charged under the … [+2091 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "India may see up to 12 million tonnes slump in rice production, food secretary says - Economic Times", "description": "There are four affected drought states which have less area of approximately 25 lakh hectares, translating into about 7-8 million tonnes of less output. Total rice sowing is down by 38.06 lakh hectares and loss of production may be about 10 million tonnes. In…", "url": "https://economictimes.indiatimes.com/news/economy/agriculture/india-may-see-up-to-12-million-tonnes-slump-in-rice-production-food-secretary-says/articleshow/94092463.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94092495,width-1070,height-580,imgsize-66266,overlay-economictimes/photo.jpg", "publishedAt": "2022-09-09T07:03:00Z", "content": "India's food secretary today affirmed the declining rice output trend in the country that had pushed New Delhi to put restrictions on the export of the foodgrain even at the cost of likely stoking fo… [+1304 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "King's College London: Landmark trial of NHS staff reveals promising solution to improve mental health - India Education Diary", "description": "New research from the Institute of Psychiatry, Psychology, & Neuroscience (IoPPN) at King’s College London has found that the mental health and wellbeing of frontline NHS healthcare workers can be supported and improved through the use of the ‘Ko", "url": "https://indiaeducationdiary.in/kings-college-london-landmark-trial-of-nhs-staff-reveals-promising-solution-to-improve-mental-health/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/06/1599206690133.jpg?fit=926%2C488&ssl=1", "publishedAt": "2022-09-09T06:53:23Z", "content": "New research from the Institute of Psychiatry, Psychology, &amp; Neuroscience (IoPPN) at Kings College London has found that the mental health and wellbeing of frontline NHS healthcare workers can be… [+4208 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tata Group In Talks To Assemble iPhones In India: Report - NDTV Profit", "description": "Tata Group is in talks with a Taiwanese supplier to Apple Inc. to establish an electronics manufacturing joint venture in India, seeking to assemble iPhones in the South Asian country.", "url": "https://www.ndtv.com/business/tatas-in-talks-to-join-club-of-iphone-makers-partnering-this-taiwanese-supplier-3329403", "urlToImage": "https://c.ndtvimg.com/2022-09/dp2ln0io_bloomberg-image_625x300_09_September_22.jpg", "publishedAt": "2022-09-09T05:49:00Z", "content": "India's top conglomerate in talks to join club of iPhone makers\r\nTata Group is in talks with a Taiwanese supplier to Apple Inc. to establish an electronics manufacturing joint venture in India, seeki… [+3835 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "SC stays demolition of Curlies restaurant in Goa linked to Sonali Phogat's death - Hindustan Times", "description": "The Supreme Court issued the stay order subject to the condition that no commercial activities will take place at the popular beach shack on Anjuna beach in North Goa. | Latest News India", "url": "https://www.hindustantimes.com/india-news/sc-stays-demolition-of-goa-s-curlies-restaurant-linked-to-sonali-phogat-s-death-101662702080353.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/09/1600x900/Curlie_1662656263171_1662702607352_1662702607352.jpg", "publishedAt": "2022-09-09T05:48:06Z", "content": "The Supreme Court on Friday stayed the demolition of Goa's Curlies restaurant that came to limelight in recent days following the death of Haryana Bharatiya Janata Party (BJP) leader and social media… [+1468 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "'The world title has its responsibilities, and a public statement is the least of them': Former world champion Kasparov reacts to Magnus Carlsen's withdrawal saga - The Indian Express", "description": "Carlsen had left the Sinquefield Cup midway after Round three, a first for the Norwegian who has never voluntarily walked away from a tournament of this magnitude.", "url": "https://indianexpress.com/article/sports/chess/the-world-title-has-its-responsibilities-and-a-public-statement-is-the-least-of-them-former-world-champion-kasparov-reacts-to-magnus-carlsens-withdrawal-saga-8140172/", "urlToImage": "https://images.indianexpress.com/2022/09/Carlsen.jpg", "publishedAt": "2022-09-09T05:36:54Z", "content": "Former world Chess champion Garry Kasparov has reacted to Magnus Carlsens withdrawal from Sinquefield Cup after losing a game to the 19-year-old American chess player Hans Niemann. A move that trigge… [+4021 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "World EV Day | Network18 Exclusive: Tata Motors may soon roll out India's cheapest electric car - Moneycontrol", "description": "World EV Day: Shailesh Chandra, MD of Tata Motors PV Business Unit announced expansion of the company's portfolio to make EVs more accessible in India", "url": "https://www.moneycontrol.com/news/technology/auto/network18-exclusive-tata-motors-may-soon-roll-out-indias-cheapest-electric-car-9152251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/Mr.-Shailesh-Chandra-Managing-Director-Tata-Motors-Passenger-Vehicles-Ltd.-and-Tata-Passenger-Electric-Mobility-Ltd.-770x433.jpg", "publishedAt": "2022-09-09T04:41:30Z", "content": "Tata Motors plans to launch a hatchback electric vehicle soon with a price tag below Rs 12.50 lakh, Shailesh Chandra, MD of Tata Motors PV Business Unit, told CNBC-TV18 on September 9.\r\nTata Motors w… [+2933 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Why do boys need to get the HPV vaccine between 9 and 15? - The Indian Express", "description": "With this dose, boys are protected and cannot transfer the virus from partner to partner. Together with vaccinated girls, they can build a herd immunity of sorts in the community, advises Dr Sarika Gupta, Consultant, Gynecologic Oncology and Robotic Gynaecolo…", "url": "https://indianexpress.com/article/lifestyle/health-specials/why-do-boys-need-to-get-the-hpv-vaccine-between-9-and-15-8139309/", "urlToImage": "https://images.indianexpress.com/2022/09/pexels-VACCINE.jpeg", "publishedAt": "2022-09-08T14:17:37Z", "content": "Most of us think that the human papilloma virus(HPV), an easily sexually transmitted virus, causes only cervical cancer in women. Whats not talked about as much is that it leads to a variety of cance… [+4476 chars]"}]}