{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Kapoor", "title": "What is Langya virus that has infected 35 people in China? - The Indian Express", "description": "Langya virus: At least 35 people have been found infected with Langya virus in Shandong and Henan provinces of China. What is Langya virus, and how was it discovered? What are the symptoms? Where has it come from?", "url": "https://indianexpress.com/article/explained/explained-health/what-is-langya-virus-discovered-in-china-8081659/", "urlToImage": "https://images.indianexpress.com/2022/08/mu-variant1.jpg", "publishedAt": "2022-08-10T05:59:56Z", "content": "Almost three years after the novel coronavirus was detected in China, a new zoonotic virus has been discovered in the country’s two eastern provinces with 35 infections identified so far. This new ty… [+3201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Samsung Galaxy Unpacked Live Updates: Galaxy Z Fold 4, Z Flip 4 to launch today - The Indian Express", "description": "Samsung Galaxy Unpacked August 10: Check out Live Updates from the Samsung Galaxy Z Fold 4, Galaxy Z Flip 4 launch event here with price, features, specifications and other details", "url": "https://indianexpress.com/article/technology/mobile-tabs/samsung-galaxy-unpacked-live-updates-price-features-specs-8081533/", "urlToImage": "https://images.indianexpress.com/2022/08/Galaxy-Unpacked-Aug-10.jpg", "publishedAt": "2022-08-10T05:57:03Z", "content": "Samsung is expected to launch its new foldable smartphones today as part of the Galaxy Unpacked new Galaxy Unpacked event. The two major launches at the event could be the new Galaxy Z Fold 4 and Z F… [+611 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "What is Perseid meteor shower, set to light up night sky on Saturday? Know when, how to watch - DNA India", "description": "The night sky on Saturday will have a dazzling display of shooting stars due to the Perseid meteor shower. Know how to watch this event.", "url": "https://www.dnaindia.com/science/report-what-is-perseid-meteor-shower-set-to-light-up-night-sky-on-saturday-know-when-how-to-watch-2975334", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/10/2528938-meteor-shower.png", "publishedAt": "2022-08-10T05:15:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA webdesk |Updated: Aug 10, 2022, 10:49 AM ISTThe Perseid meteor shower is set to bring an amazing treat for stargazers and space enthusiasts, which w… [+1853 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Bengali actor Saibal Bhattacharya attempts suicide at his residence in Kolkata over family dispute; shares video on Facebook - Times of India", "description": "Bengali actor Saibal Bhattacharya's recent Facebook video has left his fans shocked. Reportedly, the actor tried to commit suicide by hitting himself with a sharp object and posted the said video on his social media handle, which shows Saibal in a hurt state …", "url": "https://timesofindia.indiatimes.com/videos/entertainment/hindi/bengali-actor-saibal-bhattacharya-attempts-suicide-at-his-residence-in-kolkata-over-family-dispute-shares-video-on-facebook/videoshow/93467733.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/93467733/size-41398/93467733.jpg", "publishedAt": "2022-08-10T03:36:06Z", "content": "Bengali actor Saibal Bhattacharya\r\n's recent Facebook video has left his fans shocked. Reportedly, the actor tried to commit suicide by hitting himself with a sharp object and posted the said video o… [+359 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "Monkeypox outbreak: Is it still possible to control it? Here's what Ex-FDA chief has to say - India TV News", "description": "Monkeypox outbreak: Ex-FDA chief Gottlieb believes that more cases would be found if testing was expanded beyond just that community. His comments come days after the US Department of Health and Human Services (HHS) declared a public health emergency over the…", "url": "https://www.indiatvnews.com/health/monkeypox-outbreak-is-it-still-possible-to-control-it-here-what-ex-fda-chief-has-to-say-2022-08-10-798779", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/monkeypox-4-1660099984.jpg", "publishedAt": "2022-08-10T02:53:28Z", "content": "Despite the US declaring monkeypox a public health emergency, former US Food and Drugs Administration (FDA) chief Scott Gottlieb said that it is possible to prevent it from becoming an endemic virus … [+1518 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "‘How can Ashwin even come in India’s Asia Cup team? Look at his IPL record' - Hindustan Times", "description": "India picked two spinners and three spin-all-rounders for the Asia Cup 2022 slated to begin from August 27 in the UAE. The spin attack includes Yuzvendra Chahal, Ashwin, Ravi Bishnoi, Ravindra Jadeja and Deepak Hooda.", "url": "https://www.hindustantimes.com/cricket/how-can-he-even-come-in-india-s-asia-cup-team-look-at-his-ipl-record-kiran-more-questions-ashwin-s-selection-101660066708054.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/09/1600x900/New_Project_(65)_1643025682315_(3)_(1)_1660067157727_1660067164361_1660067164361.jpg", "publishedAt": "2022-08-10T01:44:03Z", "content": "BCCI on Monday revealed India's 15-members squad for the impending Asia Cup 2022 tournament. The squad saw the return of former captain Virat Kohli, who missed the West Indies tour and was been reste… [+2465 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Shiromani Sachin", "title": "Horoscope Today, August 10, Wednesday: Taurus Might Meet a Friend, Family Disputes Will End For Gemini - India.com", "description": "Horoscope Today, August 10, Wednesday:  Jyotish Guru Shiromani Sachin predicts the day for our readers.", "url": "https://www.india.com/astrology/horoscope-today-august-10-wednesday-taurus-might-meet-a-friend-family-disputes-will-end-for-gemini-5563823/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/08/Collage-Maker-01-Aug-2022-12.54-AM.jpg", "publishedAt": "2022-08-10T00:00:56Z", "content": "Horoscope Today, August 10, Wednesday: Wondering whats in store for you today? Well, weve you covered, Jyotish Guru- Shiromani Sachin predicts whats going to work for you today. Read on!Also Read - H… [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Mishra", "title": "What is the Electricity (Amendment) Bill, and why is it being opposed? - The Indian Express", "description": "Electricity (Amendment) Bill, explained: The government wants to give consumers a choice of multiple power suppliers as is the case with mobile and internet services, apart from making provisions for timely and adequate tariff revisions.", "url": "https://indianexpress.com/article/explained/electricity-amendment-bill-promise-problems-8081142/", "urlToImage": "https://images.indianexpress.com/2022/08/Singh.jpg", "publishedAt": "2022-08-09T22:50:44Z", "content": "The government Monday tabled the Electricity (Amendment) Bill 2022 in the Lok Sabha, soon after which it was referred to the parliamentary standing committee on energy for wider consultation with sta… [+5481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Explained: The PESA Act, and the reason behind parties trying to woo tribals in Gujarat - The Indian Express", "description": "Speaking in Gujarat, Arvind Kejriwal declared a six-point \"guarantee\" for tribals, including the \"strict implementation\" of the Panchayats (Extension to the Scheduled Areas) Act. What is the PESA Act? Why have there been implementation gaps?", "url": "https://indianexpress.com/article/explained/the-pesa-act-and-the-reason-behind-parties-trying-to-woo-tribals-in-gujarat-8081141/", "urlToImage": "https://images.indianexpress.com/2022/08/Gujarat.jpg", "publishedAt": "2022-08-09T22:49:30Z", "content": "The PESA Act was enacted in 1996 to provide for the extension of the provisions of Part IX of the Constitution relating to the Panchayats to the Scheduled Areas. Other than Panchayats, Part IX, compr… [+3899 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Chess Olympiad gold for Ukraine: 'But medal can't stop a war' - The Indian Express", "description": "Anna Ushenina, Ukraine's first women’s world champion, is from Kharkiv, just 30 miles from the Russia border and one of the heavily shelled cities in the invasion.", "url": "https://indianexpress.com/article/sports/chess/chess-olympiad-gold-for-ukraine-but-medal-cant-stop-a-war-8081154/", "urlToImage": "https://images.indianexpress.com/2022/08/Ukraine-Chess.jpg", "publishedAt": "2022-08-09T18:16:33Z", "content": "AFTER FORCING a draw from the clutches of defeat against Polands Oliwia Kiolbasa, guaranteeing a gold medal for Ukraine in the Chess Olympiad on Tuesday, Anna Ushenina quietly walked to the side of t… [+4986 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Vijay Swaroop", "title": "‘A parasite’: Bihar BJP leaders fume after Nitish Kumar pole vaults to RJD - Hindustan Times", "description": "Union minister Giriraj Singh dared Nitish Kumar to hold fresh elections and contest independently. “We followed the coalition dharma. I dare him to fight independently. He is a parasite. At times, he sticks to BJP, at times to RJD” | Latest News India", "url": "https://www.hindustantimes.com/india-news/nonsense-bihar-bjp-leaders-fume-after-nitish-kumar-pole-vaults-to-rjd-101660060205669.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/09/1600x900/e9e34e02-17f9-11ed-bfe2-b24397176b5f_1660061339996.jpg", "publishedAt": "2022-08-09T15:50:05Z", "content": "PATNA: Leaders of the Bharatiya Janata Party (BJP) in Bihar, angry with Bihar chief minister Nitish Kumar for teaming up with the Rashtriya Janata Dal (RJD), on Tuesday accused the Kumar-led Janata D… [+3137 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": "Shailaja Tripathi", "title": "CWG 2022: India finishes fourth in medal standings with 22 Gold; List of Indian Medal Winners and Medal Tally - Jagran Josh", "description": "Commonwealth Games 2022 India medals: Check the complete list of Indian Medal winners in the Commonwealth Games 2022 in Birmingham. India stood at 4th position in CWG 2022 medal standing with 22 Gold, 16 Silver, and 23 Bronze medals.", "url": "https://www.jagranjosh.com/general-knowledge/commonwealth-games-2022-list-of-indian-medal-winners-and-medal-tally-in-birmingham-1659355555-1", "urlToImage": "https://img.jagranjosh.com/images/2022/August/882022/compress_CWG_2022.jpg", "publishedAt": "2022-08-09T13:07:00Z", "content": "CWG2022: Indian Contingent was in its full form on the closing day of Commonwealth Games 2022 in Birmingham. With 22 Gold Medals, 16 Silver, and 23 Bronze, the star athletes of the country proudly ma… [+29689 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Monkeypox: A.2 strain found in 2 cases in India. Is this strain DEADLY? - DNAIndiaNews", "description": "India’s first two monkeypox cases were infected with the virus strain A.2. Indian Council of Medical Research has revealed this in its latest report monkeypo...", "url": "https://www.youtube.com/watch?v=AC4Yoyt7AN8", "urlToImage": "https://i.ytimg.com/vi/AC4Yoyt7AN8/maxresdefault.jpg", "publishedAt": "2022-08-08T14:46:26Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Bharti Airtel Q1 profit rises five-fold to Rs 1,607 crore - The Indian Express", "description": "Its consolidated revenue from operations increased by about 22 per cent to Rs 32,805 crore during the reported quarter from Rs 26,854 crore a year ago.", "url": "https://indianexpress.com/article/business/companies/bharti-airtel-q1-profit-rises-five-fold-to-rs-1607-crore-8078357/", "urlToImage": "https://images.indianexpress.com/2022/03/BHARTI-AIRTEL-REUTERS-1200.jpeg", "publishedAt": "2022-08-08T12:21:20Z", "content": "Telecom operator Bharti Airtel on Monday reported an over five-fold rise in its consolidated profit to Rs 1,607 crore for the first quarter ended June 30.The company had posted a profit of Rs 283.5 c… [+469 chars]"}]}