{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Mohan J", "title": "Umar Khalid discharged in Northeast Delhi riots case - The Indian Express", "description": "Umar Khalid and activist Khalid Saifi will continue to remain in judicial custody as they are yet to get bail in a UAPA case.", "url": "https://indianexpress.com/article/cities/delhi/umar-khalid-discharged-in-northeast-delhi-riots-case-8304211/", "urlToImage": "https://images.indianexpress.com/2022/12/Umar-Khalid.jpg", "publishedAt": "2022-12-03T11:40:06Z", "content": "A Delhi court on Saturday discharged former JNU student Umar Khalid and United Against Hate member Khalid Saifi in a case connected to the 2020 Northeast Delhi riots. However, they will continue to r… [+1554 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Amrit Burman", "title": "Indian telescope observes a powerful flash in sky as dying star comes near black hole - Republic World", "description": "A rare cosmic event that created a powerful flash due to the death of a star's encounter with a black hole has been observed by an Indian telescope.", "url": "https://www.republicworld.com/science/space/indian-telescope-observes-a-powerful-flash-in-sky-as-dying-star-comes-near-black-hole-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/xbqk3ztzzc8qu1sv_1670059150.jpeg", "publishedAt": "2022-12-03T10:26:00Z", "content": "A rare cosmic event that created a powerful flash due to the death of a star's encounter with a supermassive black hole has been recorded by a Himalayan telescope in Ladakh and a group of Indian astr… [+2149 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Aniruddha Dhar", "title": "Gangster Raju Theth killed in Rajasthan; NIA suspects Lawrence Bishnoi's hand - Hindustan Times", "description": "The NIA, while seeking the remand of Lawrence Bishnoi, stated that contract killing is happening in neighbouring Rajasthan as the gangster's involvement is also suspected in today's shootout in the state. | Latest News India", "url": "https://www.hindustantimes.com/india-news/gangster-raju-theth-shot-dead-in-rajasthan-s-sikar-nia-suspects-lawrence-bishnoi-s-hand-101670059607221.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/03/1600x900/sikar_1670061662017_1670061669024_1670061669024.png", "publishedAt": "2022-12-03T10:04:36Z", "content": "A Delhi court on Saturday extended gangster Lawrence Bishnoi's NIA remand by four days in connection with the Punjabi singer-politician Sidhu Moose Wala murder case. Bishnoi was produced before the c… [+2315 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jon Healy, Simon Smale", "title": "Marnus Labuschagne's century sets Australia up for first-Test victory, Kraigg Brathwaite shows West Indian grit in Perth - ABC News", "description": "Australia needs seven wickets to win the first Test against West Indies, who must survive one more day, requiring a nominal 306 more runs to win at Perth Stadium.", "url": "https://www.abc.net.au/news/2022-12-03/australia-west-indies-test-marnus-labuschagne-kraigg-brathwaite/101731098", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/9fbf03d0a13b884f65ef1deb6bc96690?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=108&width=862&height=485", "publishedAt": "2022-12-03T09:58:33Z", "content": "Australia needs seven wickets to win the first Test against West Indies, who must survive one more day, requiring a nominal 306 more runs to win at Perth Stadium.\r\nAnother magnificent Marnus Labuscha… [+4980 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Poulomi Ghosh", "title": "Sachin Pilot fixes specs and runs in video welcoming Bharat Jodo in Rajasthan - Hindustan Times", "description": "Following a tumultuous Pilot versus Gehlot episode which put a question mark on the success of the Bharat Jodo Yatra in Rajasthan, Sachin Pilot on Saturday released a video welcoming the yatra.  | Latest News India", "url": "https://www.hindustantimes.com/india-news/gehlot-versus-pilot-sachin-pilot-fixes-specs-and-runs-in-video-welcoming-bharat-jodo-in-rajasthan-watch-101670053918091.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/03/1600x900/sachin_pilot_1670054201853_1670054405779_1670054405779.JPG", "publishedAt": "2022-12-03T08:06:37Z", "content": "Congress leader Sachin Pilot ties his shoelace, stretches his body, fixes his glasses and starts running with the camera panning at the photo of Rahul Gandhi on the Bharat Jodo t-shirt that Pilot is … [+1818 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vice President Takes On Supreme Court Over Judges' Appointment, Chief Justice Of India Seated - NDTV", "description": "Vice President Jagdeep Dhankhar on Friday said there was \"no whisper\" in Parliament after the Supreme Court struck down the National Judicial Appointments Commission Act and described it as \"too serious an issue\".", "url": "https://www.ndtv.com/india-news/vice-president-takes-on-supreme-court-over-judges-appointment-chief-justice-of-india-seated-3573494", "urlToImage": "https://c.ndtvimg.com/2022-12/rev4kbkg_vice-president-jagdeep-dhankhar-cji-dy-chandrachud-ani_625x300_03_December_22.jpg", "publishedAt": "2022-12-03T07:17:12Z", "content": "Vice President Jagdeep Dhankhar criticised the Supreme Court over its repeal of NJAC Act\r\nNew Delhi: Vice President Jagdeep Dhankhar on Friday said there was \"no whisper\" in Parliament after the Supr… [+2727 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Reliance gears up for fight against D-Mart and hypermarkets as its looks to close Metro deal this month - Economic Times", "description": "Reliance is said to acquire Metro' India unit in a deal estimated at around 500 million euros (Rs 4,060 crore), which includes 31 wholesale distribution centres, land banks and other assets owned by METRO Cash & Carry in the country. This is going to aid Reli…", "url": "https://economictimes.indiatimes.com/industry/cons-products/fmcg/reliance-gears-up-for-fight-against-d-mart-and-hypermarkets-as-its-looks-to-close-metro-deal-this-month/articleshow/95957105.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95957104,width-1070,height-580,imgsize-61634,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-03T07:07:00Z", "content": "Reliance Industry's mega acquisition of German retailer METRO AG's Cash &amp; Carry business in India, which is likely to be finalised in time for the group's late founder Dhirubhai Ambani's birthday… [+2017 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Tina Choudhury", "title": "Garena's Free Fire Max Redeem Codes for 3 December, 2022 - EastMojo", "description": "Garena’s Free Fire has managed to amass a large fanbase in India due to its high-resolution graphics, continuous updates, and Free Fire Redeem Code. As", "url": "http://www.eastmojo.com/free-fire-max/2022/12/03/garenas-free-fire-max-redeem-codes-for-3-december-2022/", "urlToImage": "https://www.eastmojo.com/wp-content/uploads/2022/10/Garena-Free-Fire-Max1.jpg", "publishedAt": "2022-12-03T06:16:42Z", "content": "Garenas Free Fire has managed to amass a large fanbase in India due to its high-resolution graphics, continuous updates, and Free Fire Redeem Code.\r\nAs the free fire world is constantly changing ever… [+2733 chars]"}, {"source": {"id": null, "name": "OpIndia"}, "author": "OpIndia Staff", "title": "Twitter communication reveals how ‘Hunter Biden story’ was censored using dubious justification, with Vijaya Gadde at the helm: What happened - OpIndia", "description": "Vijaya Gadde, was at the helm of the censorship exercise of the Hunter Biden story under the garb of vague and arbitrary rules | OpIndia News", "url": "https://www.opindia.com/2022/12/how-twitter-censored-hunter-biden-story-internal-communication-elon-musk/", "urlToImage": "https://www.opindia.com/wp-content/uploads/2022/12/Opindia-Office-Work-5.jpg", "publishedAt": "2022-12-03T06:07:12Z", "content": "Days after Elon Musk vowed to restore public trust in Twitter, he revealed all internal communications pertaining to the censorship of the Hunter Biden story on the social media platform. The develop… [+9930 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Umran Malik Replaces Injured Pacer Mohammed Shami In India's ODI Squad vs Bangladesh - NDTV Sports", "description": "Mohammed Shami sustained a shoulder injury during a training session in the lead up to the ODI series against Bangladesh, informed BCCI in a press release.", "url": "https://sports.ndtv.com/bangladesh-vs-india-2022-23/umran-malik-replaces-injured-pacer-mohammed-shami-in-indias-odi-squad-vs-bangladesh-3574218", "urlToImage": "https://c.ndtvimg.com/2022-11/1s698ij_umran-malik_625x300_25_November_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-12-03T05:18:46Z", "content": "Senior fast bowler Mohammed Shami has been ruled out of the ODI series against Bangladesh, starting Sunday, due to a shoulder injury and replaced by Umran Malik in India's squad, the BCCI announced o… [+2341 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Arvind Ojha", "title": "Aaftab used Chinese knife to dismember Shraddha's body, chopped her hands first: Sources - India Today", "description": "It has been found during the investigation that the accused in the Shraddha Walker murder case, Aaftab Ameen Poonawala, used a Chinese knife to cut her body. As per the sources, he first chopped her hands after strangling her.", "url": "https://www.indiatoday.in/india/story/aaftab-poonawala-used-chinese-knife-dismember-shraddha-walkar-body-chopped-hands-first-sources-2304718-2022-12-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/aaftab_ameen-sixteen_nine.jpg?VersionId=NanrGXIfjL6plICKKERVzClBZbMK7TUr", "publishedAt": "2022-12-03T05:05:00Z", "content": "By Arvind Ojha: As the gruesome details of the Shraddha Walkar murder case continue to unravel, as per the sources, it has been found during the investigation that the accused, Aaftab Ameen Poonawala… [+1327 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "‘I carry India with me wherever I go’: Google and Alphabet CEO Sundar Pichai - India Today", "description": "Google and Alphabet CEO Sundar Pichai received the prestigious Padma Bhushan award from the Indian envoy to the US on Friday in San Francisco.", "url": "https://www.indiatoday.in/india/story/india-is-part-of-me-google-and-alphabet-ceo-sundar-pichai-padma-bhushan-2304717-2022-12-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/pichai-sixteen_nine.jpg?VersionId=TaSDtAN2JBj6RQPaOJQvo5T5zzBs6UX4", "publishedAt": "2022-12-03T02:35:23Z", "content": "By India Today Web Desk: Google and Alphabet CEO Sundar Pichai was bestowed with the renowned Padma Bhushan award from the Indian envoy to the US. While receiving the award, Pichai said, India is a p… [+1988 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Agencies", "title": "What will the Russian oil price cap do to markets like India, China - Economic Times", "description": "The G-7 has mostly decided to stop its own imports of Russian crude so the move is aimed squarely at other big buyers such as China, India and Turkey. Those countries have not signed up, but the US hopes they will use the threshold as a bargaining chip.", "url": "https://economictimes.indiatimes.com/industry/energy/oil-gas/what-will-the-russian-oil-price-cap-do-to-markets-like-india-china/articleshow/95951090.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95951087,width-1070,height-580,imgsize-20254,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-03T00:06:00Z", "content": "The Group of Seven will impose a price cap on Russian oil thats well above where it now trades. If there was ever any doubt what the premise of the cap was, its now clear: the US and its allies want … [+5390 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Reuters", "title": "US designates Iran, China, Russia as countries of concern over religious freedom - India Today", "description": "The United States on Friday designated China, Iran and Russia, among others, as countries of particular concern under the Religious Freedom Act over severe violations, US Secretary of State Antony Blinken said.", "url": "https://www.indiatoday.in/world/story/us-designates-iran-china-russia-as-countries-of-concern-over-religious-freedom-2304700-2022-12-03", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/iran-sixteen_nine.jpg?VersionId=FbwE4kYwlG4avCJx0OrPd.G643rIW0Iw", "publishedAt": "2022-12-02T21:41:07Z", "content": "By Reuters: \r\nThe United States on Friday designated China, Iran and Russia, among others, as countries of particular concern under the Religious Freedom Act over severe violations, US Secretary of S… [+3313 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "'Kickin Keto Gummies' Reviews - Website Fact Check - Shocking \"Side Effects\" Exposed! - The Tribune India", "description": "Are you searching for a simple, keto-friendly method to supplement your diet regimen? If so, you remain in luck! Kickin Keto Gummies are a delicious as well as convenient method to do simply that. These gummies are made with ACV (apple cider vinegar) as well …", "url": "https://www.tribuneindia.com/news/brand-connect/kickin-keto-gummies-reviews-website-fact-check-shocking-side-effects-exposed-457064", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1325418780.png", "publishedAt": "2022-12-02T19:38:00Z", "content": "Are you searching for a simple, keto-friendly method to supplement your diet regimen? If so, you remain in luck! Kickin Keto Gummies are a delicious as well as convenient method to do simply that. Th… [+8984 chars]"}]}