{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "India vs Nepal Live Score Women’s Asia Cup T20 2024: IND: 91/0 after 10 overs; Shafali Verma races to fifty, Mandhana steps in as captain - The Indian Express", "description": "IND Women vs NEP Women Asia Cup T20I 2024 Live Score: After a strong start from Shafali Verma and Dayalan Hemalatha, Jemimah Rodrigues was able to provide finishing touches to the Indian innings.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-nepal-live-score-womens-asia-cup-t20-2024-match-today-ind-women-vs-nep-women-latest-scorecard-updates-9470344/", "urlToImage": "https://images.indianexpress.com/2024/07/India-vs-Nepal-W.jpg", "publishedAt": "2024-07-23T14:10:17Z", "content": "India Women: Shafali Verma, Smriti Mandhana, Dayalan Hemalatha, Harmanpreet Kaur(c), Jemimah Rodrigues, Richa Ghosh(w), Deepti Sharma, Pooja Vastrakar, Radha Yadav, Renuka Thakur Singh, Tanuja Kanwar… [+292 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "MD Ijaj Khan", "title": "Vivo V40 Pro appears on Geekbench and Bluetooth SIG ahead of India launch: Here’s what to expect - HT Tech", "description": "Vivo is set to launch its V40 series in India. The Vivo V40 Pro recently appeared on Geekbench and Bluetooth SIG, revealing key specifications ahead of its debut.", "url": "https://tech.hindustantimes.com/mobile/news/vivo-v40-pro-appears-on-geekbench-and-bluetooth-sig-ahead-of-india-launch-here-s-what-to-expect-71721715819320.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2024/07/23/1600x900/Vivo_V40_Pro_appears_on_Geekbench_and_Bluetooth_SI_1721716113508_1721716113730.PNG", "publishedAt": "2024-07-23T06:31:40Z", "content": "Vivo is preparing to introduce its V40 series in India, a successor to the V30 lineup. The new series is anticipated to include the Vivo V40 and Vivo V40 Pro models. Recent findings by Mysmartprice s… [+2625 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Mishra3", "title": "Explore the Cosmos: A summer road trip with Nasa's Chandra and Webb - The Times of India", "description": "The tour begins with Rho Ophiuchi, about 390 light-years away. This nearby star-forming region features a mix of gas and stars. Chandra's X-rays, shown in purple, highlight young stars, while Webb's infrared data in various colors reveal intricate gas and dus…", "url": "https://timesofindia.indiatimes.com/science/explore-the-cosmos-a-summer-road-trip-with-nasas-chandra-and-webb/photostory/111921417.cms", "urlToImage": "https://static.toiimg.com/photo/111921558.cms", "publishedAt": "2024-07-22T09:25:22Z", "content": "Your Privacy\r\nWhen you visit our website, we store cookies on your browser to collect information. The information collected might relate to you, your preferences or your device, and is mostly used t… [+2093 chars]"}]}