{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dan Keating", "title": "How The Post found growing rates of young cancer in America’s Corn Belt - The Washington Post", "description": "In looking into shifting cancer rates, a Washington Post data analysis revealed a divergence: among young adults in the Corn Belt — Iowa, Nebraska, Illinois, Minnesota, Indiana and Kansas — cancer diagnoses are rising more rapidly than in the country as a who…", "url": "https://www.washingtonpost.com/health/2025/10/27/iowa-cancer-analysis-methodology/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CZWEJCR7GIRVFVMYG2TB5YI4C4_size-normalized.jpg&w=1440", "publishedAt": "2025-10-28T00:02:07Z", "content": "In looking into shifting cancer rates, a Washington Post data analysis revealed a divergence: among young adults in the Corn Belt Iowa, Nebraska, Illinois, Minnesota, Indiana and Kansas cancer diagno… [+123 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Isabella Volmert", "title": "Indiana Gov. Mike Braun calls a special session to redraw the state’s congressional boundaries - AP News", "description": "Indiana Republican Gov. Mike Braun has called a special session and directed state lawmakers to redraw the state’s congressional districts. The move announced Monday follows weeks of pressure from the White House to back President Donald Trump’s bid help Repu…", "url": "https://apnews.com/article/indiana-redistricting-special-session-braun-63f3447efcc34529dfc363a96a763b6e", "urlToImage": "https://dims.apnews.com/dims4/default/e126415/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F22%2F79d709ee2fb580cc61212b08115d%2Fbc0809c4dc514cf5ba358f510cd0b6e0", "publishedAt": "2025-10-27T16:27:00Z", "content": "The Republican governor of Indiana said Monday hes scheduling a special session to redraw congressional boundaries after weeks of pressure to back President Donald Trumps bid to add more winnable sea… [+5233 chars]"}]}