{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Only 10 per cent of vaccinated people need hospitalisation after COVID infection: ICMR - Times of India", "description": "Various studies are being conducted to understand the possible reason for people contracting COVID-19 infection after being fully vaccinated.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/only-10-per-cent-of-vaccinated-people-need-hospitalisation-after-covid-infection-icmr/photostory/84523349.cms", "urlToImage": "https://static.toiimg.com/photo/84523387.cms", "publishedAt": "2021-07-19T08:30:00Z", "content": "Fever was found to be the most common symptom among people who tested positive, followed by body ache, including headache, cough, nausea, sore throat, loss of smell, diarrhoea, breathlessness and som… [+411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India LIVE updates: SC to hear plea against Kerala’s lockdown relaxation for Bakrid - The Indian Express", "description": "With 499 new fatalities, the death toll is now over 4.14 lakh. Daily death count falls below 500 for the first time since April 6.", "url": "https://indianexpress.com/article/india/coronavirus-india-live-updates-delhi-kerala-deaths-cases-vaccine-7411296/", "urlToImage": "https://images.indianexpress.com/2021/07/Kerala-1.jpg", "publishedAt": "2021-07-19T07:11:35Z", "content": "Crowd at the Vizhinjam fishing harbour in Thiruvananthapuram after Covid-19 restrictions were eased. (Photo: PTI)Coronavirus India Live Updates: A plea was filed in the Supreme Court on Monday agains… [+2791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Satvik Khare", "title": "Realme Buds Q2 Neo TWS Earbuds to Launch in India on July 23 With 20 Hours of Playback Time - Gadgets 360", "description": "Realme Buds Q2 Neo to launch in India on July 23 at 12:30pm IST via official Realme channels. The Buds Q2 Neo are a rebranded version of the Realme Buds Q2 sold in Pakistan. Most of the specifications of the TWS earbuds have been listed on a dedicated microsi…", "url": "https://gadgets.ndtv.com/audio/news/realme-buds-q2-neo-india-launch-date-july-23-tws-earbuds-specifications-features-game-mode-enc-2489710", "urlToImage": "https://i.gadgets360cdn.com/large/realme_buds_q2_neo_main_twitter_1626677390554.jpg", "publishedAt": "2021-07-19T07:05:12Z", "content": "Realme Buds Q2 Neo will be launched in India on July 23. The true wireless stereo (TWS) earbuds are expected to be rebranded Realme Buds Q2 that are sold in Pakistan. The Realme Buds Q2 sold in India… [+1925 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Indian parliament opens amid Pegasus spyware row - bbc.com", "description": "Spyware from an Israeli firm was allegedly used to hack phones of Indian MPs and journalists.", "url": "https://www.bbc.com/news/world-asia-india-57884096", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/E504/production/_119482685_gettyimages-1234046719.jpg", "publishedAt": "2021-07-19T06:58:52Z", "content": "image copyrightGetty Images\r\nimage captionPM Modi held an all-party meeting ahead of the monsoon session of parliament\r\nIndia's parliament has begun a new session on Monday amid allegations that spyw… [+3202 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "Stock Market Live Updates: Sensex falls over 350 points, Nifty below 15,850; banks drag - CNBCTV18", "description": "Stock Market Live Updates: Indian equity indices, Sensex and Nifty are trading sharply lower Monday following losses in global peers amid concerns over a surge in Delta variant of the coronavirus in Asian countries. Midcap and smallcap are mixed. Among sector…", "url": "https://www.cnbctv18.com/market/stocks/stock-market-live-updates-indian-indices-likely-to-start-the-week-lower-following-negative-global-cues-10029481.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2019/08/bse.jpg", "publishedAt": "2021-07-19T06:28:34Z", "content": "Opening Bell: Sensex opens over 350 points lower, Nifty below 15,800; banks drag\r\nIndian indices started the week on a negative on Monday following losses in global peers as fears of rising inflation… [+556 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Hannah Ellis-Petersen", "title": "Dozens dead in Mumbai after ‘monstrous’ monsoon rains cause landslide - The Guardian", "description": "Thunderstorm that caused the intense rainfall in Indian city was described as ‘uncommon’ for the time of year", "url": "https://amp.theguardian.com/world/2021/jul/19/deaths-mumbai-monsoon-rains-landslide-india", "urlToImage": null, "publishedAt": "2021-07-19T06:07:00Z", "content": "IndiaThunderstorm that caused the intense rainfall in Indian city was described as uncommon for the time of year\r\nMon 19 Jul 2021 07.05 BST\r\nMore than 30 people have died in the Indian city of Mumbai… [+2791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "Sri Lanka vs India: Ishan Kishan Told His Teammates He Was Going To Hit First Ball For A Six - NDTVSports.com", "description": "Ishan Kishan revealed that he had already told his teammates that he was going to hit his first ball for a six in his ODI debut against Sri Lanka.", "url": "https://sports.ndtv.com/sri-lanka-vs-india-2021/sl-vs-ind-1st-odi-ishan-kishan-told-his-teammates-he-was-going-to-hit-first-ball-for-a-six-2489642", "urlToImage": "https://c.ndtvimg.com/2021-07/55b0liu8_ishan-kishan-afp_625x300_19_July_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2021-07-19T05:44:57Z", "content": "India wicketkeeper-batsman Ishan Kishan got off to a blistering start in his ODI career, smashing 59 off just 42 deliveries as India chased 263 with ease to beat Sri Lanka in the first ODI in Colombo… [+2172 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: Can you contract two COVID-19 variants at the same time? - Times of India", "description": "What are the chances of one being susceptible to such a scenario? If so, what should we know about the same?", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-can-you-contract-two-covid-19-variants-at-the-same-time/photostory/84542888.cms", "urlToImage": "https://static.toiimg.com/photo/84543043.cms", "publishedAt": "2021-07-19T05:36:00Z", "content": "The incidents of co-infection, or developing two strains of the virus at the same time are isolated incidents but do have a lot of similarities in question.\r\nIn the first case, wherein the older woma… [+1429 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "‘Ask sharpest questions but allow Govt to respond’: PM Modi tells Opposition ahead of Parliament Monsoon Session - The Indian Express", "description": "\"This will boost the democracy, strengthen people's trust and improve the pace of development,\" PM Modi said ahead of the session.", "url": "https://indianexpress.com/article/india/narendra-modi-parliament-monsoon-session-7411482/", "urlToImage": "https://images.indianexpress.com/2021/07/Mdi-1.jpg", "publishedAt": "2021-07-19T05:02:08Z", "content": "Marking the beginning of the Parliament Monsoon Session, Prime Minister Narendra Modi Monday urged the opposition members to raise hard questions but in a peaceful atmosphere without creating pandemo… [+2558 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chiranjivi Chakraborty", "title": "Current bull market won’t vanish like the one in 1992, says Jhunjhunwala - Economic Times", "description": "Jhunjhunwala, who entered the market at the peal of a ferocious bull market in Indian stocks in 1991-92 before it came crashing down, said he doesnt see the scope for a similar correction in the near term.", "url": "https://economictimes.indiatimes.com/markets/stocks/news/current-bull-market-wont-vanish-like-the-one-in-1992-says-jhunjhunwala/articleshow/84540859.cms", "urlToImage": "https://img.etimg.com/thumb/msid-84540835,width-1070,height-580,imgsize-66749,overlay-etmarkets/photo.jpg", "publishedAt": "2021-07-19T03:32:00Z", "content": "MUMBAI: Billionaire investor Rakesh Jhunjhunwala is convinced the ongoing bull market in Indian equities wont vanish like the one that had set his career for greatness way back in the early 1990s.\r\nJ… [+1937 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Abhinav Bindra: ‘Don’t know how Olympics will transpire. Must go in with open mind. Protocols in place, but will they be enough? Don’t know’ - The Indian Express", "description": "Set to begin on July 23, the Tokyo Olympics are expected to be a watered-down version of past years, with stringent quarantine rules and a host of regulations for athletes from 206 nations.", "url": "https://indianexpress.com/article/olympics/abhinav-bindra-dont-know-how-olympics-will-transpire-must-go-in-with-open-mind-protocols-in-place-but-will-they-be-enough-dont-know/", "urlToImage": "https://images.indianexpress.com/2021/07/abhinav-bindra.jpg", "publishedAt": "2021-07-19T00:56:22Z", "content": "Abhinav Bindra talks about battling depression post Olympics, believes that if communities take up sports, medals will follow, calls for better governance in day-to-day sports affairs, and says he wa… [+17814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No trace of mRNA vaccine in breast milk: small study - The Indian Express", "description": "The study analysed the breast milk of seven women after they received mRNA vaccines from Pfizer or Moderna in the US.", "url": "https://indianexpress.com/article/explained/no-trace-of-mrna-vaccine-in-breast-milk-small-study-7411042/", "urlToImage": "https://images.indianexpress.com/2021/06/Vaccine-new.jpg", "publishedAt": "2021-07-18T22:40:18Z", "content": "Messenger RNA vaccines against Covid-19 were not detected in human milk, according to a small study by University of California, San Francisco. The paper appears in JAMA Pediatrics.\r\nThe study analys… [+1014 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sakshi Dayal", "title": "One person rescued: 4-5 men feared buried as building collapses in Gurgaon - The Indian Express", "description": "Delhi News: According to officials, the structure was located on the premises of the 'Cargo Deluxe Company' and served as a residence for the employees.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-building-collapses-one-rescued-several-trapped-inside-7410959/", "urlToImage": "https://images.indianexpress.com/2021/07/WhatsApp-Image-2021-07-18-at-10.50.06-PM.jpeg", "publishedAt": "2021-07-18T19:07:17Z", "content": "A three-storey building collapsed in Gurgaon’s Khawaspur village at 7 pm on Sunday, with police officials stating that “four to five people” are suspected to be buried under the rubble.\r\nAccording to… [+1671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yubaraj Ghimire", "title": "Sher Bahadur Deuba wins vote of confidence in Nepal Parliament - The Indian Express", "description": "A total of 165 members voted in support of Deuba, with just 83, mostly loyalists of CPN-UML chairman and outgoing prime minister K P Sharma Oli, casting their votes against.", "url": "https://indianexpress.com/article/world/nepal-new-pm-sher-bahadur-deuba-wins-vote-of-confidence-in-parliament-7410942/", "urlToImage": "https://images.indianexpress.com/2021/07/Sher-Bahadur-Deuba-1.jpg", "publishedAt": "2021-07-18T18:45:00Z", "content": "Nepal Prime Minister Sher Bahadur Deuba secured a comfortable majority in the House of Representatives on Sunday, with his Nepali Congress being joined by most other parties including a section of th… [+2669 chars]"}, {"source": {"id": null, "name": "Big News Network"}, "author": null, "title": "Tokyo Olympics: Athletes to start training on July 19 - Big News Network", "description": "The Indian Contingent that departed for Tokyo from New Delhi on July 17 after an official send-off at the Indira Gandhi International Airport have safely reac", "url": "https://www.bignewsnetwork.com/news/270347969/tokyo-olympics-athletes-to-start-training-on-july-19", "urlToImage": "https://cdn.bignewsnetwork.com/ani1626619343.jpg", "publishedAt": "2021-07-18T14:37:00Z", "content": "Tokyo [Japan], July 18 (ANI): The Indian Contingent that departed for Tokyo from New Delhi on July 17, after an official send-off at the Indira Gandhi International Airport, have safely reached Japan… [+1186 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Pakistani fighters, Taliban told to target India-built assets in Afghanistan: Report - Hindustan Times", "description": "As per estimates and inputs, more than 10,000 Pakistanis have entered the war zone in Afghanistan to openly support the Taliban's offensive against the Ashraf Ghani-led Afghanistan government. | World News", "url": "https://www.hindustantimes.com/world-news/pakistani-fighters-taliban-told-to-target-india-built-assets-in-afghanistan-report-101626609876295.html", "urlToImage": "https://images.hindustantimes.com/img/2021/07/18/1600x900/AFP_9F94RG_1626610061432_1626610078622.jpg", "publishedAt": "2021-07-18T12:14:13Z", "content": "With the Taliban being joined by Pakistanis in Afghanistan in large numbers, their fighters have been instructed by the Inter-Services Intelligence (ISI) to target the Indian-built assets in the war-… [+1904 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "NIRMALA GANAPATHY", "title": "Singapore Tourism Board keeps Indian market engaged with virtual adventure - The Straits Times", "description": "NEW DELHI - The Singapore Tourism Board (STB) is taking Indian audiences on a virtual adventure in Singapore.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/south-asia/singapore-tourism-board-keeps-indian-market-engaged-with-virtual-adventure", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/07/18/yq-bheem-18072022.jpg?itok=L14Ps1y9", "publishedAt": "2021-07-18T09:40:23Z", "content": "NEW DELHI - The Singapore Tourism Board (STB) is taking Indian audiences on a virtual adventure in Singapore.\r\nWith travel between India and Singapore shut down by the pandemic, STB has tied up with … [+1133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "COVID scare at Olympics: 3 athletes test positive for COVID-19, 2 staying at Olympic Village - The Indian Express", "description": "It is the first instance of athletes staying at the village catching the infection. Their identities have not been revealed by the organisers. The third infected athlete is staying at a designated Games hotel.", "url": "https://indianexpress.com/article/olympics/covid-scare-at-olympics-3-athletes-test-positive-for-covid-19-2-staying-at-olympic-village-7410235/", "urlToImage": "https://images.indianexpress.com/2021/07/tokyo-2020-olympics.jpg", "publishedAt": "2021-07-18T04:23:46Z", "content": "Three athletes, two of them staying at the Olympic Village, have tested positive for COVID-19, the Games Organising Committee announced on Sunday.\r\nIt is the first instance of athletes staying at the… [+1435 chars]"}]}