{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Asia Cup 2022, India vs Pakistan Live Updates: After Bhuvneshwar Kumar's Strike, Mohammad Rizwan-Fakhar Zaman Consolidate - NDTV Sports", "description": "Asia Cup 2022, IND vs PAK Score Updates: Pakistan eye a recovery after losing both Babar Azam and Fakhar Zaman in the powerplay", "url": "https://sports.ndtv.com/asia-cup-2022/india-vs-pakistan-group-a-match-ind-vs-pak-live-score-updates-3293955", "urlToImage": "https://c.ndtvimg.com/2022-08/tir37e3o_team-india-afp_625x300_28_August_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-08-28T14:37:04Z", "content": "Asia Cup 2022, India vs Pakistan Live Updates: Pakistan eye a recovery after losing both Babar Azam and Fakhar Zaman in the powerplay. Bhuvneshwar Kumar gave India the early breakthrough as he dismis… [+2021 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "India demolishes illegal apartment blocks - highest buildings in country to be razed to the ground - Sky News", "description": "", "url": "https://news.sky.com/story/india-demolishes-illegal-apartment-blocks-highest-buildings-in-country-to-be-razed-to-the-ground-12683725", "urlToImage": "https://e3.365dm.com/22/08/1600x900/skynews-new-delhi-india-apartment-blocks_5879078.jpg?20220828134021", "publishedAt": "2022-08-28T13:03:49Z", "content": "Two illegally-constructed skyscrapers near New Delhi have been demolished, with thousands of kilos of explosives razing them to the ground in less than 10 seconds.\r\nThe apartment blocks on the outski… [+1578 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Aniruddha Dhar", "title": "After Himanta's ‘London-Paris’, ‘invitation’ to Sisodia dig, Kejriwal responds - Hindustan Times", "description": "Himanta Biswa Sarma and Arvind Kejriwal had been engaging in verbal tussle on Twitter over the last few days, each of them asking the other to visit their state and witness the development work undertaken there. | Latest News India", "url": "https://www.hindustantimes.com/india-news/after-himanta-sarma-s-london-paris-invitation-to-manish-sisodia-dig-arvind-kejriwal-responds-101661688720587.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/28/1600x900/kejriwal_1661691107416_1661691120956_1661691120956.jpg", "publishedAt": "2022-08-28T12:58:22Z", "content": "Assam chief minister Himanta Biswa Sarma and his Delhi counterpart Arvind Kejriwal on Sunday engaged in another round of verbal duels on Twitter, with the former claiming that the AAP chief was compa… [+2858 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ashok Sharma", "title": "2 high-rise towers in India demolished for violating laws - The Associated Press - en Español", "description": "NEW DELHI (AP) — Two high-rise apartment towers in India were leveled to the ground in a controlled demolition on Sunday after the country's top court declared them illegal for violating building norms, officials said.", "url": "https://apnews.com/article/india-new-delhi-04076a2cf467f7f3b7760113212ca752", "urlToImage": "https://storage.googleapis.com/afs-prod/media/3de4464dda8e4956a4df65a7efbab35a/3000.jpeg", "publishedAt": "2022-08-28T12:53:21Z", "content": "NEW DELHI (AP) Two high-rise apartment towers in India were leveled to the ground in a controlled demolition on Sunday after the countrys top court declared them illegal for violating building norms,… [+2778 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Savarkar Flew Out Of Jail On Birds: Karnataka Book For Class 8 Students - NDTV", "description": "Mr Savarkar's role in the Indian freedom struggle has been a big ideological flashpoint between the Rashtriya Swayamsevak Sangh, or RSS -- the ideological mentor of the BJP -- and rival Congress.", "url": "https://www.ndtv.com/india-news/savarkar-lesson-in-revised-karnataka-school-textbooks-triggers-outrage-3294207", "urlToImage": "https://c.ndtvimg.com/2019-05/b27tr08o_veer-savarkar-may-28_625x300_28_May_19.jpg", "publishedAt": "2022-08-28T12:10:48Z", "content": "\"Bulbul birds used to visit the room, and Savarkar used to sit on their wings and fly out,\" it said.\r\nBengaluru: A fresh controversy has erupted in Karnataka over charges of \"rewriting history\" by th… [+769 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "India Education Diary Bureau Admin", "title": "Oxford University launch new clinical trial to test a treatment for monkeypox - India Education Diary", "description": "The team behind the world-leading RECOVERY trial of COVID-19 treatments are leading a new study investigating a potential treatment for people who have been diagnosed with monkeypox. The National Institute for Health and Care Research (NIHR) has comm", "url": "https://indiaeducationdiary.in/oxford-university-launch-new-clinical-trial-to-test-a-treatment-for-monkeypox/", "urlToImage": "https://i0.wp.com/indiaeducationdiary.in/wp-content/uploads/2021/05/Oxford_skyline_0.jpg?fit=1024%2C491&ssl=1", "publishedAt": "2022-08-28T12:04:26Z", "content": "The team behind the world-leading RECOVERY trial of COVID-19 treatments are leading a new study investigating a potential treatment for people who have been diagnosed with monkeypox. The National Ins… [+6432 chars]"}, {"source": {"id": null, "name": "CanIndia News"}, "author": "NewsWire", "title": "Combination 'polypill' may lower major cardiovascular events risks - CanIndia News", "description": "Older heart disease patients who took a combination “polypill” made up of three different medications had a lower risk of major cardiovascular events, finds a new study. The study, published in the New England Journal of Medicine, showed that “polypill” effec…", "url": "https://www.canindia.com/combination-polypill-may-lower-major-cardiovascular-events-risks/", "urlToImage": "https://www.canindia.com/wp-content/uploads/2022/03/imageCireplace.png", "publishedAt": "2022-08-28T11:20:09Z", "content": "Older heart disease patients who took a combination “polypill” made up of three different medications had a lower risk of major cardiovascular events, finds a new study.\r\nThe study, published in the … [+1879 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Rahul Gandhi or a new face? Congress to elect its president on October 17 - Hindustan Times", "description": "The notification for Congress president's election will be issued on September 22, while the filing of nomination will begin on September 24 and continue till September 30. The election, if required, will take place on October 17. | Latest News India", "url": "https://www.hindustantimes.com/india-news/election-for-congress-president-to-be-held-on-october-17-101661682471947.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/28/1600x900/congress_1661682643161_1661682655709_1661682655709.png", "publishedAt": "2022-08-28T10:33:42Z", "content": "The election for the Congress president post will be held on October 17 and the counting will be conducted on October 19, if required. The Congress Working Committee (CWC), the party's highest decisi… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Space news weekly recap: Artemis moon mission, Webb Telescope, dark energy and more - The Indian Express", "description": "From the Ingenuity Mars Helicopter getting back in action, to why the return to the Moon with the Artemis program is important, here is our weekly space news recap.", "url": "https://indianexpress.com/article/technology/science/space-news-weekly-recap-nasa-artemis-james-webb-dark-energy-8116991/", "urlToImage": "https://images.indianexpress.com/2022/08/NASA-Artemis-James-Webb-Space-news-weekly-recap-20220828.jpg", "publishedAt": "2022-08-28T10:23:10Z", "content": "After a gap of close to 50 years after the last Apollo mission, NASA plans to herald a new age of space exploration by returning to the Moon with the Artemis program, starting with the Artemis I laun… [+6651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Was Actually Touched By The Way They...\": Babar Azam On Team India - NDTV Sports", "description": "Pakistan captain Babar Azam has now said that he was touched with the way Team India came up to Shaheen to check up on his injury.", "url": "https://sports.ndtv.com/asia-cup-2022/was-actually-touched-by-the-way-they-babar-azam-on-team-india-3293726", "urlToImage": "https://c.ndtvimg.com/2022-08/2q30eidg_babar-azam-twitter_625x300_21_August_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-08-28T08:39:33Z", "content": "Ahead of the Asia Cup 2022 match against India and Pakistan, players from both camps have been exchanging pleasantries during the training session. One heartwarming incident happened on Thursday when… [+1916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Perseverance rover unearths clues about Martian geology and water history - The Indian Express", "description": "Scientists were surprised when NASA’s Perseverance Mars rover began examining rocks on the floor of Jezero Crater. The floor of the crater seemed to contain rocks that were formed deep underground instead of from volcanic activity at the surface.", "url": "https://indianexpress.com/article/technology/science/nasa-mars-perseverance-rover-geology-8116440/", "urlToImage": "https://images.indianexpress.com/2022/08/NASA-Perseverance-selfie-20220828.jpg", "publishedAt": "2022-08-28T06:41:05Z", "content": "Scientists anticipate that the rock samples collected by NASAs Perseverance rover will provide a timeline for the planets geologic and water history. But they will have to wait an entire decade befor… [+2699 chars]"}, {"source": {"id": null, "name": "Newsdayexpress.com"}, "author": "Shehnaz Ali", "title": "This handsome smartphone is equipped with 108MP camera and 8GB RAM storage, know the price and features - News Day Express", "description": "China's Transition Group has launched Infinix Note 12 Pro in the Indian market today. It has a waterdrop style display, triple rear camera and 108", "url": "https://www.newsdayexpress.com/tech/this-handsome-smartphone-is-equipped-with-108mp-camera-and-8gb-ram-storage-know-the-price-and-features/", "urlToImage": "https://dainikbhaskarup.com/wp-content/uploads/2022/08/Infinix-Note-12-Pro-1024x576.jpg", "publishedAt": "2022-08-28T05:37:20Z", "content": "China’s Transition Group has launched Infinix Note 12 Pro in the Indian market today. It has a waterdrop style display, triple rear camera and 108 megapixel sensor. It has MediaTek Helio G99 SoC with… [+1941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Sonali Phogat death: How meth might have caused heart failure - The Indian Express", "description": "‘Methamphetamine on its own might not cause the heart attack but it can result in a cardiac arrest if consumed in an excess quantity. The recreational drugs can lead to over sedation, which can affect the organs, including the heart,’ says expert", "url": "https://indianexpress.com/article/lifestyle/health-specials/sonali-phogat-death-how-meth-might-have-caused-heart-failure-8116335/", "urlToImage": "https://images.indianexpress.com/2022/08/sonali-phogat-1200-1.jpeg", "publishedAt": "2022-08-28T05:37:00Z", "content": "The drug seized in relation to the murder case of BJP leader and actor Sonali Phogat has been identified as Methamphetamine, a central nervous system stimulant used as arecreational drug and therapy … [+1804 chars]"}, {"source": {"id": "espn-cric-info", "name": "ESPN Cric Info"}, "author": "Shashank Kishore", "title": "Dravid links up with team in Dubai in time for India vs Pakistan fixture - ESPNcricinfo", "description": "Head coach travelled across after returning negative Covid-19 test; VVS Laxman expected to return to Bengaluru", "url": "https://www.espncricinfo.com/story/asia-cup-2022-ind-vs-pak-rahul-dravid-links-up-with-team-in-dubai-in-time-for-india-vs-pakistan-fixture-1331194", "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/343700/343724.6.jpg", "publishedAt": "2022-08-28T05:35:00Z", "content": "NewsHead coach travelled across after returning negative Covid-19 test; VVS Laxman expected to return to Bengaluru"}, {"source": {"id": null, "name": "EastMojo"}, "author": "The Conversation", "title": "‘Tomato flu’ outbreak in India – here’s what it really is - EastMojo", "description": "A “new virus” called tomato flu has been reported in Kerala, India. According to an article in The Lancet Respiratory Medicine, the first case of this", "url": "http://www.eastmojo.com/health/2022/08/28/tomato-flu-outbreak-in-india-heres-what-it-really-is/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/08/tomato-flu-1.jpg?fit=1920%2C1080&ssl=1", "publishedAt": "2022-08-28T05:30:00Z", "content": "A new virus called tomato flu has been reported in Kerala, India. According to an article in The Lancet Respiratory Medicine, the first case of this mysterious illness was reported on May 6. There ha… [+3767 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Etiquette breach: Delhi, Beijing spar over Chinese ‘spy ship’ at Sri Lanka port - India Today", "description": "India has issued a scathing rejoinder after a Chinese diplomat took veiled dig at Sri Lanka's \"northern neighbour\" for objecting to the docking of a Chinese military vessel at Hambantota port.", "url": "https://www.indiatoday.in/india/story/etiquette-breach-delhi-beijing-spar-chinese-ship-in-sri-lanka-hambantota-port-1993483-2022-08-28", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/000_32GL3LA-647x363.jpeg?O3quTLe3V9QmbP5zUITHOPmYrMmhfObq", "publishedAt": "2022-08-28T04:10:27Z", "content": "India and China were locked in a verbal sparring match over a Chinese military vessel that arrived in Sri Lankas Hambantota port earlier this month.\r\nThe war of words was triggered by Chinese ambassa… [+2398 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA Web Team", "title": "LEAKED: Apple iPhone 14 Pro, iPhone 14 Pro Max designs revealed ahead of launch - DNA India", "description": "The photos for the iPhone 14 Pro and iPhone 14 Pro Max have been leaked ahead of the Apple Event on September 7.", "url": "https://www.dnaindia.com/technology/report-leaked-apple-iphone-14-pro-iphone-14-pro-max-designs-revealed-ahead-of-launch-2980195", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/08/28/2533831-untitled-design-30.jpg", "publishedAt": "2022-08-28T02:49:00Z", "content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: Aug 28, 2022, 06:08 PM ISTThe iPhone 14 will be launched on September 7 at the Apple Far Out event. Apple has officially announce… [+1648 chars]"}, {"source": {"id": null, "name": "VOGUE India"}, "author": "Woodstock Witch", "title": "Taurus Horoscope Today: August 28, 2022 - VOGUE India", "description": "Read VOGUE India's free daily Taurus horoscope for 28th August, 2022 to learn more about what the stars have in store for you! Click here for our cosmic tips", "url": "https://www.vogue.in/horoscope/product/taurus-horoscope-today-august-28-2022/", "urlToImage": "https://media.vogue.in/wp-content/uploads/2019/12/Taurus--1920x1080.jpg", "publishedAt": "2022-08-28T00:20:58Z", "content": "Complications on the financial front are indicated, Taurus. You will be tempted to do right by others, and theres nothing wrong with that. Just make sure youre not ignoring your own needs in order to… [+182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Maruti Suzuki goes beyond auto, it's the story of India's manufacturing potential: RC Bhargava, non-executive Chairman - The Indian Express", "description": "When Maruti was set up, the life expectancy given to the nascent public sector-run unit that partnered with a Japanese company was rather short, its non-executive Chairman RC Bhargava told this newspaper.", "url": "https://indianexpress.com/article/business/companies/maruti-suzuki-goes-beyond-auto-rc-bhargava-interview-8115892/", "urlToImage": "https://images.indianexpress.com/2022/08/maruti-2.jpg", "publishedAt": "2022-08-27T22:50:46Z", "content": "Maruti Suzuki India, the nations largest carmaker, completes 40 years of its operations this year. When Maruti was set up, the life expectancy given to the nascent public sector-run unit that partner… [+8799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Play A Key Role In Countering China: US Navy Chief - NDTV", "description": "US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in the future, playing a key role in countering China.", "url": "https://www.ndtv.com/india-news/india-to-play-a-key-role-in-countering-china-us-navy-chief-3291871", "urlToImage": "https://i.ndtvimg.com/i/2018-04/india-china-flags_650x400_61523324939.jpg", "publishedAt": "2022-08-27T13:46:39Z", "content": "India presents China with a two-front problem, said the US Navy Chief (Representational)\r\nTokyo: US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in … [+3390 chars]"}]}