{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja, Ritu Sharma", "title": "20 suspected Chandipura virus deaths in Gujarat, CM reviews situation - The Indian Express", "description": "A review meeting undertaken by Chief Minister Bhupendra Patel with district health officials on Thursday discussed the precautions that are to be taken to curb the spread of the virus.", "url": "https://indianexpress.com/article/cities/ahmedabad/20-suspected-chandipura-virus-deaths-in-gujarat-cm-reviews-situation-9462412/", "urlToImage": "https://images.indianexpress.com/2024/07/hospital_2422e3.jpg", "publishedAt": "2024-07-18T22:03:59Z", "content": "The toll in suspected cases of Chandipura Viral Encephalitis (CHPV) rose to 20 in Gujarat on Thursday, including two deaths reported from Ahmedabad city, even as 35 people showing symptoms of CHPV ar… [+6003 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "NEET-UG: After civil engineer, CBI now arrests 4 AIIMS MBBS students - Hindustan Times", "description": "NEET-UG case: AIIMS Patna executive director and CEO, Dr Gopal Krushna Pal said that no doctor has been arrested. | Latest News India", "url": "https://www.hindustantimes.com/india-news/neetug-after-civil-engineer-cbi-now-arrests-4-aiims-mbbs-students-101721311797801.html", "urlToImage": "https://images.hindustantimes.com/img/2024/07/18/1600x900/CBI_1721312210088_1721312214113.jpg", "publishedAt": "2024-07-18T14:18:55Z", "content": "The Central Bureau of Investigation (CBI) on Thursday arrested four MBBS students of AIIMS Patna in connection with the NEET-UG paper leak case. Three of the four men have been identified as third-ye… [+2881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Janardhanan", "title": "Express Break: Stalin’s son Udhayanidhi to be elevated as Tamil Nadu deputy CM, move aimed to ease burden on CM - The Indian Express", "description": "Udhayanidhi pushed for the promotion to gain \"larger acceptance\" within the government and to lighten the load on his father, party leaders say", "url": "https://indianexpress.com/article/political-pulse/stalins-son-udhayanidhi-tamil-nadu-deputy-cm-ease-burden-cm-9461464/", "urlToImage": "https://images.indianexpress.com/2024/07/udhayanidhi-pulse.jpg", "publishedAt": "2024-07-18T11:28:16Z", "content": "Udhayanidhi Stalin, Tamil Nadus youth welfare and sports development minister and the son of the Chief Minister M K Stalin, is set to be elevated as the Deputy Chief Minister before August 22, accord… [+3064 chars]"}]}