{"articles": [{"author": "Express Web Desk", "content": "Prime Minister Narendra Modi, during the second day of his visit to Bangladesh, held a delegation-level meeting with his Bangladeshi counterpart Sheikh Hasina and signed five MoUs to further enhance … [+4014 chars]", "description": "Ministry of External Affairs Spokesperson Arindam Bagchi said Modi and Hasina discussed the progress achieved in areas of health, trade, connectivity, energy, developmental cooperation and many more.", "publishedAt": "2021-03-27T17:15:43Z", "source": {"id": null, "name": "The Indian Express"}, "title": "PM Modi wraps up Bangladesh visit with five pacts, flags off third train connecting two countries - The Indian Express", "url": "https://indianexpress.com/article/india/narendra-modi-sheikh-hasina-india-bangladesh-7248399/", "urlToImage": "https://images.indianexpress.com/2021/03/Modi-Hasina-1.jpg"}, {"author": "Ajay Pal Singh", "content": "Yusuf Pathan, former India all-rounder, took to Twitter on Saturday to reveal that he has tested positive for coronavirus. Earlier in the day, legendary Indian cricketer Sachin Tendulkar had tested C… [+1788 chars]", "description": "Yusuf Pathan, former India all-rounder, said he has tested positive for coronavirus and is quarantining at home.", "publishedAt": "2021-03-27T16:59:20Z", "source": {"id": null, "name": "NDTV News"}, "title": "Yusuf Pathan, Former India All-Rounder, Tests Positive For Coronavirus - NDTV Sports", "url": "https://sports.ndtv.com/cricket/yusuf-pathan-former-india-all-rounder-tests-positive-for-coronavirus-2400290", "urlToImage": "https://c.ndtvimg.com/2021-03/p61d0f3_yusuf-pathan-instagram_625x300_27_March_21.jpg"}, {"author": "Special Correspondent", "content": "An Indian initiative, Indian Pulsar Timing Array (InPTA), formally joined IPTA as a full member. InPTA is a collaboration of currently about 25 research scientists and students from 15 institutions i… [+2842 chars]", "description": "An Indian initiative, Indian Pulsar Timing Array (InPTA), formally joined IPTA as a full member. InPTA is a collaboration of currently about 25 research scientists and students from 15 institutions in", "publishedAt": "2021-03-27T15:29:07Z", "source": {"id": "the-hindu", "name": "The Hindu"}, "title": "IITH joins global hunt for Einstein’s waves from monster black holes - The Hindu", "url": "https://www.thehindu.com/news/cities/Hyderabad/iith-joins-global-hunt-for-einsteins-waves-from-monster-black-holes/article34178498.ece", "urlToImage": "https://www.thehindu.com/static/theme/default/base/img/og-image.jpg"}, {"author": "hindustantimes.com", "content": "India and England will lock horns for the final time in this series on Sunday in the third ODI. With the ODI series levelled at 1-1, India and England will be looking to win the decider. India have w… [+1194 chars]", "description": "IND vs ENG 3rd ODI Live Streaming: All you need to know about live streaming details on Hotstar, match timings, venue for India vs England 3rd ODI Match at the Maharashtra Cricket Association Stadium in Pune.", "publishedAt": "2021-03-27T14:14:05Z", "source": {"id": null, "name": "Hindustan Times"}, "title": "India vs England 3rd ODI Live Streaming: When and where to watch IND vs ENG 3rd ODI Live on TV and Online - Hindustan Times", "url": "https://www.hindustantimes.com/cricket/india-vs-england-3rd-odi-live-streaming-where-to-watch-ind-vs-eng-odi-live-cricket-match-online-101616845678566.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/27/1600x900/d8193d14e4444afeb6404c19435f5d4f-d8193d14e4444afeb6404c19435f5d4f-0_1616845776972_1616846117132.jpg"}, {"author": "Sriram Lakshman & \r\n\t\t\tSuhasini Haidar", "content": "U.S. President Joe Biden will host a virtual Leaders Summit on Climate on April 22 and 23, with 40 world leaders, including Prime Minister Narendra Modi.  In the run up to this, U.S. Special Envoy fo… [+3886 chars]", "description": "The Summit’s guest list is indicative of the priority the administration places on climate action and clean technology .", "publishedAt": "2021-03-27T13:40:21Z", "source": {"id": "the-hindu", "name": "The Hindu"}, "title": "John Kerry to visit India in April ahead of Biden’s climate summit - The Hindu", "url": "https://www.thehindu.com/news/international/john-kerry-to-visit-india-in-april-ahead-of-bidens-climate-summit/article34177968.ece", "urlToImage": "https://www.thehindu.com/news/international/bvc87v/article34177967.ece/ALTERNATES/LANDSCAPE_615/JohnKerry"}, {"author": "HT Entertainment Desk", "content": "After Akshay Kumar, Sara Ali Khan took to Instagram and celebrated the wrap of Atrangi Re. The actor, who stars with Akshay and Dhanush in the Aanand L Rai directorial, shared a gallery of unseen pho… [+1942 chars]", "description": "Sara Ali Khan joined Akshay Kumar to mark the wrap of Atrangi Re. The actor shared a number of behind-the-scenes photos from the sets and penned a note addressed to director Aanand L Rai, and co-stars Akshay Kumar and Dhanush.", "publishedAt": "2021-03-27T13:27:38Z", "source": {"id": null, "name": "Hindustan Times"}, "title": "Sara Ali Khan recalls breaking down, eating South Indian food with Dhanush, 'stalking' Akshay Kumar as Atrangi Re wraps - Hindustan Times", "url": "https://www.hindustantimes.com/entertainment/bollywood/sara-ali-khan-recalls-breaking-down-eating-south-indian-food-with-dhanush-stalking-akshay-kumar-as-atrangi-re-wraps-101616850683391.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/27/1600x900/165064898_756592178616640_6020994431629261587_n_1616850728539_1616850744252.jpg"}, {"author": null, "content": "Archer suffered a cut to his hand while cleaning at home back in January. © AFP\r\nEngland fast bowler Jofra Archer will undergo surgery on his right hand following scans and consultant review. This is… [+1406 chars]", "description": "The surgery has nothing to do with the injury he sustained on his elbow that kept him out of the India ODIs", "publishedAt": "2021-03-27T12:29:30Z", "source": {"id": null, "name": "Cricbuzz"}, "title": "England cricket Jofra Archer to undergo surgery on right hand IPL RR | Cricbuzz.com - Cricbuzz - Cricbuzz", "url": "https://www.cricbuzz.com/cricket-news/116815/archer-to-undergo-surgery-on-right-hand", "urlToImage": "http://www.cricbuzz.com/a/img/v1/600x400/i1/c203987/archer-suffered-a-cut-to-his-h.jpg"}, {"author": "Tech Desk", "content": "National Aeronautics and Space Administration (NASA) has ruled out the possibility of a planet-threatening event in 2068. Discovered in 2004 and named after an Egyptian God of chaos, asteroid 99942 A… [+2327 chars]", "description": "Astronomers used the asteroid Apophis' flyby on March 5, 2021, as an opportunity to use powerful radar observations to estimate the celestial object's orbit around the Sun.", "publishedAt": "2021-03-27T11:32:54Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Asteroid Apophis is not a threat to Earth for at least 100 years, says NASA - The Indian Express", "url": "https://indianexpress.com/article/technology/science/asteroid-apophis-no-threat-impact-2068-earth-100-years-nasa-analysis-7247871/", "urlToImage": "https://images.indianexpress.com/2021/03/asteroid-apophis.jpg"}, {"author": "Staff Writer", "content": "As Covid-19 cases in the country are rising indicating the second wave of coronavirus, the Union Health Ministry on Saturday held a high-level meeting with authorities of all states, districts and un… [+5658 chars]", "description": "Union Health Ministry held a high-level meeting with authorities of all states, districts and union territories that are most affected by rising cases and rising mortality because of COVID-19", "publishedAt": "2021-03-27T11:30:16Z", "source": {"id": null, "name": "Livemint"}, "title": "As Covid-19 cases in India surge, govt lays out a five-fold strategy. All you need to know - Mint", "url": "https://www.livemint.com/news/india/as-covid-19-cases-in-india-surge-govt-lays-out-five-fold-containment-strategy-all-you-need-to-know-11616843960193.html", "urlToImage": "https://images.livemint.com/img/2021/03/27/600x338/20210312010L_1616844153170_1616844201478.jpg"}, {"author": "Reuters Staff", "content": "By Reuters Staff\r\nNEW DELHI (Reuters) - The launch in India of a new COVID-19 vaccine developed jointly by the Serum Institute of India and U.S.-based biotech firm Novavax is likely to be delayed to … [+1630 chars]", "description": "The launch in India of a new COVID-19 vaccine developed jointly by the Serum Institute of India and U.S.-based biotech firm Novavax is likely to be delayed to September, the Indian company's boss said on Saturday.", "publishedAt": "2021-03-27T11:16:00Z", "source": {"id": "reuters", "name": "Reuters"}, "title": "Serum Institute delays expected launch of Novavax vaccine in India - Reuters", "url": "https://www.reuters.com/article/us-india-vaccine-idUKKBN2BJ0BI", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210327&t=2&i=1556429976&r=LYNXMPEH2Q066&w=800"}, {"author": "Express News Service", "content": "Supreme Court Judge Justice N V Ramana on Saturday stressed the need for modernisation of judicial infrastructure and called for setting up of a National Judicial Infrastructure Corporation for this.… [+2722 chars]", "description": "Justice Ramana pointed out that the ideals of “access to justice” and “speedy justice” form the bedrock of rule of law and that “for access to justice, there needs to be sufficient infrastructure to cater to the ever-rising number of disputes”.", "publishedAt": "2021-03-27T07:57:09Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Justice NV Ramana calls for modernisation of judicial infrastructure - The Indian Express", "url": "https://indianexpress.com/article/india/next-cji-justice-ramana-calls-for-modernisation-of-judicial-infrastructure-7247790/", "urlToImage": "https://images.indianexpress.com/2021/03/ramana-new.jpg"}, {"author": "Sports Desk", "content": "Jonny Bairstow has hit back at Sunil Gavaskar for saying he is “uninterested” in Test cricket and said that the former India great can give him a call if he wants to know about his interests in the l… [+1543 chars]", "description": "Jonny Bairstow hits back at Sunil Gavaskar for questioning his 'interest' in Test cricket.", "publishedAt": "2021-03-27T07:21:29Z", "source": {"id": null, "name": "The Indian Express"}, "title": "‘He can feel free to call me’: Jonny Bairstow hits back at Sunil Gavaskar for ‘uninterested’ comment - The Indian Express", "url": "https://indianexpress.com/article/sports/cricket/jonny-bairstow-hits-back-sunil-gavaskar-7247744/", "urlToImage": "https://images.indianexpress.com/2021/03/Screenshot-2021-03-27T131718.340.png"}, {"author": "Bloomberg", "content": "For years China has sought to draw moral equivalence with the West over human rights, insisting that other countries have no standing to criticize its policies. Now Beijing is making companies pay if… [+6430 chars]", "description": "China this week has pushed a campaign to boycott Western retailers after the U.S., U.K., Canada and the European Union imposed sanctions over human-rights abuses against ethnic minority Uyghurs in Xinjiang.", "publishedAt": "2021-03-26T09:49:30Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Xi’s red line on China human rights makes companies like H&M, Nike, Uniqlo pick sides - The Indian Express", "url": "https://indianexpress.com/article/world/china-xinjiang-hm-nike-uniqlo-7246442/", "urlToImage": "https://images.indianexpress.com/2021/03/China-5.jpg"}], "message": "Successful api call", "number_of_news": 13, "status": 200, "topic": "india"}