{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI News Desk", "title": "TMC asks West Bengal jail minister Akhil Giri to apologise, resign for misbehaving with female official - The Times of India", "description": "India News: Trinamool Congress sought the resignation of West Bengal's correctional homes minister Akhil Giri after a video surfaced showing him verbally abusing", "url": "https://timesofindia.indiatimes.com/india/tmc-asks-west-bengal-jail-minister-akhil-giri-to-apologise-resign-for-misbehaving-with-female-official/articleshow/112266273.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-112266564,width-1070,height-580,imgsize-2324566,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-08-04T12:48:00Z", "content": "Your Privacy\r\nWhen you visit our website, we store cookies on your browser to collect information. The information collected might relate to you, your preferences or your device, and is mostly used t… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "Open war between Uddhav Thackeray, Devendra Fadnavis hits a new low as it reaches a pre-poll flashpoint - The Indian Express", "description": "The latest round of verbal duel between friends-turned-foes seems to have been triggered by Anil Deshmukh’s allegations that he was “coerced into implicating Uddhav and Aaditya in false cases by Fadnavis”", "url": "https://indianexpress.com/article/political-pulse/uddhav-thackeray-devendra-fadnavis-open-war-maharashtra-elections-9494512/", "urlToImage": "https://images.indianexpress.com/2024/08/devendra-fadnavis-uddhav-thackeray.jpg", "publishedAt": "2024-08-04T11:34:05Z", "content": "With the Maharashtra Assembly polls round the corner, the rivalry between former friends, Shiv Sena (UBT) president Uddhav Thackeray and senior BJP leader and Deputy Chief Minister Devendra Fadnavis,… [+3616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "iPhone 16 Pro vs iPhone 15 Pro: 5 biggest changes to expect - The Indian Express", "description": "While the iPhone 16 Pro series might look similar to the iPhone 15 Pro series, it is expected to have several new hardware and software-based features.", "url": "https://indianexpress.com/article/technology/mobile-tabs/iphone-16-pro-vs-iphone-15-pro-top-5-features-9494234/", "urlToImage": "https://images.indianexpress.com/2024/01/iphone-16-pro-iphone-16-pro-max.jpg", "publishedAt": "2024-08-04T08:22:48Z", "content": "Apple is set to introduce the iPhone 16 series in the first week of September, which will include four models: iPhone 16, iPhone 16 Plus, iPhone 16 Pro, and iPhone 16 Pro Max. According to numerous l… [+4696 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Prasad", "title": "Sony PlayStation Portal launched in India - GSMArena.com news - GSMArena.com", "description": "Plays all your installed PS5 and PS4 games over the home network. Sony has finally launched the PlayStation Portal in India, about nine months after its...", "url": "https://www.gsmarena.com/sony_playstation_portal_launched_in_india-news-63980.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/24/08/ps-portal-india/-952x498w6/gsmarena_001.jpg", "publishedAt": "2024-08-04T01:21:02Z", "content": "Sony has finally launched the PlayStation Portal in India, about nine months after its launch in the US. If you think that's late, it's pretty much par for the course for Sony India as it always laun… [+1154 chars]"}]}