{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Gujarat, Himachal Pradesh Exit Polls 2022 Results Highlights: Big win predicted for BJP in Gujarat, tough batt - CNBCTV18", "description": "Most of the exit polls results have predicted big win for the Bharatiya Janata Party (BJP) in Gujarat, while the saffron might face a tough battle in Himachal Pradesh. Unlike other polls, only India My Axis poll has given an edge to the Congress in Himachal P…", "url": "https://www.cnbctv18.com/politics/exit-polls-result-2022-live-updates-gujarat-himachal-pradesh-seats-prediction-today-bjp-congress-aap-bhupendra-patel-jai-ram-thakur-15333851.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/01/Assembly-Elections-2022-1-1019x573.jpg", "publishedAt": "2022-12-05T20:40:58Z", "content": "AAP reacts to exit poll results\r\nAs exit poll results were released on Monday, AAP Spokesperson Brijesh Kalappa told News 18: \"The Gujarat Elections don't look very good for us but as far as Himachal… [+55 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Japan vs Croatia, FIFA World Cup 2022 Highlights: Croatia beat Japan 3-1 on penalties - The Indian Express", "description": "World Cup 2022 Highlights, Japan vs Croatia: Ivan Perisic scored his 10th goal at major tournaments, surpassing Davor Suker to become Croatia's top scorer at major events.", "url": "https://indianexpress.com/article/sports/football/fifa-world-cup-2022-live-updates-japan-vs-croatia-8306911/", "urlToImage": "https://images.indianexpress.com/2022/12/JAP-1.jpg", "publishedAt": "2022-12-05T18:39:08Z", "content": "Japan took the towards the end of the first half as Daizen Maeda scored from a header. Croatia would also use the same way to equalise, early in the second half. Ivan Perisic scored his 10th goal at … [+363 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Fortnite chapter 4 goes official: New island, weapons, and dirtbikes - The Indian Express", "description": "Fortnite chapter 4 is now official and is available for free on PC, Xbox, Playstation, Nintendo Switch, and Android devices.", "url": "https://indianexpress.com/article/technology/tech-news-technology/fortnite-chapter-4-launch-features-8307203/", "urlToImage": "https://images.indianexpress.com/2022/12/fortnite-chapter-4.jpg", "publishedAt": "2022-12-05T13:01:07Z", "content": "With every new chapter release, Fornite gets a major overhaul with new weapons, costumes, vehicles, and islands to keep the players engaged with new content. Fortnite chapter 4 is now official, which… [+1570 chars]"}, {"source": {"id": null, "name": "The Logical Indian"}, "author": "Priyanka Jaiswal", "title": "Watch: NASA Installs New Roll-Out Solar Array On Space Station - The Logical Indian", "description": "NASA astronauts Josh Cassada and Frank Rubio successfully installed Roll-Out Solar Array on the...", "url": "https://thelogicalindian.com/videos/watch-nasa-installs-new-roll-out-solar-array-on-space-station-39065", "urlToImage": "https://thelogicalindian.com/h-upload/videothumb/yt_1_x4QpZRz0U.jpg", "publishedAt": "2022-12-05T12:54:23Z", "content": "A Journalism graduate and a storyteller at heart, who likes to dote on stories around. No matter if it's Personal or Political, Priyanka always attempts to find a way to make sure that people get the… [+59 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "How Pakistan's loss to England boosted India's chances of making WTC final - Hindustan Times", "description": "For Pakistan, it was surely a heartbreak as they didn't just go down in the match and in the series, but their chances of making the World Tet Championship final suffered a major blow, which subsequently boosted India's chances. | Cricket", "url": "https://www.hindustantimes.com/cricket/how-pakistan-s-loss-to-england-in-rawalpindi-boosted-india-s-chances-of-making-world-test-championship-final-101670242406781.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/05/1600x900/New_Project_-_2022-12-05T174721839_1670242761259_1670242761434_1670242761434.jpg", "publishedAt": "2022-12-05T12:38:30Z", "content": "England scripted a sensational win on Monday the most benign of pitches as they beat Pakistan by 74 runs in the opening match of the series. It was a bold move on Sunday evening when they declared th… [+1979 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "'If any Hindu is targeted...': Vivek Agnihotri reacts to terror outfit's threat to Kashmiri Pandits - India Today", "description": "The Kashmir Files director Vivek Agnihotri's sharp reaction came after a terror group allegedly released a hit list of 56 Kashmiri Pandits working in the Valley.", "url": "https://www.indiatoday.in/india/story/threat-to-kashmiri-pandits-let-resistance-front-vivek-agnihotri-nadav-lapid-the-kashmir-files-2305539-2022-12-05", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/agnihotri-sixteen_nine.jpg?VersionId=a9iNJnpbz6K7Jr3Iul8RmRgxc8xuALyA", "publishedAt": "2022-12-05T11:48:50Z", "content": "By India Today Web Desk: Vivek Agnihotri, the director of 'The Kashmir Files', on Monday took to Twitter and lamented once again the remarks by Israeli filmmaker Nadav Lapid, who called his film 'vul… [+1787 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by Parina Taneja", "title": "Akshay Kumar may return as Raju in Hera Pheri 3; fans say 'Baap baap he hota haii' - India TV News", "description": "As soon as the rumors of Akshay Kumar thinking about returning as Raju in Hera Pheri 3 surfaced on the internet, fans rejoiced and flooded Twitter. They said that the filmmakers should not even dare make the next film in the popular comedy franchise without K…", "url": "https://www.indiatvnews.com/entertainment/celebrities/akshay-kumar-may-return-as-raju-in-hera-pheri-3-fans-say-baap-baap-he-hota-haii-2022-12-05-828828", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/12/hera-pheri-3-1670234255.jpg", "publishedAt": "2022-12-05T10:36:30Z", "content": "Akshay Kumar has been one of the main reasons that the comedy franchise Hera Pheri turned into a big success. His camaraderie with Paresh Rawal and Suniel Shetty and their spot-on comic timing won mi… [+2638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Purpose of charity should not be conversion: Supreme Court on 'forced' religious conversion - The Indian Express", "description": "The bench was hearing a plea filed by advocate Ashwini Kumar Upadhyay seeking direction to the Centre and states to take stringent steps to control fraudulent religious conversion.", "url": "https://indianexpress.com/article/india/purpose-charity-not-conversion-supreme-court-on-forced-religious-conversion-8307089/", "urlToImage": "https://images.indianexpress.com/2022/12/Supreme-Court-2.jpg", "publishedAt": "2022-12-05T10:15:38Z", "content": "The Supreme Court Monday said that the purpose of charity should not be conversion, but it is the intention behind the charity that should be considered.“The purpose of charity should not be conversi… [+1704 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "New NASA image tells story of birth, death and dust in Orion Nebula - The Indian Express", "description": "NASA released an image of the Orion Nebula that combines data from the Spitzer Space Telescope, the Herschel Space Telescope and the Wide-Field Infrared Survey Explorer (WISE).", "url": "https://indianexpress.com/article/technology/science/nasa-image-orion-nebula-8306982/", "urlToImage": "https://images.indianexpress.com/2022/12/Orion-nebula-20221205.jpg", "publishedAt": "2022-12-05T09:28:30Z", "content": "NASA shared an image of a region that includes the Orion nebula, made by combining previously released data from three regions. The nebula and the constellation it can be found in are named after Ori… [+1556 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Vivo Y02 launched in India with MediaTek SoC, 5,000 mAh Battery, Android 12 Go Edition - Moneycontrol", "description": "The Vivo Y02 price in India is set at Rs 8,999 for the sole 3GB/32GB model.", "url": "https://www.moneycontrol.com/news/technology/vivo-y02-launched-in-india-with-mediatek-soc-5000-mah-battery-android-12-go-edition-9651541.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/vivo-y02-770x433.jpg", "publishedAt": "2022-12-05T09:14:49Z", "content": "Vivo has unveiled a new budget smartphone in India. The Vivo Y02 arrives with a stylish design, MediaTek chipset, a large battery, and Android 12 Go Edition.\r\nVivo Y02 Price in India \r\nThe Vivo Y02 p… [+1087 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Chemist Warehouse - Gold Coast Keto Australia Dark Truth You Need to Know - The Tribune India", "description": "Gold Coast Keto Capsules are a ketogenic diet that helps you lose every ounce of excess body weight. It helps the body get the most out of fat-burning machines without consuming too much energy. It reduces appetite and makes people feel better about eating sm…", "url": "https://www.tribuneindia.com/news/brand-connect/chemist-warehouse-gold-coast-keto-australia-dark-truth-you-need-to-know-457970", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_223868913.png", "publishedAt": "2022-12-05T08:27:00Z", "content": "Gold Coast Keto Capsules are a ketogenic diet that helps you lose every ounce of excess body weight. It helps the body get the most out of fat-burning machines without consuming too much energy. It r… [+14498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Seven crucial bypolls today in five states: BJP and SP lock horns in high-stakes battle for Mainpuri and Rampur - The Indian Express", "description": "By-elections will also be held in Katauli (Uttar Pradesh), Kurhani (Bihar), Padampur (Odisha), Sardarshahar (Rajasthan), and Bhanupratappur (Chhattisgarh). Here is a primer on the electoral contests.", "url": "https://indianexpress.com/article/political-pulse/seven-bypolls-today-five-states-bjp-sp-high-stakes-battle-mainpuri-rampur-8306110/", "urlToImage": "https://images.indianexpress.com/2022/12/ch1625549.jpg", "publishedAt": "2022-12-05T02:00:08Z", "content": "Bypolls will be held in a Lok Sabha seat and six Assembly seats in five states on Monday. While the Lok Sabha by-election will be held in Mainpuri in Uttar Pradesh, where the Samajwadi Party is locke… [+4709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishika Singh", "title": "What is Iran's morality police? - The Indian Express", "description": "The morality police “was abolished by the same authorities who installed it,” Attorney General Mohammad Jafar Montazeri said, the AFP reported. “Both parliament and the judiciary are working [on the issue],” he said as part of the statement.", "url": "https://indianexpress.com/article/explained/explained-global/irans-morality-police-disbanded-amid-street-protests-8305912/", "urlToImage": "https://images.indianexpress.com/2022/12/ex-iran-3col.jpg", "publishedAt": "2022-12-05T01:30:24Z", "content": "Irans public prosecutor said on Sunday that the countrys dreaded morality police the same force in whose custody 22-year-old Mahsa Amini died in September has been disbanded.If the announcement is fo… [+3784 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Joel Rebello", "title": "Reserve Bank of India may opt for a smaller rate hike this week, say experts - Economic Times", "description": "Nine out of 10 banks polled by ET expect the central bank to hike rates by 35 basis points - 0.35 of a percentage point - or less at the December 5-7 meeting of the monetary policy committee (MPC). While five of the nine predict a rate increase of 35 bps, two…", "url": "https://economictimes.indiatimes.com/news/economy/policy/reserve-bank-of-india-may-opt-for-a-smaller-rate-hike-this-week-say-experts/articleshow/95988731.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95988795,width-1070,height-580,imgsize-132862,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-05T00:49:00Z", "content": "Easing inflation expectations both in India and abroad, indications of slower rate hikes in the US and worries over a global economic slowdown are likely to ensure a smaller interest rate increase by… [+3858 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "First key meet on G20 kicks off, focus on debt, inflation, slowdown - The Indian Express", "description": "During its term, India will hold over 200 meetings across 32 different workstreams in 50 cities.", "url": "https://indianexpress.com/article/india/first-key-meet-on-inida-g20-kicks-off-focus-on-debt-inflation-slowdown-8305938/", "urlToImage": "https://images.indianexpress.com/2022/12/G20-1.jpg", "publishedAt": "2022-12-04T22:44:53Z", "content": "RISING GLOBAL debt, loss of employment, runaway inflation and the slowdown in growth these are among the challenges facing the global economy that are set to be on the centrestage as officials from 4… [+4376 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Alpilean Weight Loss Supplement - Are Alpine Ice Hack Reviews Legit or Fake News? - The Tribune India", "description": "December 2022 Alpilean Customer Update: Ever since Alpilean healthy weight loss support pills launched in October 2022, it has been in extreme demand all around the world. However, fast forward to December 2022 and there are new safety concerns and side effec…", "url": "https://www.tribuneindia.com/news/impact-feature/alpilean-weight-loss-supplement-are-alpine-ice-hack-reviews-legit-or-fake-news-457711", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_751381914.jpg", "publishedAt": "2022-12-04T15:18:00Z", "content": "December 2022 Alpilean Customer Update: Ever since Alpilean healthy weight loss support pills launched in October 2022, it has been in extreme demand all around the world. However, fast forward to De… [+14391 chars]"}]}