{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Greater Kashmir"}, "author": "IANS", "title": "New Nokia 2660 Flip launched at affordable price in India - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/tech/new-nokia-2660-flip-launched-at-affordable-price-in-india", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-08%2F039cda92-4a1b-464a-a082-f93e7e836e2a%2FIMG_20220831_152112.jpg?rect=0%2C48%2C1251%2C657&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-08-31T09:52:08Z", "content": "Priced at Rs 4,699, the Nokia 2660 is available across online and offline stores in black, blue and red colour options.\r\n\"The latest portfolio additions reaffirm HMD Global's commitment to ensuring e… [+123 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Telangana's KCR Meets Nitish Kumar, Now BJP Rival Again - NDTV", "description": "During his Bihar visit, Mr Rao, popularly known as KCR, will also distribute money to the families of soldiers who died in the Galwan valley clashes at the Indian border with China in Ladakh.", "url": "https://www.ndtv.com/india-news/telanganas-kcr-meets-nitish-kumar-now-bjp-rival-again-3302802", "urlToImage": "https://c.ndtvimg.com/2022-08/mbjh32rg_kcr-meeting-nitish-kumar-tejashwi-yadav_650x400_31_August_22.jpg", "publishedAt": "2022-08-31T09:47:31Z", "content": "The three leaders are expected to discuss national politics.\r\nNew Delhi: In his latest outreach move aimed at stitching together an alliance of like-minded parties against the Bharatiya Janata Party,… [+3511 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "Long Covid in children less common than in adults, reveals study - India TV News", "description": "Covid: The team conducted a multistate analysis using EHR data of children and people younger than 21 years of age who underwent testing for SARS-CoV-2 at one of eight paediatric health systems in the country.", "url": "https://www.indiatvnews.com/health/long-covid-in-children-less-common-than-in-adults-reveals-study-2022-08-31-804302", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/covid-13-1661938157.jpg", "publishedAt": "2022-08-31T09:29:40Z", "content": "A team of researchers, including one of Indian origin, believes that the risk of post-acute sequelae of SARS-CoV-2 infection (PASC), or long Covid, in children appears to be lower than what has been … [+1745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru Karnataka News Live Updates: Plea in Supreme Court challenges HC order allowing Ganesh Chaturthi celebrations at Hubballi Idgah ground - The Indian Express", "description": "Bengaluru Karnataka news today: Hindu leaders on Wednesday morning installed a Ganesh idol in Hubballi's Idgah ground, a day after Karnataka High Court allowed Ganesh Chaturthi celebrations there.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-hubballi-ganesh-chaturthi-news-live-updates-rains-weather-traffic-8121966/", "urlToImage": "https://images.indianexpress.com/2022/08/hubballi-ganesh-chaturthi.jpg", "publishedAt": "2022-08-31T08:56:07Z", "content": "The seer being investigated by the Karnataka Police over allegations of sexual assault heads one of the most prominent of the nearly 3,000 Lingayat mutts in the state. As the state gets into election… [+1674 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Asia Cup 2022: Ravindra Jadeja's Answer To Question On Rishabh Pant Leaves Journalists In Splits - NDTV Sports", "description": "Asia Cup, India vs Pakistan: Ravindra Jadeja was asked about Rishabh Pant's exclusion from India's playing XI vs Pakistan and he had an epic reply.", "url": "https://sports.ndtv.com/asia-cup-2022/ravindra-jadeja-says-out-of-syllabus-to-question-on-rishabh-pant-3302580", "urlToImage": "https://c.ndtvimg.com/2022-08/0ki5lcso_ravindra-jadeja-twitter_625x300_31_August_22.jpg", "publishedAt": "2022-08-31T08:53:50Z", "content": "One of the big talking points during India's Asia Cup opening match against Pakistan was the omission of star wicketkeeper-batter Rishabh Pant. India went on to win a closely fought contest by five w… [+1512 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Written by India TV Lifestyle Desk", "title": "Siddhivinayak Temple Mumbai LIVE darshan: Where to watch 10-day Ganesha aarti, timings and more - India TV News", "description": "Siddhivinayak Temple Mumbai LIVE darshan: This year the 10-day long festivity of Ganesh Chaturthi begins on August 31. However, people who are away and can't visit the Shree Siddhivinayak Temple, can watch the online coverage from the temple and seek the bles…", "url": "https://www.indiatvnews.com/lifestyle/news/siddhivinayak-temple-mumbai-live-darshan-where-to-watch-10-day-ganesha-aarti-timings-and-more-2022-08-31-804292", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/08/ganpati-10-1661934974.jpg", "publishedAt": "2022-08-31T08:44:34Z", "content": "Siddhivinayak Temple Mumbai LIVE darshan: One of the most auspicious and majorly celebrated festival, Ganesh Chaturthi has begun today. The ten-day-long festival dedicated to Lord Ganesha is celebrat… [+1779 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Navy To Replace \"Colonial\" Flag, PM To Unveil New Ensign - NDTV", "description": "India will unfurl a new naval flag that retires a British colonial symbol to mark the formal debut of the country's first locally built aircraft carrier, Prime Minister Narendra Modi's office said.", "url": "https://www.ndtv.com/india-news/navy-to-replace-colonial-flag-pm-to-unveil-new-ensign-3302761", "urlToImage": "https://c.ndtvimg.com/2022-08/9fptcv0o_naval-flag_625x300_31_August_22.jpg", "publishedAt": "2022-08-31T08:41:18Z", "content": "PM Modi will reveal the new design Friday in Kerala.\r\nNew Delhi: India will unfurl a new naval flag that retires a British colonial symbol to mark the formal debut of the country's first locally buil… [+1892 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Sonali Phogat's death mystery: Late actress turned politician's net worth will blow your mind. Deets inside. - Times of India", "description": "Sonali Phogat’s death has become a mystery. Several arrests have been made in her death case till now. But, amid all this, do you know about the assets Sonali left behind? Well, it is being said that Sonali was the owner of a property worth Rs 110 crores, whi…", "url": "https://timesofindia.indiatimes.com/videos/entertainment/hindi/sonali-phogats-death-mystery-late-actress-turned-politicians-net-worth-will-blow-your-mind-deets-inside-/videoshow/93899840.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/93899840/size-83566/93899840.jpg", "publishedAt": "2022-08-31T08:10:03Z", "content": "Sonali Phogats death has become a mystery. Several arrests have been made in her death case till now. But, amid all this, do you know about the assets Sonali left behind? Well, it is being said that … [+585 chars]"}, {"source": {"id": null, "name": "Livelaw.in"}, "author": "Nupur Thapliyal", "title": "Indian Courts Can Direct Telegram To Disclose Info Of Copyright Infringers Using Its Platform, Server... - Live Law - Indian Legal News", "description": "The Delhi High Court has observed that copyright infringers cannot be permitted to seek shelter...", "url": "https://www.livelaw.in/news-updates/copyright-infringers-telegrams-policies-physical-server-singapore-delhi-high-court-207993", "urlToImage": "https://www.livelaw.in/h-upload/2019/10/02/365172-telegram.jpg", "publishedAt": "2022-08-31T08:00:05Z", "content": "The Delhi High Court has observed that copyright infringers cannot be permitted to seek shelter under messaging platform Telegram's policies merely on the ground that its physical server is in Singap… [+7810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "WhatsApp Web: How to see unread messages, chats only - The Indian Express", "description": "WhatsApp will now let users filter their chats which are unread, meaning when you turn on this option, only the unread chats will be visible to you.", "url": "https://indianexpress.com/article/technology/social/whatsapp-web-ios-app-now-supports-filter-by-unread-heres-how-it-works-8122439/", "urlToImage": "https://images.indianexpress.com/2022/08/WhatsApp_Web_LEAD.jpg", "publishedAt": "2022-08-31T07:18:10Z", "content": "WhatsApp Web has a new feature, which many users will appreciate. It will now let users filter their chats which are unread, meaning when you turn on this option, only the unread chats will be visibl… [+1895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Filmfare Awards 2022: Kriti Sanon and Ranveer Singh are best actors, Shershaah is best film; check out the full winners' list - The Indian Express", "description": "Among the films that grabbed maximum trophies at the 67th Filmfare Awards are Sardar Udham, Shershaah and Mimi. Here's the complete list of winners.", "url": "https://indianexpress.com/article/entertainment/bollywood/filmfare-awards-2022-vicky-kaushal-sardar-udham-wins-big-ranveer-singh-grabs-the-trophy-of-best-actor-check-out-the-full-winners-list-8121987/", "urlToImage": "https://images.indianexpress.com/2022/08/filmfare-awards-winners.jpg", "publishedAt": "2022-08-31T06:59:07Z", "content": "The 67th Filmfare Awards for 2022 were given out on Tuesday night. The awards ceremony saw the coming together of the entire Hindi film industry under a roof. The three films which emerged as the big… [+5589 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "Polite tweet from PM Modi, Shehbaz Sharif goes into convulsions over Kashmir - Hindustan Times", "description": "There has been no offer of flood assistance from India or back channel but Pak PM Shehbaz Sharif has linked it to Kashmir propaganda to appease domestic radicals and score points over political rivals. | Latest News India", "url": "https://www.hindustantimes.com/india-news/polite-tweet-from-pm-modi-shehbaz-sharif-goes-into-convulsions-over-kashmir-101661927850646.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/31/1600x900/modi_shehbaz_sharif_pak_flood_food_offer_1661927987228_1661927987410_1661927987410.jpg", "publishedAt": "2022-08-31T06:42:34Z", "content": "A simple empathetic tweet from Prime Minister Narendra Modi on the devastation caused by floods in Pakistan has triggered off an irrational response from Prime Minister Shehbaz Sharif to score points… [+2507 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "‘How can the polls be free & fair without…’: Manish Tewari on Cong prez election - Hindustan Times", "description": "The former Union minister objected to senior colleague Madhusudan Mistry's statement to a newspaper that since the list of electors is not made public, any party member who wants to contest can visit PCC offices to check the list. | Latest News India", "url": "https://www.hindustantimes.com/india-news/how-can-there-be-free-and-fair-polls-manish-tewari-on-congress-president-election-101661920300348.html", "urlToImage": "https://images.hindustantimes.com/img/2022/08/31/1600x900/b8a1fdd8-41ea-11ec-b1ea-9df134a746cb_1636527018017_1661920304993_1661920304993.jpg", "publishedAt": "2022-08-31T05:19:19Z", "content": "Congress MP Manish Tewari on Wednesday raised suspicion on the fairness of the upcoming polls to elect the party's new president, and also asked the party to publish the list of names of all those wh… [+3403 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": null, "title": "Engineers fix Voyager-1 as it travels outside Solar System in interstellar space - India Today", "description": "The Voyager-1 probe, which is in interstellar space, the area beyond our solar system, remains healthy as engineers have fixed an issue that was sending garbled data to Earth.", "url": "https://www.indiatoday.in/science/story/engineers-fix-voyager-1-as-it-travels-outside-solar-system-in-interstellar-space-1994634-2022-08-31", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202208/voyager_2_2-647x363.jpeg?y.Z.YeCUBwfvS4ASbvLwTQivjmJ6myc9", "publishedAt": "2022-08-31T05:10:53Z", "content": "The Voyager-1 probe has been in interstellar space for over a decade after it crossed the heliosphere in 2012, the boundary where the suns impact comes to an end. The spacecraft raised alarm bells on… [+2715 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "India's Q1 GDP growth data to be released today. What to expect | Mint - Mint", "description": "As per economists, the Indian economy probably grew at its fastest pace in a year in April-June quarter", "url": "https://www.livemint.com/economy/indias-q1-gdp-growth-data-to-be-released-today-what-to-expect-11661920403959.html", "urlToImage": "https://images.livemint.com/img/2022/08/31/600x338/India_GDP_1661921287177_1661921287356_1661921287356.jpg", "publishedAt": "2022-08-31T04:59:01Z", "content": "The gross domestic product (GDP) data for the April-June 2022 quarter will be released by the government on Wednesday and as per economists, the Indian economy may have grown at the fastest pace in a… [+2142 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Lower carbs, more proteins can lead to diabetes prevention, remission: Study - The Federal", "description": "The ICMR-INDIAB study was conducted on 18,090 adults across different Indian states. The study’s main objective was to derive macronutrient recommendations for remission and prevention of type 2 diabetes (T2D) in Asian Indians using a data-driven optimization…", "url": "https://thefederal.com/health/lower-carbs-more-proteins-can-lead-to-diabetes-prevention-remission-study/", "urlToImage": "https://thefederal.com/wp-content/uploads/2022/08/iStock-618456756.jpg", "publishedAt": "2022-08-31T01:00:02Z", "content": "Lowering carbohydrates and increasing your protein intake, can result in diabetes remission and prevention, revealed a recent national study conducted by the Indian Council of Medical Research (ICMR)… [+2214 chars]"}, {"source": {"id": null, "name": "VOGUE India"}, "author": "Woodstock Witch", "title": "Libra Horoscope Today: August 31, 2022 - VOGUE India", "description": "Read VOGUE India's free daily Libra horoscope for 31st August, 2022 to learn more about what the stars have in store for you! Click here for our cosmic tips", "url": "https://www.vogue.in/horoscope/product/libra-horoscope-today-august-31-2022/", "urlToImage": "https://media.vogue.in/wp-content/uploads/2019/12/Libra-1920x1080.jpg", "publishedAt": "2022-08-31T00:20:59Z", "content": "Not everybody youre surrounded by has your best interests at heart. You didnt need us to tell you that, beautiful. Today, youre being asked to take your rose-tinted glasses off and see your reality f… [+372 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Rupert Neate", "title": "Indian tycoon Gautam Adani named world’s third richest person - The Guardian", "description": "Billionaire becomes first Asian person to break into the top three of world’s wealthy", "url": "https://amp.theguardian.com/business/2022/aug/30/india-gautam-adani-worlds-third-richest-person", "urlToImage": null, "publishedAt": "2022-08-30T16:29:00Z", "content": "Rich listsBillionaire becomes first Asian person to break into the top three of worlds wealthy\r\nThe Indian tycoon Gautam Adani has been named the worlds third richest person with an estimated $137bn … [+4906 chars]"}]}