{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Chaos Over Uniform Civil Code Bill, Move To Block It Rejected - NDTV", "description": "The Bill provides for the constitution of the National Inspection and Investigation Committee for preparation of the Uniform Civil Code and its implementation throughout India.", "url": "https://www.ndtv.com/india-news/rajya-sabha-chaos-over-bjp-mps-uniform-civil-code-bill-opposition-move-to-block-it-is-rejected-3592685", "urlToImage": "https://c.ndtvimg.com/2021-07/bbudbllo_rajya-sabha-pti_650x400_31_July_21.jpg", "publishedAt": "2022-12-09T11:50:00Z", "content": "DMK's Tiruchi Siva said the very idea of Uniform Civil Code is opposed to secularism.\r\nNew Delhi: Chaos ensued in the Rajya Sabha today as the Bharatiya Janata Party's Rajasthan MP Kirodi Lal Meena i… [+2709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "NASA's Perseverance rover collects first dust samples on Mars - The Indian Express", "description": "NASA's Perseverance rover has collected and stored its first samples of Martian regolith (broken down rocks and dust).", "url": "https://indianexpress.com/article/technology/science/nasa-perseverance-mars-rover-dust-sample-8315639/", "urlToImage": "https://images.indianexpress.com/2022/12/Mars-perseverance-rocer-20221209.jpg", "publishedAt": "2022-12-09T11:38:12Z", "content": "NASAs Perseverance rover bottled up two samples of the Martian surface on December 2 and December 6, according to the agencys Jet Propulsion Laboratory (JPL). Unlike the previous samples collected by… [+2556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Work on world's largest radio telescope begins in Australia, South Africa - The Indian Express", "description": "The world's largest radio astronomy facility is currently under construction in Australia and South Africa. Scientists will use the exceptionally powerful Square Kilometre Array (SKA) to probe the mysteries of the universe.", "url": "https://indianexpress.com/article/technology/science/square-kilometre-array-ska-radio-telescope-8315263/", "urlToImage": "https://images.indianexpress.com/2022/12/SKA-telescope-combined-20221209.jpg", "publishedAt": "2022-12-09T08:39:06Z", "content": "On Monday, the construction of the largest radio astronomy facility in the world began in Australia and South Africa. The Square Kilometre Array will consist of 131,072 low-frequency antennae in Aust… [+3222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rain: Red alert sounded in 3 Tamil Nadu districts, Puducherry; orange alert in Chennai - The Indian Express", "description": "Tamil Nadu DGP has instructed district SPs and other officials to be prepared with preventive measures. Volunteers from the fishermen's community are also instructed to be ready with rescue boats.", "url": "https://indianexpress.com/article/cities/chennai/rain-red-alert-tamil-nadu-districts-puducherry-orange-alert-chennai-8313082/", "urlToImage": "https://images.indianexpress.com/2022/12/TN-Rain.jpg", "publishedAt": "2022-12-09T08:37:56Z", "content": "The India Meteorological Department (IMD) Wednesday issued a red alert for three districts in Tamil Nadu, including Chengalpattu, Villupuram and Kanchipuram, and Puducherry due to the heavy rain fore… [+1335 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "SC dismisses plea seeking details of Collegium meet on judges' appointment: 'Discussions shall not be in public domain' - The Indian Express", "description": "A Bench of Justices MR Shah and CT Ravikumar, while pronouncing the judgment, said: “Some discussions might have taken place, but they cannot be said to be final decision.\"", "url": "https://indianexpress.com/article/india/supreme-court-rti-plea-collegium-meet-8314860/", "urlToImage": "https://images.indianexpress.com/2022/12/SC-New-Main-2.jpeg", "publishedAt": "2022-12-09T05:43:23Z", "content": "The Supreme Court Friday dismissed a plea seeking disclosure of details of a Collegium meeting held on December 12, 2018, under the Right To Information (RTI) Act. The petitioner sought the details o… [+2365 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Snapdeal to shelve $152 million IPO amid tech stocks rout - Economic Times", "description": "Snapdeal filed its initial public offering (IPO) regulatory papers for approval in December 2021, a year that saw many stock market debuts and record fund raising by Indian startups. But many are delaying IPOs amid a stock market rout that has raised concerns…", "url": "https://economictimes.indiatimes.com/tech/technology/snapdeal-to-shelve-152-million-ipo-amid-tech-stocks-rout/articleshow/96101888.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96101902,width-1070,height-580,imgsize-53702,overlay-ettech/photo.jpg", "publishedAt": "2022-12-09T05:08:00Z", "content": "SoftBank-backed Indian e-commerce firm Snapdeal has decided to pull the plug on its $152 million IPO, the company told Reuters, making it the latest casualty of a meltdown in tech stocks that has sou… [+2733 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kunal Gaurav", "title": "'No wonder SC thinks…': TMC MP targets Election Commission over leader's arrest - Hindustan Times", "description": "TMC spokesperson Saket Gokhale was granted bail after he was produced before the court in Ahmedabad on Thursday following the completion of his police custody but was soon arrested in another case registered by Morbi police. | Latest News India", "url": "https://www.hindustantimes.com/india-news/no-wonder-sc-thinks-tmc-mp-targets-election-commission-over-leader-s-arrest-101670556277274.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/09/1600x900/tmc_mp_on_saket_gokhale_arrest_election_commission_1670559859689_1670559859865_1670559859865.jpg", "publishedAt": "2022-12-09T04:26:58Z", "content": "Trinamool Congress MP Derek O'Brien targeted the Election Commission over the arrest of the party's national spokesperson Saket Gokhale by Gujarat Police in a fresh case hours after he secured bail i… [+2819 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "What to expect from Indian markets in 2023 as performance cools - Economic Times", "description": "If there is some recovery in global growth and sentiment, over “6-12 months some of these markets that have become oversold may do better than India because India has outperformed so much in the last 18 months,” said Hiren Dasani, managing director at Goldman…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/what-to-expect-from-indian-markets-in-2023-as-performance-cools/articleshow/96098671.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96098644,width-1070,height-580,imgsize-612232,overlay-etmarkets/photo.jpg", "publishedAt": "2022-12-09T02:39:00Z", "content": "Indian stocks that offered a refuge from losses that plagued global equity investors in 2022 look set to lose momentum next year as sky-high valuations weigh on market enthusiasm.\r\nThats the consensu… [+5252 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "FIFA World Cup 2022 quarterfinals: Argentina face unbeaten Netherlands, Brazil take on Croatia - India Today", "description": "The quarterfinals of the FIFA World Cup 2022 is all set to get underway on Friday with two South America vs Europe clashes. Neymar and Lionel Messi will look to be the star players for their respective teams once again.", "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2022-quarterfinals-brazil-croatia-argentina-netherlands-lionel-messi-neymar-2307053-2022-12-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202212/untitled_design_1-sixteen_nine.jpg?VersionId=Z8k5trtgayUthibqQZjNj.UHvt9rqSo0", "publishedAt": "2022-12-09T02:34:23Z", "content": "By India Today Web Desk: The FIFA World Cup 2022 in Qatar has entered its business end as the Round Of 16 matches produced a lot of drama and the exit of former World Champions. \r\nSpain were knocked … [+2547 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "India inflation likely softened to nine-month low in November: Reuters poll - Reuters India", "description": "India consumer price inflation likely cooled to a nine-month low of 6.40% in November mainly due to a moderation in food prices, according to a Reuters poll of economists.", "url": "https://www.reuters.com/world/india/india-inflation-likely-softened-nine-month-low-november-2022-12-09/", "urlToImage": "https://www.reuters.com/resizer/53PqKMUgOvZ_rtTZgB6U6Z6zXLM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/TF7QFWSYAJPSTJZRBMMFVICVIY.jpg", "publishedAt": "2022-12-09T02:08:00Z", "content": "BENGALURU, Dec 9 (Reuters) - India consumer price inflation likely cooled to a nine-month low of 6.40% in November mainly due to a moderation in food prices, according to a Reuters poll of economists… [+2041 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Anoushka Rajesh", "title": "Measles Outbreak: Can It Swell Into Next Public Health Emergency in India? - The Quint FIT", "description": "Measles Outbreak in India: Speaking to FIT, two experts from Public Health Foundation of India explain what's causing the sudden measles outbreak, and what we can do now to contain it.", "url": "https://www.thequint.com/fit/measles-outbreak-vaccination-public-health-emergency-action-india", "urlToImage": "https://images.thequint.com/thequint%2F2022-12%2Feec0c0ac-9984-4541-86c3-686d91998220%2FUntitled_design__6_.jpg?rect=0%2C0%2C1920%2C1008&w=1200&auto=format%2Ccompress&ogImage=true&enlarge=true", "publishedAt": "2022-12-08T02:30:00Z", "content": "\"The outbreaks are occurring due to accumulation of susceptible children for more than two years,\" says Dr Giridhar Babu, Epidemiologist at Public Health Foundation of India, who has worked in the Na… [+699 chars]"}]}