{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Diabetes, Cancer, & Respiratory Diseases Kill More People Than Infectious Diseases': WHO - India Today", "description": "WHO has reported that heart disease, diabetes, cancer, and respiratory diseases kill more people globally than infectious diseasesSubscribe to India Today fo...", "url": "https://www.youtube.com/watch?v=T7UbBQE8Jb0", "urlToImage": "https://i.ytimg.com/vi/T7UbBQE8Jb0/maxresdefault.jpg", "publishedAt": "2022-09-29T14:13:26Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Jasprit Bumrah likely to be ruled out of T20 World Cup - The Indian Express", "description": "Bumrah didn’t play the first T20 against South Africa Wednesday and, a day later, flew to the National Cricket Academy in Bengaluru for the back condition to be monitored.", "url": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-ruled-out-of-t20-world-cup-8180399/", "urlToImage": "https://images.indianexpress.com/2022/07/jasprit-bumrah-3.jpg", "publishedAt": "2022-09-29T13:57:29Z", "content": "WITH JUST weeks to go for the T20 World Cup in Australia, Team India suffered a huge setback with ace pacer Jasprit Bumrah rendered doubtful for the tournament after he complained of back pain.Bumrah… [+3159 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Open cluster Berkeley 27 examined by researchers - Phys.org", "description": "Using data from ESA's Gaia satellite, astronomers from Taiwan and India have inspected a galactic open cluster known as Berkeley 27. Results of the study, published September 22 on the arXiv pre-print repository, yield essential information regarding the prop…", "url": "https://phys.org/news/2022-09-cluster-berkeley.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/open-cluster-berkeley.jpg", "publishedAt": "2022-09-29T13:00:01Z", "content": "Using data from ESA's Gaia satellite, astronomers from Taiwan and India have inspected a galactic open cluster known as Berkeley 27. Results of the study, published September 22 on the arXiv pre-prin… [+3310 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Reported by IANS", "title": "Google Search will let you translate the local news directly: Know how - India TV News", "description": "You'll be able to read authoritative reporting from journalists in the country, giving you a unique perspective of what's happening there,' Google said in a blog post. To begin with, the feature will translate news results in French, German and Spanish into E…", "url": "https://www.indiatvnews.com/technology/news/google-search-will-let-you-translate-the-local-news-directly-know-how-2022-09-29-812425", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/09/google-search-pixabay-1664453473.jpg", "publishedAt": "2022-09-29T12:16:50Z", "content": "Google has announced to soon allow people to translate news coverage in other languages directly from Search via machine translation. \r\nCurrently, people see Search results about news in their countr… [+1327 chars]"}, {"source": {"id": null, "name": "Expresshealthcare.in"}, "author": "EH News Bureau", "title": "COVID-19 and transformation of cardiac care in India - Express Healthcare", "description": "On World Heart Day 2022, Dr Raajiv Singhal, Founding Member, MD, and CEO, Marengo Asia Healthcare stresses that an encouraging development during the COVID period is the transformation of the whole cardiac care in India by fuelling technological advancements,…", "url": "https://www.expresshealthcare.in/news/covid-19-and-transformation-of-cardiac-care-in-india/436504/", "urlToImage": "https://cdn.expresshealthcare.in/wp-content/uploads/2022/09/29172131/Dr-Raajiv-Official-1.jpeg", "publishedAt": "2022-09-29T11:49:58Z", "content": "On World Heart Day 2022, Dr Raajiv Singhal, Founding Member, MD, and CEO, Marengo Asia Healthcare stresses that an encouraging development during the COVID period is the transformation of the whole c… [+5086 chars]"}, {"source": {"id": null, "name": "Www.bgr.in"}, "author": "Shweta Ganjoo", "title": "Amazon hardware event 2022: From Kindle Scribe, Echo Dot, Halo Rise and more - BGR India", "description": "Amazon hosted its annual hardware event last night wherein the company introduced a host of new devices including Kindle Scribe, fifth gen Echo Dot and Halo Rise among others. Here are all the devices Amazon has announced.", "url": "https://www.bgr.in/photo-gallery/amazon-hardware-event-2022-from-kindle-scribe-echo-dot-halo-rise-and-more-1329176/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2022/09/Amazon-Event-1.jpg", "publishedAt": "2022-09-29T11:38:00Z", "content": "BGR.in\r\n (Broad Guidance &amp; Ratings) is a leading online destination for all things technology including news related to smartphones, smart TVs, smartwatches, TWS earbuds, latest games and apps, a… [+261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Chinese fish fossils take a bite out of mystery of origin of jaws - The Indian Express", "description": "Researchers described the earliest-known vertebrates that possessed jaws as revealed by fossils of four remarkable fish species unearthed in China, two dating from 436 million years ago and two from 439 million years ago.", "url": "https://indianexpress.com/article/technology/science/chinese-fish-fossils-take-a-bite-out-of-mystery-of-origin-of-jaws-8179991/", "urlToImage": "https://images.indianexpress.com/2022/09/Fish-fossil-20220929.jpg", "publishedAt": "2022-09-29T10:30:05Z", "content": "For human beings and 99.8% of our fellow vertebrates, having jaws is an integral part of life. Just try eating a taco without them. But, like everything else in our bodies, jaws had to start somewher… [+3889 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Visa applications wait time: More Indians hitting the US than ever before, it's a worldwide problem: US... - Moneycontrol", "description": "The live session comes amid a high volume of visa requests and the US Embassy's inability to accommodate all travellers prior to their planned travel dates, even if the purpose of travel is time sensitive.", "url": "https://www.moneycontrol.com/news/india/visa-applications-wait-time-more-indians-hitting-the-us-than-ever-before-its-a-worldwide-problem-us-embassy-9250451.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/09/Visa-770x433.jpg", "publishedAt": "2022-09-29T10:27:53Z", "content": "Clarifying on the long wait times for US visas, Minister Counselor for Consular Affairs Don Heflin on September 29 via a Q&amp;A session said that more Indians are hitting the US than ever. The visa … [+2723 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Italian astronaut becomes first European woman to take over command of International Space Station - Times of India", "description": "Italian astronaut Samantha Cristoforetti became the first European woman to take over the command of the International Space Station on Wednesday during a live ceremony from space. She took over from Russia's Oleg Artemyev, who gave her a symbolic key to hand…", "url": "https://timesofindia.indiatimes.com/videos/international/italian-astronaut-becomes-first-european-woman-to-take-over-command-of-international-space-station/videoshow/94531461.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-94531461,imgsize-70540.cms", "publishedAt": "2022-09-29T09:47:42Z", "content": "Sep 29, 2022, 04:52PM ISTSource: APItalian astronaut Samantha Cristoforetti became the first European woman to take over the command of the International Space Station on Wednesday during a live cere… [+647 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Pia Krishnankutty", "title": "Canada asks citizens to avoid travel to 3 Indian states, week after MEA warning on hate crimes - ThePrint", "description": "Travellers were advised to avoid Gujarat, Rajasthan and Punjab 'due to the unpredictable security situation and presence of landmines', a Canadian govt travel advisory stated Tuesday.", "url": "https://theprint.in/diplomacy/canada-asks-citizens-to-avoid-travel-to-3-indian-states-week-after-mea-warning-on-hate-crimes/1147757/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2022/09/Canada-scaled.jpg", "publishedAt": "2022-09-29T08:41:12Z", "content": "New Delhi: A week after India warned about a sharp increase in hate crimes and anti-India activities in Canada, the North American country has issued a travel advisory asking its citizens to avoid en… [+2670 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Akhilesh Yadav seeks BJP’s removal from power as he is re-elected SP chief - Hindustan Times", "description": "He said the people voted for the SP in the 2022 Uttar Pradesh assembly polls but the BJP snatched away their government and installed its own with malpractices and misuse of the official machinery | Latest News India", "url": "https://www.hindustantimes.com/india-news/akhilesh-yadav-seeks-bjp-s-removal-from-power-as-he-is-re-elected-sp-chief-101664439383428.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/29/1600x900/f852faba-3fcb-11ed-b0b0-fc99a9f59b01_1664439378992.jpg", "publishedAt": "2022-09-29T08:16:22Z", "content": "Former Uttar Pradesh chief minister Akhilesh Yadav on Thursday asked the people to remove the Bharatiya Janata Party (BJP) from power in the 2024 national polls and help Samajwadi Party (SP) become a… [+2240 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Puneet Wadhwa", "title": "Indian bond, equity markets decoupled; see 30% downside in Nifty50: CLSA - Business Standard", "description": "The decoupling of Indian equity markets this year from the global markets has been remarkable While the SampP 500 has lost over 20 per cent in CY22 so far the Nifty50 index is marginally in the red", "url": "https://www.business-standard.com/article/markets/indian-bond-equity-markets-decoupled-see-30-downside-in-nifty50-clsa-122092900415_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-02/07/full/1644257560-1719.jpg", "publishedAt": "2022-09-29T07:02:00Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "India vs South Africa 1st T20 Highlights: Arshdeep, SKY take IND to 8-wicket win - Hindustan Times", "description": "India vs South Africa 1st T20I Highlights: Suryakumar Yadav and KL Rahul have scored contrasting half centuries as the hosts chased down 107 on a difficult pitch to take a 1-0 lead in the three-match series.", "url": "https://www.hindustantimes.com/cricket/india-vs-south-africa-live-score-1st-t20-2022-ind-vs-sa-today-cricket-match-latest-scorecard-at-thiruvananthapuram-101664364499859.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/28/1600x900/India-South-Africa-Cricket-72_1664384128326_1664384128326_1664384143476_1664384143476.jpg", "publishedAt": "2022-09-29T06:51:42Z", "content": "India vs South Africa live: India full squad\r\nRohit Sharma(c), KL Rahul, Virat Kohli, Suryakumar Yadav, Rishabh Pant(w), Axar Patel, Dinesh Karthik, Deepak Chahar, Arshdeep Singh, Jasprit Bumrah, Yuz… [+90 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "All women, married or unmarried, have right to safe and legal abortion: Supreme Court - The Indian Express", "description": "A bench presided by Justice D Y Chandrachud held while the 1971 Act was concerned with married women, the statement of objects and reasons to the 2021 amendment does not differentiate between married and unmarried and therefore, “all women entitled to safe an…", "url": "https://indianexpress.com/article/india/all-women-entitled-to-safe-and-legal-abortion-supreme-court-8179879/", "urlToImage": "https://images.indianexpress.com/2022/09/WhatsApp-Image-2022-09-29-at-12.08.43.jpeg", "publishedAt": "2022-09-29T06:02:13Z", "content": "The Supreme Court Thursday ruled the rights available to married women under the Medical Termination of Pregnancy Act,1971, to abort a foetus will also be available to unmarried ones.A bench presided… [+1992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Healthy eating: Four best protein sources your body needs - The Indian Express", "description": "A lot of people who are confused about what kinds of foods to add to their diet so as to meet their daily protein requirement should know that plant-based proteins are easy to digest as compared to animal proteins", "url": "https://indianexpress.com/article/lifestyle/food-wine/healthy-eating-four-protein-sources-plant-based-body-health-8134310/", "urlToImage": "https://images.indianexpress.com/2022/09/GettyImages-protein-sources-1200.jpg", "publishedAt": "2022-09-29T06:00:30Z", "content": "There are many reasons why one should add plenty of protein-rich foods to their diet. It is understood that proteins help to structure and support the cells, build immunity and are useful for hormone… [+3259 chars]"}, {"source": {"id": null, "name": "Indiacarnews.com"}, "author": "Amit Sharma", "title": "Tata Tiago EV Price, Variants Explained - India Car News", "description": "Tata Motors has launched the new Tiago EV as the brand’s & India’s most affordable electric vehicle. This entry-level electric vehicle is available in the price bracket of Rs 8.49 lakh to Rs 11.79 lakh (ex-showroom). It is positioned below the Tata Tigor and …", "url": "https://www.indiacarnews.com/news/tata-tiago-ev-price-variants-explained-54075/", "urlToImage": "https://www.indiacarnews.com/wp-content/uploads/2022/09/Tata-Tiago-electric-range-1000x600.jpg", "publishedAt": "2022-09-29T04:07:30Z", "content": "Tata Motors has launched the new Tiago EV as the brand’s &amp; India’s most affordable electric vehicle. This entry-level electric vehicle is available in the price bracket of Rs 8.49 lakh to Rs 11.7… [+2848 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "Sourav Ganguly gives massive update on Sanju Samson's Team India future - Hindustan Times", "description": "Speaking ahead of the first T20I between India and South Africa, Sourav Ganguly gave a massive update on Sanju Samson's future with the Indian cricket team. | Cricket", "url": "https://www.hindustantimes.com/cricket/just-missed-the-world-cup-bcci-chief-sourav-ganguly-gives-massive-update-on-sanju-samson-s-team-india-future-101664388215539.html", "urlToImage": "https://images.hindustantimes.com/img/2022/09/28/1600x900/PTI09-25-2022-000162B-0_1664388364289_1664388364289_1664388435880_1664388435880.jpg", "publishedAt": "2022-09-29T01:40:55Z", "content": "With Sanju Samson missing out on Team India's T20 World Cup squad, many fans and experts have been left wondering about the wicketkeeper-batter's future with the national team. But it looks like the … [+1674 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Terror links to training sites to targeted killings: Govt's case against PFI - The Indian Express", "description": "According to a document of the Ministry of Home Affairs (MHA), these cases have been registered, among others, under provisions of the UAPA, Indian Penal Code and Arms Act.", "url": "https://indianexpress.com/article/india/terror-links-to-training-sites-to-targeted-killings-govts-case-against-pfi-8179248/", "urlToImage": "https://images.indianexpress.com/2022/09/PFI-office.jpg", "publishedAt": "2022-09-28T22:44:51Z", "content": "The ban on the Popular Front of Indiaunder the Unlawful Activities (Prevention) Act comes in the wake of over 1,300 criminal cases registered across the country by law enforcement agencies against PF… [+6115 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Claire Mom", "title": "NNPC, Indian Oil Corporation partner to boost cooking gas accessibility in Nigeria - TheCable", "description": "NNPC says it is partnering with stakeholders to enhance the accessibility and affordability of liquified petroleum gas (LPG) in Nigeria.", "url": "https://www.thecable.ng/nnpc-indian-oil-corporation-partner-to-boost-cooking-gas-accessibility-in-nigeria", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2022/09/cooking-gas.jpg", "publishedAt": "2022-09-28T20:03:00Z", "content": "The Nigeria National Petroleum Company Limited (NNPC Ltd.) says it is partnering with stakeholders to enhance the accessibility and affordability of liquified petroleum gas (LPG) in Nigeria.\r\nMele Ky… [+2554 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lloyd Burnard", "title": "India secure victory in 1st T20 after Proteas top-order meltdown | Sport - News24", "description": "Fast bowlers Arshdeep Singh and Deepak Chahar wreaked havoc with the new ball to set up a convincing eight-wicket win for India in the first Twenty20 international against the Proteas on Wednesday.", "url": "https://www.news24.com/sport/cricket/proteas/live-proteas-v-india-1st-t20-20220928", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7279/c67a56ad5b4144f5a983471ebc0e17f8.jpg", "publishedAt": "2022-09-28T13:02:21Z", "content": "INDIA WIN OPENING T20 AFTER PROTEAS BATTING MELTDOWN\r\nFast bowlers Arshdeep Singh and Deepak Chahar wreaked havoc with the new ball to set up a convincing eight-wicket win for India in the first Twen… [+2443 chars]"}]}