{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "Over 30000 near-Earth asteroids have been discovered; here is what you need to know - The Indian Express", "description": "Astronomers have discovered over 30,000 near-Earth asteroids and we keep discovering them and a faster and faster rate. Here is how they are discovered and how scientists find out if they are a threat to the Earth.", "url": "https://indianexpress.com/article/technology/science/30000-near-earth-asteroids-8215652/", "urlToImage": "https://images.indianexpress.com/2022/10/Near-Earth-asteroid-21-lutetia-20221018.jpg", "publishedAt": "2022-10-18T08:21:21Z", "content": "For an asteroid to be classified as a near-Earth Asteroid (NEA), its trajectory should bring it within 1.3 Astronomical Units (AU) of the Sun. One AU is the distance between the Sun and our planet. A… [+3214 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "How NASA plans to return an asteroid sample to Earth - The Indian Express", "description": "NASA's OSIRIS-REx spacecraft took off from the asteroid Bennu on May 10, 2021. Here is how the space agency plans to have the spacecraft \"drop a parcel\" containing asteroid samples to Earth.", "url": "https://indianexpress.com/article/technology/science/nasa-osiris-rex-bennu-asteroid-sample-return-8215364/", "urlToImage": "https://images.indianexpress.com/2022/10/OSIRIS-REx-sample-return-20221018.jpg", "publishedAt": "2022-10-18T06:57:21Z", "content": "OSIRIS-REx, NASAs first spacecraft designed for returning an asteroid sample, began its two-year journey back to Earth in 2021 and it is now on track to deliver a sample of the asteroid Bennu back to… [+2461 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Aniruddha Dhar", "title": "Jayalalithaa death: Panel holds aide Sasikala guilty, recommends probe - Hindustan Times", "description": "There was no cordial relationship between Jayalalithaa and Sasikala after 2012, said the report. | Latest News India", "url": "https://www.hindustantimes.com/india-news/jayalalithaa-death-panel-holds-aide-sasikala-guilty-recommends-probe-101666075157830.html", "urlToImage": "https://images.hindustantimes.com/img/2022/10/18/1600x900/a7fddcca-66aa-11eb-8ce1-74979b633462_1612417259389_1666075614984_1666075614984.jpg", "publishedAt": "2022-10-18T06:48:00Z", "content": "The Justice A Arumughaswamy Commission of inquiry, which probed the circumstances leading to the death of former Tamil Nadu chief minister J Jayalalithaa in 2016, in its concluding remarks said her a… [+2219 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ankit Saproo", "title": "In Xi Jinping's speech at party Congress, lies India's biggest opportunity - Economic Times", "description": "Chinese President Xi Jinping reiterated his commitment to the zero-COVID policy that has prioritised rampant lockdowns shutting down cities to stamp COVID outbreaks. Recent surges could bring more harsh measures that could further alienate the global investor…", "url": "https://economictimes.indiatimes.com/news/economy/policy/in-xi-jinpings-speech-at-party-congress-lies-indias-biggest-opportunity/articleshow/94935158.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94935213,width-1070,height-580,imgsize-188022,overlay-economictimes/photo.jpg", "publishedAt": "2022-10-18T06:44:00Z", "content": "Chinese President Xi Jinping has increasingly turned assertive and his speech at the 20th Congress of the Chinese Communist Party makes it clear that he is not going to back down on policies that hav… [+3792 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Janani K", "title": "Kantara Hindi box office collection Day 4: Rishab Shetty's film has solid Monday, higher than Day 1 - India Today", "description": "Rishab Shetty's Kantara is released in Hindi on October 14. The film's Day 4 earnings are higher than its Day 1 collection, according to trade reports.", "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-hindi-box-office-collection-day-4-rishab-shettys-film-surpasses-its-day-1-figures-2286591-2022-10-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/kantara_hindi_box_office_collection_day_4_rishab_shetty-sixteen_nine.jpg?VersionId=hQnxs0tmdifZn5qkhmK_TGh5rz8Lce_d", "publishedAt": "2022-10-18T02:26:00Z", "content": "By Janani K: Kannada film Kantara, written and directed by Rishab Shetty, is taking the box office by storm. The Hindi version of the film, which released on October 14, registered a solid collection… [+1846 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Nigeria vs Chile: Five talking points from clash - Punch Newspapers", "description": "Nigeria’s U-17 Women’s football team on Monday defeated Chile 2-1 in the third match of Group B at the Kalinga Stadium to book their place in the quarter-finals of the ongoing U-17 Women’s World Cup finals in India.", "url": "https://punchng.com/nigeria-vs-chile-five-talking-points-from-clash/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/10/17144714/Flamingos-1.jpg", "publishedAt": "2022-10-18T00:36:54Z", "content": "Nigerias U-17 Womens football team on Monday defeated Chile 2-1 in the third match of Group B at the Kalinga Stadium to book their place in the quarter-finals of the ongoing U-17 Womens World Cup fin… [+2536 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Fight against inflation will be prolonged and dogged, says RBI - Economic Times", "description": "The Reserve Bank of India in its October Bulletin noted that Indias fight against ‘stubborn retail inflation will be dogged and prolonged, given the long and variable lags with which monetary policy operates and that it is fraught with uncertainties. However,…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/fight-against-inflation-will-be-prolonged-and-dogged-says-rbi/articleshow/94919285.cms", "urlToImage": "https://img.etimg.com/thumb/msid-94919516,width-1070,height-580,imgsize-88010,overlay-economictimes/photo.jpg", "publishedAt": "2022-10-18T00:17:00Z", "content": "Mumbai: The central banks goal of reducing inflation to 4% would be a two-stage process, although repeated shocks are making the journey to the milestone harder, an assessment on the state of the eco… [+2341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Questioned for 9 hours, Sisodia claims pressure to join BJP; CBI denies - The Indian Express", "description": "Sisodia claimed pressure was put on him “on the side” to leave AAP, and that he was lured with an offer to become Chief Minister. The CBI “strongly” rebutted the allegations and said its questioning “was carried out in a professional and legal manner”.", "url": "https://indianexpress.com/article/cities/delhi/questioned-for-9-hrs-sisodia-claims-pressure-to-join-bjp-cbi-denies-8214686/", "urlToImage": "https://images.indianexpress.com/2022/10/P1-sisodialate-3col.jpg", "publishedAt": "2022-10-17T22:55:05Z", "content": "AFTER NINE hours of questioning Monday in the case related to alleged irregularities in Delhis previous excise policy, Deputy Chief Minister Manish Sisodia and the CBI faced off over what the former … [+4602 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Associated Press", "title": "After engine failure, Russian warplane crashes in Sea of Azov port city, 2 killed - India Today", "description": "A Russian warplane crashed in a residential area in the port of Yeysk on the Sea of Azov after suffering engine failure on Monday. At least two people were killed in the accident.", "url": "https://www.indiatoday.in/world/story/russian-warplane-crashes-sea-of-azov-port-city-engine-failure-2286525-2022-10-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/russian_warplane-sixteen_nine.jpg?VersionId=_iHZOwljwlG_4JVgtwmTg9mKIRB9W_OR", "publishedAt": "2022-10-17T16:59:58Z", "content": "By Associated Press: A Russian warplane crashed into a residential area in a Russian city on the Sea of Azov after suffering engine failure, killing at least two people and igniting a massive blaze t… [+1673 chars]"}, {"source": {"id": null, "name": "Businessworld.in"}, "author": null, "title": "FOGSI Calls For HPV Vaccination To Be Included In National Programs - BW Healthcareworld", "description": "News and Updates for Healthcare in India - , Healthcare Service Providers-FOGSI organizes Expert Group Meeting at AIIMS for ‘Cervical Cancer Mukt Bharat’", "url": "http://bwhealthcareworld.businessworld.in/article/FOGSI-Calls-For-HPV-Vaccination-To-Be-Included-In-National-Programs/18-10-2022-450847", "urlToImage": "http://static.businessworld.in/article/article_large_image/1581054067_nEQLGb_HPV_causing_cervical_cancer.jpg", "publishedAt": "2022-10-17T14:24:13Z", "content": "The Federation of Obstetric and Gynaecological Societies of India (FOGSI) has asked the government of India of India to include the HPV vaccine in the National Program to reduce the burden of cervica… [+2730 chars]"}]}