{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "FCI 'corruption': CBI arrests deputy general manager, searches 50 locations in Punjab, Haryana and Delhi - The Tribune India", "description": "The CBI on Wednesday launched a crackdown on alleged corruption in the Food Corporation of India, conducting searches at 50 locations in Punjab, Haryana and Delhi after arresting a DGM-ranked officer, officials said.", "url": "https://www.tribuneindia.com/news/nation/fci-corruption-cbi-arrests-deputy-general-manager-searches-50-locations-in-punjab-haryana-and-delhi-469456", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1972508284.jpg", "publishedAt": "2023-01-11T10:57:00Z", "content": "PTI\r\nNew Delhi, January 11\r\nThe CBI on Wednesday launched a crackdown on alleged corruption in the Food Corporation of India, conducting searches at 50 locations in Punjab, Haryana and Delhi after ar… [+903 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "With 900 million paid subscribers, Apple’s services gamble seems to have paid off - The Indian Express", "description": "With iPhone sales peaking in many matured markets and the company struggling with supply chain issues in China, the service segment has never been more important for Apple.", "url": "https://indianexpress.com/article/technology/with-900-million-paid-subscribers-apples-services-gamble-seems-to-have-paid-off-8375762/", "urlToImage": "https://images.indianexpress.com/2023/01/Apple-fb-1.jpg", "publishedAt": "2023-01-11T10:50:03Z", "content": "Apple now has over 900 million subscribers for its popular services, including Apple Music and Apple TV+. The figure is astounding, but more than that, it gives a sense of how quickly Apples services… [+4857 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Opti Burner Keto Gummies Review - Do OptiBurner Keto Weight Loss Gummies Work or Scam? - The Tribune India", "description": "Research shows that approximately 40 percent of the American population is overweight, and many others are at risk for obesity due to unhealthy lifestyles. Numerous physicians concur that the decline in daily physical activity may be attributable to new eatin…", "url": "https://www.tribuneindia.com/news/brand-connect/opti-burner-keto-gummies-review-do-optiburner-keto-weight-loss-gummies-work-or-scam-469477", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1447693640.jpg", "publishedAt": "2023-01-11T10:13:00Z", "content": "Research shows that approximately 40 percent of the American population is overweight, and many others are at risk for obesity due to unhealthy lifestyles. Numerous physicians concur that the decline… [+7087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Science Desk", "title": "In a first, scientists observe pair of supermassive black holes closest to collision course - The Indian Express", "description": "A newly-discovered pair of supermassive black holes are on their way to colliding with each other and are also the closest pair of supermassive black holes ever discovered.", "url": "https://indianexpress.com/article/technology/two-supermassive-black-holes-collision-8375134/", "urlToImage": "https://images.indianexpress.com/2023/01/Supermassive-black-holes-20230111.jpg", "publishedAt": "2023-01-11T08:01:25Z", "content": "Astronomers have spotted a pair of supermassive black holes that are well on their way to crashing into each other in a cataclysmic collision. According to the Simons Foundation, this doomed pair of … [+1859 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": "The Weather Channel", "title": "Northwest India to Get a Break from Cold Wave This Week; Night Temperatures to Rise by 2-4°C - The Weather Channel", "description": "Damp conditions may well replace the cold weather in India’s northwestern quarter this week.", "url": "https://weather.com/en-IN/india/news/news/2023-01-11-northwest-india-to-get-a-break-from-cold-wave-this-week", "urlToImage": "https://s.w-x.co/in-delhi%20cloudy%20eve.jpg", "publishedAt": "2023-01-11T06:18:26Z", "content": "Wednesday, January 11\r\n: After having endured bone-chilling nights for the past several weeks, residents of Northwest India will finally be in for a minor respite from the excruciating cold this week… [+2058 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "Ganguly provides big update on Pant's availability for DC in IPL 2023 - Hindustan Times", "description": "Sourav Ganguly provided a key update on Rishabh Pant's availability for the Delhi Capitals in the 2023 edition of the Indian Premier League. | Cricket", "url": "https://www.hindustantimes.com/cricket/sourav-ganguly-provides-big-update-on-rishabh-pant-s-availability-for-delhi-capitals-in-ipl-2023-101673412299282.html", "urlToImage": "https://images.hindustantimes.com/img/2023/01/11/1600x900/rishabh_pant_dc_1673414589471_1673414595848_1673414595848.webp", "publishedAt": "2023-01-11T05:24:14Z", "content": "Team India's star wicketkeeper-batter Rishabh Pant had met with a horrific car crash in the early morning hours of December 30. The 25-year-old is currently undergoing treatment for his injuries in M… [+1799 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Shanker Arnimesh", "title": "What RSS chief Bhagwat has to say about Hindus’ 1,000-year ‘war’, Indian Muslims & LGBTQ rights - ThePrint", "description": "Sarsanghchalak Mohan Bhagwat said 'war' is underway to protect Hindu society, Indian Muslims have 'nothing to fear' and RSS isn't concerned with day-to-day politics.", "url": "https://theprint.in/?p=1308629", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/01/Mohan-Bhagwat.jpg", "publishedAt": "2023-01-11T05:07:05Z", "content": "New Delhi: The new-found aggression in Hindu society is because Hindu society has been at war for over 1,000 years and it is but natural for those at war to be aggressive, Rashtriya Swayamsevak Sangh… [+7507 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Utkarsh Deshmukh", "title": "Maruti Suzuki eVX Electric SUV concept unveiled at the 2023 Auto Expo: Hyundai Creta EV challenger - CarToq.com", "description": "The much-awaited Auto Expo 2023 has commenced today and flagging off the event with a bang is the country’s largest carmaker Maruti Suzuki India Limited (MSIL). The company has finally taken the covers off of the much-rumored all-electric concept SUV at the s…", "url": "https://www.cartoq.com/maruti-suzuki-evx-electric-suv-concept-unveiled-at-the-2023-auto-expo-hyundai-creta-ev-challenger/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/01/maruti-evx-electric-suv-concept-featured.jpg", "publishedAt": "2023-01-11T05:04:39Z", "content": "The much-awaited Auto Expo 2023 has commenced today and flagging off the event with a bang is the country’s largest carmaker Maruti Suzuki India Limited (MSIL). The company has finally taken the cove… [+4947 chars]"}, {"source": {"id": null, "name": "Team-BHP"}, "author": "Tushar Kelshikar", "title": "2023 MG Hector & Hector Plus launched; priced from Rs 14.73 lakh - Team-BHP", "description": "MG Motor India has launched the 2023 Hector and Hector Plus in the Indian market. The Hector facelift is priced at Rs. 14.73 lakh, while the Hector Plus starts at Rs. 20.80 lakh (ex-showroom). The Hector and Hector Plus get subtle cosmetic changes for the 202…", "url": "https://www.team-bhp.com/news/2023-mg-hector-hector-plus-launched-priced-rs-1473-lakh", "urlToImage": "https://www.team-bhp.com/sites/default/files/styles/large/public/2023-mg-hector-facelift-07_0.jpg", "publishedAt": "2023-01-11T04:14:49Z", "content": "MG Motor India has launched the 2023 Hector and Hector Plus in the Indian market. The Hector facelift is priced at Rs. 14.73 lakh, while the Hector Plus starts at Rs. 20.80 lakh (ex-showroom).\r\nThe H… [+1302 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pathan Trailer: Will Shah Rukh Khan's Pathaan trailer break record of his last 5 releases? - DNAIndiaNews", "description": "Pathaan Trailer: Will Shah Rukh Khan's Pathaan trailer break record of his last 5 releases? Siddharth Anand's Pathaan got its first trailer on Tuesday. Fans ...", "url": "https://www.youtube.com/watch?v=2hGeM0qBWM8", "urlToImage": "https://i.ytimg.com/vi/2hGeM0qBWM8/maxresdefault.jpg", "publishedAt": "2023-01-10T11:26:41Z", "content": null}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Web Desk", "title": "Iran sentences three more protesters to death for 'waging war on God’ - India Today", "description": "Three more anti-government protesters have been sentenced to death in Iran on charges of ‘waging war on God’ amid international criticism.", "url": "https://www.indiatoday.in/world/story/three-more-protesters-face-death-penalty-in-iran-on-charges-of-waging-war-on-god-2319462-2023-01-10", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202301/khamenei-sixteen_nine.jpg?VersionId=T8CQUFCm4pBoi1_D3lg6vDCdSqdlqXMl", "publishedAt": "2023-01-10T02:52:37Z", "content": "By India Today Web Desk: An Iranian court has sentenced three more anti-government protesters to death on charges of waging war on God, its Mizan news agency reported on Monday, growing international… [+2819 chars]"}]}