{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Vietnam automaker Vinfast opens factory in India, eyeing growth in Asia - AP News", "description": "Vietnam's Vinfast has begun production at a $500 million electric vehicle plant in India’s Tamil Nadu, part of a larger $2 billion investment to expand into Asian markets. The new factory will start by producing 50,000 EVs a year, with room to triple output. …", "url": "https://apnews.com/article/india-vinfast-ev-auto-vietnam-be8f2fd5a2adf1b502089de4652585e5", "urlToImage": "https://dims.apnews.com/dims4/default/026313e/2147483647/strip/true/crop/7971x4484+0+415/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F87%2F1a%2F93d16411f61b8455b0d990791d31%2F21fad157020c4f0cb3ee2208205c779f", "publishedAt": "2025-08-04T05:37:00Z", "content": "THOOTHUKUDI, India (AP) Vietnams Vinfast began production at a $500 million electric vehicle plant in southern Indias Tamil Nadu state on Monday, part of a planned $2 billion investment in India and … [+7387 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Sudhi Ranjan Sen, Rakesh Sharma, Preeti Soni", "title": "Modi Defiant as Trump Steps Up Pressure on India’s Russian Oil Purchases - Bloomberg.com", "description": "Indian Prime Minister Narendra Modi struck a defiant tone in the face of US President Donald Trump’s tariff threats, urging the nation to buy local goods as his administration signaled it would continue buying Russian oil.", "url": "https://www.bloomberg.com/news/articles/2025-08-04/modi-defiant-as-trump-steps-up-pressure-on-russia-oil-purchases", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i2rCaFP9nJ1E/v0/1200x800.jpg", "publishedAt": "2025-08-04T00:50:00Z", "content": "Indian Prime Minister Narendra Modi struck a defiant tone in the face of US President Donald Trumps tariff threats, urging the nation to buy local goods as his administration signaled it would contin… [+446 chars]"}]}