{"articles": [{"author": "Sky Sports", "content": "Jonny Bairstow backed England to keep playing their aggressive brand of cricket after the tourists chased down 337 in just 43.3 overs to beat India in the second one-day international in Pune.\r\nEngla… [+3096 chars]", "description": "Jonny Bairstow backed England to keep playing their aggressive brand of cricket after they chased down 337 in just 43.3 overs to beat India in the second ODI.", "publishedAt": "2021-03-26T19:58:08Z", "source": {"id": null, "name": "Sky Sports"}, "title": "Jonny Bairstow backs England to stick to aggressive approach in white-ball cricket - Sky Sports", "url": "https://www.skysports.com/cricket/news/12123/12257562/jonny-bairstow-backs-england-to-stick-to-aggressive-approach-in-white-ball-cricket", "urlToImage": "https://e1.365dm.com/21/03/1600x900/skysports-ap-newsroom-jonny-bairstow_5319041.jpg"}, {"author": "Swaraj Singh Dhanjal, Deborshi Chaki", "content": "Mumbai: The Supreme Court on Friday handed Tata Sons Ltd a major victory in its four-year-long feud with the Mistry family, its single-largest shareholder, as it set aside an appeals court ruling tha… [+4909 chars]", "description": "The Tata group’s victory brings an end to India’s biggest corporate battle that was sparked by the ouster of Cyrus Mistry in October 2016.Cyrus Mistry took over the chairmanship of India’s biggest conglomerate from Ratan Tata in 2012 as part of a succession p…", "publishedAt": "2021-03-26T18:25:37Z", "source": {"id": null, "name": "Livemint"}, "title": "Big win for Tata in Mistry battle - Mint", "url": "https://www.livemint.com/companies/people/big-win-for-tata-in-mistry-battle-11616781753652.html", "urlToImage": "https://images.livemint.com/img/2021/03/26/600x338/mistray-kGPB--621x414@LiveMint_(1)_1616781950219.jpg"}, {"author": "PTI", "content": "Chief Minister Uddhav Thackeray on Friday ordered night curfew in entire Maharashtra from March 28 in view of the unabated rise in COVID-19 cases, anofficial statement said.\r\nThe curfew order will co… [+2267 chars]", "description": "With a fire at a hospital in Mumbai claiming nine lives on Friday, the chief minister also instructed the authorities to check fire safety measures at all temporary hospitals where COVID-19 patients are being treated.", "publishedAt": "2021-03-26T17:25:41Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Night curfew in Maharashtra from Sunday, orders CM Uddhav Thackeray - The Indian Express", "url": "https://indianexpress.com/article/india/night-curfew-in-maharashtra-from-sunday-orders-cm-uddhav-thackeray-7247088/", "urlToImage": "https://images.indianexpress.com/2021/03/Uddhav-Thackeray-1.jpg"}, {"author": "TIMESOFINDIA.COM", "content": "Bharat Bandh: Farmers block highways, roads in Punjab, Haryana; rail services hitFarmers blocked national highways and other key roads at many places in Punjab and Haryana, and squatted on railway tr… [+129 chars]", "description": "India News: The Bharat Bandh on Friday was called by the Samyukta Kisan Morcha (SKM), an umbrella body of farmer unions protesting against the three contentious f", "publishedAt": "2021-03-26T16:12:00Z", "source": {"id": "the-times-of-india", "name": "The Times of India"}, "title": "Bharat Bandh: Roads and rail traffic affected in Punjab, Haryana; partial response elsewhere - Times of India", "url": "https://timesofindia.indiatimes.com/india/bharat-bandh-roads-and-rail-traffic-affected-in-punjab-haryana-partial-response-elsewhere/articleshow/81710844.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-81712010,width-1070,height-580,imgsize-63648,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"author": "Vanshika Malhotra", "content": "Apple, apart from getting involved in controversies, lawsuits, and more, has been a part of hilarious incidents too. We are talking about situations when people have ordered Apple products and got ho… [+2266 chars]", "description": "A teen in Thailand ordered an iPhone online that was listed at a really affordable price. However got an iPhone-shaped coffee table instead.", "publishedAt": "2021-03-26T15:33:48Z", "source": {"id": null, "name": "Www.bgr.in"}, "title": "Teen orders iPhone online, gets iPhone-shaped coffee table instead - BGR India", "url": "https://www.bgr.in/news/teen-orders-iphone-online-gets-iphone-coffee-table-instead-know-details-950527/", "urlToImage": "https://st1.bgr.in/wp-content/uploads/2021/03/iphone-shaped-table.jpg"}, {"author": "Manoj Kumar R", "content": "Rang De movie cast: Nithiin, Keerthy SureshRang De movie director: Venky AtluriRang De rating: 3 stars\r\nThe boy is an idiot and indifferent to all the matters of the heart. The girl is sensitive, int… [+2219 chars]", "description": "Rang De movie review: Nithiin and Keerthy Suresh film feels like a comforting blanket in these unpredictable times. It provides much-needed warmth and allows you to delight in a sense of nostalgia.", "publishedAt": "2021-03-26T12:48:30Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Rang De movie review: Nithiin, Keerthy Suresh deliver a delightful romantic film - The Indian Express", "url": "https://indianexpress.com/article/entertainment/movie-review/rang-de-movie-review-nithiin-keerthy-suresh-deliver-a-delightful-romantic-film-7246787/", "urlToImage": "https://images.indianexpress.com/2021/03/rang-de-review-.jpg"}, {"author": "Bloomberg", "content": "For years China has sought to draw moral equivalence with the West over human rights, insisting that other countries have no standing to criticize its policies. Now Beijing is making companies pay if… [+6430 chars]", "description": "China this week has pushed a campaign to boycott Western retailers after the U.S., U.K., Canada and the European Union imposed sanctions over human-rights abuses against ethnic minority Uyghurs in Xinjiang.", "publishedAt": "2021-03-26T09:49:30Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Xi’s red line on China human rights makes companies like H&M, Nike, Uniqlo pick sides - The Indian Express", "url": "https://indianexpress.com/article/world/china-xinjiang-hm-nike-uniqlo-7246442/", "urlToImage": "https://images.indianexpress.com/2021/03/China-5.jpg"}, {"author": "HT Correspondent | Edited by Sameer", "content": "Covid-19 cases in India are rising at a rate not seen since May last year, and the daily infections in two states have already hit record highs. Here is all you need to know about the rise:\r\n It indi… [+2073 chars]", "description": "Covid-19 cases in India are rising at a rate not seen since May last year, and the daily infections in two states have already hit record highs", "publishedAt": "2021-03-26T04:02:27Z", "source": {"id": null, "name": "Hindustan Times"}, "title": "India’s second Covid wave may be worse than the first: Key points - Hindustan Times", "url": "https://www.hindustantimes.com/india-news/indias-second-covid-wave-may-be-worse-than-the-first-key-points-101616731347422.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/26/1600x900/a695a188-8de7-11eb-b5e7-48d3d3b0cffd_1616731346162.jpg"}, {"author": null, "content": "New Delhi: At the United Nations Human Rights Council (UNHRC), India abstained on one resolution on the human rights situation in Palestine but voted in favour of three other resolutions condemning I… [+7238 chars]", "description": "In the latest session of the UN body, India voted against two motions, one sponsored by China and another focused on Iran, while abstaining on other resolutions dealing with the human rights situation in Nicaragua, Belarus, Syria, Georgia and South Sudan.", "publishedAt": "2021-03-25T17:31:13Z", "source": {"id": null, "name": "Thewire.in"}, "title": "India Votes Against Israel in Three UNHRC Resolutions, Abstains on One - The Wire", "url": "https://thewire.in/external-affairs/indias-voting-record-unhrc-palestine-israel", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/03/25225311/image-2021-03-25T225258.941-800x400.png"}], "message": "Successful api call", "number_of_news": 9, "status": 200, "topic": "india"}