{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40 - AP News", "description": "The health minister in the southern Indian state of Tamil Nadu says a stampede at a rally for a popular actor and politician has killed at least 36 people and injured 40 others. The minister tells The Associated Press late Saturday that the victims were dead …", "url": "https://apnews.com/article/india-rally-stampede-a52f7c744b57cbdfa70a8d6fbf1563b0", "urlToImage": "https://dims.apnews.com/dims4/default/680ff02/2147483647/strip/true/crop/1620x911+0+84/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5d%2F47%2F003cc0c45b4ea614c5b6cad75f79%2F25fb40dbb6f64d5591568e2242d5b33a", "publishedAt": "2025-09-28T05:47:00Z", "content": "NEW DELHI (AP) A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others, the states health minister said lat… [+2462 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Vaccines for dementia: 4 vaccines that can lower the risk of the progressive disease - The Times of India", "description": "Dementia remains one of the world’s most urgent public health challenges. It’s an umbrella term used to describe a range of neurological conditions affecting the brain that worsen over time, and there are currently over 55 million people with dementia worldwi…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/vaccines-for-dementia-4-vaccines-that-can-lower-the-risk-of-the-progressive-disease/photostory/124153245.cms", "urlToImage": "https://static.toiimg.com/photo/124153256.cms", "publishedAt": "2025-09-26T14:00:00Z", "content": "Dementia remains one of the worlds most urgent public health challenges. Its an umbrella term used to describe a range ofneurological conditions affecting the brain that worsen over time, and there a… [+1160 chars]"}]}