{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Manika Batra’s secret to potential Olympic success: a fat motivational book, a surprise twiddle switch of racquet, and a mother’s emotional support - The Indian Express", "description": "In the last decade, Manika turned into a massive Virat Kohli fan, for his very relatable Delhi persona. \"It's because of how he handles everything that happens to him, and how passionate he's about winning through all that. And how he enjoys playing cricket,\"…", "url": "https://indianexpress.com/article/sports/sport-others/manika-batras-secret-to-potential-olympic-success-9469797/", "urlToImage": "https://images.indianexpress.com/2024/07/Manika-Batra-and-mother.jpg", "publishedAt": "2024-07-23T02:59:46Z", "content": "Manika Batra cant readily remember the name of that motivational book she reads before every TT match. Ek moti-si kitaab hai, she describes the 280 pager which works for her like a charm. A fat book.… [+7362 chars]"}, {"source": {"id": null, "name": "Indianweb2.com"}, "author": "Vardaan", "title": "ISRO, ESA and NASA Team Up to Study Asteroid Apophis During Its 2029 Flyby - IndianWeb2.com", "description": "An asteroid , named after Egyptian deity of destruction, — Apophis  — will come remarkably close to Earth during its flyby in 2029. At its c...", "url": "https://www.indianweb2.com/2024/07/isro-esa-and-nasa-team-up-to-study.html", "urlToImage": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg7QO9rN7Cc1GFEoKmmP0EFizk9gjWZUCC-IJHu3qI6N4AodWsiN7cnZ0xdRXlNJTguuttIMAwUFYlgjd-yXXJRvTYKrNeIFN_RDG2NkK4jdqXLVbhlgVkql1-bd8bztoPFw49KLGpDztTmX3AuwrTQSgn0pWD9tH17PGxSUGMM2moQFxlNB3KFOnLHsNYt/s16000/20240722_150406_0000.png", "publishedAt": "2024-07-22T09:40:00Z", "content": "An asteroid, named after Egyptian deity of destruction, Apophis will come remarkably close to Earth during its flyby in 2029. At its closest approach, it will be about 19,000 miles (30,500 kilometers… [+1840 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhishek Mishra3", "title": "Explore the Cosmos: A summer road trip with Nasa's Chandra and Webb - The Times of India", "description": "The tour begins with Rho Ophiuchi, about 390 light-years away. This nearby star-forming region features a mix of gas and stars. Chandra's X-rays, shown in purple, highlight young stars, while Webb's infrared data in various colors reveal intricate gas and dus…", "url": "https://timesofindia.indiatimes.com/science/explore-the-cosmos-a-summer-road-trip-with-nasas-chandra-and-webb/photostory/111921417.cms", "urlToImage": "https://static.toiimg.com/photo/111921558.cms", "publishedAt": "2024-07-22T09:25:22Z", "content": "Your Privacy\r\nWhen you visit our website, we store cookies on your browser to collect information. The information collected might relate to you, your preferences or your device, and is mostly used t… [+2093 chars]"}]}