{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Kala Vijayaraghavan and Arindam Majumder", "title": "Air India writes off Rs 7,000 crore in FY23, turns Ebitdar positive - Economic Times", "description": "Air India, owned by Tata, wrote off an estimated INR7,000 crore ($927 million) in fiscal year 2023 as a result of impairments resulting from faulty aircraft and engines, as well as low-cost airline AirAsia's Indian arm, people familiar with the situation said…", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/air-india-writes-off-rs-7000-crore-in-fy23-turns-ebitdar-positive/articleshow/101809090.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101812678,width-1070,height-580,imgsize-177908,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-17T01:09:00Z", "content": "Tata-owned Air India wrote off an estimated 7,000 crore in FY23 as part of impairments stemming from the carrier's faulty aircraft and engines as well as low-cost airline AirAsia India, people aware … [+3638 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Naima Syed", "title": "Kidney Cells Rejuvenation: A Novel Breakthrough - Asiana Times", "description": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnology. A previously unknown phenomenon of housekeeping, in which…", "url": "https://asianatimes.com/kidney-cells-rejuvenation-a-novel-breakthrough/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/07/USC-News-University-of-Southern-California.jpg", "publishedAt": "2023-07-15T08:37:27Z", "content": "An intriguing discovery which involved rejuvenation of kidney cells was achieved by the scientists at the University of Texas. The study detailing this mechanism was published in Nature Nanotechnolog… [+3725 chars]"}]}