{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Manila Times"}, "author": "Aric John Sy Cua", "title": "MoA stolen globe revealed to be promotional tool for Netflix film - The Manila Times", "description": "The iconic globe of SM Mall of Asia was reportedly 'stolen' on Saturday night, which caught the attention of netizens.Netizen Chester Tangonan shared a video on Facebook that the...", "url": "https://www.manilatimes.net/2021/11/14/news/moa-stolen-globe-revealed-to-be-promotional-tool-for-netflix-film/1822176", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/14/26573.jpg", "publishedAt": "2021-11-14T04:58:16Z", "content": "The iconic globe of SM Mall of Asia was reportedly \"stolen\" on Saturday night, which caught the attention of netizens.\r\nNetizen Chester Tangonan shared a video on Facebook that the globe was stolen b… [+1362 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Humans Had Significant Role in the Extinction of the Woolly Mammoth - SciTechDaily", "description": "New research shows that humans had a significant role in the extinction of woolly mammoths in Eurasia, occurring thousands of years later than previously thought. An international team of scientists led by researchers from the University of Adelaide and Unive…", "url": "https://scitechdaily.com/humans-had-significant-role-in-the-extinction-of-the-woolly-mammoth/", "urlToImage": "https://scitechdaily.com/images/Woolly-Mammoth-Siberia.jpg", "publishedAt": "2021-11-14T00:29:51Z", "content": "ByUniversity of AdelaideNovember 13, 2021\r\nWoolly mammoths persisted in Siberia until the mid-Holocene. Credit: Mauricio Anton\r\nNew research shows that humans had a significant role in the extinction… [+3529 chars]"}, {"source": {"id": null, "name": "Malaysiakini"}, "author": "Reuters", "title": "Daughter of Philippine President Duterte files candidacy for VP - Malaysiakini", "description": "Southeast Asian nation of 110 million holds elections May 2022.", "url": "https://www.malaysiakini.com/news/599078", "urlToImage": "https://icf.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2021/10/3dc4d6b8a6bac33a9ac91a4998722300.jpg", "publishedAt": "2021-11-13T07:08:05Z", "content": "The daughter of Philippine leader Rodrigo Duterte filed her candidacy for the vice presidency, her spokesperson said today, ending months of speculation about her 2022 election plans.\r\nSara Duterte-C… [+308 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "Roque loses bid for International Law Commission seat - Philstar.com", "description": "Presidential spokesperson failed to clinch a seat at the International Law Commission, garnering the least number of votes among 11 candidates from Asia-Pacific states for the eight seats available on the panel for representatives coming from the region.", "url": "https://www.philstar.com/headlines/2021/11/13/2141062/roque-loses-bid-international-law-commission-seat", "urlToImage": "https://media.philstar.com/photos/2021/11/13/harryroqueunilcprotest1_2021-11-13_09-53-18.jpg", "publishedAt": "2021-11-13T01:56:00Z", "content": "MANILA, Philippines — Presidential spokesperson failed to clinch a seat at the International Law Commission, garnering the least number of votes among 11 candidates from Asia-Pacific states for the e… [+3011 chars]"}, {"source": {"id": null, "name": "Malaysiakini"}, "author": "Bernama", "title": "Mavcom says air travellers not creditors, wants AirAsia X to reimburse customers - Malaysiakini", "description": "Mavcom will not hesitate to exercise its powers.", "url": "https://www.malaysiakini.com/news/599003", "urlToImage": "https://icf.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2021/01/e4d1c39d8a1df896ab04367fa5cae924.jpg", "publishedAt": "2021-11-12T12:49:17Z", "content": "The Malaysian Aviation Commission (Mavcom) said it has clearly and unequivocally urged AirAsia X Bhd (AAX) to reassess its proposal to treat air travel consumers as creditors and to pay only 0.5 perc… [+386 chars]"}]}