{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "Filipino boy band nominated in Billboard Music Awards – The Manila Times - The Manila Times", "description": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music competition. The group made it to the Top Social Artist category, …", "url": "https://www.manilatimes.net/2021/05/01/news/national/filipino-boy-band-nominated-in-billboard-music-awards/869023/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/04/boy-band.jpg", "publishedAt": "2021-04-30T16:17:59Z", "content": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music compet… [+2375 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "What we know about India COVID variant as virus sweeps South Asia - Al Jazeera English", "description": "The variant, named B.1.617, has been reported in some 17 countries, raising global concern.", "url": "https://www.aljazeera.com/news/2021/4/30/what-we-know-about-india-covid-variant-as-virus-sweeps-south-asia", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/04/2021-04-29T054523Z_631219766_RC2H5N9VMJA6_RTRMADP_3_HEALTH-CORONAVIRUS-INDIA.jpg?resize=1200%2C630", "publishedAt": "2021-04-30T04:54:43Z", "content": "India has recorded the worlds sharpest spike in coronavirus infections this month, with political and financial capitals New Delhi and Mumbai running out of hospital beds, oxygen and medicines.\r\nScie… [+3055 chars]"}, {"source": {"id": null, "name": "Malaysiakini"}, "author": "Reuters", "title": "Explainer: What we know about the Indian variant as Covid-19 sweeps South Asia - Malaysiakini", "description": "India is being hit hard by a mutated variant of the disease, with the local healthcare system collapsing under pressure.", "url": "https://www.malaysiakini.com/world/572778", "urlToImage": "https://i.newscdn.net/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2021/04/d46e3ffb8a5a515d472027d1c834c60f.jpg", "publishedAt": "2021-04-30T03:00:28Z", "content": "India has recorded the world's sharpest spike in coronavirus infections this month, with political and financial capitals New Delhi and Mumbai running out of hospital beds, oxygen and medicines. \r\nSc… [+265 chars]"}, {"source": {"id": null, "name": "Geek Culture"}, "author": "Zheng Yi", "title": "StarHub First In Southeast Asia To Launch NVIDIA GeForce NOW Cloud Gaming Service - Geek Culture", "description": "StarHub will be the first in Southeast Asia and the only operator in Singapore to launch NVIDIA GeForce Now Cloud Gaming Service.", "url": "https://geekculture.co/starhub-first-in-southeast-asia-to-launch-nvidia-geforce-now-cloud-gaming-service/", "urlToImage": "https://geekculture.co/wp-content/uploads/2021/04/Starhub-GeForce-Now.jpg", "publishedAt": "2021-04-30T01:30:19Z", "content": "Telecommunications company StarHub will be the first in Southeast Asia and the only local operator in Singapore to introduce cloud gaming service NVIDIA GeForce NOW, setting the stage for next-genera… [+2178 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Christopher Lee recalls the 1 incident that touched him when he stepped out of prison - AsiaOne", "description": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively. But when it comes to local stars breaking the law, the most dramatic incident has to be when Christop…", "url": "https://www.asiaone.com/entertainment/christopher-lee-recalls-1-incident-touched-him-when-he-stepped-out-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210429_chris.jpg?h=20f5ad32&itok=qkuCQ-NB", "publishedAt": "2021-04-29T06:47:00Z", "content": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively.\r\nBut when it comes to local stars breakin… [+2587 chars]"}]}