{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Ramesh Nair appointed CEO for Collier’s India business - Moneycontrol.com", "description": "As Managing Director, Market Development, Asia, Ramesh Nair will use his considerable industry experience to add value beyond the boundaries of India and develop services, expand client relationships, and attract other talented professionals to the company.", "url": "https://www.moneycontrol.com/news/business/real-estate/ramesh-nair-appointed-ceo-for-colliers-india-business-7199921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Ramesh-Nair--770x433.jpg", "publishedAt": "2021-07-21T04:05:09Z", "content": "You heard it on Moneycontrol first. Leading diversified professional services and investment management company Colliers, on July 21, announced the appointment of Ramesh Nair as the Chief Executive O… [+2010 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Taylor Lyles", "title": "Steam Deck Specs: How the Nintendo Switch Compares to Valve's Handheld Gaming PC - IGN SOUTH EAST ASIA", "description": "A closer look into the guts of two handheld/home gaming hardware hybrids", "url": "https://sea.ign.com/steam-deck/174441/feature/steam-deck-specs-how-the-nintendo-switch-compares-to-valves-handheld-gaming-pc", "urlToImage": "https://sm.ign.com/t/ign_ap/feature/s/steam-deck/steam-deck-specs-how-the-nintendo-switch-compares-to-valves_c9hg.1200.jpg", "publishedAt": "2021-07-21T03:28:42Z", "content": "Following rumors and speculation, Valve is once again dipping its toes into the hardware market. But instead of a virtual reality headset or a controller, Valve is releasing Steam Deck a handheld gam… [+11281 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Haig Road, Chong Pang market and food centres to close after 35 Covid-19 cases found - AsiaOne", "description": "SINGAPORE - Two more markets and food centres will be closed after 35 Covid-19 cases were detected among people who worked or visited those places. The Ministry of Health (MOH) said it has detected 25 of such cases at Haig Road Market and Food Centre, and 10 …", "url": "https://www.asiaone.com/singapore/haig-road-chong-pang-market-and-food-centres-close-after-35-covid-19-cases-found", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/20210721_market_stliahezaobao.jpg?h=0429cc9e&itok=6f1BH0WH", "publishedAt": "2021-07-21T00:38:28Z", "content": "SINGAPORE - Two more markets and food centres will be closed after 35 Covid-19 cases were detected among people who worked or visited those places.\r\nThe Ministry of Health (MOH) said it has detected … [+4883 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Singapore's grip on $41 billion oil market challenged by China - The Straits Times", "description": "SINGAPORE (BLOOMBERG) - Singapore is facing the greatest competition yet to its status as the dominant marine fuel supplier in Asia, with China luring more ships to its shores following a rapid expansion of its port and refining facilities.. Read more at stra…", "url": "https://www.straitstimes.com/business/economy/singapores-grip-on-41-billion-oil-market-challenged-by-china", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/07/21/af_sgstrait_2107.jpg?itok=b1vNSKTW", "publishedAt": "2021-07-20T23:21:34Z", "content": "SINGAPORE (BLOOMBERG) - Singapore is facing the greatest competition yet to its status as the dominant marine fuel supplier in Asia, with China luring more ships to its shores following a rapid expan… [+4046 chars]"}]}