{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "India and Russia to secure Central Asia against Taliban radicalisation - Hindustan Times", "description": "While the security of Central Asian Republics was discussed in the Doval-Patrushev meeting, the Russian interlocutors conveyed that situation in these republics was under control, but the threat will mount once the Taliban will get ambitious to spread their c…", "url": "https://www.hindustantimes.com/india-news/india-and-russia-to-secure-central-asia-against-taliban-radicalisation-101631160208138.html", "urlToImage": "https://images.hindustantimes.com/img/2021/09/09/1600x900/PM_Modi_with_Vladimir_Putin_1631160306246_1631160306387.png", "publishedAt": "2021-09-09T04:07:19Z", "content": "India and Russia have decided to join hands to firewall Central Asian Republics bordering Afghanistan from spill-over of Islamic radicalisation and jihad from Taliban-ruled Kabul. The security of Cen… [+1802 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "IZWAN IDRIS", "title": "AirAsia narrow losses in Q2, sees V-shaped resumption in air travel demand - The Star Online", "description": "KUALA LUMPUR: AirAsia Group Bhd said revenue climbed on the second quarter ended June 30, coming from a low base last year and boosted by the jump in contribution from its expanding digital and lifestyle businesses.", "url": "https://www.thestar.com.my/business/business-news/2021/09/08/airasia-narrow-losses-in-q2-sees-v-shaped-resumption-in-air-travel-demand", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/09/08/1286713.jpg", "publishedAt": "2021-09-08T13:04:00Z", "content": "KUALA LUMPUR: AirAsia Group Bhd said revenue climbed on the second quarter ended June 30, coming from a low base last year and boosted by the jump in contribution from its expanding digital and lifes… [+3278 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Young Hong Kong actors deny getting arrested for having sex with 14-year-old girl - AsiaOne", "description": "Since the Kris Wu scandal, it seems like time is up for Asian showbiz. Not only has there been an increase in awareness surrounding sexual consent — especially in China — but artistes are also quick to distance themselves from potential scandals. Just like th…", "url": "https://www.asiaone.com/entertainment/young-hong-kong-actors-deny-arrested-sex-14-year-old-girl-rio-chan-darryl-chan-hugo-chan", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/darryl-rio-hugo_IG.png?h=0429cc9e&itok=sq1Fe7ZE", "publishedAt": "2021-09-07T07:27:00Z", "content": "Since the Kris Wu scandal, it seems like time is up for Asian showbiz.\r\nNot only has there been an increase in awareness surrounding sexual consent especially in China  but artistes are also quick to… [+1495 chars]"}]}