{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Geylang murder case: 8-year-old victim was nice, would greet him when they met in lift, says neighbour - AsiaOne", "description": "A 35-year-old woman will be charged with the murder of her eight-year-old daughter today. The biological mother was arrested on Tuesday after the police were alerted to an incident in Geylang Lorong 31 at around 11.40am. Upon arrival at the residential unit, …", "url": "https://www.asiaone.com/singapore/geylang-murder-case-8-year-old-victim-was-nice-would-greet-him-when-they-met-lift-says", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210812_murder_shimindailynews.jpg?h=0429cc9e&itok=R-_3_La6", "publishedAt": "2021-08-12T03:40:36Z", "content": "A 35-year-old woman will be charged with the murder of her eight-year-old daughter today.\r\nThe biological mother was arrested on Tuesday after the police were alerted to an incident in Geylang Lorong… [+1413 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Breathing, talking and sneezing can spread Covid-19: NUS study - AsiaOne", "description": "SINGAPORE - A new study by a National University of Singapore (NUS) team has found that an infected person can spread Covid-19 by exhaling fine aerosol particles when breathing, talking and singing, not just though droplets when coughing or sneezing. The auth…", "url": "https://www.asiaone.com/singapore/breathing-talking-and-sneezing-can-spread-covid-19-nus-study", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210812_breathing_nus.jpg?h=0429cc9e&itok=-r9nuMhw", "publishedAt": "2021-08-12T01:16:20Z", "content": "SINGAPORE - A new study by a National University of Singapore (NUS) team has found that an infected person can spread Covid-19 by exhaling fine aerosol particles when breathing, talking and singing, … [+5624 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Mo Stewart", "title": "Liverpool can use Lionel Messi transfer to sneak his potential successor out of PSG - Liverpool.com", "description": "With PSG forced to sell to accommodate their influx of superstars, including Lionel Messi, Liverpool can snatch their top young talent including fellow La Masia starlet in Xavi Simons.", "url": "https://www.liverpool.com/liverpool-fc-news/transfer-news/lionel-messi-transfer-psg-liverpool-21288972", "urlToImage": "https://i2-prod.liverpool.com/incoming/article21288935.ece/ALTERNATES/s1200/0_XaviSimon.jpg", "publishedAt": "2021-08-12T00:00:00Z", "content": "With Lionel Messi now confirmed at Paris Saint Germain, the football world has begun salivating over the star-studded XI that the Parisiens can potentially field. FIFA FUT 22 has taken over real life… [+5859 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Jump inside bro': Man finds himself stuck in MBS fountain - AsiaOne", "description": "Those who've been to Marina Bay Sands (MBS) will be familiar with Rain Oculus, the massive water feature located in the Shoppes. Recently, a man had a different experience of the fountain than most visitors. He had climbed into the bowl and a short 11-second …", "url": "https://www.asiaone.com/singapore/jump-inside-bro-man-finds-himself-stuck-mbs-fountain", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20211209_mbsfountainHL.jpg?h=388f2129&itok=iNZ3F4yv", "publishedAt": "2021-08-11T16:58:00Z", "content": "Those who've been to Marina Bay Sands (MBS) will be familiar with Rain Oculus, the massive water feature located in the Shoppes. Recently, a man had a different experience of the fountain than most v… [+1456 chars]"}]}