{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Christopher Lee recalls the 1 incident that touched him when he stepped out of prison - AsiaOne", "description": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively. But when it comes to local stars breaking the law, the most dramatic incident has to be when Christop…", "url": "https://www.asiaone.com/entertainment/christopher-lee-recalls-1-incident-touched-him-when-he-stepped-out-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210429_chris.jpg?h=20f5ad32&itok=qkuCQ-NB", "publishedAt": "2021-04-29T06:47:00Z", "content": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively.\r\nBut when it comes to local stars breakin… [+2587 chars]"}, {"source": {"id": null, "name": "Scandasia.com"}, "author": "Mette Larsen", "title": "China's next moon probe will carry Swedish gear - ScandAsia.com", "description": "According to reports from the Xinhua News Agency, China will launch its next robot lunar lander in 2024, and it will carry equipment from Sweden as well as France, Russia, and Italy. The Chang’e landers are part of Chinese space exploration efforts and in Dec…", "url": "https://scandasia.com/chinas-next-moon-probe-will-carry-swedish-gear/", "urlToImage": "https://scandasia.com/wp-content/uploads/2021/04/image.jpg", "publishedAt": "2021-04-29T06:43:14Z", "content": "In this photo released by Xinhua News Agency, visitors view a simulated rocket launch on display at an exhibition featuring space science and achievement during the China Space Conference in Nanjing … [+1195 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I tried making 'toys' for my nephews with everyday trash — and I'll never waste money on store-bought ones again - AsiaOne", "description": "AsiaOne has launched EarthOne, a new section dedicated to environmental issues — because we love the planet and we believe science. Find articles like this there. Living with toddlers is an everyday struggle. A struggle of having your mobile phones, TV remote…", "url": "https://www.asiaone.com/lifestyle/i-tried-making-toys-my-nephews-everyday-trash-and-ill-never-waste-money-store-bought-ones", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/greenhome_recycling_1.jpg?h=0429cc9e&itok=GrCwh22V", "publishedAt": "2021-04-29T02:00:00Z", "content": "AsiaOne has launched EarthOne, a new section dedicated to environmental issues because we love the planet and we believe science. Find articles like this there.\r\nLiving with toddlers is an everyday s… [+4463 chars]"}, {"source": {"id": "mashable", "name": "Mashable"}, "author": "Tarvin Gill", "title": "HUAWEI's new TV is going to make family video calls a whole lot easier - Mashable SE Asia", "description": "It's pretty affordable too!", "url": "https://sea.mashable.com/tech/15505/huaweis-new-tv-is-going-to-make-family-video-calls-a-whole-lot-easier", "urlToImage": "https://sm.mashable.com/t/mashable_sea/photo/default/huawei-vision-s-meetime-video-call_agw6.1200.jpg", "publishedAt": "2021-04-28T06:16:22Z", "content": "Stay updated with the latest in Tech, Science, Culture, Entertainment, and more by following our Telegram channel here.\r\nHUAWEI has been hard at work building up their own ecosystem of products in th… [+2904 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Myanmar unity government tells ASEAN no talks until prisoners freed - CNA", "description": "Myanmar's pro-democracy unity government, which includes members of parliament ousted by the military coup, has told Southeast Asia's regional bloc that it will not engage in talks until the junta releases all political prisoners.", "url": "https://www.channelnewsasia.com/news/asia/myanmar-unity-government-asean-no-talks-until-prisoners-freed-14709566", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14270172/16x9/991/557/894b275feca1075d522dfb3e665b42e/kK/myanmar-prisoners-84518-jpg-1614144078.jpg", "publishedAt": "2021-04-28T05:18:07Z", "content": "Myanmar's pro-democracy unity government, which includes members of parliament ousted by the military coup, has told Southeast Asia's regional bloc that it will not engage in talks until the junta re… [+4139 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Astro, TM down on Disney's TV channels shutdown in Southeast Asia, Hong Kong - The Edge Markets MY", "description": "KUALA LUMPUR (April 28): Astro Malaysia Holdings Bhd and Telekom Malaysia Bhd (TM) were in the red in the morning trade today, following news that Disney will be shutting down most of its television channels in Southeast Asia and Hong Kong as part of the comp…", "url": "https://www.theedgemarkets.com/article/astro-tm-down-disneys-tv-channels-shutdown-southeast-asia-hong-kong", "urlToImage": "https://assets.theedgemarkets.com/Astro-Malaysia-2_astro.com_.my__13.jpg?UuApcLAQz5QvAimjIalwvlz0UwFfSASb", "publishedAt": "2021-04-28T03:05:46Z", "content": "KUALA LUMPUR (April 28): Astro Malaysia Holdings Bhd and Telekom Malaysia Bhd (TM) were in the red in the morning trade today, following news that Disney will be shutting down most of its television … [+3564 chars]"}]}