{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "This former ITE student once felt left behind by peers and now runs an award-winning design studio - Channel NewsAsia", "description": "In this instalment of Creative Capital, we meet founder and head of local design studio Trigger Design, Chan Wai Lim who overcame educational setbacks to rise in the local design industry, picking up multiple awards along the way.", "url": "https://cnalifestyle.channelnewsasia.com/living/creative-capital-trigger-design-chan-wai-lim-337871", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--35yulLCa--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/07/hero-chan-wai-lim-profile.jpg?itok=G4TyKdIX", "publishedAt": "2022-11-12T21:27:00Z", "content": "When I turned 40, I felt it was time. It was a natural path for me to start my own consultancy firm. \r\nWHAT WAS IT LIKE, RUNNING A BUSINESS FOR THE VERY FIRST TIME? WHAT ARE THE HARDEST THINGS ABOUT … [+2184 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": "Helen Flores", "title": "‘Cordial Philippine-China ties far outweigh differences’ - Philstar.com", "description": "China is looking forward to closer cooperation with the Philippines and other member-states of the Association of Southeast Asian Nations to attain peace and stability in the South China Sea, Chinese Premier Li Keqiang said yesterday.", "url": "https://www.philstar.com/headlines/2022/11/13/2223437/cordial-philippine-china-ties-far-outweigh-differences", "urlToImage": "https://media.philstar.com/photos/2022/11/12/scs_2022-11-12_22-01-05.jpg", "publishedAt": "2022-11-12T16:00:00Z", "content": "PHNOM PENH – China is looking forward to closer cooperation with the Philippines and other member-states of the Association of Southeast Asian Nations (ASEAN) to attain peace and stability in the Sou… [+2961 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Sports Desk", "title": "Shiva Thapa creates history with silver in Asian Boxing Championships - Hindustan Times", "description": "This was Thapa's third silver and sixth medal overall at the prestigious tournament, which makes him the most successful male pugilist in the championships' history. His previous two silver medals came in 2017 and 2021. He also clinched the title in the 2013 …", "url": "https://www.hindustantimes.com/sports/others/shiva-thapa-creates-history-with-silver-in-asian-boxing-championships-101668260131886.html", "urlToImage": "https://images.hindustantimes.com/img/2022/11/12/1600x900/Shiva_Thapa_1668260212763_1668260212899_1668260212899.jpeg", "publishedAt": "2022-11-12T13:39:08Z", "content": "Star Indian boxer Shiva Thapa capped off India's magnificent campaign by getting a historic silver medal as the country concluded the 2022 ASBC Asian Elite Boxing Championships with 12 medals in Amma… [+2077 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Biden says US-ASEAN pact to address 'biggest issues of our time' - CNA", "description": "PHNOM PENH: Southeast Asian heads of government held talks on Saturday (Nov 12) with visiting global leaders including US President Joe Biden, who hailed the launch of a new US-ASEAN pact as a c", "url": "https://www.channelnewsasia.com/world/us-asean-pact-joe-biden-indo-pacific-issues-summit-southeast-asia-3066711", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--jolV8fPn--/c_crop,h_576,w_1024,x_0,y_0/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/11/12/000_32nd6eb.jpg?itok=KTFZ7k1l", "publishedAt": "2022-11-12T13:28:09Z", "content": "PHNOM PENH: Southeast Asian heads of government held talks on Saturday (Nov 12) with visiting global leaders including US President Joe Biden, who hailed the launch of a new US-ASEAN pact as a critic… [+2048 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Egg white cervical mucus: How it can help you plan a pregnancy - AsiaOne", "description": "If you notice egg white discharge, chances are you are about to start ovulating. It is considered to be the most fertile cervical type of mucus and you can spot it as EWCM or egg white cervical mucus on most fertility charts. Now while you may notice differen…", "url": "https://www.asiaone.com/lifestyle/egg-white-cervical-mucus-how-it-can-help-you-plan-pregnancy", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221110_cervical_unsplash.jpg?h=0429cc9e&itok=nhGaNFAZ", "publishedAt": "2022-11-12T13:00:00Z", "content": "If you notice egg white discharge, chances are you are about to start ovulating. It is considered to be the most fertile cervical type of mucus and you can spot it as EWCM or egg white cervical mucus… [+13809 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "JAMIL SANTOS, GMA News", "title": "Marcos commends Australian support for Philippine work plan vs human trafficking - GMA News Online", "description": "President Ferdinand &quot;Bongbong&quot; Marcos Jr. on Saturday lauded Australia for supporting the Bohol Trafficking in Persons (TIP) work plan to enforce the Association of Southeast Asian Nations (ASEAN) Convention on Trafficking in Persons Especially Wome…", "url": "https://www.gmanetwork.com/news/topstories/nation/851230/marcos-commends-australian-support-for-philippine-work-plan-vs-human-trafficking/story/", "urlToImage": "https://images.gmanews.tv/webpics/2022/11/marcos_2022_11_11_17_38_48.JPG", "publishedAt": "2022-11-12T09:36:40Z", "content": "President Ferdinand \"Bongbong\" Marcos Jr. on Saturday lauded Australia for supporting the Bohol Trafficking in Persons (TIP) work plan to enforce the Association of Southeast Asian Nations (ASEAN) Co… [+2163 chars]"}, {"source": {"id": null, "name": "Sports Interactive Network Philippines"}, "author": null, "title": "Jericho Cruz shines as Guam beats HK in Fiba Asia Cup pre-qualifiers - Sports Interactive Network Philippines", "description": "Jericho Cruz leads Guam over Hong Kong to sweep first round of Fiba Asia Cup pre-qualifiers", "url": "https://www.spin.ph/basketball/fiba/jericho-cruz-leads-guam-over-hong-kong-to-sweep-first-round-of-fiba-asia-cup-pre-qualifiers-a795-20221112", "urlToImage": "http://contents.spin.ph/image/resize/image/2022/11/12/jericho-cruz-1668221569.webp", "publishedAt": "2022-11-12T03:37:06Z", "content": "JERICHO Cruz had 25 points, nine rebounds, five assists, and three steals as Guam defeated Hong Kong, 67-64, to sweep the group stage of the Fiba Asia Cup 2025 pre-qualifiers on Friday in Bengaluru, … [+456 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'You live for yourself': Phyllis Quek's take on life made her seem cold and distant to others - AsiaOne", "description": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view. On the latest episode of the Mediacorp talk show Hear U Out, Phyllis revealed that her neutral and muted response to others wasn't…", "url": "https://www.asiaone.com/entertainment/live-yourself-phyllis-queks-take-on-life-cold-distant-others-hear-u-out-quan-yi-fong", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/111122_phyllisquek_mediacorp.jpg?h=9e9626f5&itok=I2XhmKAE", "publishedAt": "2022-11-12T01:30:00Z", "content": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view.\r\nOn the latest episode of the Mediacorp talk show Hear U Out, Phyllis … [+2486 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Why is it so hard for mothers to break free of mum guilt? Listen to this CNA Women podcast - Channel NewsAsia", "description": "On the second episode of the Womankind podcast, hosts Penelope Chan and Hidayah Salamat discuss the issue with guest Yasmin Begum, founder of Away From Mum Guilt.", "url": "https://cnalifestyle.channelnewsasia.com/women/mum-guilt-cna-women-podcast-womankind-338131", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--cbt-j_KR--/c_crop,h_843,w_1500,x_0,y_52/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/10/15 - YasminBegum May2019-37.jpg?itok=9l9ghlj6", "publishedAt": "2022-11-11T22:52:00Z", "content": "In the second episode of CNA Women's podcast Womankind, hosts Penelope Chan and Hidayah Salamat, and Yasmin Begum, founder of support group Away From Mum Guilt, unpack the phenomenon of mum guilt. \r\n… [+242 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Southeast Asian Nations Play Crucial Role in Building Peaceful Societies, Global Economy, Secretary-General Tells Association's Summit - World - ReliefWeb", "description": "News and Press Release in English on World and 1 other country about Agriculture, Climate Change and Environment and more; published on 11 Nov 2022 by UN SG", "url": "https://reliefweb.int/report/world/southeast-asian-nations-play-crucial-role-building-peaceful-societies-global-economy-secretary-general-tells-associations-summit", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/default.png", "publishedAt": "2022-11-11T19:39:29Z", "content": "SG/SM/2158011 NOVEMBER 2022\r\nFollowing are UN Secretary-General António Guterres’ opening remarks to the twelfth Association of Southeast Asian Nations (ASEAN)-United Nations Summit, in Phnom Penh, t… [+5818 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Asia-Pacific workshop on surveillance, prevention and control of zoonotic influenza- Paro, Bhutan - World Health Organization", "description": "Zoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several Asian countries that have impacted public health, trade and economy in …", "url": "https://www.who.int/publications-detail-redirect/sea-whe-14", "urlToImage": "https://apps.who.int/iris/rest/bitstreams/1477933/retrieve", "publishedAt": "2022-11-11T05:30:09Z", "content": "Overview \r\nZoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several … [+1026 chars]"}]}