{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Sandip Das", "title": "Stock Market Today: Top 10 things to know before the market opens today - Moneycontrol", "description": "Stock Market News: Trends in the SGX Nifty indicate a gap-up opening for the broader index in India with a gain of 161 points on Monday on the back of rally in the US and Asian markets and upbeat macro fundamentals", "url": "https://www.moneycontrol.com/news/business/markets/stock-market-today-top-10-things-to-know-before-the-market-opens-today-146-9830601.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/Markets8-770x433.jpg", "publishedAt": "2023-01-09T01:48:15Z", "content": "The market is expected to open in the green as trends in the SGX Nifty indicate a gap-up opening for the broader index in India with a gain of 161 points.\r\nThe BSE Sensex tanked 453 points to 59,900 … [+5378 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Prince Harry says explosive book Spare is a bid to 'own my story' - Channel NewsAsia", "description": "In an interview with Britain’s ITV network, defended his decision to publish the memoir after 38 years of “spin and distortion” by others.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/prince-harry-spare-book-memoir-meghan-markle-345681", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--RV5aZLzy--/c_crop,h_1124,w_1999,x_1,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/09/ap23006653748693.jpg?itok=bklVSoN6", "publishedAt": "2023-01-09T00:18:00Z", "content": "In the book Harry blames his family's stiff-upper-lip ethos, saying he had \"learned too well the family maxim that crying is not an option.\" The Associated Press purchased a Spanish-language copy of … [+2392 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": "Neil", "title": "Foreign investors’ choice of Asian manufacturing base seen as critical for PHL export prospects - BusinessWorld Online", "description": "FOREIGN INVESTORS are in the process of reviewing the locations of their Asian manufacturing bases, and their decisions will be critical for developing the Philippine export sector, Trade Secretary Alfredo E. Pascual said. Mr. Pascual told reporters in chance…", "url": "https://www.bworldonline.com/economy/2023/01/08/497194/foreign-investors-choice-of-asian-manufacturing-base-seen-as-critical-for-phl-export-prospects/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/04/Anflo-ecozone-100919.jpg", "publishedAt": "2023-01-08T15:56:52Z", "content": "FOREIGN INVESTORS are in the process of reviewing the locations of their Asian manufacturing bases, and their decisions will be critical for developing the Philippine export sector, Trade Secretary A… [+2423 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "19-year-old student broadcasts heartbreak and single status on board MRT train - but 'none of it is true' - AsiaOne", "description": "Tinder and other dating apps too passe? How about shouting about it from the rooftops — or in this case, in an MRT train? 19-year-old Fahim posted a video to his TikTok account on Friday, which showed the student advertising his single status in a crowded MRT…", "url": "https://www.asiaone.com/singapore/19-year-old-student-broadcasts-heartbreak-and-single-status-board-mrt-train-none-it-true", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/broadcastmrt.jpeg?h=56c55c38&itok=9_iSCrzv", "publishedAt": "2023-01-08T05:30:00Z", "content": "Tinder and other dating apps too passe? How about shouting about it from the rooftops or in this case, in an MRT train?\r\n19-year-old Fahim posted a video to his TikTok account on Friday, which showed… [+2854 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Thailand brings back Covid entry rules for all international travellers - The Star Online", "description": "Thailand will reintroduce Covid-19 entry requirements for foreigners flying into the country from Monday (Jan 9), the nation’s transport minister said, as the South-East Asian nation prepares for an expected wave of tourists from China.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2023/01/08/thailand-brings-back-covid-entry-rules-for-all-international-travellers", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2023/01/08/1892783.jpg", "publishedAt": "2023-01-08T03:40:00Z", "content": "BANGKOK, Jan 8 (Bloomberg): Thailand will reintroduce Covid-19 entry requirements for foreigners flying into the country from Monday (Jan 9), the nations transport minister said, as the South-East As… [+1510 chars]"}]}