{"articles": [{"author": "Rachel Treisman", "content": "A man holds a sign at an Asian American anti-violence press conference on Tuesday, outside the building where a 65-year-old Asian woman was physically and verbally attacked in New York City. Police s… [+5434 chars]", "description": "Brandon Elliot, 38, was arrested Wednesday and faces charges including assault as a hate crime. Elliot is a lifetime parolee who was convicted of fatally stabbing his mother in 2002, when he was 19.", "publishedAt": "2021-03-31T13:27:00Z", "source": {"id": null, "name": "NPR"}, "title": "Suspect Arrested On Hate Crime Charges Over Attack On Asian Woman In Manhattan - NPR", "url": "https://www.npr.org/2021/03/31/983002295/suspect-arrested-on-hate-crime-charges-over-attack-on-asian-woman-in-manhattan", "urlToImage": "https://media.npr.org/assets/img/2021/03/31/gettyimages-1232028737_wide-ffa9fec6905565729ab2515475608e1e79165848.jpg?s=1400"}, {"author": "Michael R. Sisak", "content": "NEW YORK -- \r\nA parolee convicted of killing his mother nearly two decades ago was arrested on charges, including felony assault as a hate crime, in an attack on an Asian American woman in New York C… [+5583 chars]", "description": "A parolee convicted of killing his mother nearly two decades ago was arrested on charges, including felony assault as a hate crime, in an attack on an Asian American woman in New York City, police said early Wednesday.", "publishedAt": "2021-03-31T09:32:00Z", "source": {"id": null, "name": "Ctvnews.ca"}, "title": "NYPD makes arrest in hate crime assault on a 65-year-old Asian woman - CTV News", "url": "https://www.ctvnews.ca/world/suspect-in-attack-on-asian-american-woman-in-nyc-is-arrested-1.5369267", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5368503.1617132923!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg"}, {"author": null, "content": "China faced mounting pressure Wednesday over the investigation into the origins of Covid-19, after the WHO chief revived a theory it may have leaked from a Chinese lab and the United States led conce… [+3700 chars]", "description": "The Online Citizen Asia China under pressure after WHO chief revives lab leak theory Health", "publishedAt": "2021-03-31T07:07:56Z", "source": {"id": null, "name": "The Online Citizen"}, "title": "China under pressure after WHO chief revives lab leak theory - The Online Citizen Asia", "url": "https://www.theonlinecitizen.com/2021/03/31/china-under-pressure-after-who-chief-revives-lab-leak-theory/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/03/featured-image-coronavirus-wuhan-hospital.png"}, {"author": null, "content": "In the past, we had something called butt-dialling where you ended up accidentally calling someone.\r\nBut with the evolution of technology, butt-dialling no longer only results in accidental calls. So… [+1688 chars]", "description": "In the past, we had something called butt-dialling where you ended up accidentally calling someone. But with the evolution of technology, butt-dialling no longer only results in accidental calls. Sometimes people go live on their social media unintentionally,…", "publishedAt": "2021-03-31T03:59:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Oopsie! Over 800 fans tune in to Rebecca Lim's accidental livestream that featured (almost) nothing - AsiaOne", "url": "https://www.asiaone.com/entertainment/oopsie-over-800-fans-tune-rebecca-lims-accidental-livestream-featured-almost-nothing", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210331_rebecca.jpg?h=c9e0d402&itok=MEf6DDeB"}, {"author": null, "content": "NEW YORK: New York police were searching yesterday for a man who violently attacked an Asian-American woman as bystanders seemingly looked on without intervening, the latest incident of anti-Asian vi… [+2501 chars]", "description": "NEW YORK: New York police were searching yesterday for a man who violently attacked an Asian-American woman as bystanders seemingly looked on without ...", "publishedAt": "2021-03-30T23:55:00Z", "source": {"id": null, "name": "The Sun Daily"}, "title": "Video shows Asian-American woman attacked on New York street - The Sun Daily", "url": "https://www.thesundaily.my/world/video-shows-asian-american-woman-attacked-on-new-york-street-IE7475749", "urlToImage": "https://www.thesundaily.my/binrepository/480x320/0c35/480d250/none/11808/NQMK/sr_1558546_20210331081517.jpg"}, {"author": "Samy Magdy", "content": "Experts on Tuesday boarded a colossal container ship that had been stuck for nearly a week in the Suez Canal before it was freed as questions swirled about the grounding that had shaken the global sh… [+4390 chars]", "description": "Engineers were examining the engines of the ship hauling goods from Asia to Europe to determine when exactly it can sail to its destination in the Netherlands.", "publishedAt": "2021-03-30T06:18:23Z", "source": {"id": null, "name": "Global News"}, "title": "After ship finally freed from Suez Canal, probe begins on how grounding happened - Global News", "url": "https://globalnews.ca/news/7727900/suez-canal-ship-freed-probe/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/03/CP120795768.jpg?quality=85&strip=all&w=720&h=379&crop=1"}, {"author": null, "content": "The Left Democratic Front (LDF) will win 82 to 91 of the 140 Assembly constituencies in Kerala in the April election, predicts the C Voter pre-poll survey for Asianet News. The United Democratic Fron… [+2990 chars]", "description": "The Left Democratic Front (LDF) will win 82 to 91 of the 140 Assembly constituencies in Kerala in the April election, predicts the C Voter pre-poll survey for Asianet News. The United Democratic Front (UDF) will get 46 to 54 seats, the National Democratic All…", "publishedAt": "2021-03-30T03:17:38Z", "source": {"id": null, "name": "The News Minute"}, "title": "Asianet-C Fore survey predicts a comeback for LDF govt, BJP's tally to increase - The News Minute", "url": "https://www.thenewsminute.com/article/asianet-c-fore-survey-predicts-comeback-ldf-govt-bjps-tally-increase-146173", "urlToImage": "https://www.thenewsminute.com/sites/default/files/Pinarayi_Vijayan_campaign_1200.jpg"}], "message": "Successful api call", "number_of_news": 7, "status": 200, "topic": "asia"}