{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore to block visitors from most South Asian countries - The Star Online", "description": "SINGAPORE (Reuters) -     Singapore will block entry to visitors with recent travel history to Bangladesh, Nepal, Pakistan and Sri Lanka from May 2 due to sustained increases in COVID-19 cases in the region, its health ministry said on Friday.", "url": "https://www.thestar.com.my/news/world/2021/04/30/singapore-to-block-visitors-from-most-south-asian-countries", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/30/1133195.JPG", "publishedAt": "2021-04-30T11:12:00Z", "content": "SINGAPORE (Reuters) - Singapore will block entry to visitors with recent travel history to Bangladesh, Nepal, Pakistan and Sri Lanka from May 2 due to sustained increases in COVID-19 cases in the reg… [+267 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Australian Associated", "title": "Australia closes sneaky loophole that let travellers get back from India - Daily Mail", "description": "India's spiralling coronavirus catastrophe prompted Australia to pause all flights from the Asian nation until May 15, but travellers were able to make their way home through Doha.", "url": "https://www.dailymail.co.uk/news/article-9528061/Australia-closes-sneaky-loophole-let-travellers-India.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/30/03/42395590-0-image-a-56_1619750336615.jpg", "publishedAt": "2021-04-30T02:48:15Z", "content": "Australia has slammed shut a loophole that allowed travellers from India to dodge a flight ban through transiting in Qatar.\r\nIndia's spiralling coronavirus catastrophe prompted Australia to pause all… [+3318 chars]"}, {"source": {"id": null, "name": "Geek Culture"}, "author": "Zheng Yi", "title": "StarHub First In Southeast Asia To Launch NVIDIA GeForce NOW Cloud Gaming Service - Geek Culture", "description": "StarHub will be the first in Southeast Asia and the only operator in Singapore to launch NVIDIA GeForce Now Cloud Gaming Service.", "url": "https://geekculture.co/starhub-first-in-southeast-asia-to-launch-nvidia-geforce-now-cloud-gaming-service/", "urlToImage": "https://geekculture.co/wp-content/uploads/2021/04/Starhub-GeForce-Now.jpg", "publishedAt": "2021-04-30T01:30:19Z", "content": "Telecommunications company StarHub will be the first in Southeast Asia and the only local operator in Singapore to introduce cloud gaming service NVIDIA GeForce NOW, setting the stage for next-genera… [+2178 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Christopher Lee recalls the 1 incident that touched him when he stepped out of prison - AsiaOne", "description": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively. But when it comes to local stars breaking the law, the most dramatic incident has to be when Christop…", "url": "https://www.asiaone.com/entertainment/christopher-lee-recalls-1-incident-touched-him-when-he-stepped-out-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210429_chris.jpg?h=20f5ad32&itok=qkuCQ-NB", "publishedAt": "2021-04-29T06:47:00Z", "content": "Actors Terence Cao and Shane Pow recently created a stir when they were charged in court for breaking social distancing rules and drink driving respectively.\r\nBut when it comes to local stars breakin… [+2587 chars]"}]}