{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "", "title": "HNP: Pulse Asia lead a 'boost' for Sara Duterte presidential bid but other factors being considered - GMA News Online", "description": "&quot;Of course having a high rating is definitely a boost for any candidate including Mayor Sara. At the end of the day, she needs to make a decision based on other factors, not only the survey. There are other factors that come into a play when thinking of …", "url": "https://www.gmanetwork.com/news/news/nation/795349/hnp-pulse-asia-lead-a-boost-for-sara-duterte-presidential-bid-but-other-factors-being-considered/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/04/reeltime2_2021_04_22_23_28_39.jpg", "publishedAt": "2021-07-14T09:00:50Z", "content": "Davao City Mayor Sara Duterte's lead in the latest election survey of Pulse Asia may boost her possible presidential bid in Eleksyon 2022 but she will still consider other factors in running for the … [+2111 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "The New Razer Barracuda X Multi-Platform Wireless Gaming And Mobile Headset Is Set To Rule - AsiaOne", "description": "Designed with 4-in-1 Wireless USB-C Connectivity for PC, PlayStation, Nintendo Switch and Android Devices, the Barracuda X promises immersive home gaming and seamless on-the-go audio. CALIFORNIA, UNITED STATES - Media OutReach - 13 July 2021 - Razer™, the lea…", "url": "https://www.asiaone.com/business/new-razer-barracuda-x-multi-platform-wireless-gaming-and-mobile-headset-set-rule", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/Razer-1.jpg?itok=uTQvFew2", "publishedAt": "2021-07-13T15:00:00Z", "content": "Designed with 4-in-1 Wireless USB-C Connectivity for PC, PlayStation, Nintendo Switch and Android Devices, the Barracuda X promises immersive home gaming and seamless on-the-go audio. \r\nCALIFORNIA, U… [+6983 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "SG wants to live with Covid while Israel rethinks this strategy as death figure goes up - The Online Citizen Asia", "description": "The Online Citizen Asia SG wants to live with Covid while Israel rethinks this strategy as death figure goes up Current Affairs", "url": "https://www.theonlinecitizen.com/2021/07/13/sg-wants-to-live-with-covid-while-israel-rethinks-this-strategy-as-death-figure-goes-up/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/israel-vaccination.png", "publishedAt": "2021-07-13T11:03:45Z", "content": "Last month (24 Jun), ministers Gan Kim Yong, Lawrence Wong and Ong Ye Kung drew a new roadmap for Singaporeans to live with Covid-19. They want Singaporeans to deal with Covid-19 as part of their dai… [+2729 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Bukit Batok bus collision: Most of those hospitalised have been discharged, bus driver arrested - AsiaOne", "description": "SINGAPORE - Most of the drivers and passengers hospitalised with injuries from the Bukit Batok bus accident have been discharged, Tower Transit said on Monday (July 12). A 65-year-old male bus driver has been arrested for a rash act causing grievous hurt, pol…", "url": "https://www.asiaone.com/singapore/bukit-batok-bus-collision-most-those-hospitalised-have-been-discharged-bus-driver", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/20210713_buss_st.jpg?h=0429cc9e&itok=1-eSLOCc", "publishedAt": "2021-07-13T02:19:33Z", "content": "SINGAPORE - Most of the drivers and passengers hospitalised with injuries from the Bukit Batok bus accident have been discharged, Tower Transit said on Monday (July 12).\r\nA 65-year-old male bus drive… [+2311 chars]"}]}