{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Lim Hui Jie", "title": "Asia-Pacific markets fall as Israel-Iran tensions spike; spotlight on oil, gold and bitcoin - CNBC", "description": "Asian investors are keeping a close watch on how markets, especially oil and gold traders, will react to Iran's massive drone strikes on Israel over the weekend.", "url": "https://www.cnbc.com/2024/04/15/asia-markets-live-updates.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107400880-1713147052281-gettyimages-2087342668-JAPAN_TRADING_ROOM.jpeg?v=1713147065&w=1920&h=1080", "publishedAt": "2024-04-15T07:31:00Z", "content": "Employees work in the trading room inside the Mitsubishi UFJ Trust and Banking head office in Tokyo, Japan, on Tuesday, March 19, 2024.\r\nAsia-Pacific markets fell Monday as traders weighed the impact… [+1514 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Zhao Lei", "title": "Relay satellite ready for lunar mission service - Asia News NetworkAsia News Network - asianews.network", "description": "Queqiao 2, or Magpie Bridge 2, is ready to provide communication service to missions operating on the moon's far side, according to the China National Space Administration.", "url": "https://asianews.network/relay-satellite-ready-for-lunar-mission-service/", "urlToImage": "https://asianews.network/wp-content/uploads/2024/04/6619c67ea31082fc2b6c1153.png", "publishedAt": "2024-04-15T02:34:16Z", "content": "April 15, 2024\r\nBEIJING – China’s relay satellite Queqiao 2, or Magpie Bridge 2, is ready to provide communication service to missions operating on the moon’s far side, according to the China Nationa… [+3417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Israel-Iran Tensions Highlights: S Jaishankar Speaks To Iranian, Israeli Counterparts, Discusses West Asia Situation - NDTV", "description": "Israel-Iran Conflict Live Updates: Iran launched more than 300 drones and missiles at Israel in an unprecedented attack late Saturday, the Israeli army announced, in a major escalation of the long-running covert war between the regional foes.", "url": "https://www.ndtv.com/world-news/israel-iran-tensions-live-updates-israel-gaza-war-iran-says-launched-drones-missiles-at-israel-5436508", "urlToImage": "https://c.ndtvimg.com/2024-04/0nh1chto_israeliran_625x300_14_April_24.jpeg?ver-20240316.08", "publishedAt": "2024-04-14T23:36:07Z", "content": "Israel-Iran Conflict News LIVE: Iran launched more than 300 drones and missiles at Israel\r\nIsrael-Iran Conflict Highlights: External Affairs Minister S Jaishankar on Sunday said he spoke with his Ira… [+31636 chars]"}]}