{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I know I won't make it far in studies': Singaporean, who topped Valorant's global chart, on choosing esports over academics - AsiaOne", "description": "He may not be his school's number one academic, but he achieved number one in the world for a video game. Tyler Aeria hit the top rank on leaderboards in Valorant, but he shared with AsiaOne last Saturday (Aug 6) that his studies aren't doing too well. Althou…", "url": "https://www.asiaone.com/digital/i-know-i-wont-make-it-far-studies-singaporean-valorant-global-choosing-esports-juicy-tyler-aeria", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2022/9822_tylerjuicyaeria_twitter.jpg?h=0c9a684b&itok=fWadhpI6", "publishedAt": "2022-08-09T05:42:00Z", "content": "He may not be his school's number one academic, but he achieved number one in the world for a video game.\r\nTyler Aeria hit the top rank on leaderboards in Valorant, but he shared with AsiaOne last Sa… [+9381 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "7 best savings accounts in Singapore with the highest interest rates (2022) - AsiaOne", "description": "2021 was a pretty tough year on our finances. Not only did many of us suffer pay cuts and income losses, most of the high interest savings accounts in Singapore also got royally nerfed! Talk about adding insult to injury. You might’ve thought the end of the y…", "url": "https://www.asiaone.com/money/7-best-savings-accounts-singapore-highest-interest-rates-2022", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2022/20220808_saving_pexels.jpg?h=0429cc9e&itok=-_wVZzTz", "publishedAt": "2022-08-09T04:00:22Z", "content": "2021 was a pretty tough year on our finances. Not only did many of us suffer pay cuts and income losses, most of the high interest savings accounts in Singapore also got royally nerfed! Talk about ad… [+13709 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singaporean charged with wife's murder in UK tells court he does not remember killing her - The Star Online", "description": "NEWCASTLE, England (The Straits Times/Asia News Network): The 51-year-old Singaporean man accused of smothering his wife to death with a pillow accepts that he carried out the act but cannot remember doing it, a jury heard on Monday (Aug 8).", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/08/09/singaporean-charged-with-wife039s-murder-in-uk-tells-court-he-does-not-remember-killing-her", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/08/09/1690309.jpg", "publishedAt": "2022-08-09T02:47:00Z", "content": "NEWCASTLE, England (The Straits Times/Asia News Network): The 51-year-old Singaporean man accused of smothering his wife to death with a pillow accepts that he carried out the act but cannot remember… [+7233 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "On Singai Naadu's 10th anniversary, this is the untold story behind Shabir's love song to the nation - Channel NewsAsia", "description": "The Singaporean musician recalls the challenges of independently writing a National Day song back in 2012, including pumping all his money into the project and being down to his last S$50.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/shabir-singai-naadu-tenth-anniversary-singapore-325426", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--Q_ADaj7U--/c_crop,h_900,w_1600,x_0,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/08/06/whatsapp_image_2022-08-06_at_5.27.03_pm.jpeg?itok=7LRJ83FD", "publishedAt": "2022-08-08T22:40:00Z", "content": "Furthermore, I realised National Day songs are of a certain style. We (Indians) have to come with tabla and sitar. But, Indian culture is so rich. If I only use the erhu and guzheng every year to pre… [+1205 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Eleanor Lee on legal dispute with Glenn Yong: There were some disagreements but we cleared the air - AsiaOne", "description": "While many of us were getting into the holiday mood with National Day just around the corner, a legal disagreement between two local celebrities went almost unnoticed. It was reported by Mothership yesterday (Aug 7) that local actor Glenn Yong and China-based…", "url": "https://www.asiaone.com/entertainment/eleanor-lee-legal-dispute-glenn-yong-there-were-some-disagreements-we-cleared-air", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2022/glenn-eleanor_IG.jpg?h=e68e10b2&itok=zaEygkxN", "publishedAt": "2022-08-08T07:44:00Z", "content": "While many of us were getting into the holiday mood with National Day just around the corner, a legal disagreement between two local celebrities went almost unnoticed.\r\nIt was reported by Mothership … [+2875 chars]"}, {"source": {"id": null, "name": "Asiainsurancereview.com"}, "author": null, "title": "how to make money as a game streamer - Asia Insurance Review", "description": "how to get money fast in gta vc  ,things you can build at home to make money,what can you grow at home to make money", "url": "https://www.asiainsurancereview.com/make/KI3yE2jb.html", "urlToImage": null, "publishedAt": "2022-08-07T22:59:08Z", "content": "None, except what he states.\r\nkill the lobsterhe had no weapon. The lobster could kill the squidhe was heavily armed. There was nothing for the squid to feed onthe lobster had the squid as prey. What… [+3956 chars]"}, {"source": {"id": null, "name": "Asiainsurancereview.com"}, "author": null, "title": "how to make money as a non-profit record label - Asia Insurance Review", "description": "how to get money fast in asphalt 8 for beginners  ,fastest way to make a bunch of money,easy ways to make money real fast", "url": "https://www.asiainsurancereview.com/make/JAVk8Akh.html", "urlToImage": null, "publishedAt": "2022-08-07T21:51:51Z", "content": "Patricia laughed. He's not so retiring in private, she declared, gayly. He was one of our happy family for three months last summer and we never noticed any shyness; did we, Norn?\r\nThis vessel, of fo… [+7137 chars]"}, {"source": {"id": null, "name": "Asiainsurancereview.com"}, "author": null, "title": "how to make money in commercial real esate - Asia Insurance Review", "description": "how to get rich as a cop  ,3d artist make money online,how to make money online yahoo answers", "url": "https://www.asiainsurancereview.com/make/CMhXMlOy.html", "urlToImage": null, "publishedAt": "2022-08-07T17:11:33Z", "content": "Third right, fourth left, answered the assistant promptly, closing the door.\r\nA woman, even a prude, is never long embarrassed, however difficult may be the position in which she finds herselfshe see… [+7007 chars]"}]}