{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Carl Samson", "title": "Two Men Arrested After Punching Asian Couple at Ontario Mills Mall - Yahoo News", "description": "Two men were arrested in Ontario, CA for allegedly assaulting an Asian couple after a verbal altercation about social distancing.  The incident, which left...", "url": "https://news.yahoo.com/two-men-arrested-punching-asian-203532095.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/D_PK0__t.OhFOL_2326NoQ--~B/aD00MjU7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/nextshark_articles_509/b730459d756b604d184b429850f25ac1", "publishedAt": "2021-04-08T20:35:32Z", "content": "As fears of anti-Asian violence grow, police seek to be more visible to deter attacks. AP Photo/Kathy WillensAmid the disturbing rise in attacks on Asian Americans since March 2020 is a troubling cat… [+4539 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Oldest Modern Human Genome Reconstructed Using DNA From 45,000-Year-Old Skull - SciTechDaily", "description": "The fossil skull of a woman in Czechia has provided the oldest modern human genome yet reconstructed, representing a population that formed before the ancestors of present-day Europeans and Asians split apart. In an article published in Nature Ecology & Evolu…", "url": "https://scitechdaily.com/oldest-modern-human-genome-reconstructed-using-dna-from-45000-year-old-skull/", "urlToImage": "https://scitechdaily.com/images/Human-Skull-From-Zlaty-Kun.jpg", "publishedAt": "2021-04-08T20:26:41Z", "content": "This skull from Zlatý kůň cave near Prague belonged to the earliest known modern human in Europe. Credit: Marek Jantač\r\nThe fossil skull of a woman in Czechia has provided the oldest modern human gen… [+5554 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "CLOY's 2nd leads Kim Jung-hyun and Seo Ji-hye dating for 1 year, claims Korean media that outed Hyun Bin's romance - AsiaOne", "description": "For K-drama fans, Crash Landing On You (CLOY) is still one of the most special drama series in their hearts for its sheer romanticism and almost unbelievable plots. And now, the magic of CLOY continues with claims of a second couple to emerge from it. Earlier…", "url": "https://www.asiaone.com/entertainment/cloys-2nd-leads-kim-jung-hyun-and-seo-ji-hye-dating-1-year-claims-korean-media-who", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210408_cloy_0.jpg?h=d6bdad78&itok=WDZcYpQE", "publishedAt": "2021-04-08T06:48:00Z", "content": "For K-drama fans, Crash Landing On You (CLOY) is still one of the most special drama series in their hearts for its sheer romanticism and almost unbelievable plots.\r\nAnd now, the magic of CLOY contin… [+2046 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Clear link between AstraZeneca vaccine and rare blood clots in brain, shares European Medicines Agency - AsiaOne", "description": "ROME - There is a link between AstraZeneca’s Covid-19 vaccine and very rare blood clots in the brain but the possible causes are still unknown, a senior official for the European Medicines Agency (EMA) said in an interview published on Tuesday (April 6). Howe…", "url": "https://www.asiaone.com/world/clear-link-between-astrazeneca-vaccine-and-rare-blood-clots-brain-ema-official-tells-paper", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210407_astrazenecavaccine_reuters.jpg?h=0429cc9e&itok=hIyvuV5J", "publishedAt": "2021-04-07T01:42:00Z", "content": "ROME - There is a link between AstraZenecas Covid-19 vaccine and very rare blood clots in the brain but the possible causes are still unknown, a senior official for the European Medicines Agency (EMA… [+3306 chars]"}]}