{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "Reuters", "title": "NASA instrument detects dozens of methane super-emitters from space - India Today", "description": "NASA said a device called an imaging spectrometer had identified more than 50 methane \"super-emitters\" in Central Asia, the Middle East and the Southwestern United States since it was installed aboard the International Space Station in July.", "url": "https://www.indiatoday.in/science/story/nasa-detects-dozens-of-methane-super-mitter-international-space-station-2289474-2022-10-26", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202210/nasa_0-sixteen_nine.jpeg?VersionId=es0UrZaiZLzipTVI_9I2eOzyZn7GIs4s", "publishedAt": "2022-10-26T02:33:45Z", "content": "By Reuters: \r\nAn orbital NASA instrument designed mainly to advance studies of airborne dust and its effects on climate change has proven adept at another key Earth-science function - detecting large… [+3199 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Former Thai idol and Jimmy Lin lookalike Tae weds air stewardess in second marriage - AsiaOne", "description": "Former Thai actor Tae has remarried and shared his moment of joy on social media. The 40-year-old, whose real name is Sattawat Sethakorn, posted photos of his wedding on his Weibo account yesterday (Oct 24). This is his second marriage after he parted ways wi…", "url": "https://www.asiaone.com/entertainment/former-thai-idol-jimmy-lin-lookalike-tae-sattawat-sethakorn-weds-air-stewardess-second-marriage", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/251022_taewed_weibo.jpg?h=38892d92&itok=bA03XEpk", "publishedAt": "2022-10-25T05:22:00Z", "content": "Former Thai actor Tae has remarried and shared his moment of joy on social media.\r\nThe 40-year-old, whose real name is Sattawat Sethakorn, posted photos of his wedding on his Weibo account yesterday … [+2072 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I asked who he was secretly sending messages to': Jayley Woo on how fiancé proposed and why they choose this ROM date - AsiaOne", "description": "She’s about to get her happily ever after. Local actress Jayley Woo has shared more details about her fiancé and his wedding proposal following her Instagram post on Oct 23 announcing the double whammy of both an engagement and pregnancy. Speaking with host J…", "url": "https://www.asiaone.com/entertainment/who-he-was-secretly-sending-messages-jayley-woo-marriage-how-fiance-proposed-why-choose-rom-day", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/221025_jayley.png?h=f01c4b09&itok=M8_UFkkD", "publishedAt": "2022-10-25T03:31:00Z", "content": "Shes about to get her happily ever after. \r\nLocal actress Jayley Woo has shared more details about her fiancé and his wedding proposal following her Instagram post on Oct 23 announcing the double wha… [+2553 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Pandemic business Jelebu Dry Laksa opens in VivoCity, fulfilling home chef's dream - Channel NewsAsia", "description": "Renee Tang Eyrn left a stable office job to start from scratch as a chef, craving the adrenaline of the kitchen. She started a home-based business that’s now embarking on a new life as a full-fledged restaurant.", "url": "https://cnalifestyle.channelnewsasia.com/dining/jelebu-dry-laksa-vivo-city-restaurant-chef-renee-tang-336256", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--sZrVqzKN--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/10/19/jelebu_renee.jpg?itok=Z0keYtCW", "publishedAt": "2022-10-24T23:11:49Z", "content": "And, when her family came to Jelebu Dry Laksas grand opening, they said they were proud of me. I hardly hear such statements from my mum. She added, I think I've managed to prove to my family that wh… [+734 chars]"}]}