{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "How to manage difficult behaviours in the elderly - AsiaOne", "description": "As we journey along life, we inevitably also watch the people around us age. Our loved ones may start to display changes in their everyday behaviour, and we may find them to act like a completely different person - sometimes, even in a manner we find difficul…", "url": "https://www.asiaone.com/lifestyle/how-manage-difficult-behaviours-elderly", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/270522_Elderly_Pexels.jpg?h=800a4b5c&itok=uFp-6Y6W", "publishedAt": "2022-05-29T11:30:00Z", "content": "As we journey along life, we inevitably also watch the people around us age. Our loved ones may start to display changes in their everyday behaviour, and we may find them to act like a completely dif… [+12020 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "EMUI 12 RoadMap Asia Pacific: Eligible Devices and Rollout Dates - HC Newsroom", "description": "Huawei’s EMUI 12 is based on Android and inspired by HarmonyOS software, which means that it is the most advanced version in the EMUI series. However, the Chinese tech maker has introduced this software version for global Huawei device users. The initial EMUI…", "url": "https://www.huaweicentral.com/emui-12-roadmap-asia-pacific-eligible-devices-and-rollout-dates-3/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/03/EMUI-12-roadmap-asia-pacific-1000x576.jpg", "publishedAt": "2022-05-29T07:35:56Z", "content": "HuaweiEMUI 12 rollout is going in the global market at high speed for eligible devices. It brings a user experience similar to HarmonyOS on EMUI devices. Huawei has dispatched the EMUI 12 rollout roa… [+1774 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "David Lee (The Straits Times)", "title": "'Age is but a number' says Singapore's football legend Fandi Ahmad, once Asia's shooting star, as he turns 60 on Sunday (May 29) - The Star Online", "description": "So fast? Once, this was a description about his pace that helped him gain a yard of space to score hundreds of goals. On Sunday (May 29), it is about how time flies as local football legend Fandi Ahmad turns 60.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/05/29/039age-is-but-a-number039-says-singapore039s-football-legend-fandi-ahmad-once-asia039s-shoting-star-as-he-turns-60-on-sunday-may-29", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/05/29/1602540.jpg", "publishedAt": "2022-05-29T02:12:00Z", "content": null}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Jury's duty in Johnny Depp-Amber Heard trial doesn't track public debate - Channel NewsAsia", "description": "Depp has denied any physical or sexual abuse, and says Heard concocted the claims to destroy his reputation. Depp's legions of online fans have focused on their belief that Heard has been untruthful, and that will determine the outcome.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/johnny-depp-amber-heard-libel-suit-313236", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--UvyEQ-D9--/c_crop,h_576,w_1024,x_0,y_11/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/29/ap22147718463083.jpg?itok=n4Q5dwb0", "publishedAt": "2022-05-28T22:31:27Z", "content": "A seven-person civil jury in Virginia will resume deliberations Tuesday in Johnny Depp's libel trial against Amber Heard. What the jury considers will be very different from the public debate that ha… [+4693 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "South Korea wins big at Cannes Film Festival with Best Actor, Best Director awards - Channel NewsAsia", "description": "Star film-maker Park Chan-wook clinched the best director award for his erotic crime movie Decision To Leave while Song Kang-ho, best known for his role in the Oscar-winning Parasite, picked up the best actor gong for Broker.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/cannes-film-festival-south-korea-win-313231", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--BIglh2lU--/c_crop,h_576,w_1024,x_0,y_100/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/29/000_32bf8gn.jpg?itok=qaJiVC44", "publishedAt": "2022-05-28T22:16:00Z", "content": "The South Korean cinema industry added to a global winning streak on Saturday (May 28) by scooping two key prizes at the Cannes Film Festival for a pair of beloved veterans.\r\nStar film-maker Park Cha… [+3212 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "In her 40s, she walked away from a successful banking career to pursue her passion as a jazz musician - Channel NewsAsia", "description": "In this week's instalment of Creative Capital, we spotlight 47-year-old Cheryl Ann Spencer left the world of banking to study jazz. Graduating during the pandemic, she put together Evolution Quartet and released the group’s first album, Pandemic Blues.", "url": "https://cnalifestyle.channelnewsasia.com/living/creative-capital-cheryl-ann-spencer-jazz-evolution-quartet-pandemic-blues-312811", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--PosDA-sP--/c_crop,h_738,w_1312,x_10,y_761/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/23/hero-cc-cheryl-ann-spencer.png?itok=zPs5jLeQ", "publishedAt": "2022-05-28T21:57:15Z", "content": "I KNOW YOU DID A GIG IN FEBRUARY. IS THE QUARTET PERFORMING MORE THIS YEAR?  \r\nYes! We had a sold-out concert and we will perform again at the Esplanade Recital Hall in September. We are also perform… [+1775 chars]"}, {"source": {"id": null, "name": "Thelinkpaper.ca"}, "author": null, "title": "BC Cancer launches lung-screening program - South Asian Link", "description": "VANCOUVER – BC Cancer has launched a provincewide lung cancer screening program, providing access to eligible high-risk people at 36 sites throughout the province. The Lung Screening Program expects to start screening close to 10,000 patients in the first yea…", "url": "https://thelinkpaper.ca/bc-cancer-launches-lung-screening-program/", "urlToImage": null, "publishedAt": "2022-05-28T09:07:37Z", "content": "VANCOUVER – BC Cancer has launched a provincewide lung cancer screening program, providing access to eligible high-risk people at 36 sites throughout the province.\r\nThe Lung Screening Program expects… [+1627 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Just buy a dishwashing machine? $3500 monthly salary for dishwasher sparks online debate - AsiaOne", "description": "When some food and beverage operators in Singapore are unable to find willing candidates to work as dishwashers, going automatic might seem to be the best solution for their troubles. But not every form of manual labour can be done with machines. On Thursday …", "url": "https://www.asiaone.com/singapore/just-buy-dishwashing-machine-3500-monthly-salary-dishwasher-sparks-online-debate", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/immdishwashing_mti.jpg?h=0429cc9e&itok=T4B0Rf_8", "publishedAt": "2022-05-28T00:00:00Z", "content": "When some food and beverage operators in Singapore are unable to find willing candidates to work as dishwashers, going automatic might seem to be the best solution for their troubles.\r\nBut not every … [+2214 chars]"}]}