{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "RICHA NORIEGA, GMA News", "title": "Duterte to attend ASEAN-China Special Summit following Ayungin incident - GMA News Online", "description": "Malaca&ntilde;ang announced Saturday that President Rodrigo Duterte would attend a virtual meeting of Southeast Asian leaders and Chinese President Xi Jinping on November 22.", "url": "https://www.gmanetwork.com/news/topstories/nation/811684/duterte-to-attend-asean-china-special-summit-following-ayungin-incident/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/11/RB3_2021_11_20_22_14_29.jpg", "publishedAt": "2021-11-20T14:33:59Z", "content": "Malacañang announced Saturday that President Rodrigo Duterte would attend a virtual meeting of Southeast Asian leaders and Chinese President Xi Jinping on November 22.\r\n “Upon the invitation of Presi… [+1841 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "AirAsia to operate VTL flights to Changi Airport from Nov 29 - Malay Mail", "description": "KUALA LUMPUR, Nov 20 ― To kickstart the resumption of the Vaccinated Travel Lane (VTL) between Malaysia and Singapore, AirAsia will operate a seven times weekly flight schedule from Kuala Lumpur International Airport 2 (KLIA2) and Changi Airport beginning Nov…", "url": "https://www.malaymail.com/news/malaysia/2021/11/20/airasia-to-operate-vtl-flights-to-changi-airport-from-nov-29/2022340", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2014-06/20140609-air-asia-india-plane-seo.jpg", "publishedAt": "2021-11-20T06:04:40Z", "content": "AirAsia Malaysia chief executive officer Riad Asmat said the resumption of travel to Singapore signifies great progress of international travel in the region. AFP pic\r\nKUALA LUMPUR, Nov 20 To kicksta… [+1428 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Airphysio Portable Mucus Removal Device For Atelectasis Symptom Relief Launched - AsiaOne", "description": "When diagnosed with an acute respiratory condition, even simple everyday tasks can be challenging. Life Wellness Healthcare has announced a non-invasive solution that can help people with lung diseases improve their quality of life. Tweed Heads, Australia - N…", "url": "https://www.asiaone.com/business/airphysio-portable-mucus-removal-device-atelectasis-symptom-relief-launched", "urlToImage": null, "publishedAt": "2021-11-19T07:00:00Z", "content": "When diagnosed with an acute respiratory condition, even simple everyday tasks can be challenging. Life Wellness Healthcare has announced a non-invasive solution that can help people with lung diseas… [+2712 chars]"}]}