{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": "Lian Buan", "title": "Rule of law under Duterte drops 51 places in 6 years, among Asia's worst - Rappler", "description": "The Philippines is now ranked 102 out of 139 countries in terms of rule of law, and 13th of 15 in East Asia and Asia Pacific", "url": "https://www.rappler.com/nation/philippines-ranking-rule-of-law-index-2021", "urlToImage": "https://assets2.rappler.com/2021/10/duterte-rule-of-law-1634198208028.jpg", "publishedAt": "2021-10-14T14:11:00Z", "content": "\"In a year dominated by the global COVID-19 pandemic, 74.2% of countries covered experienced declines in rule of law performance, while 25.8% improved. The 74.2% of countries that experienced decline… [+106 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I will do better': NOC's Sylvia Chan and other local influencer scandals that had netizens shook - AsiaOne", "description": "Over the years, we've seen more and more influencers appear in the online sphere, sharing many aspects of their lives — from their favourite products, snippets of their daily lives to their struggles with mental health. Many social media users flock to these …", "url": "https://www.asiaone.com/singapore/i-will-do-better-noc-sylvia-chan-influencer-scandals-netizens-shook-dee-kosh-xinde-royce-aloysius", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/141021_Sylvia%20and%20Royce_IG_0.jpg?h=df2fab92&itok=uGworh1i", "publishedAt": "2021-10-14T11:25:00Z", "content": "Over the years, we've seen more and more influencers appear in the online sphere, sharing many aspects of their lives  from their favourite products, snippets of their daily lives to their struggles … [+4508 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "Fintech booms in Asia Pacific amid pandemic: study - pna.gov.ph", "description": "MANILA &ndash; A recent study by a cybersecurity firm showed that financial technology (fintech) has been on the rise in the Asia Pacific (APAC) region amid the coronavirus disease 2019 (Covid-19) pandemic. \"The pandemic accelerated the use of digital wallets…", "url": "https://www.pna.gov.ph/articles/1156706", "urlToImage": "https://files01.pna.gov.ph/ograph/2021/10/14/img20211014130859.jpg", "publishedAt": "2021-10-14T11:24:59Z", "content": "(Image taken from webinar on Thursday, Oct. 14, 2021)\r\nMANILA – A recent study by a cybersecurity firm showed that financial technology (fintech) has been on the rise in the Asia Pacific (APAC) regio… [+3041 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Hyris Brings to Market Worldwide a New Test That Can Quickly Detect the Body's T-Cell Immune Response to SARS-CoV-2, Thanks to a Partnership With Singapore's Duke-NUS Medical - AsiaOne", "description": "Hyris Brings to Market Worldwide a New Test That Can Quickly Detect the Body's T-Cell Immune Response to SARS-CoV-2, Thanks to a Partnership With Singapore's Duke-NUS Medical\n Hyris developed a rapid T-cell test to track patients' immunity levels to SARS-CoV-…", "url": "https://www.asiaone.com/business/hyris-brings-market-worldwide-new-test-can-quickly-detect-bodys-t-cell-immune-response", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/Intrado-GlobeNewswire-color-large-1200-800_4_351.jpg?itok=xANmC9Be", "publishedAt": "2021-10-14T08:00:00Z", "content": "LONDON, Oct. 14, 2021 (GLOBE NEWSWIRE) -- After almost two years of fight against COVID-19, governments, NGOs, and corporations are now focusing on strategies and solutions to boost population immuni… [+3155 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'3 checks in 10 minutes': Some confusion at hawker centres, coffee shops as stricter Covid-19 rules begin - AsiaOne", "description": "SINGAPORE - New rules forbidding unvaccinated people from dining in at hawker centres and coffee shops that kicked in on Wednesday (Oct 13) have left some confused. When The Straits Times visited several places, there were checks conducted at some but not oth…", "url": "https://www.asiaone.com/singapore/3-checks-10-minutes-some-confusion-hawker-centres-coffee-shops-stricter-covid-19-rules", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/20211013_hawker_st.jpg?h=0429cc9e&itok=25DmgEbs", "publishedAt": "2021-10-13T09:01:41Z", "content": "SINGAPORE - New rules forbidding unvaccinated people from dining in at hawker centres and coffee shops that kicked in on Wednesday (Oct 13) have left some confused.\r\nWhen The Straits Times visited se… [+5412 chars]"}]}