{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "Indonesia dethrones Gilas Pilipinas in SEA Games - pna.gov.ph", "description": "HANOI – Tokyo Olympics bronze winner Eumir Marcial mauled his unheralded Timor Leste opponent to lead a final-day, four-gold medal haul that somehow lost luster after Gilas Pilipinas failed in its mission on Sunday in the 31st Southeast Asian Games here.Showi…", "url": "https://www.pna.gov.ph/articles/1175067", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/05/22/seag-thirdy-ravena.jpg", "publishedAt": "2022-05-22T13:22:00Z", "content": "HEARTBREAKING LOSS. Thirdy Ravena tries to elude Indonesia’s swarming defense as the Gilas Pilipinas failed to defend its gold medal after a heart-breaking 81-85 loss to gritty Indonesian squad at th… [+5603 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak", "title": "Biden offers message for Kim Jong Un as he wraps first leg of his Asia trip - CNN", "description": "Before President Joe Biden concluded a visit to South Korea on Sunday, he offered a brief message to the nuclear-armed dictator to the north, who US officials believe could be preparing for a provocation during the US leader's visit to Asia.", "url": "https://www.cnn.com/2022/05/21/politics/joe-biden-south-korea-japan-sunday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220521012146-04-biden-asia-052122.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-22T10:27:00Z", "content": "Before President Joe Biden concluded a visit to South Korea on Sunday, he offered a brief message to the nuclear-armed dictator to the north, who US officials believe could be preparing for a provoca… [+5755 chars]"}, {"source": {"id": null, "name": "Vietnamplus.vn"}, "author": "VNA", "title": "Vietnam triumph in SEA Games 31 three-cushion carom - http://en.vietnamplus.vn/", "description": "Tran Quyet Chien proved why he’s the world No. 3 in three-cushion carom after beating Nguyen Duc Anh Chien in an all-Vietnamese final of the ongoing 31st Southeast Asian Games (SEA Games 31) on May 22.", "url": "https://en.vietnamplus.vn/vietnam-triumph-in-sea-games-31-threecushion-carom/229006.vnp", "urlToImage": null, "publishedAt": "2022-05-22T10:00:00Z", "content": "Hanoi (VNS/VNA) Tran Quyet Chien proved why hes the world No. 3 in three-cushion\r\ncarom after beating Nguyen Duc Anh Chien in an all-Vietnamese final of the\r\nongoing 31st Southeast Asian Games (SEA G… [+1633 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "Cannes 2022: Japanese film explores the chilling idea of elderly euthanasia - WION", "description": "Close to 30 percent of Japans population is over 65, the majority women, and that rate is expected to continue rising in the coming decades.", "url": "https://www.wionews.com/entertainment/cannes-2022-japanese-film-explores-the-chilling-idea-of-elderly-euthanasia-481160", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/22/264230-japans-film-at-cannes.jpg", "publishedAt": "2022-05-22T08:45:49Z", "content": "A Japanese filmmaker is shaking Cannes film audiences to the core with a dystopian vision of her country in which old people agree to be euthanised to solve the challenge of a rapidly ageing populati… [+3344 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Cannes Film Festival 2022: Three Thousand Years of Longing premieres - Channel NewsAsia", "description": "Three Thousand Years of Longing is based on the book The Djinn in the Nightingale’s Eye – Tilda Swinton plays a narratologist named Alithea Binnie who is visiting Turkey for a conference on how science has replaced mythology, and Idris Elba plays a wish-grant…", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/3000-years-longing-mad-max-george-miller-312766", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--4LRMJ_Kk--/c_crop,h_843,w_1500,x_0,y_111/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/22/3000_years_cast_cannes.jpg?itok=T_4ZYsli", "publishedAt": "2022-05-22T01:40:00Z", "content": "In it, Swinton plays a narratologist named Alithea Binnie who is visiting Turkey for a conference on how science has replaced mythology.\r\nAfter Alithea buys an old bottle at the Grand Bazaar and scru… [+1115 chars]"}]}