{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Mark Giongco", "title": "SEA Games: Irish Magno’s gold search continues with boxing silver - INQUIRER.net", "description": "MANILA, Philippines—Irish Magno’s quest for the gold continues after she lost to a familiar foe in the women’s flyweight final at the 31st Southeast Asian Games in Vietnam on Sunday.\r\n\r\nFor", "url": "https://www.inquirer.net", "urlToImage": "https://sports.inquirer.net/files/2021/07/1-Sports169686-scaled.jpg", "publishedAt": "2022-05-22T10:41:00Z", "content": "Subscribe to INQUIRER PLUS to get access to The Philippine Daily Inquirer &amp; other 70+ titles, share up to 5 gadgets, listen to the news, download as early as 4am &amp; share articles on social me… [+18 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak", "title": "Biden offers message for Kim Jong Un as he wraps first leg of his Asia trip - CNN", "description": "Before President Joe Biden concluded a visit to South Korea on Sunday, he offered a brief message to the nuclear-armed dictator to the north, who US officials believe could be preparing for a provocation during the US leader's visit to Asia.", "url": "https://www.cnn.com/2022/05/21/politics/joe-biden-south-korea-japan-sunday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220521012146-04-biden-asia-052122.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-22T10:27:00Z", "content": "Before President Joe Biden concluded a visit to South Korea on Sunday, he offered a brief message to the nuclear-armed dictator to the north, who US officials believe could be preparing for a provoca… [+5755 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Cannes Film Festival 2022: Three Thousand Years of Longing premieres - Channel NewsAsia", "description": "Three Thousand Years of Longing is based on the book The Djinn in the Nightingale’s Eye – Tilda Swinton plays a narratologist named Alithea Binnie who is visiting Turkey for a conference on how science has replaced mythology, and Idris Elba plays a wish-grant…", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/3000-years-longing-mad-max-george-miller-312766", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--4LRMJ_Kk--/c_crop,h_843,w_1500,x_0,y_111/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/22/3000_years_cast_cannes.jpg?itok=T_4ZYsli", "publishedAt": "2022-05-22T01:40:00Z", "content": "In it, Swinton plays a narratologist named Alithea Binnie who is visiting Turkey for a conference on how science has replaced mythology.\r\nAfter Alithea buys an old bottle at the Grand Bazaar and scru… [+1115 chars]"}]}