{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Teen leaves 500m-long blood trail in Toa Payoh knife attack - AsiaOne", "description": "A horrifying bloody scene greeted residents of 60A Lorong 4 Toa Payoh on Thursday night (April 29) after a male teenager was injured in a knife attack. A blood trail, roughly 500 metres long, stretched from the ground floor lift landing of the nearby multi-st…", "url": "https://www.asiaone.com/singapore/teen-leaves-500m-long-blood-trail-toa-payoh-knife-attack", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210430_bloody.jpg?h=2e181f1f&itok=ZZA1BS8i", "publishedAt": "2021-05-01T01:50:32Z", "content": "A horrifying bloody scene greeted residents of 60A Lorong 4 Toa Payoh on Thursday night (April 29) after a male teenager was injured in a knife attack.\r\nA blood trail, roughly 500 metres long, stretc… [+1771 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "Filipino boy band nominated in Billboard Music Awards – The Manila Times - The Manila Times", "description": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music competition. The group made it to the Top Social Artist category, …", "url": "https://www.manilatimes.net/2021/05/01/news/national/filipino-boy-band-nominated-in-billboard-music-awards/869023/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/04/boy-band.jpg", "publishedAt": "2021-04-30T16:17:59Z", "content": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music compet… [+2375 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Elvin Ng reveals what happened in the 'bullying' incident between him and Angel Lim - AsiaOne", "description": "Just when we thought the alleged bullying incident between Mediacorp hunk Elvin Ng and young actress Angel Lim was settled and dust in the wind, we now find it blowing right back to our face. If you haven't been keeping up with the brouhaha, here's a brief re…", "url": "https://www.asiaone.com/entertainment/elvin-ng-reveals-what-happened-bullying-incident-actress-angel-lim-dasmond-koh", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210430_elvin1.jpg?h=f74d8d50&itok=PiT4N1AR", "publishedAt": "2021-04-30T05:53:00Z", "content": "Just when we thought the alleged bullying incident between Mediacorp hunk Elvin Ng and young actress Angel Lim was settled and dust in the wind, we now find it blowing right back to our face.\r\nIf you… [+2457 chars]"}]}