{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": "Delfin Dioquino", "title": "E-Gilas back in action for FIBA Esports Open III - Rappler", "description": "E-Gilas Pilipinas, the Southeast Asia champion of the inaugural FIBA Esports Open, looks to repeat its winning ways over 5 other teams", "url": "https://www.rappler.com/sports/fiba/e-gilas-back-action-fiba-esports-open-2021", "urlToImage": "https://assets2.rappler.com/2020/11/e-gilas-pilipinas-fiba-esports-november-15-2020-1618385694370.jpg", "publishedAt": "2021-04-14T08:28:00Z", "content": "The Filipino crew is also comprised of Philippe Herrero IV, Aljon Cruzin, Custer Galas, Ian Santiago, Arnie Sison, and Clark Banzon."}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Baby can't wait: Woman delivers child while working from home - AsiaOne", "description": "Time and tide wait for no one, and neither does the baby. Just after a woman hit send on a work email, her water broke. The 35-year-old civil servant, who had been working from home, ambled to the toilet to discover her unborn child's head had partially emerg…", "url": "https://www.asiaone.com/singapore/baby-cant-wait-woman-delivers-child-while-working-home", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210414_baby.jpg?h=f5b126d1&itok=pjBv_kF_", "publishedAt": "2021-04-14T07:50:00Z", "content": "Time and tide wait for no one, and neither does the baby.\r\nJust after a woman hit send on a work email, her water broke. The 35-year-old civil servant, who had been working from home, ambled to the t… [+2532 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PSP's new chief criticises lack of contingency planning in PAP's leadership transition process - The Online Citizen Asia", "description": "The Online Citizen Asia PSP’s new chief criticises lack of contingency planning in PAP’s leadership transition process Politics", "url": "https://www.theonlinecitizen.com/2021/04/14/psps-new-chief-criticises-lack-of-contingency-planning-in-paps-leadership-transition-process/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/psp-francis.jpg", "publishedAt": "2021-04-14T06:06:58Z", "content": "The newly elected secretary-general of the Progress Singapore Party (PSP), Francis Yuen took to Facebook on Tuesday (13 Apr) to criticise the lack of contingency planning in the Peoples Action Partys… [+1630 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Public member wrote to ST expressing concerns over number of imported COVID-19 cases - The Online Citizen Asia", "description": "The Online Citizen Asia Public member wrote to ST expressing concerns over number of imported COVID-19 cases Current Affairs", "url": "https://www.theonlinecitizen.com/2021/04/14/public-member-wrote-to-st-expressing-concerns-over-number-of-imported-covid-19-cases/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/01/India-Covid.jpg", "publishedAt": "2021-04-14T05:57:49Z", "content": "A member of the public, Peter Khaw, wrote to Straits Times Forum expressing his worries over the number of imported COVID-19 cases into Singapore everyday. His letter was published today (‘Forum: Dai… [+1778 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "India-Pakistan tension may escalate, full-scale war possible, warns US intel report - Zee News", "description": "India and Pakistan may get engaged into a large-scale war that neither side wants, a US intelligence report has warned while exploring the possibilities of miscalculations leading to a war in South Asia.", "url": "https://zeenews.india.com/india/india-pakistan-tension-may-escalate-full-scale-war-possible-warns-us-intel-report-2354788.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/04/14/929561-india-china-iaf-chinool.gif", "publishedAt": "2021-04-14T05:22:14Z", "content": "Washington: India and Pakistan may get engaged into a large-scale war that neither side wants, a US intelligence report has warned while exploring the possibilities of miscalculations leading to a wa… [+2775 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "International travel may resume in 2nd half of 2021. What should you expect? - AsiaOne", "description": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore — with a few conditions. When Singapore first announced its blanket advisory against overseas travel back in March 2020, the …", "url": "https://www.asiaone.com/lifestyle/international-travel-may-resume-2nd-half-2021-what-should-you-expect", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210414_travellers_st.jpg?h=0429cc9e&itok=48IkeWsH", "publishedAt": "2021-04-14T03:13:47Z", "content": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore with a few conditions.\r\nWhen Singapore first announced its blanke… [+7562 chars]"}, {"source": {"id": null, "name": "SoyaCincau.com"}, "author": "https://www.facebook.com/alexwnl", "title": "Fave acquired by Pine Labs for RM185 mil, will launch in India this year - SoyaCincau.com", "description": "With the acquisition, Pine Labs aims to reinforce Fave's market position in Southeast Asia. Fave will also launch in India this year via Pine Lab's merchant network.", "url": "https://soyacincau.com/2021/04/13/fave-acquired-by-pine-labs-for-rm185-mil-will-launch-in-india-this-year/", "urlToImage": "https://soyacincau.com/wp-content/uploads/2021/04/210413-pine-labs-fave-1.jpg", "publishedAt": "2021-04-13T12:18:32Z", "content": "Merchant platform provider, Pine Labs has announced that it has acquired deals discovery and eWallet platform Fave for USD 45 million (about RM185 million). According to the press statement, the acqu… [+1735 chars]"}]}