{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ETMarkets.com", "title": "SGX Nifty up 40 points; here's what changed for market while you were sleeping - The Economic Times", "description": "Asian shares started cautiously on Monday in a week packed with economic data and central bank meetings, along with earnings from the tech giants that have kept the S&P 500 afloat so far this year. MSCI's broadest index of Asia-Pacific shares outside Japan ea…", "url": "https://economictimes.indiatimes.com/markets/stocks/news/sgx-nifty-up-40-points-heres-what-changed-for-market-while-you-were-sleeping/articleshow/99717602.cms", "urlToImage": "https://img.etimg.com/thumb/msid-99717598,width-1070,height-580,imgsize-160956,overlay-etmarkets/photo.jpg", "publishedAt": "2023-04-24T01:43:00Z", "content": "After muted sessions in the week gone by, equity markets will likely be rangebound in the near term as corporate earnings pick up pace. Results from several largecaps, including IT, banking, auto, an… [+3846 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "First Research Flight Images From Innovative Balloon-Borne Telescope - Eurasia Review", "description": "Astronomers have successfully launched a balloon-borne telescope which has begun capturing images of the Universe on its first research flight. The super pressure balloon-borne Imaging Telescope (S…", "url": "https://www.eurasiareview.com/24042023-first-research-flight-images-from-innovative-balloon-borne-telescope/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2023/04/a-243.png?fit=800%2C450&ssl=1", "publishedAt": "2023-04-23T22:06:46Z", "content": "Astronomers have successfully launched a balloon-borne telescope which has begun capturing images of the Universe on its first research flight.\r\nThe super pressure balloon-borne Imaging Telescope (Su… [+3808 chars]"}]}