{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Olympics.com"}, "author": "Utathya Nag", "title": "Asian Athletics Championships 2023: Murali Sreeshankar qualifies for Paris 2024 Olympics - Olympics", "description": "India won five medals, including one gold, at Asian Athletics Championships 2023 on Saturday. Long jumper Murali Sreeshankar qualified for Paris 2024 Olympics. Get results.", "url": "https://olympics.com/en/news/asian-athletics-championships-2023-bangkok-india-day-4-results", "urlToImage": "https://img.olympicchannel.com/images/image/private/t_social_share_thumb/f_auto/primary/j7wuxegaq8vjvhfhxjmx", "publishedAt": "2023-07-15T12:46:00Z", "content": "Indias Murali Sresshankar won the silver medal in the mens long jump event at the Asian Athletics Championships 2023 in Bangkok, Thailand on Saturday and in the process, qualified for the Paris 2024 … [+3917 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Rishav Narang", "title": "Hardik, Sanju Samson Unavailable; 2 New Faces Included: Complete Changes In India's T20I Squad For Asian Games - Times Now", "description": "Ruturaj Gaikwad will lead Team India in the Asian Games 2023. The first-choice players have not been named in the squad due to their World Cup commitments. Hardik Pandya, Sanju Samson and others were unavailable for selection. Here, we have a look at the comp…", "url": "https://www.timesnownews.com/sports/cricket/hardik-pandya-sanju-samson-unavailable-2-new-faces-included-complete-list-of-changes-in-indias-t20i-squad-for-asian-games-article-101780108", "urlToImage": "https://static.tnn.in/thumb/msid-101780108,updatedat-1689416779171,width-1280,height-720,resizemode-75/101780108.jpg", "publishedAt": "2023-07-15T10:27:00Z", "content": "Ruturaj To Lead, Jaiswal, Rinku In; No Dhawan, Ashwin: India Announce Cricket Squads For 2023 Asian Games"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Reveals Plan If His Political Party Gets Banned In Pakistan - NDTV", "description": "Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan has said in the event that his party is banned, he will float a new political party to contest the upcoming general elections and will win the elections, Dawn reported citing Nikkei Asia.", "url": "https://www.ndtv.com/world-news/imran-khan-reveals-plan-if-his-political-party-gets-banned-in-pakistan-4209800", "urlToImage": "https://c.ndtvimg.com/2023-03/ia818iug_imran-khan-afp_625x300_19_March_23.jpg", "publishedAt": "2023-07-15T09:37:50Z", "content": "Imran Khan was quoted saying \"even if they disqualify me and throw me in jail, the party will still win\".\r\nIslamabad: Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan has said in the event that his pa… [+1498 chars]"}]}