{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": null, "title": "FG, act swiftly against fresh COVID-19 outbreak - Punch Newspapers", "description": "FOLLOWING a resurgence of COVID-19 in China and the detection of the new Omicron subvariants, BA.5.2 and BF.7, said to be responsible for fuelling local infections in the Asian country, the Federal Government has to swiftly reintroduce safety measures to fore…", "url": "https://punchng.com/fg-act-swiftly-against-fresh-covid-19-outbreak/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2020/06/08004428/covid-19.fw_.png", "publishedAt": "2023-01-09T00:27:36Z", "content": "FOLLOWING a resurgence of COVID-19 in China and the detection of the new Omicron subvariants, BA.5.2 and BF.7, said to be responsible for fuelling local infections in the Asian country, the Federal G… [+6306 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": "Neil", "title": "Foreign investors’ choice of Asian manufacturing base seen as critical for PHL export prospects - BusinessWorld Online", "description": "FOREIGN INVESTORS are in the process of reviewing the locations of their Asian manufacturing bases, and their decisions will be critical for developing the Philippine export sector, Trade Secretary Alfredo E. Pascual said. Mr. Pascual told reporters in chance…", "url": "https://www.bworldonline.com/economy/2023/01/08/497194/foreign-investors-choice-of-asian-manufacturing-base-seen-as-critical-for-phl-export-prospects/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/04/Anflo-ecozone-100919.jpg", "publishedAt": "2023-01-08T15:56:52Z", "content": "FOREIGN INVESTORS are in the process of reviewing the locations of their Asian manufacturing bases, and their decisions will be critical for developing the Philippine export sector, Trade Secretary A… [+2423 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "19-year-old student broadcasts heartbreak and single status on board MRT train - but 'none of it is true' - AsiaOne", "description": "Tinder and other dating apps too passe? How about shouting about it from the rooftops — or in this case, in an MRT train? 19-year-old Fahim posted a video to his TikTok account on Friday, which showed the student advertising his single status in a crowded MRT…", "url": "https://www.asiaone.com/singapore/19-year-old-student-broadcasts-heartbreak-and-single-status-board-mrt-train-none-it-true", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/broadcastmrt.jpeg?h=56c55c38&itok=9_iSCrzv", "publishedAt": "2023-01-08T05:30:00Z", "content": "Tinder and other dating apps too passe? How about shouting about it from the rooftops or in this case, in an MRT train?\r\n19-year-old Fahim posted a video to his TikTok account on Friday, which showed… [+2854 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Thailand brings back Covid entry rules for all international travellers - The Star Online", "description": "Thailand will reintroduce Covid-19 entry requirements for foreigners flying into the country from Monday (Jan 9), the nation’s transport minister said, as the South-East Asian nation prepares for an expected wave of tourists from China.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2023/01/08/thailand-brings-back-covid-entry-rules-for-all-international-travellers", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2023/01/08/1892783.jpg", "publishedAt": "2023-01-08T03:40:00Z", "content": "BANGKOK, Jan 8 (Bloomberg): Thailand will reintroduce Covid-19 entry requirements for foreigners flying into the country from Monday (Jan 9), the nations transport minister said, as the South-East As… [+1510 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "UK palace allies push back against Prince Harry's claims in leaked memoir Spare - Channel NewsAsia", "description": "Veteran journalist Jonathan Dimbleby, a biographer and friend of King Charles III, said Harry's revelations were the type \"that you'd expect … from a sort of B-list celebrity,\" and that the king would be pained and frustrated by them.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/uk-palace-allies-push-back-against-prince-harrys-claims-leaked-memoir-spare-345666", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--XPZJIUI6--/c_crop,h_576,w_1024,x_0,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/08/ap23006653748693.jpg?itok=CkqBQIsy", "publishedAt": "2023-01-07T22:49:54Z", "content": "Harry's book, Spare, is the latest in a string of very public pronouncements by the prince and his wife Meghan since they quit royal life and moved to California in 2020, citing what they saw as the … [+1985 chars]"}]}