{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Ateneo battles La Salle in second round of the UAAP Season 84 men's basketball - BusinessWorld Online", "description": "ARCHRIVALS Ateneo and La Salle will usher in the equally exciting second round of the University Athletic Association of the Philippines (UAAP) Season 84 men’s basketball tournament starting this Holy Tuesday at the Mall of Asia Arena in Pasay City with the p…", "url": "https://www.bworldonline.com/sports/2022/04/11/441521/ateneo-battles-la-salle-in-second-round-of-the-uaap-season-84-mens-basketball/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/04/278097182_695830071772662_4537475265590618859_n.jpg", "publishedAt": "2022-04-10T10:56:18Z", "content": "ARCHRIVALS Ateneo and La Salle will usher in the equally exciting second round of the University Athletic Association of the Philippines (UAAP) Season 84 mens basketball tournament starting this Holy… [+1182 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "PH boxers shift focus to SEAG, world tilt after Thailand Open - pna.gov.ph", "description": "MANILA – The Philippine national boxing team seeks to fine-tune its game as it goes into the final stage of its rigorous preparations for the 31st Southeast Asian Games as well as the 2022 AIBA Women's World Boxing Championships next month.This after a victor…", "url": "https://www.pna.gov.ph/articles/1171904", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/04/10/boxing-thailand-open.jpg", "publishedAt": "2022-04-10T08:30:00Z", "content": "THAILAND OPEN CAMPAIGNERS. Members of the Philippine boxing team pose for posterity after winning three gold and two silver medals in the 2022 Thailand Open International Boxing Tournament that ended… [+3896 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Spot the ring: Jennifer Lopez and Ben Affleck are engaged (for the second time) - Channel NewsAsia", "description": "Bennifer are finally getting married after calling off their first engagement in 2004 – Jennifer Lopez shared the happy news on Saturday (Apr 9), showing off her engagement ring.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/jennifer-lopez-ben-affleck-engagement-2022-309491", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--J5SOKhG6--/c_crop,h_576,w_1024,x_0,y_5/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/02/03/063_1345735243.jpg?itok=hUtt1tCw", "publishedAt": "2022-04-10T04:49:42Z", "content": "Jennifer Lopez posted a 30-second teaser video on Instagram on Saturday (Apr 9) revealing a really special story that she wanted to share with her inner circle. \r\nShe then directed her fans and follo… [+93 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Customers complain that $48 meal for 9 pax is too expensive, Malaysian restaurant owner shoots back - AsiaOne", "description": "Malaysia is known for its delicious and affordable food, drawing visitors from Singapore and beyond. Unfortunately, it seems that the prices still aren't low enough for some. Malaysian restaurant owner Samz Wong took to Facebook yesterday (April 8) to lament …", "url": "https://www.asiaone.com/malaysia/customers-complain-48-meal-9-pax-too-expensive-malaysian-restaurant-owner-shoots-back", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2022/20220904%20Chinese%20Restaurant.jpg?h=1cb451e1&itok=C0M-Z0PP", "publishedAt": "2022-04-09T05:18:28Z", "content": "Malaysia is known for its delicious and affordable food, drawing visitors from Singapore and beyond. Unfortunately, it seems that the prices still aren't low enough for some. \r\nMalaysian restaurant o… [+2565 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'This is something I've been waiting for': Michelle Yeoh cries over Everything Everywhere All at Once role - AsiaOne", "description": "If there's one word to describe Malaysian actress Michelle Yeoh, it's passion. And in a recent interview with GQ, where the 59-year-old breaks down her most iconic characters, she talks about each character with such conviction and depth that you can't help b…", "url": "https://www.asiaone.com/entertainment/something-ive-been-waiting-michelle-yeoh-cries-over-everything-everywhere-all-at-once", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2022/08042022_headline%20photo.jpg?h=0429cc9e&itok=v8pODqw_", "publishedAt": "2022-04-09T02:00:00Z", "content": "If there's one word to describe Malaysian actress Michelle Yeoh, it's passion.\r\nAnd in a recent interview with GQ, where the 59-year-old breaks down her most iconic characters, she talks about each c… [+2881 chars]"}]}