{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Aakash Arya", "title": "India Beat Sri Lanka To Win U-19 Asia Cup: How The World Reacted - NDTV Sports", "description": "U-19 Asia Cup: Reactions poured in as India defeated Sri Lanka by nine wickets (DLS Method) to win the U-19 Asia Cup title.", "url": "https://sports.ndtv.com/cricket/india-beat-sri-lanka-to-win-u-19-asia-cup-how-the-world-reacted-2682140", "urlToImage": "https://c.ndtvimg.com/2021-12/fh6jbi24_u19-indian-cricket-team_625x300_31_December_21.jpg", "publishedAt": "2021-12-31T14:16:48Z", "content": "Year 2021 ended on the right note for the U-19 Indian cricket team as it lifted the U-19 Asia Cup after beating Sri Lanka by nine wickets (DLS Method) in a match that was interrupted by rain on Frida… [+3156 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Unvaccinated pregnant woman who got Covid-19 twice 'wracked with guilt' for putting infant son through death-threatening ordeal - AsiaOne", "description": "SINGAPORE - A miracle. That was what Madam Yvonne Khoo kept hearing from doctors and nurses after she woke up in the intensive care unit (ICU) at the Singapore General Hospital (SGH) on Nov 1 with tubes sticking out of her face and body. Hooked up to life sup…", "url": "https://www.asiaone.com/singapore/unvaccinated-pregnant-woman-who-got-covid-19-twice-wracked-guilt-putting-infant-son", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/rryvoneekhoo3112.jpg?h=0429cc9e&itok=NIivY2T_", "publishedAt": "2021-12-31T05:17:43Z", "content": "SINGAPORE - A miracle.\r\nThat was what Madam Yvonne Khoo kept hearing from doctors and nurses after she woke up in the intensive care unit (ICU) at the Singapore General Hospital (SGH) on Nov 1 with t… [+6035 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Mercedes pulls ad amid debate over model's eyes - News24", "description": "Mercedes-Benz removed a video advertisement from a Chinese social media website, state media said, after the clip got swept up in a charged national debate over depictions of Asian-looking features by foreign companies.", "url": "https://www.news24.com/fin24/companies/industrial/mercedes-pulls-ad-amid-debate-over-models-eyes-20211230", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10410/00a479d77be34326bbee5ffd7c22aee1.jpg", "publishedAt": "2021-12-30T07:26:05Z", "content": "Mercedes-Benz removed a video advertisement from a Chinese social media website, state media said, after the clip got swept up in a charged national debate over depictions of Asian-looking features b… [+3259 chars]"}]}