{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Philippine Daily Inquirer", "title": "AirAsia averts shutdown, commits to pay P1.14B - INQUIRER.net", "description": "Philippine Air Asia (PAA) narrowly averted a shutdown during the peak holiday travel season after agreeing to pay its P1.14-billion obligation with the Civil Aviation Authority of the", "url": "https://www.inquirer.net", "urlToImage": "https://business.inquirer.net/files/2022/12/402332-620x324.jpeg", "publishedAt": "2022-12-16T18:16:00Z", "content": "AirAsia flights departing and arriving from Caticlan and Cebu will operate at NAIA Terminal 3 starting December 16\r\nPhilippine Air Asia (PAA) narrowly averted a shutdown during the peak holiday trave… [+2046 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I couldn't ask for a pic because my manager said no': Cafe staff on serving Jay Chou drinks at Dempsey - AsiaOne", "description": "Some fans have run into their favourite celebrities at the gym or an amusement park in Singapore. For us unlucky ones, we can only seethe with jealousy or live vicariously through these fortunate few. One woman who met Taiwanese pop icon Jay Chou at work shar…", "url": "https://www.asiaone.com/entertainment/i-couldnt-ask-pic-because-my-manager-said-no-cafe-staff-serving-jay-chou-drinks-dempsey", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221216_jay%20chou%20cafe.png?h=d6bdad78&itok=V_T_fZOt", "publishedAt": "2022-12-16T10:08:00Z", "content": "Some fans have run into their favourite celebrities at the gym or an amusement park in Singapore. For us unlucky ones, we can only seethe with jealousy or live vicariously through these fortunate few… [+2535 chars]"}, {"source": {"id": null, "name": "Asianscientist.com"}, "author": "Asian Scientist Newsroom", "title": "High-Protein Diets Could Help Prevent Post-Diet Weight Regain - Asian Scientist Magazine", "description": "Researchers have discovered eating a high-protein diet after a restrictive diet could help prevent weight regain by supressing the presence of gut bacteria responsible for fat absorption.", "url": "https://www.asianscientist.com/2022/12/health/high-protein-diets-could-help-prevent-post-diet-weight-regain/", "urlToImage": "https://www.asianscientist.com/wp-content/uploads/2022/12/High-Protein-Diet_ASM_resized.jpg", "publishedAt": "2022-12-16T04:24:20Z", "content": "Asian Scientist Magazine (16 Dec. 2022) Eating a high-protein diet may help prevent weight regain after dieting, say researchers from China in a paper published in Nature Metabolism.\r\nDieting, or mor… [+3659 chars]"}]}