{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Tempo.com.ph"}, "author": "Tempo Desk", "title": "Creamline women squads humble rivals in BVR on Tour - Tempo", "description": "SANTA ANA, Cagayan ˗ The Creamline women’s beach volleyball squads, which form the core of the 2019 Southeast Asian Games bronze medal team, expectedly put up a show in Friday’s BVR on Tour first leg opener here. Creamline 1’s Sisi Rondina and Bernadeth Pons …", "url": "https://www.tempo.com.ph/2021/10/22/creamline-women-squads-humble-rivals-in-bvr-on-tour/", "urlToImage": "https://www.tempo.com.ph/wp-content/uploads/2021/10/gervacio-1-768x512.jpg", "publishedAt": "2021-10-22T09:11:10Z", "content": "Sisi Rondina and Bernadeth Pons\r\nSANTA ANA, Cagayan The Creamline women’s beach volleyball squads, which form the core of the 2019 Southeast Asian Games bronze medal team, expectedly put up a show in… [+1699 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Thailand to allow quarantine-free travel from 46 countries, PM says - Malay Mail", "description": "BANGKOK, Oct 22 — Thailand will let vaccinated visitors from 46 countries forgo Covid-19 quarantine from next month, up from 10 previously announced, Prime Minister Prayut Chan-o-cha said on Thursday. The South-east Asian country is poised to introduce the ne…", "url": "https://www.malaymail.com/news/world/2021/10/22/thailand-to-allow-quarantine-free-travel-from-46-countries-pm-says/2015137", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-10/2210_THAILAND-AIRPORT-seo.JPG", "publishedAt": "2021-10-22T01:07:45Z", "content": "Immigration police officers are seen during a readiness inspection in preparation for the country's reopening on November 1, at Suvarnabhumi International Airport in Bangkok, Thailand October 20, 202… [+1497 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "India delivers 1 billion COVID-19 vaccine doses as health officials hope worst of pandemic has passed - CBC.ca", "description": "India has administered one billion doses of COVID-19 vaccine, officials said Thursday, passing a milestone for the South Asian country where the delta variant fuelled its first crushing surge earlier this year.", "url": "https://www.cbc.ca/news/world/india-vaccine-pandemic-billion-1.6218332", "urlToImage": "https://i.cbc.ca/1.6219132.1634795515!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/virus-outbreak-india.jpg", "publishedAt": "2021-10-21T10:49:08Z", "content": "India has administered one billion doses of COVID-19 vaccine, officials said Thursday, passing a milestone for the South Asian country where the delta variant fuelled its first crushing surge earlier… [+3918 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Lifestyle Asia", "title": "Google Pixel 6 is here to dominate the smartphone market — here’s how - Lifestyle Asia", "description": "Could this be the big hit for Google? Launching the new Google Pixel 6, here's how the tech giant aims to take on Apple and Samsung.", "url": "https://www.lifestyleasia.com/ind/gear/tech/google-pixel-6-takes-on-apple-and-samsung/", "urlToImage": "https://cdn.lifestyleasia.com/wp-content/uploads/sites/7/2021/10/21101152/afp_tv_20211019.e35d9074726.original.jpg", "publishedAt": "2021-10-21T05:02:38Z", "content": "Smartphone sales are dominated by Apple and South Korean electronics colossus Samsung, but Google Pixel 6 is aiming to expand its single-digit market share with the newest Android-powered Pixel line.… [+2889 chars]"}]}