{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "Jesseca Liu endured months of husband Jeremy Chan acting like a child at home for ghost drama Soul Detective - Channel NewsAsia", "description": "In the supernatural drama series, which also stars Bryan Wong, Phyllis Quek and Priscelia Chan, Liu’s hubby stayed in character as a childlike spirit – and the rest of the cast even started talking like him. “It was so annoying,” quipped the actress.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/soul-detective-jesseca-liu-bryan-wong-jeremy-chan-339006", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--iod8XtCm--/c_crop,h_1080,w_1919,x_1,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/15/3.jpg?itok=N6qafPiH", "publishedAt": "2022-11-15T23:50:37Z", "content": "He also revealed that he found it easier to stay in character throughout the filming process even at home with his wife.\r\nThis, as you can imagine, did not go down so well with Liu.\r\nBut that wasnt e… [+793 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "India's population growth slows as world reaches 8 billion - Economic Times", "description": "Falling fertility rates in the South Asian country have forced at least one state to consider reviewing policies that encouraged families not to go beyond having two children.", "url": "https://economictimes.indiatimes.com/news/international/world-news/indias-population-growth-slows-as-world-reaches-8-billion/articleshow/95528418.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95528550,width-1070,height-580,imgsize-164290,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-15T08:18:00Z", "content": "As the global population reached 8 billion, the UN on Tuesday said India's population growth appears to be stabilising which shows that the country's national policies and health systems, including a… [+3025 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Salma Khalik", "title": "Getting second Covid-19 infection not more dangerous, say S'pore experts - asianews.network", "description": "Refuting a US study, the researchers found that patients with reinfections were three times more likely to be hospitalised than those infected for the first time.", "url": "https://asianews.network/getting-second-covid-19-infection-not-more-dangerous-say-spore-experts/", "urlToImage": "https://asianews.network/wp-content/uploads/2022/11/dw-covid-reinfection-221114_5.webp", "publishedAt": "2022-11-15T06:53:56Z", "content": "November 15, 2022\r\nSINGAPORE – An American study suggesting that people who are infected with Covid-19 for a second time are at higher risk of organ failure and death is questionable, with inherent l… [+4008 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Chill mum' Annette Lee would feed their kid food that's dropped to the floor, husband says - AsiaOne", "description": "Every kid knows that, in life, you have one strict parent and a lenient one who’ll let you get away with some mischief. On the latest episode of her show With Love, Becks, local actress Rebecca Lim sat down with musician-comedian and expecting mum Annette Lee…", "url": "https://www.asiaone.com/entertainment/chill-mum-annette-lee-would-feed-their-kid-food-dropped-floor-husband-says-rebecca-lim", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/221115_annette%20lee.png?h=4e10103e&itok=yTXmv0nc", "publishedAt": "2022-11-15T05:26:00Z", "content": "Every kid knows that, in life, you have one strict parent and a lenient one wholl let you get away with some mischief.\r\nOn the latest episode of her show With Love, Becks, local actress Rebecca Lim s… [+2645 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'We've always been the prankster parents': Naomi Neo responds to child abuse claims - AsiaOne", "description": "TikTok clips of Naomi Neo's son, Kyzo, reacting to his mum's pranks are a shoo-in for views. More often than not, all this attention is riddled with controversy. On Nov 10, the 26-year-old popped up as a guest on The Daily Ketchup Podcast to address claims of…", "url": "https://www.asiaone.com/lifestyle/weve-always-been-prankster-parents-naomi-neo-responds-child-abuse-claims", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/141122_naomineo_youtube.jpg?h=0429cc9e&itok=341RhoQN", "publishedAt": "2022-11-14T10:17:00Z", "content": "TikTok clips of Naomi Neo's son, Kyzo, reacting to his mum's pranks are a shoo-in for views.\r\nMore often than not, all this attention is riddled with controversy.\r\nOn Nov 10, the 26-year-old popped u… [+2269 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'It was my last resort': Eelyn Kok's relationship with son suffered because she had to play bad cop - AsiaOne", "description": "Eelyn Kok has played many roles over her acting career, but being the bad cop at home might just be the toughest one. In a recent interview with Lianhe Zaobao, actress Eelyn revealed that being strict with her nine-year-old son, Zane, was painful for her but …", "url": "https://www.asiaone.com/entertainment/it-was-my-last-resort-eelyn-koks-relationship-son-suffered-because-she-had-play-bad", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/141122_eelynson_insta.jpg?h=732e3ad0&itok=gvTWufe1", "publishedAt": "2022-11-14T05:25:41Z", "content": "Eelyn Kok has played many roles over her acting career, but being the bad cop at home might just be the toughest one.\r\nIn a recent interview with Lianhe Zaobao, actress Eelyn revealed that being stri… [+2802 chars]"}]}