{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "soompi"}, "author": "uing", "title": "2021 MAMA Unveils Full Performer Lineup - soompi", "description": "The 2021 Mnet Asian Music Awards (MAMA) has announced its lineup of performers! aespa, ATEEZ, Brave Girls, ENHYPEN, INI, ITZY, JO1, Kep1er, NCT 127, NCT DREAM, Stray Kids, and TXT, a total of 12 groups, will be lighting up the 2021 MAMA stage. CJ ENM revealed…", "url": "https://www.soompi.com/article/1500382wpp/2021-mama-unveils-full-performer-lineup", "urlToImage": "https://6.viki.io/image/cc55ea6f0a2a4f8b9ad807e7e7aee7c0/dummy.jpeg?s=900x600&e=t", "publishedAt": "2021-11-25T01:35:27Z", "content": "The 2021 Mnet Asian Music Awards (MAMA) has announced its lineup of performers!\r\naespa, ATEEZ, Brave Girls, ENHYPEN, INI, ITZY, JO1, Kep1er, NCT 127, NCT DREAM, Stray Kids, and TXT, a total of 12 gro… [+414 chars]"}, {"source": {"id": null, "name": "ChannelNews"}, "author": "Nathan Jolly", "title": "TSMC To Make Custom iPhone 5G Modem – channelnews - ChannelNews", "description": "Apple have made yet another move to reduce its reliance upon chipmaker Qualcomm, after buying Intel’s modem operations in 2019. Nikkei Asia reports that Apple has signed up TSMC to build the new custom iPhone 5G modem, which will feature 4-nanometer chip tech…", "url": "https://www.channelnews.com.au/tsmc-to-make-custom-iphone-5g-modem/", "urlToImage": "https://www.channelnews.com.au/wp-content/uploads/2021/07/tsmc.jpeg", "publishedAt": "2021-11-24T22:36:41Z", "content": "Apple have made yet another move to reduce its reliance upon chipmaker Qualcomm, after buying Intel’s modem operations in 2019.\r\nNikkei Asia reports that Apple has signed up TSMC to build the new cus… [+520 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Prepared to be scolded: Shane Pow to act in Mediacorp telemovie, first show after leaving prison - AsiaOne", "description": "Things are picking up for local actor Shane Pow after a terrible year. Besides being a regular livestreamer on Mdada — an online sales platform started by celebrity hairstylist Addy Lee, actress Michelle Chia, and host Pornsak — Shane has signed on to star in…", "url": "https://www.asiaone.com/entertainment/prepared-be-scolded-shane-pow-act-mediacorp-telemovie-first-show-after-leaving-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211123_shane.jpg?h=f74d8d50&itok=_KndRlRk", "publishedAt": "2021-11-23T11:10:00Z", "content": "Things are picking up for local actor Shane Pow after a terrible year.\r\nBesides being a regular livestreamer on Mdada an online sales platform started by celebrity hairstylist Addy Lee, actress Miche… [+1349 chars]"}]}