{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SportsCafe"}, "author": "SportsCafe Desk", "title": "WATCH | Murali Sreeshankar qualifies for Paris Olympics with mammoth jump - SportsCafe", "description": "India's Murali Sreeshankar has been in decent form this year and is one of the top long jumpers this year. At the Asian Athletics Championship 2023, not only did he bag a silver medal with a jump of 8.37m but also made the cut for the Paris Olympics, where th…", "url": "https://sportscafe.in/athletics/articles/2023/jul/15/murali-sreeshankar-qualifies-for-paris-olympics-with-mammoth-jump", "urlToImage": "https://sportscafe.in/img/es3-cfill-w800-h418/articles/getty%20murali.scorimg.webp", "publishedAt": "2023-07-15T12:56:48Z", "content": "Written by: SportsCafe Desk\r\nIndia's Murali Sreeshankar has been in decent form this year and is one of the top long jumpers this year. At the Asian Athletics Championship 2023, not only did he bag a… [+1173 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Rishav Narang", "title": "Hardik, Sanju Samson Unavailable; 2 New Faces Included: Complete Changes In India's T20I Squad For Asian Games - Times Now", "description": "Ruturaj Gaikwad will lead Team India in the Asian Games 2023. The first-choice players have not been named in the squad due to their World Cup commitments. Hardik Pandya, Sanju Samson and others were unavailable for selection. Here, we have a look at the comp…", "url": "https://www.timesnownews.com/sports/cricket/hardik-pandya-sanju-samson-unavailable-2-new-faces-included-complete-list-of-changes-in-indias-t20i-squad-for-asian-games-article-101780108", "urlToImage": "https://static.tnn.in/thumb/msid-101780108,updatedat-1689416779171,width-1280,height-720,resizemode-75/101780108.jpg", "publishedAt": "2023-07-15T10:27:00Z", "content": "Ruturaj To Lead, Jaiswal, Rinku In; No Dhawan, Ashwin: India Announce Cricket Squads For 2023 Asian Games"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Reveals Plan If His Political Party Gets Banned In Pakistan - NDTV", "description": "Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan has said in the event that his party is banned, he will float a new political party to contest the upcoming general elections and will win the elections, Dawn reported citing Nikkei Asia.", "url": "https://www.ndtv.com/world-news/imran-khan-reveals-plan-if-his-political-party-gets-banned-in-pakistan-4209800", "urlToImage": "https://c.ndtvimg.com/2023-03/ia818iug_imran-khan-afp_625x300_19_March_23.jpg", "publishedAt": "2023-07-15T09:37:50Z", "content": "Imran Khan was quoted saying \"even if they disqualify me and throw me in jail, the party will still win\".\r\nIslamabad: Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan has said in the event that his pa… [+1498 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "China's top diplomat urges stable ties with India as military tensions simmer - Reuters", "description": "China's top diplomat Wang Yi told the Indian foreign minister that bilateral ties need to be stabilised, as the two Asian neighbours searched for ways to ease simmering military tensions along their vast border.", "url": "https://www.reuters.com/world/asia-pacific/chinas-top-diplomat-urges-stable-ties-with-india-military-tensions-simmer-2023-07-15/", "urlToImage": "https://www.reuters.com/resizer/66Ijavue7kpk_LPE76wNXsChHCc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/6X4JHWZGRFIKLAOM2ZMTUIALME.jpg", "publishedAt": "2023-07-15T03:28:17Z", "content": "BEIJING, July 15 (Reuters) - China's top diplomat Wang Yi told the Indian foreign minister that bilateral ties need to be stabilised, as the two Asian neighbours searched for ways to ease simmering m… [+2003 chars]"}]}