{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Fire in North Bridge Road flat: 5 taken to hospital, 120 evacuated - AsiaOne", "description": "Five people were taken to hospital after a fire in North Bridge Road on Saturday (June 12) night. A Singapore Civil Defence Force (SCDF) spokesman said it was alerted to the blaze at Block 8 at about 10.15pm. The fire involved contents of a seventh-floor unit…", "url": "https://www.asiaone.com/singapore/fire-north-bridge-road-flat-5-taken-hospital-120-evacuated", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/image_573.jpg?h=199d8c1f&itok=LGsUSxgB", "publishedAt": "2021-06-13T04:35:01Z", "content": "Five people were taken to hospital after a fire in North Bridge Road on Saturday (June 12) night.\r\nA Singapore Civil Defence Force (SCDF) spokesman said it was alerted to the blaze at Block 8 at abou… [+725 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Football: Denmark's Eriksen had cardiac massage on pitch, was able to speak before going to hospital, says team doctor - AsiaOne", "description": "Denmark’s Christian Eriksen received life-saving cardiac massage treatment on the pitch after collapsing on Saturday in his side’s Euro 2020 opening match with Finland but was able to speak before being taken to hospital, team doctor Morten Boesen said. Eriks…", "url": "https://www.asiaone.com/world/football-denmark-s-eriksen-had-cardiac-massage-pitch-was-able-speak-going-hospital-says-team", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/20210613_euro.jpg?h=12ced743&itok=drNduhWg", "publishedAt": "2021-06-13T01:10:00Z", "content": "Denmarks Christian Eriksen received life-saving cardiac massage treatment on the pitch after collapsing on Saturday in his sides Euro 2020 opening match with Finland but was able to speak before bein… [+2226 chars]"}, {"source": {"id": null, "name": "Telecomasia.net"}, "author": "Edgar Toro", "title": "EURO 2020: Austria vs North Macedonia Prediction, Betting Tips & Odds│13 JUNE 2021 - Telecom Asia", "description": "The Austrian national team will start Euro 2020 with a match against the national team of Northern Macedonia. The future rivals played each other in the qualifying tournament for Euro 2020, both matches were won by the Austrians, who are quoted as favorites f…", "url": "https://www.telecomasia.net/sports-betting/tips/football/uefa-euro/euro-2020-austria-vs-north-macedonia-prediction-betting-tips-odds-13-june-2021/", "urlToImage": "https://www.telecomasia.net/upload/iblock/ac6/ac66fb90b3b02e40281ce48cb817f09a.jpg", "publishedAt": "2021-06-12T12:06:11Z", "content": "The Austrian national team will start Euro 2020 with a match against the national team of Northern Macedonia. The future rivals played each other in the qualifying tournament for Euro 2020, both matc… [+2455 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "What responses to HIV and COVID-19 in Asia and the Pacific led by civil society can teach us - World - ReliefWeb", "description": "English News and Press Release on World about Health, HIV/Aids and Epidemic; published on 11 Jun 2021 by UNAIDS", "url": "https://reliefweb.int/report/world/what-responses-hiv-and-covid-19-asia-and-pacific-led-civil-society-can-teach-us", "urlToImage": "https://reliefweb.int/profiles/reliefweb/themes/kobe/images/metatag/disaster-type/epidemic.png", "publishedAt": "2021-06-12T10:03:13Z", "content": "COVID-19 continues to threaten the gains made in the HIV response and has brought inequalities to the forefront, but civil society and community-based organizations in Asia and the Pacific have been … [+4854 chars]"}, {"source": {"id": null, "name": "The-afc.com"}, "author": "AFC", "title": "Park hails Vietnam players after gritty Asian Qualifiers win, Tan rues Malaysia's bad luck | Football | News | Asian Qualifiers 2022 - The Official Home of Asian Football", "description": "Dubai: Head coach Park Hang-seo lauded his Vietnam players after an \"exhausting\" win against Malaysia in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023 on Friday.", "url": "https://www.the-afc.com/competitions/afc-asian-cup/news/park-hails-vietnam-players-after-gritty-asian-qualifiers-win-tan-rues-malaysia-s", "urlToImage": "https://www.the-afc.com/img/image/upload/t_l10/v1623474796/i8lsykqyaesubhm4xmma.jpg", "publishedAt": "2021-06-12T05:13:42Z", "content": "Dubai: Head coach Park Hang-seo lauded his Vietnam players after an \"exhausting\" win against Malaysia in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023… [+2094 chars]"}]}