{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Hollan", "title": "Smithsonian announces 4 museums will close due to COVID-related staffing issues - Fox News", "description": "Smithsonian announced that it will temporarily close the African Art, Postal, Anacostia and Asian Art Museums.", "url": "https://www.foxnews.com/travel/smithsonian-four-museums-close-covid-staffing-issues", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/iStock-477998954.jpg", "publishedAt": "2021-12-29T18:01:53Z", "content": "Museum fans may have to change their New Years Eve plans.\r\nSmithsonian announced that it will be temporarily closing four of its museums in Washington, D.C. These closures are due to staffing issues … [+1609 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Philippine peso reels from typhoon damage, hits near 3-month low - Reuters", "description": "The Philippine peso slipped on Wednesday to its lowest in almost three months, leading losses among emerging Asian currencies and extending its fall since a typhoon barrelled into the island nearly two weeks ago, while most stock markets cut early losses.", "url": "https://www.reuters.com/markets/europe/philippine-peso-reels-typhoon-damage-hits-near-3-month-low-2021-12-29/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=66", "publishedAt": "2021-12-29T07:59:00Z", "content": "Dec 29 (Reuters) - The Philippine peso slipped on Wednesday to its lowest in almost three months, leading losses among emerging Asian currencies and extending its fall since a typhoon barrelled into … [+2620 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "AirAsia completes RM974.5mil rights issue - The Star Online", "description": "KUALA LUMPUR: AirAsia Group Bhd is expected to complete its renounceable rights issue to its existing shareholders upon the listing of the redeemable convertible unsecured Islamic debt securities (RCUIDS) and warrants on Dec 31.", "url": "https://www.thestar.com.my/business/business-news/2021/12/29/airasia-completes-rm9745mil-rights-issue", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/29/1423670.JPG", "publishedAt": "2021-12-29T02:23:00Z", "content": "KUALA LUMPUR: AirAsia Group Bhd is expected to complete its renounceable rights issue to its existing shareholders upon the listing of the redeemable convertible unsecured Islamic debt securities (RC… [+2349 chars]"}]}