{"articles": [{"author": "Tina G. Santos", "content": "Jose Manuel RomualdezUS EMBASSY PHOTO\r\nMANILA, Philippines The Philippines has called the attention of the US government to rising hate crimes against Asians, Philippine Ambassador to the United Stat… [+1187 chars]", "description": "MANILA, Philippines — The Philippines has called the attention of the US government to rising hate crimes against Asians, Philippine Ambassador to the United States Jose Manuel Romualdez said on", "publishedAt": "2021-03-01T20:25:00Z", "source": {"id": null, "name": "Inquirer.net"}, "title": "Hate crimes vs Asians on the rise, PH tells US gov’t - INQUIRER.net", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2020/12/News109308-e1608310328917.jpg"}, {"author": null, "content": "He made his fame and fortune in Hong Kong as one half of an unforgettable Chinese cinematic comedy duo with Stephen Chow, but it was Johor Bahru (JB), Malaysia, that veteran actor Ng Man Tat called h… [+2226 chars]", "description": "He made his fame and fortune in Hong Kong as one half of an unforgettable Chinese cinematic comedy duo with Stephen Chow, but it was Johor Bahru (JB), Malaysia, that veteran actor Ng Man Tat called home for years before his death. The 70-year-old died on Satu…", "publishedAt": "2021-03-01T10:30:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Ng Man Tat was living in Johor Bahru for many years but wanted to return to Hong Kong prior to his death - AsiaOne", "url": "https://www.asiaone.com/entertainment/ng-man-tat-was-living-johor-bahru-many-years-wanted-return-hong-kong-prior-his-death", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210301_ng.jpg?h=6552f112&itok=lBExzepb"}, {"author": "The Star Online", "content": "LOS ANGELES, March 1 (Reuters): Drama Nomadland and satire Borat Subsequent Moviefilm won movie honors at the Golden Globes on Sunday in a mostly virtual bicoastal ceremony that was marked by impassi… [+4464 chars]", "description": "Nomadland also took the best director prize for Chinese-born Chloe Zhao. It made Zhao only the second woman to win at the Globes in that category, and the first woman director of Asian descent to win.", "publishedAt": "2021-03-01T09:09:00Z", "source": {"id": null, "name": "The Star Online"}, "title": "Chinese-born Chloe Zhao makes history at Golden Globe Awards - The Star Online", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/03/01/chinese-born-chloe-zhao-makes-history-at-golden-globe-awards", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/03/01/1061112.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "asia"}