{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Philippine Star"}, "author": "Pia Lee-Brago", "title": "Most Pinoys facing new year with hope – Pulse - Philstar.com", "description": "A majority of Filipino adults will be facing the coming year with hope, according to a Pulse Asia survey.", "url": "https://www.philstar.com/headlines/2022/12/20/2231943/most-pinoys-facing-new-year-hope-pulse", "urlToImage": "https://media.philstar.com/photos/2022/12/19/pinoy_2022-12-19_22-06-39.jpg", "publishedAt": "2022-12-19T16:00:00Z", "content": "MANILA, Philippines — A majority of Filipino adults will be facing the coming year with hope, according to a Pulse Asia survey.\r\nThe survey released yesterday found only 8 percent were ambivalent or … [+1365 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'If your voice can't make it, don't even consider holding a concert': Jay Chou fans in Singapore lament poor vocals and sound quality - AsiaOne", "description": "Nobody wants to go to a concert by their fave pop star and have the backup singers steal the spotlight. Taiwanese Mandopop king Jay Chou was in Singapore for his Carnival World Tour concerts on Dec 17 and 18, and fans were hyped to see him for the first time …", "url": "https://www.asiaone.com/entertainment/if-your-voice-cant-make-it-dont-even-consider-holding-concert-jay-chou-fans-singapore-poor-vocals-sound-quality", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221219_%20jay%20chou_sg.png?h=2ab44c60&itok=WWvU3R4L", "publishedAt": "2022-12-19T05:52:40Z", "content": "Nobody wants to go to a concert by their fave pop star and have the backup singers steal the spotlight.\r\nTaiwanese Mandopop king Jay Chou was in Singapore for his Carnival World Tour concerts on Dec … [+4217 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Gender-associated cardiometabolic risk profiles and health behaviors in patients with type 2 diabetes: A cross-sectional analysis of the Joint Asia Diabetes Evaluation (JADE) program - The Lancet", "description": "Asian women with T2D had worse quality of care than men especially in middle-income\ncountries/areas, calling for targeted implementation programs to close these care\ngaps.", "url": "https://www.thelancet.com/journals/lanwpc/article/PIIS2666-6065(22)00278-4/fulltext", "urlToImage": "https://www.thelancet.com/cms/asset/a8f2cc35-e7cb-4233-b011-ff7f13603237/gr3.jpg", "publishedAt": "2022-12-19T05:49:34Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2022 Elsevier In… [+173 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Loser' buddies embark on epic journey, cycle 3400km from Singapore to Vietnam - AsiaOne", "description": "That's one epic spin session. Instead of hopping on a flight to Hanoi like regular tourists, two Singaporean men chose the road less travelled. They ended up pedalling their bikes way all the way up north from Singapore to Vietnam — traversing about 3,400km i…", "url": "https://www.asiaone.com/singapore/loser-buddies-embark-epic-journey-cycle-3400km-singapore-vietnam", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/jangpalocycling.jpeg?h=0429cc9e&itok=5lcHxcP4", "publishedAt": "2022-12-18T03:42:49Z", "content": "That's one epic spin session.\r\nInstead of hopping on a flight to Hanoi like regular tourists, two Singaporean men chose the road less travelled.\r\nThey ended up pedalling their bikes way all the way u… [+2705 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Stefanie Sun and JJ Lin send Old Chang Kee and chilli crab to Jay Chou in Singapore - Channel NewsAsia", "description": "Chou, in town for his Carnival World Tour concert, thanked his fellow pop stars via social media for feeding him well. Food, after all, is Singaporeans’ love language, isn’t it?", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/jay-chou-concert-singapore-stefanie-sun-j-j-lin-send-food-343681", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--vBig-A07--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/12/18/jay_chou_in_singapore_2022.jpg?itok=o1VfgAYf", "publishedAt": "2022-12-18T02:50:56Z", "content": "Additionally, Chou and his team received a seafood meal from Lin, replete with chilli crab and more crabs done in different ways; prawns and vegetable dishes. Chou remarked, Yum and Thanks, bro. Lin … [+342 chars]"}]}