{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Eyimofe makes Guardian UK's best films from Africa, Asia, Latin America list - Guardian Nigeria", "description": "Eyimofe has been picked along with nine others on a shortlist of top films from Africa, Asia and Latin America by The Guardian of the UK.", "url": "https://editor.guardian.ng/life/eyimofe-makes-guardian-uks-best-films-from-africa-asia-latin-america-list/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/10/Eyimofe-Preview-Screenshots-6.png", "publishedAt": "2021-12-26T07:30:00Z", "content": "Eyimofe (This Is My Desire), directed by twin brothers Arie Esiri and Chuko Esiri. Photograph: Everett Collection Inc/Alamy\r\nEyimofe, the multiple award-winning Nigerian feature film, has been picked… [+2164 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Showbiz veteran Jenny Tseng slams Li Jinglei for going too far in public divorce spat with Wang Leehom - AsiaOne", "description": "Li Jinglei may have called for a truce on her and ex-husband Wang Leehom's very public spat over their divorce, but it seems the brouhaha has yet to die down. The 35-year-old's explosive posts after their divorce announcement on Dec 16 have not only tarnished…", "url": "https://www.asiaone.com/entertainment/showbiz-veteran-jenny-tseng-slams-li-jinglei-going-too-far-public-divorce-spat-wang-leehom", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/Jennyleejinglei2.jpeg?h=0429cc9e&itok=y9mtZHb8", "publishedAt": "2021-12-26T06:28:00Z", "content": "Li Jinglei may have called for a truce on her and ex-husband Wang Leehom's very public spat over their divorce, but it seems the brouhaha has yet to die down.\r\nThe 35-year-old's explosive posts after… [+1784 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Our Christmas dinner was ruined': Collin's Grille customers complain of delayed and missing meals on Christmas Eve - AsiaOne", "description": "Customers of Collin's Grille were left high and dry on Christmas Eve when their pre-ordered Christmas dinners failed to materialise. In photos posted on social media, long queues were seen at Collin's Grille outlets across Singapore on Dec 24. The long wait f…", "url": "https://www.asiaone.com/singapore/our-christmas-dinner-was-ruined-collins-grille-customers-complain-delayed-and-missing", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/20211226_CollinsGrilleXmas.jpeg?h=0429cc9e&itok=eP-e5fFV", "publishedAt": "2021-12-26T04:32:00Z", "content": "Customers of Collin's Grille were left high and dry on Christmas Eve when their pre-ordered Christmas dinners failed to materialise.\r\nIn photos posted on social media, long queues were seen at Collin… [+3795 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "HDB resale price increase: Why are prices rising & what does it mean for home buyers? - AsiaOne", "description": "Singaporeans have been rushing to buy HDB resale flats recently. Here’s proof: a record-breaking 29 HDB resale flats priced at over $1 million were sold in November 2021.\r\n\r\n\r\n\r\n\r\n\r\n\r\nWhen the pandemic first started, everyone was expecting a recession and a f…", "url": "https://www.asiaone.com/money/hdb-resale-price-increase-why-are-prices-rising-what-does-it-mean-home-buyers", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/20211224_hdb_st.jpg?h=0429cc9e&itok=Qu4vaPbD", "publishedAt": "2021-12-26T03:30:00Z", "content": "When the pandemic first started, everyone was expecting a recession and a fall in property prices. But the opposite has happened.\r\nPart of the reason is the BTO delays caused by the pandemic. Affecte… [+8142 chars]"}]}