{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Dailytrust.com"}, "author": "Muideen Olaniyi", "title": "Marketing Nigeria as a natural investment destination in Africa, Osinbajo woos South East Asian Investors - Daily Trust", "description": "Vice President Yemi Osinbajo, SAN, spent the second day of his official visit to Vietnam asserting the view that for foreign investors and businesses", "url": "https://dailytrust.com/marketing-nigeria-as-a-natural-investment-destination-in-africa-osinbajo-woos-south-east-asian-investors/", "urlToImage": "https://dailytrust.com/wp-content/uploads/2022/11/Osinbajo-1.jpg", "publishedAt": "2022-12-06T17:09:04Z", "content": "Vice President Yemi Osinbajo, SAN, spent the second day of his official visit to Vietnam asserting the view that for foreign investors and businesses looking at Africa, Nigeria is the straightforward… [+5781 chars]"}, {"source": {"id": null, "name": "Amfar.org"}, "author": null, "title": "HIV Care Continuum & Beyond: A New Era for Asia - amfAR, The Foundation for AIDS Research", "description": "With amfAR as co-partner, an initiative to promote strengthening access to the HIV care continuum assesses what policies and programs are working.", "url": "https://www.amfar.org/news/hiv-care-continuum-beyond-a-new-era-for-asia/", "urlToImage": "https://www.amfar.org/wp-content/uploads/2022/12/HIV-Care-Continuum-Beyond-A-New-Era-for-Asia-White-Paper-SEO-1.jpg", "publishedAt": "2022-12-06T15:52:30Z", "content": "There are an estimated 6.0 million people living with HIV in the Asia-Pacific region. A quarter of new HIV infections are among young people aged 15 to 24, and almost all occur among members of key p… [+1231 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "US Modified HIMARS To Prevent Ukraine From Launching Long-Range ATACMS Missiles Into Russia — WSJ Report - EurAsian Times", "description": "US modified the powerful HIMARS rocket launchers it handed Ukraine so they cannot be used to launch long-range missiles, including ATACMS", "url": "https://eurasiantimes.com/us-modified-himars-to-prevent-ukraine-from-launching-russia/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/12/HIMARS-Ukraine-US-1.jpg", "publishedAt": "2022-12-06T10:30:38Z", "content": "The US quietly modified the powerful HIMARS rocket launchers it sent to Ukraine to prevent launching long-range missiles into Russia, reported WSJ. \r\nSince June, the United States has given the Ukrai… [+4129 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "India-Central Asia NSAs to protect Afghanistan from terror groups - Hindustan Times", "description": "Led by National Security Advisor Ajit Doval, the India-Central Asia NSAs focused on Afghanistan and protect the region from terrorist groups, terror recruitment, financing and propaganda through new and emerging technologies including cyber attacks. | Latest …", "url": "https://www.hindustantimes.com/india-news/indiacentral-asia-nsas-to-protect-afghanistan-from-terror-groups-101670319759012.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/06/1600x900/nsa_1670320012465_1670320038492_1670320038492.jpeg", "publishedAt": "2022-12-06T09:49:06Z", "content": "The National Security Advisers (NSAs) of India and Central Asia on Tuesday reiterated strong support for a peaceful, stable and secure Afghanistan, emphasising respect for its sovereignty, unity and … [+2081 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "World Cup fever boosts business for sports stores, some restaurants in Singapore - CNA", "description": "Merchandise of the Japanese and South Korean teams is high in demand after both Asian nations advanced to the World Cup knockout stage.", "url": "https://www.channelnewsasia.com/singapore/world-cup-fever-japanese-south-korean-merchandise-restaurants-3122811", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--8Cpbh_i1--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/12/05/screenshot_526.png?itok=w8JUcTrh", "publishedAt": "2022-12-05T13:29:49Z", "content": "Sports stores selling jerseys and shoes said they are seeing businesses increase by more than half, especially merchandise of the Japan and South Korea teams, as well as others that have made it to t… [+1653 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Orange is the new white: Priscilla Ku decks her Christmas tree with dozens of Hermes boxes - AsiaOne", "description": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas ‘tree’ to promote environmental causes, to people lighting up their homes with fairy lights. One woman who is giving th…", "url": "https://www.asiaone.com/entertainment/orange-new-white-priscilla-ku-decks-her-christmas-tree-dozens-hermes-boxes", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_priscilla%20ku.png?h=7d6973a9&itok=TVOJuRuD", "publishedAt": "2022-12-05T10:24:00Z", "content": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas tree to promote environmental causes, to people lighting up… [+2670 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Hong Kong stars are really low-key': Andy Lau spotted at daughter's school performance - AsiaOne", "description": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too. Netizens were pleasantly surprised to see the Hong Kong singer-actor at a school performance on Friday (Dec…", "url": "https://www.asiaone.com/entertainment/hong-kong-stars-are-really-low-key-andy-lau-spotted-daughters-school-performance", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_andy%20lau%20school.png?h=62c6da03&itok=0GH6SjkN", "publishedAt": "2022-12-05T04:30:00Z", "content": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too.\r\nNetizens were pleasantly surprised to see the … [+1654 chars]"}]}