{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Tata Sons will now have to put in lots more money into Air India - Economic Times", "description": "A TOI report says it has already invested Rs 6000 in its existing airline startups , AirAsia India and Vistara, and lost over Rs 9,000 crore till date. Air India, which has not made a profit in the last 14 years, will add to that burden.", "url": "https://economictimes.indiatimes.com/industry/transportation/airlines-/-aviation/tata-sons-will-now-have-to-put-in-lots-more-money-into-air-india/articleshow/86890214.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86890244,width-1070,height-580,imgsize-111810,overlay-economictimes/photo.jpg", "publishedAt": "2021-10-09T09:58:00Z", "content": "Tata Sons, which has taken over Air India with a Rs18,000 crore bid will have to spend more money-- which could work out to nearly the same amount -- to restructure the carrier.\r\nA TOI report says it… [+1293 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "French envoy to Australia claims officials lied to his face over sub deal, raised risk of confrontation in Asia - Stuff.co.nz", "description": "France’s ambassador to Australia says the deal raised the risk of confrontation in Asia, and has the EU nation turning to other “trusted partners in the region”, like NZ.", "url": "https://www.stuff.co.nz/world/australia/300426902/french-envoy-to-australia-claims-officials-lied-to-his-face-over-sub-deal-raised-risk-of-confrontation-in-asia", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/v/6/v/p/image.related.StuffLandscapeSixteenByNine.1420x800.4yv6vq.png/1633768848070.jpg", "publishedAt": "2021-10-09T08:40:00Z", "content": "Frances ambassador to Australia says Australian officials lied to his face and raised the risk of confrontation in Asia by crafting a secret submarine deal with the United States and Britain that und… [+4368 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "IGN Southeast Asia", "title": "Eight Things to Know for Cookie Run: Kingdom's Update - IGN SOUTH EAST ASIA", "description": "Cookie Run: Kingdom is a mobile base-building RPG that offers a sheet pan of over 64 unique characters on fresh adventures. Led by fearless leader GingerBrave, these tough Cookies explore over 250 story levels where they build delicious strongholds, fight for…", "url": "https://sea.ign.com/feature/177501/eight-things-to-know-for-cookie-run-kingdoms-update", "urlToImage": "", "publishedAt": "2021-10-09T08:11:36Z", "content": "Cookie Run: Kingdom is a mobile base-building RPG that offers a sheet pan of over 64 unique characters on fresh adventures. Led by fearless leader GingerBrave, these tough Cookies explore over 250 st… [+3773 chars]"}]}