{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "The Manila Times"}, "author": "Associated Press", "title": "Asean leaders hold summit with Myanmar's general shut out - The Manila Times", "description": "KUALA LUMPUR, Malaysia: Southeast Asian leaders are meeting this week for their annual summit where Myanmar's top general, whose forces seized power in February and shattered...", "url": "https://www.manilatimes.net/2021/10/25/news/asean-leaders-hold-summit-with-myanmars-general-shut-out/1819667", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/10/25/22433.jpg", "publishedAt": "2021-10-25T04:30:13Z", "content": "KUALA LUMPUR, Malaysia: Southeast Asian leaders are meeting this week for their annual summit where Myanmar's top general, whose forces seized power in February and shattered one of Asia's most pheno… [+5122 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Trudeau uses pandemic-plagued supply chains in free trade pitch to ASEAN - CTV News", "description": "Prime Minister Justin Trudeau has used the spectre of gnarled global supply chains in his latest bid to a bloc of Southeast Asian nations to win them over on a free trade deal.", "url": "https://www.ctvnews.ca/canada/trudeau-uses-pandemic-plagued-supply-chains-in-free-trade-pitch-to-asean-1.5636653", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5631430.1634764228!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-10-25T02:47:03Z", "content": "OTTAWA -- \r\nPrime Minister Justin Trudeau used the spectre of gnarled global supply chains in a bid Sunday to a bloc of Southeast Asian nations to win them over on a free trade deal.\r\nTrudeau has lon… [+2474 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Microsoft Office 365 Custom Solution, Business News - AsiaOne", "description": "365 Digital consulting, a top Microsoft Office 365 consulting firm based in Australia announces the opening of its new branch in London, United Kingdom to offer high-quality Office 365 development services to businesses based in UK. London, United Kingdom - O…", "url": "https://www.asiaone.com/business/microsoft-office-365-custom-solution", "urlToImage": null, "publishedAt": "2021-10-25T01:51:14Z", "content": "365 Digital consulting, a top Microsoft Office 365 consulting firm based in Australia announces the opening of its new branch in London, United Kingdom to offer high-quality Office 365 development se… [+5690 chars]"}, {"source": {"id": null, "name": "Investing.com"}, "author": "Reuters", "title": "Asian shares steady, dollar weak as traders await earnings By Reuters - Investing.com", "description": "Asian shares edge higher, dollar weak as traders await earnings", "url": "https://www.investing.com/news/economy/asian-shares-steady-dollar-weak-as-traders-await-earnings-2653501", "urlToImage": "https://i-invdn-com.investing.com/news/STOCK-EXCHANGE-RUSSIAN-TRADING-SYSTEMS_800x533_L_1414427815.jpg", "publishedAt": "2021-10-25T01:30:00Z", "content": "By Alun John\r\nHONG KONG (Reuters) - Asian shares edged higher on Monday ahead of a week packed with major quarterly earnings announcements though news of trials of a property tax in China weighed on … [+4049 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Turkish lira hits record low after Erdogan seeks expulsions - reuters.com", "description": "The Turkish lira weakened 1.6% to a record low against the dollar in early Asian trade after President Tayyip Erdogan said he had ordered the expulsion of the ambassadors of the United States and nine other Western countries. <a href=\"/world/middle-east/turke…", "url": "https://www.reuters.com/world/middle-east/turkish-lira-hits-record-low-after-erdogan-seeks-expulsions-2021-10-24/", "urlToImage": "https://www.reuters.com/resizer/ZP4aXbjY1RJanrDW1j8fn0Picec=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/J6CLXVH5YVPV5IBUN2P6AYYI5M.jpg", "publishedAt": "2021-10-25T00:00:00Z", "content": "A money changer holds Turkish lira banknotes at a currency exchange office in Ankara, Turkey October 12, 2021. REUTERS/Cagla GurdoganISTANBUL, Oct 24 (Reuters) - The Turkish lira weakened 1.6% to a r… [+2033 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Ryan had something to do with NOC girls': Sylvia Chan in tell-all with Xiaxue - AsiaOne", "description": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up. In an interview with veteran social media influencer Wendy Cheng — better known as Xiaxue — on Sunday night (Oct 24), the 33-year-…", "url": "https://www.asiaone.com/singapore/he-had-something-do-noc-girls-sylvia-chan-tell-all-xiaxue", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/nocsylvia_ytxx.jpg?h=0429cc9e&itok=7Kvw939d", "publishedAt": "2021-10-24T15:55:00Z", "content": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up.\r\nIn an interview with veteran social media influencer Wendy Cheng  bet… [+3056 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore to resume travel from South Asia, eases measures for those from Malaysia, Indonesia - The Star Online", "description": "Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust border measures in response to the global Covid-19 situation.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/24/singapore-to-resume-travel-from-south-asia-eases-measures-for-those-from-malaysia-indonesia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/24/1343238.jpg", "publishedAt": "2021-10-24T10:48:00Z", "content": "SINGAPORE, Oct 24 (The Straits Times/ANN): Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust bo… [+4234 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Actress Gong Li reportedly giving up Singapore citizenship - AsiaOne", "description": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport. The 55-year-old is allegedly renouncing her citizenship due to sweeping crackdowns on the C…", "url": "https://www.asiaone.com/entertainment/actress-gong-li-reportedly-giving-singapore-citizenship", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/241021_gongli_reuters.jpg?h=0429cc9e&itok=gD94y1gM", "publishedAt": "2021-10-24T04:40:00Z", "content": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport.\r\nThe 55-year-old is allegedly r… [+1751 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dengue cluster in your neighbourhood? Here's what you need to know and do - AsiaOne", "description": "In 2020, Singapore had a “historic” dengue outbreak, with a total of 35,315 reported cases. Then in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aedes aegypti breed have grown by 30 per cent in April, compar…", "url": "https://www.asiaone.com/lifestyle/dengue-cluster-your-neighbourhood-heres-what-you-need-know-and-do", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/201021_mosquitodengue_unsplash.jpg?h=4c9e7946&itok=AleDwB-J", "publishedAt": "2021-10-23T11:30:00Z", "content": "In 2020, Singapore had a historic dengue outbreak, with a total of 35,315 reported cases.\r\nThen in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aed… [+4850 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Sinovac to be included in National Vaccination Programme and other new Covid-19 measures announced on Oct 23 - AsiaOne", "description": "New measures were announced on Saturday (Oct 23) by the multi-ministry task force on Covid-19, to help Singapore to live with the Covid-19 pandemic. The new measures announced by the Multi-Ministry Taskforce tackling the Covid-19 pandemic in Singapore are: Th…", "url": "https://www.asiaone.com/singapore/sinovac-be-included-national-vaccination-programme-and-other-new-covid-19-measures", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/hzsinovac231021.jpeg?h=08cc71c4&itok=Q-SXLTQq", "publishedAt": "2021-10-23T07:53:00Z", "content": "New measures were announced on Saturday (Oct 23) by the multi-ministry task force on Covid-19, to help Singapore to live with the Covid-19 pandemic.\r\nThe new measures announced by the Multi-Ministry … [+4688 chars]"}]}