{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Reuters", "title": "ASEAN ministers urge Myanmar to halt violence - ABS-CBN News", "description": "Southeast Asian foreign ministers urged Myanmar on Monday to halt violence, free prisoners and start its agreed dialogue during a meeting in China, while Singapore's top diplomat said the group was disappointed at its \"very, very slow progress\".", "url": "https://news.abs-cbn.com/overseas/06/08/21/asean-ministers-urge-myanmar-to-halt-violence", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/reuters/06/07/myanmar-politics.jpg", "publishedAt": "2021-06-07T16:26:00Z", "content": "Southeast Asian foreign ministers urged Myanmar on Monday to halt violence, free prisoners and start its agreed dialogue during a meeting in China, while Singapore's top diplomat said the group was d… [+3784 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Bloomberg News", "title": "US-China trade relationship vastly imbalanced, Tai says | Bloomberg News - Business Mirror", "description": "The trade relationship between the two largest economies in the world has “significant imbalance” and the Biden administration is committed to leveling it, according to the US trade representative. Speaking on the weekend before a meeting of Asia-Pacific trad…", "url": "https://businessmirror.com.ph/2021/06/07/us-china-trade-relationship-vastly-imbalanced-tai-says/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/03/A2-US-China-meet.jpg", "publishedAt": "2021-06-07T11:03:54Z", "content": "The trade relationship between the two largest economies in the world has significant imbalance and the Biden administration is committed to leveling it, according to the US trade representative.\r\nSp… [+3285 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Solar Eclipse Visible On June 10 From UK, Canada And Greenland - Eurasia Review", "description": "An annular eclipse of the Sun will take place on June 10, visible from Canada, Greenland, the Arctic Ocean and Siberia. In the UK and Ireland observers will see a partial solar eclipse, w…", "url": "https://www.eurasiareview.com/07062021-solar-eclipse-visible-on-june-10-from-uk-canada-and-greenland/", "urlToImage": "https://i1.wp.com/www.eurasiareview.com/wp-content/uploads/2021/06/a-61.jpg?fit=800%2C450&ssl=1", "publishedAt": "2021-06-06T22:07:24Z", "content": "An annular eclipse of the Sun will take place on June 10, visible from Canada, Greenland, the Arctic Ocean and Siberia. In the UK and Ireland observers will see a partial solar eclipse, with up to tw… [+1716 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Growth in New Zealand's art sector a silver lining of the pandemic - Stuff.co.nz", "description": "OPINION: As countries across Asia actively invest in the arts, New Zealand has the opportunity to benefit from being part of the fastest-growing art market in the world.", "url": "https://www.stuff.co.nz/business/opinion-analysis/300324889/growth-in-new-zealands-art-sector-a-silver-lining-of-the-pandemic", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/r/q/g/x/image.related.StuffLandscapeSixteenByNine.1420x800.4yt061.png/1622777063702.jpg", "publishedAt": "2021-06-06T17:00:00Z", "content": "OPINION: The past 18 months have brought the value of the arts into sharp relief. With international travel restricted, we have relied on books, screens, music, the theatre and galleries to transport… [+5700 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Josh Atkinson", "title": "A girl in a polo shirt and Samsung devices - goes crazy with Sam on the internet - SwordsToday.ie", "description": "A girl in a polo shirt and Samsung devices - goes crazy with Sam on the internet Anastasia Klimova June 6, 2021 14:20 UTC Recently, the ideas of a girl in", "url": "https://swordstoday.ie/a-girl-in-a-polo-shirt-and-samsung-devices-goes-crazy-with-sam-on-the-internet/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/06/A-girl-in-a-polo-shirt-and-Samsung-devices.jpg", "publishedAt": "2021-06-06T12:23:29Z", "content": "Recently, the ideas of a girl in a polo shirt with the Samsung Galaxy logo and branded accessories appeared on the internet. It was created by Lightform Studio – who posted the photos on their websit… [+1126 chars]"}, {"source": {"id": null, "name": "The-afc.com"}, "author": "AFC", "title": "Asian Qualifiers – Group G Preview: Vietnam return to action against Indonesia, UAE locks horns with Thailand | Football | News | Asian Qualifiers 2022 - The Official Home of Asian Football", "description": "Dubai: A heated matchday in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023 awaits as Vietnam, the UAE and Thailand all go into their Monday games with a chance of being top of the group by end of the night.", "url": "https://www.the-afc.com/competitions/afc-asian-cup/news/asian-qualifiers-group-g-preview-vietnam-return-to-action-against-indonesia-uae-", "urlToImage": "https://www.the-afc.com/img/image/upload/t_l10/v1622926951/fop2dvcumzzdodkaj0mo.jpg", "publishedAt": "2021-06-06T10:06:17Z", "content": "Dubai: A heated matchday in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023 awaits as Vietnam, the UAE and Thailand all go into their Monday games with … [+3207 chars]"}]}