{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Ripplesnigeria.com"}, "author": "Ripples Nigeria", "title": "Korra Obidi: Social media divided over timing of husband’s divorce announcement - Ripples Nigeria", "description": "Nigerian entertainment polymath, Korra Obidi has continued to top the trending list on the social media platform, Twitter in the last 48 hours since her Caucasian husband, Dr. Justin Dean, a chiropractor shockingly announced that he was getting a divorce. The…", "url": "https://www.ripplesnigeria.com/korra-obidi-social-media-divided-over-timing-of-husbands-divorce-announcement/", "urlToImage": "https://i0.wp.com/www.ripplesnigeria.com/wp-content/uploads/2022/03/Justin-Dean.jpeg?resize=650%2C350&ssl=1", "publishedAt": "2022-03-12T09:27:01Z", "content": "Nigerian entertainment polymath, Korra Obidi has continued to top the trending list on the social media platform, Twitter in the last 48 hours since her Caucasian husband, Dr. Justin Dean, a chiropra… [+5523 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Capital A rejected RM500m Danajamin loan due to unreasonable terms, says CEO Tony Fernandes - The Edge Markets MY", "description": "KUALA LUMPUR (March 11): Tan Sri Tony Fernandes, chief executive officer of Capital A Bhd (formerly known as AirAsia Group Bhd), has clarified that the group decided not to proceed with a club facility of up to RM500 million under the Danajamin Prihatin Guara…", "url": "https://www.theedgemarkets.com/article/capital-rejected-rm500m-danajamin-loan-due-unreasonable-terms-says-ceo-tony-fernandes", "urlToImage": "https://assets.theedgemarkets.com/MSY_8415-Fernandes-Shahrin-Yahya_202202101046571234_theedgemarkets.jpg?XRkZEedKjagsYS05MmkMkwa37agS6SfO", "publishedAt": "2022-03-11T11:05:08Z", "content": "KUALA LUMPUR (March 11): Tan Sri Tony Fernandes, chief executive officer of Capital A Bhd (formerly known as AirAsia Group Bhd), has clarified that the group decided not to proceed with a club facili… [+3674 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Sezairi celebrates becoming first Singapore artiste to hit 100 million streams on Spotify - Channel NewsAsia", "description": "In an Instagram post announcing the news, the local singer said he wrote It’s You “with the conscious thought that I wanted to turn my life around and be a better person, husband, lover and human being”.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/sezairi-its-you-spotify-100-million-streams-307011", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--XG4L_u75--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/sezairi---1872186.jpg?itok=E7babeZv", "publishedAt": "2022-03-11T04:17:00Z", "content": "Local singer Sezairi Sezali had a big announcement to make earlier this week. In a social media post on Monday (Mar 7), he wrote that he was the first Singapore artist to have 100 million streams for… [+533 chars]"}]}