{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Single's Inferno: Who are the couples supposedly dating in real life after the series? - AsiaOne", "description": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. Well, we might just have an answer after all, thanks to the detective w…", "url": "https://www.asiaone.com/entertainment/netflix-singles-inferno-who-are-couples-dating-an-yea-won-cha-hyun-seung-oh-jin-taek-kang-so-yeon", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/100122_Singles%20Inferno%20couples_IG.jpg?h=79e3e4c1&itok=Cmr0eyzY", "publishedAt": "2022-01-10T12:00:00Z", "content": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. \r\nWell, we … [+3088 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I didn't dare let my classmates know mum is a celebrity, says Chen Xiuhuan's daughter Shanisse - AsiaOne", "description": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmates to know. The 24-year-old made that revelation while speaki…", "url": "https://www.asiaone.com/entertainment/i-didnt-dare-let-my-classmates-know-my-mum-celebrity-says-chen-xiuhuan-daughter-shanisse", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/shanisse-chenxiuhuan_IG.jpg?h=05d90210&itok=IuhIcEQY", "publishedAt": "2022-01-10T10:30:00Z", "content": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmate… [+2966 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore committed to reopening borders even as Omicron spreads - The Star Online", "description": "Singapore is committed to steadily reopening its borders and aims to set up more quarantine-free travel agreements, Transport Minister S. Iswaran said in Parliament on Monday as the Asian country battles a rising number of coronavirus cases.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/01/10/singapore-committed-to-reopening-borders-even-as-omicron-spreads", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/01/10/1438547.jpg", "publishedAt": "2022-01-10T08:43:00Z", "content": "SINGAPORE, Jan 10 (Bloomberg): Singapore is committed to steadily reopening its borders and aims to set up more quarantine-free travel agreements, Transport Minister S. Iswaran said in Parliament on … [+1935 chars]"}]}