{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "EU pledges $10bn investment in Southeast Asia during ASEAN summit - Al Jazeera English", "description": "Brussels hosts the leaders of Southeast Asian countries in the face of the Ukraine war and challenges from China.", "url": "https://www.aljazeera.com/news/2022/12/14/eu-pledges-10bn-investment-in-southeast-asia-during-asean-summit", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/12/000_333N6W6.jpg?resize=1200%2C675", "publishedAt": "2022-12-14T15:13:30Z", "content": "The EU has promised billions of dollars of investment in Southeast Asia, as leaders looked to bolster ties at a summit in the face of the Ukraine war and challenges from China.\r\nThe European Union ho… [+3514 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": null, "title": "Homicide complaint filed against cop in Maasin, Southern Leyte slay - Rappler", "description": "Human Rights Watch Asia senior researcher Carlos Conde says the family of Gilbert Ranes 'deserves justice, and a thorough and impartial investigation should be undertaken into his apparent wrongful death in police custody'", "url": "https://www.rappler.com/nation/visayas/homicide-complaint-filed-cop-maasin-southern-leyte-killing/", "urlToImage": "https://www.rappler.com/tachyon/2022/12/Leyte-Police-Hector-Enage.jpg", "publishedAt": "2022-12-14T08:06:16Z", "content": "A Special Investigation Task Group (SITG) will probe the involvement of cops in the December 9 killing of 34-year-old theft suspect Gilbert Ranes in Maasin City, Southern Leyte, the Philippine Nation… [+4910 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Desmond Tan seeks advice from fans after laptop and all cash stolen in Italy, gets victim-blamed - AsiaOne", "description": "When misfortune strikes in a foreign country, where and who can you turn to for help? Desmond Tan revealed in an Instagram Story on Monday (Dec 12) night that his belongings were stolen while on holiday. \"My backpack just got stolen from me on a train in Ital…", "url": "https://www.asiaone.com/entertainment/desmond-tan-seeks-advice-fans-after-laptop-and-all-cash-stolen-italy-gets-victim-blamed", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/141222_desmondtan_insta.jpg?h=83ba74cd&itok=mcDuoyyY", "publishedAt": "2022-12-14T07:37:53Z", "content": "When misfortune strikes in a foreign country, where and who can you turn to for help? \r\nDesmond Tan revealed in an Instagram Story on Monday (Dec 12) night that his belongings were stolen while on ho… [+3270 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Multi-sensory funhouse 29Rooms is coming to Gardens by the Bay with a toilet room, 'make a mess' room and more - Channel NewsAsia", "description": "The pioneer of the selfie museum, known for collaborating with artistes like Lizzo, Margot Robbie and Jake Gyllenhaal, is landing in Singapore for its first event outside North America. Here's what to expect.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/29-rooms-asia-singapore-experiential-immersive-instagrammable-funhouse-343331", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--a-U_D7sE--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/12/14/29rooms.jpg?itok=MFDHauwQ", "publishedAt": "2022-12-14T00:00:33Z", "content": "29Rooms will be making its Asia debut here in Singapore in February, featuring 29 themed rooms such as an all-white living room that visitors can slap some paint around in; an insomnia room made of m… [+831 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Come in and choose, I'll foot the bill': Jay Chou 'suan' Taiwan paparazzi trailing him and wife at Chanel - AsiaOne", "description": "When you're rich like Jay Chou, you can certainly throw money at the problem. According to media reports, the King of Mandopop had a humourous response to the paparazzi who were trailing him and his wife Hannah Quinlivan while they were shopping at Chanel. Re…", "url": "https://www.asiaone.com/entertainment/come-and-choose-ill-foot-bill-jay-chou-suan-taiwan-paparazzi-trailing-him-and-wife", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/jaychou_IG.jpg?h=5ec9f416&itok=7uoZ5pZj", "publishedAt": "2022-12-13T05:44:00Z", "content": "When you're rich like Jay Chou, you can certainly throw money at the problem.\r\nAccording to media reports, the King of Mandopop had a humourous response to the paparazzi who were trailing him and his… [+1691 chars]"}]}