{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Straits Times"}, "author": "EUNICE QUEK", "title": "Six Singapore bars on World's 50 Best Bars list, Jigger & Pony retains No. 9 spot - The Straits Times", "description": "Singapore has the most number of bars in the list but it no longer holds the honour of having The Best Bar in Asia.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/life/food/six-singapore-bars-on-worlds-50-best-bars-list-jigger-pony-retains-no-9-spot", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/12/08/dw-bars-jigger-211208.jpg?itok=FYzO_vpf", "publishedAt": "2021-12-07T23:27:34Z", "content": "SINGAPORE - Six Singapore bars are on this year's World's 50 Best Bars list - the most for any city - but the Republic no longer holds the honour of having The Best Bar in Asia.\r\nAtlas at Parkview Sq… [+3545 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "World Bank raises PHL growth forecast to 5.3% - BusinessWorld Online", "description": "THE WORLD BANK raised its Philippine growth forecast for this year to 5.3% following the economy’s faster-than-expected expansion in the third quarter, it said in its East Asia and the Pacific (EAP) economic update report released on Tuesday.", "url": "https://www.bworldonline.com/world-bank-raises-phl-growth-forecast-to-5-3/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/12/Flags.jpg", "publishedAt": "2021-12-07T16:32:17Z", "content": "THE WORLD BANK raised its Philippine growth forecast for this year to 5.3% following the economys faster-than-expected expansion in the third quarter, it said in its East Asia and the Pacific (EAP) e… [+2930 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "CEO sacks 900 employees via Zoom call right before holiday season - AsiaOne", "description": "Imagine this — it's almost Christmas, you're working from home and you're invited to a Zoom call from your boss with your colleagues. Instead of an early holiday greeting, though, you get the boot. 900 employees faced this scenario when digital mortgage compa…", "url": "https://www.asiaone.com/world/ceo-sacks-900-employees-zoom-call-right-holiday-season", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/bettercomzoomfire_tiktok_0.jpg?h=0429cc9e&itok=Yr-xkbpx", "publishedAt": "2021-12-07T05:44:00Z", "content": "Imagine this it's almost Christmas, you're working from home and you're invited to a Zoom call from your boss with your colleagues. Instead of an early holiday greeting, though, you get the boot.\r\n90… [+1405 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Ousted Myanmar leader Suu Kyi gets jail sentence halved to 2 years - The Star Online", "description": "BANGKOK (The Straits Times/Asia News Network): Myanmar’s deposed state counsellor Aung San Suu Kyi has had her jail sentence reduced from four years to two years after a partial pardon by the chief of the military junta, the country’s state television reporte…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/12/07/ousted-myanmar-leader-suu-kyi-gets-jail-sentence-halved-to-2-years", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/07/1395915.jpg", "publishedAt": "2021-12-07T02:09:00Z", "content": "BANGKOK (The Straits Times/Asia News Network): Myanmars deposed state counsellor Aung San Suu Kyi has had her jail sentence reduced from four years to two years after a partial pardon by the chief of… [+4029 chars]"}]}