{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Businessnewsasia.com"}, "author": "Business News Asia, Business News Asia", "title": "Globe transfers another 750 towers to Frontier Towers - BusinessNewsAsia.com - Business News Asia", "description": "Globe, a digital platform in the Philippines with major interests in telecommunications, financial technology, digital marketing solutions, venture capital funding, data insight services, virtual healthcare and providing support to entertainment, announced to…", "url": "https://www.businessnewsasia.com/2022121252358719-globe-transfers-another-750-towers-to-frontier-towers/", "urlToImage": "https://www.businessnewsasia.com/wp-content/uploads/2022/12/Screen-Shot-2022-12-12-at-10.59.54-AM.png", "publishedAt": "2022-12-12T03:01:24Z", "content": "Globe, a digital platform in the Philippines with major interests in telecommunications, financial technology, digital marketing solutions, venture capital funding, data insight services, virtual hea… [+2371 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'They were trying to drag me out of the bed': Man recalls 'strange encounters' in ICU after open-heart surgery - AsiaOne", "description": "It's probably safe to say the intensive care unit (ICU) is a place most of us hope to never land in. One former patient shared his uncomfortable two-day experience in an ICU ward at a local hospital following his open heart surgery — but not for reasons you m…", "url": "https://www.asiaone.com/singapore/they-were-trying-drag-me-out-bed-man-recalls-strange-encounters-icu-after-open-heart", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/paranormal-main.jpeg?h=7d3a4ad9&itok=f-6ufhto", "publishedAt": "2022-12-11T06:19:00Z", "content": "It's probably safe to say the intensive care unit (ICU) is a place most of us hope to never land in.\r\nOne former patient shared his uncomfortable two-day experience in an ICU ward at a local hospital… [+2597 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Money-saving hack? Diners paying for CNY reunion meals in advance to avoid 1% GST increase next year - AsiaOne", "description": "Here's one way to save money for the upcoming Chinese New Year, especially if you intend to eat out at restaurants. Shin Min Daily News reported that diners in Singapore are choosing to pay for their pre-booked reunion dinners upfront to avoid footing the add…", "url": "https://www.asiaone.com/lifestyle/money-saving-hack-diners-paying-cny-reunion-meals-advance-avoid-1-gst-increase-next-year", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/reunion-zaobao.jpeg?h=c979e39b&itok=uxxmmBlu", "publishedAt": "2022-12-11T04:38:00Z", "content": "Here's one way to save money for the upcoming Chinese New Year, especially if you intend to eat out at restaurants.\r\nShin Min Daily News reported that diners in Singapore are choosing to pay for thei… [+3217 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": "Correspondent", "title": "Temasek-backed crypto company Amber Group rumored next to fall but company says it's \"business as usual\" - The Online Citizen Asia", "description": "The Online Citizen Asia Temasek-backed crypto company Amber Group rumored next to fall but company says it's \"business as usual\" International", "url": "https://www.theonlinecitizen.com/2022/12/10/temasek-backed-crypto-company-amber-group-rumored-next-to-fall-but-company-says-its-business-as-usual/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2022/12/Amber-temasek.png", "publishedAt": "2022-12-10T08:36:49Z", "content": "It was earlier reported that the co-founder of cryptocurrency company Amber Group, Tiantian Kullander, was found dead in his sleep last month (23 Nov 2022), 9 months after Singapore’s Temasek Holding… [+5212 chars]"}]}