{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Manilastandard.net"}, "author": null, "title": "Tune in to Shopee 8.8 Mega Flash Sale TV Special to win up to ₱8 million worth of prizes - manilastandard.net", "description": "Shopee, the leading e-commerce platform in Southeast Asia and Taiwan, invites Filipinos to tune in to the Shopee 8.8 Mega Flash Sale TV Special on GMA-7 and Shopee Live today at 10:00 a.m. to 12:00nn.", "url": "https://manilastandard.net/index.php/showbitz/tv-movies/361767/tune-in-to-shopee-8-8-mega-flash-sale-tv-special-to-win-up-to-8-million-worth-of-prizes.html", "urlToImage": "https://manilastandard.net/panel/_files/modbuild/wp-images/wp-content/uploads/2021/08/3251d_shopee.jpg", "publishedAt": "2021-08-07T16:00:00Z", "content": "6th Floor Universal Re Bldg., 106 Paseo De Roxas cor. Perea Street, Legaspi Village, 1226 Makati City Philippines\r\nTrunklines: 832-5554, 832-5556, 832-5558"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Once largely Covid-19 free, Asia economies are now upended by Delta variant virus - The Star Online", "description": "The delta variant is challenging the part of the world that’s been most successful in blunting the economic impact of Covid-19, with Asian countries that snuffed it out locking down again as the virus returns, and others seeing the world’s highest death rates.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/08/07/once-largely-covid-19-free-asia-economies-are-now-upended-by-delta-variant-virus", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/08/07/1248338.jpg", "publishedAt": "2021-08-07T10:19:00Z", "content": "SINGAPORE, Aug 7 (Bloomberg): The delta variant is challenging the part of the world thats been most successful in blunting the economic impact of Covid-19, with Asian countries that snuffed it out l… [+7818 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Kris Wu accused of drugging and raping Los Angeles-based woman, could face charges in the US - AsiaOne", "description": "LOS ANGELES - A Los Angeles-based woman has come forward to allege she was drugged and raped by Chinese-Canadian star Kris Wu, who was arrested last week in Beijing on rape charges. More than 24 women in China have since come forward with similar stories of b…", "url": "https://www.asiaone.com/entertainment/kris-wu-accused-drugging-and-raping-los-angeles-based-woman-could-face-charges-us", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/kris_ig.jpg?h=2e181f1f&itok=g7SQ__Mo", "publishedAt": "2021-08-07T07:45:41Z", "content": "LOS ANGELES - A Los Angeles-based woman has come forward to allege she was drugged and raped by Chinese-Canadian star Kris Wu, who was arrested last week in Beijing on rape charges.\r\nMore than 24 wom… [+1765 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Your whole family will die': Shopee seller allegedly threatens customer who requested refund - AsiaOne", "description": "When you receive items you bought online that do not meet your expectations, what do you do? Most of us request an exchange or refund. Stomp contributor Ethan shared how he was threatened by a seller on e-commerce platform Shopee after requesting a refund for…", "url": "https://www.asiaone.com/singapore/your-whole-family-will-die-shopee-seller-allegedly-threatens-customer-who-requested", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_311.jpg?h=1a780d9c&itok=KrdSXvCm", "publishedAt": "2021-08-07T06:34:29Z", "content": "When you receive items you bought online that do not meet your expectations, what do you do?\r\nMost of us request an exchange or refund.\r\nStomp contributor Ethan shared how he was threatened by a sell… [+608 chars]"}]}