{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "France's Macron hosts Tajik leader for talks on Afghanistan - Guardian", "description": "French President Emmanuel Macron hosted Tajikistan’s leader for rare talks on Wednesday, vowing to help the Central Asian state as it deals with the aftermath of the Taliban takeover of neighbouring Afghanistan. The invitation to the Elysee Palace — a rare ho…", "url": "https://editor.guardian.ng/news/world/frances-macron-hosts-tajik-leader-for-talks-on-afghanistan/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/07/000_9ET9BP-scaled.jpg", "publishedAt": "2021-10-13T14:23:00Z", "content": "French President Emmanuel Macron hosted Tajikistan’s leader for rare talks on Wednesday, vowing to help the Central Asian state as it deals with the aftermath of the Taliban takeover of neighbouring … [+1595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Neha Banka", "title": "In Netflix’s ‘Squid Game’, an insight into desperate lives of South Korea’s South Asian migrant workers - The Indian Express", "description": "For many viewers of Netflix's 'Squid Game', Ali and his tragic story have come across as surprising coming from South Korea.", "url": "https://indianexpress.com/article/world/squid-game-netflix-south-korea-migrant-workers-7569572/", "urlToImage": "https://images.indianexpress.com/2021/10/IMG-1420.jpg", "publishedAt": "2021-10-13T11:49:41Z", "content": "When 38-year-old Shakir Khan watched the character of Ali Abdul, a factory worker from Pakistan in the South Korean survival drama Squid Game, it was like he was watching his own story play out in fr… [+11577 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "2409 travellers from eight countries approved to enter Singapore under Vaccinated Travel Lane - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): More than 2,000 travellers have been granted a pass to enter Singapore under a quarantine-free travel scheme, after the first day of applications opening for visitors from eight countries.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/13/2409-travellers-from-eight-countries-approved-to-enter-singapore-under-vaccinated-travel-lane", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/13/1329592.jpg", "publishedAt": "2021-10-13T06:24:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): More than 2,000 travellers have been granted a pass to enter Singapore under a quarantine-free travel scheme, after the first day of applications open… [+1975 chars]"}]}