{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Chia Han Keong", "title": "Liverpool could make their way to Singapore for pre-season tour in July - Yahoo Singapore News", "description": "Liverpool are in talks to play two lucrative pre-season friendlies in Southeast Asia: against Manchester United in Bangkok, and against Crystal Palace in...", "url": "https://sg.news.yahoo.com/liverpool-singapore-pre-season-tour-july-103040601.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/IYZ7mYv2TE6cONpLF.CzFw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04NDQ-/https://s.yimg.com/os/creatr-uploaded-images/2022-02/28f57cf0-8d80-11ec-8faf-67684171ba35", "publishedAt": "2022-02-14T10:30:40Z", "content": "Liverpool players celebrate scoring against Leicester City in their English Premier League clash. (PHOTO: Reuters/Craig Brough)\r\nSINGAPORE Fans of English giants Liverpool in Singapore could get to s… [+1525 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "iPhone SE3 lands on Eurasian Economic Commission (EEC) database - Gizchina.com", "description": "iPhone SE3 lands on Eurasian Economic Commission (EEC) database. These devices come with model numbers A2595, A2783, and A2784.", "url": "https://www.gizchina.com/2022/02/14/iphone-se3-lands-on-eurasian-economic-commission-eec-database/", "urlToImage": "https://www.gizchina.com/wp-content/uploads/images/2020/09/20200918_214802_834.jpeg", "publishedAt": "2022-02-14T10:17:33Z", "content": "Over the past few weeks, there have been several speculations regarding the iPhone SE3. The company will officially release this smartphone at its upcoming spring new product launch conference. Some … [+2148 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Sami Fathi", "title": "Apple Files New Macs in Regulatory Database Ahead of Rumored Spring Event - MacRumors", "description": "Apple has filed three new unreleased Mac computers in the Eurasian Economic Database ahead of when the company is expected to hold a rumored Spring...", "url": "https://www.macrumors.com/2022/02/14/apple-files-new-macs-ahead-spring-event/", "urlToImage": "https://images.macrumors.com/t/Fq6lHhAFVlCGdmLBiPjkhPU3-i0=/3056x/article-new/2021/04/tim-cook-spring-loaded-event.jpg", "publishedAt": "2022-02-14T09:20:28Z", "content": "Apple has filed three new unreleased Mac computers in the Eurasian Economic Database ahead of when the company is expected to hold a rumored Spring event on or around March 8, as first spotted by Con… [+799 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Dennis Gutierrez", "title": "Legarda still among top choice in latest Pulse Asia senatorial survey - INQUIRER.net", "description": "Senatorial candidate Loren Legarda maintains her hold on the third spot in the latest Pulse Asia senatorial survey released on Sunday.\r\n\r\nBased the survey conducted from January 19 to 24, Legarda,", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/02/Screen-Shot-2022-02-14-at-2.39.09-PM-620x411.png", "publishedAt": "2022-02-14T06:42:00Z", "content": "Three-term senator and Antique Congresswoman Loren Legarda during her kick-off campaign at the Lieberman Gymnasium in the Municipality of Pandan on February 8, 2021.. Contributed photo\r\nSenatorial ca… [+1326 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Stop hurting others' Li Jinglei hits back after Wang Leehom files court motion against her - AsiaOne", "description": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle. A Chinese netizen leaked documents last Friday (Feb 11), re…", "url": "https://www.asiaone.com/entertainment/stop-hurting-others-li-jinglei-hits-back-after-wang-leehom-files-court-motion-against", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/image_434.jpg?h=b82b5380&itok=C0Q4AdYo", "publishedAt": "2022-02-13T08:33:09Z", "content": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle.… [+2244 chars]"}]}