{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Stackedhomes.com"}, "author": null, "title": "We ranked the bottom 10 Singapore districts by appreciation - AsiaOne", "description": "2021 has been rough on first time home buyers, as well as new investors. With property prices rising across the board, you’d be hard-pressed to find discounts, or even just a bigger condo. But property is always about specifics, and there are some districts w…", "url": "https://stackedhomes.com/editorial/we-ranked-the-bottom-10-singapore-districts-by-appreciation-2021/#gs.94e6ws", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210825_Bottom10SingaporeDistrictsRanking_Stackedhomes.jpg?h=0429cc9e&itok=-9uMsHb5", "publishedAt": "2021-08-29T02:45:00Z", "content": "2021 has been rough on first time home buyers, as well as new investors. With property prices rising across the board, youd be hard-pressed to find discounts, or even just a bigger condo.\r\nBut proper… [+15025 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I don't know how long I cried': Dasmond Koh opens up on how he broke down after Aloysius Pang's death - AsiaOne", "description": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him. The boss of Noontalk Media choked up on the latest episode of Hear U Out, a talk show hosted by Quan Yifeng, when he s…", "url": "https://www.asiaone.com/entertainment/i-dont-know-how-long-i-cried-dasmond-koh-opens-how-he-broke-down-after-aloysius-pangs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_1262.jpg?h=72faa102&itok=vxK5MmfZ", "publishedAt": "2021-08-29T01:43:58Z", "content": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him.\r\nThe boss of Noontalk Media choked up on the latest episod… [+1490 chars]"}]}