{"articles": [{"author": "Jamaine Punzalan, ABS-CBN News", "content": "MANILA — About 6 in 10 Filipinos are reluctant to get vaccinated against COVID-19, according to a survey released by Pulse Asia on Friday, as the Philippines continued to battle a surge in coronaviru… [+1978 chars]", "description": "About 6 in 10 Filipinos are reluctant to get vaccinated against COVID-19, according to a survey released by Pulse Asia on Friday, as the Philippines continued to battle a surge in coronavirus infections.", "publishedAt": "2021-03-26T10:09:00Z", "source": {"id": null, "name": "Abs-cbn.com"}, "title": "6 in 10 Filipinos hesitant to get vaccinated vs COVID-19: survey - ABS-CBN News", "url": "https://news.abs-cbn.com/news/03/26/21/6-in-10-filipinos-hesitant-to-get-vaccinated-vs-covid-19-survey", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/news/03/26/20210323-covid19-vaccine-qc-frontliners-jc-33.jpg"}, {"author": null, "content": "First, the tune stirred patriotic feelings in schoolchildren in India. Now, Count On Me, Singapore appears to have taken a spiritual turn.\r\nDays ago, netizens discovered another dupe of Singapore's b… [+1582 chars]", "description": "First, the tune stirred patriotic feelings in schoolchildren in India. Now, Count On Me, Singapore appears to have taken a spiritual turn. Days ago, netizens discovered another dupe of Singapore's beloved 1986 National Day song on the internet. Titled We Have…", "publishedAt": "2021-03-25T08:50:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Download track for 70 cents: Count On Me, Singapore gets turned into spiritual song in India - AsiaOne", "url": "https://www.asiaone.com/singapore/download-track-70-cents-count-me-singapore-gets-turned-spiritual-song-india", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/wehaveavision.jpg?h=0429cc9e&itok=TbeU9zQq"}], "message": "Successful api call", "number_of_news": 2, "status": 200, "topic": "asia"}