{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "ARNnet"}, "author": null, "title": "Orchestra Group conducts first APAC distie deal with emt Distribution - Reseller News", "description": "Cyber security vendor Orchestra Group has signed its first distribution agreement for Australia, New Zealand and Asia Pacific with emt Distribution, expanding its reach in the process.", "url": "https://www.arnnet.com.au/article/687548/emt-to-conduct-first-orchestra-distribution-for-apac/", "urlToImage": "https://d2bs8hqp6qvsw6.cloudfront.net/article/images/800x800/dimg/richard_rundle2.jpg", "publishedAt": "2021-04-12T06:38:36Z", "content": "Richard Rundle (emt Distribution)\r\nCredit: Supplied \r\nCyber security vendor Orchestra Group has signed its first distribution agreement for Australia, New Zealand and Asia Pacific with emt Distributi… [+1838 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Mr Heng cites his age for resigning while PAP Govt raised retirement age for people to work older - The Online Citizen Asia", "description": "The Online Citizen Asia Mr Heng cites his age for resigning while PAP Govt raised retirement age for people to work older Opinion", "url": "https://www.theonlinecitizen.com/2021/04/12/mr-heng-cites-his-age-for-resigning-while-pap-govt-raised-retirement-age-for-people-to-work-older/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/02/heng-swee-keat1.png", "publishedAt": "2021-04-12T03:36:35Z", "content": "On Thursday (8 Apr), Minister for Finance and Deputy Prime Minister, Heng Swee Keat made a statement that shocked the public. In an announcement that seemed to come from nowhere, Mr Heng said that he… [+2763 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Vaccinated migrant worker among 20 new Covid-19 cases in Singapore - AsiaOne", "description": "SINGAPORE - A 23-year-old Indian work permit holder who had received both doses of Covid-19 vaccination was the sole locally transmitted case, the Ministry of Health (MOH) reported on Sunday. The man, who works as a lashing specialist, was one of 20 new coron…", "url": "https://www.asiaone.com/singapore/vaccinated-migrant-worker-among-20-new-covid-19-cases-singapore", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_417.jpg?h=199d8c1f&itok=r8dy-LZb", "publishedAt": "2021-04-12T00:03:08Z", "content": "SINGAPORE - A 23-year-old Indian work permit holder who had received both doses of Covid-19 vaccination was the sole locally transmitted case, the Ministry of Health (MOH) reported on Sunday.\r\nThe ma… [+1614 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Taiwan actor Patrick Lee hits back at bullying allegations by co-star Elvin Ng: 'Where is the logic?' - AsiaOne", "description": "Taiwanese actor-model Patrick Lee has hit back at allegations that he had bullied Singaporean actor Elvin Ng when they were on the set of 2018 Mediacorp drama Gifted. Ng, 40, revealed on talk show The Inner Circle last week that he was antagonised by one of h…", "url": "https://www.asiaone.com/entertainment/actor-patrick-lee-hits-back-bullying-allegations-co-star-elvin-ng", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_404.jpg?h=199d8c1f&itok=hqWb7PNB", "publishedAt": "2021-04-11T00:35:46Z", "content": "Taiwanese actor-model Patrick Lee has hit back at allegations that he had bullied Singaporean actor Elvin Ng when they were on the set of 2018 Mediacorp drama Gifted.\r\nNg, 40, revealed on talk show T… [+1535 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "PH to Asean: Sea code of conduct ‘imperative’ – The Manila Times - The Manila Times", "description": "THE Philippines said it was “imperative” for the Association of Southeast Asian Nations (Asean) to adopt a “Code of Conduct in the South China Sea (SCS) whereby all parties, including China, accept restraints.” The Philippines, through Foreign Affairs Secreta…", "url": "https://www.manilatimes.net/2021/04/11/news/national/ph-to-asean-sea-code-of-conduct-imperative/862519/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2019/01/201018_locsin2.jpg", "publishedAt": "2021-04-10T16:11:02Z", "content": "THE Philippines said it was imperative for the Association of Southeast Asian Nations (Asean) to adopt a Code of Conduct in the South China Sea (SCS) whereby all parties, including China, accept rest… [+2367 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "TAN TAM MEI", "title": "Asian nations face new infection waves as Covid-19 variants wreck attempts to stem virus - The Straits Times", "description": "The emergence of more virulent strains can be blamed for fuelling fresh spikes in infections.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/se-asia/asian-nations-face-new-infection-waves-as-covid-19-variants-wreck-attempts-to-stem", "urlToImage": "https://www.straitstimes.com/s3/files/styles/x_large/public/articles/2021/04/10/yq-indcov-10042021.jpg?itok=UnGlJA_i", "publishedAt": "2021-04-10T06:47:37Z", "content": "SINGAPORE - After a period of success in containing Covid-19 infections, some countries in Asia are once again beating back an emergence of Covid-19 that has infected over 130 million people worldwid… [+4471 chars]"}]}