{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Russia’s Nuclear-Capable Iskander Missiles, That Threatens The Whole Of Europe, Fizzling Out In Ukraine War - EurAsian Times", "description": "Russian Iskander missiles are failing to hit their intended targets, according to the Ukrainian military. The Ukrainian air defenses effectively intercepted and neutralized all ten missiles launched by Russia on the night of June 1. Patriot Missiles: Like The…", "url": "https://eurasiantimes.com/russias-nuclear-capable-iskander-missiles-that-threatens-the/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2023/05/Iskander-Ballistic.jpg", "publishedAt": "2023-06-05T05:11:08Z", "content": "Russian Iskander missiles are failing to hit their intended targets, according to the Ukrainian military. The Ukrainian air defenses effectively intercepted and neutralized all ten missiles launched … [+5440 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "India's services growth defies inflation pressures - The Economic Times", "description": "The S&P Global India services Purchasing Managers' Index fell to 61.2 in May from 62.0 in April, but outstripped the Reuters poll expectation of 60.0. The services sector accounts for more than 50% of India's gross domestic product. Asia's third-largest econo…", "url": "https://economictimes.indiatimes.com/news/economy/indicators/indias-services-growth-defies-inflation-pressures/articleshow/100756539.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100756550,width-1070,height-580,imgsize-158336,overlay-economictimes/photo.jpg", "publishedAt": "2023-06-05T05:08:00Z", "content": "Growth in India's dominant services sector activity slowed slightly last month but held at a firm pace as demand remained strong despite high inflationary pressures, a business survey showed on Monda… [+2473 chars]"}]}