{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Sudhi Ranjan Sen, Peter Martin, Iain Marlow", "title": "Modi’s Embrace of Putin Irks Biden Team Pushing Support for Kyiv - Bloomberg", "description": "Indian Prime Minister Narendra Modi’s embrace of Vladimir Putin on the eve of President Joe Biden’s pivotal NATO summit in Washington has frustrated US officials who have made closer ties with the Asian nation a cornerstone of their foreign policy.", "url": "https://www.bloomberg.com/news/articles/2024-07-11/modi-and-putin-s-bear-hug-irks-biden-officials-pushing-india-to-support-ukraine", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ihvrbn0mb55o/v0/1200x815.jpg", "publishedAt": "2024-07-11T03:42:00Z", "content": "Indian Prime Minister Narendra Modis embrace of Vladimir Putin on the eve of President Joe Bidens pivotal NATO summit in Washington has frustrated US officials who have made closer ties with the Asia… [+480 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Aparna Deb", "title": "Stocks To Watch: TCS, Nykaa, Yes Bank, SBI, Tata Elxsi, Power Grid, Asian Paints, And Others - News18", "description": "Stocks to watch: Shares of firms like TCS, Nykaa, Yes Bank, SBI, Tata Elxsi, Power Grid, Asian Paints, and others will be in focus on Thursday's trade.", "url": "https://www.news18.com/business/markets/stocks-to-watch-tcs-nykaa-yes-bank-sbi-tata-elxsi-power-grid-asian-paints-and-others-8961429.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2024/06/top-december-retail-stock-picks-point-to-the-rise-of-the-informed-investor-2024-06-4ab77c196399184c5de22ff7f67539cd-16x9.jpg?impolicy=website&width=1200&height=675", "publishedAt": "2024-07-11T02:21:50Z", "content": "Stocks To Watch: Markets fluctuated sharply within a range and ended up losing nearly half a percent on Wednesday, wiping out the gains from the preceding session. In todays trade, shares of Nykaa, T… [+3776 chars]"}]}