{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "CNA"}, "author": "Lianne Chia", "title": "Underpaid and overworked, Philippine nurses would rather walk away than work at home - CNA", "description": "They are a familiar sight in hospitals round the world, yet their country faces a nursing shortage. COVID-19 has exposed a healthcare system in the Philippines that is failing its nurses, and the programme Undercover Asia looks at the issues.", "url": "https://www.channelnewsasia.com/news/cnainsider/underpaid-overworked-philippines-nurses-hospitals-shortage-covid-14640028", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14640392/16x9/991/557/e8030e81a3b1743a05e5fabf0cd4aeb/Wi/ua-philippines-nurses-main.png", "publishedAt": "2021-04-17T22:18:19Z", "content": "MANILA: The video images are grainy, but Philippine nurse Maria Theresa Cruz stands out from her colleagues as she cheers and hugs those who have returned after recovering from COVID-19.\r\nThe contras… [+10537 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Myanmar junta chief to attend ASEAN summit in first foreign trip since coup - The Star Online", "description": "(Reuters) -Myanmar junta chief Min Aung Hlaing will attend an Association of Southeast Asian Nations (ASEAN) summit in Indonesia on April 24, Thailand said on Saturday, for his first known foreign trip since he seized power on Feb. 1.", "url": "https://www.thestar.com.my/news/world/2021/04/17/myanmar-junta-chief-to-attend-asean-summit-on-first-foreign-trip-since-coup", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/17/1117398.JPG", "publishedAt": "2021-04-17T08:11:00Z", "content": "(Reuters) -Myanmar junta chief Min Aung Hlaing will attend an Association of Southeast Asian Nations (ASEAN) summit in Indonesia on April 24, Thailand said on Saturday, for his first known foreign tr… [+4291 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Jumbo HDB flats: Are they worth the price you're paying? - AsiaOne", "description": "Unless you’re living it up in a mega-mansion, homes in Singapore are hardly ever considered sprawling. Both economical and spacious, jumbo HDB flats could be the answer to your space woes.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nLet’s face it, spaciousness is not a term you wou…", "url": "https://www.asiaone.com/money/jumbo-hdb-flats-are-they-worth-price-youre-paying", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210412_jumboflats_st.jpg?h=0429cc9e&itok=6l0xGHRp", "publishedAt": "2021-04-17T08:00:00Z", "content": "Lets face it, spaciousness is not a term you would commonly use to describe HDB flats.\r\nNowadays, wed be lucky if our five-room BTO flat crossed the 110 square-metre threshold. With space in such sho… [+3975 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Thomson Road building to be demolished: Owners of residential units left stunned - AsiaOne", "description": "SINGAPORE - News that a building in Thomson Road will be demolished to allow nearby excavation works to be carried out safely came as a shock to the owners of the 12 residential units there. For months, they and their tenants had engaged with the authorities …", "url": "https://www.asiaone.com/singapore/thomson-road-building-be-demolished-owners-residential-units-left-stunned", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_663.jpg?h=199d8c1f&itok=zt_3bKEe", "publishedAt": "2021-04-17T02:41:00Z", "content": "SINGAPORE - News that a building in Thomson Road will be demolished to allow nearby excavation works to be carried out safely came as a shock to the owners of the 12 residential units there.\r\nFor mon… [+4550 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dye-based device sees the invisible, Business News - AsiaOne", "description": "Tsukuba, Japan, Apr 16, 2021 - (ACN Newswire) - Scientists in Europe have designed an organic dye-based device that can see light waves in the shortwave infrared (SWIR) range. The device is easy to make using cheap materials, and is stable at high temperature…", "url": "https://www.asiaone.com/business/dye-based-device-sees-invisible", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/asiaone_default.jpg?itok=T_ow26qs", "publishedAt": "2021-04-16T11:00:00Z", "content": "Tsukuba, Japan, Apr 16, 2021 - (ACN Newswire) - Scientists in Europe have designed an organic dye-based device that can see light waves in the shortwave infrared (SWIR) range. The device is easy to m… [+3461 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Chen Hanwei deletes post after netizens link it to bullying incident — and other interesting celeb Instagram posts - AsiaOne", "description": "It seems that all the fuss over bullying allegations in our local showbiz scene has died down. (Hey, look at that, just in time for Star Awards 2021!) And it seems that things are rather quiet leading up to the yearly star-studded affair happening this Sunday…", "url": "https://www.asiaone.com/entertainment/chen-hanwei-deletes-post-after-netizens-link-it-bullying-incident-and-other", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210416_chw.jpg?h=bdb0ed81&itok=xDXXYB73", "publishedAt": "2021-04-16T06:12:00Z", "content": "It seems that all the fuss over bullying allegations in our local showbiz scene has died down. (Hey, look at that, just in time for Star Awards 2021!)\r\nAnd it seems that things are rather quiet leadi… [+2701 chars]"}]}