{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Krissy Aguilar", "title": "Duterte to join Nikkei’s Future of Asia confab on post-pandemic recovery - INQUIRER.net", "description": "MANILA, Philippines — President Rodrigo Duterte will join other world leaders at the Nikkei-hosted Future of Asia conference on Friday, May 21.\r\n\r\nThe President is expected to advance the", "url": "https://www.inquirer.net", "urlToImage": "https://globalnation.inquirer.net/files/2020/12/Duterte-at-UN-special-session-on-COVID-19-620x349.jpg", "publishedAt": "2021-05-20T11:38:00Z", "content": "President Rodrigo Duterte will be at Nikkei’s Future of Asia conference this Friday.\r\nMANILA, Philippines President Rodrigo Duterte will join other world leaders at the Nikkei-hosted Future of Asia c… [+1092 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Ashwin Ramarathinam", "title": "Gautam Adani pips Zhong Shanshan to become Asia's second richest person - Mint", "description": "Adani Green Energy on Wednesday announced that it will acquire Softbank’s Indian renewable energy business SB Energy’s 5 GW renewable power portfolio for an enterprise valuation of $3.5 billion", "url": "https://www.livemint.com/news/india/gautam-adani-pips-zhong-shanshan-to-become-asia-s-second-richest-person-11621508846468.html", "urlToImage": "https://images.livemint.com/img/2021/05/20/600x338/71298f1c-8d76-11eb-afe3-8cef4ccbbd72_1618452660151_1621510221232.jpg", "publishedAt": "2021-05-20T11:31:34Z", "content": "MUMBAI: Riding on the back of a strong rally in the stock prices of his group companies over the last many months, billionaire Gautam Adani has moved past Chinas Zong Shanshan to become the second ri… [+2718 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "AirAsia X posts record quarterly loss, eighth in a row - The Star Online", "description": "KUALA LUMPUR (Reuters) - Long-haul budget airline AirAsia X Bhd reported a record loss for the first three months of the year and its eighth quarterly loss in a row as the coronavirus pandemic devastated demand for air travel.", "url": "https://www.thestar.com.my/business/business-news/2021/05/20/airasia-x-posts-record-quarterly-loss-eighth-in-a-row", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/20/1155370.jpg", "publishedAt": "2021-05-20T11:12:00Z", "content": null}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "M1 Now Offers New iPhone 12 and iPhone 12 Mini with 5G in Stunning New Purple - AsiaOne", "description": "Just as Apple unveiled the new purple iPhone 12 and iPhone 12 mini, M1 goes full throttle with its official launch. Its exclusive mobile plan promotions and deals ensure all loyal customers get a fully personalised experience, with multiple base plans and mob…", "url": "https://www.asiaone.com/business/m1-now-offers-new-iphone-12-and-iphone-12-mini-5g-stunning-new-purple", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/Picture1_6.jpg?itok=3l3xZd4D", "publishedAt": "2021-05-20T08:20:00Z", "content": "Just as Apple unveiled the new purple iPhone 12 and iPhone 12 mini, M1 goes full throttle with its official launch. Its exclusive mobile plan promotions and deals ensure all loyal customers get a ful… [+2835 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Alecsandra Tubiera, South China Morning Post", "title": "5 crazy rich Asian weddings of the Philippines - ABS-CBN News", "description": "In the Philippines, there may be no single template for weddings, but they tend to be large and lavish affairs with a deep sense of family and tradition.", "url": "https://news.abs-cbn.com/life/05/20/21/5-crazy-rich-asian-weddings-of-the-philippines", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/life/05/20/weddings.jpg", "publishedAt": "2021-05-20T08:16:00Z", "content": "Wedding celebrations come in many shapes and forms, from simple to splurges. In the Philippines, there may be no single template for weddings, but they tend to be large and lavish affairs with a deep… [+5024 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "PM: Asia should lead in opening up patent protection to produce cheaper life-saving medicines - The Star Online", "description": "KUALA LUMPUR (Bernama): Asia should lead the way in opening up patent protections to produce cheaper generic versions of life-saving medicines for critical diseases, from Covid-19 to HIV/AIDS, said Prime Minister Tan Sri Muhyiddin Yassin.", "url": "https://www.thestar.com.my/news/nation/2021/05/20/pm-asia-should-lead-in-opening-up-patent-protection-to-produce-cheaper-life-saving-medicines", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/20/1154804.jpg", "publishedAt": "2021-05-20T05:27:00Z", "content": "KUALA LUMPUR (Bernama): Asia should lead the way in opening up patent protections to produce cheaper generic versions of life-saving medicines for critical diseases, from Covid-19 to HIV/AIDS, said P… [+3802 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Zimbabwe reports first cases of coronavirus variant from India - News24", "description": "Zimbabwe has detected the first cases of the new coronavirus variant that emerged in India, Vice President Constantino Chiwenga said, adding that all travellers from the Asian nation would be required to undergo mandatory quarantine.", "url": "https://www.news24.com/news24/africa/news/zimbabwe-reports-first-cases-of-coronavirus-variant-from-india-20210519", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3102/f0adf0c5dc184a11bca11effa0705574.jpg", "publishedAt": "2021-05-19T19:52:51Z", "content": "Zimbabwe has detected the first cases of the new coronavirus variant that emerged in India, Vice President Constantino Chiwenga said on Wednesday, adding that all travellers from the Asian nation wou… [+708 chars]"}]}