{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New Nike Unite concept store opens at IMM - AsiaOne", "description": "Tucked in the far west of Singapore, Nike’s brand new retail experience, Nike Unite, has replaced its original factory outlet store. Spanning 18,000 square feet, the store, located at IMM, is the first of its kind in Southeast Asia. As with such firsts, there…", "url": "https://www.asiaone.com/lifestyle/new-nike-unite-concept-store-opens-imm", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211124_ball_nike.jpg?h=0429cc9e&itok=zRmQ5KhJ", "publishedAt": "2021-11-24T03:12:09Z", "content": "Tucked in the far west of Singapore, Nikes brand new retail experience, Nike Unite, has replaced its original factory outlet store.\r\nSpanning 18,000 square feet, the store, located at IMM, is the fir… [+2407 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "PBC eyes SEA Games gold — Bong Coo - BusinessWorld Online", "description": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a decade in the Hanoi tilt in May next year.", "url": "https://www.bworldonline.com/pbc-eyes-sea-games-gold-bong-coo/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/TEAM-Philippines-at-the-2021-IBF-Super-World-Championship.jpg", "publishedAt": "2021-11-23T16:01:25Z", "content": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a… [+1447 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "PH shares soar to 7401, outperform Asian peers - ANC 24/7", "description": "The World Tonight: The Philippine Stock Exchange Index became the best performer in Asia on Tuesday as it shrugged off volatility from US President Joe Biden...", "url": "https://www.youtube.com/watch?v=zsRCMDM0AKA", "urlToImage": "https://i.ytimg.com/vi/zsRCMDM0AKA/maxresdefault.jpg", "publishedAt": "2021-11-23T15:46:41Z", "content": null}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Prepared to be scolded: Shane Pow to act in Mediacorp telemovie, first show after leaving prison - AsiaOne", "description": "Things are picking up for local actor Shane Pow after a terrible year. Besides being a regular livestreamer on Mdada — an online sales platform started by celebrity hairstylist Addy Lee, actress Michelle Chia, and host Pornsak — Shane has signed on to star in…", "url": "https://www.asiaone.com/entertainment/prepared-be-scolded-shane-pow-act-mediacorp-telemovie-first-show-after-leaving-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211123_shane.jpg?h=f74d8d50&itok=_KndRlRk", "publishedAt": "2021-11-23T11:10:00Z", "content": "Things are picking up for local actor Shane Pow after a terrible year.\r\nBesides being a regular livestreamer on Mdada an online sales platform started by celebrity hairstylist Addy Lee, actress Miche… [+1349 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Ancient 'penis worms' in China may have been first to hermit in shells for safety - AsiaOne", "description": "Scientists believe 500-million-year-old fossils found in China from strange-looking sea animals colloquially called “penis worms” might be the earliest known example of a “hermit lifestyle” and may move back the timeline of that evolutionary innovation by hun…", "url": "https://www.asiaone.com/china/ancient-penis-worms-china-may-have-been-first-hermit-shells-safety", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211122_marine_zhang.jpg?h=b3beeda7&itok=iOrVshwW", "publishedAt": "2021-11-22T06:28:10Z", "content": "Scientists believe 500-million-year-old fossils found in China from strange-looking sea animals colloquially called penis worms might be the earliest known example of a hermit lifestyle and may move … [+3488 chars]"}]}