{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Nikkei.com"}, "author": "Staff Writer", "title": "Japan space probe finds water in asteroid for first time - Nikkei Asia", "description": "Confirmation may provide clues to origins of Earth's oceans", "url": "https://asia.nikkei.com/Business/Science/Japan-space-probe-finds-water-in-asteroid-for-first-time", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%253A%252F%252Fs3-ap-northeast-1.amazonaws.com%252Fpsh-ex-ftnikkei-3937bb4%252Fimages%252F9%252F1%252F9%252F3%252F42333919-4-eng-GB%252FCropped-1663866045N%2520Hayabusa2.jpg?width=1260&height=630&fit=cover&gravity=faces&source=nar-cms", "publishedAt": "2022-09-22T18:00:00Z", "content": "TOKYO -- Water has been found in an asteroid sample collected by Japan's Hayabusa2 space probe, marking the first such discovery and shedding light on how the Earth's oceans may have formed.\r\nThe fin… [+225 chars]"}, {"source": {"id": null, "name": "TheSmartLocal"}, "author": "Gwyn Lim", "title": "CompAsia Sells Second-Hand Phones At A Bargain, No Need To Haggle With Handphone Shop YPs For A Good Deal - TheSmartLocal", "description": "If you're not willing to drop thousands on a new phone, check out these CompAsia second-hand phones for a good deal.", "url": "https://thesmartlocal.com/read/compasia-singapore/", "urlToImage": "https://thesmartlocal.com/wp-content/uploads/2022/09/CompAsia-second-hand-phones-cover.jpg", "publishedAt": "2022-09-22T06:15:57Z", "content": "Most of us find ourselves itching to upgrade our phones every few years, but dropping $1k-$2k on a brand new model is a luxury that can be hard to justify. Lucky for us, theres a way to get our hands… [+3519 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I don't blame her, I hurt her too deeply': Recent amputee Duan Weiming on his ex-wife not visiting him in hospital - AsiaOne", "description": "He's going through one of the toughest periods in his life now but he doesn't expect support from his ex-wife as he \"hurt her too deeply\" in the past. In an interview with Shin Min Daily News on Sept 20, local actor Duan Weiming responded to concerned queries…", "url": "https://www.asiaone.com/entertainment/i-dont-blame-her-i-hurt-her-too-deeply-recent-amputee-duan-weiming-his-ex-wife-not-visiting-hospital", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/220922_duanweiming_shinmindaily.jpg?h=0c15b04e&itok=W3wqkLWb", "publishedAt": "2022-09-22T04:53:00Z", "content": "He's going through one of the toughest periods in his life now but he doesn't expect support from his ex-wife as he \"hurt her too deeply\" in the past.\r\nIn an interview with Shin Min Daily News on Sep… [+4401 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Brunei lawyer now a King's Counsel - The Star Online", "description": "BANDAR SERI BEGAWAN (Borneo Bulletin/Asia News Newtwork): Bruneian lawyer and arbitrator, Professor Dr Colin Ong has made history as the first Asean national legal practitioner to have been bestowed by the late Her Majesty Queen Elizabeth II to be a Queen’s C…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/09/22/brunei-lawyer-now-a-kings-counsel", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/09/22/1747065.jpg", "publishedAt": "2022-09-22T02:57:00Z", "content": "BANDAR SERI BEGAWAN (Borneo Bulletin/Asia News Newtwork): Bruneian lawyer and arbitrator, Professor Dr Colin Ong (pic) has made history as the first Asean national legal practitioner to have been bes… [+2765 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "EMDR Therapy For Addiction In Surrey, BC Announced By Grigore Counselling - AsiaOne", "description": "As ongoing research published in the National Library of Medicine supports the effectiveness of EMDR, Grigore Counselling announces Total Immersion EMDR therapy in Surrey, BC. Surrey,Canada - September 21, 2022 — Grigore Counselling has announced that its acc…", "url": "https://www.asiaone.com/business/emdr-therapy-addiction-surrey-bc-announced-grigore-counselling", "urlToImage": null, "publishedAt": "2022-09-21T13:59:00Z", "content": "As ongoing research published in the National Library of Medicine supports the effectiveness of EMDR, Grigore Counselling announces Total Immersion EMDR therapy in Surrey, BC.\r\nSurrey,Canada - Septem… [+2871 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'My neighbours ganged up against me': Man with 9 air-con units moves out of Sengkang flat - AsiaOne", "description": "This man's nine air-con units at home proved to be too cool for his neighbours. 64-year-old Huang can no longer put up with their complaints and he has moved out of the four-room flat he rented along Compassvale Road. \"My neighbours ganged up against me. They…", "url": "https://www.asiaone.com/singapore/my-neighbours-ganged-against-me-man-9-air-con-units-moves-out-sengkang-flat", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/20220921_aircon.jpg?h=0429cc9e&itok=9__XUJYc", "publishedAt": "2022-09-21T05:30:00Z", "content": "This man's nine air-con units at home proved to be too cool for his neighbours. \r\n64-year-old Huang can no longer put up with their complaints and he has moved out of the four-room flat he rented alo… [+2172 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Maroon 5 singer Adam Levine denies affair but admits he 'crossed the line' with Instagram model - Channel NewsAsia", "description": "Instagram model Sumner Stroh revealed in a TikTok video that she and Levine were seeing each other for a year while he was married to Behati Prinsloo.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/adam-levine-affair-allegation-respond-sumner-stroh-329686", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--uj1Lxyjq--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/one-cms/core/people-maroon_5-usher_83207.jpg?itok=qJzFR_Rm", "publishedAt": "2022-09-21T02:52:00Z", "content": "Adam Levine, the lead singer of pop band Maroon 5, has spoken up following recent allegations that he had cheated on his wife model Behati Prinsloo, who is pregnant with the couples third child and t… [+1752 chars]"}, {"source": {"id": null, "name": "Borneobulletin.com.bn"}, "author": null, "title": "Southeast Asian coastal cities sinking fastest - Borneo Bulletin", "description": "ANN/THE STRAITS TIMES – Southeast Asian coastal cities are sinking the fastest globally, which could amplify the impacts – such as massive flooding – of imminent sea-level rise, a recent study has found. Sea levels are rising globally as the Earth’s ice sheet…", "url": "https://borneobulletin.com.bn/southeast-asian-coastal-cities-sinking-fastest/", "urlToImage": "https://borneobulletin.com.bn/wp-content/uploads/2022/09/P2-F_21092022.jpg", "publishedAt": "2022-09-20T20:06:47Z", "content": "ANN/THE STRAITS TIMES – Southeast Asian coastal cities are sinking the fastest globally, which could amplify the impacts – such as massive flooding – of imminent sea-level rise, a recent study has fo… [+793 chars]"}]}