{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "Biden seeks to keep China in focus by welcoming ASEAN leaders - INQUIRER.net", "description": "WASHINGTON - President Joe Biden will host Southeast Asian leaders in Washington this week, seeking to show his administration remains focused on the Indo-Pacific and the long-term challenge of", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/05/2022-05-11T102433Z_1_LYNXNPEI4A0G5_RTROPTP_4_USA-ASEAN-620x413.jpg", "publishedAt": "2022-05-11T22:31:00Z", "content": "A worker adjusts an ASEAN flag at a meeting hall in Kuala Lumpur, Malaysia, October 28, 2021. (REUTERS)\r\nWASHINGTON – President Joe Biden will host Southeast Asian leaders in Washington this week, se… [+5072 chars]"}, {"source": {"id": null, "name": "Insidethegames.biz"}, "author": null, "title": "Relief as Southeast Asian Games underway in Hanoi at last - Insidethegames.biz", "description": "The Southeast Asian Games formally opens tomorrow in Vietnam's capital\nHanoi after two years of delays as a result of the COVID-19, although\nthe first...", "url": "https://www.insidethegames.biz/articles/1123037/south-east-asian-games-set-to", "urlToImage": "https://cdn.dmcl.biz/media/image/240004/o/sea+2+thumbnail_image003.jpg", "publishedAt": "2022-05-11T21:50:20Z", "content": "The Southeast Asian Games (SEA Games) formally opens tomorrow in Vietnam's capital Hanoi after two years of delays as a result of the COVID-19, although the first gold medals have already been awarde… [+2420 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Zainab Iwayemi", "title": "How Gautam Adani went from being a school dropout to becoming the richest man in India - Nairametrics", "description": "Gautam Adani is the richest man in India and across Asia. According to Bloomberg, he is the fifth on the", "url": "https://nairametrics.com/2022/05/11/how-gautam-adani-went-from-being-a-school-dropout-to-becoming-the-richest-man-in-india/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/05/Gautam-Adani-.jpg", "publishedAt": "2022-05-11T11:50:30Z", "content": "Gautam Adani is the richest man in India and across Asia. According to Bloomberg, he is the fifth on the world billionaire list with a net worth of N108 billion as of the 11th of May 2022, coming aft… [+3397 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Died hearing this': Singaporean character in Thai Netflix drama triggers locals with wrong usage of 'lah' - AsiaOne", "description": "They say that imitation is the highest form of flattery, but maybe not so much in this case. A Thai Netflix drama has received quite a bit of flak from Singaporeans over one of the characters' Singaporean accent. One of the scenes from the series was uploaded…", "url": "https://www.asiaone.com/entertainment/died-hearing-singaporean-character-thai-netflix-drama-triggers-locals-wrong-usage-lah", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/110522_Netflix%20Thai%20Drama.jpg?h=0203285d&itok=yHablWk3", "publishedAt": "2022-05-11T10:35:00Z", "content": "They say that imitation is the highest form of flattery, but maybe not so much in this case. \r\nA Thai Netflix drama has received quite a bit of flak from Singaporeans over one of the characters' Sing… [+1254 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Malaysia central bank lifts key rate from all-time low on inflation risk - CNA", "description": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to recover from the COVID-19 pandemic.Bank Negara Malaysia (BNM) r…", "url": "https://www.channelnewsasia.com/business/malaysia-central-bank-lifts-key-rate-all-time-low-inflation-risk-2677786", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--b4IO0NSj--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-05-11t071306z_1_lynxnpei4a0a0_rtroptp_3_malaysia-economy-rates.jpg?itok=tvkbAlOw", "publishedAt": "2022-05-11T09:07:22Z", "content": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to rec… [+3096 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": "Ruth Abbey Gita-Carlos", "title": "Palace hails Padios for winning PH's 1st gold in SEAG - pna.gov.ph", "description": "MANILA – Malacañang on Wednesday congratulated pencak silat athlete Francine Padios for delivering the Philippines’ first gold medal in the ongoing 31st Southeast Asian (SEA) Games in Hanoi, Vietnam.“The Palace congratulates Mary Francine Padios for bringing …", "url": "https://www.pna.gov.ph/articles/1174173", "urlToImage": "https://files01.pna.gov.ph/ograph/2019/02/14/malacaan-palace.jpg", "publishedAt": "2022-05-11T07:30:00Z", "content": "(Photo courtesy of the Philippine Sports Commission)\r\nMANILA – Malacañang on Wednesday congratulated pencak silat athlete Francine Padios for delivering the Philippines’ first gold medal in the ongoi… [+1693 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Beach Road slashing: Crowdfunding launched to help victim pay hospital bills - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): The victim of a brutal attack outside a restaurant in Beach Road last month has given permission to a charity platform to raise funds to help her meet her bills and caregiving needs.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/05/11/beach-road-slashing-crowdfunding-launched-to-help-victim-pay-hospital-bills", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/05/11/1581187.jpg", "publishedAt": "2022-05-11T05:03:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): The victim of a brutal attack outside a restaurant in Beach Road last month has given permission to a charity platform to raise funds to help her meet… [+2597 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Elizabeth Olsen never met Illuminati cast during filming of Doctor Strange sequel - AsiaOne", "description": "Warning: This article contains spoilers for Doctor Strange in the Multiverse of Madness. One of the biggest reveals in Doctor Strange in the Multiverse of Madness is the cameo by the Illuminati. Made up of Captain Carter (Hayley Atwell), Black Bolt (Anson Mou…", "url": "https://www.asiaone.com/entertainment/elizabeth-olsen-never-met-illuminati-cast-during-filming-doctor-strange-sequel", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/110522_Elizebetholsen_Marvelstudios.jpg?h=0429cc9e&itok=HlqpQb5j", "publishedAt": "2022-05-11T02:34:00Z", "content": "Warning: This article contains spoilers for Doctor Strange in the Multiverse of Madness.\r\nOne of the biggest reveals in Doctor Strange in the Multiverse of Madness is the cameo by the Illuminati.\r\nMa… [+2545 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Their parents are younger than me': Dennis Chew on classmates, poly life and taking pay cut - AsiaOne", "description": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. So, how have the first few weeks of school been for the 48-year-old? Speaking to Shin Min Daily New…", "url": "https://www.asiaone.com/entertainment/their-parents-are-younger-me-dennis-chew-classmates-poly-life-and-taking-pay-cut", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/100522_Dennis%20Chew%20Plytechnic_SMDN.jpg?h=a30d54cd&itok=xO-JpSUV", "publishedAt": "2022-05-10T05:06:00Z", "content": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. \r\nSo, how have the first few weeks of s… [+2339 chars]"}]}