{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Chloe Zhao's historic Academy Awards win all but ignored in China - ABC News", "description": "Zhao is the first Asian woman to win Best Director for her film Nomadland, but in China the reaction has been tightly controlled, with praise removed from social media and supporters blocked from watching a livestream of the event.", "url": "https://www.abc.net.au/news/2021-04-26/chloe-zhao-academy-awards-nomadland-oscar-win/100095650", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/b80560c9f90e02685dfaf72cc906192f?impolicy=wcms_crop_resize&cropH=1310&cropW=2329&xPos=0&yPos=97&width=862&height=485", "publishedAt": "2021-04-26T08:26:56Z", "content": "The reaction to Chinese director Chloe Zhao's historic night at the Academy Awards has been surprisingly muted back home amid controversy over comments she made nearly a decade ago.\r\nKey points:\r\n<ul… [+5200 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "ABS-CBN News", "title": "Fencing: Catantan bows out in semis, fails to clinch Tokyo berth - ABS-CBN News", "description": "Filipina fencer Samantha Catantan fell short of securing a spot in the Tokyo Olympics at the Asia-Oceania qualifiers held in Tashkent, Uzbekistan.", "url": "https://news.abs-cbn.com/sports/04/26/21/fencing-catantan-bows-out-in-semis-fails-to-clinch-tokyo-berth", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/tvpatrol/02/13/20200214-samantha-catantan.jpg", "publishedAt": "2021-04-26T05:26:00Z", "content": "MANILA, Philippines -- Filipina fencer Samantha Catantan fell short of securing a spot in the Tokyo Olympics at the Asia-Oceania qualifiers held in Tashkent, Uzbekistan on Sunday.\r\nThe former Univers… [+1206 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "30 out of 40 imported COVID-19 cases announced on 25 Apr, linked to India - The Online Citizen Asia", "description": "The Online Citizen Asia 30 out of 40 imported COVID-19 cases announced on 25 Apr, linked to India Current Affairs", "url": "https://www.theonlinecitizen.com/2021/04/26/30-out-of-40-imported-covid-19-cases-announced-on-25-apr-linked-to-india/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/03/NCID-Singapore-2.jpg", "publishedAt": "2021-04-26T04:31:28Z", "content": "Yesterday (25 Apr), the Ministry of Health (MOH) confirmed and verified that there were 40 imported cases of COVID-19. There were no new cases of locally transmitted infection.\r\nThe imported cases ha… [+980 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "Matthew Mohan", "title": "Singaporean fencer Amita Berthier earns Olympic spot after winning qualification tournament - CNA", "description": "SINGAPORE: Amita Berthier has booked her place at this year's Olympic Games, after winning the women's foil event at the Asia-Oceanian Olympic Qualification Tournament in Tashkent, Uzbekistan on Sunday (Apr 25).", "url": "https://www.channelnewsasia.com/news/sport/singaporean-fencer-amita-berthier-earns-olympic-spot-after-14691972", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/12147970/16x9/991/557/e7995cafdeadf90081fd19224e561a9d/Su/sea-games-singapore-women-s-fencing-amita.jpg", "publishedAt": "2021-04-25T13:56:37Z", "content": "SINGAPORE: Amita Berthier has booked her place at this year's Olympic Games, after winning the women's foil event at the Asia-Oceanian Olympic Qualification Tournament in Tashkent, Uzbekistan on Sund… [+1352 chars]"}, {"source": {"id": null, "name": "Sify News"}, "author": "IANS", "title": "Philippines logs 8,162 new Covid-19 cases, total nears 1 million - Sify News", "description": "Manila, April 25 (IANS) The Philippines Department of Health (DOH) reported on Sunday 8,162 new Covid-19 infections, bringing the total number of confirmed cases in the Southeast Asian country to 997,523.", "url": "https://www.sify.com/news/philippines-logs-8162-new-covid-19-cases-total-nears-1-million-news-international-vezkkjbcajgig.html", "urlToImage": "https://www.sify.com/images/news-183x123.jpg", "publishedAt": "2021-04-25T10:10:09Z", "content": "Manila, April 25 (IANS) The Philippines' Department of Health (DOH) reported on Sunday 8,162 new Covid-19 infections, bringing the total number of confirmed cases in the Southeast Asian country to 99… [+1080 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "China offers to help India tackle Covid-19 outbreak after US vaccine snub - AsiaOne", "description": "CHINA - China has offered to help India battle its Covid-19 outbreak after the United States declined a request to lift a ban on exporting vaccine raw materials. The olive branch from the Chinese foreign ministry comes as tensions between the two nations cont…", "url": "https://www.asiaone.com/china/china-offers-help-india-tackle-covid-19-outbreak-after-us-vaccine-snub", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_958.jpg?h=0fc6640a&itok=RH6b_l2P", "publishedAt": "2021-04-25T08:30:00Z", "content": "CHINA - China has offered to help India battle its Covid-19 outbreak after the United States declined a request to lift a ban on exporting vaccine raw materials.\r\nThe olive branch from the Chinese fo… [+3170 chars]"}]}