{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "NASA Plans ‘Grand Funeral’ For Space Station; Starts Backing Tech Firms To Develop Privately-Owned ‘Space Base’ - EurAsian Times", "description": "The International Space Station (ISS) has been circling the Earth for more than two decades now, contributing to major scientific experiments that have laid the groundwork for deep space explorations. ISS, which was launched in 2000 and has orbited 227 nautic…", "url": "https://eurasiantimes.com/nasa-plans-grand-funeral-for-space-station-starts-backing-tech-firms/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2020/07/nasa-comet.png", "publishedAt": "2022-02-14T14:41:42Z", "content": "The International Space Station (ISS) has been circling the Earth for more than two decades now, contributing to major scientific experiments that have laid the groundwork for deep space explorations… [+7180 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "iPhone SE3 lands on Eurasian Economic Commission (EEC) database - Gizchina.com", "description": "iPhone SE3 lands on Eurasian Economic Commission (EEC) database. These devices come with model numbers A2595, A2783, and A2784.", "url": "https://www.gizchina.com/2022/02/14/iphone-se3-lands-on-eurasian-economic-commission-eec-database/", "urlToImage": "https://www.gizchina.com/wp-content/uploads/images/2020/09/20200918_214802_834.jpeg", "publishedAt": "2022-02-14T10:17:33Z", "content": "Over the past few weeks, there have been several speculations regarding the iPhone SE3. The company will officially release this smartphone at its upcoming spring new product launch conference. Some … [+2148 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Dennis Gutierrez", "title": "Legarda still among top choice in latest Pulse Asia senatorial survey - INQUIRER.net", "description": "Senatorial candidate Loren Legarda maintains her hold on the third spot in the latest Pulse Asia senatorial survey released on Sunday.\r\n\r\nBased the survey conducted from January 19 to 24, Legarda,", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/02/Screen-Shot-2022-02-14-at-2.39.09-PM-620x411.png", "publishedAt": "2022-02-14T06:42:00Z", "content": "Three-term senator and Antique Congresswoman Loren Legarda during her kick-off campaign at the Lieberman Gymnasium in the Municipality of Pandan on February 8, 2021.. Contributed photo\r\nSenatorial ca… [+1326 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Anthony Lim", "title": "2022 World Car of the Year - list of finalists announced - paultan.org - Paul Tan's Automotive News", "description": "The finalists for the 2022 World Car of the Year (WCOTY) have been announced, with 10 models having been shortlisted for the top prize in this year’s awards. Asian manufacturers are well represented in this …", "url": "https://paultan.org/2022/02/14/2022-world-car-of-the-year-list-of-finalists-announced/", "urlToImage": "https://paultan.org/image/2022/02/2022-WCOTY-finalists-montage-1200x628.jpg", "publishedAt": "2022-02-14T05:06:57Z", "content": "The finalists for the 2022 World Car of the Year (WCOTY) have been announced, with 10 models having been shortlisted for the top prize in this year’s awards. Asian manufacturers are well represented … [+1730 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Stop hurting others' Li Jinglei hits back after Wang Leehom files court motion against her - AsiaOne", "description": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle. A Chinese netizen leaked documents last Friday (Feb 11), re…", "url": "https://www.asiaone.com/entertainment/stop-hurting-others-li-jinglei-hits-back-after-wang-leehom-files-court-motion-against", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/image_434.jpg?h=b82b5380&itok=C0Q4AdYo", "publishedAt": "2022-02-13T08:33:09Z", "content": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle.… [+2244 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Lisa Schlein", "title": "WHO: Measles Increase a Danger to Malnourished Afghan Children - VOA Asia", "description": "Case rise seen as especially concerning because of high malnutrition levels", "url": "https://www.voanews.com/a/who-measles-increase-a-danger-to-malnourished-afghan-children/6439252.html", "urlToImage": "https://gdb.voanews.com/c36e0000-0aff-0242-14fd-08d9ee5c676b_w1200_r1.jpg", "publishedAt": "2022-02-12T19:25:42Z", "content": "GENEVA  The World Health Organization warns a sharp rise in measles cases in Afghanistan is threatening the lives and well-being of millions of malnourished children. \r\nMore than 35,300 suspected cas… [+2335 chars]"}]}