{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Vinod Kumar clinches bronze in discus throw, third medal for India in Paralympics - Times of India", "description": "Tokyo Paralympics News: Discus thrower Vinod Kumar clinched a bronze medal in the men's F52 event with an Asian record to give India its third medal in Tokyo Paralympics on S", "url": "https://timesofindia.indiatimes.com/sports/tokyo-paralympics/vinod-kumar-clinches-bronze-in-discus-throw-third-medal-for-india-in-paralympics/articleshow/85738392.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-85738365,width-1070,height-580,imgsize-97852,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-08-29T13:11:00Z", "content": "India is rejoicing thanks to Vinod Kumars stupendous performance! Congratulations to him for the Bronze Medal. His https://t.co/TqIbnxE6Lr\r\n— Narendra Modi (@narendramodi) 1630242152000"}, {"source": {"id": null, "name": "Stackedhomes.com"}, "author": null, "title": "We ranked the bottom 10 Singapore districts by appreciation - AsiaOne", "description": "2021 has been rough on first time home buyers, as well as new investors. With property prices rising across the board, you’d be hard-pressed to find discounts, or even just a bigger condo. But property is always about specifics, and there are some districts w…", "url": "https://stackedhomes.com/editorial/we-ranked-the-bottom-10-singapore-districts-by-appreciation-2021/#gs.94e6ws", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210825_Bottom10SingaporeDistrictsRanking_Stackedhomes.jpg?h=0429cc9e&itok=-9uMsHb5", "publishedAt": "2021-08-29T02:45:00Z", "content": "2021 has been rough on first time home buyers, as well as new investors. With property prices rising across the board, youd be hard-pressed to find discounts, or even just a bigger condo.\r\nBut proper… [+15025 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I don't know how long I cried': Dasmond Koh opens up on how he broke down after Aloysius Pang's death - AsiaOne", "description": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him. The boss of Noontalk Media choked up on the latest episode of Hear U Out, a talk show hosted by Quan Yifeng, when he s…", "url": "https://www.asiaone.com/entertainment/i-dont-know-how-long-i-cried-dasmond-koh-opens-how-he-broke-down-after-aloysius-pangs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_1262.jpg?h=72faa102&itok=vxK5MmfZ", "publishedAt": "2021-08-29T01:43:58Z", "content": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him.\r\nThe boss of Noontalk Media choked up on the latest episod… [+1490 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "No explanation as China's billionaire actress Vicki Zhao blacklisted from Chinese internet - AsiaOne", "description": "China’s billionaire actress Vicki Zhao Wei appears to have been blacklisted by the government, and her entire internet presence was scrubbed for unknown reasons on Thursday (Aug 26) evening. Zhao’s name was removed from all television series, films, short vid…", "url": "https://www.asiaone.com/entertainment/no-explanation-china-s-billionaire-actress-vicki-zhao-blacklisted-chinese-internet", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_1250.jpg?h=f0e5f03f&itok=lyaHnnC9", "publishedAt": "2021-08-28T03:25:00Z", "content": "Chinas billionaire actress Vicki Zhao Wei appears to have been blacklisted by the government, and her entire internet presence was scrubbed for unknown reasons on Thursday (Aug 26) evening.\r\nZhaos na… [+3946 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Anthony Lim", "title": "AirAsia Ride vs Grab first impressions in Malaysia - which ride hailing service is cheaper and faster? - paultan.org - Paul Tan's Automotive News", "description": "Ride-sharing may have taken a downturn in the past year and a half, but there’s no denying that the service, which has become an integral part of urban mobility, remains very much a business worth …", "url": "https://paultan.org/2021/08/27/airasia-ride-vs-grab-malaysia/", "urlToImage": "https://paultan.org/image/2021/08/Airasia-Ride-vs-Grab-1200x675.jpg", "publishedAt": "2021-08-27T14:36:55Z", "content": "Ride-sharing may have taken a downturn in the past year and a half, but theres no denying that the service, which has become an integral part of urban mobility, remains very much a business worth inv… [+14011 chars]"}]}