{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "CNBCTV18"}, "author": null, "title": "India tells Quad will allow export of 8 million Indo-Pacific vaccine doses - CNBCTV18", "description": "A plan reached by the Quad earlier this year to supply a billion COVID-19 shots across Asia by the end of 2022 stalled after India, the world’s largest vaccine producer, banned exports in April amid a massive COVID outbreak at home.", "url": "https://www.cnbctv18.com/economy/india-tells-quad-will-allow-export-of-8-million-indo-pacific-vaccine-doses-10883182.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/08/covishield-1-1019x573.jpg", "publishedAt": "2021-09-25T02:43:27Z", "content": "MiniA plan reached by the Quad earlier this year to supply a billion COVID-19 shots across Asia by the end of 2022 stalled after India, the worlds largest vaccine producer, banned exports in April am… [+35 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I didn't know when he'd lose his temper': Chantalle Ng says dad Huang Yiliang once caned her so badly she was hospitalised for a week - AsiaOne", "description": "There's a saying — spare the rod, spoil the child. But what if the physical punishment crosses the line and becomes something traumatic? On the latest episode of the meWATCH talk show Hear U Out, Chantalle Ng (daughter of veteran actress Lin Meijiao) shed som…", "url": "https://www.asiaone.com/entertainment/i-didnt-know-when-hed-lose-his-temper-chantalle-ng-says-dad-huang-yiliang-once-caned", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/chantalleng_mewatch.jpg?h=3df888d6&itok=1HKqaQy0", "publishedAt": "2021-09-24T10:17:00Z", "content": "There's a saying spare the rod, spoil the child. But what if the physical punishment crosses the line and becomes something traumatic?\r\nOn the latest episode of the meWATCH talk show Hear U Out, Chan… [+3216 chars]"}]}