{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Asian shares on edge as U.S. bond yields rise, oil volatile - Reuters", "description": "Share markets were jittery in early Asia on Wednesday as trading was buffeted by a step-up in U.S. Treasury yields as well as volatile oil prices in the face of price-cooling moves by the United States and other nations.", "url": "https://www.reuters.com/markets/europe/global-markets-wrapup-1-2021-11-24/", "urlToImage": "https://www.reuters.com/resizer/rgdveyaOecfbtUq3Ta__g6MzqJY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/P3UCYBM4INML7P72XOBKHUC674.jpg", "publishedAt": "2021-11-24T10:20:00Z", "content": "HONG KONG, Nov 24 (Reuters) - Share markets were jittery in early Asia on Wednesday as trading was buffeted by a step-up in U.S. Treasury yields as well as volatile oil prices in the face of price-co… [+3845 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Taste of freedom': Eighteen Chefs founder Benny Se Teo leaves the restaurant chain - AsiaOne", "description": "Many of us would probably be familiar with Chef Benny Se Teo, the co-founder of Western food chain Eighteen Chefs and grilled meat specialist The Meathouse. Apart from being a successful restaurateur who makes it a point to provide ex-offenders with job oppor…", "url": "https://www.asiaone.com/lifestyle/taste-freedom-eighteen-chefs-founder-benny-se-teo-leaves-restaurant-chain", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/Benny%20Se%20Teo%2018%20Chefs%2020211124.jpg?h=0429cc9e&itok=0pxvmGAS", "publishedAt": "2021-11-24T06:47:07Z", "content": "Many of us would probably be familiar with Chef Benny Se Teo, the co-founder of Western food chain Eighteen Chefs and grilled meat specialist The Meathouse. \r\nApart from being a successful restaurate… [+2639 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "SIA apologises for confusion over e-mail on Covid-19 quarantine requirements in Malaysia - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): Singapore Airlines (SIA) has apologised for any confusion caused after an e-mail regarding changes to Covid-19 travel measures in Malaysia was sent to passengers.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/11/24/sia-apologises-for-confusion-over-e-mail-on-covid-19-quarantine-requirements-in-malaysia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/24/1379608.jpg", "publishedAt": "2021-11-24T04:57:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): Singapore Airlines (SIA) has apologised for any confusion caused after an e-mail regarding changes to Covid-19 travel measures in Malaysia was sent to… [+1040 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New Nike Unite concept store opens at IMM - AsiaOne", "description": "Tucked in the far west of Singapore, Nike’s brand new retail experience, Nike Unite, has replaced its original factory outlet store. Spanning 18,000 square feet, the store, located at IMM, is the first of its kind in Southeast Asia. As with such firsts, there…", "url": "https://www.asiaone.com/lifestyle/new-nike-unite-concept-store-opens-imm", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211124_ball_nike.jpg?h=0429cc9e&itok=zRmQ5KhJ", "publishedAt": "2021-11-24T03:12:09Z", "content": "Tucked in the far west of Singapore, Nikes brand new retail experience, Nike Unite, has replaced its original factory outlet store.\r\nSpanning 18,000 square feet, the store, located at IMM, is the fir… [+2407 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "PBC eyes SEA Games gold — Bong Coo - BusinessWorld Online", "description": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a decade in the Hanoi tilt in May next year.", "url": "https://www.bworldonline.com/pbc-eyes-sea-games-gold-bong-coo/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/TEAM-Philippines-at-the-2021-IBF-Super-World-Championship.jpg", "publishedAt": "2021-11-23T16:01:25Z", "content": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a… [+1447 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": "Iris Gonzales", "title": "Bargain hunting propels market past 7,400 mark - Philstar.com", "description": "Local stocks leaped to a two-week high yesterday, bucking the subdued mood in other Asian markets, as foreign buyers led investors in picking up bargain issues.", "url": "https://www.philstar.com/business/2021/11/24/2143329/bargain-hunting-propels-market-past-7400-mark", "urlToImage": "https://media.philstar.com/photos/2021/11/23/stocks_2021-11-23_18-51-33.jpg", "publishedAt": "2021-11-23T16:00:00Z", "content": "MANILA, Philippines — Local stocks leaped to a two-week high yesterday, bucking the subdued mood in other Asian markets, as foreign buyers led investors in picking up bargain issues.\r\nThe benchmark P… [+1344 chars]"}]}