{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Alun John", "title": "Asian shares rise on dovish Fed chair, oil up as hurricane batters Louisiana - Reuters", "description": "Asian shares started the week with gains and the dollar was not far off two-week lows after U.S. Federal Reserve Chairman Jerome Powell struck a more dovish tone than some investors expected in long-awaited speech on Friday.", "url": "https://www.reuters.com/business/global-markets-wrapup-1-2021-08-30/", "urlToImage": "https://www.reuters.com/resizer/Icy5HAS5_VmXfj04xaDfIm2gTQg=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/RNWNFKBKW5MTRF3MLSSOOMRLW4.jpg", "publishedAt": "2021-08-30T00:49:00Z", "content": "A man wearing a protective face mask, following an outbreak of the coronavirus, talks on his mobile phone in front of a screen showing the Nikkei index outside a brokerage in Tokyo, Japan, February 2… [+3270 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Stocks set to climb on Powell's dovish Fed stance - The Edge Markets MY", "description": "(Aug 30): Asian stocks look set to rise Monday after U.S. equities rallied to a record and Treasuries advanced on Jerome Powell’s signal of a cautious and gradual withdrawal of pandemic-era Federal Reserve policy support.Futures for Japan, Australia and Hong …", "url": "https://www.theedgemarkets.com/article/stocks-set-climb-powells-dovish-fed-stance", "urlToImage": "https://assets.theedgemarkets.com/Market-Preview_20210830081912_theedgemarkets.jpg?HzULaOWjK8qZ2GyGosnka43b20tjcW_I", "publishedAt": "2021-08-29T23:07:58Z", "content": "(Aug 30): Asian stocks look set to rise Monday after U.S. equities rallied to a record and Treasuries advanced on Jerome Powells signal of a cautious and gradual withdrawal of pandemic-era Federal Re… [+2813 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Phillip Inman", "title": "Recovery in global trade hit by Covid outbreaks in east Asia - The Guardian", "description": "Decline in exports from Taiwan combines with port closures in China and Japan to hinder growth", "url": "https://amp.theguardian.com/business/2021/aug/29/recovery-in-global-trade-hit-by-covid-outbreaks-in-east-asia", "urlToImage": null, "publishedAt": "2021-08-29T19:56:00Z", "content": "International tradeDecline in exports from Taiwan combines with port closures in China and Japan to hinder growth\r\nA recovery in global trade during the summer is beginning to wane, according to some… [+3898 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I don't know how long I cried': Dasmond Koh opens up on how he broke down after Aloysius Pang's death - AsiaOne", "description": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him. The boss of Noontalk Media choked up on the latest episode of Hear U Out, a talk show hosted by Quan Yifeng, when he s…", "url": "https://www.asiaone.com/entertainment/i-dont-know-how-long-i-cried-dasmond-koh-opens-how-he-broke-down-after-aloysius-pangs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_1262.jpg?h=72faa102&itok=vxK5MmfZ", "publishedAt": "2021-08-29T01:43:58Z", "content": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him.\r\nThe boss of Noontalk Media choked up on the latest episod… [+1490 chars]"}]}