{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Asianetnews.com"}, "author": "Ahana Chaudhury", "title": "A-Z Of Ketogenic diet: Everything you need to know about its benefits - Asianet Newsable ", "description": "Dietitians frequently advise a ketogenic diet to people who want to lose weight successfully. The idea behind keto diets is to consume meals that are high in fat and low in carbohydrates. Your body enters a metabolic condition known as ketosis when you eat fe…", "url": "https://newsable.asianetnews.com/gallery/lifestyle/az-of-ketogenic-diet-everything-you-need-to-know-about-its-benefits-adc-rtiov8", "urlToImage": "https://static-ai.asianetnews.com/images/01gymexv7etsnf4awws6xwg9rp/gettyimages-1135307432_1200x630xt.jpg", "publishedAt": "2023-04-23T01:30:35Z", "content": "Dietitians frequently advise a ketogenic diet to people who want to lose weight successfully. The idea behind keto diets is to consume meals that are high in fat and low in carbohydrates. Your body e… [+2067 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Great Potential – Traditional Medicine Plant Discovered To Emit Ethereal Blue Hue - SciTechDaily", "description": "Plants that emit a glowing light under ultraviolet (UV) light are no longer just a fantasy seen in science fiction TV shows and movies. The roots of a medicinal plant known as Toddalia asiatica or orange climber, have been found to emit an ethereal blue glow.…", "url": "https://scitechdaily.com/great-potential-traditional-medicine-plant-discovered-to-emit-ethereal-blue-hue/", "urlToImage": "https://scitechdaily.com/images/Fluorescent-Blue-Coumarins-in-a-Folk-Medicine-Plant-scaled.jpg", "publishedAt": "2023-04-21T22:33:54Z", "content": "A fluorescent compound from a plant root could help image cells quickly. Credit: Adapted from ACS Central Science 2023, DOI: 10.1021/acscentsci.3c00012\r\nPlants that emit a glowing light under ultravi… [+2774 chars]"}]}