{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Showbiz veteran Jenny Tseng slams Li Jinglei for going too far in public divorce spat with Wang Leehom - AsiaOne", "description": "Li Jinglei may have called for a truce on her and ex-husband Wang Leehom's very public spat over their divorce, but it seems the brouhaha has yet to die down. The 35-year-old's explosive posts after their divorce announcement on Dec 16 have not only tarnished…", "url": "https://www.asiaone.com/entertainment/showbiz-veteran-jenny-tseng-slams-li-jinglei-going-too-far-public-divorce-spat-wang-leehom", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/Jennyleejinglei2.jpeg?h=0429cc9e&itok=y9mtZHb8", "publishedAt": "2021-12-26T06:28:00Z", "content": "Li Jinglei may have called for a truce on her and ex-husband Wang Leehom's very public spat over their divorce, but it seems the brouhaha has yet to die down.\r\nThe 35-year-old's explosive posts after… [+1784 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Our Christmas dinner was ruined': Collin's Grille customers complain of delayed and missing meals on Christmas Eve - AsiaOne", "description": "Customers of Collin's Grille were left high and dry on Christmas Eve when their pre-ordered Christmas dinners failed to materialise. In photos posted on social media, long queues were seen at Collin's Grille outlets across Singapore on Dec 24. The long wait f…", "url": "https://www.asiaone.com/singapore/our-christmas-dinner-was-ruined-collins-grille-customers-complain-delayed-and-missing", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/20211226_CollinsGrilleXmas.jpeg?h=0429cc9e&itok=eP-e5fFV", "publishedAt": "2021-12-26T04:32:00Z", "content": "Customers of Collin's Grille were left high and dry on Christmas Eve when their pre-ordered Christmas dinners failed to materialise.\r\nIn photos posted on social media, long queues were seen at Collin… [+3795 chars]"}]}