{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Asianatimes.com"}, "author": "Rupkatha Dutta", "title": "Webb Telescope Finds Life-Critical carbon in Orion Nebula - Asiana Times", "description": "Astrophotographers are drawn to the mesmerizing beauty of the Orion Nebula, one of the brightest deep sky objects visible from Earth. Many enthusiasts seize the opportunity to capture its magnificence using their DSLR or mirrorless cameras in conjunction with…", "url": "https://asianatimes.com/webb-telescope-finds-critical-carbon-orion-nebula/", "urlToImage": "https://spaces-asianatimes.sgp1.digitaloceanspaces.com/2023/06/290623-f.jpg", "publishedAt": "2023-06-29T05:23:33Z", "content": "Astrophotographers are drawn to the mesmerizing beauty of the Orion Nebula, one of the brightest deep sky objects visible from Earth. Many enthusiasts seize the opportunity to capture its magnificenc… [+3220 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Siddharth Saxena", "title": "SAFF Championship: India coach Igor Stimac's red cards alarm AIFF - Indiatimes.com", "description": "Football News: Just over six months to go for the Asian Cup in Qatar, and the All India Football Federation is waking up to the possibility that the senior team coac", "url": "https://timesofindia.indiatimes.com/sports/football/top-stories/saff-championship-india-coach-igor-stimacs-red-cards-alarm-aiff/articleshow/101355364.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-101355335,width-1070,height-580,imgsize-40646,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-06-29T04:08:00Z", "content": "TimesViewCoach Stimac is a pedigreed footballer and a first-rate analyst of the game. It is also evident that he is passionate about the team he coaches. But it is worrying that he cannot rein himsel… [+202 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Brett Miller", "title": "Stock Market Today: Dow, S&P Live Updates for June 29 - Bloomberg", "description": "Asian stocks turned lower Thursday as upward momentum in Japan slowed and Chinese shares slid. The yen and the yuan were also in focus amid concern from authorities in both countries about weakness in the currencies.", "url": "https://www.bloomberg.com/news/articles/2023-06-28/stock-market-today-dow-s-p-live-updates", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iR7uvh3Lit0k/v0/1200x800.jpg", "publishedAt": "2023-06-28T22:21:16Z", "content": "Asian stocks turned lower Thursday as upward momentum in Japan slowed and Chinese shares slid. The yen and the yuan were also in focus amid concern from authorities in both countries about weakness i… [+174 chars]"}]}