{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "KN Pandita", "title": "Second Kill For F-22 Raptor! US Shoots Down Another High-Altitude ‘Object’ Near Canadian Border Over Alaska - EurAsian Times", "description": "US F-22 Raptor made its second kill when it shot down a “high-altitude object” hovering over Alaska. The Raptor downed the object at 1:45 p.m. ET. “The Department of Defense was tracking a high-altitude object over Alaska airspace in the last 24 hours,” John …", "url": "https://eurasiantimes.com/second-kill-for-f-22-raptor-us-shoots-down-another-high-altitude/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/07/Lockheed-Martin-F-22-Raptor.jpeg", "publishedAt": "2023-02-11T03:05:19Z", "content": "US F-22 Raptor made its second kill when it shot down a high-altitude object hovering over Alaska. The Raptor downed the object at 1:45 p.m. ET.\r\nThe Department of Defense was tracking a high-altitud… [+7076 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Sisters scammed of $1250 on Carousell after wanting to buy iPhone for mum - AsiaOne", "description": "What started off as an act of kindness turned into heartbreak when two sisters, wanting to buy their mother a new iPhone online, ended up getting scammed on Carousell. Speaking to Mothership, the mother Kate (not her real name) said her daughters wanted to ge…", "url": "https://www.asiaone.com/singapore/sisters-scammed-1250-carousell-after-wanting-buy-iphone-mum", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/11223_iphone_unsplash.jpg?h=dfa61720&itok=WfYJPlEi", "publishedAt": "2023-02-11T02:58:00Z", "content": "What started off as an act of kindness turned into heartbreak when two sisters, wanting to buy their mother a new iPhone online, ended up getting scammed on Carousell. \r\nSpeaking to Mothership, the m… [+1999 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Jonathan Burgos", "title": "Alternergy Gears Up For Philippine IPO To Bankroll Renewable Energy Projects - Forbes", "description": "Alternergy—which built Southeast Asia’s first commercial wind farm in the northern Philippines—is gearing up for its initial public offering next month to bankroll renewable energy projects with a combined capacity of over 1.2 gigawatts.", "url": "https://www.forbes.com/sites/jonathanburgos/2023/02/10/alternergy-gears-up-for-philippine-ipo-to-bankroll-renewable-energy-projects/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63e5d96e45aa12376121a4ae/0x0.jpg?format=jpg&width=1200", "publishedAt": "2023-02-10T07:15:02Z", "content": "Alternergy built the Philippines' first commercial wind farm and eventually sold it to Ayala Corp's AC Energy.\r\nCourtesy of Alternergy\r\nAlternergywhich built Southeast Asias first commercial wind far… [+2276 chars]"}]}