{"articles": [{"author": null, "content": "A man in northern China who claims to be able to use mind control to enhance the size of womens breasts may be in hot water after releasing a video of himself using his powers on 27 women simultaneou… [+2926 chars]", "description": "A man in northern China who claims to be able to use mind control to enhance the size of women’s breasts may be in hot water after releasing a video of himself using his “powers” on 27 women simultaneously. The video clip that emerged on March 17, and has sin…", "publishedAt": "2021-03-23T01:23:54Z", "source": {"id": null, "name": "Post Magazine"}, "title": "Man in China claiming to be Taoist master offering breast implants with 'mind control' and witchcraft has authorities worried - AsiaOne", "url": "https://www.scmp.com/news/people-culture/trending-china/article/3126477/man-china-claiming-be-taoist-master-offering", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210323_amanandwomen_beijingnews.jpg?h=68a38f63&itok=rKG8VXUV"}, {"author": null, "content": "SINGAPORE - Residents of a hostel block at the National University of Singapore will need to be swabbed after traces of Covid-19 were detected in its wastewater.\r\nStaff and students were informed in … [+2166 chars]", "description": "SINGAPORE - Residents of a hostel block at the National University of Singapore will need to be swabbed after traces of Covid-19 were detected in its wastewater. Staff and students were informed in a circular seen by The Straits Times on Monday night (March 2…", "publishedAt": "2021-03-23T00:24:08Z", "source": {"id": null, "name": "AsiaOne"}, "title": "NUS hostel residents to be swabbed after traces of Covid-19 found in wastewater - AsiaOne", "url": "https://www.asiaone.com/singapore/nus-hostel-residents-be-swabbed-after-traces-covid-19-found-wastewater", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/image_888.jpg?h=199d8c1f&itok=yPqdQ215"}, {"author": null, "content": "He told AsiaOne in an interview in January that he's keeping the interior design for his new house a secret until the big reveal in the near future.\r\nIs the wait over?\r\nYesterday (March 22), actor La… [+1586 chars]", "description": "He told AsiaOne in an interview in January that he's keeping the interior design for his new house a secret until the big reveal in the near future. Is the wait over? Yesterday (March 22), actor Lawrence Wong uploaded a video of his home bathroom to Instagram…", "publishedAt": "2021-03-22T06:35:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Actor Lawrence Wong reveals stunning minimalistic toilet in his new home - AsiaOne", "url": "https://www.asiaone.com/entertainment/actor-lawrence-wong-reveals-stunning-minimalistic-toilet-his-new-home", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210322_lawrence.jpg?h=08516339&itok=nHkMu2Tb"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "asia"}