{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Yoonjung Seo,Brad Lendon", "title": "Terrifying moments as plane door opens midair on Asiana Airlines flight - CNN", "description": "The door of an Asiana Airlines jet opened as it was coming in to land in Daegu, South Korea, on Friday afternoon, leaving wind whipping through the plane’s cabin as terrified passengers gripped their armrests, video of the incident shows.", "url": "https://www.cnn.com/2023/05/26/asia/south-korea-plane-door-opens-midair-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230526041658-asiana-airlines-plane-door-052623.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-27T04:47:00Z", "content": "The door of an Asiana Airlines jet opened as it was coming in to land in Daegu, South Korea, on Friday afternoon, leaving wind whipping through the planes cabin as terrified passengers gripped their … [+2484 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Asiana Airlines: Passenger arrested for opening plane door during South Korea flight - BBC", "description": "The Asiana Airlines plane landed safely in South Korea after a passenger forced open an emergency door.", "url": "https://www.bbc.com/news/world-asia-65705276", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/015B/production/_129874300_stretchers.jpg", "publishedAt": "2023-05-27T04:01:29Z", "content": "Media caption, Watch: Inside cabin as plane door opened mid-flight\r\nA man has been arrested for opening a door of an Asiana Airlines flight as it was landing in South Korea.\r\nAll 194 passengers survi… [+1634 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Passenger's Bizarre Excuse On Opening Emergency Exit Of Plane Mid-Air - NDTV", "description": "A passenger on an Asiana Airlines flight told police he opened a door on the plane minutes before it landed in Daegu, South Korea, on Friday because he was \"uncomfortable\", Yonhap News Agency reported.", "url": "https://www.ndtv.com/world-news/flyer-who-opened-emergency-exit-mid-air-wanted-to-get-off-plane-quickly-4070566", "urlToImage": "https://c.ndtvimg.com/2023-05/ni9phcd8_passenger-opens-plane-door-midair-650_650x400_26_May_23.jpg", "publishedAt": "2023-05-27T03:31:04Z", "content": "The man opened the door when the plane was about 700 feet above the ground.\r\nSeoul: A passenger on an Asiana Airlines flight told police he opened a door on the plane minutes before it landed in Daeg… [+1258 chars]"}]}