{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": "Sofia Tomacruz", "title": "Despite protests, Chinese vessels linger in West Philippine Sea - Rappler", "description": "'This is evidence of the Chinese militia's shell game in the Spratly Islands,' says the Asia Maritime Transparency Initiative of the Center for Strategic and International Studies", "url": "https://www.rappler.com/nation/despite-protests-china-vessels-linger-west-philippine-sea-amti-csis-october-2021", "urlToImage": "https://assets2.rappler.com/2021/10/Union-Banks-10-17-21-WM-1-1635085964660.jpeg", "publishedAt": "2021-10-24T14:40:00Z", "content": "The think tank said Chinese ships, ranging in size from 40 to 50 meters, were first visible through imagery as early as April 9. In June, the ships numbered at about five in the area, although in mid… [+147 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore to resume travel from South Asia, eases measures for those from Malaysia, Indonesia - The Star Online", "description": "Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust border measures in response to the global Covid-19 situation.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/24/singapore-to-resume-travel-from-south-asia-eases-measures-for-those-from-malaysia-indonesia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/24/1343238.jpg", "publishedAt": "2021-10-24T10:48:00Z", "content": "SINGAPORE, Oct 24 (The Straits Times/ANN): Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust bo… [+4234 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Actress Gong Li reportedly giving up Singapore citizenship - AsiaOne", "description": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport. The 55-year-old is allegedly renouncing her citizenship due to sweeping crackdowns on the C…", "url": "https://www.asiaone.com/entertainment/actress-gong-li-reportedly-giving-singapore-citizenship", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/241021_gongli_reuters.jpg?h=0429cc9e&itok=gD94y1gM", "publishedAt": "2021-10-24T04:40:00Z", "content": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport.\r\nThe 55-year-old is allegedly r… [+1751 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I felt doctors were all liars': Sheila Sim on the resentment she had after her brother died - AsiaOne", "description": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her. The 37-year-old model-actress confessed that she resented doctors for a period of time as sh…", "url": "https://www.asiaone.com/entertainment/i-felt-doctors-were-all-liars-sheila-sim-resentment-she-had-after-her-brother-died", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/sheilasim_mewatch.jpg?h=ffd08fb1&itok=rpRbFlr0", "publishedAt": "2021-10-24T01:30:00Z", "content": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her.\r\nThe 37-year-old model-actress c… [+2507 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dengue cluster in your neighbourhood? Here's what you need to know and do - AsiaOne", "description": "In 2020, Singapore had a “historic” dengue outbreak, with a total of 35,315 reported cases. Then in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aedes aegypti breed have grown by 30 per cent in April, compar…", "url": "https://www.asiaone.com/lifestyle/dengue-cluster-your-neighbourhood-heres-what-you-need-know-and-do", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/201021_mosquitodengue_unsplash.jpg?h=4c9e7946&itok=AleDwB-J", "publishedAt": "2021-10-23T11:30:00Z", "content": "In 2020, Singapore had a historic dengue outbreak, with a total of 35,315 reported cases.\r\nThen in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aed… [+4850 chars]"}]}