{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The-afc.com"}, "author": "AFC", "title": "AFC Asian Cup:Line-up for AFC Asian Cup China 2023™ Qualifiers Final Round unveiled - The Official Home of Asian Football", "description": "Kuala Lumpur: With two years to go to Asia’s flagship men’s national team tournament, the Asian Football Confederation (AFC) has today confirmed the 22 out of 24 teams who have advanced to the AFC Asian Cup China 2023™ Qualifiers Final Round.", "url": "https://www.the-afc.com/competitions/afc-asian-cup/news/line-up-for-afc-asian-cup-china-2023tm-qualifiers-final-round-unveiled", "urlToImage": "https://www.the-afc.com/img/image/upload/t_l10/v1598672665/ryrvcfaz1bg7ylbidagi.jpg", "publishedAt": "2021-06-16T07:29:44Z", "content": "Kuala Lumpur: With two years to go to Asias flagship mens national team tournament, the Asian Football Confederation (AFC) has today confirmed the 22 out of 24 teams who have advanced to the AFC Asia… [+1463 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Xiang Yun on Huang Wenyong, meeting husband Edmund Chen, cries after watching clips from celebs like Elvin Ng and Felicia Chin - AsiaOne", "description": "Xiang Yun is celebrating her 40th anniversary in showbiz and many of her colleagues are showering her with messages of encouragement. In fact, she was so touched that she even cried. On the Mediacorp series Just Swipe Lah, the 57-year-old talked about her ill…", "url": "https://www.asiaone.com/entertainment/xiang-yun-huang-wenyong-meeting-husband-edmund-chen-cries-after-watching-clips-celebs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/xiangyun_screengrab.jpg?h=3b1f7915&itok=e6YZNEle", "publishedAt": "2021-06-16T04:15:00Z", "content": "Xiang Yun is celebrating her 40th anniversary in showbiz and many of her colleagues are showering her with messages of encouragement.\r\nIn fact, she was so touched that she even cried.\r\nOn the Mediaco… [+3034 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "SPACE RACE: NASA Chief Predicts Race With China To Put Next Human On Moon - EurAsian Times", "description": "The race to put humans on the moon will see the US competing with China, this time. Even though the US did land humans on the moon way back in 1969 while competing with USSR, but this time the competitor has changed.  Chinese technical prowess demonstrated by…", "url": "https://eurasiantimes.com/space-race-nasa-chief-predicts-race-with-china-to-put-next-human-on-moon/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2020/12/china-e1607226019207.jpeg", "publishedAt": "2021-06-16T03:49:06Z", "content": "The race to put humans on the moon will see the US competing with China, this time. Even though the US did land humans on the moon way back in 1969 while competing with USSR, but this time the compet… [+2301 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Call the police': Woman without mask on bus taunts SBS Transit staff - AsiaOne", "description": "More than a year into the pandemic, some people in Singapore still refuse to abide by Covid-19 rules. On Monday (June 14) night, a woman made a scene aboard bus service 69 in Bedok as she refused to wear a face mask. A passenger told Shin Min Daily News that …", "url": "https://www.asiaone.com/singapore/call-police-woman-without-mask-bus-taunts-sbs-transit-staff-bedok", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/bedokbusnomask.jpg?h=0429cc9e&itok=ZKXjv0lN", "publishedAt": "2021-06-16T02:40:45Z", "content": "More than a year into the pandemic, some people in Singapore still refuse to abide by Covid-19 rules.\r\nOn Monday (June 14) night, a woman made a scene aboard bus service 69 in Bedok as she refused to… [+1485 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'If he dies, I also die with him': Man who rescued son after electric shock from lamp post says he feared the worst - AsiaOne", "description": "It was his day off and he was resting at home, nursing a fever after getting his second Covid-19 vaccine dose a day earlier. Mr Muhammad Nazlan was watching TV with his wife on Sunday night while their three children were out at the playground, located about …", "url": "https://www.asiaone.com/singapore/if-he-dies-i-also-die-him-man-who-rescued-son-after-electric-shock-lamp-post-says-he", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/image_710.jpg?h=158ec70b&itok=cdHEv8wg", "publishedAt": "2021-06-16T00:44:28Z", "content": "It was his day off and he was resting at home, nursing a fever after getting his second Covid-19 vaccine dose a day earlier.\r\nMr Muhammad Nazlan was watching TV with his wife on Sunday night while th… [+4263 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Chilly response: Former PAP MP gets a taste of winter after angry netizens flood his Instagram account with snowflake emoticon - The Online Citizen Asia", "description": "The Online Citizen Asia Chilly response: Former PAP MP gets a taste of winter after angry netizens flood his Instagram account with snowflake emoticon Community", "url": "https://www.theonlinecitizen.com/2021/06/15/chilly-response-former-pap-mp-gets-a-taste-of-winter-after-angry-netizens-flood-his-instagram-account-with-snowflake-emoticon/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/06/snowflake_amrin_elsa.jpg", "publishedAt": "2021-06-15T13:25:38Z", "content": "Former People’s Action Party (PAP) Member of Parliament (MP) Amrin Amin gets a taste of winter after netizens began flooding his Instagram account with the snowflake emoticon under his most recent po… [+5414 chars]"}]}