{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "High cholesterol levels: Why taking your medicine diligently is more effective than changing your diet - Channel NewsAsia", "description": "A local study revealed medicine is 85 per cent effective compared to exercise and diet (10 per cent to 20 per cent). A doctor also breaks down misconceptions about statins, the most commonly prescribed medicine.", "url": "https://cnalifestyle.channelnewsasia.com/wellness/how-lower-high-cholesterol-levels-medicine-diet-exercise-304936", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--E71I2zm8--/c_crop%2Ch_1191%2Cw_2119%2Cx_1%2Cy_74/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/cna/image/2022/02/28/istock-490758634.jpg?itok=-E1EqP9y", "publishedAt": "2022-03-06T22:55:00Z", "content": "HOW DO THESE MEDICINES WORK?\r\nIn Singapore, nearly two out of 10 adults aged 18 to 69 have high cholesterol, according to the SHP study. \r\nIf youre one of them, youre probably put on statins (includi… [+686 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "5 things to know about vitamin supplements, Lifestyle News - AsiaOne", "description": "Here are five things to know about vitamin supplements! It really depends on the type of vitamin. Some, including vitamin C, can cause stomach irritation or gastric problems when taken on an empty stomach. Others, such as vitamins A, D, E and K, are fat-solub…", "url": "https://www.asiaone.com/lifestyle/5-things-know-about-vitamin-supplements", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/010322_vitaminsupplements_pexels.jpg?h=f15546f5&itok=tXUCbFu-", "publishedAt": "2022-03-05T10:00:00Z", "content": "Here are five things to know about vitamin supplements! \r\n1. Should I take them before or after meals?\r\nIt really depends on the type of vitamin. Some, including vitamin C, can cause stomach irritati… [+1331 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "What to eat and what not to eat when you are down with Covid-19 - AsiaOne", "description": "SINGAPORE - Your head is pounding, your throat is sore. You have a persistent cough and feel very fatigued. You might not be able to smell and taste your food. Yes, you are one of tens of thousands of people in Singapore who have come down with Covid-19. The …", "url": "https://www.asiaone.com/lifestyle/what-eat-and-what-not-eat-when-you-are-down-covid-19", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/050321_sick_pexels.jpg?h=5c13ce74&itok=KGIVpcow", "publishedAt": "2022-03-05T09:35:39Z", "content": "SINGAPORE - Your head is pounding, your throat is sore. You have a persistent cough and feel very fatigued. You might not be able to smell and taste your food.\r\nYes, you are one of tens of thousands … [+6382 chars]"}]}