{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "Luxury brands drop Chinese star Li Yifeng held for hiring sex workers - Channel NewsAsia", "description": "Li Yifeng has been dropped by global brands such as Prada and Remy Martin.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/luxury-brands-drop-chinese-star-li-yifeng-sex-workers-327596", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--3BHZevnp--/c_crop,h_432,w_768,x_0,y_16/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/one-cms/core/b69a25e75f435b1c83212ae29933214edd421e8c.jpg?itok=AF7CVbxN", "publishedAt": "2022-09-13T06:59:00Z", "content": "Global brands including Prada and Remy Martin have cut ties with Chinese superstar Li Yifeng, after the actor was detained for soliciting sex workers.\r\nLi becomes the latest in a line of artists to f… [+1654 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "King Sihamoni, Queen Mother send letter to King Charles III - The Star Online", "description": "PHNOM PENH (The Phnom Penh Post/Asia News Network): King Norodom Sihamoni and Queen Mother Norodom Monineath Sihanouk sent a letter of both condolences and congratulations to King Charles III of the United Kingdom of Great Britain and Northern Ireland on his …", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/09/13/king-sihamoni-queen-mother-send-letter-to-king-charles-iii", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/09/13/1735552.jpg", "publishedAt": "2022-09-13T06:50:00Z", "content": "PHNOM PENH (The Phnom Penh Post/Asia News Network): King Norodom Sihamoni and Queen Mother Norodom Monineath Sihanouk sent a letter of both condolences and congratulations to King Charles III of the … [+1797 chars]"}, {"source": {"id": null, "name": "The West Australian"}, "author": "Miriam Fisher", "title": "Changesite-(Y) lunar mineral discovery ignites fierce China-US space race as powers inch towards moon mining - The West Australian", "description": "The space race between China and the United States has ramped up amid news the Asian power plans to launch three unmanned missions to the moon over the next 10 years with a view to mining it for resources.", "url": "https://thewest.com.au/news/world/changesite-y-lunar-mineral-discovery-ignites-fierce-china-us-space-race-as-powers-inch-towards-moon-mining-c-8222868", "urlToImage": "https://images.thewest.com.au/publication/C-8222868/3f0d8fe195956814e730d9aaed8a46b75b8bf024-16x9-x0y4w940h529.jpg?imwidth=1200", "publishedAt": "2022-09-13T06:41:00Z", "content": "The space race emerging between China and the United States has ramped up amid news the Asian superpower plans to launch three unmanned missions to the moon over the next 10 years.\r\nAccording to Stat… [+4365 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Ganguly Is Not Like This\": Fans React On Video Showing Ramiz Raja Snapping At Indian Journalist - NDTV Sports", "description": "Asia Cup: After the final, Pakistan Cricket Board chief Ramiz Raja was asked by an Indian journalist about what message he would like to give to Pakistan people who were unhappy with the loss", "url": "https://sports.ndtv.com/asia-cup-2022/ganguly-is-not-like-this-fans-react-on-video-showing-ramiz-raja-snapping-at-indian-journalist-3339352", "urlToImage": "https://c.ndtvimg.com/2021-11/mhp13ovg_ramiz-raja-afp_625x300_16_November_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-09-13T03:10:49Z", "content": "Sunday clearly did not belong to the Pakistan cricket team in the Asia Cup final. The Babar Azam-led side looked like taking control early on when they reduced Sri Lanka to 58/5 but Bhanuka Rajapaksa… [+2358 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "NASA Only 2 Weeks Away From World’s First ‘Interplanetary Defense’ Test; DART Mission To Strike Asteroid Dimorphos - EurAsian Times", "description": "The US Double Asteroid Redirection Test (DART), the world’s first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos on  September 26, NASA and Johns Hopkins Applied Physics La…", "url": "https://eurasiantimes.com/nasa-2-weeks-away-from-worlds-first-interplanetary-defense-test-dart/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/07/nasa-space.jpg", "publishedAt": "2022-09-12T16:56:31Z", "content": "The US Double Asteroid Redirection Test (DART), the worlds first mission to test technology for defending Earth against potential asteroid or comet hazards, will impact its target asteroid Dimorphos … [+7440 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Just walk down Orchard Road, there are diamond shops everywhere': Maddy Barber on why she picks alternative gems over diamonds - AsiaOne", "description": "Ever wondered what CEOs and founders are like? Are they all work and no play? Do they have a nurturing or intimidating personality? In Employee No. 1, catch a glimpse of what it is like being a homegrown boss under 50. Take an inside look into their day, how …", "url": "https://www.asiaone.com/lifestyle/madly-gems-just-walk-down-orchard-road-there-are-diamond-shops-everywhere-maddy-barber-why-she-picks", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/120922_maddy_main.jpg?h=2e181f1f&itok=zbNcge9I", "publishedAt": "2022-09-12T10:59:00Z", "content": "Ever wondered what CEOs and founders are like? Are they all work and no play? Do they have a nurturing or intimidating personality? In Employee No. 1, catch a glimpse of what it is like being a homeg… [+5588 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Asia's “twindemic”: dengue fever cases rocket as covid-19 rages on - The BMJ", "description": "With the covid-19 pandemic ongoing, a devastating rise in dengue fever cases is putting severe pressure on Asia’s health systems, reports Sonia Sarkar \n\nFor Khoa Tran Dang, July was a harrowing month. The government run hospital where he works was inundated w…", "url": "https://www.bmj.com/content/378/bmj.o2090", "urlToImage": "", "publishedAt": "2022-09-12T09:40:55Z", "content": "<ol><li>Sonia Sarkar, freelance journalist</li></ol><ol><li>New Delhi, India\r\n</li></ol><ol><li>26.sarkar{at}gmail.com</li></ol>\r\nWith the covid-19 pandemic ongoing, a devastating rise in dengue feve… [+9477 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I had to figure out who my real friends were': 1990s top TV host Zhu Yongqin left showbiz to sell insurance - AsiaOne", "description": "This ex-TV host had to go well out of his comfort zone in pursuit of success. In a recent interview with Shin Min Daily News, the prominent 1990s TV host Zhu Yongqin explained his reason for leaving showbiz and becoming an insurance salesman. \"Singapore's ent…", "url": "https://www.asiaone.com/entertainment/figure-out-who-real-friends-were-1990s-top-tv-host-zhu-yongqin-left-showbiz-sell-insurance", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/zhu%20yongqin2%20%281%29.jpg?h=e654ec1b&itok=fel4hWRP", "publishedAt": "2022-09-12T06:44:00Z", "content": "This ex-TV host had to go well out of his comfort zone in pursuit of success.\r\nIn a recent interview with Shin Min Daily News, the prominent 1990s TV host Zhu Yongqin explained his reason for leaving… [+2453 chars]"}, {"source": {"id": null, "name": "Asianscientist.com"}, "author": "Asian Scientist Newsroom", "title": "Supporting Safe and Efficient Work With cPass™ Testing - Asian Scientist Magazine", "description": "GenScript’s cPass serology test helped one construction firm, AcroMeta Group, ensure employees could make informed decisions on their individual COVID-19 risk and prevention.", "url": "https://www.asianscientist.com/2022/09/sponsored-feature/supporting-safe-and-efficient-work-with-cpass-testing/", "urlToImage": "https://www.asianscientist.com/wp-content/uploads/2022/08/cPass-article-banner-1024x1024.png", "publishedAt": "2022-09-12T04:01:59Z", "content": "Asian Scientist Magazine (Sep. 12, 2022) As Singapore stares down a fifth wave of COVID-19 infections driven by the Omicron variants, BA.4 and BA.5a dark horse looms in the form of subvariant BA.2.75… [+2935 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Dawn.com", "title": "Pakistan vs Sri Lanka: Live score, commentary for Asia Cup 2022 final on September 11 - DAWN.com", "description": "Horror start to chase and laborious batting in middle overs causes Green Shirts' downfall; earlier, defensive captaincy had allowed Sri Lanka to post 171.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2022/09/112249459b0f54a.jpg?r=225101", "publishedAt": "2022-09-11T14:26:38Z", "content": "A horror start to their run chase and laborious batting in the middle overs consigned Pakistan to a 23-run defeat at the hands of Sri Lanka in the final of the Asia Cup 2022 at the Dubai Internationa… [+24048 chars]"}]}