{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "JON VIKTOR D. CABUENAS, GMA Integrated News", "title": "Marcos, First Lady join leaders at APEC Gala Dinner - GMA News Online", "description": "BANGKOK &mdash; President Ferdinand &ldquo;Bongbong&rdquo; Marcos Jr. and the First Lady Marie Louise &ldquo;Liza&rdquo; Araneta-Marcos attended a gala dinner as part of the events of this year&rsquo;s Asia Pacific Economic Cooperation (APEC) Leaders&rsquo;s …", "url": "https://www.gmanetwork.com/news/topstories/nation/851825/marcos-first-lady-join-leaders-at-apec-gala-dinner/story/", "urlToImage": "https://images.gmanews.tv/webpics/2022/11/Marcos_and_FL_at_Gala_dinner_2022_11_18_00_19_28.png", "publishedAt": "2022-11-17T16:21:39Z", "content": "BANGKOK — President Ferdinand “Bongbong” Marcos Jr. and the First Lady Marie Louise “Liza” Araneta-Marcos attended a gala dinner as part of the events of this year’s Asia Pacific Economic Cooperation… [+849 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Krutika Pathi", "title": "US VP Harris arrives in Thailand for Asia-Pacific summit - The Associated Press - en Español", "description": "BANGKOK (AP) — U.S. Vice President Kamala Harris arrived Thursday in Thailand, where she plans to affirm America's commitment to Southeast Asia and drive home the message that the region can count on the United States.", "url": "https://apnews.com/article/g-20-summit-biden-china-united-states-asia-33bb0e1cf15bc4e79c13300a9c726d6d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/afs:Medium:751921853724/700.png", "publishedAt": "2022-11-17T16:01:37Z", "content": "BANGKOK (AP) U.S. Vice President Kamala Harris arrived Thursday in Thailand, where she plans to affirm Americas commitment to Southeast Asia and drive home the message that the region can count on th… [+2684 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "‘Very Impressive’: NASAMS Thwarting Russian Attacks With 100% Precision; Expert Says Deployed To Defend Leadership - EurAsian Times", "description": "NASAMS (National Advanced Surface-to-Air Missile System) had a 100% success rate in Ukraine thwarting Russian attacks, US Defense Secretary Lloyd Austin said on Wednesday. Austin also said that the NASAMS that the US had sent to Ukraine are fully operational,…", "url": "https://eurasiantimes.com/very-impressive-nasams-thwarting-russian-targets-with-100-precision/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/08/MISSILE-RUSSIA-1.png", "publishedAt": "2022-11-17T09:50:07Z", "content": "NASAMS (National Advanced Surface-to-Air Missile System) had a 100% success rate in Ukraine thwarting Russian attacks, US Defense Secretary Lloyd Austin said on Wednesday.\r\nAustin also said that the … [+7772 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Mad respect for you': Ice cream boss explains why his cafe isn't halal-certified, wins netizens' approval - AsiaOne", "description": "Heartbreak Melts has been making quite a name for itself of late. With rave reviews aplenty, the ice cream cafe, located in Ang Mo Kio, has also been receiving queries from the general public. A question that seems to continuously pop up, particularly from Mu…", "url": "https://www.asiaone.com/lifestyle/mad-respect-you-ice-cream-boss-explains-why-his-cafe-heartbreak-melts-isnt-halal-certified-wins-netizens", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/171122_heartbreakmelts_HL.jpg?h=0429cc9e&itok=-ws2mZ4V", "publishedAt": "2022-11-17T08:40:00Z", "content": "Heartbreak Melts has been making quite a name for itself of late.\r\nWith rave reviews aplenty, the ice cream cafe, located in Ang Mo Kio, has also been receiving queries from the general public.\r\nA qu… [+2686 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Sheila Sim drinks before movie Geylang's kiss scene 'to boost her courage' - AsiaOne", "description": "Even for a seasoned actress like Sheila Sim, a little bit of liquid courage can help. In a recent interview with Lianhe Zaobao, local director Boi Kwong revealed that Sheila Sim had to down some alcohol before she could gather enough nerves to film her first …", "url": "https://www.asiaone.com/entertainment/sheila-sim-drinks-movie-geylangs-kiss-scene-boost-her-courage", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/171122_sheilasim_insta.jpg?h=a3d24b08&itok=cUqL1skw", "publishedAt": "2022-11-17T07:18:00Z", "content": "Even for a seasoned actress like Sheila Sim, a little bit of liquid courage can help.\r\nIn a recent interview with Lianhe Zaobao, local director Boi Kwong revealed that Sheila Sim had to down some alc… [+1805 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'At least let me hug an oppa': Hong Huifang added unscripted scene of her embracing Yeo Jin-goo in Ajoomma - AsiaOne", "description": "Perfectly reasonable, or irresistible? It seems Ajoomma actress Hong Huifang was too enthralled with co-star Yeo Jin-goo during one of their scenes together. The film's director He Shuming dropped this juicy piece of information during a press conference with…", "url": "https://www.asiaone.com/entertainment/least-let-me-hug-oppa-hong-huifang-added-unscripted-scene-her-embracing-yeo-jin-goo-ajoomma", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/honghuifangYeojingoo.jpeg?h=4a5c7968&itok=Wza9JXHc", "publishedAt": "2022-11-17T05:53:00Z", "content": "Perfectly reasonable, or irresistible?\r\nIt seems Ajoomma actress Hong Huifang was too enthralled with co-star Yeo Jin-goo during one of their scenes together.\r\nThe film's director He Shuming dropped … [+2105 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "Marcos to discuss West Philippine Sea with Xi at sidelines of APEC meet - Philstar.com", "description": "President Ferdinand Marcos Jr. is set to meet with Chinese President Xi Jinping at the sidelines of the Asia-Pacific Economic Cooperation Summit in Thailand where he is expected to discuss the situation in the West Philippine Sea.", "url": "https://www.philstar.com/headlines/2022/11/17/2224476/marcos-discuss-west-philippine-sea-xi-sidelines-apec-meet", "urlToImage": "https://media.philstar.com/photos/2022/05/12/xi-jinping-bongbong-marcos_2022-05-12_15-12-43.jpg", "publishedAt": "2022-11-17T01:44:00Z", "content": "MANILA, Philippines — President Ferdinand Marcos Jr. is set to meet with Chinese President Xi Jinping at the sidelines of the Asia-Pacific Economic Cooperation Summit in Thailand where he is expected… [+1540 chars]"}]}