{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Species of Armored Dinosaur Unearthed in China - SciTechDaily", "description": "A new species of armored dinosaur has been described from China. It is the earliest fossil remains from this group to be found in Asia, adding to the understanding of how these curious dinosaurs evolved and spread around the world. Armored dinosaurs are some …", "url": "https://scitechdaily.com/new-species-of-armored-dinosaur-unearthed-in-china/", "urlToImage": "https://scitechdaily.com/images/New-Armored-Dinosaur-Asia-Reconstruction.jpg", "publishedAt": "2022-03-18T16:56:50Z", "content": "This is the earliest armored dinosaur found in all of Asia, and is helping our understanding of when and where these animals first appeared. Credit: ©Yu Chen\r\nA new species of armored dinosaur has be… [+6281 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Recovered from Covid-19 but still have difficulty breathing? This doctor shares some useful exercises to try - AsiaOne", "description": "As of late, it seems like everyone is contracting Covid-19 thanks to the more infectious Omicron variant. While some people manage to recover with little to no symptoms, others experience issues like difficulty in breathing and sleeping. If you too are facing…", "url": "https://www.asiaone.com/lifestyle/recovered-covid-19-still-have-difficulty-breathing-doctor-shares-some-useful-exercises", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/20221803%20Breathing%20exercises%20covid%20.jpg?h=a8a6ca33&itok=E5vBJRyK", "publishedAt": "2022-03-18T08:40:00Z", "content": "As of late, it seems like everyone is contracting Covid-19 thanks to the more infectious Omicron variant.\r\nWhile some people manage to recover with little to no symptoms, others experience issues lik… [+2587 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "Timor-Leste's Ramos-Horta makes pitch for stability ahead of election - amp.rnz.co.nz", "description": "The frontrunner in Timor-Leste's presidential election, independence figure and Nobel laureate Jose Ramos-Horta, has said he hopes to restore political stability to Asia's youngest democracy, as the nation prepares to head to the polls.", "url": "https://www.rnz.co.nz/news/world/463593/timor-leste-s-ramos-horta-makes-pitch-for-stability-ahead-of-election", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/140267/eight_col_000_324X3T9.jpg?1647583552", "publishedAt": "2022-03-18T07:18:45Z", "content": "The frontrunner in Timor-Leste's presidential election, independence figure and Nobel laureate Jose Ramos-Horta, has said he hopes to restore political stability to Asia's youngest democracy, as the … [+2318 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "'Perfect Luke Skywalker': Star Wars actor Mark Hamill approves of child actor playing iconic character - Channel NewsAsia", "description": "The child actor, Grant Feely, plays a young Luke Skywalker in the upcoming Disney+ series, Obi-Wan Kenobi, which stars Ewan McGregor and Hayden Christensen.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/obi-wan-kenobi-young-luke-skywalker-mark-hamill-disney-plus-307456", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--__gD1l2d--/c_crop,h_383,w_680,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/03/18/mark_hamill_luke_skywalker.jpg?itok=wqpt7ucy", "publishedAt": "2022-03-18T04:55:07Z", "content": "In the teaser trailer, we see the young Luke play pretending to drive a vehicle perhaps a landspeeder as Obi-Wan (played by Ewan McGregor) watches him from afar.   \r\nObi-Wan Kenobi, premiering on Dis… [+594 chars]"}]}