{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "soompi"}, "author": "eclipse01", "title": "2021 MAMA To Open With Joint Performance By Members Of Stray Kids, ATEEZ, TXT, ITZY, aespa, And ENHYPEN - soompi", "description": "Get ready for an exciting collaboration between Stray Kids, ATEEZ, TXT, ITZY, aespa, and ENHYPEN at the 2021 Mnet Asian Music Awards (MAMA)! On December 10, the 2021 MAMA officially announced that its opening performance would feature members of six fourth-ge…", "url": "https://www.soompi.com/article/1503022wpp/2021-mama-to-open-with-joint-performance-by-members-of-stray-kids-ateez-txt-itzy-aespa-and-enhypen", "urlToImage": "https://6.viki.io/image/23cc906c147a49ceaaf10697bcfee33c/dummy.jpeg?s=900x600&e=t", "publishedAt": "2021-12-10T00:40:44Z", "content": "Get ready for an exciting collaboration between Stray Kids, ATEEZ, TXT, ITZY, aespa, and ENHYPEN at the 2021 Mnet Asian Music Awards (MAMA)!\r\nOn December 10, the 2021 MAMA officially announced that i… [+454 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "These are the skills Singaporeans urgently need in the next 3 years: SkillsFuture report - AsiaOne", "description": "SINGAPORE - The skills most urgently needed by Singaporeans have been identified in a new report by SkillsFuture Singapore (SSG). The inaugural Skills Demand For The Future Economy report was launched by Education Minister Chan Chun Sing on Wednesday (Dec 8).…", "url": "https://www.asiaone.com/singapore/these-are-skills-singaporeans-urgently-need-next-3-years-skillsfuture-report", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/20211208_skills_stfile.jpg?h=0429cc9e&itok=oOcJgwyI", "publishedAt": "2021-12-08T06:11:54Z", "content": "SINGAPORE - The skills most urgently needed by Singaporeans have been identified in a new report by SkillsFuture Singapore (SSG).\r\nThe inaugural Skills Demand For The Future Economy report was launch… [+3396 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Singapore boasts 6 spots on World's 50 Best Bars 2021 list - CNA", "description": "London's Connaught Bar is the world's best, while Jigger & Pony is Singapore's only entry in the Top 10 at No 9. Atlas lost its The Best Bar in Asia title, which it had held for two years.", "url": "https://cnalifestyle.channelnewsasia.com/dining/worlds-50-best-bars-singapore-jigger-pony-atlas-manhattan-291806", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--HApge_gy--/c_crop%2Ch_540%2Cw_959%2Cx_1%2Cy_0/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/jigger---pony-instagram.jpg?itok=N0Cvra1s", "publishedAt": "2021-12-08T04:57:00Z", "content": "Nightlife in Singapore may have quieted down during the pandemic but that hasnt stopped some of our local drinking establishments from topping the Worlds 50 Best Bars 2021 list. \r\nSix bars in Singapo… [+406 chars]"}]}