{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Automated clearance to be the norm for all travellers into Singapore from 2023: ICA - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): From next year, all travellers will be able to use automated lanes upon arrival into Singapore for faster immigration clearance, said the Immigration and Checkpoints Authority (ICA) on Tuesday (Feb 15).", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/02/15/automated-clearance-to-be-the-norm-for-all-travellers-into-singapore-from-2023-ica", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/02/15/1481612.jpg", "publishedAt": "2022-02-15T01:53:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): From next year, all travellers will be able to use automated lanes upon arrival into Singapore for faster immigration clearance, said the Immigration … [+1881 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Anthony Lim", "title": "2022 World Car of the Year - list of finalists announced - paultan.org - Paul Tan's Automotive News", "description": "The finalists for the 2022 World Car of the Year (WCOTY) have been announced, with 10 models having been shortlisted for the top prize in this year’s awards. Asian manufacturers are well represented in this …", "url": "https://paultan.org/2022/02/14/2022-world-car-of-the-year-list-of-finalists-announced/", "urlToImage": "https://paultan.org/image/2022/02/2022-WCOTY-finalists-montage-1200x628.jpg", "publishedAt": "2022-02-14T05:06:57Z", "content": "The finalists for the 2022 World Car of the Year (WCOTY) have been announced, with 10 models having been shortlisted for the top prize in this year’s awards. Asian manufacturers are well represented … [+1730 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Stop hurting others' Li Jinglei hits back after Wang Leehom files court motion against her - AsiaOne", "description": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle. A Chinese netizen leaked documents last Friday (Feb 11), re…", "url": "https://www.asiaone.com/entertainment/stop-hurting-others-li-jinglei-hits-back-after-wang-leehom-files-court-motion-against", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/image_434.jpg?h=b82b5380&itok=C0Q4AdYo", "publishedAt": "2022-02-13T08:33:09Z", "content": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle.… [+2244 chars]"}]}