{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "Asia Cup 2022 To Be Held In Sri Lanka From August 27, Will Be In T20 Format - NDTV Sports", "description": "The 2022 Asia Cup will be held in Sri Lanka later this year between August 27 and September 11", "url": "https://sports.ndtv.com/cricket/asia-cup-2022-to-be-held-in-sri-lanka-from-august-27-will-be-in-t20-format-2831220", "urlToImage": "https://c.ndtvimg.com/2018-09/a9r374oo_india-asia-cup-trophy-afp_625x300_29_September_18.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-19T10:07:30Z", "content": "The Asian Cricket Council (ACC) on Saturday announced that the upcoming edition of the Asia Cup will be held later this year from August 27 to September 11. The tournament will be played in the T20 f… [+1496 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Glass doors and windows damaged: Several Yishun flats shot with metal ball bearings; police investigating - AsiaOne", "description": "SINGAPORE - The police are investigating complaints from residents in several Yishun blocks that their flats have been shot at with metal ball bearings in the past few months, causing damage to windows and furniture. This has been going on since at least June…", "url": "https://www.asiaone.com/singapore/glass-doors-and-windows-damaged-several-yishun-flats-shot-metal-ball-bearings-police", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/image_872.jpg?h=b82b5380&itok=cUGIvB5R", "publishedAt": "2022-03-19T01:30:19Z", "content": "SINGAPORE - The police are investigating complaints from residents in several Yishun blocks that their flats have been shot at with metal ball bearings in the past few months, causing damage to windo… [+3672 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Xi expected to urge Biden to promote Ukraine peace talks; warn against hurting Chinese interests: State media - The Star Online", "description": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is likely to have a warning or two for the American leader too.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/03/18/xi-expected-to-urge-biden-to-promote-ukraine-peace-talks-warn-against-hurting-chinese-interests-state-media", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/18/1519838.jpg", "publishedAt": "2022-03-18T12:35:00Z", "content": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is li… [+3289 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "Timor-Leste's Ramos-Horta makes pitch for stability ahead of election - amp.rnz.co.nz", "description": "The frontrunner in Timor-Leste's presidential election, independence figure and Nobel laureate Jose Ramos-Horta, has said he hopes to restore political stability to Asia's youngest democracy, as the nation prepares to head to the polls.", "url": "https://www.rnz.co.nz/news/world/463593/timor-leste-s-ramos-horta-makes-pitch-for-stability-ahead-of-election", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/140267/eight_col_000_324X3T9.jpg?1647583552", "publishedAt": "2022-03-18T07:18:45Z", "content": "The frontrunner in Timor-Leste's presidential election, independence figure and Nobel laureate Jose Ramos-Horta, has said he hopes to restore political stability to Asia's youngest democracy, as the … [+2318 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "'Perfect Luke Skywalker': Star Wars actor Mark Hamill approves of child actor playing iconic character - Channel NewsAsia", "description": "The child actor, Grant Feely, plays a young Luke Skywalker in the upcoming Disney+ series, Obi-Wan Kenobi, which stars Ewan McGregor and Hayden Christensen.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/obi-wan-kenobi-young-luke-skywalker-mark-hamill-disney-plus-307456", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--__gD1l2d--/c_crop,h_383,w_680,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/03/18/mark_hamill_luke_skywalker.jpg?itok=wqpt7ucy", "publishedAt": "2022-03-18T04:55:07Z", "content": "In the teaser trailer, we see the young Luke play pretending to drive a vehicle perhaps a landspeeder as Obi-Wan (played by Ewan McGregor) watches him from afar.   \r\nObi-Wan Kenobi, premiering on Dis… [+594 chars]"}]}