{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Siblings with rare disorder in Singapore get cash donations of over $250000 after being featured on social media - AsiaOne", "description": "SINGAPORE - All three of Mr David Lang's children were born healthy, zipping through development milestones as they grew up. Justina, the eldest, could name 100 objects in a picture book at the age of one. Timothy, the middle child, would try and read everyth…", "url": "https://www.asiaone.com/singapore/siblings-rare-disorder-singapore-get-cash-donations-over-250000-after-being-featured", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/image_472.jpg?h=199d8c1f&itok=j_dNB9F_", "publishedAt": "2021-07-11T03:17:29Z", "content": "SINGAPORE - All three of Mr David Lang's children were born healthy, zipping through development milestones as they grew up.\r\nJustina, the eldest, could name 100 objects in a picture book at the age … [+4037 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Health minister Ong says need booster shots while US CDC and FDA say no need - The Online Citizen Asia", "description": "The Online Citizen Asia Health minister Ong says need booster shots while US CDC and FDA say no need Health", "url": "https://www.theonlinecitizen.com/2021/07/10/health-minister-ong-says-need-booster-shots-while-us-cdc-and-fda-say-no-need/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/05/ong-ye-kung.png", "publishedAt": "2021-07-10T08:28:52Z", "content": "During an Instagram live session on Thu (8 Jul), Health Minister Ong Ye Kung said that those who are fully vaccinated most likely need booster shots and the government is looking into it. It was repo… [+1964 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Covid-19 cases climb as South-East Asia feels force of Delta variant - The Star Online", "description": "Having escaped the worst when the coronavirus pandemic erupted last year, South-East Asia is now suffering dramatic rises in deaths and cases, while vaccination shortfalls and highly contagious variants derail containment efforts.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/07/10/covid-19-cases-climb-as-south-east-asia-feels-force-of-delta-variant", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/10/1215612.jpg", "publishedAt": "2021-07-10T03:22:00Z", "content": "BANGKOK, July 9 (Reuters): Having escaped the worst when the coronavirus pandemic erupted last year, South-East Asia is now suffering dramatic rises in deaths and cases, while vaccination shortfalls … [+4447 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "AsiaOne Tries: Is getting an 'invisible' tattoo worth it? - AsiaOne", "description": "Follow host and actress Amanda Chaang as she embarks on a journey to become the most ‘influential’ millennial in our new series, AsiaOne Tries. You've probably seen them all over Instagram — those tattoos that are practically invisible but glow vibrantly unde…", "url": "https://www.asiaone.com/lifestyle/asiaone-tries-getting-invisible-tattoo-worth-it", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/tattoo.jpg?h=2e181f1f&itok=JCwaNyI7", "publishedAt": "2021-07-09T10:00:00Z", "content": "Follow host and actress Amanda Chaang as she embarks on a journey to become the most influential millennial in our new series, AsiaOne Tries. \r\nYou've probably seen them all over Instagram  those tat… [+5364 chars]"}]}