{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chidanand Rajghatta", "title": "Gun-toting Taliban seek Afghanistan's UN seat; world says no, not yet - Times of India", "description": "South Asia News:  A hirsute bunch of unelected, gun-wielding militants who go by the name Taliban, and who have overrun Afghanistan and disenfranchised half its popula", "url": "https://timesofindia.indiatimes.com/world/south-asia/gun-toting-taliban-seek-afghanistans-un-seat-world-says-no-not-yet/articleshow/86434202.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86434186,width-1070,height-580,imgsize-69336,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-09-22T17:20:00Z", "content": "German FM says Taliban 'show' at UN would serve no purposeUNITED NATIONS: Germany on Wednesday voiced opposition to the Taliban's request to address the United Nations, saying the \"show\" by Afghanist… [+152 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": "Louise Maureen Simeon", "title": "ADB keeps Philippine growth outlook at 4.5% for 2021 - Philstar.com", "description": "The Asian Development Bank has retained its 2021 economic growth outlook for the Philippines at 4.5 percent, but warned of continued downside risks from more transmissible COVID variants that may lead to fresh spikes in cases and lockdown measures.", "url": "https://www.philstar.com/business/2021/09/23/2128987/adb-keeps-philippine-growth-outlook-45-2021", "urlToImage": "https://media.philstar.com/photos/2021/09/22/adb_2021-09-22_19-25-37.jpg", "publishedAt": "2021-09-22T16:00:00Z", "content": "MANILA, Philippines — The Asian Development Bank (ADB) has retained its 2021 economic growth outlook for the Philippines at 4.5 percent, but warned of continued downside risks from more transmissible… [+4095 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Don't buy Chinese phones, throw them away if you have, Lithuania says - AsiaOne", "description": "Lithuania’s defence ministry recommended that consumers avoid buying Chinese mobile phones and advised people to throw away the ones they have now after a government report found the devices had built-in censorship capabilities. Flagship phones sold in Europe…", "url": "https://www.asiaone.com/world/dont-buy-chinese-phones-throw-them-away-if-you-have-lithuania-says", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/20210922_5G_REUTERS.jpg?h=8cfdd18d&itok=9fjgJMj8", "publishedAt": "2021-09-22T07:02:45Z", "content": "Lithuanias defence ministry recommended that consumers avoid buying Chinese mobile phones and advised people to throw away the ones they have now after a government report found the devices had built… [+2173 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Hong Kong quietly widens national security law with subtle shift - The Straits Times", "description": "Lawyers said the shift could expand the reach of a government crackdown on dissent in the Asian financial hub.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/east-asia/hong-kong-quietly-widens-national-security-law-with-subtle-shift", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/09/22/ak_hkcov_220921.jpg?itok=e2RvfyZM", "publishedAt": "2021-09-21T22:33:56Z", "content": "HONG KONG (BLOOMBERG) - Hong Kong has quietly broadened the language it uses to describe national security violations, a shift lawyers said could expand the reach of a government crackdown on dissent… [+4657 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "This new cat cafe in the East has adorable kitty meringue biscuits and a cute owner to boot - AsiaOne", "description": "Many cat lovers can only fantasise about owning a house full of kitties but one lucky man is living the dream with his newly-opened cat cafe. Paws Claws Petstore, which opened on Sept 16, is founded by content creator Adi Rusydi A. Rahman and has over a dozen…", "url": "https://www.asiaone.com/lifestyle/new-cat-cafe-east-has-adorable-kitty-meringue-biscuits-and-cute-owner-boot", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/paws%20claws%20%281%29.jpg?h=6c043f29&itok=jHRwhbNN", "publishedAt": "2021-09-21T10:52:50Z", "content": "Many cat lovers can only fantasise about owning a house full of kitties but one lucky man is living the dream with his newly-opened cat cafe.\r\nPaws Claws Petstore, which opened on Sept 16, is founded… [+2162 chars]"}]}