{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Recto Mercene", "title": "Make 'South China Sea a watery highway for trade, connection' - Locsin | Recto Mercene - Business Mirror", "description": "FOREIGN Affairs Secretary Teodoro L. Locsin Jr. appealed to fellow members of the Association of Southeast Asian Nations (Asean) to view South China Sea as “a watery highway for trade and connection.” Locsin reiterated the country’s commitment to the full imp…", "url": "https://businessmirror.com.ph/2021/06/10/make-south-china-sea-a-watery-highway-for-trade-connection-locsin/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/world02-060921.jpg", "publishedAt": "2021-06-09T16:13:48Z", "content": "FOREIGN Affairs Secretary Teodoro L. Locsin Jr. appealed to fellow members of the Association of Southeast Asian Nations (Asean) to view South China Sea as a watery highway for trade and connection.\r… [+3609 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "Davina Tham", "title": "Vietnam's proposal to postpone SEA Games opposed by most member states: Malaysian Olympic council - CNA", "description": "SINGAPORE: Eight out of 11 member states of the Southeast Asian Games Federation have objected to Vietnam's proposal to postpone the competition over COVID-19 fears, according to the Olympic Council of Malaysia (OCM).", "url": "https://www.channelnewsasia.com/news/sport/vietnam-postpone-sea-games-covid-19-meeting-oppose-14980660", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14980916/16x9/991/557/3dc7f68b7e55ec50b2c82f4413bfe577/FS/2019-sea-games-file-photo.jpg", "publishedAt": "2021-06-09T15:02:49Z", "content": "SINGAPORE: Eight out of 11 member states of the Southeast Asian Games Federation have objected to Vietnam's proposal to postpone the competition over COVID-19 fears, according to the Olympic Council … [+2291 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Gelo Gonzales", "title": "Alibaba to build first data center in Philippines by end of 2021 - Rappler", "description": "The Philippines will become the 4th country in Southeast Asia to have a local Alibaba Cloud data center, following Singapore, Malaysia, and Indonesia", "url": "https://www.rappler.com/technology/alibaba-cloud-first-data-center-philippines", "urlToImage": "https://assets2.rappler.com/2021/06/Alibaba-Cloud-Data-Center_press-release-photo-1623227429227.jpg", "publishedAt": "2021-06-09T08:37:00Z", "content": "Cloud computing has become central to the digitalization of businesses in the Philippines and around Asia. With our first data center in the country, we will be able to better support Philippine ente… [+177 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Astrologer predicts Singapore should be prepared for 'at least' 2 more waves of instability - AsiaOne", "description": "May Sim has a prediction for Singaporeans they won't be happy to hear. And that is there'll be \"at least two more cycles\" of economic and social uncertainty to come, and the world will \"get into some stability\" only after 2023, said the astrologer, based on w…", "url": "https://www.asiaone.com/lifestyle/astrologer-predicts-singapore-should-be-prepared-least-2-more-waves-instability", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/maysim.jpg?h=45c42658&itok=QyIZztqe", "publishedAt": "2021-06-09T04:32:00Z", "content": "May Sim has a prediction for Singaporeans they won't be happy to hear. \r\nAnd that is there'll be \"at least two more cycles\" of economic and social uncertainty to come, and the world will \"get into so… [+11230 chars]"}]}