{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Orange is the new white: Priscilla Ku decks her Christmas tree with dozens of Hermes boxes - AsiaOne", "description": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas ‘tree’ to promote environmental causes, to people lighting up their homes with fairy lights. One woman who is giving th…", "url": "https://www.asiaone.com/entertainment/orange-new-white-priscilla-ku-decks-her-christmas-tree-dozens-hermes-boxes", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_priscilla%20ku.png?h=7d6973a9&itok=TVOJuRuD", "publishedAt": "2022-12-05T10:24:00Z", "content": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas tree to promote environmental causes, to people lighting up… [+2670 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Hong Kong stars are really low-key': Andy Lau spotted at daughter's school performance - AsiaOne", "description": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too. Netizens were pleasantly surprised to see the Hong Kong singer-actor at a school performance on Friday (Dec…", "url": "https://www.asiaone.com/entertainment/hong-kong-stars-are-really-low-key-andy-lau-spotted-daughters-school-performance", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_andy%20lau%20school.png?h=62c6da03&itok=0GH6SjkN", "publishedAt": "2022-12-05T04:30:00Z", "content": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too.\r\nNetizens were pleasantly surprised to see the … [+1654 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": "The Online Citizen", "title": "Former NTUC Income CEO raises questions on Temasek's FTX investment - The Online Citizen Asia", "description": "The Online Citizen Asia Former NTUC Income CEO raises questions on Temasek's FTX investment Singapore", "url": "https://www.theonlinecitizen.com/2022/12/05/former-ntuc-income-ceo-raises-questions-on-temaseks-ftx-investment/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2022/12/Tankinlian-Temasek.png", "publishedAt": "2022-12-05T03:53:59Z", "content": "SINGAPORE Mr Tan Kin Lian, former NTUC Income CEO, raises questions as to whether Temasek Holdings, Singapore’s sovereign wealth fund, was run like a venture capital and the transparency of its appro… [+5382 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Women are more burnt out than men – here's why, and what to do if you're chronically overwhelmed - Channel NewsAsia", "description": "In an episode of the Womankind podcast, CNA Women's Hidayah Salamat asks a former corporate lawyer and co-founder of an online mental health platform why women appear disproportionately more affected by burnout – and the simplest way to stop it in its tracks.", "url": "https://cnalifestyle.channelnewsasia.com/women/burnout-gender-norms-society-womankind-podcast-340736", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--iKBlXTnT--/c_crop,h_752,w_1338,x_0,y_13/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/12/01/istock-1325954106.jpg?itok=BpW4wgEm", "publishedAt": "2022-12-04T23:00:00Z", "content": "For example, with more women entering domains traditionally dominated by men, there is a tendency to believe that they need to do more to receive the same amount of recognition as the opposite sex, J… [+2083 chars]"}]}