{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "ThePrint"}, "author": "Sanya Dhingra", "title": "South Asians at greater risk of Covid infection, death than other communities in UK — Lancet - ThePrint", "description": "Factors responsible for differential Covid impact on South Asians are blood pressure, body weight and other underlying health conditions. Stigma and racism may have a role.", "url": "https://theprint.in/health/south-asians-at-greater-risk-of-covid-infection-death-than-other-communities-in-uk-lancet/649888/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2021/05/Cambridge.jpg", "publishedAt": "2021-05-01T06:46:30Z", "content": "New Delhi: The South Asian communities in the United Kingdom are more likely to get infected by Covid-19, become severely ill and even die than any other minority ethnic community during the second w… [+3162 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Sarah Boseley", "title": "UK’s south Asian communities worst-hit in Covid second wave, study finds - The Guardian", "description": "Suitable prevention measures urgently needed, say researchers, with larger households highlighted as a factor", "url": "https://amp.theguardian.com/world/2021/apr/30/uks-south-asian-communities-worst-hit-in-covid-second-wave-study-finds", "urlToImage": null, "publishedAt": "2021-04-30T22:30:00Z", "content": "CoronavirusSuitable prevention measures urgently needed, say researchers, with larger households highlighted as a factor\r\nFri 30 Apr 2021 23.30 BST\r\nPeople in the UKs south Asian communities were mor… [+3104 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "Filipino boy band nominated in Billboard Music Awards – The Manila Times - The Manila Times", "description": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music competition. The group made it to the Top Social Artist category, …", "url": "https://www.manilatimes.net/2021/05/01/news/national/filipino-boy-band-nominated-in-billboard-music-awards/869023/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/04/boy-band.jpg", "publishedAt": "2021-04-30T16:17:59Z", "content": "The Pinoy pop (P-pop) boy band SB19 has been nominated in the 2021 Billboard Music Awards (BBMA), the first Filipino group and Southeast Asian act to earn a nomination in the prestigious music compet… [+2375 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Elvin Ng reveals what happened in the 'bullying' incident between him and Angel Lim - AsiaOne", "description": "Just when we thought the alleged bullying incident between Mediacorp hunk Elvin Ng and young actress Angel Lim was settled and dust in the wind, we now find it blowing right back to our face. If you haven't been keeping up with the brouhaha, here's a brief re…", "url": "https://www.asiaone.com/entertainment/elvin-ng-reveals-what-happened-bullying-incident-actress-angel-lim-dasmond-koh", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210430_elvin1.jpg?h=f74d8d50&itok=PiT4N1AR", "publishedAt": "2021-04-30T05:53:00Z", "content": "Just when we thought the alleged bullying incident between Mediacorp hunk Elvin Ng and young actress Angel Lim was settled and dust in the wind, we now find it blowing right back to our face.\r\nIf you… [+2457 chars]"}]}