{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "India-Central Asia NSAs to protect Afghanistan from terror groups - Hindustan Times", "description": "Led by National Security Advisor Ajit Doval, the India-Central Asia NSAs focused on Afghanistan and protect the region from terrorist groups, terror recruitment, financing and propaganda through new and emerging technologies including cyber attacks. | Latest …", "url": "https://www.hindustantimes.com/india-news/indiacentral-asia-nsas-to-protect-afghanistan-from-terror-groups-101670319759012.html", "urlToImage": "https://images.hindustantimes.com/img/2022/12/06/1600x900/nsa_1670320012465_1670320038492_1670320038492.jpeg", "publishedAt": "2022-12-06T09:49:06Z", "content": "The National Security Advisers (NSAs) of India and Central Asia on Tuesday reiterated strong support for a peaceful, stable and secure Afghanistan, emphasising respect for its sovereignty, unity and … [+2081 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "Attacking ‘Russian Heartland,’ Ukraine Cracks The Code To Conduct Long-Range Attacks With Soviet Technology - EurAsian Times", "description": "The Armed Forces of Ukraine (AFU) which had already been pushed to the wall with Russia’s barrage of missiles, hatched a plan to rattle the invaders. On December 5, two Russian AFBs- Engels and Dyagilevo came under attack by what was believed to be drones dis…", "url": "https://eurasiantimes.com/attacking-heartland-of-russia-ukraine-cracks-the-code-to-conduct/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/12/Tupolev-Tu-141-1.jpg", "publishedAt": "2022-12-06T09:42:50Z", "content": "Recently, satellite imagery from deep inside Russian territory revealed that the Russian Aerospace Forces (VKS) had amassed several nuke-capable Tu-160 and Tu-95 bombers at its Engels-2 Air Force Bas… [+5680 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "William Ukpe", "title": "Nigeria moves to become gateway to AfCFTA, signs MoU with Vietnam - Nairametrics", "description": "The Nigerian government, in a bid to boost trade with South East Asia and maximize the African Continental Free Trade", "url": "https://nairametrics.com/2022/12/06/nigeria-wants-300-billion-exporter-vietnam-to-use-nigeria-as-a-gateway-to-afcfta-signs-mou/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/04/Yemi-Osinbajo.png", "publishedAt": "2022-12-06T08:17:08Z", "content": "The Nigerian government, in a bid to boost trade with South East Asia and maximize the African Continental Free Trade Area (AfCFTA) agreement, has announced plans to make $336 billion exporter Vietna… [+2423 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Singaporean hits Batam beach on birthday getaway, gets a swole 'present' from sandflies - AsiaOne", "description": "A young woman wanted to enjoy her birthday in Batam with some friends, but she ended up in the hospital instead. In a TikTok video on Dec 3, Natalie said she felt her face \"ballooning\" after frolicking on the beach. She also broke out into hives and \"couldn't…", "url": "https://www.asiaone.com/singapore/singaporean-hits-batam-beach-birthday-getaway-gets-swole-present-sandflies", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/20220512%20allergic%20reaction.jpg?h=0429cc9e&itok=hRNYqKGz", "publishedAt": "2022-12-05T05:55:00Z", "content": "A young woman wanted to enjoy her birthday in Batam with some friends, but she ended up in the hospital instead. \r\nIn a TikTok video on Dec 3, Natalie said she felt her face \"ballooning\" after frolic… [+2506 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Hong Kong stars are really low-key': Andy Lau spotted at daughter's school performance - AsiaOne", "description": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too. Netizens were pleasantly surprised to see the Hong Kong singer-actor at a school performance on Friday (Dec…", "url": "https://www.asiaone.com/entertainment/hong-kong-stars-are-really-low-key-andy-lau-spotted-daughters-school-performance", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_andy%20lau%20school.png?h=62c6da03&itok=0GH6SjkN", "publishedAt": "2022-12-05T04:30:00Z", "content": "For parents, getting to watch their children perform at a school play or recital is a priceless experience, and superstar Andy Lau feels that way, too.\r\nNetizens were pleasantly surprised to see the … [+1654 chars]"}]}