{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Most Asian stocks weaken as red-hot U.S. inflation fuels rate hike fears - Reuters.com", "description": "Several emerging Asian equities slid on Friday after red-hot U.S. inflation data cemented expectations of more aggressive rate hikes globally, while talks between Russia and Ukraine failed to make much headway in de-escalating tensions.", "url": "https://www.reuters.com/markets/stocks/most-asian-stocks-weaken-red-hot-us-inflation-fuels-rate-hike-fears-2022-03-11/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=79", "publishedAt": "2022-03-11T08:09:00Z", "content": "March 11 (Reuters) - Several emerging Asian equities slid on Friday after red-hot U.S. inflation data cemented expectations of more aggressive rate hikes globally, while talks between Russia and Ukra… [+2733 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "This Singaporean is the first local singer to have a song hit 100 million streams on Spotify - AsiaOne", "description": "Home-grown singer Sezairi is the first Singaporean artiste to have a song rack up more than 100 million streams on Spotify. The ballad, It's You, was first released as a single in 2018 and was later included in his sophomore EP, Undertones (2020). In 2021, th…", "url": "https://www.asiaone.com/entertainment/sezairi-first-singapore-singer-spotify-100-million-its-you", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/image_480.jpg?h=8af5eb0d&itok=Lvozdg8M", "publishedAt": "2022-03-11T00:32:30Z", "content": "Home-grown singer Sezairi is the first Singaporean artiste to have a song rack up more than 100 million streams on Spotify.\r\nThe ballad, It's You, was first released as a single in 2018 and was later… [+1099 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Gary Chaw curses repeatedly in restaurant and he's not apologising - AsiaOne", "description": "In a YouTube video uploaded on March 9 that has gone viral overnight, a man — not seen in the clip — could be heard cursing angrily for almost a minute. What makes it so sensational is that the title of the video says the man is a singer who was drunk. \"What …", "url": "https://www.asiaone.com/entertainment/gary-chaw-curses-repeatedly-restaurant-and-hes-not-apologising", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/20220310_gary.jpg?h=b60d0d99&itok=2azkte-Q", "publishedAt": "2022-03-10T11:48:00Z", "content": "In a YouTube video uploaded on March 9 that has gone viral overnight, a man  not seen in the clip  could be heard cursing angrily for almost a minute.\r\nWhat makes it so sensational is that the title … [+2486 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Star Awards Top 10 Popular Artistes nominees revealed, Brandon Wong bags his first nom - Channel NewsAsia", "description": "TV veteran Wong earns his first-ever popularity award nomination in a career that spans decades. Also, some fun new awards will be presented backstage this year, like the, erm, dubious honour of Most Attention-seeking New Gen Host.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/star-awards-2022-top-10-popular-artistes-nominations-306931", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--Mz6tQVB1--/c_crop%2Ch_464%2Cw_825%2Cx_1%2Cy_337/c_fill%2Cg_auto%2Ch_676%2Cw_1200/fl_relative%2Cg_south_east%2Cl_mediacorp:cna:watermark:2021-08:mediacorp%2Cw_0.1/f_auto%2Cq_auto/v1/mediacorp/cna/image/2022/03/10/img_3202.jpg?itok=r2vB05lX", "publishedAt": "2022-03-10T10:59:30Z", "content": "Similarly chuffed to be nominated was Cynthia Koh, who jokingly referenced how shed made headlines in the past year for wearing a daring dress. I know everyone saw that blue dress I wore, and it must… [+618 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Sadaf Ahsan", "title": "'Turning Red' is a 'love letter' to Asian Canadian girls, says director Domee Shi - CP24 Toronto's Breaking News", "description": "The Canadian director of Pixar’s latest outing \"Turning Red\" points to innumerable elements that could have torpedoed her mission to spotlight a Chinese-Canadian girl in Toronto wrestling with puberty.", "url": "https://www.cp24.com/entertainment-news/movie-tv-news/turning-red-is-a-love-letter-to-asian-canadian-girls-says-director-domee-shi-1.5812849", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5812851.1646866589!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-03-09T22:56:00Z", "content": "The Canadian director of Pixars latest outing \"Turning Red\" points to innumerable elements that could have torpedoed her mission to spotlight a Chinese-Canadian girl in Toronto wrestling with puberty… [+5046 chars]"}]}