{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: Asia follows global shares slide amid recovery fears - BBC News", "description": "Stocks in Asia, the US, the UK and Europe fall on concerns that rising cases may slow a recovery.", "url": "https://www.bbc.co.uk/news/business-57885183", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10C01/production/_119490686_whatsubject.jpg", "publishedAt": "2021-07-20T00:57:11Z", "content": "image copyrightGetty Images\r\nStock markets across the world have dropped on fears that increasing numbers of Covid cases will hamper economic recovery.\r\nIn Asia, Japan's benchmark Nikkei 225 index op… [+2512 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": "Iris Gonzales", "title": "Jollibee to open 100 Tim Ho Wan outlets in China - Philstar.com", "description": "Filipino-owned Asian food conglomerate Jollibee Group is targeting to open 100 Michelin-starred Tim Ho Wan restaurants in China in the next four years.", "url": "https://www.philstar.com/business/2021/07/20/2113650/jollibee-open-100-tim-ho-wan-outlets-china", "urlToImage": "https://media.philstar.com/photos/2021/07/19/jbee_2021-07-19_19-40-24.jpg", "publishedAt": "2021-07-19T16:00:00Z", "content": "MANILA, Philippines — Filipino-owned Asian food conglomerate Jollibee Group is targeting to open 100 Michelin-starred Tim Ho Wan restaurants in China in the next four years.\r\n“We’re thrilled to conti… [+2496 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "S'pore closed KTV lounges at the beginning of pandemic, then allowed them to reopen under F&B bistro is “massively hypocritical”, says analyst - The Online Citizen SG", "description": "The Online Citizen Asia S’pore closed KTV lounges at the beginning of pandemic, then allowed them to reopen under F&B bistro is “massively hypocritical”, says analyst Commentaries", "url": "https://www.theonlinecitizen.com/2021/07/19/spore-closed-ktv-lounges-at-the-beginning-of-pandemic-then-allowed-them-to-reopen-under-fb-bistro-is-massively-hypocritical-says-analyst/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/supreme-ktv.jpg", "publishedAt": "2021-07-19T14:37:11Z", "content": "It is massively hypocritical that Singapore closed down nightlife establishments at the beginning of the pandemic for public health reasons, but then allowed them to reopen under the pretense of pivo… [+4791 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": "Deni Rose M. Afinidad-Bernardo", "title": "It's official: Kisses Delavin, Maureen Wroblewitz, Leren Bautista join Miss Universe Philippines 2021 - Philstar.com", "description": "Actress Kisses Delavin, \"Asia's Next Top Model\" first Filipina winner Maureen Wroblewitz and Binibining Pilipinas Globe 2019 Leren Bautista are among the official 100 delegates to this year's Miss Universe Philippines (MUP), the pageant announced on its Faceb…", "url": "https://www.philstar.com/entertainment/2021/07/19/2113734/its-official-kisses-delavin-maureen-wroblewitz-leren-bautista-join-miss-universe-philippines-2021", "urlToImage": "https://media.philstar.com/photos/2021/07/19/final-mup_2021-07-19_22-20-56.jpg", "publishedAt": "2021-07-19T14:21:00Z", "content": "MANILA, Philippines — Actress Kisses Delavin, \"Asia's Next Top Model\" first Filipina winner Maureen Wroblewitz and Binibining Pilipinas Globe 2019 Leren Bautista are among the official 100 delegates … [+3325 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Kris Wu denies rape allegations: Companies drop former Exo pop idol, accuser issues ultimatum - AsiaOne", "description": "A week after serious allegations were made against Chinese-Canadian pop star Kris Wu, the accuser — an 18-year-old Chinese student who claimed to be his ex-girlfriend — has turned up the heat with an expose over the weekend. As a result, brands have distanced…", "url": "https://www.asiaone.com/entertainment/kris-wu-denies-rape-allegations-companies-drop-former-exo-pop-idol-accuser-issues", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/20210719_krisdu.jpg?h=cf5147c6&itok=dHAqu6E_", "publishedAt": "2021-07-19T10:41:00Z", "content": "A week after serious allegations were made against Chinese-Canadian pop star Kris Wu, the accuser an 18-year-old Chinese student who claimed to be his ex-girlfriend has turned up the heat with an exp… [+5131 chars]"}, {"source": {"id": null, "name": "SAYS"}, "author": "Yap Wan Xiang", "title": "Gordon Ramsay's 1st Bar & Grill Restaurant In M'sia Will Be Opening In Q4 2021 - SAYS", "description": "Not only can diners expect the British chef's famous steaks and burgers, but his second restaurant in the region will also serve Southeast Asian cuisine.", "url": "https://says.com/my/makan/gordon-ramsay-s-1st-bar-grill-restaurant-in-m-sia-will-be-opening-in-q4-2021", "urlToImage": "https://images.says.com/uploads/story/cover_image/50319/thumb_01a7.jpg", "publishedAt": "2021-07-19T04:03:30Z", "content": "According to New Straits Times, not only will Sunway Resort in Petaling Jaya have Ramsay's first restaurant in Malaysia, but it will also be the first Gordon Ramsay Bar &amp; Grill restaurant outside… [+471 chars]"}]}