{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": "Delfin Dioquino", "title": "E-Gilas back in action for FIBA Esports Open III - Rappler", "description": "E-Gilas Pilipinas, the Southeast Asia champion of the inaugural FIBA Esports Open, looks to repeat its winning ways over 5 other teams", "url": "https://www.rappler.com/sports/fiba/e-gilas-back-action-fiba-esports-open-2021", "urlToImage": "https://assets2.rappler.com/2020/11/e-gilas-pilipinas-fiba-esports-november-15-2020-1618385694370.jpg", "publishedAt": "2021-04-14T08:28:00Z", "content": "The Filipino crew is also comprised of Philippe Herrero IV, Aljon Cruzin, Custer Galas, Ian Santiago, Arnie Sison, and Clark Banzon."}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PSP's new chief criticises lack of contingency planning in PAP's leadership transition process - The Online Citizen Asia", "description": "The Online Citizen Asia PSP’s new chief criticises lack of contingency planning in PAP’s leadership transition process Politics", "url": "https://www.theonlinecitizen.com/2021/04/14/psps-new-chief-criticises-lack-of-contingency-planning-in-paps-leadership-transition-process/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/psp-francis.jpg", "publishedAt": "2021-04-14T06:06:58Z", "content": "The newly elected secretary-general of the Progress Singapore Party (PSP), Francis Yuen took to Facebook on Tuesday (13 Apr) to criticise the lack of contingency planning in the Peoples Action Partys… [+1630 chars]"}, {"source": {"id": null, "name": "SoyaCincau.com"}, "author": "https://www.facebook.com/alexwnl", "title": "Fave acquired by Pine Labs for RM185 mil, will launch in India this year - SoyaCincau.com", "description": "With the acquisition, Pine Labs aims to reinforce Fave's market position in Southeast Asia. Fave will also launch in India this year via Pine Lab's merchant network.", "url": "https://soyacincau.com/2021/04/13/fave-acquired-by-pine-labs-for-rm185-mil-will-launch-in-india-this-year/", "urlToImage": "https://soyacincau.com/wp-content/uploads/2021/04/210413-pine-labs-fave-1.jpg", "publishedAt": "2021-04-13T12:18:32Z", "content": "Merchant platform provider, Pine Labs has announced that it has acquired deals discovery and eWallet platform Fave for USD 45 million (about RM185 million). According to the press statement, the acqu… [+1735 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dasmond Koh hints at possible bullying incident between Elvin Ng and NoonTalk artiste Angel Lim - AsiaOne", "description": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story. First, local celebrity host Danny Yeo chimed in over the weekend about his unpleasant experience with Taiwanese actor Patrick…", "url": "https://www.asiaone.com/entertainment/dasmond-koh-hints-possible-bullying-incident-between-elvin-ng-and-angel-lim", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/elvin-angel_IG.jpg?h=0429cc9e&itok=hchS82ZG", "publishedAt": "2021-04-13T06:35:00Z", "content": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story.\r\nFirst, local celebrity host Danny Yeo chimed in over the weekend… [+4704 chars]"}]}