{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Fast spreading bird flu puts Europe and Asia on alert - The Guardian", "description": "Animals slaughtered and restrictions introduced in response to outbreaks of the virus in a number of countries", "url": "https://amp.theguardian.com/world/2021/nov/15/bird-flu-europe-asia", "urlToImage": null, "publishedAt": "2021-11-15T20:03:00Z", "content": "Bird fluAnimals slaughtered and restrictions introduced in response to outbreaks of the virus in a number of countries\r\nMon 15 Nov 2021 19.43 GMT\r\nSeveral outbreaks of severe bird flu in Europe and A… [+2497 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "14 million tons a day show why China and India won’t quit coal - Economic Times", "description": "China and India are currently mining a combined 14 million tons a day of the dirtiest fossil fuel. Coal not only remains crucial to their current energy needs but it looks set to have a role for decades to come. Thats even as the two Asian giants install huge…", "url": "https://economictimes.indiatimes.com/industry/energy/power/14-million-tons-a-day-show-why-china-and-india-wont-quit-coal/articleshow/87722250.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87722334,width-1070,height-580,imgsize-205808,overlay-economictimes/photo.jpg", "publishedAt": "2021-11-15T15:54:00Z", "content": "Theres a reason India and China defended coals future at the Glasgow climate summit: no nations have added more coal-fired power-plant capacity in the past decade than these two major emitters.\r\nChin… [+3758 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "AirAsia X says reset a must to raise new capital - The Edge Markets MY", "description": "KUALA LUMPUR (Nov 15): AirAsia X Bhd (AAX) said on Monday (Nov 15) the budget airline's focus to raise new capital is necessary because the airline has not received any external financial support during the Covid-19 pandemic or any such time before.As such, t…", "url": "https://www.theedgemarkets.com/article/airasia-x-says-reset-must-raise-new-capital", "urlToImage": "https://assets.theedgemarkets.com/20210205_TRA_PHOTOS-OF-AIR-ASIAX-KLIA-5_SY_2.jpg?1B38SQWPBKIUinD7k3o86Qc19akDetAt", "publishedAt": "2021-11-15T12:10:00Z", "content": "KUALA LUMPUR (Nov 15): AirAsia X Bhd (AAX) said on Monday (Nov 15) the budget airline's focus to raise new capital is necessary because the airline has not received any external financial support dur… [+3395 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "All grown up: How The Return of Superman's triplets, Gong Yoo's daughter in Train To Busan look now - AsiaOne", "description": "Fans who followed the Korean variety show The Return of Superman since its early days would remember actor Song Il-kook's triplets. The little ones were only about two years old when they appeared on the 2014 show and charmed the socks off international audie…", "url": "https://www.asiaone.com/entertainment/all-grown-how-return-superman-triplets-gong-yoo-daughter-train-to-busan-look-now", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211115_songtriplets.jpg?h=62c6da03&itok=RWcWINDo", "publishedAt": "2021-11-15T11:43:00Z", "content": "Fans who followed the Korean variety show The Return of Superman since its early days would remember actor Song Il-kook's triplets. The little ones were only about two years old when they appeared on… [+1958 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "China to continue Covid-19 vax support to Asean countries: FM - pna.gov.ph", "description": "BEIJING – Chinese State Councilor and Foreign Minister Wang Yi met with diplomatic envoys of the Association of Southeast Asian Nations (Asean) countries on Sunday in Beijing.Wang said since the outbreak of the Covid-19 pandemic, Chinese President Xi Jinping …", "url": "https://www.pna.gov.ph/articles/1159747", "urlToImage": "https://files01.pna.gov.ph/ograph/2021/11/15/asean-china-photo-xinhua.png", "publishedAt": "2021-11-15T05:49:00Z", "content": "CHINA-ASEAN. Chinese State Councilor and Foreign Minister Wang Yi meets with diplomatic envoys of the Association of Southeast Asian Nations (Asean) countries in Beijing, China on Nov. 14, 2021. Wang… [+2194 chars]"}]}