{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Dingko Singh, Asian Games Gold Medallist Boxer, Dies Aged 42 - NDTVSports.com", "description": "Dingko Singh was bestowed with Arjuna award in 1998 and was awarded with the Padma Shri in 2013.", "url": "https://sports.ndtv.com/boxing/dingko-singh-asian-games-gold-medallist-boxer-dies-aged-42-2460449", "urlToImage": "https://c.ndtvimg.com/2020-04/ci1no1g8_dingko-singh-pti_625x300_22_April_20.jpg", "publishedAt": "2021-06-10T06:13:00Z", "content": "Asian Games gold medal-winning former boxer Dingko Singh died on Thursday after a long battle with liver cancer. He was 42 and had been fighting the disease since 2017. Prime Minister Narendra Modi t… [+2250 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Former student of Ngee Ann Polytechnic lecturer who made racist remarks to mixed-race couple recalls being subjected to Islamophobic comments in class - The Online Citizen Asia", "description": "The Online Citizen Asia Former student of Ngee Ann Polytechnic lecturer who made racist remarks to mixed-race couple recalls being subjected to Islamophobic comments in class Community", "url": "https://www.theonlinecitizen.com/2021/06/10/former-student-of-ngee-ann-polytechnic-lecturer-who-made-racist-remarks-to-mixed-race-couple-recalls-being-subjected-to-islamophobic-comments-in-class/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/06/Screenshot-2021-06-10-at-10.28.11-AM.png", "publishedAt": "2021-06-10T03:21:52Z", "content": "On the heels of the suspension of the Ngee Ann Polytechnic lecturer who was caught on video making racist remarks to an interracial couple from his teaching duties, a former student of his took to so… [+4508 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I tried going without electricity for 24 hours — here's how I survived - AsiaOne", "description": "AsiaOne has launched EarthOne, a new section dedicated to environmental issues — because we love the planet and we believe science. Find articles like this there. As we all inevitably spend more time at home in this pandemic, there's no denying that our energ…", "url": "https://www.asiaone.com/lifestyle/i-tried-going-without-electricity-24-hours-heres-how-i-survived", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/electricity_main.jpg?h=5db1338b&itok=z07sJ3R-", "publishedAt": "2021-06-10T02:00:00Z", "content": "AsiaOne has launched EarthOne, a new section dedicated to environmental issues because we love the planet and we believe science. Find articles like this there.\r\nAs we all inevitably spend more time … [+6889 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Recto Mercene", "title": "Make 'South China Sea a watery highway for trade, connection' - Locsin | Recto Mercene - Business Mirror", "description": "FOREIGN Affairs Secretary Teodoro L. Locsin Jr. appealed to fellow members of the Association of Southeast Asian Nations (Asean) to view South China Sea as “a watery highway for trade and connection.” Locsin reiterated the country’s commitment to the full imp…", "url": "https://businessmirror.com.ph/2021/06/10/make-south-china-sea-a-watery-highway-for-trade-connection-locsin/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/world02-060921.jpg", "publishedAt": "2021-06-09T16:13:48Z", "content": "FOREIGN Affairs Secretary Teodoro L. Locsin Jr. appealed to fellow members of the Association of Southeast Asian Nations (Asean) to view South China Sea as a watery highway for trade and connection.\r… [+3609 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "Davina Tham", "title": "Vietnam's proposal to postpone SEA Games opposed by most member states: Malaysian Olympic council - CNA", "description": "SINGAPORE: Eight out of 11 member states of the Southeast Asian Games Federation have objected to Vietnam's proposal to postpone the competition over COVID-19 fears, according to the Olympic Council of Malaysia (OCM).", "url": "https://www.channelnewsasia.com/news/sport/vietnam-postpone-sea-games-covid-19-meeting-oppose-14980660", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14980916/16x9/991/557/3dc7f68b7e55ec50b2c82f4413bfe577/FS/2019-sea-games-file-photo.jpg", "publishedAt": "2021-06-09T15:02:49Z", "content": "SINGAPORE: Eight out of 11 member states of the Southeast Asian Games Federation have objected to Vietnam's proposal to postpone the competition over COVID-19 fears, according to the Olympic Council … [+2291 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Gelo Gonzales", "title": "Alibaba to build first data center in Philippines by end of 2021 - Rappler", "description": "The Philippines will become the 4th country in Southeast Asia to have a local Alibaba Cloud data center, following Singapore, Malaysia, and Indonesia", "url": "https://www.rappler.com/technology/alibaba-cloud-first-data-center-philippines", "urlToImage": "https://assets2.rappler.com/2021/06/Alibaba-Cloud-Data-Center_press-release-photo-1623227429227.jpg", "publishedAt": "2021-06-09T08:37:00Z", "content": "Cloud computing has become central to the digitalization of businesses in the Philippines and around Asia. With our first data center in the country, we will be able to better support Philippine ente… [+177 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Astrologer predicts Singapore should be prepared for 'at least' 2 more waves of instability - AsiaOne", "description": "May Sim has a prediction for Singaporeans they won't be happy to hear. And that is there'll be \"at least two more cycles\" of economic and social uncertainty to come, and the world will \"get into some stability\" only after 2023, said the astrologer, based on w…", "url": "https://www.asiaone.com/lifestyle/astrologer-predicts-singapore-should-be-prepared-least-2-more-waves-instability", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/maysim.jpg?h=45c42658&itok=QyIZztqe", "publishedAt": "2021-06-09T04:32:00Z", "content": "May Sim has a prediction for Singaporeans they won't be happy to hear. \r\nAnd that is there'll be \"at least two more cycles\" of economic and social uncertainty to come, and the world will \"get into so… [+11230 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New dinosaur species discovered in Australia, one of world's biggest - AsiaOne", "description": "Scientists have confirmed the discovery of a new dinosaur species in Australia, one of the largest found in the world, more than a decade after cattle farmers first uncovered bones of the animal. The plant-eating sauropod lived in the Cretaceous period betwee…", "url": "https://www.asiaone.com/world/new-dinosaur-species-discovered-australia-one-worlds-biggest", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/20210609_dinosaur_reuters%20%281%29.jpg?h=34a906a6&itok=bsEwrDEY", "publishedAt": "2021-06-09T00:59:42Z", "content": "Scientists have confirmed the discovery of a new dinosaur species in Australia, one of the largest found in the world, more than a decade after cattle farmers first uncovered bones of the animal.\r\nTh… [+2534 chars]"}]}