{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mukesh Ambani's Reliance Explores Tapeworm Drug for COVID-19 - NDTV", "description": "Reliance Industries Ltd. is working on a new COVID-19 drug and cheaper testing kits as the conglomerate owned by Asia's richest man Mukesh Ambani looks to curb the pathogen which has ravaged India in the past year.", "url": "https://www.ndtv.com/india-news/mukesh-ambanis-team-working-on-new-covid-19-drug-cheaper-tests-2455610", "urlToImage": "https://c.ndtvimg.com/2021-06/6q0l0j7_reliance-genericbloomberg650_625x300_03_June_21.jpg", "publishedAt": "2021-06-03T11:24:45Z", "content": "India's most-valuable company is exploring use of a tapeworm drug, Niclosamide, as a cure for Covid\r\nReliance Industries Ltd. is working on a new COVID-19 drug and cheaper testing kits as the conglom… [+1497 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "No Chickenjoy: Jollibee closes Philippines outlet after woman finds fried towel in meal - AsiaOne", "description": "Many Filipinos enjoy Jollibee's fried chicken but one woman found no joy in her meal. On Wednesday (June 2), Alique Perez took to Facebook to express her disgust when the Chickenjoy meal she had ordered via a food delivery app turned out to be something else.…", "url": "https://www.asiaone.com/asia/no-chickenjoy-jollibee-closes-philippines-outlet-after-woman-finds-fried-towel-meal", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/20210603_jollibeetowelincident_fb.jpg?h=0429cc9e&itok=O8r61qB-", "publishedAt": "2021-06-03T05:30:00Z", "content": "Many Filipinos enjoy Jollibee's fried chicken but one woman found no joy in her meal.\r\nOn Wednesday (June 2), Alique Perez took to Facebook to express her disgust when the Chickenjoy meal she had ord… [+1572 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "YANG HAN, PRIME SARMIENTO in Hong Kong", "title": "Experts: Chinese vaccines are critical to Asean in Covid fight - The Star Online", "description": "HONG KONG, June 1 - Vaccines from China are proving critical to Southeast Asian nations as they battle a new wave of COVID-19 infections, experts said, adding that the region can also benefit from China's experience in protecting public health security as wel…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/06/03/experts-chinese-vaccines-are-critical-to-asean-in-covid-fight", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/06/03/1170573.jpg", "publishedAt": "2021-06-03T04:06:00Z", "content": "HONG KONG, June 1 - Vaccines from China are proving critical to Southeast Asian nations as they battle a new wave of COVID-19 infections, experts said, adding that the region can also benefit from Ch… [+3210 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Oil above $70 as recovery, travels bolster OPEC's output decision - Guardian Nigeria", "description": "As economies recover and anticipate improved summer travels, OPEC and its allies will carry on with production increases, just as oil price surpasses $70 a barrel ceiling despite coronavirus crises in Asia and the prospect of sanctions relief for Iran.", "url": "https://guardian.ng/business-services/oil-above-70-as-recovery-travels-bolster-opecs-output-decision/", "urlToImage": "https://guardian.ng/wp-content/uploads/2019/11/opec.jpg", "publishedAt": "2021-06-02T04:08:51Z", "content": "Higher prices spell doom for subsidy paymentsAs economies recover and anticipate improved summer travels, OPEC and its allies will carry on with production increases, just as oil price surpasses $70 … [+3769 chars]"}]}