{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "Zinia Bandyopadhyay", "title": "Pakistani actor Adnan Siddiqui hits back at Priyanka Chopra for calling director Sharmeen Obaid Chinoy 'South Asian' - India Today", "description": "Priyanka Chopra had shared an appreciation post for director Sharmeen Obaid Chinoy. However, Pakistani actor Adnan Siddiqui, who was a part of the film Mom, is not happy with Priyanka's post for this reason.", "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actor-adnan-siddiqui-hits-back-at-priyanka-chopra-for-calling-director-sharmeen-obaid-chinoy-south-asian-2360163-2023-04-14", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202304/adnan_siddiqui_slams_priyanka_chopra-sixteen_nine.jpg?VersionId=lBWvbOER1PZPh06gC3WKvc6yhkMXoBmT", "publishedAt": "2023-04-14T14:49:12Z", "content": "By Zinia Bandyopadhyay: Priyanka Chopra Jonas has been creating a niche for herself in the West. The actress is all set for her next, The Russo Brothers’ Citadel. Recently, she took to her Instagram … [+2163 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Tanmay Kadam", "title": "Not Smart Enough! US Smart Bombs ‘Punctured’ By Russian EW Attacks; Intel Report Says JDAMs Fizzling Out - EurAsian Times", "description": "The top-secret Pentagon documents leaked last week highlight concerns about the failure of US-made bomb kits being used by the Ukrainian forces to carry out precision strikes against high-value Russian military targets. British SAS, UK’s Elite Special Air Ser…", "url": "https://eurasiantimes.com/new-attack-punctures-us-jdam-bombs-in-ukraine/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/12/JDAM-Smart-Bomb-Kits-1.jpg", "publishedAt": "2023-04-13T08:30:59Z", "content": "The top-secret Pentagon documents leaked last week highlight concerns about the failure of US-made bomb kits being used by the Ukrainian forces to carry out precision strikes against high-value Russi… [+5396 chars]"}]}