{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Just Not Fair\": Wasim Akram Reacts To Jay Shah's Statement On Asia Cup 2023 - NDTV Sports", "description": "Wasim Akram has said that if Jay Shah wanted to make a statement like that, then he should have atleast called the PCB chairman Ramiz Raja and there could have been a discussion", "url": "https://sports.ndtv.com/cricket/just-not-fair-wasim-akram-reacts-to-jay-shahs-statement-on-asia-cup-2023-3451057", "urlToImage": "https://c.ndtvimg.com/2022-09/uob7t9b_wasim-akram_625x300_07_September_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-10-21T04:21:11Z", "content": "The reactions on Asian Cricket Council (ACC) President Jay Shah's statement of India not touring Pakistan for Asia Cup 2023 keep on coming and the latest reaction has come from former Pakistan captai… [+2048 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Ukraine Says 200+ Iranian UAVs Shot Down; Expert Admits Russian Drones Are Bleeding Kyiv Militarily & Financially - EurAsian Times", "description": "Moscow's extensive use of Iranian-made drones against Ukrainian targets is putting a great deal of strain on Ukraine's air defense systems, which are forced to use high-priced missiles to counter these low-cost drones.", "url": "https://eurasiantimes.com/killing-cheap-drones-with-million-dollars-worth-of-missiles-ukraine/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/09/IranDrone.jpg", "publishedAt": "2022-10-21T01:20:12Z", "content": "Russia’s extensive use of Iranian-made drones against Ukrainian targets puts a great deal of strain on Ukraine’s air defense systems, which are forced to use high-priced missiles to counter these low… [+7480 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Spotted lanternfly: Fear grows species will enter Canada - CTV News", "description": "There are worries the spotted lanternfly, an invasive species native to Asia that made its way to the United States in 2014, is about to move into Canada, potentially spelling disaster for the country's fruit growers and wineries.", "url": "https://www.ctvnews.ca/climate-and-environment/spot-a-spotted-lanternfly-photograph-then-kill-it-canadian-food-inspection-agency-says-1.6118518", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/10/20/spotted-lanternfly-1-6118554-1666307984483.jpg", "publishedAt": "2022-10-20T23:30:00Z", "content": "Canadians are being asked to look out for a small, colourful bug with a big appetite.\r\nThe spotted lanternfly is an invasive species that made its way to the United States, and now there are worries … [+3341 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Schooled by love: Singaporean couple returns to secondary school for wedding shoot - AsiaOne", "description": "In life, everyone wishes that they can have do-overs. Don't you wish you can travel back in time and improve your cherished memories? Like not acting like a babbling idiot on your first date with your secondary school sweetheart. Step aside Marty McFly, enter…", "url": "https://www.asiaone.com/lifestyle/schooled-love-singaporean-couple-returns-secondary-school-wedding-shoot", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/20221020_secschoolweddingshootbanner_tiktok.jpg?h=10d202d3&itok=xQzYtpCP", "publishedAt": "2022-10-20T10:00:15Z", "content": "In life, everyone wishes that they can have do-overs.\r\nDon't you wish you can travel back in time and improve your cherished memories? Like not acting like a babbling idiot on your first date with yo… [+2309 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Chef Sam Leong's son Joe now runs his own restaurant and he's doing one thing differently from his famous father - Channel NewsAsia", "description": "At Sonder, the young chef serves up elegant nostalgia-tinged dishes that honour his family’s generations of chefs that came before him, while forging his own path beyond his father’s shadow.", "url": "https://cnalifestyle.channelnewsasia.com/dining/chef-joe-leong-sonder-restaurant-sam-forest-336246", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--qOoX1aY8--/c_crop,h_1800,w_3200,x_0,y_53/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/10/17/_al_7765.jpg?itok=KZgdw5SO", "publishedAt": "2022-10-19T23:00:00Z", "content": "There might be some who will point to the fact that Leong was approached to open the restaurant by an old family friend who runs several companies, and say that he got his break because of his famous… [+880 chars]"}]}