{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Philippine Star"}, "author": "Helen Flores", "title": "‘Cordial Philippine-China ties far outweigh differences’ - Philstar.com", "description": "China is looking forward to closer cooperation with the Philippines and other member-states of the Association of Southeast Asian Nations to attain peace and stability in the South China Sea, Chinese Premier Li Keqiang said yesterday.", "url": "https://www.philstar.com/headlines/2022/11/13/2223437/cordial-philippine-china-ties-far-outweigh-differences", "urlToImage": "https://media.philstar.com/photos/2022/11/12/scs_2022-11-12_22-01-05.jpg", "publishedAt": "2022-11-12T16:00:00Z", "content": "PHNOM PENH – China is looking forward to closer cooperation with the Philippines and other member-states of the Association of Southeast Asian Nations (ASEAN) to attain peace and stability in the Sou… [+2961 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Trudeau puts cash behind Indo-Pacific pledges during visit to Southeast Asia summit - CTV News", "description": "Prime Minister Justin Trudeau unveiled a slew of funding announcements in Cambodia on Saturday aimed at deepening economic and academic ties with Southeast Asia, after decades of sporadic engagement with the region.", "url": "https://www.ctvnews.ca/politics/trudeau-puts-cash-behind-indo-pacific-pledges-during-visit-to-southeast-asia-summit-1.6150500", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/11/12/trudeau-asean-1-6150502-1668267848110.jpg", "publishedAt": "2022-11-12T15:48:00Z", "content": "PHNOM PENH, Cambodia - \r\nPrime Minister Justin Trudeau unveiled a slew of funding announcements in Cambodia on Saturday aimed at deepening economic and academic ties with Southeast Asia, after decade… [+7518 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Biden says US-ASEAN pact to address 'biggest issues of our time' - CNA", "description": "PHNOM PENH: Southeast Asian heads of government held talks on Saturday (Nov 12) with visiting global leaders including US President Joe Biden, who hailed the launch of a new US-ASEAN pact as a c", "url": "https://www.channelnewsasia.com/world/us-asean-pact-joe-biden-indo-pacific-issues-summit-southeast-asia-3066711", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--jolV8fPn--/c_crop,h_576,w_1024,x_0,y_0/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/11/12/000_32nd6eb.jpg?itok=KTFZ7k1l", "publishedAt": "2022-11-12T13:28:09Z", "content": "PHNOM PENH: Southeast Asian heads of government held talks on Saturday (Nov 12) with visiting global leaders including US President Joe Biden, who hailed the launch of a new US-ASEAN pact as a critic… [+2048 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Egg white cervical mucus: How it can help you plan a pregnancy - AsiaOne", "description": "If you notice egg white discharge, chances are you are about to start ovulating. It is considered to be the most fertile cervical type of mucus and you can spot it as EWCM or egg white cervical mucus on most fertility charts. Now while you may notice differen…", "url": "https://www.asiaone.com/lifestyle/egg-white-cervical-mucus-how-it-can-help-you-plan-pregnancy", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221110_cervical_unsplash.jpg?h=0429cc9e&itok=nhGaNFAZ", "publishedAt": "2022-11-12T13:00:00Z", "content": "If you notice egg white discharge, chances are you are about to start ovulating. It is considered to be the most fertile cervical type of mucus and you can spot it as EWCM or egg white cervical mucus… [+13809 chars]"}, {"source": {"id": null, "name": "Sports Interactive Network Philippines"}, "author": null, "title": "Jericho Cruz shines as Guam beats HK in Fiba Asia Cup pre-qualifiers - Sports Interactive Network Philippines", "description": "Jericho Cruz leads Guam over Hong Kong to sweep first round of Fiba Asia Cup pre-qualifiers", "url": "https://www.spin.ph/basketball/fiba/jericho-cruz-leads-guam-over-hong-kong-to-sweep-first-round-of-fiba-asia-cup-pre-qualifiers-a795-20221112", "urlToImage": "http://contents.spin.ph/image/resize/image/2022/11/12/jericho-cruz-1668221569.webp", "publishedAt": "2022-11-12T03:37:06Z", "content": "JERICHO Cruz had 25 points, nine rebounds, five assists, and three steals as Guam defeated Hong Kong, 67-64, to sweep the group stage of the Fiba Asia Cup 2025 pre-qualifiers on Friday in Bengaluru, … [+456 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'You live for yourself': Phyllis Quek's take on life made her seem cold and distant to others - AsiaOne", "description": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view. On the latest episode of the Mediacorp talk show Hear U Out, Phyllis revealed that her neutral and muted response to others wasn't…", "url": "https://www.asiaone.com/entertainment/live-yourself-phyllis-queks-take-on-life-cold-distant-others-hear-u-out-quan-yi-fong", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/111122_phyllisquek_mediacorp.jpg?h=9e9626f5&itok=I2XhmKAE", "publishedAt": "2022-11-12T01:30:00Z", "content": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view.\r\nOn the latest episode of the Mediacorp talk show Hear U Out, Phyllis … [+2486 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Why is it so hard for mothers to break free of mum guilt? Listen to this CNA Women podcast - Channel NewsAsia", "description": "On the second episode of the Womankind podcast, hosts Penelope Chan and Hidayah Salamat discuss the issue with guest Yasmin Begum, founder of Away From Mum Guilt.", "url": "https://cnalifestyle.channelnewsasia.com/women/mum-guilt-cna-women-podcast-womankind-338131", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--cbt-j_KR--/c_crop,h_843,w_1500,x_0,y_52/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/10/15 - YasminBegum May2019-37.jpg?itok=9l9ghlj6", "publishedAt": "2022-11-11T22:52:00Z", "content": "In the second episode of CNA Women's podcast Womankind, hosts Penelope Chan and Hidayah Salamat, and Yasmin Begum, founder of support group Away From Mum Guilt, unpack the phenomenon of mum guilt. \r\n… [+242 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Southeast Asian Nations Play Crucial Role in Building Peaceful Societies, Global Economy, Secretary-General Tells Association's Summit - World - ReliefWeb", "description": "News and Press Release in English on World and 1 other country about Agriculture, Climate Change and Environment and more; published on 11 Nov 2022 by UN SG", "url": "https://reliefweb.int/report/world/southeast-asian-nations-play-crucial-role-building-peaceful-societies-global-economy-secretary-general-tells-associations-summit", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/default.png", "publishedAt": "2022-11-11T19:39:29Z", "content": "SG/SM/2158011 NOVEMBER 2022\r\nFollowing are UN Secretary-General António Guterres’ opening remarks to the twelfth Association of Southeast Asian Nations (ASEAN)-United Nations Summit, in Phnom Penh, t… [+5818 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Best sex positions to get pregnant, Lifestyle News - AsiaOne", "description": "Wondering about the best sex positions in bed to get pregnant? The dispute over whether certain sex positions can help you get pregnant has been ongoing for centuries. Some proven, some not. The position you need to use really depends on you and your body. So…", "url": "https://www.asiaone.com/lifestyle/best-sex-positions-get-pregnant", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221111_%20couple_pexels.jpg?h=0429cc9e&itok=t4lGkane", "publishedAt": "2022-11-11T14:00:01Z", "content": "Wondering about the best sex positions in bed to get pregnant?\r\nThe dispute over whether certain sex positions can help you get pregnant has been ongoing for centuries. Some proven, some not. The pos… [+6919 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Bursa Malaysia publicly reprimands TA Securities for breaching ACE Market listing rules during Catcha Digital listing - The Edge Markets MY", "description": "KUALA LUMPUR (Nov 11): Bursa Malaysia has publicly reprimanded TA Securities Holdings Bhd as the sponsor and principal adviser for Catcha Digital Bhd (formerly known as REV Asia Bhd) for breaches in the Bursa Malaysia Securities ACE Market Listing Requirement…", "url": "https://www.theedgemarkets.com/article/bursa-malaysia-publicly-reprimands-ta-securities-breaching-ace-market-listing-rules-during", "urlToImage": "https://assets.theedgemarkets.com/ta-securities-logo_0.jpg?SA211.jZk8xBpODQaTnv2OyNWBaP6kJG", "publishedAt": "2022-11-11T10:23:57Z", "content": "KUALA LUMPUR (Nov 11): Bursa Malaysia has publicly reprimanded TA Securities Holdings Bhd as the sponsor and principal adviser for Catcha Digital Bhd (formerly known as REV Asia Bhd) for breaches in … [+3729 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Asia-Pacific workshop on surveillance, prevention and control of zoonotic influenza- Paro, Bhutan - World Health Organization", "description": "Zoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several Asian countries that have impacted public health, trade and economy in …", "url": "https://www.who.int/publications-detail-redirect/sea-whe-14", "urlToImage": "https://apps.who.int/iris/rest/bitstreams/1477933/retrieve", "publishedAt": "2022-11-11T05:30:09Z", "content": "Overview \r\nZoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several … [+1026 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Imagine holding your kid captive': 'Rescuers' demand $2500 from woman to release missing pet macaw - AsiaOne", "description": "Pet owner Fara is thankful that her macaws are back home safe, but it was after encountering \"vultures\" along the way. Speaking to AsiaOne on Thursday (Nov 10), the 35-year-old restaurant manager shared that her pets Tiago and Oka went missing on Oct 15 after…", "url": "https://www.asiaone.com/singapore/imagine-holding-your-kid-captive-rescuers-demand-2500-woman-release-missing-pet-macaw", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221011_parrot.jpeg?h=0429cc9e&itok=sh3XMUtd", "publishedAt": "2022-11-11T01:45:26Z", "content": "Pet owner Fara is thankful that her macaws are back home safe, but it was after encountering \"vultures\" along the way.\r\nSpeaking to AsiaOne on Thursday (Nov 10), the 35-year-old restaurant manager sh… [+3788 chars]"}]}