{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'When do you want?' Stephen Chow responds to Shaun Chen's request to act together - AsiaOne", "description": "Hong Kong superstar Stephen Chow's fingers have certainly been very busy lately. On New Year's day, the actor-filmmaker posted a throwback photo — a poster from his 1996 movie God of Cookery — on his verified Instagram account. \"It's the new year, what wishes…", "url": "https://www.asiaone.com/entertainment/when-do-you-want-stephen-chow-responds-shaun-chens-request-act-together", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/stephenchowshaunchen.jpeg?h=a7fada16&itok=Pom_T8z2", "publishedAt": "2023-01-10T06:41:00Z", "content": "Hong Kong superstar Stephen Chow's fingers have certainly been very busy lately.\r\nOn New Year's day, the actor-filmmaker posted a throwback photo a poster from his 1996 movie God of Cookery on his ve… [+3058 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Asian tourism-focused businesses ready for China rebound as border reopens - CNA", "description": "South Korean and Japanese shop owners, Thai tour bus operators and K-pop groups are among those celebrating China's border reopening as businesses around Asia rekindle ties with the region's largest economy. China was the world's largest outbound tourism mark…", "url": "https://www.channelnewsasia.com/asia/covid-19-asian-tourism-focused-business-ready-rebound-border-reopen-3194771", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--6hocqOuG--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2023-01-10t043942z_2_lynxmpej09034_rtroptp_3_health-coronavirus-china-business.jpg?itok=USZntPLU", "publishedAt": "2023-01-10T05:45:42Z", "content": "Hikeshi Spirit, a clothing store in Tokyo's Asakusa district that was hugely popular with Chinese tourists before the pandemic, is also hoping this key customer segment will join other nationalities … [+974 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Beatrice Pinlac", "title": "More Filipino films may soon be shown in China, says Marcos’ creative comms adviser Soriano - INQUIRER.net", "description": "MANILA, Philippines – More Filipino films may soon break into Chinese cinemas as the country looks into forging stronger ties with the Asian economic giant’s creative industry, said presidential", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/10/371139-620x483.jpeg", "publishedAt": "2023-01-10T03:12:00Z", "content": "MANILA, Philippines More Filipino films may soon break into Chinese cinemas as the country looks into forging stronger ties with the Asian economic giants creative industry, said presidential adviser… [+2914 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sandip Das", "title": "Stock Market Today: Top 10 things to know before the market opens today - Moneycontrol", "description": "Stock Market News: Trends in the SGX Nifty indicate a cautious opening for the broader index in India with a loss of 2 points on Tuesday in sync with flat trading at Wall Street and mixed cues from Asian peers", "url": "https://www.moneycontrol.com/news/business/markets/stock-market-today-top-10-things-to-know-before-the-market-opens-today-147-9837641.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/12/markets2-725x435.jpg", "publishedAt": "2023-01-10T01:51:19Z", "content": "The market is expected to open flat as trends in the SGX Nifty indicate a cautious opening for the broader index in India with a loss of 2 points.\r\nThe BSE Sensex rallied 847 points to 60,747, while … [+6151 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'We haven't met for over 10 years': Former actress Zeng Huifen makes rare appearance at Chew Chor Meng's new bistro bar - AsiaOne", "description": "\"It's great to have many friends, and it's even better if you have many old friends.\" Actor Chew Chor Meng was spitting facts on his Instagram last Friday (Jan 6) as he met up with a friend after more than a decade: Samsui Women star Zeng Huifen. The former M…", "url": "https://www.asiaone.com/entertainment/we-havent-met-over-10-years-former-actress-zeng-huifen-rare-appearance-chew-chor-meng-chen-liping", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/230109_zeng%20huifen.png?h=d6bdad78&itok=eEsZdO68", "publishedAt": "2023-01-09T04:21:00Z", "content": "\"It's great to have many friends, and it's even better if you have many old friends.\"\r\nActor Chew Chor Meng was spitting facts on his Instagram last Friday (Jan 6) as he met up with a friend after mo… [+2296 chars]"}]}