{"articles": [{"author": "ANCX Staff", "content": "After honoring Filipino restaurants Antonio’s and Gallery by Chele earlier this week with spots on the Asia’s 50 Best Restaurants’ 51 to 100 list, the prestigious food awards event announced earlier … [+1046 chars]", "description": "Toyo Eatery, famous for its inventive take on Filipino flavors, is named best restaurant in the Philippines", "publishedAt": "2021-03-25T11:14:27Z", "source": {"id": null, "name": "Abs-cbn.com"}, "title": "Filipino restaurant lands spot among Asia's 50 best for third straight year - ABS-CBN News", "url": "https://news.abs-cbn.com/ancx/food-drink/restaurants/03/25/21/filipino-restaurant-lands-spot-among-asias-50-best-for-third-straight-year", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/ancx/food-n-drink/2021/02/toyo.jpg"}, {"author": null, "content": "First, the tune stirred patriotic feelings in schoolchildren in India. Now, Count On Me, Singapore appears to have taken a spiritual turn.\r\nDays ago, netizens discovered another dupe of Singapore's b… [+1582 chars]", "description": "First, the tune stirred patriotic feelings in schoolchildren in India. Now, Count On Me, Singapore appears to have taken a spiritual turn. Days ago, netizens discovered another dupe of Singapore's beloved 1986 National Day song on the internet. Titled We Have…", "publishedAt": "2021-03-25T08:50:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Download track for 70 cents: Count On Me, Singapore gets turned into spiritual song in India - AsiaOne", "url": "https://www.asiaone.com/singapore/download-track-70-cents-count-me-singapore-gets-turned-spiritual-song-india", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/wehaveavision.jpg?h=0429cc9e&itok=TbeU9zQq"}, {"author": null, "content": "JAKARTA, INDONESIA — The Badminton World Federation (BWF) has sent a formal apology to Indonesia’s Sports Minister Zainudin Amali over the country’s badminton team’s dismissal in the All England tour… [+3174 chars]", "description": "The Online Citizen Asia Badminton World Federation apologises to Indonesia over unexpected dismissal of its team from All England 2021. Will a legal complaint to CAS be the next option? Current Affairs", "publishedAt": "2021-03-24T12:44:45Z", "source": {"id": null, "name": "The Online Citizen"}, "title": "Badminton World Federation apologises to Indonesia over unexpected dismissal of its team from All England 2021. Will a legal complaint to CAS be the next option? - The Online Citizen Asia", "url": "https://www.theonlinecitizen.com/2021/03/24/badminton-world-federation-apologises-to-indonesia-over-unexpected-dismissal-of-its-team-from-all-england-2021-will-a-legal-complaint-to-cas-be-the-next-option/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/03/unnamed.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "asia"}