{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy", "title": "As major powers meet in Asia, the rest of the world is pressed to pick a side - CNN", "description": "World leaders are converging in Phnom Penh this weekend for the first in a series of international summits in Southeast Asia over the coming week, where divisions between major powers and conflict threaten to overshadow talks.", "url": "https://www.cnn.com/2022/11/11/asia/asia-summits-asean-us-china-myanmar-intl-hnk-mic/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221110181012-01-summits-asia-asean-us-china-myanmar-intl-hnk.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-12T03:03:00Z", "content": "Editors Note: A version of this story appeared in CNNs Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the countrys rise and how it impacts the world.… [+8585 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'They sent me this nonsense plastic': Woman pays $468 for dryer during Lazada 11.11 sales, receives empty parcel - AsiaOne", "description": "A woman was furious when she received an empty parcel instead of a dryer she had bought online on Lazada. The Stomp contributor told Stomp she had ordered the Midea dryer a few days ago after noticing a drop in price during the 11.11 sales. She paid $468.50 f…", "url": "https://www.asiaone.com/singapore/they-sent-me-nonsense-plastic-woman-pays-468-dryer-during-lazada-1111-sales-receives", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221211_washing_machine_stomp.jpg?h=0429cc9e&itok=xyI6eqMb", "publishedAt": "2022-11-12T01:31:14Z", "content": "A woman was furious when she received an empty parcel instead of a dryer she had bought online on Lazada.\r\nThe Stomp contributor told Stomp she had ordered the Midea dryer a few days ago after notici… [+2446 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'You live for yourself': Phyllis Quek's take on life made her seem cold and distant to others - AsiaOne", "description": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view. On the latest episode of the Mediacorp talk show Hear U Out, Phyllis revealed that her neutral and muted response to others wasn't…", "url": "https://www.asiaone.com/entertainment/live-yourself-phyllis-queks-take-on-life-cold-distant-others-hear-u-out-quan-yi-fong", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/111122_phyllisquek_mediacorp.jpg?h=9e9626f5&itok=I2XhmKAE", "publishedAt": "2022-11-12T01:30:00Z", "content": "Her demeanour may have denoted a cold and distant austerity, but Phyllis Quek was just trying to get by with her own world view.\r\nOn the latest episode of the Mediacorp talk show Hear U Out, Phyllis … [+2486 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Southeast Asian Nations Play Crucial Role in Building Peaceful Societies, Global Economy, Secretary-General Tells Association's Summit - World - ReliefWeb", "description": "News and Press Release in English on World and 1 other country about Agriculture, Climate Change and Environment and more; published on 11 Nov 2022 by UN SG", "url": "https://reliefweb.int/report/world/southeast-asian-nations-play-crucial-role-building-peaceful-societies-global-economy-secretary-general-tells-associations-summit", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/default.png", "publishedAt": "2022-11-11T19:39:29Z", "content": "SG/SM/2158011 NOVEMBER 2022\r\nFollowing are UN Secretary-General António Guterres’ opening remarks to the twelfth Association of Southeast Asian Nations (ASEAN)-United Nations Summit, in Phnom Penh, t… [+5818 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "Asean agrees to talk to Myanmar opposition - The Manila Times", "description": "PHNOM PENH: Southeast Asian leaders agreed Friday to engage Myanmar opposition groups as they seek ways to quell the country's escalating bloodshed which has seen thousands...", "url": "https://www.manilatimes.net/2022/11/11/latest-stories/asean-agrees-to-talk-to-myanmar-opposition/1865960", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/11/11/125671.jpg", "publishedAt": "2022-11-11T12:52:45Z", "content": "PHNOM PENH: Southeast Asian leaders agreed Friday to engage Myanmar opposition groups as they seek ways to quell the country's escalating bloodshed which has seen thousands killed in clashes since la… [+4338 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Thailand v Tahiti | Full Basketball Game | FIBA Asia Cup 2025 Pre-Qualifiers - FIBA - The Basketball Channel", "description": "Watch the First Round game between Thailand and Tahiti at the FIBA Asia Cup 2025 Pre-Qualifiers. #fibaasiacup#basketball #baloncesto #basquete #basquetebol #...", "url": "https://www.youtube.com/watch?v=NBziBwj4IFg", "urlToImage": "https://i.ytimg.com/vi/NBziBwj4IFg/maxresdefault.jpg", "publishedAt": "2022-11-11T11:43:19Z", "content": null}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Return of the condor hero: Carman Lee, 56, dons Little Dragon Maiden costume after 27 years - AsiaOne", "description": "This ethereal beauty has graced our screens once more. In multiple Weibo posts, Carman Lee has shown that she still has what it takes to don the costume of the legendary character in the 1995 TV adaptation of the Return of the Condor Heroes, the Little Dragon…", "url": "https://www.asiaone.com/entertainment/return-condor-hero-carman-lee-56-dons-little-dragon-maiden-costume-after-27-years-xiao-long-nu", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/111122_condorcarmanlee_weibo.jpg?h=8cd514aa&itok=X8sVGZTa", "publishedAt": "2022-11-11T10:17:00Z", "content": "This ethereal beauty has graced our screens once more.\r\nIn multiple Weibo posts, Carman Lee has shown that she still has what it takes to don the costume of the legendary character in the 1995 TV ada… [+2086 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Chia Han Keong", "title": "Fifa World Cup: Qualifying remains distant for Southeast Asia countries - Yahoo Singapore News", "description": "World Cup Finals qualification remains agonisingly out of reach for all of the Southeast Asia countries, but there have been some memorable moments.", "url": "https://sg.news.yahoo.com/fifa-world-cup-qualifying-remains-distant-for-southeast-asia-countries-140947514.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-11/f05c6130-5f28-11ed-bf6b-d5f68d8fa4ff", "publishedAt": "2022-11-11T10:00:47Z", "content": "Stalwarts in World Cup qualifiers: (from left) Singapore's Quah Kim Song, Malaysia's Dollah Salleh, and Thailand's Kiatisuk Senamuang. (PHOTOS: Reuters)\r\nSINGAPORE For all the immense popularity of f… [+9152 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Myanmar's participation at future ASEAN meetings could be further curtailed - CNA", "description": "PHNOM PENH: The Association of Southeast Asian Nations (ASEAN) is considering taking further steps to exclude Myanmar from its meetings, as the situation in the country continues to worsen. ASEAN leaders said in a statement on Friday (Nov 11) that it has task…", "url": "https://www.channelnewsasia.com/asia/asean-summit-myanmar-five-point-consensus-3063911", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--R1txOg7f--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/cambodia_asean_52974.jpg?itok=I--wseIe", "publishedAt": "2022-11-11T09:38:07Z", "content": "ASEAN had agreed upon the Five-Point Consensus in April 2021 to end the conflict, which Senior General Min Aung Hlaing accepted then.\r\n\"Eighteen months on, there has been little progress in the imple… [+4839 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Asia-Pacific workshop on surveillance, prevention and control of zoonotic influenza- Paro, Bhutan - World Health Organization", "description": "Zoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several Asian countries that have impacted public health, trade and economy in …", "url": "https://www.who.int/publications-detail-redirect/sea-whe-14", "urlToImage": "https://apps.who.int/iris/rest/bitstreams/1477933/retrieve", "publishedAt": "2022-11-11T05:30:09Z", "content": "Overview \r\nZoonotic influenza is a viral infection transmitted directly or indirectly by infected birds, pigs or horses. There are ongoing outbreaks of various subtypes of avian influenza in several … [+1026 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Imagine holding your kid captive': 'Rescuers' demand $2500 from woman to release missing pet macaw - AsiaOne", "description": "Pet owner Fara is thankful that her macaws are back home safe, but it was after encountering \"vultures\" along the way. Speaking to AsiaOne on Thursday (Nov 10), the 35-year-old restaurant manager shared that her pets Tiago and Oka went missing on Oct 15 after…", "url": "https://www.asiaone.com/singapore/imagine-holding-your-kid-captive-rescuers-demand-2500-woman-release-missing-pet-macaw", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/20221011_parrot.jpeg?h=0429cc9e&itok=sh3XMUtd", "publishedAt": "2022-11-11T01:45:26Z", "content": "Pet owner Fara is thankful that her macaws are back home safe, but it was after encountering \"vultures\" along the way.\r\nSpeaking to AsiaOne on Thursday (Nov 10), the 35-year-old restaurant manager sh… [+3788 chars]"}]}