{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Turkish lira hits record low after Erdogan seeks expulsions - Reuters", "description": "The Turkish lira weakened 1.6% to a record low against the dollar in early Asian trade after President Tayyip Erdogan said he had ordered the expulsion of the ambassadors of the United States and nine other Western countries. <a href=\"/world/middle-east/turke…", "url": "https://www.reuters.com/world/middle-east/turkish-lira-hits-record-low-after-erdogan-seeks-expulsions-2021-10-24/", "urlToImage": "https://www.reuters.com/resizer/ZP4aXbjY1RJanrDW1j8fn0Picec=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/J6CLXVH5YVPV5IBUN2P6AYYI5M.jpg", "publishedAt": "2021-10-24T18:56:00Z", "content": "A money changer holds Turkish lira banknotes at a currency exchange office in Ankara, Turkey October 12, 2021. REUTERS/Cagla GurdoganISTANBUL, Oct 24 (Reuters) - The Turkish lira weakened 1.6% to a r… [+2033 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Ryan had something to do with NOC girls': Sylvia Chan in tell-all with Xiaxue - AsiaOne", "description": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up. In an interview with veteran social media influencer Wendy Cheng — better known as Xiaxue — on Sunday night (Oct 24), the 33-year-…", "url": "https://www.asiaone.com/singapore/he-had-something-do-noc-girls-sylvia-chan-tell-all-xiaxue", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/nocsylvia_ytxx.jpg?h=0429cc9e&itok=7Kvw939d", "publishedAt": "2021-10-24T15:55:00Z", "content": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up.\r\nIn an interview with veteran social media influencer Wendy Cheng  bet… [+3056 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Sofia Tomacruz", "title": "Despite protests, Chinese vessels linger in West Philippine Sea - Rappler", "description": "'This is evidence of the Chinese militia's shell game in the Spratly Islands,' says the Asia Maritime Transparency Initiative of the Center for Strategic and International Studies", "url": "https://www.rappler.com/nation/despite-protests-china-vessels-linger-west-philippine-sea-amti-csis-october-2021", "urlToImage": "https://assets2.rappler.com/2021/10/Union-Banks-10-17-21-WM-1-1635085964660.jpeg", "publishedAt": "2021-10-24T14:40:00Z", "content": "The think tank said Chinese ships, ranging in size from 40 to 50 meters, were first visible through imagery as early as April 9. In June, the ships numbered at about five in the area, although in mid… [+147 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore to resume travel from South Asia, eases measures for those from Malaysia, Indonesia - The Star Online", "description": "Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust border measures in response to the global Covid-19 situation.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/24/singapore-to-resume-travel-from-south-asia-eases-measures-for-those-from-malaysia-indonesia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/24/1343238.jpg", "publishedAt": "2021-10-24T10:48:00Z", "content": "SINGAPORE, Oct 24 (The Straits Times/ANN): Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust bo… [+4234 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I felt doctors were all liars': Sheila Sim on the resentment she had after her brother died - AsiaOne", "description": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her. The 37-year-old model-actress confessed that she resented doctors for a period of time as sh…", "url": "https://www.asiaone.com/entertainment/i-felt-doctors-were-all-liars-sheila-sim-resentment-she-had-after-her-brother-died", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/sheilasim_mewatch.jpg?h=ffd08fb1&itok=rpRbFlr0", "publishedAt": "2021-10-24T01:30:00Z", "content": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her.\r\nThe 37-year-old model-actress c… [+2507 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dengue cluster in your neighbourhood? Here's what you need to know and do - AsiaOne", "description": "In 2020, Singapore had a “historic” dengue outbreak, with a total of 35,315 reported cases. Then in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aedes aegypti breed have grown by 30 per cent in April, compar…", "url": "https://www.asiaone.com/lifestyle/dengue-cluster-your-neighbourhood-heres-what-you-need-know-and-do", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/201021_mosquitodengue_unsplash.jpg?h=4c9e7946&itok=AleDwB-J", "publishedAt": "2021-10-23T11:30:00Z", "content": "In 2020, Singapore had a historic dengue outbreak, with a total of 35,315 reported cases.\r\nThen in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aed… [+4850 chars]"}]}