{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Rapidly diversifying birds in Southeast Asia offer new insights into evolution - Science Daily", "description": "New findings from zoologists working with birds in Southeast Asia are shining fresh light on the connections between animal behaviour, geology, and evolution - underlining that species can diversify surprisingly quickly under certain conditions. Sulawesi Babb…", "url": "https://www.sciencedaily.com/releases/2021/07/210720114427.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-20T20:20:46Z", "content": "New findings from zoologists working with birds in Southeast Asia are shining fresh light on the connections between animal behaviour, geology, and evolution -- underlining that species can diversify… [+2497 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "These 2 young Montreal friends died in the Florida condo collapse. But only 1 has been found - CBC.ca", "description": "Montreal friends Anastasia Gromova and Michelle Pazos were together in the Surfside, Fla., condominium that collapsed. While Pazos's remains were found, Gromova's family is still waiting for rescue teams to recover her body.", "url": "https://www.cbc.ca/news/canada/montreal/montreal-victims-florida-condo-collapse-1.6108941", "urlToImage": "https://i.cbc.ca/1.6108989.1626800741!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/michelle-pazos-anastasia-gromova-florida-condo-2.jpg", "publishedAt": "2021-07-20T14:42:54Z", "content": "The trip to Florida was supposed to be a last vacation together for best friends Michelle Pazos, 23, and Anastasia Gromova, 24, before Gromova left for Japan to teach English.\r\nThe young women who me… [+3141 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Mayvelin U. Caraballo", "title": "ADB keeps 4.5% growth forecast for PH - The Manila Times", "description": "THE Asian Development Bank (ADB) has kept its growth forecast for the Philippine domestic output for this year and next year, citing favorable trends that will help the economy...", "url": "https://www.manilatimes.net/2021/07/20/news/adb-keeps-45growth-forecast-for-ph/1807721", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/07/20/8589.jpg", "publishedAt": "2021-07-20T03:55:22Z", "content": "THE Asian Development Bank (ADB) has kept its growth forecast for the Philippine domestic output for this year and next year, citing favorable trends that will help the economy recover.\r\nThe Manila-b… [+849 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Eustance Huang", "title": "Asia-Pacific stocks fall after Dow sees worst drop since October - CNBC", "description": "The Dow Jones Industrial Average fell more than 700 points overnight on Wall Street as fears over a Covid resurgence weighed on investor sentiment.", "url": "https://www.cnbc.com/2021/07/20/asia-markets-dow-jones-industrial-average-drop-covid-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106742957-1602632337035-gettyimages-1228568981-364741088_1-4.jpeg?v=1626737642", "publishedAt": "2021-07-19T23:46:44Z", "content": "SINGAPORE Shares in Asia-Pacific fell in Tuesday morning trade following an overnight tumble for stocks on Wall Street that saw the Dow Jones Industrial Average plunging more than 700 points.\r\nIn Jap… [+1560 chars]"}, {"source": {"id": null, "name": "SAYS"}, "author": "Yap Wan Xiang", "title": "Gordon Ramsay's 1st Bar & Grill Restaurant In M'sia Will Be Opening In Q4 2021 - SAYS", "description": "Not only can diners expect the British chef's famous steaks and burgers, but his second restaurant in the region will also serve Southeast Asian cuisine.", "url": "https://says.com/my/makan/gordon-ramsay-s-1st-bar-grill-restaurant-in-m-sia-will-be-opening-in-q4-2021", "urlToImage": "https://images.says.com/uploads/story/cover_image/50319/thumb_01a7.jpg", "publishedAt": "2021-07-19T04:03:30Z", "content": "According to New Straits Times, not only will Sunway Resort in Petaling Jaya have Ramsay's first restaurant in Malaysia, but it will also be the first Gordon Ramsay Bar &amp; Grill restaurant outside… [+471 chars]"}]}