{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Global News"}, "author": "The Canadian Press", "title": "South Asian Canadian truckers turned off by ‘freedom convoy’ mull other career paths - Global News", "description": "Frustration at the recent blockades and encampment in Ottawa may be the final straw atop concerns ranging from wages to road safety and exhausting working conditions.", "url": "https://globalnews.ca/news/8635963/south-asian-canadian-truckers-convoy-blockades-industry/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/02/ConvoyFILE.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2022-02-21T22:46:35Z", "content": "Bearing a load of produce bound for Sobeys, Nihal Singh pulled up to a border checkpoint in northern Montana late last month only to find the path blocked by big-riggers on the other side.\r\nSemi truc… [+5337 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Neanderthal gene could explain why some ethnic groups suffer worse from Covid than others - Telegraph.co.uk", "description": "Around half of South Asians, who were at greater risk during the pandemic, carry a mutation of the genes compared to one-fifth of Europeans", "url": "https://www.telegraph.co.uk/news/2022/02/21/neanderthal-gene-could-explain-ethnic-groups-suffer-worse-covid/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2022/02/21/TELEMMGLPICT000262410471_trans_NvBQzQNjv4BqMfME7ArvXpFrswE4-oa5LY064TIrcX_7tT0sGCZw0_A.jpeg?impolicy=logo-overlay", "publishedAt": "2022-02-21T20:00:00Z", "content": "Neanderthal genes which protected people from smallpox could be the reason some ethnic groups are more at risk from Covid, a new study suggests.\r\nThroughout the pandemic, South Asians have been at gr… [+1523 chars]"}, {"source": {"id": null, "name": "Hype.my"}, "author": "Anna", "title": "Badminton Fan Slammed By 2 Countries For Body Shaming Aaron Chia - Hype.MY", "description": "We Malaysians might bicker a lot with each other over so many things, from petty issues like football to other various controversial issues. However, there are two things that unite us: food and badminton. Hence, during the recent Badminton Asia Team Champion…", "url": "https://hype.my/2022/263622/badminton-fan-body-shame-aaron-chia/", "urlToImage": "https://hype.my/wp-content/uploads/2022/02/photo6096083817971428897.jpg", "publishedAt": "2022-02-21T09:29:28Z", "content": "We Malaysians might bicker a lot with each other over so many things, from petty issues like football to other various controversial issues. However, there are two things that unite us: food and badm… [+1975 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.COM", "title": "From oil prices to Russia-Ukraine crisis: 10 things you should know before opening bell on Feb 21 - CNBCTV18", "description": "Trends on SGX Nifty indicate a gap-down opening for the broader index in India with a loss of 105 points. Among major pre-opening market cues, US President Joe Biden and Russian President Vladimir Putin have agreed in principle to a summit over Ukraine, Asian…", "url": "https://www.cnbctv18.com/photos/market/stocks/10-things-before-opening-bell-on-feb-21-share-market-nasdaq-dow-jones-nikkei-sensex-nifty-bse-nse-gold-silver-crude-oil-prices-bitcoin-prices-union-budget-russia-ukraine-conflict-fed-reserve-rate-hike-12569202.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2021/09/bse-1019x573.jpg", "publishedAt": "2022-02-21T02:53:00Z", "content": "<li>\r\nWall Street | Wall Street futures rallied on news that US President Joe Biden and Russian President Vladimir Putin have agreed in principle to hold a summit on the Ukraine crisis. S&amp;P 500 s… [+2846 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "TAN MING WAI", "title": "Zii Jia: The real challenge will be Thomas Cup Finals in Bangkok - The Star Online", "description": "Lee Zii Jia reminded his teammates not to get carried away after leading Malaysia to their maiden Asia Team Championships title with a 3-0 win over Indonesia. The world No. 7 said they must be wary of the bigger challenge that lies ahead in the Bangkok Thomas…", "url": "https://www.thestar.com.my/sport/badminton/2022/02/21/zii-jia-the-real-challenge-will-be-thomas-cup-finals-in-bangkok", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/02/21/1488427.jpg", "publishedAt": "2022-02-20T19:26:46Z", "content": "Lets not get carried away.\r\nThats the message sent by world No. 7 Lee Zii Jia to his teammates after leading Malaysia to their maiden Asia Team Championships title with a 3-0 win over Indonesia at th… [+2855 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Malaysian men’s squad end Indonesia’s dominance to win Badminton Asia Team Championships 2022 - Malay Mail", "description": "SHAH ALAM, Feb 20 — The Malaysian men’s team clinched their maiden Badminton Asia Team Championships (BATC) title with a 3-0 win over defending champions Indonesia here today. Malaysia’s win over Indonesia’s second stringers dashed their arch-rivals’ hope of …", "url": "https://www.malaymail.com/news/malaysia/2022/02/20/malaysian-mens-squad-end-indonesias-dominance-to-win-badminton-asia-team-ch/2042769", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-02/bernama_20022022_LEE_ZII_JIA-batc-seo.JPG", "publishedAt": "2022-02-20T11:56:15Z", "content": "Mens singles Lee Zii Jia (back) battling against his opponent Dwi Wardoyo Chico Aurat of Indonesia in the Badminton Asia Team Championships (BATC) 2022 finals at the Setia City Convention Centre in S… [+2265 chars]"}]}