{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Yen Nee Lee", "title": "JPMorgan strategist says now could be the best time to buy Asia stocks - CNBC", "description": "If macroeconomic momentum in Asia starts to stabilize, stocks in the region could move a lot higher, said Mixo Das, Asia equity strategist at JPMorgan.", "url": "https://www.cnbc.com/2021/07/14/investing-jpmorgan-strategist-on-the-best-time-to-buy-asia-stocks.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106830124-1611678998341-gettyimages-1229658843-omarques_17112020_techkrk_11.jpeg?v=1626233844", "publishedAt": "2021-07-14T05:05:50Z", "content": "SINGAPORE The best time to buy Asia stocks could be now, a JPMorgan strategist said Wednesday.\r\nMixo Das, Asia equity strategist at the bank, said U.S. markets have been hitting record levels while E… [+2660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here, Covid Cases Surge Past India, Marking New Epicenter - NDTV", "description": "Indonesia surpassed India's daily Covid-19 case numbers, marking a new Asian virus epicenter as the spread of the highly-contagious delta variant drives up infections in Southeast Asia's largest economy.", "url": "https://www.ndtv.com/world-news/indonesias-covid-cases-surge-past-india-as-delta-variant-drives-infections-2486091", "urlToImage": "https://c.ndtvimg.com/2021-07/bobmafpg_indonesia-covid19-bloomberg-650_625x300_14_July_21.jpg", "publishedAt": "2021-07-14T04:55:24Z", "content": "A health worker administers the Sinovac Biotech Ltd Covid-19 vaccine on a passenger.\r\nIndonesia surpassed India's daily Covid-19 case numbers, marking a new Asian virus epicenter as the spread of the… [+2883 chars]"}, {"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "Pulse Asia cites Duterte's high approval rating behind Sara's lead in survey - CNN Philippines", "description": "Davao City Mayor Sara Duterte's lead in the latest survey for presidency can be attributed to the high trust and approval ratings of her father President Rodrigo Duterte, pollster Pulse Asia Research Inc. said Wednesday.", "url": "http://cnnphilippines.com/news/2021/7/14/Sara-Duterte-Pulse-Asia-Leni-Robredo.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2020/11/23/Sara-Duterte-1123_CNNPH.jpg/jcr:content/Sara-Duterte-1123_CNNPH.jpg", "publishedAt": "2021-07-14T04:37:57Z", "content": "Metro Manila (CNN Philippines, July 14) Davao City Mayor Sara Duterte's lead in the latest survey for presidency can be attributed to the high trust and approval ratings of her father President Rodri… [+1832 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Part of Singapore Quarry cliff breaks off in rockslide, startling visitors - AsiaOne", "description": "It was just another regular Sunday (July 11) afternoon hike for visitors to the Singapore Quarry last weekend - until they witnessed a rockslide where a portion of a cliff broke off and fell into the water below. Dr Adrian Kuah, who was on an observation deck…", "url": "https://www.asiaone.com/singapore/part-singapore-quarry-cliff-breaks-rockslide-startling-visitors", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/20210714_mountain_np.jpg?h=0429cc9e&itok=r7B37xQC", "publishedAt": "2021-07-14T01:49:31Z", "content": "It was just another regular Sunday (July 11) afternoon hike for visitors to the Singapore Quarry last weekend - until they witnessed a rockslide where a portion of a cliff broke off and fell into the… [+1991 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "SG wants to live with Covid while Israel rethinks this strategy as death figure goes up - The Online Citizen Asia", "description": "The Online Citizen Asia SG wants to live with Covid while Israel rethinks this strategy as death figure goes up Current Affairs", "url": "https://www.theonlinecitizen.com/2021/07/13/sg-wants-to-live-with-covid-while-israel-rethinks-this-strategy-as-death-figure-goes-up/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/israel-vaccination.png", "publishedAt": "2021-07-13T11:03:45Z", "content": "Last month (24 Jun), ministers Gan Kim Yong, Lawrence Wong and Ong Ye Kung drew a new roadmap for Singaporeans to live with Covid-19. They want Singaporeans to deal with Covid-19 as part of their dai… [+2729 chars]"}]}