{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Antes de recibir la eutanasia, Víctor Escobar dedicará el día a su familia - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/advanced/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2022-01-07T01:52:30Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katharina Krebs, Tara John, Anna Chernova and Rob Picheta, CNN", "title": "Dozens of protesters reported killed in Kazakhstan as Russia-led military alliance heads to the country - CNN", "description": "Dozens of protesters were killed and hundreds injured during clashes in Kazakhstan, a police official from the largest city Almaty said Thursday, as troops from a Russian-led military alliance of post-Soviet states begin their operations in the Central Asian …", "url": "https://www.cnn.com/2022/01/06/asia/kazakhstan-fuel-protests-thursday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220106034016-kazakhstan-protest-crowd-01052022-super-tease.jpg", "publishedAt": "2022-01-06T23:43:00Z", "content": "The CSTO is a security alliance comprised of six member states: Russia, Belarus, Armenia, Kazakhstan, Kyrgyzstan and Tajikistan. It traces its origins to a regional treaty signed after the collapse o… [+1031 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Don't want to perspire: Jackie Chan laments some young actors want to look good without hard work - AsiaOne", "description": "A talkshow to commemorate the 40th anniversary of the Golden Rooster Awards recently featured Jackie Chan as a guest. And while he was ecstatic to share some highlights of his long showbiz career, he added that some young actors today no longer believe in har…", "url": "https://www.asiaone.com/entertainment/dont-want-perspire-jackie-chan-laments-some-young-actors-want-look-good-without-hard", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/060122_jackiechaninterview_%20CCTV6%20CHINA%20MOVIE%20OFFICIAL%20CHANNEL.jpg?h=0429cc9e&itok=TmcFeeb2", "publishedAt": "2022-01-06T09:34:00Z", "content": "A talkshow to commemorate the 40th anniversary of the Golden Rooster Awards recently featured Jackie Chan as a guest.\r\nAnd while he was ecstatic to share some highlights of his long showbiz career, h… [+1878 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Kelvin Tan of Project Superstar fame reveals more details about new wife - AsiaOne", "description": "Visually-impaired singer Kelvin Tan became the first local celebrity to tie the knot in 2022 when he married occupational therapist Inez Hung on Jan 2. Though he was previously reluctant to reveal more about the 29-year-old, he recently opened up on their rel…", "url": "https://www.asiaone.com/entertainment/kelvin-tan-project-superstar-fame-reveals-more-details-about-new-wife", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/20220106_kelvin.jpg?h=0edb2509&itok=Ra7YGT1Y", "publishedAt": "2022-01-06T06:13:00Z", "content": "Visually-impaired singer Kelvin Tan became the first local celebrity to tie the knot in 2022 when he married occupational therapist Inez Hung on Jan 2.\r\nThough he was previously reluctant to reveal m… [+1797 chars]"}, {"source": {"id": null, "name": "New Straits Times"}, "author": "AFP", "title": "Hong Kong bans flights as Omicron surges around globe - New Straits Times", "description": "HONG KONG: Asian financial hub Hong Kong banned flights from eight nations on Wednesday as part of strict new virus curbs, with Omicron outbreaks spiralling out of control from Europe to the United States.", "url": "https://www.nst.com.my/world/world/2022/01/760610/hong-kong-bans-flights-omicron-surges-around-globe", "urlToImage": "https://assets.nst.com.my/images/articles/hongkong050122sp_NSTfield_image_socialmedia.var_1641395729.jpg", "publishedAt": "2022-01-05T15:15:32Z", "content": null}]}