{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Gear up and take flight with Mobile Suit Gundam robot backpacks - AsiaOne", "description": "The legacy of Mobile Suit Gundam continues to live on, having spawned many sequels, spin-offs, and merchandise along the years. Apart from the mainstay attraction that are Gunpla kits, the arsenal is being constantly filled up with new additions, such as Band…", "url": "https://www.asiaone.com/lifestyle/gear-and-take-flight-mobile-suit-gundam-robot-backpacks", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/20230118_bag_mobile.jpg?h=0429cc9e&itok=aTXsSxye", "publishedAt": "2023-01-20T01:35:17Z", "content": "The legacy of Mobile Suit Gundam continues to live on, having spawned many sequels, spin-offs, and merchandise along the years. Apart from the mainstay attraction that are Gunpla kits, the arsenal is… [+1222 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Atrial fibrillation in women: This abnormal heart rhythm disorder is underdiagnosed and more severe in females - Channel NewsAsia", "description": "AFib, as it’s called, is characterised by rapid and irregular heart rate and is more challenging to diagnose in women. Here’s how to spot the early signs – doctors say not seeking timely treatment could increase the risk of stroke, heart failure and cognitive…", "url": "https://cnalifestyle.channelnewsasia.com/women/atrial-fibrillation-heart-flutter-palpitations-dizziness-women-health-345506", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--BTiBNnFU--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/04/istock-975532606_1.jpg?itok=gHke0W73", "publishedAt": "2023-01-19T23:18:56Z", "content": "Eventually, she was referred to the National Heart Centre Singapore (NHCS), and after a series of cardiac investigations, she was diagnosed with atrial fibrillation, an irregular and chaotic heart rh… [+841 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Wistar Institute HIV Researchers Win Grant to Explore Genetically Engineered Natural Killer Cells as HIV Therapy - AsiaOne", "description": "Wistar Institute HIV Researchers Win Grant to Explore Genetically Engineered Natural Killer Cells as HIV Therapy\n \n GlobeNewswire\n \n January 19, 2023\n \n \n \n PHILADELPHIA, PA, Jan. 19, 2023 (GLOBE NEWSWIRE) -- amfAR, The Foundation for AIDS Research, has award…", "url": "https://www.asiaone.com/business/wistar-institute-hiv-researchers-win-grant-explore-genetically-engineered-natural-killer", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/Notified-GlobeNewswire-Color-Large_323.jpg?h=10d202d3&itok=_8Qd2fhx", "publishedAt": "2023-01-19T19:44:08Z", "content": "PHILADELPHIA, PA, Jan. 19, 2023 (GLOBE NEWSWIRE) -- amfAR, The Foundation for AIDS Research, has awarded Luis J. Montaner, D.V.M., D.Phil., in collaboration with Mohamed Abdel-Mohsen, Ph.D., a Target… [+3286 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Makeup artist, standby!' Former actress Ng Hui appears in The Little Nyonya reunion, leaves Jeanette Aw crying - AsiaOne", "description": "When a close friend reappears after disappearing for a decade, you can bet that tears will be shed. In a recent episode of the meWATCH talk show The Reunion, the cast of The Little Nyonya (2008) gathered once more to remember iconic facets of the show. Unexpe…", "url": "https://www.asiaone.com/entertainment/former-actress-ng-hui-little-nyonya-the-reunion-jeanette-aw-lee-teng-xiang-yun-zen-chong-mewatch", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/190123_nghuijeanette_mediacorp.jpg?h=d7101325&itok=NS6glqMA", "publishedAt": "2023-01-19T10:30:00Z", "content": "When a close friend reappears after disappearing for a decade, you can bet that tears will be shed.\r\nIn a recent episode of the meWATCH talk show The Reunion, the cast of The Little Nyonya (2008) gat… [+2651 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Chinese New Year tourism hopes fizzle for Asian destinations, as China's travellers stay home - CNA", "description": "BANGKOK: A hoped-for boom in Chinese tourism in Asia over next week’s Chinese New Year holidays looks set to be more of a blip as most travellers opt to stay inside China if they go anywhere. From the beaches", "url": "https://www.channelnewsasia.com/asia/china-travellers-stay-home-chinese-new-year-tourism-asian-destinations-3217266", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--Po5SpAGX--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/asia_lunar_new_year_tourism_38757.jpg?itok=TSLTYnCu", "publishedAt": "2023-01-19T09:58:00Z", "content": "Just days before Sunday's start of the Chinese New Year, iconic tourist spots in the former Portuguese colony, like historic Senado Square and the Ruins of St. Pauls, were packed. Gambling floors at … [+1698 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "POC, PSC get pedals circling for Cambodia Games - Manila Bulletin", "description": "A first-time meet between Philippine Olympic Committee (POC) and newly-appointed Philippine Sports Commission (PSC) brass happened Wednesday night, Jan. 18, to get the pedals circling for the country’s preparations for the 32nd Southeast Asian Games.", "url": "https://mb.com.ph/2023/01/19/poc-psc-get-pedals-circling-for-cambodia-games/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2023/01/poc_psc_meeting.png", "publishedAt": "2023-01-19T07:10:27Z", "content": "A first-time meet between Philippine Olympic Committee (POC) and newly-appointed Philippine Sports Commission (PSC) brass happened Wednesday night, Jan. 18, to get the pedals circling for the country… [+2281 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "What's the largest amount you've received in your Chinese New Year red packet? It's a $5000 cheque for one woman - AsiaOne", "description": "As they say, comparison is the thief of joy — perhaps even more so when it involves cold, hard, cash? Nevertheless, Mediacorp DJ Sonia Chew and actor Zhang Zetong hit the streets recently to find out just how much some people in Singapore are getting in their…", "url": "https://www.asiaone.com/lifestyle/whats-largest-amount-youve-received-your-chinese-new-year-red-packet-its-5000-cheque-sonia-chew-zhang-zetong", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/cnyangbaorate.jpeg?h=7d3a4ad9&itok=yU7XQa-S", "publishedAt": "2023-01-19T04:25:00Z", "content": "As they say, comparison is the thief of joy perhaps even more so when it involves cold, hard, cash?\r\nNevertheless, Mediacorp DJ Sonia Chew and actor Zhang Zetong hit the streets recently to find out … [+2969 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Family in Hokkaido crash that killed mum and infant had planned to return to celebrate CNY - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): On maternity leave after giving birth to her second daughter four months ago, Lin Xiuyue took the opportunity to visit Hokkaido, Japan, with her husband and two children.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2023/01/19/family-in-hokkaido-crash-that-killed-mum-and-infant-had-planned-to-return-to-celebrate-cny", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2023/01/19/1907737.png", "publishedAt": "2023-01-19T03:15:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): On maternity leave after giving birth to her second daughter four months ago, Lin Xiuyue took the opportunity to visit Hokkaido, Japan, with her husba… [+2384 chars]"}]}