{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "India TV News"}, "author": "Written by Varun Malik", "title": "IND vs SL Colombo Weather updates LIVE: No rain in Sri Lanka capital before India's Asia Cup final clash - India TV News", "description": "ZIND vs SL Asia Cup final, today weather forecast in Colombo, ind vs sl weather report today, r premadasa stadium weather report, weather at premadasa stadium colombo, weather in colombo cricket ground, weather today at colombo stadium, todays weather in colo…", "url": "https://www.indiatvnews.com/sports/cricket/ind-vs-sl-colombo-weather-updates-live-will-india-vs-sri-lanka-asia-cup-final-get-washed-out-at-r-premadasa-colombo-rain-forecast-reserve-day-2023-09-17-893138", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/09/ind-srilanka-weather-live-1694916385.jpg", "publishedAt": "2023-09-17T06:04:34Z", "content": "India vs Sri Lanka vs Weather. It's the final time in the 14th edition of the Asia Cup that we hope that rain stays away. Hello and welcome everyone to one of the most sought-out things in this entir… [+321 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "Kim Jong-un ‘Checks Out’ MiG-31, Kinzhal Hypersonic Missile As Moscow, Pyongyang Cement Ties - EurAsian Times", "description": "North Korean leader Kim Jong Un, currently visiting Russia, inspected several state-of-the-art systems deployed in the ongoing Ukraine war, including the Kinzhal hypersonic missile, supersonic bombers, and the latest weapons mounted on the MiG-31 missile carr…", "url": "https://www.eurasiantimes.com/kim-jong-un-checks-out-mig-31-fighter-kinzhal-hypersonic/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2023/09/su-57.jpg", "publishedAt": "2023-09-16T18:24:21Z", "content": "North Korean leader Kim Jong Un, currently visiting Russia, inspected several state-of-the-art systems deployed in the ongoing Ukraine war, including the Kinzhal hypersonic missile, supersonic bomber… [+6499 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Asia Cup 2023: Rohit Sharma Equals Virat Kohli In The List Of Unwanted Record With A Duck Against Ba.. - NDTV Sports", "description": "Director Comey says the probe into last year's US election would assess if crimes were committed.", "url": "https://www.bbc.com/news/world-us-canada-39324587", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/44EC/production/_95244671_mediaitem95244670.jpg", "publishedAt": "2023-09-16T14:13:00Z", "content": "Media caption, 'Putin hates Clinton' and other things the FBI learned about Russia\r\nFBI director James Comey has confirmed for the first time that the FBI is investigating alleged Russian interferenc… [+5942 chars]"}]}