{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Elaine Kurtenbach, Matt Ott", "title": "Wall Street ticks higher ahead of Fed's rate decision; Trump’s Asian tour sends Nikkei to a record - AP News", "description": "Shares are mostly higher in Asia and Japan's benchmark Nikkei 225 index has surged more than 2% to another record. U.S. futures were mixed early Wednesday and oil prices were little changed. Upbeat comments by U.S. President Donald Trump on relations with maj…", "url": "https://apnews.com/article/stocks-markets-trump-china-earnings-69291796738e739611fa7415a43cff02", "urlToImage": "https://dims.apnews.com/dims4/default/5276f94/2147483647/strip/true/crop/7417x4172+0+386/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2F19%2Fb78b37852e338ee2aa9b9c9efe10%2F6522db9611564ed38154cfb02da11e27", "publishedAt": "2025-10-29T12:14:00Z", "content": "Wall Street was pointing toward gains in premarket trading Wednesday as markets focus on the latest corporate earnings ahead of the Federal Reserves interest rate decision this afternoon.\r\nFutures fo… [+3505 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Krystal Kasal", "title": "New DNA evidence from Crimea sheds light on Neanderthal migration into Asia - Phys.org", "description": "Researchers have long been attempting to piece together the trek of Neanderthals from Europe into Asia around the Middle and Upper Paleolithic time periods. This time marks the eventual disappearance of Neanderthals and the transition to a Homo-sapien-dominat…", "url": "https://phys.org/news/2025-10-dna-evidence-crimea-neanderthal-migration.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2025/new-dna-evidence-from.jpg", "publishedAt": "2025-10-28T15:20:10Z", "content": "Researchers have long been attempting to piece together the trek of Neanderthals from Europe into Asia around the Middle and Upper Paleolithic time periods. This time marks the eventual disappearance… [+3955 chars]"}]}