{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Author Sudhir Vadaketh challenges Mediacorp claim of merit-based hiring - The Online Citizen Asia", "description": "The Online Citizen Asia Author Sudhir Vadaketh challenges Mediacorp claim of merit-based hiring", "url": "https://www.theonlinecitizen.com/2021/08/12/author-sudhir-vadaketh-challenges-mediacorp-claim-of-merit-based-hiring/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/08/sudhir-vadaketh-mediacorp.png", "publishedAt": "2021-08-12T09:36:24Z", "content": "Channel NewsAsia (CNA) is Singapores equivalent of Russia Today where its journalists arent allowed to cover a whole range of topics, said author and former EIU senior editor Sudhir Vadaketh on Thurs… [+6763 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Breathing, talking and sneezing can spread Covid-19: NUS study - AsiaOne", "description": "SINGAPORE - A new study by a National University of Singapore (NUS) team has found that an infected person can spread Covid-19 by exhaling fine aerosol particles when breathing, talking and singing, not just though droplets when coughing or sneezing. The auth…", "url": "https://www.asiaone.com/singapore/breathing-talking-and-sneezing-can-spread-covid-19-nus-study", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210812_breathing_nus.jpg?h=0429cc9e&itok=-r9nuMhw", "publishedAt": "2021-08-12T01:16:20Z", "content": "SINGAPORE - A new study by a National University of Singapore (NUS) team has found that an infected person can spread Covid-19 by exhaling fine aerosol particles when breathing, talking and singing, … [+5624 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Mo Stewart", "title": "Liverpool can use Lionel Messi transfer to sneak his potential successor out of PSG - Liverpool.com", "description": "With PSG forced to sell to accommodate their influx of superstars, including Lionel Messi, Liverpool can snatch their top young talent including fellow La Masia starlet in Xavi Simons.", "url": "https://www.liverpool.com/liverpool-fc-news/transfer-news/lionel-messi-transfer-psg-liverpool-21288972", "urlToImage": "https://i2-prod.liverpool.com/incoming/article21288935.ece/ALTERNATES/s1200/0_XaviSimon.jpg", "publishedAt": "2021-08-12T00:00:00Z", "content": "With Lionel Messi now confirmed at Paris Saint Germain, the football world has begun salivating over the star-studded XI that the Parisiens can potentially field. FIFA FUT 22 has taken over real life… [+5859 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Jump inside bro': Man finds himself stuck in MBS fountain - AsiaOne", "description": "Those who've been to Marina Bay Sands (MBS) will be familiar with Rain Oculus, the massive water feature located in the Shoppes. Recently, a man had a different experience of the fountain than most visitors. He had climbed into the bowl and a short 11-second …", "url": "https://www.asiaone.com/singapore/jump-inside-bro-man-finds-himself-stuck-mbs-fountain", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20211209_mbsfountainHL.jpg?h=388f2129&itok=iNZ3F4yv", "publishedAt": "2021-08-11T16:58:00Z", "content": "Those who've been to Marina Bay Sands (MBS) will be familiar with Rain Oculus, the massive water feature located in the Shoppes. Recently, a man had a different experience of the fountain than most v… [+1456 chars]"}]}