{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "ign", "name": "IGN"}, "author": "Matt T.M. Kim", "title": "Pokemon Wonder Is a Beautiful New Japanese Theme Park That Celebrates Nature - IGN SOUTH EAST ASIA", "description": "Explore an untouched forest and look for hand-crafted Pokemon.", "url": "https://sea.ign.com/pokemon-legends-arceus/173867/news/pokemon-wonder-is-a-beautiful-new-japanese-theme-park-that-celebrates-nature", "urlToImage": "https://sm.ign.com/t/ign_ap/news/p/pokemon-wo/pokemon-wonder-is-a-beautiful-new-japanese-theme-park-that-c_m4z5.1200.png", "publishedAt": "2021-07-02T20:26:12Z", "content": "The story goes that Pokemon was inspired by kids collecting bugs in Japan, and as such the association with nature has always been a pillar of the franchise. The Pokemon Company is applying this phil… [+1156 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "", "title": "Vietnam orders Netflix to remove Australian spy show over South China Sea map - GMA News Online", "description": "Netflix Inc has removed Australian spy drama &quot;Pine Gap&quot; from its services in Vietnam after a complaint from broadcast authorities in the Southeast Asian country about the appearance of a map which depicts Chinese claims in the South China Sea.", "url": "https://www.gmanetwork.com/news/news/world/793892/vietnam-orders-netflix-to-remove-australian-spy-show-over-south-china-sea-map/story/", "urlToImage": "https://images.gmanews.tv/webpics/2017/08/VietnamFlag_2017_08_15_12_55_52.png", "publishedAt": "2021-07-02T20:18:03Z", "content": "HANOI, Vietnam - Netflix Inc has removed Australian spy drama \"Pine Gap\" from its services in Vietnam after a complaint from broadcast authorities in the Southeast Asian country about the appearance … [+1900 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Xiang Yun and Edmund Chen's son Yixi launches website selling own illustrations and watercolour artwork - AsiaOne", "description": "Local actor Chen Yixi was brought up in a different environment from most of us and his peers — his parents are akin to the Kanye Wests and Kim Kardashians of our world. My point is that his parents are household names. It's a fact that not everyone has an Ed…", "url": "https://www.asiaone.com/entertainment/xiang-yun-and-edmund-chens-son-yixi-launches-website-selling-own-illustrations-and", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2021/20210702_yixiHL.jpg?h=7312dcf9&itok=52XdWjK_", "publishedAt": "2021-07-02T07:45:00Z", "content": "Local actor Chen Yixi was brought up in a different environment from most of us and his peers his parents are akin to the Kanye Wests and Kim Kardashians of our world.\r\nMy point is that his parents a… [+2204 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PSP refutes false allegations by Minister Ong Ye Kung; Ask for the Health Minister to withdraw his statement and apologise - The Online Citizen Asia", "description": "The Online Citizen Asia PSP refutes false allegations by Minister Ong Ye Kung; Ask for the Health Minister to withdraw his statement and apologise Labour", "url": "https://www.theonlinecitizen.com/2021/07/01/psp-refutes-false-allegations-by-minister-ong-ye-kung-and-ask-for-him-to-withdraw-his-statement-and-apologise/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/PSP-ong-ye-kung.png", "publishedAt": "2021-07-01T14:13:25Z", "content": "Singapore’s alternative party, Progress Singapore Party (PSP) issued a statement on Thursday evening (1 July) to refute allegations put forth by Health Minister Ong Ye Kung on his Facebook page, wher… [+6685 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "AGENCY", "title": "Hong Kong star Louis Koo to launch China-Korean girl group Skyle this month - The Star Online", "description": "The actor has formed a four-member girl group, selected from auditions held all over Asia.", "url": "https://www.thestar.com.my/lifestyle/entertainment/2021/07/01/hong-kong-star-louis-koo-to-launch-china-korean-girl-group-skyle-this-month", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/01/1205140.jpg", "publishedAt": "2021-07-01T12:00:00Z", "content": "Actor and film producer Louis Koo has formed a four-member girl group Skyle, which will make its debut in mid-July.\r\nThe members, who are from China and South Korea, have not been unveiled, although … [+1386 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Case closed: 'Cheek fillers' legal fight between Fann Wong and aesthetics doctor Siew Tuck Wah ends - AsiaOne", "description": "When Fann Wong appeared on Star Awards 2021 in April with pronounced cheeks, a local aesthetic doctor, Dr Siew Tuck Wah, wrote an opinion piece about it. He then received a letter of demand from a lawyer representing the actress' management. In a Facebook pos…", "url": "https://www.asiaone.com/entertainment/case-closed-cheek-fillers-legal-fight-between-fann-wong-and-aesthetics-doctor-siew-tuck-wah", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/fannwong-stw_IG.jpg?h=c208c3e0&itok=LqzbktPD", "publishedAt": "2021-07-01T02:00:00Z", "content": "When Fann Wong appeared on Star Awards 2021 in April with pronounced cheeks, a local aesthetic doctor, Dr Siew Tuck Wah, wrote an opinion piece about it.\r\nHe then received a letter of demand from a l… [+4263 chars]"}]}