{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "If it weren't for Sharon Au, Darren Lim and Evelyn Tan might not have got together - AsiaOne", "description": "Local celebrities Darren Lim and Evelyn Tan have been together for a long time and they're still going strong. However, they might not have had that happy ending if it weren't for another celebrity — former actress-host Sharon Au. In an article on Monday (Nov…", "url": "https://www.asiaone.com/entertainment/if-it-werent-sharon-au-darren-lim-and-evelyn-tan-might-not-have-got-together", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/sharon-darren-evelyn_lhwb.jpg?h=571c1fa9&itok=wJBTqtNe", "publishedAt": "2021-11-24T10:35:00Z", "content": "Local celebrities Darren Lim and Evelyn Tan have been together for a long time and they're still going strong. However, they might not have had that happy ending if it weren't for another celebrity f… [+1804 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Prepared to be scolded: Shane Pow to act in Mediacorp telemovie, first show after leaving prison - AsiaOne", "description": "Things are picking up for local actor Shane Pow after a terrible year. Besides being a regular livestreamer on Mdada — an online sales platform started by celebrity hairstylist Addy Lee, actress Michelle Chia, and host Pornsak — Shane has signed on to star in…", "url": "https://www.asiaone.com/entertainment/prepared-be-scolded-shane-pow-act-mediacorp-telemovie-first-show-after-leaving-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211123_shane.jpg?h=f74d8d50&itok=_KndRlRk", "publishedAt": "2021-11-23T11:10:00Z", "content": "Things are picking up for local actor Shane Pow after a terrible year.\r\nBesides being a regular livestreamer on Mdada an online sales platform started by celebrity hairstylist Addy Lee, actress Miche… [+1349 chars]"}]}