{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Eustance Huang", "title": "Asia-Pacific stocks mixed as investors look ahead to HSBC earnings - CNBC", "description": "HSBC is set to release its third-quarter earnings on Monday.", "url": "https://www.cnbc.com/2021/10/25/asia-markets-us-big-tech-earnings-covid-in-china-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106804706-1606865566516-gettyimages-1229866437-JAPAN_JPX.jpeg?v=1635118451", "publishedAt": "2021-10-24T23:39:16Z", "content": "SINGAPORE Shares in Asia-Pacific traded mixed on Monday as investors look ahead to the release of quarterly earnings by HSBC.\r\nJapan's Nikkei 225 slipped 0.99% in early trading while the Topix index … [+1016 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Ryan had something to do with NOC girls': Sylvia Chan in tell-all with Xiaxue - AsiaOne", "description": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up. In an interview with veteran social media influencer Wendy Cheng — better known as Xiaxue — on Sunday night (Oct 24), the 33-year-…", "url": "https://www.asiaone.com/singapore/he-had-something-do-noc-girls-sylvia-chan-tell-all-xiaxue", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/nocsylvia_ytxx.jpg?h=0429cc9e&itok=7Kvw939d", "publishedAt": "2021-10-24T15:55:00Z", "content": "Under public scrutiny for numerous allegations in recent weeks, Night Owl Cinematics (NOC) co-founder Sylvia Chan has spoken up.\r\nIn an interview with veteran social media influencer Wendy Cheng  bet… [+3056 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore to resume travel from South Asia, eases measures for those from Malaysia, Indonesia - The Star Online", "description": "Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust border measures in response to the global Covid-19 situation.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/24/singapore-to-resume-travel-from-south-asia-eases-measures-for-those-from-malaysia-indonesia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/24/1343238.jpg", "publishedAt": "2021-10-24T10:48:00Z", "content": "SINGAPORE, Oct 24 (The Straits Times/ANN): Travellers from six countries that Singapore was previously closed off to will be allowed to enter here from Wednesday, as the nation continues to adjust bo… [+4234 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Actress Gong Li reportedly giving up Singapore citizenship - AsiaOne", "description": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport. The 55-year-old is allegedly renouncing her citizenship due to sweeping crackdowns on the C…", "url": "https://www.asiaone.com/entertainment/actress-gong-li-reportedly-giving-singapore-citizenship", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/241021_gongli_reuters.jpg?h=0429cc9e&itok=gD94y1gM", "publishedAt": "2021-10-24T04:40:00Z", "content": "SINGAPORE - Actress Gong Li is said to be giving up Singapore citizenship, after reportedly being blacklisted by the Chinese government for holding a foreign passport.\r\nThe 55-year-old is allegedly r… [+1751 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I felt doctors were all liars': Sheila Sim on the resentment she had after her brother died - AsiaOne", "description": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her. The 37-year-old model-actress confessed that she resented doctors for a period of time as sh…", "url": "https://www.asiaone.com/entertainment/i-felt-doctors-were-all-liars-sheila-sim-resentment-she-had-after-her-brother-died", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/sheilasim_mewatch.jpg?h=ffd08fb1&itok=rpRbFlr0", "publishedAt": "2021-10-24T01:30:00Z", "content": "The loss of a loved one can impact us in many ways. Though Sheila Sim was too young to comprehend everything following the death of her brother, it did influence her.\r\nThe 37-year-old model-actress c… [+2507 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dengue cluster in your neighbourhood? Here's what you need to know and do - AsiaOne", "description": "In 2020, Singapore had a “historic” dengue outbreak, with a total of 35,315 reported cases. Then in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aedes aegypti breed have grown by 30 per cent in April, compar…", "url": "https://www.asiaone.com/lifestyle/dengue-cluster-your-neighbourhood-heres-what-you-need-know-and-do", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/201021_mosquitodengue_unsplash.jpg?h=4c9e7946&itok=AleDwB-J", "publishedAt": "2021-10-23T11:30:00Z", "content": "In 2020, Singapore had a historic dengue outbreak, with a total of 35,315 reported cases.\r\nThen in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aed… [+4850 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Prop gun in Alec Baldwin accidental movie set shooting had live rounds, police say - AsiaOne", "description": "SANTA FE, N.M. - Alec Baldwin was handed what was described as a safe \"cold gun\" on the set of his movie Rust, but the prop gun contained live rounds when it was fired, according to details of the police investigation into the fatal shooting released on Frida…", "url": "https://www.asiaone.com/entertainment/prop-gun-alec-baldwin-accidental-movie-set-shooting-had-live-rounds-police-say", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/20211023_rust.jpg?h=3626a7e7&itok=UZfAouYV", "publishedAt": "2021-10-23T06:51:00Z", "content": "SANTA FE, N.M. - Alec Baldwin was handed what was described as a safe \"cold gun\" on the set of his movie Rust, but the prop gun contained live rounds when it was fired, according to details of the po… [+4677 chars]"}]}