{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "US CDC opens office in Southeast Asia to help boost health security in the region - CNN Philippines", "description": "The United States Centers for Disease Control and Prevention has established its presence in Southeast Asia to help strengthen the region’s health security capacities.", "url": "http://cnnphilippines.com/news/2021/8/27/US-CDC-Southeast-Asia-office.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2020/9/22/CDC_CNNPH.jpg/jcr:content/CDC_CNNPH.jpg", "publishedAt": "2021-08-27T09:07:24Z", "content": "Metro Manila (CNN Philippines, August 27) The United States Centers for Disease Control and Prevention has established its presence in Southeast Asia to help strengthen the regions health security ca… [+2348 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Sorry lah, cannot send to your letterboxes': Ho Ching on free mask collection - AsiaOne", "description": "Even though we previously said don't kan cheong, mention free goodies to any Singaporean and it will surely cause a major stir. So much so that Ho Ching has chimed in on Facebook on Thursday (Aug 26) to remind \"kiasu Singapore\" that Temasek Foundation has ple…", "url": "https://www.asiaone.com/singapore/sorry-lah-cannot-send-your-letterboxes-ho-ching-free-mask-collection", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/270821_facemasks_ST.jpg?h=0429cc9e&itok=Us_Ms-gE", "publishedAt": "2021-08-27T07:59:00Z", "content": "Even though we previously said don't kan cheong, mention free goodies to any Singaporean and it will surely cause a major stir.\r\nSo much so that Ho Ching has chimed in on Facebook on Thursday (Aug 26… [+1450 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "PNVF to send three teams to Asian club tourney - Manila Bulletin", "description": "The Philippine Sports Commission (PSC) recently approved a 20-member national women’s team and according to Suzara, head coach Odjie Mamon and Brazilian consultant Jorge Edson Souza de Brito will pick four more players to form two teams of 12 players each.", "url": "https://mb.com.ph/2021/08/27/pnvf-to-send-three-teams-to-asian-club-tourney/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/08/received_1006276713524421-1.jpeg", "publishedAt": "2021-08-27T07:23:57Z", "content": "Two national teams will represent the country in the Asian Women’s Club Volleyball Championship Thailand is hosting in Nakhon Ratchasima from October 1 to 7, Philippine National Volleyball Federation… [+2598 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Manish Singh", "title": "Indiagold raises $12 million for its gold-focused digital alternative credit platform - TechCrunch", "description": "India has a unique fascination for gold. The households in the South Asian market are estimated to have a stash of over 25,000 tons of the precious metal whose value today is about half of the country’s nominal GDP. But much of this gold has been sitting idly…", "url": "http://techcrunch.com/2021/08/26/indiagold-raises-12-million-for-its-gold-focused-digital-alternative-credit-platform/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/02/Nitin-and-Deepak.jpg?w=639", "publishedAt": "2021-08-27T06:45:00Z", "content": "India has a unique fascination for gold. The households in the South Asian market are estimated to have a stash of over 25,000 tons of the precious metal whose value today is about half of the countr… [+5673 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Police raid Thai field hospital after reports of group sex - The Star Online", "description": "BANGKOK (The Nation/Asia News Network): Police raided a field hospital in Bang Phli district of Samut Prakan province after learning that some patients had engaged in group sex and smuggled in illegal cigarettes.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/08/27/police-raid-thai-field-hospital-after-reports-of-group-sex", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/08/27/1271454.jpg", "publishedAt": "2021-08-27T06:16:00Z", "content": "BANGKOK (The Nation/Asia News Network): Police raided a field hospital in Bang Phli district of Samut Prakan province after learning that some patients had engaged in group sex and smuggled in illega… [+470 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brie Stimson", "title": "Kamala Harris stops at Pearl Harbor on way back from Asia -- but avoids press questions - Fox News", "description": "Kamala Harris returned to the U.S. on Thursday, landing in Hawaii after her trip to Singapore and Vietnam. But the vice president ignored reporters’ questions – whether about Afghanistan or other topics – as she got off Air Force Two for a stop at Joint Base …", "url": "https://www.foxnews.com/politics/kamala-harris-stops-at-pearl-harbor-on-way-back-from-asia-but-avoids-press-questions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21239097224960.jpg", "publishedAt": "2021-08-27T05:33:13Z", "content": "Kamala Harris returned to the U.S. on Thursday, landing in Hawaii after her trip to Singapore and Vietnam.\r\nBut the vice president ignored reporters questions whether about Afghanistan or other topic… [+3256 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Malaysia logs record high 24599 new Covid-19 cases, 393 deaths in single day - The Straits Times", "description": "The total number of infections in Malaysia is the third highest in South-east Asia after Indonesia and the Philippines.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/se-asia/malaysia-logs-record-high-24599-new-covid-19-cases-393-deaths-in-single-day", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/08/26/mi_msiavirus_260821.jpg?itok=YdzNiO_7", "publishedAt": "2021-08-26T13:19:24Z", "content": "PETALING JAYA - Malaysia on Thursday (Aug 26) logged a double grim record of 24,599 new Covid-19 cases and 393 fatalities.\r\nThe total number of infections in Malaysia since the pandemic began has now… [+1350 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "What is the ISIS threat in Afghanistan?, South Asia News & Top Stories - The Straits Times", "description": "After the Taleban's lightning takeover of Afghanistan, a number of militant groups congratulated them - but not ISIS.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/south-asia/what-is-the-isis-threat-in-afghanistan", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/08/26/ak_afg1_260821_0.jpg?itok=ndxDLD_a", "publishedAt": "2021-08-26T05:38:15Z", "content": "KABUL (AFP) - As desperate Afghans crowd Kabul airport trying to get on any evacuation flights to flee the Taleban, officials have warned of another militant threat: the Islamic State in Iraq and Syr… [+4452 chars]"}]}