{"articles": [{"author": null, "content": "SINGAPORE - A National University of Singapore (NUS) graduate, who returned to his alma mater in January 2019, trespassed into a female student's hostel room and stole her sex toy as he felt aroused … [+2814 chars]", "description": "SINGAPORE - A National University of Singapore (NUS) graduate, who returned to his alma mater in January 2019, trespassed into a female student's hostel room and stole her sex toy as he felt aroused when he saw it. Products specialist Chua Chang Rong, now 27,…", "publishedAt": "2021-03-24T00:27:55Z", "source": {"id": null, "name": "AsiaOne"}, "title": "'I know your dirty little secret': NUS graduate steals sex toy from woman's hostel room, sends her lewd texts - AsiaOne", "url": "https://www.asiaone.com/singapore/i-know-your-dirty-little-secret-nus-graduate-steals-sex-toy-womans-hostel-room-sends-her", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/image_936.jpg?h=199d8c1f&itok=gssCME-w"}, {"author": null, "content": "Imagine working hard in your chosen profession for almost two decades before uprooting yourself and your young family to take on a new challenge.\r\nThats what Singaporean-born senior constable Zainon … [+5183 chars]", "description": "Imagine working hard in your chosen profession for almost two decades before uprooting yourself and your young family to take on a new challenge. That’s what Singaporean-born senior constable Zainon Mohamad Kassim did when she joined the Western Australia (WA…", "publishedAt": "2021-03-23T23:00:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "First police officer to wear tudung in Western Australia is from Singapore: 'I was born and raised in a multi-cultural society' - AsiaOne", "url": "https://www.asiaone.com/singapore/first-police-officer-wear-tudung-western-australia-singapore-i-was-born-and-raised-multi", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/220321_zen_WApolice.jpeg?h=0429cc9e&itok=RLVWNGCM"}, {"author": null, "content": "In the wake of the debate on the tudung ban against Muslim women in uniformed professions in the public sector, Law and Home Affairs Minister K Shanmugam said on Tuesday (23 Mar) that it is likely th… [+8847 chars]", "description": "The Online Citizen Asia Tudung issue: Netizens question why Minister Masagos Zulkifli earlier gave \"flimsy\" reasons behind prohibition after Minister K Shanmugam says nurses likely to be permitted to wear headscarf Current Affairs", "publishedAt": "2021-03-23T18:28:44Z", "source": {"id": null, "name": "The Online Citizen"}, "title": "Tudung issue: Netizens question why Minister Masagos Zulkifli earlier gave \"flimsy\" reasons behind prohibition after Minister K Shanmugam says nurses likely to be permitted to wear headscarf - The Online Citizen Asia", "url": "https://www.theonlinecitizen.com/2021/03/24/tudung-issue-netizens-question-why-minister-masagos-zulkifli-earlier-gave-flimsy-reasons-behind-prohibition-after-minister-k-shanmugam-says-nurses-likely-to-be-permitted-to-wear-headscarf/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/03/k-shanmugam.png"}, {"author": null, "content": "He told AsiaOne in an interview in January that he's keeping the interior design for his new house a secret until the big reveal in the near future.\r\nIs the wait over?\r\nYesterday (March 22), actor La… [+1586 chars]", "description": "He told AsiaOne in an interview in January that he's keeping the interior design for his new house a secret until the big reveal in the near future. Is the wait over? Yesterday (March 22), actor Lawrence Wong uploaded a video of his home bathroom to Instagram…", "publishedAt": "2021-03-22T06:35:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Actor Lawrence Wong reveals stunning minimalistic toilet in his new home - AsiaOne", "url": "https://www.asiaone.com/entertainment/actor-lawrence-wong-reveals-stunning-minimalistic-toilet-his-new-home", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210322_lawrence.jpg?h=08516339&itok=nHkMu2Tb"}], "message": "Successful api call", "number_of_news": 4, "status": 200, "topic": "asia"}