{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "MEL MATTHEW DOCTOR, GMA News", "title": "AMTI: China thrice harassed Filipino vessels in past two months - GMA News Online", "description": "The Chinese Coast Guard and militia harassed Filipino vessels in the Philippine&#39;s exclusive economic zone (EEZ) in the West Philippine Sea (WPS) in three separate incidents over the last two months, the Washington-based Asia Maritime Transparency Initiati…", "url": "https://www.gmanetwork.com/news/topstories/nation/833313/amti-china-thrice-harassed-filipino-vessels-in-west-philippine-sea-in-past-two-months/story/", "urlToImage": "https://images.gmanews.tv/webpics/2018/11/china_coast_guard_2018_11_26_17_15_56.jpg", "publishedAt": "2022-05-30T08:27:00Z", "content": "The Chinese Coast Guard and militia harassed Filipino vessels in the Philippine's exclusive economic zone (EEZ) in the West Philippine Sea (WPS) in three separate incidents over the last two months, … [+5880 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Asus ROG Cetra True Wireless Earbuds: Great for gaming but audio department needs improvement - AsiaOne", "description": "Asus can always be depended on to deliver high-quality products and PC-building parts, and its audio offerings are no slouch either. Having released multiple lines of both wired and wireless headphones, the Taiwanese tech giant has more than enough expertise …", "url": "https://www.asiaone.com/digital/asus-rog-cetra-true-wireless-earbuds-great-gaming-audio-department-needs-improvement", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/300522_AsusEarbuds_ASUSTEK%20COMPUTER%20INC.jpg?h=0429cc9e&itok=OREfguoB", "publishedAt": "2022-05-30T05:17:00Z", "content": "Asus can always be depended on to deliver high-quality products and PC-building parts, and  its audio offerings are no slouch either.\r\nHaving released multiple lines of both wired and wireless headph… [+7965 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Trixie Chua, founder of Singapore sustainable fashion brand Dear Samfu - Channel NewsAsia", "description": "Could grandma’s fashion sensibilities be the answer to the massive wastage of fast fashion? Trixie Chua, founder of sustainable fashion brand Dear Samfu thinks so. CNA Women speaks to her in this instalment of our women in sustainability series.", "url": "https://cnalifestyle.channelnewsasia.com/women/women-sustainability-fashion-trixie-chua-dear-samfu-311666", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--yA94mIA2--/c_crop,h_843,w_1500,x_0,y_76/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/06/hero.jpg?itok=lR1XU1mZ", "publishedAt": "2022-05-29T22:45:00Z", "content": "The cheongsam is fast becoming a fixture in the wardrobe of many Chinese women as more embrace their Asian heritage. In contrast, few know about the cheongsams more practical cousin, the samfu, even … [+894 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Jury's duty in Johnny Depp-Amber Heard trial doesn't track public debate - Channel NewsAsia", "description": "Depp has denied any physical or sexual abuse, and says Heard concocted the claims to destroy his reputation. Depp's legions of online fans have focused on their belief that Heard has been untruthful, and that will determine the outcome.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/johnny-depp-amber-heard-libel-suit-313236", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--UvyEQ-D9--/c_crop,h_576,w_1024,x_0,y_11/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/29/ap22147718463083.jpg?itok=n4Q5dwb0", "publishedAt": "2022-05-28T22:31:27Z", "content": "A seven-person civil jury in Virginia will resume deliberations Tuesday in Johnny Depp's libel trial against Amber Heard. What the jury considers will be very different from the public debate that ha… [+4693 chars]"}]}