{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Physical: 100's Singaporean contestant Elaine Wong told others 'please don't hurt me', says she wasn't set up to fail - AsiaOne", "description": "When faced against national athletes double her size, there wasn't much Elaine Wong could do in Netflix's Physical: 100 — but she gave as good of a fight as she could. In an interview with AsiaOne on Monday (Feb 6), Elaine shared what it was like squaring off…", "url": "https://www.asiaone.com/entertainment/physical-100-singaporean-contestant-elaine-wong-please-dont-hurt-me-wasnt-set-up-fail-netflix", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/070223_elainewongshimeuddeum_insta.jpg?h=23c5ed2d&itok=wQDdSgOY", "publishedAt": "2023-02-07T09:58:00Z", "content": "When faced against national athletes double her size, there wasn't much Elaine Wong could do in Netflix's Physical: 100 but she gave as good of a fight as she could.\r\nIn an interview with AsiaOne on … [+10091 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": null, "title": "Alex Eala brings Filipino pride to the WTA - Rappler", "description": "Though uncertain about her SEA Games and Asian Games participation, Alex Eala makes sure to represent the country on the women's tour", "url": "https://www.rappler.com/sports/alex-eala-brings-filipino-pride-women-tennis-association/", "urlToImage": "https://www.rappler.com/tachyon/2022/09/ALEX-EALA-US-OPEN-PHILIPPINES.jpg", "publishedAt": "2023-02-07T09:22:46Z", "content": "MANILA, Philippines Its not usual to see a Philippine flag in the Womens Tennis Association (WTA) events, but Alex Eala will make sure that it is here to stay. \r\nRanked No. 217 in the world, Eala wil… [+2144 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Something my grandma used to tell me': Chew Chor Meng teaches us Teochew phrase - AsiaOne", "description": "Chinese dialects are a rich (and sadly declining) part of Singapore history, and who better to teach us than a native speaker? In an Instagram video posted yesterday (Feb 6), local actor Chew Chor Meng said: \"The Teochew phrase I am sharing with everyone toda…", "url": "https://www.asiaone.com/entertainment/something-my-grandma-used-tell-me-chew-chor-meng-teaches-us-teochew-phrase", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/230207_chew%20chor%20meng.png?h=df2fab92&itok=D_tfYlF7", "publishedAt": "2023-02-07T07:35:00Z", "content": "Chinese dialects are a rich (and sadly declining) part of Singapore history, and who better to teach us than a native speaker?\r\nIn an Instagram video posted yesterday (Feb 6), local actor Chew Chor M… [+2257 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Ideal cardiovascular health can help people live longer, finds Chinese Medical Journal study - EurekAlert", "description": "The American Heart Association defines ideal cardiovascular health (ICH) based on seven behavioral and clinical factors. However, its association with mortality in Asians is unclear. Pooling data from almost 200,000 individuals, a recent study examined the re…", "url": "https://www.eurekalert.org/news-releases/978793", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/42c32f9b-5843-4af9-ac3b-feffb4924ee8/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-07T02:00:04Z", "content": "image: The article described 3 studies done in China and shows that maintaining cardiovascular health could result in lower mortalityview more \r\nCredit: Chinese Medical Journal\r\nCardiovascular diseas… [+4365 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "K.M. BOOPATHY", "title": "Zii Jia believes Malaysia strong enough to meet top-four target - The Star Online", "description": "PETALING JAYA: Independent player Lee Zii Jia believes Malaysia have a good chance of meeting the top-four finish as targeted by the Badminton Association of Malaysia (BAM) based on a full-strength squad that will be competing in the Asian Mixed Team Champion…", "url": "https://www.thestar.com.my/sport/badminton/2023/02/07/zii-jia-believes-malaysia-strong-enough-to-meet-top-four-target", "urlToImage": "https://cdn.thestar.com.my/Themes/img/newTsol_logo_socmedia.png", "publishedAt": "2023-02-06T23:29:09Z", "content": "PETALING JAYA: Independent player Lee Zii Jia believes Malaysia have a good chance of meeting the top-four finish as targeted by the Badminton Association of Malaysia (BAM) based on a full-strength s… [+2850 chars]"}]}