{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Correspondent", "title": "Al-Qaeda messages Taliban on big win, slips in call to ‘liberate’ Kashmir - Hindustan Times", "description": "Following the Taliban takeover of Afghanistan on August 15 after a lightning campaign, one of the greatest concerns of regional analysts has been the victory energising terror groups active across South Asia. | Latest News India", "url": "https://www.hindustantimes.com/india-news/alqaeda-messages-taliban-on-big-win-slips-in-call-to-liberate-kashmir-101630433152980.html", "urlToImage": "https://images.hindustantimes.com/img/2021/08/31/1600x900/b50c901c-0a85-11ec-b7a3-060c0b7322b5_1630433151968.jpg", "publishedAt": "2021-08-31T18:05:52Z", "content": "New Delhi: Al-Qaeda on Tuesday called for the liberation of Kashmir and other so-called Islamic lands from the clutches of the enemies of Islam in a message congratulating the Taliban for its victory… [+2853 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Not so complicated lah': Zoe Tay on reports she was annoyed after son gatecrashed her livestream - AsiaOne", "description": "Some celebrity parents here are fine sharing pics of their kids on social media and letting the world know how they look like. Think Andie Chen-Kate Pang, and also Yvonne Lim. Then there are those who make sure they stick a cute emoji over kiddo's face before…", "url": "https://www.asiaone.com/entertainment/not-so-complicated-lah-zoe-tay-reports-she-was-annoyed-after-son-gatecrashed-heartland-hero", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210831_zoe1.jpg?h=ea7b1fa3&itok=C3c07w8r", "publishedAt": "2021-08-31T12:34:00Z", "content": "Some celebrity parents here are fine sharing pics of their kids on social media and letting the world know how they look like. Think Andie Chen-Kate Pang, and also Yvonne Lim.\r\nThen there are those w… [+2430 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Cheers mate': Netizens applaud as Singapore sends 500000 Covid-19 vaccine doses down under to Australia - AsiaOne", "description": "Half a million Pfizer-BioNTech Covid-19 vaccine doses from Singapore will be making its way to Australia, and netizens from both countries are applauding this initiative. The doses will arrive in Australia later this week and then rolled out across the nation…", "url": "https://www.asiaone.com/singapore/cheers-mate-netizens-applaud-singapore-sends-500000-covid-19-vaccine-doses-down-under", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20213108_sgaussieHLnew.jpg?h=0429cc9e&itok=XMQSzFkv", "publishedAt": "2021-08-31T10:39:11Z", "content": "Half a million Pfizer-BioNTech Covid-19 vaccine doses from Singapore will be making its way to Australia, and netizens from both countries are applauding this initiative.\r\nThe doses will arrive in Au… [+2330 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Is the Govt coming up with a more convoluted way of dealing with minimum wage because it does not want to give WP any credence or recognition? - The Online Citizen Asia", "description": "The Online Citizen Asia Is the Govt coming up with a more convoluted way of dealing with minimum wage because it does not want to give WP any credence or recognition?  Opinion", "url": "https://www.theonlinecitizen.com/2021/08/31/is-the-govt-coming-up-with-a-more-convoluted-way-of-dealing-with-minimum-wage-because-it-does-not-want-to-give-wp-any-credence-or-recognition/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/08/living-wage.png", "publishedAt": "2021-08-31T06:48:33Z", "content": "The Worker’s Party (WP) has long championed the need for Singapore to implement a minimum wage for all workers. Various members of parliament (MP) from the WP including party chief, Pritam Singh and … [+2776 chars]"}, {"source": {"id": null, "name": "Macworld"}, "author": "Roman Loyola", "title": "iPhone 13 could use low earth satellites to make calls and texts - Channel Asia Singapore", "description": "A new rumor says the iPhone 13 may be equipped with a custom Qualcomm X60 chip that works with low earth satellites—but hold your horses.", "url": "https://www.macworld.com/article/354402/iphone-13-low-earth-satellite-connectivity.html", "urlToImage": "https://www.macworld.com/wp-content/uploads/2021/08/iphone-reception-7.jpg?quality=50&strip=all&w=1024", "publishedAt": "2021-08-31T05:56:29Z", "content": "Skip to contentType your search and hit enter\r\nUpdate 4:30 p.m. PT: Mark Gurman at Bloomberg has more detail on this supposed future capability, which is more limited in scope than previously reporte… [+3246 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singaporeans may not get same Covid-19 booster jabs as earlier shots - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): When Covid-19 booster shots are rolled out in Singapore, some may be given the same vaccine they took earlier while others may be administered a different one.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/08/31/singaporeans-may-not-get-same-covid-19-booster-jabs-as-earlier-shots", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/08/31/1275911.jpg", "publishedAt": "2021-08-31T04:23:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): When Covid-19 booster shots are rolled out in Singapore, some may be given the same vaccine they took earlier while others may be administered a diffe… [+7492 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "WHO sounds alarm over rising COVID deaths in Europe - The Online Citizen Asia", "description": "The Online Citizen Asia WHO sounds alarm over rising COVID deaths in Europe Health", "url": "https://www.theonlinecitizen.com/2021/08/30/who-sounds-alarm-over-rising-covid-deaths-in-europe/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/08/featured-image-covid-france.png", "publishedAt": "2021-08-30T13:38:49Z", "content": "The World Health Organization warned on Monday that another 236,000 people could die from COVID in Europe by 1 December, sounding the alarm over rising infections and stagnating vaccine rates on the … [+3515 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PM Lee acknowledges work pass holders bringing in social practices and class distinctions that cause frictions - The Online Citizen Asia", "description": "The Online Citizen Asia PM Lee acknowledges work pass holders bringing in social practices and class distinctions that cause frictions Current Affairs", "url": "https://www.theonlinecitizen.com/2021/08/30/pm-lee-acknowledges-work-pass-holders-bringing-in-social-practices-and-class-distinctions-that-cause-frictions/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/08/bring-in-culture.png", "publishedAt": "2021-08-30T12:54:47Z", "content": "At the National Day Rally last night (29 Aug), Prime Minister Lee Hsien Loong acknowledged the existence of social frictions arise between Singaporeans and foreign work pass holders in Singapore.\r\nHe… [+5125 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": "Suzanne Sng", "title": "Li Nanxing, managed by Vicki Zhao in China, says he's not affected by her being blacklisted - AsiaOne", "description": "SINGAPORE - Singapore actor Li Nanxing, who is managed by actress Vicki Zhao's company for work in China, says her recent scandal will not affect him.\"The management contract is not affected,\" his manager in Singapore said in response to...", "url": "https://www.asiaone.com/entertainment/li-nanxing-managed-vicki-zhao-china-says-hes-not-affected-her-being-blacklisted", "urlToImage": "https://www.asiaone.com/sites/default/files/styles/a1_og_image/public/original_images/Aug2021/20210830_VickiZhaoAndLiNanXing_STFile.jpg?itok=fvLu32ef", "publishedAt": "2021-08-30T07:00:01Z", "content": "SINGAPORE - Singapore actor Li Nanxing, who is managed by actress Vicki Zhao's company for work in China, says her recent scandal will not affect him.\r\n\"The management contract is not affected,\" his … [+2213 chars]"}]}