{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Just buy a dishwashing machine? $3500 monthly salary for dishwasher sparks online debate - AsiaOne", "description": "When some food and beverage operators in Singapore are unable to find willing candidates to work as dishwashers, going automatic might seem to be the best solution for their troubles. But not every form of manual labour can be done with machines. On Thursday …", "url": "https://www.asiaone.com/singapore/just-buy-dishwashing-machine-3500-monthly-salary-dishwasher-sparks-online-debate", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/immdishwashing_mti.jpg?h=0429cc9e&itok=T4B0Rf_8", "publishedAt": "2022-05-28T00:00:00Z", "content": "When some food and beverage operators in Singapore are unable to find willing candidates to work as dishwashers, going automatic might seem to be the best solution for their troubles.\r\nBut not every … [+2214 chars]"}, {"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Sagar Rangaraju", "title": "Wars of Prasia: Nexon announces its upcoming cross-platform MMORPG to be available on mobile - GamingonPhone", "description": "Over the past few years, cross-platform gaming has grown tremendously, and the market for these kinds of games has been thriving like never before. Nexon has been developing a brand-new MMORPG since l", "url": "https://gamingonphone.com/news/wars-of-prasia-nexon-announces-its-upcoming-cross-platform-mmorpg-to-be-available-on-mobile/", "urlToImage": "https://gamingonphone.com/wp-content/uploads/2022/05/Wars-of-Prasia-announced.jpg", "publishedAt": "2022-05-27T14:41:09Z", "content": "Over the past few years, cross-platform gaming has grown tremendously, and the market for these kinds of games has been thriving like never before. Nexon has been developing a brand-new MMORPG since … [+2280 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Ian Fang returns to using original name for 'reincarnation' — and other local celebs who changed their names - AsiaOne", "description": "Local actor Ian Fang has never been one to shy away from the limelight. From his scandal with local actress Carrie Wong to his alleged involvement with Rebecca Lim, it is safe to say that he has landed himself in his fair share of controversies over the years…", "url": "https://www.asiaone.com/entertainment/ian-fang-using-original-name-reincarnation-celebs-changed-names-chen-xi-felicia-chin-zhang-zhenhuan", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/20220527_IanFang_Instagram.jpg?h=3df888d6&itok=78eMsQnp", "publishedAt": "2022-05-27T11:04:00Z", "content": "Local actor Ian Fang has never been one to shy away from the limelight.\r\nFrom his scandal with local actress Carrie Wong to his alleged involvement with Rebecca Lim, it is safe to say that he has lan… [+2922 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "He's back: Harrison Ford reveals first glimpse of Indiana Jones 5 - Channel NewsAsia", "description": "The actor teased his return to the swashbuckling archaeologist role. The fifth instalment in the franchise is set for June 2023.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/harrison-ford-indiana-jones-5-first-look-release-date-313176", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--Iphk-Af5--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/27/indiana_jones_5_first_look.png?itok=t_1ihYzn", "publishedAt": "2022-05-27T08:03:31Z", "content": "Speaking to the crowd at the Anaheim Convention Centre, Ford said: It is a great pleasure to be here, to a flourish of applause and cheers. He also took the time to tell Williams, this music follows … [+959 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Ellen DeGeneres ends daytime show with plea for compassion - Channel NewsAsia", "description": "DeGeneres and guests Jennifer Aniston, Billie Eilish and Pink shared memories and affection as The Ellen DeGeneres Show concluded its Emmy-winning, 3,200-plus episode run that began in September 2003.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/ellen-degeneres-talk-show-ends-finale-313121", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--h19ZcSjA--/c_crop,h_576,w_1024,x_0,y_70/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/27/ap22146501853155.jpg?itok=3NTLgJqA", "publishedAt": "2022-05-27T01:16:47Z", "content": "The host, who became known for encouraging her audience to join her in impromptu dances, shared some last moves with her sidekick and DJ, Stephen tWitch Boss, to the tune Best Of My Love.\r\nThe dancer… [+2257 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Russian, NASA Astronauts ‘Fight It Out’ At International Space Station; US Crew Says Wanted To ‘Poke Holes’ In His Logic - EurAsian Times", "description": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Station (ISS). NASA astronaut Mark Vande Hei who returned to Ea…", "url": "https://eurasiantimes.com/russian-nasa-astronauts-fight-it-out-at-international-space-station/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/05/Russia-e1653551849487.jpg", "publishedAt": "2022-05-26T08:01:00Z", "content": "The repercussions of Russia’s invasion of Ukraine appear to be extending into space as well, with a NASA astronaut revealing rising tensions with Russian cosmonauts aboard the International Space Sta… [+4184 chars]"}]}