{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "Tanvi Mehta", "title": "India posts record daily COVID-19 deaths, one in four globally last week - The Star Online", "description": "(Reuters) -     India accounted for nearly half the coronavirus cases reported worldwide last week, the World Health Organization said on Wednesday, as the south Asian nation's deaths rose by a record 3,780 during the last 24 hours.", "url": "https://www.thestar.com.my/news/world/2021/05/05/india-posts-record-daily-rise-in-coronavirus-deaths", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/05/1138402.JPG", "publishedAt": "2021-05-05T04:48:00Z", "content": "(Reuters) - India accounted for nearly half the coronavirus cases reported worldwide last week, the World Health Organization said on Wednesday, as the south Asian nation's deaths rose by a record 3,… [+4940 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Lawrence Wong says SG didn't close border with India due to need for migrant workers, but traveller stats shows otherwise - The Online Citizen SG", "description": "The Online Citizen Asia Lawrence Wong says SG didn't close border with India due to need for migrant workers, but traveller stats shows otherwise Current Affairs", "url": "https://www.theonlinecitizen.com/2021/05/05/lawrence-wong-says-sg-didnt-close-border-with-india-due-to-need-for-migrant-workers-but-traveller-stats-shows-otherwise/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/05/Lawrence.jpg", "publishedAt": "2021-05-05T04:35:27Z", "content": "At a press briefing on Tuesday (4 May), Minister Lawrence Wong told the media that Singapore can’t afford to shut its borders as the country needs migrant workers to build homes.\r\nMr Wong was trying … [+3052 chars]"}, {"source": {"id": "usa-today", "name": "USA Today"}, "author": "Elinor Aspegren", "title": "'Disgusting and horrific': Two Asian women stabbed in downtown San Francisco, police say; suspect arrested - USA TODAY", "description": "Authorities arrested a man who they say is suspected of stabbing two Asian women without warning in downtown San Francisco on Tuesday.", "url": "https://www.usatoday.com/story/news/nation/2021/05/04/asian-women-san-francisco-stabbing-suspect-arrest/4950836001/", "urlToImage": "https://www.gannett-cdn.com/-mm-/8582db547c24ec0e392b16a428804bf53be90acd/c=827-812-1702-1308/local/-/media/USATODAY/GenericImages/2014/07/25/1406321670000-CALIFORNIA.jpg?width=1600&height=800&fit=crop", "publishedAt": "2021-05-05T04:34:23Z", "content": "Hate crimes are on the rise against communities of color. In 2019, they reached their highest level in more than a decade. Heres why.\r\nUSA TODAY\r\nAuthorities arrested a man who they say is suspected … [+2678 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Hong Kong renters' market as prices drop on expat moves - The Star Online", "description": "An exodus of expatriates following anti-government protests, combined with a declining population and higher unemployment rate have led to sluggish rental demand in the Asian financial hub, even as purchase prices hold steady.", "url": "https://www.thestar.com.my/business/business-news/2021/05/05/hong-kong-renters-market-as-prices-drop-on-expat-moves", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/05/1137933.jpg", "publishedAt": "2021-05-05T03:56:00Z", "content": "HONG KONG: Theres rarely been a better time to be apartment hunting in Hong Kong than right now.\r\nRents in one of the worlds most expensive real estate markets dropped to HK$33.60 ($4.33) per square … [+2468 chars]"}, {"source": {"id": null, "name": "Www.you.co"}, "author": null, "title": "Singapore-Hong Kong travel bubble: The real cost of travelling to Hong Kong - AsiaOne", "description": "With the Singapore-Hong Kong Travel Bubble, travelling will soon be within reach. But how much does it really cost to go on a week-long vacation in Hong Kong? We've added it all up for you, so you can make that decision yourself. A new date has been set for t…", "url": "https://www.you.co/sg/blog/singapore-hongkong-travel-bubble-real-cost/", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210505_Hongkong_unsplash.jpg?h=0429cc9e&itok=3Lww_vh2", "publishedAt": "2021-05-05T02:26:04Z", "content": "With the Singapore-Hong Kong Travel Bubble, travelling will soon be within reach. But how much does it really cost to go on a week-long vacation in Hong Kong? We've added it all up for you, so you ca… [+5017 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Who's the daddy? J-pop star Ayumi Hamasaki gives birth to second child - AsiaOne", "description": "TOKYO - Japanese singer Ayumi Hamasaki is now a mother of two. She announced last weekend that she has given birth to her second child. The queen of J-pop announced on her official website on Saturday night (May 1) that she has \"added an important family memb…", "url": "https://www.asiaone.com/entertainment/whos-daddy-j-pop-star-ayumi-hamasaki-gives-birth-second-child", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210504_ayumi_ig.jpg?h=a8a6ca33&itok=LSr1WLC2", "publishedAt": "2021-05-04T09:20:00Z", "content": "TOKYO - Japanese singer Ayumi Hamasaki is now a mother of two. She announced last weekend that she has given birth to her second child.\r\nThe queen of J-pop announced on her official website on Saturd… [+1471 chars]"}]}