{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Abs-cbn.com"}, "author": "ABS-CBN News and Kyodo News", "title": "Locsin to raise equitable access to COVID-19 vaccines, S. China Sea issue at ASEAN meeting - ABS-CBN News", "description": "The Philippines will bring up the issues of equitable access to COVID-19 vaccines and the South China Sea, among others, when foreign ministers of the Association of Southeast Asian Nations meet virtually for five days beginning Monday, its foreign ministry s…", "url": "https://news.abs-cbn.com/news/08/01/21/locsin-to-raise-equitable-access-to-covid-19-vaccines-s-china-sea-issue-at-asean-meeting", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2019/afp/07/09/20190709-teodoro-locsin-afp.jpg", "publishedAt": "2021-08-01T07:42:00Z", "content": "MANILA - The Philippines will bring up the issues of equitable access to COVID-19 vaccines and the South China Sea, among others, when foreign ministers of the Association of Southeast Asian Nations … [+3653 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Cambodia to mix vaccines as booster shots to fight COVID - The Star Online", "description": "PHNOM PENH (Reuters) -     Cambodia will begin offering a booster shot against Covid-19, switching between the AstraZeneca and Chinese COVID-19 vaccines  in an effort to fight the spread of the coronavirus in the Southeast Asian country.", "url": "https://www.thestar.com.my/news/world/2021/08/01/cambodia-to-mix-vaccines-as-booster-shots-to-fight-covid", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/08/01/1240697.jpg", "publishedAt": "2021-08-01T07:15:00Z", "content": "PHNOM PENH (Reuters) - Cambodia will begin offering a booster shot against Covid-19, switching between the AstraZeneca and Chinese COVID-19 vaccines in an effort to fight the spread of the coronaviru… [+1562 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Asia sees record Covid-19 surge, Delta variant spurs nations to reconsider curbs - Hindustan Times", "description": "In view of a record surge in Covid-19 cases, driven by the Delta variant, Asian countries are now imposing strict restrictions of movement in several major cities and provinces. | World News", "url": "https://www.hindustantimes.com/world-news/asia-sees-record-covid-19-surge-delta-variant-spurs-nations-to-reconsider-curbs-101627794613137.html", "urlToImage": "https://images.hindustantimes.com/img/2021/08/01/1600x900/2021-07-31T143521Z_957407959_RC2IVO9KCXF5_RTRMADP_3_HEALTH-CORONAVIRUS-THAILAND-MORGUE_1627796961573_1627797004014.JPG", "publishedAt": "2021-08-01T05:53:53Z", "content": "Coronavirus disease (Covid-19) cases are once again surging in Asia, with countries such as Thailand and Malaysia clocking a record number of infections. The city of Tokyo in Japan, where the 2020 Su… [+2893 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Asian nations impose stricter COVID-19 restrictions due to D... - MENAFN.COM", "description": "July 31 (Reuters) – Asian countries from Australia to Japan and the Philippines announced tighter COVID-19 restrictions on Friday, as they bat", "url": "https://menafn.com/1102546359/Asian-nations-impose-stricter-COVID-19-restrictions-due-to-Delta-outbreaks", "urlToImage": "https://menafn.com/updates/pr/2021-07/31/N_b8e1fimage_story.jpg", "publishedAt": "2021-07-31T08:08:21Z", "content": "(MENAFN - NewsIn.Asia) \r\nJuly 31 (Reuters) – Asian countries from Australia to Japan and the Philippines announced tighter COVID-19 restrictions on Friday, as they battle worsening coronavirus outbre… [+4030 chars]"}]}