{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "JON VIKTOR D. CABUENAS, GMA Integrated News", "title": "Marcos, First Lady join leaders at APEC Gala Dinner - GMA News Online", "description": "BANGKOK &mdash; President Ferdinand &ldquo;Bongbong&rdquo; Marcos Jr. and the First Lady Marie Louise &ldquo;Liza&rdquo; Araneta-Marcos attended a gala dinner as part of the events of this year&rsquo;s Asia Pacific Economic Cooperation (APEC) Leaders&rsquo;s …", "url": "https://www.gmanetwork.com/news/topstories/nation/851825/marcos-first-lady-join-leaders-at-apec-gala-dinner/story/", "urlToImage": "https://images.gmanews.tv/webpics/2022/11/Marcos_and_FL_at_Gala_dinner_2022_11_18_00_19_28.png", "publishedAt": "2022-11-17T16:21:39Z", "content": "BANGKOK — President Ferdinand “Bongbong” Marcos Jr. and the First Lady Marie Louise “Liza” Araneta-Marcos attended a gala dinner as part of the events of this year’s Asia Pacific Economic Cooperation… [+849 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "Tata Group plans to merge carriers under Air India, scrap Vistara brand - Moneycontrol", "description": "India’s largest conglomerate is considering scrapping the Vistara brand, which is Singapore Airlines Ltd’s local affiliate in the South Asian nation; Singapore Airlines is evaluating the size of the stake it should take in the combined entity.", "url": "https://www.moneycontrol.com/news/business/tata-group-plans-to-merge-carriers-under-air-india-scrap-vistara-brand-9556351.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/10/Air-India-2-770x433.jpg", "publishedAt": "2022-11-17T15:35:36Z", "content": "Tata Group is considering a plan to integrate its four airline brands under Air India Ltd., people with knowledge of the matter said, as the sprawling company prepares to rebuild its faltering aviati… [+1945 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Tanmay Kadam", "title": "Russia Says ‘World’s Best’ Ka-52 Choppers Are ‘Chopping’ Ukrainian Defenses; British Reports Says The Opposite - EurAsian Times", "description": "Russia published the footage of the Ka-52 and Mi-24 combat helicopters operating as part of Russia's ongoing military operation in Ukraine.", "url": "https://eurasiantimes.com/russia-says-worlds-best-ka-52-choppers-are-chopping-ukrainian/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2021/11/Kamov-Ka-52M-e1638204072256.jpg", "publishedAt": "2022-11-17T13:44:41Z", "content": "Russia’s Defense Ministry recently published the footage of the Ka-52 and Mi-24 combat helicopters operating as part of Russia’s ongoing military operation in Ukraine.\r\nThe video was shared on Novemb… [+7451 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "‘Very Impressive’: NASAMS Thwarting Russian Attacks With 100% Precision; Expert Says Deployed To Defend Leadership - EurAsian Times", "description": "NASAMS (National Advanced Surface-to-Air Missile System) had a 100% success rate in Ukraine thwarting Russian attacks, US Defense Secretary Lloyd Austin said on Wednesday. Austin also said that the NASAMS that the US had sent to Ukraine are fully operational,…", "url": "https://eurasiantimes.com/very-impressive-nasams-thwarting-russian-targets-with-100-precision/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/08/MISSILE-RUSSIA-1.png", "publishedAt": "2022-11-17T09:50:07Z", "content": "NASAMS (National Advanced Surface-to-Air Missile System) had a 100% success rate in Ukraine thwarting Russian attacks, US Defense Secretary Lloyd Austin said on Wednesday.\r\nAustin also said that the … [+7772 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Mad respect for you': Ice cream boss explains why his cafe isn't halal-certified, wins netizens' approval - AsiaOne", "description": "Heartbreak Melts has been making quite a name for itself of late. With rave reviews aplenty, the ice cream cafe, located in Ang Mo Kio, has also been receiving queries from the general public. A question that seems to continuously pop up, particularly from Mu…", "url": "https://www.asiaone.com/lifestyle/mad-respect-you-ice-cream-boss-explains-why-his-cafe-heartbreak-melts-isnt-halal-certified-wins-netizens", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/171122_heartbreakmelts_HL.jpg?h=0429cc9e&itok=-ws2mZ4V", "publishedAt": "2022-11-17T08:40:00Z", "content": "Heartbreak Melts has been making quite a name for itself of late.\r\nWith rave reviews aplenty, the ice cream cafe, located in Ang Mo Kio, has also been receiving queries from the general public.\r\nA qu… [+2686 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Sheila Sim drinks before movie Geylang's kiss scene 'to boost her courage' - AsiaOne", "description": "Even for a seasoned actress like Sheila Sim, a little bit of liquid courage can help. In a recent interview with Lianhe Zaobao, local director Boi Kwong revealed that Sheila Sim had to down some alcohol before she could gather enough nerves to film her first …", "url": "https://www.asiaone.com/entertainment/sheila-sim-drinks-movie-geylangs-kiss-scene-boost-her-courage", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/171122_sheilasim_insta.jpg?h=a3d24b08&itok=cUqL1skw", "publishedAt": "2022-11-17T07:18:00Z", "content": "Even for a seasoned actress like Sheila Sim, a little bit of liquid courage can help.\r\nIn a recent interview with Lianhe Zaobao, local director Boi Kwong revealed that Sheila Sim had to down some alc… [+1805 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'At least let me hug an oppa': Hong Huifang added unscripted scene of her embracing Yeo Jin-goo in Ajoomma - AsiaOne", "description": "Perfectly reasonable, or irresistible? It seems Ajoomma actress Hong Huifang was too enthralled with co-star Yeo Jin-goo during one of their scenes together. The film's director He Shuming dropped this juicy piece of information during a press conference with…", "url": "https://www.asiaone.com/entertainment/least-let-me-hug-oppa-hong-huifang-added-unscripted-scene-her-embracing-yeo-jin-goo-ajoomma", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/honghuifangYeojingoo.jpeg?h=4a5c7968&itok=Wza9JXHc", "publishedAt": "2022-11-17T05:53:00Z", "content": "Perfectly reasonable, or irresistible?\r\nIt seems Ajoomma actress Hong Huifang was too enthralled with co-star Yeo Jin-goo during one of their scenes together.\r\nThe film's director He Shuming dropped … [+2105 chars]"}]}