{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "Human rights disaster looms in Myanmar – UN - The Manila Times", "description": "NAYPYIDAW: The United Nations said it feared an even greater human rights catastrophe in Myanmar amid reports of thousands of troops massing in the north of the Southeast Asian...", "url": "https://www.manilatimes.net/2021/10/24/news/world/human-rights-disaster-looms-in-myanmar-un/1819506", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/10/23/22200.jpg", "publishedAt": "2021-10-23T15:30:39Z", "content": "NAYPYIDAW: The United Nations said it feared an even greater human rights catastrophe in Myanmar amid reports of thousands of troops massing in the north of the Southeast Asian country, which has bee… [+2025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Singapore removes India, 5 other South Asian nations from travel restriction list - The Indian Express", "description": "All travellers with a 14-day travel history to Bangladesh, India, Myanmar, Nepal, Pakistan and Sri Lanka will be allowed to enter or transit through Singapore from Wednesday, the health ministry said.", "url": "https://indianexpress.com/article/world/singapore-india-travel-restriction-list-7586686/", "urlToImage": "https://images.indianexpress.com/2021/10/singapore-1.jpg", "publishedAt": "2021-10-23T11:53:20Z", "content": "Singapore on Saturday announced the removal of India and five other South Asian countries from its travel restriction list as the island-state continues to adjust border measures in response to the g… [+1171 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dengue cluster in your neighbourhood? Here's what you need to know and do - AsiaOne", "description": "In 2020, Singapore had a “historic” dengue outbreak, with a total of 35,315 reported cases. Then in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aedes aegypti breed have grown by 30 per cent in April, compar…", "url": "https://www.asiaone.com/lifestyle/dengue-cluster-your-neighbourhood-heres-what-you-need-know-and-do", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/201021_mosquitodengue_unsplash.jpg?h=4c9e7946&itok=AleDwB-J", "publishedAt": "2021-10-23T11:30:00Z", "content": "In 2020, Singapore had a historic dengue outbreak, with a total of 35,315 reported cases.\r\nThen in June 2021, the National Environment Agency (NEA) warned that mosquito populations of the dreaded Aed… [+4850 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "State Of Rest wins Cox Plate ahead of Anamoe following dismissed protest at Moonee Valley - ABC News", "description": "Irish horse State Of Rest claims victory in Australasia's premier weight-for-age race after a protest — lodged by second-placed Anamoe's jockey Craig Williams — is dismissed at Moonee Valley.", "url": "https://www.abc.net.au/news/2021-10-23/state-of-rest-wins-cox-plate-ahead-of-anamoe/100563168", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2d494f7c8d8eaba185395ee4aa516cba?impolicy=wcms_crop_resize&cropH=1677&cropW=2982&xPos=0&yPos=50&width=862&height=485", "publishedAt": "2021-10-23T08:15:00Z", "content": "Irish horse State Of Rest has won a dramatic Cox Plate ahead of Anamoe at Moonee Valley, after a protest was dismissed by stewards.\r\n<ul><li>Anamoe's jockey Craig Williams claimed there was interfere… [+2707 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Filipino nurses exodus: Hailed as heroes, treated like peons - The Star Online", "description": "MANILA (Philippine Daily Inquirer/Asia News Network): National Nurses Week recently gained more relevance as more Filipino nurses resigned and searched for greener pastures overseas out of frustration at being showered with praises but denied better pay and b…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/22/filipino-nurses-exodus-hailed-as-heroes-treated-like-peons", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/22/1341512.jpg", "publishedAt": "2021-10-22T12:19:00Z", "content": "MANILA (Philippine Daily Inquirer/Asia News Network): National Nurses Week recently gained more relevance as more Filipino nurses resigned and searched for greener pastures overseas out of frustratio… [+8341 chars]"}]}