{"articles": [{"author": null, "content": "The father of a man jailed for assaulting his mother over a span of three years has said he was unaware of the abuse that occurred.\r\nResponding to queries from Lianhe Wanbao last Tuesday (March 23) e… [+2587 chars]", "description": "The father of a man jailed for assaulting his mother over a span of three years has said he was unaware of the abuse that occurred. Responding to queries from Lianhe Wanbao last Tuesday (March 23) evening, the 69-year-old man said he had not noticed anything …", "publishedAt": "2021-03-27T04:55:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "'I would have stopped it': Elderly man says he didn't know son was abusing wife - AsiaOne", "url": "https://www.asiaone.com/singapore/i-would-have-stopped-it-elderly-man-says-he-didnt-know-son-was-abusing-wife", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20212403_news_son.jpeg?h=e5734912&itok=9YWa8LNJ"}, {"author": "Ashman Adam", "content": "AirAsia co-founder and group CEO Tan Sri Tony Fernandes that in the midst of the pandemic, AirAsia has accelerated its pivot to the digital space in the past year revealing that the main thrust of th… [+3446 chars]", "description": "KUALA LUMPUR, March 27 ― AirAsia co-founder and group CEO Tan Sri Tony Fernandes today revealed that the low-cost airline would be venturing into the ride-hailing market next, after dipping its toes into the food delivery service since the start of the Covid-…", "publishedAt": "2021-03-27T04:08:17Z", "source": {"id": null, "name": "Malay Mail"}, "title": "Wanting to be ‘best delivery guy’, Fernandes says AirAsia set to venture into ride-hailing - Malay Mail", "url": "https://www.malaymail.com/news/malaysia/2021/03/27/wanting-to-be-best-delivery-guy-fernandes-says-airasia-set-to-venture-into/1961486", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2019/2019-08/airbus_airasia_3008_(2)-seo.jpg"}, {"author": null, "content": "If Wilson Lam could do it over again, he would not take the Covid-19 vaccine. The 26-year-old Hong Kong resident woke up in hospital after fainting outside a government-run centre where he was inocul… [+5852 chars]", "description": "If Wilson Lam could do it over again, he would not take the Covid-19 vaccine. The 26-year-old Hong Kong resident woke up in hospital after fainting outside a government-run centre where he was inoculated on Wednesday. He was shocked to find much of his face p…", "publishedAt": "2021-03-27T02:11:25Z", "source": {"id": null, "name": "AsiaOne"}, "title": "26-year-old Hong Kong man describes ordeal of facial paralysis after receiving Covid-19 vaccine - AsiaOne", "url": "https://www.asiaone.com/asia/26-year-old-hong-kong-man-describes-ordeal-facial-paralysis-after-receiving-covid-19-vaccine", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/210327_hkman_sinovac.jpg?h=2e181f1f&itok=Sq4t89Kp"}, {"author": null, "content": "With Singapore's hawker culture officially added to the Unesco Representative List of the Intangible Cultural Heritage of Humanity, AsiaOne takes a look at young hawkers who snub the corporate rat ra… [+11359 chars]", "description": "With Singapore's hawker culture officially added to the Unesco Representative List of the Intangible Cultural Heritage of Humanity, AsiaOne takes a look at young hawkers who snub the corporate rat race to slave over stoves instead. We could be wrong, but Mad …", "publishedAt": "2021-03-27T01:00:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "You can claim a free coffee at this hip hawker stall run by a lawyer. But here's why you probably shouldn't - AsiaOne", "url": "https://www.asiaone.com/lifestyle/you-can-claim-free-coffee-hip-hawker-stall-run-lawyer-heres-why-you-probably-shouldnt", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/MadelineChan_Mad-Roaster-Amoy-Street1.jpg?h=e83a2a0b&itok=Ckif-Zhz"}], "message": "Successful api call", "number_of_news": 4, "status": 200, "topic": "asia"}