{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Unctad.org"}, "author": null, "title": "Asia-Pacific partnership creates new 'centre of gravity' for global trade - UNCTAD", "description": "A new Asia-Pacific free trade agreement set to enter into force on 1 January 2022 will create the world’s largest trading bloc by economic size, according to an UNCTAD study published on 15 December.\n\nThe Regional Comprehensive Economic Partnership (RCEP) inc…", "url": "https://unctad.org/news/asia-pacific-partnership-creates-new-centre-gravity-global-trade", "urlToImage": null, "publishedAt": "2021-12-15T05:51:04Z", "content": "Container terminal in the Port of Osaka, Japan. © MirkoA new Asia-Pacific free trade agreement set to enter into force on 1 January 2022 will create the worlds largest trading bloc by economic size, … [+5083 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Please desist for your safety': NYP student does Helikopter spin on escalator for TikTok - AsiaOne", "description": "A video of a Nanyang Polytechnic (NYP) student having a bit of fun on top of a moving escalator has gone viral on TikTok — to the point that his institution has noticed this six-second clip. NYP wasn't pleased with what they saw and left a few firm replies in…", "url": "https://www.asiaone.com/singapore/please-desist-your-safety-nyp-student-does-helikopter-spin-escalator-tiktok", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/151221_helikopter_tiktokHL.jpg?h=0429cc9e&itok=5WvJi9qj", "publishedAt": "2021-12-15T04:47:00Z", "content": "A video of a Nanyang Polytechnic (NYP) student having a bit of fun on top of a moving escalator has gone viral on TikTok  to the point that his institution has noticed this six-second clip. \r\nNYP was… [+2608 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "New species of bacteria named after Singapore - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): An unexpected discovery by a team of doctors analysing skin and wound samples has led to a new species of bacteria being identified and named after Singapore.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/12/14/new-species-of-bacteria-named-after-singapore", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/14/1405856.jpg", "publishedAt": "2021-12-14T07:46:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): An unexpected discovery by a team of doctors analysing skin and wound samples has led to a new species of bacteria being identified and named after Si… [+2501 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Can chope table with tissue? Fann Wong and Li Nanxing talk about their hawker centre habits - AsiaOne", "description": "Much has been said about our common love for Singapore's hawker centres and local food. But the perennial question for some of us is this: is it okay to chope a table with tissue paper (or the equivalent)? We asked local celebrities Fann Wong and Li Nanxing t…", "url": "https://www.asiaone.com/entertainment/can-chope-table-tissue-fann-wong-li-nanxing-hawker-centre-habits-our-dining-hall-song-unesco-anniversary", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/20211213_hawkermain.jpg?h=2db1dc2b&itok=i7d6Z72n", "publishedAt": "2021-12-14T00:00:00Z", "content": "Much has been said about our common love for Singapore's hawker centres and local food. But the perennial question for some of us is this: is it okay to chope a table with tissue paper (or the equiva… [+3812 chars]"}]}