{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "A guide to breast cancer in younger women - Channel NewsAsia", "description": "At the prime of their lives and the start of their careers, breast cancer patients in their 20s and 30s may find it harder to cope with issues of self image, fertility and finances. This breast cancer awareness month, CNA Women unpacks the issues close to the…", "url": "https://cnalifestyle.channelnewsasia.com/women/breast-cancer-young-women-mastectomy-chemotherapy-330081", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--JEK5qoUl--/c_crop,h_2160,w_3840,x_0,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/09/27/istock-1417898981.jpg?itok=XvT4ZL66", "publishedAt": "2022-10-02T22:54:00Z", "content": "FAMILY PLANNING CONCERNS\r\nCancer throws a wrench in family planning for young women as well. Some treatment such as chemotherapy may temporarily damage the ovaries and cause immediate or premature ov… [+1151 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I can't stop peeing! Is this pregnancy incontinence? - AsiaOne", "description": "Pregnancy incontinence is a problem many women face but often do not talk about. To some, it's embarrassing to have to deal with this when they are pregnant. It can be a huge concern as well. Pregnancy incontinence affects millions of women who have recently …", "url": "https://www.asiaone.com/lifestyle/i-cant-stop-peeing-pregnancy-incontinence", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/20223009_pregnant_pixabay.png?h=0429cc9e&itok=-Ry2TAVg", "publishedAt": "2022-10-02T12:00:00Z", "content": "Pregnancy incontinence is a problem many women face but often do not talk about. To some, it's embarrassing to have to deal with this when they are pregnant. It can be a huge concern as well.\r\nPregna… [+7259 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lenin Ndebele", "title": "Mosquito vector spreads to 5 African countries - News24", "description": "The Annopheles stephensi mosquito species, considered to be an Asian and Arabian Peninsula malaria vector, has spread to at least five African countries in the past decade, according to the World Health Organisation.", "url": "https://www.news24.com/news24/southafrica/news/mosquito-vector-spreads-to-5-african-countries-20221002", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10788/aa0225e509094d0c82c9cc0ca846ee18.jpg", "publishedAt": "2022-10-02T09:35:15Z", "content": "<ul><li>A mosquito species considered to be an Asian and Arabian Peninsula malaria vector, has spread to at least five African countries in the past decade.</li><li>It could pose a significant threat… [+2382 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "RIP Jordans, Gucci: Singapore F1 concert revellers' expensive footwear ruined by mud at Padang - AsiaOne", "description": "Here's a piece of life advice your mum might not have told you: do not wear white shoes on a rainy day, and especially not when it's at the Formula One (F1) outdoor concert. Despite torrential rain pouring down on Saturday (Oct 1) — the second day of the thre…", "url": "https://www.asiaone.com/singapore/rip-jordans-gucci-singapore-f1-concert-revellers-expensive-footwear-ruined-mud-padang", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/f1ripshoesmud.jpeg?h=0429cc9e&itok=t7CbPXyr", "publishedAt": "2022-10-02T07:35:00Z", "content": "Here's a piece of life advice your mum might not have told you: do not wear white shoes on a rainy day, and especially not when it's at the Formula One (F1) outdoor concert.\r\nDespite torrential rain … [+1938 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Meet the Singaporean crafter foodie behind With Autumn's popular dyeing, tufting and punch needle workshops - Channel NewsAsia", "description": "In this week's instalment of Creative Capital, we talk to 36-year-old Singaporean Autumn Brown Yunshan who runs a successful textile workshop and retail business while teaching at NAFA and creating culinary content for a local food business.", "url": "https://cnalifestyle.channelnewsasia.com/living/creative-capital-autumn-brown-yunshan-crafter-330061", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--WTG16kj7--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/09/29/HERO-Autumn-2.png?itok=YzaAlecD", "publishedAt": "2022-10-01T22:06:00Z", "content": "I cannot quite put a finger on a specific type of customers we attract but they are not wide-ranging either. Instead of grouping my customers by age, gender or lifestyle, I see two main groups: Creat… [+1919 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I'm in hot water right now': Cooling measures leave some home owners in difficult spot - AsiaOne", "description": "SINGAPORE - Three weeks ago, estate officer Patrick Yew sold his one-bedroom condominium unit with the intention of buying a five-room Housing Board resale flat to live in with his ageing parents. But overnight, his plans have come crashing down. A fresh roun…", "url": "https://www.asiaone.com/singapore/im-hot-water-right-now-cooling-measures-leave-some-home-owners-difficult-spot", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/prop_0110_ST.jpg?h=0429cc9e&itok=NbV0HZiG", "publishedAt": "2022-10-01T00:15:23Z", "content": "SINGAPORE - Three weeks ago, estate officer Patrick Yew sold his one-bedroom condominium unit with the intention of buying a five-room Housing Board resale flat to live in with his ageing parents.\r\nB… [+4185 chars]"}]}