{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Razorpay raises $160 million, valuation triples to $3 billion in six months - Moneycontrol", "description": "Razorpay will use the funding to take its digital payments offering to South East Asia, make acquisitions and build out its neo-banking platform.", "url": "https://www.moneycontrol.com/news/business/razorpay-raises-160-million-valuation-triples-to-3-billion-in-six-months-6785271.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/Harshil-Mathur-CEO-and-Co-Founder-and-Shashank-Kumar-CTO-and-Co-Founder-770x433.jpg", "publishedAt": "2021-04-19T01:48:20Z", "content": "Digital payments and business banking platform Razorpay said it has raised $160 million in its Series E round of funding, at a valuation of $3 billion, barely six months after it raised funding that … [+2641 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Star Awards 2021: Empty-handed but it's ok because Felicia Chin has mee pok on her mind - AsiaOne", "description": "It was a night of anticipation for local actress Felicia Chin as the camera kept cutting to her several times during key moments of Star Awards 2021. First, it happened during the announcement of Best Actress and then, during the reveal of the Top 10 Most Pop…", "url": "https://www.asiaone.com/entertainment/star-awards-2021-empty-handed-its-ok-because-felicia-chin-has-mee-pok-her-mind", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210418-SAfelicia.jpg?h=18dbdf72&itok=9x31sJWE", "publishedAt": "2021-04-19T01:15:00Z", "content": "It was a night of anticipation for local actress Felicia Chin as the camera kept cutting to her several times during key moments of Star Awards 2021.\r\nFirst, it happened during the announcement of Be… [+2758 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Expat returns from India and tested positive for COVID-19 after serving 21 days of SHN - The Online Citizen Asia", "description": "The Online Citizen Asia Expat returns from India and tested positive for COVID-19 after serving 21 days of SHN Current Affairs", "url": "https://www.theonlinecitizen.com/2021/04/19/expat-returns-from-india-and-tested-positive-for-covid-19-after-serving-21-days-of-shn/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/01/India-Covid.jpg", "publishedAt": "2021-04-19T00:53:36Z", "content": "Last Friday, the Ministry of Health (MOH) revealed that an Indian expat had contracted COVID-19 after returning from India, despite having negative PCR tests and not showing any symptoms while he was… [+3883 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "She went from singing at pubs to software engineer, thanks to Covid-19 pandemic - AsiaOne", "description": "In this series, AsiaOne speaks to individuals who find themselves changing careers and steering their lives in a new direction, whether by choice or circumstance. Deborah Jean Lee was forced to give up a career she took five years to build, all thanks to the …", "url": "https://www.asiaone.com/lifestyle/she-went-singing-pubs-software-engineer-thanks-covid-19-pandemic", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/deborahjeanleemain.jpeg?h=febffb41&itok=syfLzmwL", "publishedAt": "2021-04-18T01:51:00Z", "content": "In this series, AsiaOne speaks to individuals who find themselves changing careers and steering their lives in a new direction, whether by choice or circumstance. \r\nDeborah Jean Lee was forced to giv… [+6257 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Despite losing her sight and hearing, she's optimistic and doesn't admit defeat - AsiaOne", "description": "Tan Siew Ling has an uncanny ability to remember dates, reeling off with conviction days and months of events that she considers important. She reckons it is because she is blind. Referring to books or notes to jolt the memory is not an easy option. \"I cannot…", "url": "https://www.asiaone.com/singapore/despite-losing-her-sight-and-hearing-shes-optimistic-and-doesnt-admit-defeat", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_668.jpg?h=ec2e39d7&itok=lE1RrcE_", "publishedAt": "2021-04-18T01:24:00Z", "content": "Tan Siew Ling has an uncanny ability to remember dates, reeling off with conviction days and months of events that she considers important.\r\nShe reckons it is because she is blind. Referring to books… [+10484 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "39 new cases of COVID-19 infection in S'pore; 4 cases in the community - The Online Citizen Asia", "description": "The Online Citizen Asia 39 new cases of COVID-19 infection in S’pore; 4 cases in the community Health", "url": "https://www.theonlinecitizen.com/2021/04/17/39-new-cases-of-covid-19-infection-in-spore-4-cases-in-the-community/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/12/NCID-Singapore-7.png", "publishedAt": "2021-04-17T10:14:21Z", "content": "As of Saturday noon (17 Apr), the Ministry of Health (MOH) has preliminarily confirmed an additional 39 cases of COVID-19 infection in Singapore.\r\nThis brings the total number of infection cases to 6… [+1067 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Myanmar junta chief to attend ASEAN summit in first foreign trip since coup - The Star Online", "description": "(Reuters) -Myanmar junta chief Min Aung Hlaing will attend an Association of Southeast Asian Nations (ASEAN) summit in Indonesia on April 24, Thailand said on Saturday, for his first known foreign trip since he seized power on Feb. 1.", "url": "https://www.thestar.com.my/news/world/2021/04/17/myanmar-junta-chief-to-attend-asean-summit-on-first-foreign-trip-since-coup", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/17/1117398.JPG", "publishedAt": "2021-04-17T08:11:00Z", "content": "(Reuters) -Myanmar junta chief Min Aung Hlaing will attend an Association of Southeast Asian Nations (ASEAN) summit in Indonesia on April 24, Thailand said on Saturday, for his first known foreign tr… [+4291 chars]"}]}