{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "ign", "name": "IGN"}, "author": "Adam Bankhurst", "title": "New World Server Transfers Have Been Delayed, No Transfers Between Regions Allowed - IGN SOUTH EAST ASIA", "description": "Every account will get a free server transfer token when it's ready.", "url": "https://sea.ign.com/new-world-amazon/177525/news/new-world-server-transfers-have-been-delayed-no-transfers-between-regions-allowed", "urlToImage": "https://sm.ign.com/t/ign_ap/news/n/new-world-/new-world-server-transfers-have-been-delayed-no-transfers-be_c432.1200.jpg", "publishedAt": "2021-10-11T05:00:16Z", "content": "Amazon has delayed the server transfer feature in New World due to some \"edge cases where the transfer experience does not meet our standards for its release.\" Furthermore, it has said that there wil… [+2042 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'It just feels like flu': Doctor shares home recovery experience before Covid-19 protocol changes announced - AsiaOne", "description": "SINGAPORE - A doctor has shared his Covid-19 home recovery experience on social media, hoping to destigmatise the disease as a \"life-threatening\" one. Dr Lai Kah Weng, a consultant orthopaedic surgeon from Healthway Medical's Island Orthopaedic Consultants, t…", "url": "https://www.asiaone.com/singapore/it-just-feels-flu-doctor-shares-home-recovery-experience-covid-19-protocol-changes", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/20211011_dr_fb.jpg?h=83ba74cd&itok=7PlPmXLa", "publishedAt": "2021-10-11T02:36:59Z", "content": "SINGAPORE - A doctor has shared his Covid-19 home recovery experience on social media, hoping to destigmatise the disease as a \"life-threatening\" one.\r\nDr Lai Kah Weng, a consultant orthopaedic surge… [+4231 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "US stock futures lead Asia lower, dollar gains on yen - Reuters", "description": "Asian shares slipped on Monday as global inflation angst favoured commodities as a hedge over U.S. equities, while rising U.S. bond yields lifted the dollar to two-and-a-half year peaks against the Japanese yen", "url": "https://www.reuters.com/business/global-markets-wrapup-1-pix-2021-10-11/", "urlToImage": "https://www.reuters.com/resizer/NbhJ1nsi925XCrkj2JtUbxUOGe4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/7XVBKV4LQVLZ7ED5Z4MEDAMWSM.jpg", "publishedAt": "2021-10-11T02:07:00Z", "content": "People wearing protective masks, amid the coronavirus disease (COVID-19) outbreak, are reflected on an electronic board displaying Japan's stock prices outside a brokerage in Tokyo, Japan, October 5,… [+3356 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Westcott, CNN", "title": "Australia's biggest city is starting to live with Covid. Asia will be watching - CNN", "description": "For more than a year and a half, Australia has shut itself off from the world, closing borders and imposing strict lockdowns to stamp out Covid-19 outbreaks in a bid to eliminate the virus entirely. But on Monday its largest city is taking the first tentative…", "url": "https://www.cnn.com/2021/10/10/australia/australia-sydney-lockdown-vaccinations-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211010211858-03-sydney-reopen-101121-super-tease.jpg", "publishedAt": "2021-10-11T01:56:00Z", "content": "(CNN)Melanie McTighe and her 92-year-old father live in the same city, but they haven't been able to see each other for almost four months.\r\nThat changed on Monday as Sydney, Australia's largest city… [+9097 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "How Evergrande's rags-to-riches founder is trying to save his empire - The Edge Markets MY", "description": "(Oct 11): Four years after vying with Jack Ma for the title of Asia’s richest man, Evergrande chairman Hui Ka Yan’s fortune is plunging and his sprawling real estate empire is on the verge of collapse.It’s a stunning reversal for a man who fought his way from…", "url": "https://www.theedgemarkets.com/article/how-evergrandes-ragstoriches-founder-trying-save-his-empire", "urlToImage": "https://assets.theedgemarkets.com/china-evergrande-centre_20211011084944_bloomberg.jpg?otA6PDRKIUKucWrzd9oKOWh_FlqOHn2s", "publishedAt": "2021-10-10T22:37:23Z", "content": "(Oct 11): Four years after vying with Jack Ma for the title of Asias richest man, Evergrande chairman Hui Ka Yans fortune is plunging and his sprawling real estate empire is on the verge of collapse.… [+9864 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "No entry to malls, no dine-in at hawker centres - what are the new rules for the unvaccinated? - AsiaOne", "description": "SINGAPORE - The Ministry of Health (MOH) announced on Saturday (Oct 9) that vaccination-differentiated safe management measures will be expanded. These measures, which are currently in force at places like food and beverage (F&B) establishments, will be furth…", "url": "https://www.asiaone.com/singapore/no-entry-malls-no-dine-hawker-centres-what-are-new-rules-unvaccinated", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/image_403.jpg?h=18ef716e&itok=mIBDS2yH", "publishedAt": "2021-10-10T03:19:00Z", "content": "SINGAPORE - The Ministry of Health (MOH) announced on Saturday (Oct 9) that vaccination-differentiated safe management measures will be expanded.\r\nThese measures, which are currently in force at plac… [+2873 chars]"}]}