{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Guest Author", "title": "Low Yield Blast Over Germany: US Is Increasing The Possibility Of Nuclear Retaliation By Russia – OPED By MiG Fighter Pilot - EurAsian Times", "description": "“Russia’s nuclear doctrine allows the use of such munitions if weapons of mass destruction are used against it or if the Russian state faces an existential threat from conventional weapons. We will certainly make use of all weapon systems available to us. Thi…", "url": "https://eurasiantimes.com/low-yield-nuclear-blast-over-germany-us-is-increasing-the-possibility/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2023/01/Nuclear-war-Russia-Ukraine-1.jpg", "publishedAt": "2023-01-29T17:13:59Z", "content": "“Russia’s nuclear doctrine allows the use of such munitions if weapons of mass destruction are used against it or if the Russian state faces an existential threat from conventional weapons. We will c… [+4397 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Thailand's northern city Chiang Mai beats Davao and Singapore as safest city in South-East Asia - The Star Online", "description": "Chiang Mai in the North of Thailand was named South-East Asia’s safest city and the 32nd safest among 416 cities across the world.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2023/01/29/thailand039s-northern-city-chiang-mai-beats-davao-and-singapore-as-safest-city-in-south-east-asia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2023/01/29/1920240.jpg", "publishedAt": "2023-01-29T10:26:00Z", "content": "BANGKOK, Jan 29 (The Nation Thailand/ANN): Chiang Mai in the North of Thailand was named South-East Asias safest city and the 32nd safest among 416 cities across the world.\r\nAccording to the Numbeo w… [+856 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Is it the norm nowadays?' Diner charged 50 cents for milk in fish soup at Kopitiam food court, staff responds - AsiaOne", "description": "Being charged extra for takeaway containers isn't new, but what about for a regular ingredient in a dish? One bewildered customer recently highlighted they were charged 50 cents for the addition of evaporated milk to their bowl of fish soup. The experience wa…", "url": "https://www.asiaone.com/lifestyle/it-norm-nowadays-diner-charged-50-cents-milk-fish-soup-kopitiam-food-court-vivocity-staff-responds", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/receipt.jpeg?h=43f8d81d&itok=jeAEXmN-", "publishedAt": "2023-01-29T05:41:00Z", "content": "Being charged extra for takeaway containers isn't new, but what about for a regular ingredient in a dish?\r\nOne bewildered customer recently highlighted they were charged 50 cents for the addition of … [+3065 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'How can I see my child get hit and not do anything?' Police called in after maid and employer get into fight at home - AsiaOne", "description": "She had hired a maid to help care for her four children while she went to work. However, barely three months in, helper and employer got into a physical altercation at home, which was captured on CCTV cameras within the flat. The police were also called in. T…", "url": "https://www.asiaone.com/singapore/how-can-i-see-my-child-get-hit-not-do-anything-police-called-after-maid-employer-fight-home", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/fightmain.jpeg?h=0429cc9e&itok=Ll-cdia7", "publishedAt": "2023-01-29T03:58:00Z", "content": "She had hired a maid to help care for her four children while she went to work. However, barely three months in, helper and employer got into a physical altercation at home, which was captured on CCT… [+2881 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Tanmay Kadam", "title": "Ukraine, Once The 3rd Biggest Nuclear Power With Over 1900 Warheads, Mocked By French Politician Over Nukes - EurAsian Times", "description": "Ukrainian President Volodymyr Zelenskyy thanked his Western partners on January 25 for pledging their battle tanks to Ukraine while at the same time asking them now to green-light the supply of fighter jets and long-range missiles. “I am grateful to all our a…", "url": "https://eurasiantimes.com/ukraine-once-the-3rd-biggest-nuclear-power-with-over-1900-warheads/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/08/A-nuclear-capable-Intercontinental-Ballistic-Missile-ICBM-in-an-underground-launch-silo.jpg", "publishedAt": "2023-01-29T03:49:17Z", "content": "Ukrainian President Volodymyr Zelenskyy thanked his Western partners on January 25 for pledging their battle tanks to Ukraine while at the same time asking them now to green-light the supply of fight… [+5887 chars]"}]}