{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "GMA News"}, "author": "TED CORDERO, GMA News", "title": "PAGCOR: POGO revenues down as some players fled to neighboring countries - GMA News Online", "description": "Revenues from Philippine Offshore Gaming Operators (POGOs) went down this year as a number of players have relocated to other countries in Southeast Asia, Philippine Amusement and Gaming Corp. (PAGCOR) Chairperson Andrea Domingo said Friday.", "url": "https://www.gmanetwork.com/news/money/economy/801138/pagcor-pogo-revenues-down-as-some-players-fled-to-neighboring-countries/story/", "urlToImage": "https://images.gmanews.tv/webpics/2018/03/PAGCOR-THUMB_2018_03_21_13_50_45.jpg", "publishedAt": "2021-08-27T13:27:22Z", "content": "Revenues from Philippine Offshore Gaming Operators (POGOs) went down this year as a number of players have relocated to other countries in Southeast Asia, Philippine Amusement and Gaming Corp. (PAGCO… [+1536 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Sorry lah, cannot send to your letterboxes': Ho Ching on free mask collection - AsiaOne", "description": "Even though we previously said don't kan cheong, mention free goodies to any Singaporean and it will surely cause a major stir. So much so that Ho Ching has chimed in on Facebook on Thursday (Aug 26) to remind \"kiasu Singapore\" that Temasek Foundation has ple…", "url": "https://www.asiaone.com/singapore/sorry-lah-cannot-send-your-letterboxes-ho-ching-free-mask-collection", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/270821_facemasks_ST.jpg?h=0429cc9e&itok=Us_Ms-gE", "publishedAt": "2021-08-27T07:59:00Z", "content": "Even though we previously said don't kan cheong, mention free goodies to any Singaporean and it will surely cause a major stir.\r\nSo much so that Ho Ching has chimed in on Facebook on Thursday (Aug 26… [+1450 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Child seen pooping openly at Bukit Panjang playground; mum says toddler was 'not feeling well' - AsiaOne", "description": "The sight of a woman letting her child defecate openly at a Bukit Panjang playground raised a stink among residents on Thursday evening (Aug 26). A Stomp contributor shared a photo of the incident which her friend witnessed at Block 140 Petir Road at around 6…", "url": "https://www.asiaone.com/singapore/child-seen-pooping-openly-bukit-panjang-playground-mum-says-toddler-was-not-feeling-well", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210827_child_stomp.jpg?h=0429cc9e&itok=xEr7Y_Y-", "publishedAt": "2021-08-27T07:47:32Z", "content": "The sight of a woman letting her child defecate openly at a Bukit Panjang playground raised a stink among residents on Thursday evening (Aug 26).\r\nA Stomp contributor shared a photo of the incident w… [+1609 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "PNVF to send three teams to Asian club tourney - Manila Bulletin", "description": "The Philippine Sports Commission (PSC) recently approved a 20-member national women’s team and according to Suzara, head coach Odjie Mamon and Brazilian consultant Jorge Edson Souza de Brito will pick four more players to form two teams of 12 players each.", "url": "https://mb.com.ph/2021/08/27/pnvf-to-send-three-teams-to-asian-club-tourney/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/08/received_1006276713524421-1.jpeg", "publishedAt": "2021-08-27T07:23:57Z", "content": "Two national teams will represent the country in the Asian Women’s Club Volleyball Championship Thailand is hosting in Nakhon Ratchasima from October 1 to 7, Philippine National Volleyball Federation… [+2598 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brie Stimson", "title": "Kamala Harris stops at Pearl Harbor on way back from Asia -- but avoids press questions - Fox News", "description": "Kamala Harris returned to the U.S. on Thursday, landing in Hawaii after her trip to Singapore and Vietnam. But the vice president ignored reporters’ questions – whether about Afghanistan or other topics – as she got off Air Force Two for a stop at Joint Base …", "url": "https://www.foxnews.com/politics/kamala-harris-stops-at-pearl-harbor-on-way-back-from-asia-but-avoids-press-questions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21239097224960.jpg", "publishedAt": "2021-08-27T05:33:13Z", "content": "Kamala Harris returned to the U.S. on Thursday, landing in Hawaii after her trip to Singapore and Vietnam.\r\nBut the vice president ignored reporters questions whether about Afghanistan or other topic… [+3256 chars]"}]}