{"articles": [{"author": "Faizal Yahya", "content": "SINGAPORE: We will fly again. It just might happen much later for most of us, in 2024 and beyond.\r\nDespite the roll out of vaccines and the opening of economies, the patchy global coverage in vaccina… [+7087 chars]", "description": "AirAsia and Singapore Airlines are already blazing a trail on how to do just that while flying remains in cold storage for most travellers, says Institute of Policy Studies’ Faizal Yahya.", "publishedAt": "2021-04-03T22:06:23Z", "source": {"id": null, "name": "CNA"}, "title": "Commentary: Airlines have little choice but to not be airlines for a few years - CNA", "url": "https://www.channelnewsasia.com/news/commentary/airasia-food-delivery-airlines-scoot-sia-retraining-new-business-14529214", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14537872/16x9/991/557/959f84895dd12e0a7245baa1a4de00bc/pd/airasia-composite.png"}, {"author": null, "content": "A couple in South Korea accused of damaging artwork by American graffiti artist JonOne said they had mistakenly thought they were allowed to daub paint on the piece as participatory art, the head of … [+1337 chars]", "description": "A couple in South Korea accused of damaging artwork by American graffiti artist JonOne said they had mistakenly thought they were allowed to daub paint on the piece as “participatory art”, the head of the exhibition said on Friday. The 240cm by 700cm untitled…", "publishedAt": "2021-04-03T04:28:03Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Couple in Seoul paints over $672k graffiti artwork, says they mistook it for 'participatory art' - AsiaOne", "url": "https://www.asiaone.com/asia/couple-seoul-paints-over-672k-graffiti-artwork-says-they-mistook-it-participatory-art", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/reuters_joneone.jpeg?h=08cc71c4&itok=dRU3fZit"}, {"author": null, "content": "Photos for Valentino showing Japanese model Koki walking in high heels on a traditional obi kimono belt, and wearing shoes inside, have whipped up a storm of social media criticism amid accusations t… [+4764 chars]", "description": "Photos for Valentino showing Japanese model Koki walking in high heels on a traditional obi kimono belt, and wearing shoes inside, have whipped up a storm of social media criticism amid accusations the luxury Italian fashion house was “trampling on” Japanese …", "publishedAt": "2021-04-03T03:45:39Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Uproar in Japan over Valentino's kimono-belt 'trampling' ad featuring Takuya Kimura's daughter - AsiaOne", "url": "https://www.asiaone.com/asia/uproar-japan-over-valentinos-kimono-belt-trampling-ad-featuring-takuya-kimuras-daughter", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_87.jpg?h=2bef2584&itok=23-wjPX-"}, {"author": null, "content": "Deprivation among society at large is 'driving' Covid-19 disparities among minority ethnic groups - predominantly South Asian and Black African or Caribbean populations - and could be considered the … [+3531 chars]", "description": "Deprivation among society at large is 'driving' Covid-19 disparities among minority ethnic groups - predominantly South Asian and Black African or Caribbean populations - and could be considered the main cause of disproportionate infection rates, hospitalizat…", "publishedAt": "2021-04-03T03:19:00Z", "source": {"id": null, "name": "News-Medical.Net"}, "title": "Material deprivation is driving Covid-19 disparities among ethnic minority groups - News-Medical.Net", "url": "https://www.news-medical.net/news/20210402/Material-deprivation-is-driving-Covid-19-disparities-among-ethnic-minority-groups.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Physical_Activity-620x480.jpg"}, {"author": "AP", "content": "LONDON: The UK Conservative Partys internal investigation into racism in its ranks finished up to two months ago, The Independent newspaper has revealed, but its leaders have yet to announce when it … [+2282 chars]", "description": "MANILA: Filipinos marked Good Friday, one of the most solemn holidays in Asia’s largest Roman Catholic nation, with deserted streets and churches following a strict lockdown to slow down the spread of the coronavirus. Major highways and roads were eerily quie…", "publishedAt": "2021-04-02T09:18:45Z", "source": {"id": null, "name": "Arab News"}, "title": "Good Friday and coronavirus lockdown empty Manila's streets - Arab News", "url": "https://www.arabnews.com/node/1836311", "urlToImage": "https://www.arabnews.com/sites/default/files/2021/04/02/2554666-968223944.jpg"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "asia"}