{"articles": [{"author": null, "content": "SINGAPORE - A National University of Singapore student has been acquitted on a charge of assaulting a woman in a student housing unit on campus in 2019.\r\nMr Kim Dohyung, a Korean national who is now … [+1792 chars]", "description": "SINGAPORE - A National University of Singapore student has been acquitted on a charge of assaulting a woman in a student housing unit on campus in 2019. Mr Kim Dohyung, a Korean national who is now 23, was given a discharge amounting to an acquittal following…", "publishedAt": "2021-03-11T09:13:40Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Foreign NUS student acquitted of assaulting woman in hostel - AsiaOne", "url": "https://www.asiaone.com/singapore/foreign-nus-student-acquitted-assaulting-woman-hostel", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210311_princegeorgeparkresidences_st.jpg?h=0429cc9e&itok=PdDoB2qD"}, {"author": null, "content": "Don't you love it when celebrities spill the beans about other celebrities? Better yet when they are married to each other.\r\nIn the latest episode of the meWATCH talkshow The Inner Circle, actress Fa… [+1725 chars]", "description": "Don't you love it when celebrities spill the beans about other celebrities? Better yet when they are married to each other. In the latest episode of the meWATCH talkshow The Inner Circle, actress Fann Wong, 50, told host Guo Liang that she and her husband, 49…", "publishedAt": "2021-03-11T08:55:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Fann Wong: Husband Christopher Lee has an OCD about son Zed - AsiaOne", "url": "https://www.asiaone.com/entertainment/fann-wong-husband-christopher-lee-has-ocd-about-son-zed", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210311_chriszed.jpg?h=3451facd&itok=NwRashEo"}, {"author": null, "content": "Metro Manila (CNN Philippines, March 11) The Philippine government is expected to hold formal negotiations with India-based company Bharat Biotech to buy doses of its Covaxin vaccine, the South Asian… [+2005 chars]", "description": "The Philippine government is expected to hold formal negotiations with India-based company Bharat Biotech to buy doses of its Covaxin vaccine, the South Asian country’s ambassador says.", "publishedAt": "2021-03-11T05:40:57Z", "source": {"id": null, "name": "CNN Philippines"}, "title": "PH, India to hold talks for purchase of Covaxin doses; initial 8m supply 'achievable' – envoy - CNN Philippines", "url": "http://cnnphilippines.com/news/2021/3/11/Philippines-India-Bharat-Biotech-Covaxin-8-million-doses.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/3/4/Covaxin_CNNPH.jpg/jcr:content/Covaxin_CNNPH.jpg"}, {"author": null, "content": "Former DJ Daniel Ong and his wife Fay Tan are expecting another baby.\r\nOn Wednesday (March 10), the happy couple who have been married for over a year announced that they are now 16 weeks down their … [+1507 chars]", "description": "Former DJ Daniel Ong and his wife Fay Tan are expecting another baby. On Wednesday (March 10), the happy couple — who have been married for over a year — announced that they are now “16 weeks down” their pregnancy. It hasn’t been an easy journey for the duo w…", "publishedAt": "2021-03-11T02:47:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Daniel Ong and wife Fay Tan expecting another addition to the family - AsiaOne", "url": "https://www.asiaone.com/entertainment/daniel-ong-and-wife-fay-tan-expecting-another-addition-family", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210311_celebs_ig.jpg?h=a30d54cd&itok=jhAu3szt"}, {"author": "BERVIN CHEONG", "content": "Raya And The Last Dragon is certainly something different. The animation stars Disney's first ever South-East Asian princess and is inspired by cultures of the region.\r\nIt is written by a pair of Sou… [+1864 chars]", "description": "Disney has teamed up with a local modestwear label to come with a collection inspired by its latest animation featuring the strong, spirited South-East Asian warrior princess, Raya.", "publishedAt": "2021-03-10T07:00:00Z", "source": {"id": null, "name": "The Star Online"}, "title": "'Raya And The Last Dragon' gets its own modestwear collection in Malaysia - The Star Online", "url": "https://www.thestar.com.my/lifestyle/style/2021/03/10/039raya-and-the-last-dragon039-gets-its-own-modeswear-collection-in-malaysia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/03/10/1070843.jpg"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "asia"}