{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Mick Chan", "title": "2023 Perodua Axia gets four-star ASEAN NCAP rating - paultan.org - Paul Tan's Automotive News", "description": "The 2023 Perodua Axia has received a four-star rating from the New Car Assessment Programme for Southeast Asian Countries (ASEAN NCAP), ahead of its official launch in Malaysia that is set to take place February …", "url": "https://paultan.org/2023/02/08/2023-perodua-axia-gets-four-star-asean-ncap-rating/", "urlToImage": "https://paultan.org/image/2023/02/2023-Perodua-Axia-Asean-NCAP_lead-e1675856701720-1200x627.jpg", "publishedAt": "2023-02-08T12:02:24Z", "content": "The 2023 Perodua Axia has received a four-star rating from the New Car Assessment Programme for Southeast Asian Countries (ASEAN NCAP), ahead of its official launch in Malaysia that is set to take pl… [+2413 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Romaa Daas", "title": "Hogwarts Legacy: Check out what fans have to say on Twitter - Lifestyle Asia Kuala Lumpur", "description": "The early access to Hogwarts Legacy, a one-of-a-kind RPG from Harry Potter universe has left Twitteratis impressed. Here's all about it.", "url": "https://www.lifestyleasia.com/kl/gear/tech/hogwarts-legacy-early-access-twitter-reactions/", "urlToImage": "https://images.lifestyleasia.com/wp-content/uploads/sites/5/2023/02/08092527/hogwarts-legacy-1-1.jpeg", "publishedAt": "2023-02-08T07:19:15Z", "content": "It’s been over 25 years since the wizarding world of Harry Potter came into being courtesy of author JK Rowling and the fandom has only increased with time. Now, a video game — Hogwarts Legacy — set … [+4134 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I got scolded even just sitting there': Zoe Tay recalls why she was 'marked' during filming and reprimanded at every opportunity - AsiaOne", "description": "As it is, being an actor isn't easy — but Zoe Tay faced all that and more when she suddenly found herself under the watchful gaze of someone who had it out for her. In a recent episode of the Mediacorp talk show The Zoe and Liang Show, Zoe revealed that there…", "url": "https://www.asiaone.com/entertainment/scolded-even-just-sitting-there-zoe-tay-recalls-marked-during-filming-reprimanded-zoe-and-liang-show-guo-liang-ya-hui", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/8223_zoetay_mediacorp.jpg?h=92903f94&itok=2Q8SFXX6", "publishedAt": "2023-02-08T05:15:00Z", "content": "As it is, being an actor isn't easy but Zoe Tay faced all that and more when she suddenly found herself under the watchful gaze of someone who had it out for her.\r\nIn a recent episode of the Mediacor… [+2354 chars]"}, {"source": {"id": null, "name": "Nutraingredients-asia.com"}, "author": "nutraingredients-asia.com", "title": "Herbalife overcomes solubility barriers of curcumin to roll out new immune-support supplement - NutraIngredients-Asia", "description": "Herbalife has incorporated nanotechnology to develop a new immune-support supplement, Immunoturmeric, which recently debuted in Indonesia and will soon be available in the other Asia-Pacific markets.", "url": "https://www.nutraingredients-asia.com/Article/2023/02/08/herbalife-overcomes-solubility-barriers-of-curcumin-to-roll-out-new-immune-support-supplement", "urlToImage": "https://www.nutraingredients-asia.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/nutraingredients-asia.com/news/manufacturers/herbalife-overcomes-solubility-barriers-of-curcumin-to-roll-out-new-immune-support-supplement/16145624-1-eng-GB/Herbalife-overcomes-solubility-barriers-of-curcumin-to-roll-out-new-immune-support-supplement.jpg", "publishedAt": "2023-02-08T02:23:15Z", "content": "This product adds to Herbalifes portfolio of supplements that are targeted at strengthening the immune system.\r\nFirst launched in Indonesia last December, Immunoturmeric is developed with raw materia… [+3758 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Nepal detects H5N1 bird flu on farm, WOAH says - AsiaOne", "description": "PARIS — Nepal has reported an outbreak of the highly pathogenic H5N1 strain of avian influenza, or bird flu, on a poultry farm near the capital Kathmandu, the World Organisation for Animal Health (WOAH) said on Monday (Feb 6). The disease killed 2,909 laying …", "url": "https://www.asiaone.com/asia/nepal-detects-h5n1-bird-flu-farm-woah-says", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2023/20230207_chickens.jpg?h=0429cc9e&itok=L4kT9ylx", "publishedAt": "2023-02-07T02:05:36Z", "content": "PARIS  Nepal has reported an outbreak of the highly pathogenic H5N1 strain of avian influenza, or bird flu, on a poultry farm near the capital Kathmandu, the World Organisation for Animal Health (WOA… [+261 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Ideal cardiovascular health can help people live longer, finds Chinese Medical Journal study - EurekAlert", "description": "The American Heart Association defines ideal cardiovascular health (ICH) based on seven behavioral and clinical factors. However, its association with mortality in Asians is unclear. Pooling data from almost 200,000 individuals, a recent study examined the re…", "url": "https://www.eurekalert.org/news-releases/978793", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/42c32f9b-5843-4af9-ac3b-feffb4924ee8/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-07T02:00:04Z", "content": "image: The article described 3 studies done in China and shows that maintaining cardiovascular health could result in lower mortalityview more \r\nCredit: Chinese Medical Journal\r\nCardiovascular diseas… [+4365 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "How carbon fiber–reinforced epoxy composite laminates fail when wet - Phys.org", "description": "Scientists from two Asian universities, Universiti Teknologi Malaysia (UTM) and Newcastle University in Singapore, have completed a study to understand how the mechanical behavior of carbon fiber–reinforced epoxy composite laminates could be compromised by mo…", "url": "https://phys.org/news/2023-02-carbon-fiberreinforced-epoxy-composite-laminates.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/raindrop.jpg", "publishedAt": "2023-02-06T18:42:02Z", "content": "Scientists from two Asian universities, Universiti Teknologi Malaysia (UTM) and Newcastle University in Singapore, have completed a study to understand how the mechanical behavior of carbon fiberrein… [+2248 chars]"}]}