{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Asian stocks, dollar hunt for direction as investors look to Fed policy - Reuters", "description": "Asian equities and the dollar struggled to find direction on Tuesday as investors awaited Federal Reserve Chair Jerome Powell's appearance before the Senate Banking Committee, hoping for clues to the timing of expected policy tightening.", "url": "https://www.reuters.com/markets/europe/global-markets-wrapup-1-pix-2022-01-11/", "urlToImage": "https://www.reuters.com/resizer/X8U1pRTQaVNNkvCZIC2oRd9ThGY=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/K6KEAPAMCNMGHCLI63UU3W7PFU.jpg", "publishedAt": "2022-01-11T07:39:00Z", "content": "SINGAPORE, Jan 11 (Reuters) - Asian equities and the dollar struggled to find direction on Tuesday as investors awaited Federal Reserve Chair Jerome Powell's appearance before the Senate Banking Comm… [+3682 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Yaroslav Trofimov", "title": "Kazakhstan Crisis Shows That Russia Still Trumps China’s Power in Central Asia - The Wall Street Journal", "description": "Beijing’s huge investments in the region increasingly rely on Russian protection", "url": "https://www.wsj.com/articles/kazakhstan-crisis-shows-that-russia-still-trumps-chinas-power-in-central-asia-11641842588", "urlToImage": "https://images.wsj.net/im-464868/social", "publishedAt": "2022-01-10T19:23:00Z", "content": "For years, Russia and China have had a tacit division of labor in the Central Asian region that both consider their strategic backyard: Moscow provided security oversight while Beijing helped develop… [+252 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Single's Inferno: Who are the couples supposedly dating in real life after the series? - AsiaOne", "description": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. Well, we might just have an answer after all, thanks to the detective w…", "url": "https://www.asiaone.com/entertainment/netflix-singles-inferno-who-are-couples-dating-an-yea-won-cha-hyun-seung-oh-jin-taek-kang-so-yeon", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/100122_Singles%20Inferno%20couples_IG.jpg?h=79e3e4c1&itok=Cmr0eyzY", "publishedAt": "2022-01-10T12:00:00Z", "content": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. \r\nWell, we … [+3088 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Fort Worth IV Sedation Dentistry – Disability Dental Anesthesia Services Updated - AsiaOne", "description": "Fort Worth, TX - Special needs dental clinic Disability Dental Services (972-433-7294) announces its newly strengthened IV sedation packages. Its full, in-house anesthesia team helps make patients feel more relaxed and at ease during any procedure. Grand Prai…", "url": "https://www.asiaone.com/business/fort-worth-iv-sedation-dentistry-disability-dental-anesthesia-services-updated", "urlToImage": null, "publishedAt": "2022-01-10T10:43:22Z", "content": "Fort Worth, TX - Special needs dental clinic Disability Dental Services (972-433-7294) announces its newly strengthened IV sedation packages. Its full, in-house anesthesia team helps make patients fe… [+2737 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I didn't dare let my classmates know mum is a celebrity, says Chen Xiuhuan's daughter Shanisse - AsiaOne", "description": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmates to know. The 24-year-old made that revelation while speaki…", "url": "https://www.asiaone.com/entertainment/i-didnt-dare-let-my-classmates-know-my-mum-celebrity-says-chen-xiuhuan-daughter-shanisse", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/shanisse-chenxiuhuan_IG.jpg?h=05d90210&itok=IuhIcEQY", "publishedAt": "2022-01-10T10:30:00Z", "content": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmate… [+2966 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore committed to reopening borders even as Omicron spreads - The Star Online", "description": "Singapore is committed to steadily reopening its borders and aims to set up more quarantine-free travel agreements, Transport Minister S. Iswaran said in Parliament on Monday as the Asian country battles a rising number of coronavirus cases.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/01/10/singapore-committed-to-reopening-borders-even-as-omicron-spreads", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/01/10/1438547.jpg", "publishedAt": "2022-01-10T08:43:00Z", "content": "SINGAPORE, Jan 10 (Bloomberg): Singapore is committed to steadily reopening its borders and aims to set up more quarantine-free travel agreements, Transport Minister S. Iswaran said in Parliament on … [+1935 chars]"}]}