{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Prakash Rai", "title": "Asian Boxing Championships 2021 Men's Finals Highlights: Sanjeet Wins Gold; Amit Panghal, Shiva Thap.. - NDTVSports.com", "description": "2021 Asian Boxing Championships Highlights: Sanjeet defeated Vassiliy Levit to clinch 91kg gold medal, while Amit Panghal and Shiva Thapa bagged silver medals at the Asian Boxing Championships.", "url": "https://sports.ndtv.com/boxing/asian-boxing-championships-2021-mens-finals-dubai-live-updates-2453182", "urlToImage": "https://c.ndtvimg.com/2021-05/chtjin_sanjeet-bfi_625x300_31_May_21.jpg", "publishedAt": "2021-05-31T16:52:22Z", "content": "Indian heavyweight boxer Sanjeet defeated Olympic silver-medallist Vassiliy Levit in the 91kg final to clinch gold medal at the Asian Boxing Championships in Dubai on Monday. Earlier, top-seed Amit P… [+561 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "China Merchants Bank with Huawei's ADN Solution Takes Home a Top Award at IDC FIIA 2021 - Africanews English", "description": "At the Asian Financial Services Congress 2021, China Merchants Bank (CMB) was named one of the best banking leaders for the 2021 Financial Insights Innovation", "url": "http://www.africanews.com/2021/05/31/china-merchants-bank-with-huawei-s-adn-solution-takes-home-a-top-award-at-idc-fiia-2021/", "urlToImage": "https://static.euronews.com/articles/logo/apo_placeholder.jpg?1622472307", "publishedAt": "2021-05-31T14:45:07Z", "content": "At the Asian Financial Services Congress 2021, China Merchants Bank (CMB) was named one of the best banking leaders for the 2021 Financial Insights Innovation Awards (FIIA) and took home the Asia's L… [+2904 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Naaman Zhou", "title": "Asian-Australian Labor members say Michael Daley hasn’t learned from ‘Asians with PhDs’ comments - The Guardian", "description": "Eighteen people have signed a joint statement opposing the former NSW Labor leader’s bid to return to the top job, saying it would harm the party’s vote in multicultural communities", "url": "https://amp.theguardian.com/australia-news/2021/may/31/asian-australian-labor-members-say-michael-daley-hasnt-learned-from-asians-with-phds-comments", "urlToImage": null, "publishedAt": "2021-05-31T08:33:00Z", "content": "Labor partyEighteen people have signed a joint statement opposing the former NSW Labor leaders bid to return to the top job, saying it would harm the partys vote in multicultural communities\r\nNearly … [+5818 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Actor Kai Ko on his exes: 'The one I wanted to marry was Elva Hsiao, but the one I liked most was Tia Lee' - AsiaOne", "description": "SINGAPORE - Taiwanese actor Kai Ko has said that he wanted to marry singer Elva Hsiao, but that he liked singer Tia Lee the most. In an Instagram Live broadcast on May 28, he was asked by singer Jumi Wang in a game of Truth Or Dare? which former girlfriend he…", "url": "https://www.asiaone.com/entertainment/actor-kai-ko-his-exes-one-i-wanted-marry-was-elva-hsiao-one-i-liked-most-was-tia-lee", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/image_1189.jpg?h=199d8c1f&itok=rwSw7FWk", "publishedAt": "2021-05-30T15:55:39Z", "content": "SINGAPORE - Taiwanese actor Kai Ko has said that he wanted to marry singer Elva Hsiao, but that he liked singer Tia Lee the most.\r\nIn an Instagram Live broadcast on May 28, he was asked by singer Jum… [+2174 chars]"}]}