{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "Stefanie Sun and JJ Lin send Old Chang Kee and chilli crab to Jay Chou in Singapore - Channel NewsAsia", "description": "Chou, in town for his Carnival World Tour concert, thanked his fellow pop stars via social media for feeding him well. Food, after all, is Singaporeans’ love language, isn’t it?", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/jay-chou-concert-singapore-stefanie-sun-j-j-lin-send-food-343681", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--vBig-A07--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/12/18/jay_chou_in_singapore_2022.jpg?itok=o1VfgAYf", "publishedAt": "2022-12-18T02:50:56Z", "content": "Additionally, Chou and his team received a seafood meal from Lin, replete with chilli crab and more crabs done in different ways; prawns and vegetable dishes. Chou remarked, Yum and Thanks, bro. Lin … [+342 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New 800-seat hawker centre opens in Sembawang, first one there in 30 years - AsiaOne", "description": "SINGAPORE – After a close to three-year delay due to the Covid-19 pandemic, the Bukit Canberra Hawker Centre opened on Saturday, marking it the first such facility in Sembawang in about 30 years. The site was part of Chong Pang Village, which used to house a …", "url": "https://www.asiaone.com/singapore/new-800-seat-hawker-centre-opens-sembawang-first-one-there-30-years", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/hawker1_ST.jpg?h=c9f93661&itok=lKBXSIS4", "publishedAt": "2022-12-17T23:26:54Z", "content": "SINGAPORE After a close to three-year delay due to the Covid-19 pandemic, the Bukit Canberra Hawker Centre opened on Saturday, marking it the first such facility in Sembawang in about 30 years.\r\nThe … [+3756 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Philippine Daily Inquirer", "title": "AirAsia averts shutdown, commits to pay P1.14B - INQUIRER.net", "description": "Philippine Air Asia (PAA) narrowly averted a shutdown during the peak holiday travel season after agreeing to pay its P1.14-billion obligation with the Civil Aviation Authority of the", "url": "https://www.inquirer.net", "urlToImage": "https://business.inquirer.net/files/2022/12/402332-620x324.jpeg", "publishedAt": "2022-12-16T18:16:00Z", "content": "AirAsia flights departing and arriving from Caticlan and Cebu will operate at NAIA Terminal 3 starting December 16\r\nPhilippine Air Asia (PAA) narrowly averted a shutdown during the peak holiday trave… [+2046 chars]"}]}