{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "PH shares up for third straight day, end at 7419 - ANC 24/7", "description": "The World Tonight: The Philippine Stock Exchange Index edged higher for a third straight day even as the rest of Asian markets see a choppy trade.", "url": "https://www.youtube.com/watch?v=a6Go5iY17PI", "urlToImage": "https://i.ytimg.com/vi/a6Go5iY17PI/maxresdefault.jpg", "publishedAt": "2021-11-24T14:47:55Z", "content": null}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Shatricia Nair", "title": "Nike’s latest concept store will help you find the perfect shoe fit for the rest of your life - Lifestyle Asia", "description": "Nike Unite will debut Southeast Asia-firsts such as the tech-enabled NikeFit shoe fitting service, as well as offer T-shirt customisations.", "url": "https://www.lifestyleasia.com/sg/style/fashion/nike-unite-imm-will-help-you-find-the-perfect-shoe-fit/", "urlToImage": "https://cdn.lifestyleasia.com/wp-content/uploads/sites/6/2021/11/24204439/Service-Hub-2.jpg", "publishedAt": "2021-11-24T13:24:29Z", "content": "Its finally December, and while its too late to hit those 2021 resolutions, the consolation is that youre starting on 2022s early.\r\nTo inspire a new generation of people to take up sport as a daily h… [+2597 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "If it weren't for Sharon Au, Darren Lim and Evelyn Tan might not have got together - AsiaOne", "description": "Local celebrities Darren Lim and Evelyn Tan have been together for a long time and they're still going strong. However, they might not have had that happy ending if it weren't for another celebrity — former actress-host Sharon Au. In an article on Monday (Nov…", "url": "https://www.asiaone.com/entertainment/if-it-werent-sharon-au-darren-lim-and-evelyn-tan-might-not-have-got-together", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/sharon-darren-evelyn_lhwb.jpg?h=571c1fa9&itok=wJBTqtNe", "publishedAt": "2021-11-24T10:35:00Z", "content": "Local celebrities Darren Lim and Evelyn Tan have been together for a long time and they're still going strong. However, they might not have had that happy ending if it weren't for another celebrity f… [+1804 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Europe 'in the firm grip' of COVID-19, says WHO; warns of 700,000 more deaths in 53 countries by March 1 - Times Now", "description": "WHO's regional director for Europe Dr Hans Kluge has said that Europe and Central Asia face a \"challenging winter\".", "url": "https://www.timesnownews.com/international/article/europe-in-the-firm-grip-of-covid-19-says-who-warns-of-700000-more-deaths-in-53-countries-by-march/834711", "urlToImage": "https://imgk.timesnownews.com/story/Austria_lockdown_AP_1200.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2021-11-24T02:44:00Z", "content": "<ul><li>According to a study, face masks reduced COVID-19 incidence by 53 per cent</li></ul>\r\n<ul><li>Unrest has flared in several countries as a result of the prospect of a new round of restrictions… [+4003 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "PBC eyes SEA Games gold — Bong Coo - BusinessWorld Online", "description": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a decade in the Hanoi tilt in May next year.", "url": "https://www.bworldonline.com/pbc-eyes-sea-games-gold-bong-coo/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/TEAM-Philippines-at-the-2021-IBF-Super-World-Championship.jpg", "publishedAt": "2021-11-23T16:01:25Z", "content": "INSPIRED by its bronze medal performance in the World Championships in Dubai, the Philippine bowling team has trained its sights at claiming its first Southeast Asian (SEA) Games gold medal in over a… [+1447 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Prepared to be scolded: Shane Pow to act in Mediacorp telemovie, first show after leaving prison - AsiaOne", "description": "Things are picking up for local actor Shane Pow after a terrible year. Besides being a regular livestreamer on Mdada — an online sales platform started by celebrity hairstylist Addy Lee, actress Michelle Chia, and host Pornsak — Shane has signed on to star in…", "url": "https://www.asiaone.com/entertainment/prepared-be-scolded-shane-pow-act-mediacorp-telemovie-first-show-after-leaving-prison", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211123_shane.jpg?h=f74d8d50&itok=_KndRlRk", "publishedAt": "2021-11-23T11:10:00Z", "content": "Things are picking up for local actor Shane Pow after a terrible year.\r\nBesides being a regular livestreamer on Mdada an online sales platform started by celebrity hairstylist Addy Lee, actress Miche… [+1349 chars]"}]}