{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Australia To Buy Up To 5 Nuclear-Powered Submarines From US - NDTV", "description": "Australia has unveiled plans to buy up to five US nuclear-powered submarines, then build a new model with US and British technology under an ambitious plan to bulk up Western muscle across the Asia-Pacific in the face of a rising China.", "url": "https://www.ndtv.com/world-news/australia-to-buy-up-to-5-nuclear-powered-submarines-from-us-3858553", "urlToImage": "https://c.ndtvimg.com/2023-03/8n1apfa_australia_625x300_14_March_23.jpg", "publishedAt": "2023-03-14T05:14:00Z", "content": "US said Australia will buy nuclear submarines in coming years. (Representational)\r\nWashington: Australia has unveiled plans to buy up to five US nuclear-powered submarines, then build a new model wit… [+5238 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Yusuke Tamiyama, Yusuke Tamiyama", "title": "Japanese astronaut Koichi Wakata back from space after an ISS mission - asianews.network", "description": "Wakata and his crewmates from the United States and Russia had been on the ISS for an extended stay since October. This was Wakata’s fourth time on the space station.", "url": "https://asianews.network/japanese-astronaut-koichi-wakata-back-from-space-after-an-iss-mission/", "urlToImage": "https://asianews.network/wp-content/uploads/2023/03/d4-1.jpg", "publishedAt": "2023-03-14T03:56:41Z", "content": "March 14, 2023\r\nTOKYO Astronaut Koichi Wakata of the Japan Aerospace Exploration Agency (JAXA) returned to Earth on Saturday with three crewmates from the International Space Station (ISS).\r\nA SpaceX… [+1207 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Michelle Yeoh's Mom IN TEARS Reacting to Daughter Winning an Oscar - Entertainment Tonight", "description": "Michelle Yeoh’s mother cried tears of joy when her daughter made history at the 95th Academy Awards. The Malaysian-born star became the first Asian Best Actr...", "url": "https://www.youtube.com/watch?v=UU75lqDeXmk", "urlToImage": "https://i.ytimg.com/vi/UU75lqDeXmk/maxresdefault.jpg", "publishedAt": "2023-03-14T00:00:08Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Terry Tang", "title": "For Asian Americans, Yeoh, Quan's Oscar wins are theirs too - The Associated Press - en Español", "description": "LOS ANGELES (AP) — Edward Dion Fariñas watches the Academy Awards every year but the Filipino American didn't expect to have such a visceral reaction when hearing Ke Huy Quan and Michelle Yeoh's awards  announced.", "url": "https://apnews.com/article/oscars-asian-michelle-yeoh-ke-huy-quan-041c1f2adee40d60f85c1ae51213b9ff", "urlToImage": "https://storage.googleapis.com/afs-prod/media/492ee0f3fc48413bb6920e9ce86e4b25/3000.webp", "publishedAt": "2023-03-13T22:30:00Z", "content": "LOS ANGELES (AP) Edward Dion Fariñas watches the Academy Awards every year but the Filipino American didnt expect to have such a visceral reaction when hearing Ke Huy Quan and Michelle Yeohs awards a… [+5360 chars]"}]}