{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "The New Year rings in as Asia and Europe usher out stormy 2022 - CNA", "description": "With fireworks in London, Paris and Berlin, hopes for an end to the war in Ukraine and a return to post-COVID normality, Europe and Asia bid farewell to 2022. It was a year marked by the conflict in Ukraine, economic stresses and the effects of global warming…", "url": "https://www.channelnewsasia.com/asia/asia-new-year-world-starts-ushering-out-2022-3177246", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--jiBbvMGW--/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/australia_new_years_eve_66216.jpg?itok=r_699FEs", "publishedAt": "2022-12-31T21:03:00Z", "content": "Russian President Vladimir Putin devoted his New Year's address to rallying the Russian people behind his troops.\r\nFestivities in Moscow were muted, without the usual fireworks on Red Square.\r\n\"One s… [+1492 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New year, new power couple: Lee Jong-suk and IU are dating - AsiaOne", "description": "As we ring in 2023, fans can also welcome a new power couple in South Korean showbiz. Shortly after Korean media Dispatch reported that the pair had spent Christmas together in Japan, the agencies of actor Lee Jong-suk and singer-actress IU have confirmed on …", "url": "https://www.asiaone.com/entertainment/new-year-new-power-couple-lee-jong-suk-and-iu-are-dating", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/leejongsukiu_ig.jpg?h=e168242f&itok=6VwdL31w", "publishedAt": "2022-12-31T09:25:14Z", "content": "As we ring in 2023, fans can also welcome a new power couple in South Korean showbiz.\r\nShortly after Korean media Dispatch reported that the pair had spent Christmas together in Japan, the agencies o… [+1337 chars]"}]}