{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Heather Chen, CNN", "title": "Philippines: Thousands stranded on New Year's Day as power outage hits Manila airport - CNN", "description": "Chaos erupted on New Year's Day in the Philippines after a severe airport power outage temporarily impacted air traffic control, disrupting nearly 300 flights and leaving tens of thousands of travelers stranded in the Southeast Asian hub.", "url": "https://www.cnn.com/travel/article/naia-philippines-airport-power-outage-flight-chaos-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230102100346-manila-airport-year-power-outage-010123-super-tease.jpg", "publishedAt": "2023-01-02T04:03:23Z", "content": "(CNN) Chaos erupted on New Year's Day in the Philippines after a severe airport power outage temporarily impacted air traffic control, disrupting nearly 300 flights and leaving tens of thousands of t… [+4215 chars]"}, {"source": {"id": null, "name": "Lifestyleasia.com"}, "author": "Brittany Poulson, MDA, RDN, CD, CDCES", "title": "Can you get diabetes from eating too much sugar? - Lifestyle Asia Hong Kong", "description": "Sugar alone doesn’t cause diabetes. However, it does have an indirect effect on insulin resistance or diabetes.", "url": "https://www.lifestyleasia.com/hk/living/wellness/can-you-get-diabetes-from-eating-too-much-sugar/", "urlToImage": "https://images.lifestyleasia.com/wp-content/uploads/sites/2/2022/12/30124103/candy-1.jpeg", "publishedAt": "2023-01-02T02:03:53Z", "content": "Eating too much sugar doesn’t directly cause diabetes. However, there is a correlation (association) between being overweight or having obesity and type 2 diabetes. Over time, consuming too many food… [+13713 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New year, new power couple: Lee Jong-suk and IU are dating - AsiaOne", "description": "As we ring in 2023, fans can also welcome a new power couple in South Korean showbiz. Shortly after Korean media Dispatch reported that the pair had spent Christmas together in Japan, the agencies of actor Lee Jong-suk and singer-actress IU have confirmed on …", "url": "https://www.asiaone.com/entertainment/new-year-new-power-couple-lee-jong-suk-and-iu-are-dating", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/leejongsukiu_ig.jpg?h=e168242f&itok=6VwdL31w", "publishedAt": "2022-12-31T09:25:14Z", "content": "As we ring in 2023, fans can also welcome a new power couple in South Korean showbiz.\r\nShortly after Korean media Dispatch reported that the pair had spent Christmas together in Japan, the agencies o… [+1337 chars]"}]}