{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "LIEW JIA XIAN", "title": "British maskless 'Karen' in the thick of it again - The Star Online", "description": "PETALING JAYA: Malaysians have chastised the Caucasian woman who caused a stir for refusing to wear a face mask at a luxury store last month after she uploaded a video on her “freedom to choose”.", "url": "https://www.thestar.com.my/news/nation/2021/11/08/british-maskless-karen-in-the-thick-of-it-again", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/08/1359720.jpg", "publishedAt": "2021-11-07T23:46:32Z", "content": "PETALING JAYA: Malaysians have chastised the Caucasian woman who caused a stir for refusing to wear a face mask at a luxury store last month after she uploaded a video on her freedom to choose.\r\nWhil… [+2732 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Kaithreen Cruz", "title": "Group rallies support for smoking alternatives - The Manila Times", "description": "TOBACCO harm reduction advocate and Executive Director of the Coalition of Asia Pacific Harm Reduction Advocates Nancy Loucas urged officials of the World Health Organization (WHO)...", "url": "https://www.manilatimes.net/2021/11/08/news/national/group-rallies-support-for-smoking-alternatives/1821372", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/07/25138.jpg", "publishedAt": "2021-11-07T15:06:49Z", "content": "TOBACCO harm reduction advocate and Executive Director of the Coalition of Asia Pacific Harm Reduction Advocates Nancy Loucas urged officials of the World Health Organization (WHO) to stop turning a … [+2220 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'We felt we had to overhaul our lives': Munah Bagharib and her brother on what it's like having a mum with dementia - AsiaOne", "description": "'I never realised that it would hit so close to home until it actually did, so it hit me quite hard,\" says local actress and host Munah Bagharib. She was away from home when she first got the news from her younger brother Ziyad Bagharib that her mother, then …", "url": "https://www.asiaone.com/lifestyle/we-felt-we-had-overhaul-our-lives-munah-bagharib-and-her-brother-what-its-having-mum", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/For%20editorial.jpg?h=0429cc9e&itok=QYUhjV6S", "publishedAt": "2021-11-07T12:32:51Z", "content": "'I never realised that it would hit so close to home until it actually did, so it hit me quite hard,\" says local actress and host Munah Bagharib.\r\nShe was away from home when she first got the news f… [+7106 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "UK foreign secretary begins week-long SE Asia visit with first stop in Malaysia - Malay Mail", "description": "KUALA LUMPUR, Nov 7 — The United Kingdom’s (UK) Foreign Secretary Liz Truss arrived in Malaysia on Sunday to begin her week-long visit to the South-east Asia to deepen economic and security links with fast-growing and increasingly influential countries. Besid…", "url": "https://www.malaymail.com/news/malaysia/2021/11/07/uk-foreign-secretary-begins-week-long-se-asia-visit-with-first-stop-in-mala/2019104", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-11/reuters_liz_truss_20211107-seo.JPG", "publishedAt": "2021-11-07T11:39:36Z", "content": "Britains Foreign Secretary Liz Truss speaks during the annual Conservative Party conference, in Manchester October 3, 2021. Reuters pic\r\nKUALA LUMPUR, Nov 7 The United Kingdoms (UK) Foreign Secretary… [+3310 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Man in Brazil dies after jumping into piranha-infested lake to escape swarm of bees - AsiaOne", "description": "A man in Brazil reportedly died after jumping into a lake to escape a swarm of bees, only to be partially devoured by flesh-eating piranhas. His mangled body was found last Sunday (Oct 31), although it was initially unclear if he had died by drowning before b…", "url": "https://www.asiaone.com/world/man-brazil-dies-after-jumping-piranha-infested-lake-escape-swarm-bees", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/piranha-pexels-piya-nimityongskul.jpeg?h=10d202d3&itok=CJZ2Vpld", "publishedAt": "2021-11-07T05:27:00Z", "content": "A man in Brazil reportedly died after jumping into a lake to escape a swarm of bees, only to be partially devoured by flesh-eating piranhas.\r\nHis mangled body was found last Sunday (Oct 31), although… [+1450 chars]"}]}