{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "PerthNow"}, "author": "PerthNow", "title": "Ukraine crisis: Beauty queen Anastasia Lenna takes up arms in fight against Russian intruders - PerthNow", "description": "She’s used to modelling the latest fashions on catwalks but a Ukrainian beauty queen has come to the call of her country in its hour of need and joined the fighting against Russian troops.", "url": "https://www.perthnow.com.au/news/conflict/ukraine-crisis-beauty-queen-anastasia-lenna-takes-up-arms-in-fight-against-russian-intruders-c-5870974", "urlToImage": "https://images.perthnow.com.au/publication/C-5870974/0d6e729bde722f1e888735587edd10bd7309c6bf-16x9-x1y0w2446h1376.jpg?imwidth=1200", "publishedAt": "2022-02-28T06:32:00Z", "content": "Shes used to modelling the latest fashions on catwalks but a Ukrainian beauty queen has come to the call of her country in its hour of need and joined the fighting against Russian troops.\r\nAnastasia … [+2367 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I can't afford to get infected': Family of 6 on living with Covid-19 in a 2-room flat - AsiaOne", "description": "SINGAPORE - After living in a two-room rental unit in Ang Mo Kio for 15 years, Mr Fedayin Ijan, 44, and his family of six were looking forward to moving to a four-room Housing Board flat next month. As they were steadily preparing for the move, his daughters …", "url": "https://www.asiaone.com/singapore/i-cant-afford-get-infected-family-6-living-covid-19-2-room-flat", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/20220228_covid_st.jpg?h=0429cc9e&itok=i8GfWmVM", "publishedAt": "2022-02-28T04:52:04Z", "content": "SINGAPORE - After living in a two-room rental unit in Ang Mo Kio for 15 years, Mr Fedayin Ijan, 44, and his family of six were looking forward to moving to a four-room Housing Board flat next month.\r… [+2154 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "K-drama Squid Game wins big at Hollywood's Screen Actors Guild Awards - AsiaOne", "description": "In another huge win for Asia and particularly Korean showbiz, K-drama Squid Game has won big at the 2022 Screen Actors Guild (SAG) Awards today (Feb 28). Veteran actor Lee Jung-jae won Male Actor in a Drama Series, while newbie actress Jung Ho-yeon took the F…", "url": "https://www.asiaone.com/entertainment/k-drama-squid-game-wins-big-hollywoods-screen-actors-guild-awards", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/20220228_sagsquid.jpg?h=a46359cc&itok=AuRIYLJF", "publishedAt": "2022-02-28T03:08:00Z", "content": "In another huge win for Asia and particularly Korean showbiz, K-drama Squid Game has won big at the 2022 Screen Actors Guild (SAG) Awards today (Feb 28).\r\nVeteran actor Lee Jung-jae won Male Actor in… [+1167 chars]"}]}