{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Yale.edu"}, "author": null, "title": "Young Filipino Entrepreneur Looks to Build Southeast Asia's Biggest Solar Plant - Yale Environment 360", "description": "", "url": "https://e360.yale.edu/digest/young-filipino-entrepreneur-looks-to-build-southeast-asias-biggest-solar-plant", "urlToImage": null, "publishedAt": "2021-11-17T16:58:24Z", "content": "Leandro Leviste, a 28-year-old Filipino entrepreneur, is planning to build what would be the largest solar installation in Southeast Asia, a 500-megawatt plant around 80 miles north of Manila, Bloomb… [+1735 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'A female tomboy, not a trans person': Kelly Kimberly Cheong on her Ah Girls Go Army character's name causing a stir - AsiaOne", "description": "When she unveiled her look for her upcoming movie Ah Girls Go Army (AGGA), Kelly Kimberly Cheong, 27, did not expect netizens to go off about her character's name. Last Friday (Nov 12), Kelly posted a picture of herself decked out in an army uniform, posing i…", "url": "https://www.asiaone.com/entertainment/female-tomboy-ah-girls-go-army-not-trans-person-kelly-kimberly-cheong-jack-neo", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/171121_Kelly%20Kimberly%20Cheong_0.jpg?h=253bb941&itok=p6ZR9CEM", "publishedAt": "2021-11-17T11:10:00Z", "content": "When she unveiled her look for her upcoming movie Ah Girls Go Army (AGGA), Kelly Kimberly Cheong, 27, did not expect netizens to go off about her character's name. \r\nLast Friday (Nov 12), Kelly poste… [+3618 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "No Tobey Maguire or Andrew Garfield in Spider-Man: No Way Home trailer; full look at Sinister Six villains - AsiaOne", "description": "There's something to be said when a trailer for a film gets so much hype that its release is a pop culture event to look forward to. As Spider-Man: No Way Home is primed to be a massive game-changer for the Marvel Cinematic Universe (MCU), fans are quivering …", "url": "https://www.asiaone.com/entertainment/no-tobey-maguire-or-andrew-garfield-spider-man-no-way-home-trailer-sinister-six-electro-green-goblin-lizard", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/spidermannwh_YT.jpg?h=ffd08fb1&itok=35lnO0Aq", "publishedAt": "2021-11-17T04:10:00Z", "content": "There's something to be said when a trailer for a film gets so much hype that its release is a pop culture event to look forward to.\r\nAs Spider-Man: No Way Home is primed to be a massive game-changer… [+3134 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "NUS students beat over 2000 entries to win top international James Dyson award with glaucoma screening device - AsiaOne", "description": "SINGAPORE -Three National University of Singapore students who invented a glaucoma screening device have beaten more than 2,000 entries from around the world to win the international James Dyson Award this year. The invention, aptly named Hopes (Home Eye Pres…", "url": "https://www.asiaone.com/singapore/nus-students-beat-over-2000-entries-win-top-international-james-dyson-award-glaucoma", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/17112021_award_st.jpeg?h=1c9b88c9&itok=6ih1WcSv", "publishedAt": "2021-11-17T01:04:30Z", "content": "SINGAPORE -Three National University of Singapore students who invented a glaucoma screening device have beaten more than 2,000 entries from around the world to win the international James Dyson Awar… [+4846 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Multi-system inflammatory syndrome: How kids can get it from Covid-19 and signs to look out for - AsiaOne", "description": "SINGAPORE - A rare condition where different organs in the body are inflamed has been found in some children infected with Covid-19. A child with multi-system inflammatory syndrome in children (MIS-C) may require urgent care due to the involvement of various …", "url": "https://www.asiaone.com/lifestyle/multi-system-inflammatory-syndrome-how-kids-can-get-it-covid-19-and-signs-look-out", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211116_child_misc.jpg?h=0429cc9e&itok=bYGUj1EI", "publishedAt": "2021-11-16T08:46:06Z", "content": "SINGAPORE - A rare condition where different organs in the body are inflamed has been found in some children infected with Covid-19.\r\nA child with multi-system inflammatory syndrome in children (MIS-… [+5161 chars]"}, {"source": {"id": null, "name": "Campaign Asia-Pacific"}, "author": "Ad Nut", "title": "Heineken asks whether pandemic romance can survive the end of lockdown | Advertising - Campaign Asia", "description": null, "url": "https://www.campaignasia.com/video/heineken-asks-whether-pandemic-romance-can-survive-the-end-of-lockdown/473983", "urlToImage": "https://cdn.i.haymarketmedia.asia/?n=campaign-asia%2fcontent%2fheineken_pandemiclovestory.jpg&h=630&w=1200&q=75&v=20170226&c=1", "publishedAt": "2021-11-16T05:06:44Z", "content": "Heineken has launched an ad specifically made for markets that are just emerging from lockdown.\r\nCreated by Publicis Italy and shot in Tokyo under the direction of Show Yanagisawa, the film is a popp… [+2942 chars]"}]}