{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "Transparency International: Governments in Asia Pacific restricting civic space - Philstar.com", "description": "\"[A]cross Asia Pacific, states maintain restrictions on civic space and basic freedoms imposed during the pandemic, as leaders continue down the path toward authoritarianism,\" Transparency International said.", "url": "https://www.philstar.com/business/2023/01/31/2241567/transparency-international-governments-asia-pacific-restricting-civic-space", "urlToImage": "https://media.philstar.com/photos/2023/01/31/cambodia-protest_2023-01-31_15-20-07.jpg", "publishedAt": "2023-01-31T07:30:00Z", "content": "MANILA, Philippines — Countries in the Asia Pacific region, including the Philippines, have continued the restriction of civic space that began during the worst of the COVID-19 pandemic, according to… [+4406 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Lee Ying Shan", "title": "Asia-Pacific shares trade mostly lower; China manufacturing activity shows growth - CNBC", "description": "Asia-Pacific shares trade mostly lower as China reports growth in manufacturing activity after three months of contraction", "url": "https://www.cnbc.com/2023/01/31/asia-pacific-shares-fed-earnings-economic-data.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107179165-1673938740082-gettyimages-1245952422-SHANGHAI_ECONOMY.jpeg?v=1675122221&w=1920&h=1080", "publishedAt": "2023-01-31T07:27:00Z", "content": "Investors should fade the early 2023 rally, warned JPMorgan's top market strategist Marko Kolanovic.\r\nThe first quarter will likely mark a turning point for the market and its upward trajectory proba… [+1254 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Owner of Apollo Fresh Cockle Fried Kway Teow in Marine Parade hangs up apron after more than 40 years - AsiaOne", "description": "Apollo Fresh Cockle Fried Kway Teow has closed after being in the business for over four decades. The popular kway teow joint is located in Marine Parade Central Food Centre and the stall owner Tan Ah Guan — who has decided to retire — served his last plate o…", "url": "https://www.asiaone.com/lifestyle/owner-apollo-fresh-cockle-fried-kway-teow-marine-parade-hangs-apron-after-more-40-years", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/310123_kwayteow_fb.jpg?h=0a3225a7&itok=ABth-IJS", "publishedAt": "2023-01-31T06:38:00Z", "content": "Apollo Fresh Cockle Fried Kway Teow has closed after being in the business for over four decades. \r\nThe popular kway teow joint is located in Marine Parade Central Food Centre and the stall owner Tan… [+2402 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sputnik", "title": "F-16 Fighters Not Required In Ukraine With US Already Sending New Capabilities To Hold Russia – White House - EurAsian Times", "description": "The United States does not need to provide Ukraine with F-16 fighter jets because it is already providing Kyiv with lots of new capabilities that were recently announced in the latest aid packages, White House National Security Council spokesperson John Kirby…", "url": "https://eurasiantimes.com/f-16-fighter-jets-not-required-in-ukraine-with-us-already-sending/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/12/F-16-Vipers-1.jpg", "publishedAt": "2023-01-31T02:19:02Z", "content": "The United States does not need to provide Ukraine with F-16 fighter jets because it is already providing Kyiv with lots of new capabilities that were recently announced in the latest aid packages, W… [+2904 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Le Matin patisserie opening at ION Orchard with bistro-style food like mussels, waffles and pie - Channel NewsAsia", "description": "The patisserie by chef Mohamad Al-Matin has a new home, along with cozy seating, a sleeker new logo and plenty of new menu items. It opens Feb 1.", "url": "https://cnalifestyle.channelnewsasia.com/dining/new-le-matin-patisserie-ion-orchard-brunch-dinner-desserts-pastries-347511", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--CjIHNTU9--/c_crop,h_843,w_1500,x_0,y_306/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/29/chef_matin_04.jpg?itok=wvFZw-5a", "publishedAt": "2023-01-30T23:11:00Z", "content": "Many people know that I worked as a pastry chef in fine dining for a very long time and Im comfortable with doing desserts, so I just want to showcase a few, but in a simple style, he said. But, I do… [+757 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "India’s Adani firms lose $65bn in value - Al Jazeera English", "description": "Led by Asia’s richest man Gautam Adani, the group has locked horns with short seller Hindenburg Research.", "url": "https://www.aljazeera.com/economy/2023/1/30/indias-adani-firms-lose-65bn-in-value", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/08/2014-04-10T120000Z_1800528616_GM1EA470NIY01_RTRMADP_3_INDIA-ELECTION-ADANI.jpg?resize=1920%2C1440", "publishedAt": "2023-01-30T18:25:07Z", "content": "Most Adani Group shares fell sharply on Monday as the Indian conglomerates rebuttal of a US short sellers criticism failed to pacify investors, deepening a market rout that has now led to losses of $… [+4725 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Priyanka Shankar", "title": "Will more NATO support increase tensions in Asia? - DW (English)", "description": "A visit to South Korea and Japan by the head of NATO this week highlights the alliance's strategic priority to push back against China and North Korea, while addressing the global impact of Russia's war in Ukraine.", "url": "https://www.dw.com/en/will-more-nato-support-increase-tensions-in-asia/a-64557391", "urlToImage": "https://static.dw.com/image/64182447_6.jpg", "publishedAt": "2023-01-30T15:09:44Z", "content": "NATO Secretary-General Jens Stoltenberg began a four-day trip to South Korea and Japan over the weekend, addressing military threats from China and North Korea, while seeking to deepen the alliance's… [+6144 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "7 hangover cures that might help after your next weekend partying - AsiaOne", "description": "A fan of the drinking, but not so much of some of those less-than-pleasant hangover conditions that present themselves the morning after? We hear you! More than the physical fatigue and the irritating physical symptoms, it’s getting your brain to bounce back …", "url": "https://www.asiaone.com/lifestyle/7-hangover-cures-might-help-after-your-next-weekend-partying", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/20230129_drunk_unspalsh.jpg?h=0429cc9e&itok=Ef8utjKX", "publishedAt": "2023-01-30T02:31:24Z", "content": "A fan of the drinking, but not so much of some of those less-than-pleasant hangover conditions that present themselves the morning after? We hear you!\r\nMore than the physical fatigue and the irritati… [+4927 chars]"}, {"source": {"id": null, "name": "Asianscientist.com"}, "author": "Asian Scientist Newsroom", "title": "Tapping Into Nature To Address Peritoneal Adhesion - Asian Scientist Magazine", "description": "Using pollen grains, the Singapore Institute of Technology (SIT) and local startup Sporogenics have teamed up to develop a hydrogel film with superior properties to prevent this post-surgery complication.", "url": "https://www.asianscientist.com/2023/01/sponsored-feature/sit-hydogels-for-post-surgery-peritoneal-adhesion/", "urlToImage": "https://www.asianscientist.com/wp-content/uploads/2023/01/230113_Hydrogel_Film0676_final-Cover-image_1024x607.jpeg", "publishedAt": "2023-01-30T02:27:24Z", "content": "AsianScientist (Jan. 30, 2023) The human abdomen is lined with a thin, continuous membrane layer called the peritoneum, which covers and protects the organs from friction against each other and the w… [+6022 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Meet 5 celebrity yoga instructors at Glow Festival who are leading the wellness scene - Channel NewsAsia", "description": "You might already have seen their work on Netflix, or read that their students include Deepak Chopra and Jane Fonda. Work out with these celebrity trainers – and know more about them – at the Glow Festival on Feb 4 to 12 at Marina Bay Sands.", "url": "https://cnalifestyle.channelnewsasia.com/wellness/glow-festival-2023-yoga-hiro-landazuri-jonah-kest-tara-stiles-amanda-bisk-sjana-elise-345876", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--YMKrHc_D--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/21/1.jpg?itok=4sizXLiG", "publishedAt": "2023-01-29T23:17:04Z", "content": "With their lithe and toned limbs, six-pack abs (but of course), winning smiles and impressive social media followings (we're talking millions here), its easy to want to emulate celebrity yoga instruc… [+664 chars]"}]}