{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "New couple alert: Actor Lee Seung-gi and actress Lee Da-in confirmed to be dating - AsiaOne", "description": "A new Korean celebrity couple have just been outed: actor-singer Lee Seung-gi, 34, and actress Lee Da-in, 28. Korean media outlet Sports Kyunghyang reported today (May 24) that the two have been dating since the end of last year, after connecting through thei…", "url": "https://www.asiaone.com/entertainment/new-k-drama-couple-alert-actor-lee-seung-gi-and-actress-lee-da-in-confirmed-dating", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210524_seungin.jpg?h=b69bd7d9&itok=j27uu55f", "publishedAt": "2021-05-24T07:55:00Z", "content": "A new Korean celebrity couple have just been outed: actor-singer Lee Seung-gi, 34, and actress Lee Da-in, 28.\r\nKorean media outlet Sports Kyunghyang reported today (May 24) that the two have been dat… [+1359 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "High-speed chase on expressway ends in crash at Punggol - AsiaOne", "description": "SINGAPORE - An 18-year-old man has been arrested after he tried to evade Traffic Police officers and led them on a high-speed chase on the expressway. He was caught when his vehicle eventually crashed into a road divider in Punggol. The incident happened in t…", "url": "https://www.asiaone.com/singapore/high-speed-chase-expressway-ends-crash-punggol", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210524_carcrash_youtube.jpg?h=5dbb1356&itok=iW4y_mQ0", "publishedAt": "2021-05-24T06:29:00Z", "content": "SINGAPORE - An 18-year-old man has been arrested after he tried to evade Traffic Police officers and led them on a high-speed chase on the expressway.\r\nHe was caught when his vehicle eventually crash… [+2004 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Ex-Project Superstar runner-up Shi Xinhui and Swedish husband welcome first child - AsiaOne", "description": "Who says the stuff of fairy tales can't happen? Ex-Project Superstar first runner-up Shi Xinhui had a serendipitous encounter with a Swedish traveller and their chance meeting blossomed into a long-distance romance. Now, the happily-married couple has welcome…", "url": "https://www.asiaone.com/entertainment/ex-project-superstar-runner-shi-xinhui-and-swedish-husband-welcome-first-child", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/shixinhui-hubby-baby_IG.jpg?h=061dbdad&itok=sRAIiYfc", "publishedAt": "2021-05-24T05:30:00Z", "content": "Who says the stuff of fairy tales can't happen?\r\nEx-Project Superstar first runner-up Shi Xinhui had a serendipitous encounter with a Swedish traveller and their chance meeting blossomed into a long-… [+2460 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dispute in Bedok leads to suspension of GrabFood rider - AsiaOne", "description": "Ride-hailing and delivery giant Grab has temporarily suspended a delivery rider who was caught on camera in an altercation with a woman. A video of the incident that occurred on a footpath at Block 535 Bedok North Street 3 was posted on Facebook. In the video…", "url": "https://www.asiaone.com/singapore/dispute-bedok-leads-suspension-grabfood-rider", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210524_grabdriver_stomp.jpg?h=d6f24ae5&itok=3Wzs1GXz", "publishedAt": "2021-05-24T05:08:40Z", "content": "Ride-hailing and delivery giant Grab has temporarily suspended a delivery rider who was caught on camera in an altercation with a woman.\r\nA video of the incident that occurred on a footpath at Block … [+1000 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "India passes 300,000 Covid-19 deaths: Health Ministry, South Asia News & Top Stories - The Straits Times", "description": "The South Asian nation's toll now stands at 303,720.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/asia/south-asia/india-passes-300000-covid-19-deaths-health-ministry", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/05/24/ak_indcov_240521.jpg?itok=3m8RYc7X", "publishedAt": "2021-05-24T04:35:13Z", "content": "NEW DELHI (AFP) - India said on Monday (May 24) that it had passed 300,000 deaths from the coronavirus pandemic, the third country after the United States and Brazil to hit the figure, as a huge wave… [+1081 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Bad news for BTS fans: The boyband's collab with McDonald's is coming out later than expected - AsiaOne", "description": "Sorry BTS fans, your much-anticipated McDonald's and BTS collaboration will have to wait. On Monday (May 24), McDonald's took to their social media platforms to announce that they will be shifting the launch of The BTS Meal from May 27 to June 21 instead. [em…", "url": "https://www.asiaone.com/lifestyle/bad-news-bts-fans-boybands-collab-mcdonalds-coming-out-later-expected", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/BTS%20and%20Macs.jpg?h=0429cc9e&itok=v4AdgjhS", "publishedAt": "2021-05-24T04:10:24Z", "content": "Sorry BTS fans, your much-anticipated McDonald's and BTS collaboration will have to wait. \r\nOn Monday (May 24), McDonald's took to their social media platforms to announce that they will be shifting … [+764 chars]"}, {"source": {"id": null, "name": "Tech Wire Asia"}, "author": "Joe Devanesan", "title": "China self-develops brain-computer interface to bypass US tech sanctions - Tech Wire Asia", "description": "Chinese researchers have had to be innovative to develop working brain-computer interface applications, despite tech supply chain limitations in recent", "url": "https://techwireasia.com/2021/05/china-self-develops-brain-computer-interface-to-bypass-us-tech-sanctions/", "urlToImage": "https://cdn.techwireasia.com/wp-content/uploads/2021/05/000_Hkg10184749.jpg", "publishedAt": "2021-05-24T02:54:58Z", "content": "<ul><li>Chinese researchers have had to be innovative to develop working brain-computer interface applications, despite tech supply chain limitations in recent years</li></ul>Neuralink, a US-based te… [+3369 chars]"}]}