{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I can't stop peeing! Is this pregnancy incontinence? - AsiaOne", "description": "Pregnancy incontinence is a problem many women face but often do not talk about. To some, it's embarrassing to have to deal with this when they are pregnant. It can be a huge concern as well. Pregnancy incontinence affects millions of women who have recently …", "url": "https://www.asiaone.com/lifestyle/i-cant-stop-peeing-pregnancy-incontinence", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/20223009_pregnant_pixabay.png?h=0429cc9e&itok=-Ry2TAVg", "publishedAt": "2022-10-02T12:00:00Z", "content": "Pregnancy incontinence is a problem many women face but often do not talk about. To some, it's embarrassing to have to deal with this when they are pregnant. It can be a huge concern as well.\r\nPregna… [+7259 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "RIP Jordans, Gucci: Singapore F1 concert revellers' expensive footwear ruined by mud at Padang - AsiaOne", "description": "Here's a piece of life advice your mum might not have told you: do not wear white shoes on a rainy day, and especially not when it's at the Formula One (F1) outdoor concert. Despite torrential rain pouring down on Saturday (Oct 1) — the second day of the thre…", "url": "https://www.asiaone.com/singapore/rip-jordans-gucci-singapore-f1-concert-revellers-expensive-footwear-ruined-mud-padang", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/f1ripshoesmud.jpeg?h=0429cc9e&itok=t7CbPXyr", "publishedAt": "2022-10-02T07:35:00Z", "content": "Here's a piece of life advice your mum might not have told you: do not wear white shoes on a rainy day, and especially not when it's at the Formula One (F1) outdoor concert.\r\nDespite torrential rain … [+1938 chars]"}, {"source": {"id": null, "name": "Asiannews.in"}, "author": "Asian News", "title": "The Art and Science of Fitness | The role of exercise in treating depression - Asian News", "description": "When I was growing up, and this would perhaps hold true for the rest of the dinosaurs out here, if we were to say that we were depressed, the treatment we received was a couple of slaps. We, as a society, had, at the time, become good at shoving issues of men…", "url": "https://asiannews.in/the-art-and-science-of-fitness-the-role-of-exercise-in-treating-depression/", "urlToImage": "https://images.hindustantimes.com/img/2022/10/01/1600x900/DepressionRepresentative_1664621133323_1664621133746_1664621133746.jpg", "publishedAt": "2022-10-01T12:29:28Z", "content": "When I was growing up, and this would perhaps hold true for the rest of the dinosaurs out here, if we were to say that we were depressed, the treatment we received was a couple of slaps. We, as a soc… [+6922 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I'm in hot water right now': Cooling measures leave some home owners in difficult spot - AsiaOne", "description": "SINGAPORE - Three weeks ago, estate officer Patrick Yew sold his one-bedroom condominium unit with the intention of buying a five-room Housing Board resale flat to live in with his ageing parents. But overnight, his plans have come crashing down. A fresh roun…", "url": "https://www.asiaone.com/singapore/im-hot-water-right-now-cooling-measures-leave-some-home-owners-difficult-spot", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/prop_0110_ST.jpg?h=0429cc9e&itok=NbV0HZiG", "publishedAt": "2022-10-01T00:15:23Z", "content": "SINGAPORE - Three weeks ago, estate officer Patrick Yew sold his one-bedroom condominium unit with the intention of buying a five-room Housing Board resale flat to live in with his ageing parents.\r\nB… [+4185 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Paris Fashion Week: A tribute to the late Japanese fashion great Issey Miyake - Channel NewsAsia", "description": "“We see design as a process driven by curiosity, built upon a comprehensive exploration – bringing joy, wonder, and hope to life, and of course with a touch of playfulness.\"", "url": "https://cnalifestyle.channelnewsasia.com/style-beauty/issey-miyake-womenswear-spring-summer-2023-paris-fashion-week-330561", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--MlAgsf0x--/c_crop,h_576,w_1024,x_0,y_8/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/10/01/ap22273447969235.jpg?itok=F4MGbypL", "publishedAt": "2022-09-30T23:10:14Z", "content": "The Japanese techno-fabric-loving house of Issey Miyake marked the end of an era on Friday (Sep 30), presenting its first collection since the death of the house founder. Fashion icon Issey Miyake di… [+329 chars]"}]}