{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "PAL eyes more flights from Middle East, US for holidays - BusinessWorld Online", "description": "FLAG carrier Philippine Airlines, Inc. (PAL) said it is ready to add more flights from the Middle East, the United States, Australia and various Asian countries as more overseas Filipinos are expected to fly home next month.", "url": "https://www.bworldonline.com/pal-eyes-more-flights-from-middle-east-us-for-holidays/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/08/Philippine-Airlines-PAL.jpg", "publishedAt": "2021-11-21T16:04:50Z", "content": "FLAG carrier Philippine Airlines, Inc. (PAL) said it is ready to add more flights from the Middle East, the United States, Australia and various Asian countries as more overseas Filipinos are expecte… [+2378 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "On the heels of last week's sea incident: Duterte to join ASEAN-China relations summit - BusinessWorld Online", "description": "PHILIPPINE President Rodrigo R. Duterte will join a Nov. 22 meeting between southeast Asian nations and China to discuss the future of the region’s relations with Beijing, his office said at the weekend.", "url": "https://www.bworldonline.com/duterte-to-join-asean-china-relations-summit/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/1-ASEAN-China-24thsummit-ASEAN.ORG_.jpg", "publishedAt": "2021-11-21T13:00:55Z", "content": "By Kyle Aristophere T. Atienza, ReporterandAlyssa Nicole O. Tan\r\nPHILIPPINE President Rodrigo R. Duterte will join a Nov. 22 meeting between southeast Asian nations and China to discuss the future of… [+5429 chars]"}, {"source": {"id": null, "name": "The A.V. Club"}, "author": "Dennis Perkins", "title": "Simu Liu and Bowen Yang compete to see whose \"Asian first\" is first - The A.V. Club", "description": "The Shang-Chi and SNL stars want everyone to know that it's no big deal, you guys", "url": "https://www.avclub.com/simu-liu-and-bowen-yang-compete-to-see-whose-asian-fir-1848098646", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8bca4e2e9f3d6f3464fb00ee3d66a0df.png", "publishedAt": "2021-11-21T11:43:00Z", "content": "Fellow Canadian-Asian actors Simu Liu and Bowen Yang have a number of things in common, certainly. Both raised in Canada. Both of Chinese descent. Both born around the same time. And both currently d… [+1890 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "MENG YEW CHOONG", "title": "Pan-Asian Railway closer to realisation - The Star Online", "description": "After 18 countries signed the Trans-Asian Railway Network Agreement in June 2006, the Kunming-Vientiane rail journey will be possible next month, which makes analysts wonder whether Malaysia is up to speed compared with its neighbours when it comes to rail ne…", "url": "https://www.thestar.com.my/news/focus/2021/11/21/pan-asian-railway-closer-to-realisation", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/21/1375724.jpg", "publishedAt": "2021-11-20T22:37:07Z", "content": "After 18 countries signed the Trans-Asian Railway Network Agreement in June 2006, the Kunming-Vientiane rail journey will be possible next month, which makes analysts wonder whether Malaysia is up to… [+9896 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Singapore's OCBC plans crypto bourse - Economic Times", "description": "Oversea-Chinese Banking Corp is considering whether to set up a crypto exchange as Southeast Asia's second-largest lender seeks to respond to customer needs, CEO Helen Wong said.", "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/singapores-ocbc-plans-crypto-bourse/articleshow/87811246.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87811271,width-1070,height-580,imgsize-286731,overlay-etmarkets/photo.jpg", "publishedAt": "2021-11-20T03:33:00Z", "content": "Oversea-Chinese Banking Corp. is considering whether to set up a crypto exchange as Southeast Asias second-largest lender seeks to respond to customer needs, Chief Executive Officer Helen Wong said.\r… [+1589 chars]"}]}