{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Asia's obsession with food and beauty has a dark side - BusinessWorld Online", "description": "AT A RECENT doctor’s visit, my endocrinologist admonished me for gaining two pounds. “You’re not obese” — I’m not even close — “but it’s something to watch,” he told me.", "url": "https://www.bworldonline.com/asias-obsession-with-food-and-beauty-has-a-dark-side/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/05/broccoli-measurement-tape-dish.jpg", "publishedAt": "2021-05-03T11:12:15Z", "content": "AT A RECENT doctors visit, my endocrinologist admonished me for gaining two pounds. Youre not obese Im not even close but its something to watch, he told me.\r\nI left the appointment equal parts indig… [+8011 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Philippines' top diplomat swears at China online, tells nation to leave disputed waters - The Online Citizen Asia", "description": "The Online Citizen Asia Philippines' top diplomat swears at China online, tells nation to leave disputed waters Asia", "url": "https://www.theonlinecitizen.com/2021/05/03/philippines-top-diplomat-swears-at-china-online-tells-nation-to-leave-disputed-waters/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/05/featured-image-Teddy-Twitter.png", "publishedAt": "2021-05-03T07:27:33Z", "content": "The Philippines’ top diplomat unambiguously told Beijing where to go on Monday, as the government insisted Chinese vessels were still illegally lingering in the disputed South China Sea.\r\n“China, my … [+2162 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I will kill you and your family': Singaporean teen charged with threatening EPL football player via Instagram - AsiaOne", "description": "SINGAPORE - A Singaporean teenager has been charged in court after threatening to kill football player Neal Maupay who is a forward with Brighton in the English Premier League. The court on Monday (May 3) heard that Derek Ng De Ren, now 19, is also accused of…", "url": "https://www.asiaone.com/singapore/i-will-kill-you-and-your-family-singaporean-teen-charged-threatening-epl-football-player", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210503_derekandneal_st%26ig.jpg?h=0429cc9e&itok=E3hNUD4F", "publishedAt": "2021-05-03T06:00:00Z", "content": "SINGAPORE - A Singaporean teenager has been charged in court after threatening to kill football player Neal Maupay who is a forward with Brighton in the English Premier League.\r\nThe court on Monday (… [+1697 chars]"}]}