{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "India Today World Desk", "title": "Watch: Joe Biden, Xi Jinping's surprise meet-and-greet at Asia Pacific meet - India Today", "description": "US President Joe Biden shook hands with his Chinese counterpart Xi Jinping during a summit of the Asia Pacific Economic Cooperation (APEC) forum in San Francisco.", "url": "https://www.indiatoday.in/world/story/joe-biden-xi-jinping-shake-hands-asia-pacific-economic-cooperation-meeting-san-francisco-2464922-2023-11-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202311/us-president-joe-biden-and-chinese-president-xi-jinping-shaking-hands-195101540-16x9_0.png?VersionId=wJG7nmbNUzwT9lilMry1U8uwAMJJfgI5", "publishedAt": "2023-11-19T12:46:29Z", "content": "A video has emerged of US President Joe Biden going up to his Chinese counterpart, Xi Jinping, to shake hands during a summit of the Asia Pacific Economic Cooperation (APEC) forum in San Francisco wh… [+1020 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "1st Nation To Establish Lunar Base, US Says China Could ‘Outpace’ NASA In Race To Moon - EurAsian Times", "description": "US intelligence has publicly expressed apprehensions about China potentially outpacing the United States in the race to send humans back to the moon and establish a lunar outpost, according to reports. Washington and Beijing are actively competing for an edge…", "url": "https://www.eurasiantimes.com/china-outpacing-nasa-in-space/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2022/06/nasa-scaled-e1655790841294.jpg", "publishedAt": "2023-11-18T16:10:43Z", "content": "US intelligence has publicly expressed apprehensions about China potentially outpacing the United States in the race to send humans back to the moon and establish a lunar outpost, according to report… [+4723 chars]"}]}