{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "AirAsia among the most actively traded as stock falls following fixing rights issue date, warrants price - The Edge Markets MY", "description": "KUALA LUMPUR (Nov 19): AirAsia Group Bhd, which was the third most actively traded stock on Bursa Malaysia on Friday, fell a day after the airline announced it had fixed the entitlement date for its renounceable rights issue of redeemable convertible unsecure…", "url": "https://www.theedgemarkets.com/article/airasia-among-most-actively-traded-stock-falls-following-fixing-rights-issue-date-warrants", "urlToImage": "https://assets.theedgemarkets.com/airasia_group_bhd_by_suhaimi_yusuf_20210308232622_theedgemarkets_2.jpg?CTGSa8v1fqlUKHAqeR3lGCLMmhNvGKbI", "publishedAt": "2021-11-19T09:21:14Z", "content": "KUALA LUMPUR (Nov 19): AirAsia Group Bhd, which was the third most actively traded stock on Bursa Malaysia on Friday, fell a day after the airline announced it had fixed the entitlement date for its … [+1441 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Airphysio Portable Mucus Removal Device For Atelectasis Symptom Relief Launched - AsiaOne", "description": "When diagnosed with an acute respiratory condition, even simple everyday tasks can be challenging. Life Wellness Healthcare has announced a non-invasive solution that can help people with lung diseases improve their quality of life. Tweed Heads, Australia - N…", "url": "https://www.asiaone.com/business/airphysio-portable-mucus-removal-device-atelectasis-symptom-relief-launched", "urlToImage": null, "publishedAt": "2021-11-19T07:00:00Z", "content": "When diagnosed with an acute respiratory condition, even simple everyday tasks can be challenging. Life Wellness Healthcare has announced a non-invasive solution that can help people with lung diseas… [+2712 chars]"}, {"source": {"id": null, "name": "Theasianparent.com"}, "author": "Sarmistha Neogy", "title": "Joanne Peh says she was conned by contractor while renovating her house - AsiaOne", "description": "Joanne Peh and her husband, Qi Yuwu, have been facing trouble in their house renovation work. Here's their story of struggle.", "url": "https://sg.theasianparent.com/house-renovation-work", "urlToImage": "https://s3.theasianparent.com/tap-assets-prod/wp-content/uploads/sites/12/2021/11/Untitled-design-2021-11-16T120109.016-650x322.jpg", "publishedAt": "2021-11-18T09:05:59Z", "content": "Handling renovation contractors can sometimes be a pain, especially if you are the kind that pays attention to every little detail. If you’ve renovated your home or have had to deal with contractors … [+4340 chars]"}]}