{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I didn't know when he'd lose his temper': Chantalle Ng says dad Huang Yiliang once caned her so badly she was hospitalised for a week - AsiaOne", "description": "There's a saying — spare the rod, spoil the child. But what if the physical punishment crosses the line and becomes something traumatic? On the latest episode of the meWATCH talk show Hear U Out, Chantalle Ng (daughter of veteran actress Lin Meijiao) shed som…", "url": "https://www.asiaone.com/entertainment/i-didnt-know-when-hed-lose-his-temper-chantalle-ng-says-dad-huang-yiliang-once-caned", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/chantalleng_mewatch.jpg?h=3df888d6&itok=1HKqaQy0", "publishedAt": "2021-09-24T10:17:00Z", "content": "There's a saying spare the rod, spoil the child. But what if the physical punishment crosses the line and becomes something traumatic?\r\nOn the latest episode of the meWATCH talk show Hear U Out, Chan… [+3216 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Carpark ward? Tan Tock Seng Hospital sheds light on viral video showing beds in makeshift area - AsiaOne", "description": "As the number of Covid-19 cases in Singapore continues to climb daily, a video showing the situation at Tan Tock Seng Hospital (TTSH) has attracted many people's attention. The 31-sec clip shared on Facebook on Thursday (Sept 23) showed patients lying on hosp…", "url": "https://www.asiaone.com/singapore/carpark-ward-tan-tock-seng-hospital-sheds-light-viral-video-showing-beds-makeshift-area", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/240921_ttsh.jpg?h=0429cc9e&itok=nYrkHPAT", "publishedAt": "2021-09-24T03:20:00Z", "content": "As the number of Covid-19 cases in Singapore continues to climb daily, a video showing the situation at Tan Tock Seng Hospital (TTSH) has attracted many people's attention.\r\nThe 31-sec clip shared on… [+2087 chars]"}]}