{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Ruturaj Gaikwad To Lead India At Asian Games; Yashasvi Jaiswal, Rinku Singh Named In Squad - NDTV Sports", "description": "Chennai Super Kings' star opener Ruturaj Gaikwad was on Friday named the captain of the Indian men's cricket team for the Asian Games in Hangzhou in China", "url": "https://sports.ndtv.com/cricket/ruturaj-gaikwad-to-lead-india-at-asian-games-yashasvi-jaiswal-rinku-singh-named-in-squad-4208766", "urlToImage": "https://c.ndtvimg.com/2022-06/ec370qk_ruturaj-gaikwad-bcci_625x300_15_June_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-07-14T18:18:00Z", "content": "Chennai Super Kings' star opener Ruturaj Gaikwad was on Friday named the captain of the Indian men's cricket team for the Asian Games in Hangzhou in China. While earlier reports had speculated that v… [+1813 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Mehul R Thakkar", "title": "Adani Properties to redevelop Dharavi, Asia's largest slum cluster - Moneycontrol", "description": "Dharavi, spread across 300 acre, is a hub of small-scale industries for medicines, leather, footwear, and clothing. Near Bandra Kurla Complex and south Mumbai.", "url": "https://www.moneycontrol.com/news/business/real-estate/adani-properties-to-redevelop-dharavi-asias-largest-slum-cluster-10963091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/04/dharavi-770x433.jpg", "publishedAt": "2023-07-14T17:23:46Z", "content": "The Maharashtra government has given final approval to the appointment of Adani Properties for the redevelopment of Dharavi, Asia's largest slum cluster located in Central Mumbai, the financial capit… [+1644 chars]"}, {"source": {"id": null, "name": "Asianetnews.com"}, "author": "Team Newsable", "title": "7 Liver-friendly foods for optimal health: Nourish your Liver naturally - Asianet Newsable ", "description": "Discover seven nutrient-rich foods that support liver health and promote optimal function. From leafy greens to turmeric and fatty fish, learn how these foods can help cleanse, protect, and nourish your liver for overall well-being.", "url": "https://newsable.asianetnews.com/lifestyle/7-liver-friendly-foods-for-optimal-health-nourish-your-liver-naturally-msw-eai-rxqibp", "urlToImage": "https://static-ai.asianetnews.com/images/01h57k5fw52c4xjkxqv92qbap3/liver_1200x630xt.jpg", "publishedAt": "2023-07-13T12:21:25Z", "content": "Discover seven nutrient-rich foods that support liver health and promote optimal function. From leafy greens to turmeric and fatty fish, learn how these foods can help cleanse, protect, and nourish y… [+3205 chars]"}]}