{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Nairametrics"}, "author": "Zainab Iwayemi", "title": "How Gautam Adani went from being a school dropout to becoming the richest man in India - Nairametrics", "description": "Gautam Adani is the richest man in India and across Asia. According to Bloomberg, he is the fifth on the", "url": "https://nairametrics.com/2022/05/11/how-gautam-adani-went-from-being-a-school-dropout-to-becoming-the-richest-man-in-india/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/05/Gautam-Adani-.jpg", "publishedAt": "2022-05-11T11:50:30Z", "content": "Gautam Adani is the richest man in India and across Asia. According to Bloomberg, he is the fifth on the world billionaire list with a net worth of N108 billion as of the 11th of May 2022, coming aft… [+3397 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Took me 11 days to pen this note without crying': Sharon Au's Paris apartment burglarised but her cat waited for her - AsiaOne", "description": "Imagine coming home to your apartment only to find it emptied and your favourite things taken. That's what happened to former Mediacorp actress Sharon Au who shared this in an emotional post today (May 11), adding it \"took me 11 days to pen this note, without…", "url": "https://www.asiaone.com/entertainment/took-me-11-days-pen-note-without-crying-sharon-au-paris-apartment-burglarised-her-cat-waited", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/sharonau_IG.jpg?h=e626e126&itok=7Ncqa4I7", "publishedAt": "2022-05-11T10:20:00Z", "content": "Imagine coming home to your apartment only to find it emptied and your favourite things taken.\r\nThat's what happened to former Mediacorp actress Sharon Au who shared this in an emotional post today (… [+982 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Malaysia central bank lifts key rate from all-time low on inflation risk - CNA", "description": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to recover from the COVID-19 pandemic.Bank Negara Malaysia (BNM) r…", "url": "https://www.channelnewsasia.com/business/malaysia-central-bank-lifts-key-rate-all-time-low-inflation-risk-2677786", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--b4IO0NSj--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-05-11t071306z_1_lynxnpei4a0a0_rtroptp_3_malaysia-economy-rates.jpg?itok=tvkbAlOw", "publishedAt": "2022-05-11T09:07:22Z", "content": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to rec… [+3096 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "MAZWIN NIK ANIS", "title": "Flight delays: Don't let it happen again, airline warned - The Star Online", "description": "PUTRAJAYA: With several public holidays coming, AirAsia must ensure that passengers will not be affected by flight delays and rescheduling again, says Datuk Seri Alexander Nanta Linggi.", "url": "https://www.thestar.com.my/news/nation/2022/05/11/flight-delays-don039t-let-it-happen-again-airline-warned", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/05/11/1581480.jpg", "publishedAt": "2022-05-11T08:53:00Z", "content": "PUTRAJAYA: With several public holidays coming, AirAsia must ensure that passengers will not be affected by flight delays and rescheduling again, says Datuk Seri Alexander Nanta Linggi (pic).\r\nThe Do… [+2762 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": "Ruth Abbey Gita-Carlos", "title": "Palace hails Padios for winning PH's 1st gold in Vietnam SEAG - pna.gov.ph", "description": "MANILA – Malacañang on Wednesday congratulated pencak silat athlete Francine Padios for delivering the Philippines’ first gold medal in the ongoing 31st Southeast Asian (SEA) Games in Hanoi, Vietnam.“The Palace congratulates Mary Francine Padios for bringing …", "url": "https://www.pna.gov.ph/articles/1174173", "urlToImage": "https://files01.pna.gov.ph/ograph/2019/02/14/malacaan-palace.jpg", "publishedAt": "2022-05-11T07:30:00Z", "content": "(Photo courtesy of the Philippine Sports Commission)\r\nMANILA – Malacañang on Wednesday congratulated pencak silat athlete Francine Padios for delivering the Philippines’ first gold medal in the ongoi… [+1693 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Miguel R. Camus", "title": "J.P. Morgan drops PH to bottom of Asean investment preference list after May 9 polls - INQUIRER.net", "description": "MANILA, Philippines — American financial services giant J.P. Morgan dropped the Philippines to the bottom of an investment list comprised of its Southeast Asian peers in a new report released", "url": "https://www.inquirer.net", "urlToImage": "https://business.inquirer.net/files/2022/05/JPMorgan-Chase-Co-620x419.jpg", "publishedAt": "2022-05-10T11:29:00Z", "content": "A view of the exterior of the JPMorgan Chase &amp; Co corporate headquarters in New York City May 20, 2015. REUTERS/Mike Segar\r\nMANILA, Philippines American financial services giant J.P. Morgan dropp… [+4782 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Their parents are younger than me': Dennis Chew on classmates, poly life and taking pay cut - AsiaOne", "description": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. So, how have the first few weeks of school been for the 48-year-old? Speaking to Shin Min Daily New…", "url": "https://www.asiaone.com/entertainment/their-parents-are-younger-me-dennis-chew-classmates-poly-life-and-taking-pay-cut", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/100522_Dennis%20Chew%20Plytechnic_SMDN.jpg?h=a30d54cd&itok=xO-JpSUV", "publishedAt": "2022-05-10T05:06:00Z", "content": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. \r\nSo, how have the first few weeks of s… [+2339 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Johnny Depp's ex-wife Amber Heard was diagnosed with 2 personality disorders. What are the signs? - Channel NewsAsia", "description": "During the ongoing court case between the two actors, a psychologist hired by Depp's team diagnosed Heard with both borderline personality disorder and histrionic personality disorder. How do these mental health conditions affect you if someone in your life h…", "url": "https://cnalifestyle.channelnewsasia.com/wellness/amber-heard-johnny-depp-personality-disorders-311661", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--OLqHHFYn--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/10/amber-heard-personality-disorders.jpg?itok=t3aSBZY3", "publishedAt": "2022-05-09T22:50:00Z", "content": "HOW DO PEOPLE WITH BPD BEHAVE?\r\nAs much as BPD patients fear being abandoned by their loved ones, especially their partners, they ironically display behaviours that make people leave them, said Dr Li… [+1071 chars]"}]}