{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": "Delfin Dioquino", "title": "E-Gilas back in action for FIBA Esports Open III - Rappler", "description": "E-Gilas Pilipinas, the Southeast Asia champion of the inaugural FIBA Esports Open, looks to repeat its winning ways over 5 other teams", "url": "https://www.rappler.com/sports/fiba/e-gilas-back-action-fiba-esports-open-2021", "urlToImage": "https://assets2.rappler.com/2020/11/e-gilas-pilipinas-fiba-esports-november-15-2020-1618385694370.jpg", "publishedAt": "2021-04-14T08:28:00Z", "content": "The Filipino crew is also comprised of Philippe Herrero IV, Aljon Cruzin, Custer Galas, Ian Santiago, Arnie Sison, and Clark Banzon."}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore braces for deluge of container ships sailing from Suez - The Star Online", "description": "SINGAPORE (Bloomberg): One of Asia’s busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/04/14/singapore-braces-for-deluge-of-container-ships-sailing-from-suez", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/14/1113285.jpg", "publishedAt": "2021-04-14T07:26:00Z", "content": "SINGAPORE (Bloomberg): One of Asias busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.\r\nLogjams and delays are expected to worsen in Singapore, which alre… [+955 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PSP's new chief criticises lack of contingency planning in PAP's leadership transition process - The Online Citizen Asia", "description": "The Online Citizen Asia PSP’s new chief criticises lack of contingency planning in PAP’s leadership transition process Politics", "url": "https://www.theonlinecitizen.com/2021/04/14/psps-new-chief-criticises-lack-of-contingency-planning-in-paps-leadership-transition-process/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/psp-francis.jpg", "publishedAt": "2021-04-14T06:06:58Z", "content": "The newly elected secretary-general of the Progress Singapore Party (PSP), Francis Yuen took to Facebook on Tuesday (13 Apr) to criticise the lack of contingency planning in the Peoples Action Partys… [+1630 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "International travel may resume in 2nd half of 2021. What should you expect? - AsiaOne", "description": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore — with a few conditions. When Singapore first announced its blanket advisory against overseas travel back in March 2020, the …", "url": "https://www.asiaone.com/lifestyle/international-travel-may-resume-2nd-half-2021-what-should-you-expect", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210414_travellers_st.jpg?h=0429cc9e&itok=48IkeWsH", "publishedAt": "2021-04-14T03:13:47Z", "content": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore with a few conditions.\r\nWhen Singapore first announced its blanke… [+7562 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Grab to list in US in record US$40b SPAC deal - The Edge Markets MY", "description": "(April 13):Grab Holdings Inc, Southeast Asia’s most valuable startup, is going public in the US through a merger with blank-cheque company Altimeter Growth Corp in what is the largest-ever deal of its kind.The Singapore-based startup is set to have a market v…", "url": "https://www.theedgemarkets.com/article/grab-agrees-worlds-biggest-spac-merger-valued-nearly-us40b", "urlToImage": "https://assets.theedgemarkets.com/CMB_Cover-web-Apr-14-2021.jpg?oZBMTVYINUlKgJ1tKZP24DZmzAF1Gn3D", "publishedAt": "2021-04-13T11:01:55Z", "content": "(April 13):Grab Holdings Inc, Southeast Asias most valuable startup, is going public in the US through a merger with blank-cheque company Altimeter Growth Corp in what is the largest-ever deal of its… [+5249 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "A look into alternative parties' positions on PAP's failed Prime Minister succession plan - The Online Citizen Asia", "description": "The Online Citizen Asia A look into alternative parties' positions on PAP's failed Prime Minister succession plan Politics", "url": "https://www.theonlinecitizen.com/2021/04/13/a-look-into-alternative-parties-positions-on-paps-failed-prime-minister-succession-plan/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/heng-swee-keat-apr-8-2021-press-conference-1-.jpg", "publishedAt": "2021-04-13T10:22:31Z", "content": "Deputy Prime Minister Heng Swee Keats announcement on Thursday (8 Apr) that he will not be running for the Prime Minister position shocked the country and has raised concerns not only among members o… [+10331 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dasmond Koh hints at possible bullying incident between Elvin Ng and NoonTalk artiste Angel Lim - AsiaOne", "description": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story. First, local celebrity host Danny Yeo chimed in over the weekend about his unpleasant experience with Taiwanese actor Patrick…", "url": "https://www.asiaone.com/entertainment/dasmond-koh-hints-possible-bullying-incident-between-elvin-ng-and-angel-lim", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/elvin-angel_IG.jpg?h=0429cc9e&itok=hchS82ZG", "publishedAt": "2021-04-13T06:35:00Z", "content": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story.\r\nFirst, local celebrity host Danny Yeo chimed in over the weekend… [+4704 chars]"}]}