{"articles": [{"author": "Rachel Treisman", "content": "Cameron Hunt and his father, Calvin Hunt, hold signs of support on Tuesday outside the West 43rd Street apartment building in Manhattan where a man physically and verbally attacked a 65-year-old Asia… [+6220 chars]", "description": "Video of the assault, as well as the seeming inaction of apartment staff standing nearby, has drawn fury in and beyond New York. State and city authorities are investigating the attack.", "publishedAt": "2021-03-30T17:40:00Z", "source": {"id": null, "name": "NPR"}, "title": "Asian American Woman, 65, Attacked In Manhattan In Racist Assault - NPR", "url": "https://www.npr.org/2021/03/30/982745950/attack-on-asian-woman-in-manhattan-as-bystanders-watched-to-be-probed-as-hate-cr", "urlToImage": "https://media.npr.org/assets/img/2021/03/30/gettyimages-1309958809_wide-d7a43d5ce2c60a3714eb39374cf076f83c4687a4.jpg?s=1400"}, {"author": "joshkelliott", "content": "WARNING: This story contains descriptions of violence that some may find disturbing. Please read at your own discretion.\r\nAuthorities in New York City are looking for one suspect after a 65-year-old … [+3880 chars]", "description": "The NYPD is searching for an unidentified man who kicked a 65-year-old woman several times on the street in New York City.", "publishedAt": "2021-03-30T14:46:06Z", "source": {"id": null, "name": "Global News"}, "title": "Asian woman, 65, brutally beaten in unprovoked attack on NYC street - Global News", "url": "https://globalnews.ca/news/7728072/asian-woman-attacked-new-york-city/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/03/attac.jpg?quality=85&strip=all&w=720&h=379&crop=1"}, {"author": null, "content": "When Mary Reid first heard about the mass shooting at three Atlanta massage parlours earlier this month, she felt heartbroken about the killing of eight people, six of whom were Asian women. However,… [+7483 chars]", "description": "This month's mass shooting in Atlanta comes amid an alarming spike in attacks against people of Asian heritage during the COVID-19 pandemic — prompting Canadian teachers to explore this disturbing thread as they tackle anti-racist education in their classroom…", "publishedAt": "2021-03-30T11:54:03Z", "source": {"id": "cbc-news", "name": "CBC News"}, "title": "How teachers are fighting damaging stereotypes in class amid spike in anti-Asian attacks - CBC.ca", "url": "https://www.cbc.ca/news/canada/education-anti-asian-racism-1.5968251", "urlToImage": "https://i.cbc.ca/1.5968284.1617035060!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/mary-reid.jpg"}, {"author": null, "content": "Jio-ing the right friend to partner you when you pick up a new sport is so important because they can make tough times seem like a breeze.\r\nAnd after watching the first episode of meWATCH's new serie… [+1995 chars]", "description": "Jio-ing the right friend to partner you when you pick up a new sport is so important because they can make tough times seem like a breeze. And after watching the first episode of meWATCH's new series #justswipelah, we can see why drama Ah Jie Zoe Tay is learn…", "publishedAt": "2021-03-30T06:22:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Vivian Lai flirts with skateboard instructors, kena suan by Zoe Tay - AsiaOne", "url": "https://www.asiaone.com/entertainment/vivian-lai-flirts-skateboard-instructors-kena-suan-zoe-tay", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210331_zoevivian.jpg?h=28e53560&itok=_khJ_j2i"}, {"author": null, "content": "KUALA LUMPUR (March 30): Ongoing travel restrictions and uncertainty over the Covid-19 situation are key concerns for analysts tracking low-cost carrier AirAsia Group Bhd when gauging the likelihood … [+3167 chars]", "description": "KUALA LUMPUR (March 30): Ongoing travel restrictions and uncertainty over the Covid-19 situation are key concerns for analysts tracking low-cost carrier AirAsia Group Bhd when gauging the likelihood of the airline’s recovery this year.According to MIDF Resear…", "publishedAt": "2021-03-30T03:33:20Z", "source": {"id": null, "name": "The Edge Markets MY"}, "title": "Analysts maintain 'sell' on AirAsia as recovery seen an uphill battle - The Edge Markets MY", "url": "https://www.theedgemarkets.com/article/analysts-maintain-sell-airasia-recovery-seen-uphill-battle", "urlToImage": "https://assets.theedgemarkets.com/20210205_TRA_PHOTOS OF AIR ASIA   AT KLIA 1_SY (1)_20210330113736_theedgemarkets.jpg?BvZjOyBvZcqBbHUGGzsCUdWfIqUoc4Kr"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "asia"}