{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Philippine Star"}, "author": "Franco Luna", "title": "Moreno unfazed by latest survey, says seeking 'people's endorsement' - Philstar.com", "description": "\"We can say that there was not enough traction as yet when Pulse Asia did its field work,\" Ramel said, pointing out that the latest Pulse Asia survey was conducted from January 19 to 24.", "url": "https://www.philstar.com/headlines/2022/02/14/2160800/moreno-unfazed-latest-survey-says-seeking-peoples-endorsement", "urlToImage": "https://media.philstar.com/photos/2022/02/14/dscf1745-1_2022-02-14_17-01-22.jpg", "publishedAt": "2022-02-14T10:08:00Z", "content": "MANILA, Philippines — The presidential campaign of Manila City Mayor Isko Moreno said it was unfazed by new survey results and endorsements, saying the most important endorsement would come from regu… [+3431 chars]"}, {"source": {"id": null, "name": "FXStreet"}, "author": "Anil Panchal", "title": "Gold Price Forecast: XAU/USD holds in bullish territory, Russia and FOMC minutes risks ahead - FXStreet", "description": "Gold (XAU/USD) prices seesaw around the three-month high flashed the previous day, taking rounds to $1,860 during Monday’s quiet Asian session. The ye", "url": "https://www.fxstreet.com/news/gold-price-forecast-xau-usd-grinds-below-1-873-hurdle-on-inflation-geopolitical-fears-202202132322", "urlToImage": "https://editorial.fxstreet.com/images/Markets/Commodities/Metals/Gold/safe-investment-gm147322399-17568598_Large.jpg", "publishedAt": "2022-02-14T02:35:00Z", "content": "Update: At $1,858, gold (XAU/USD) is flat in the Asian session in jittery markets at the start of the week. However, the yellow metal remains close to a 3-month peak as investors seek safety amidst w… [+3665 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": "Jelly Musico", "title": "Marcos, Duterte widen lead in Pulse Asia survey - pna.gov.ph", "description": "MANILA – Presidential candidate Ferdinand “Bongbong” Marcos Jr. and running mate Sara Duterte continued to be the top contenders for the May 9 elections, according to the latest survey conducted by Pulse Asia from Jan. 19 to 24 this year.Marcos widened his le…", "url": "https://www.pna.gov.ph/articles/1167684", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/02/14/marcos-sara.png", "publishedAt": "2022-02-14T02:27:00Z", "content": "Presidential candidate Ferdinand \"Bongbong\" Marcos and running mate Sara Duterte (File photo)\r\nMANILA – Presidential candidate Ferdinand “Bongbong” Marcos Jr. and running mate Sara Duterte continued … [+2278 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Stop hurting others' Li Jinglei hits back after Wang Leehom files court motion against her - AsiaOne", "description": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle. A Chinese netizen leaked documents last Friday (Feb 11), re…", "url": "https://www.asiaone.com/entertainment/stop-hurting-others-li-jinglei-hits-back-after-wang-leehom-files-court-motion-against", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/image_434.jpg?h=b82b5380&itok=C0Q4AdYo", "publishedAt": "2022-02-13T08:33:09Z", "content": "TAIPEI - After about two weeks of silence between singer Wang Leehom and his estranged wife Li Jinglei, both sides have once again exchanged words and accusations in their divorce and custody battle.… [+2244 chars]"}]}