{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Sports Desk", "title": "Asia Cup 2023 Final, India vs Sri Lanka, Colombo Weather Forecast, September 17: Rain threat remains but - Times of India", "description": "Cricket News: India and Sri Lanka finished the 'Super 4' stage with four points each to qualify for the final, but India finished on top by virtue of having a bette", "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-2023-final-india-vs-sri-lanka-colombo-weather-forecast-september-17-rain-threat-remains-but-reserve-day-in-place/articleshow/103725136.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-103725215,width-1070,height-580,imgsize-83678,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2023-09-17T03:02:00Z", "content": "Asia Cup Final, India vs Sri Lanka: India, Sri Lanka meet with bigger goals in mindIndia and Sri Lanka will face off in the Asia Cup final, with India considered favorites on paper. However, Sri Lank… [+182 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Sakshi Tiwari", "title": "Kim Jong-un ‘Checks Out’ MiG-31, Kinzhal Hypersonic Missile As Moscow, Pyongyang Cement Ties - EurAsian Times", "description": "North Korean leader Kim Jong Un, currently visiting Russia, inspected several state-of-the-art systems deployed in the ongoing Ukraine war, including the Kinzhal hypersonic missile, supersonic bombers, and the latest weapons mounted on the MiG-31 missile carr…", "url": "https://www.eurasiantimes.com/kim-jong-un-checks-out-mig-31-fighter-kinzhal-hypersonic/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2023/09/su-57.jpg", "publishedAt": "2023-09-16T18:24:21Z", "content": "North Korean leader Kim Jong Un, currently visiting Russia, inspected several state-of-the-art systems deployed in the ongoing Ukraine war, including the Kinzhal hypersonic missile, supersonic bomber… [+6499 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ritu Sharma", "title": "PLA Submarine ‘Missing’, China’s Defense Minister Underground, Speculations On Mishap Reignites - EurAsian Times", "description": "In August 2023, unconfirmed reports swirled about a Chinese nuclear-powered submarine meeting a serious mishap while transiting the Taiwan Strait, and all hands were reportedly lost. China’s Defense Ministry remained tight-lipped about it, but its defense min…", "url": "https://www.eurasiantimes.com/pla-submarine-missing-chinas-defense-minister-underground/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2022/09/Type-094A-strategic-nuclear-powered-ballistic-missile-submarine.jpg", "publishedAt": "2023-09-16T09:55:58Z", "content": "In August 2023, unconfirmed reports swirled about a Chinese nuclear-powered submarine meeting a serious mishap while transiting the Taiwan Strait, and all hands were reportedly lost. \r\nChinas Defense… [+6310 chars]"}]}