{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The-afc.com"}, "author": "AFC", "title": "AFC Asian Cup:Line-up for AFC Asian Cup China 2023™ Qualifiers Final Round unveiled - The Official Home of Asian Football", "description": "Kuala Lumpur: With two years to go to Asia’s flagship men’s national team tournament, the Asian Football Confederation (AFC) has today confirmed the 22 out of 24 teams who have advanced to the AFC Asian Cup China 2023™ Qualifiers Final Round.", "url": "https://www.the-afc.com/competitions/afc-asian-cup/news/line-up-for-afc-asian-cup-china-2023tm-qualifiers-final-round-unveiled", "urlToImage": "https://www.the-afc.com/img/image/upload/t_l10/v1598672665/ryrvcfaz1bg7ylbidagi.jpg", "publishedAt": "2021-06-16T07:29:44Z", "content": "Kuala Lumpur: With two years to go to Asias flagship mens national team tournament, the Asian Football Confederation (AFC) has today confirmed the 22 out of 24 teams who have advanced to the AFC Asia… [+1463 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Xiang Yun on Huang Wenyong, meeting husband Edmund Chen, cries after watching clips from celebs like Elvin Ng and Felicia Chin - AsiaOne", "description": "Xiang Yun is celebrating her 40th anniversary in showbiz and many of her colleagues are showering her with messages of encouragement. In fact, she was so touched that she even cried. On the Mediacorp series Just Swipe Lah, the 57-year-old talked about her ill…", "url": "https://www.asiaone.com/entertainment/xiang-yun-huang-wenyong-meeting-husband-edmund-chen-cries-after-watching-clips-celebs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/xiangyun_screengrab.jpg?h=3b1f7915&itok=e6YZNEle", "publishedAt": "2021-06-16T04:15:00Z", "content": "Xiang Yun is celebrating her 40th anniversary in showbiz and many of her colleagues are showering her with messages of encouragement.\r\nIn fact, she was so touched that she even cried.\r\nOn the Mediaco… [+3034 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Call the police': Woman without mask on bus taunts SBS Transit staff - AsiaOne", "description": "More than a year into the pandemic, some people in Singapore still refuse to abide by Covid-19 rules. On Monday (June 14) night, a woman made a scene aboard bus service 69 in Bedok as she refused to wear a face mask. A passenger told Shin Min Daily News that …", "url": "https://www.asiaone.com/singapore/call-police-woman-without-mask-bus-taunts-sbs-transit-staff-bedok", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/bedokbusnomask.jpg?h=0429cc9e&itok=ZKXjv0lN", "publishedAt": "2021-06-16T02:40:45Z", "content": "More than a year into the pandemic, some people in Singapore still refuse to abide by Covid-19 rules.\r\nOn Monday (June 14) night, a woman made a scene aboard bus service 69 in Bedok as she refused to… [+1485 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "PA's cancellation of planned meeting disappointing, says woman in Hari Raya wedding photo controversy - AsiaOne", "description": "SINGAPORE - The woman at the centre of a controversy over the misuse of her wedding photograph for Hari Raya Aidilfitri decorations has responded to the People's Association's (PA) decision to cancel a planned meeting, saying it was a missed opportunity for c…", "url": "https://www.asiaone.com/singapore/pas-cancellation-planned-meeting-disappointing-says-woman-hari-raya-wedding-photo", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/image_711.jpg?h=199d8c1f&itok=uQOQQrOx", "publishedAt": "2021-06-16T00:54:58Z", "content": "SINGAPORE - The woman at the centre of a controversy over the misuse of her wedding photograph for Hari Raya Aidilfitri decorations has responded to the People's Association's (PA) decision to cancel… [+3821 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Kath Sullivan", "title": "New agricultural visa to include South-East Asian workers but farmers remain unconvinced - ABC News", "description": "A new farm work visa will be offered to residents from 10 South-East Asian nations to help Australian farmers harvest their crops, but the the peak farm lobby says it will have to see it to believe it.", "url": "https://www.abc.net.au/news/2021-06-16/asean-agricultural-visa-uk-free-trade-agreement/100218744", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/6dd40ea4419c3b7bcae191b2ecb528ca?impolicy=wcms_crop_resize&cropH=1688&cropW=3000&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2021-06-15T23:54:09Z", "content": "A new farm work visa will be offered to residents from 10 South-East Asian countries to help Australian farmers harvest their crops, but the nation's peak farm lobby insists it will only believe it w… [+4405 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Delfin Dioquino", "title": "LIVE UPDATES: Philippines vs South Korea – FIBA Asia Cup Qualifiers 2021 - Rappler", "description": "Gilas Pilipinas shoots for its first win against South Korea in eight years as they tangle in the third and final window of the FIBA Asia Cup Qualifiers", "url": "https://www.rappler.com/sports/gilas-pilipinas/game-updates-philippines-south-korea-fiba-asia-cup-qualifiers-june-16-2021", "urlToImage": "https://assets2.rappler.com/2021/06/FIBA-June-14-2021-1623750128109.jpg", "publishedAt": "2021-06-15T10:49:00Z", "content": "The Filipinos last beat the Koreans in the 2013 FIBA Asia Championship, when a team led by Jimmy Alapag, Jayson Castro, and Marc Pingris propelled the country to the FIBA World Cup for the first time… [+12 chars]"}]}