{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "IND A vs Pak A Highlights, Emerging Asia Cup 2023 Final: Pakistan A Beat India A By 128 Runs To Retain Title - NDTV Sports", "description": "IND A vs Pak A Final Highlights: Fiery century by Tayyab Tahir, followed by a three-wicket haul from Sufiyan Muqeem guided Pakistan A to a massive 128-run victory over India A in the Emerging Asia Cup 2023 final on Sunday in Colombo.", "url": "https://sports.ndtv.com/cricket/india-a-vs-pakistan-a-live-score-acc-mens-emerging-asia-cup-2023-final-ind-a-vs-pak-a-live-cricket-score-4233504", "urlToImage": "https://c.ndtvimg.com/2023-07/49va1q4_pakistan-a-_625x300_23_July_23.jpg", "publishedAt": "2023-07-23T16:13:33Z", "content": "IND A vs PAK A, Emerging Asia Cup 2023 Final Highlights:Fiery century by Tayyab Tahir, followed by a three-wicket haul from Sufiyan Muqeem guided Pakistan A to a massive 128-run victory over India A … [+972 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "The Feed", "title": "Geophysicist's book 'The Next Supercontinent' envisions North America and Asia colliding in distant future - The Economic Times", "description": "Ross Mitchell takes readers on a captivating journey through remote and occasionally perilous lands in search of evidence of ancient supercontinents. He explores the fascinating phenomena that will give rise to the next supercontinent and present a compelling…", "url": "https://economictimes.indiatimes.com/news/international/us/geophysicists-book-the-next-supercontinent-envisions-north-america-and-asia-colliding-in-distant-future/articleshow/102056088.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102056124,width-1070,height-580,imgsize-41272,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-23T10:52:00Z", "content": "Geophysicist Ross Mitchell takes readers on an extraordinary journey in \"The Next Supercontinent,\" a captivating book that delves into the distant future when Earth's continents merge into a single l… [+3058 chars]"}]}