{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "From Harvard to Nasdaq listing: Grab CEO's ride to world's biggest SPAC deal - The Edge Markets MY", "description": "SINGAPORE (April 15): The CEO of Grab, a popular app to book taxis, order food and make payments in Southeast Asia, has always been determined to win -- from making his firm the best-funded regional start-up to defeating behemoth Uber Technologies.On Tuesday,…", "url": "https://www.theedgemarkets.com/article/harvard-nasdaq-listing-grab-ceos-ride-worlds-biggest-spac-deal", "urlToImage": "https://assets.theedgemarkets.com/Grab-1_reuters_15042021.jpg?A1eteerKRcTDO4rHtaBZ5QG3FZFh2Nhz", "publishedAt": "2021-04-14T23:52:03Z", "content": "SINGAPORE (April 15): The CEO of Grab, a popular app to book taxis, order food and make payments in Southeast Asia, has always been determined to win -- from making his firm the best-funded regional … [+4513 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore braces for deluge of container ships sailing from Suez - The Star Online", "description": "SINGAPORE (Bloomberg): One of Asia’s busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/04/14/singapore-braces-for-deluge-of-container-ships-sailing-from-suez", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/14/1113285.jpg", "publishedAt": "2021-04-14T07:26:00Z", "content": "SINGAPORE (Bloomberg): One of Asias busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.\r\nLogjams and delays are expected to worsen in Singapore, which alre… [+955 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "International travel may resume in 2nd half of 2021. What should you expect? - AsiaOne", "description": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore — with a few conditions. When Singapore first announced its blanket advisory against overseas travel back in March 2020, the …", "url": "https://www.asiaone.com/lifestyle/international-travel-may-resume-2nd-half-2021-what-should-you-expect", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210414_travellers_st.jpg?h=0429cc9e&itok=48IkeWsH", "publishedAt": "2021-04-14T03:13:47Z", "content": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore with a few conditions.\r\nWhen Singapore first announced its blanke… [+7562 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "K-drama scandal: CLOY's Kim Jung-hyun allegedly unprofessional because of controlling behaviour by ex Seo Yea-ji - AsiaOne", "description": "K-drama actor Kim Jung-hyun, 31, has been embroiled in one relationship scandal after another. Last week, it was rumoured that he has been dating his Crash Landing On You (2019) co-star Seo Ji-hye, 36, for a year, although both their management agencies have …", "url": "https://www.asiaone.com/entertainment/k-drama-scandal-cloy-s-kim-jung-hyun-allegedly-unprofessional-because-controlling", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/image_514.jpg?h=fee9b6f0&itok=b0we7Eve", "publishedAt": "2021-04-13T10:32:00Z", "content": "K-drama actor Kim Jung-hyun, 31, has been embroiled in one relationship scandal after another.\r\nLast week, it was rumoured that he has been dating his Crash Landing On You (2019) co-star Seo Ji-hye, … [+2215 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "A look into alternative parties' positions on PAP's failed Prime Minister succession plan - The Online Citizen Asia", "description": "The Online Citizen Asia A look into alternative parties' positions on PAP's failed Prime Minister succession plan Politics", "url": "https://www.theonlinecitizen.com/2021/04/13/a-look-into-alternative-parties-positions-on-paps-failed-prime-minister-succession-plan/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/heng-swee-keat-apr-8-2021-press-conference-1-.jpg", "publishedAt": "2021-04-13T10:22:31Z", "content": "Deputy Prime Minister Heng Swee Keats announcement on Thursday (8 Apr) that he will not be running for the Prime Minister position shocked the country and has raised concerns not only among members o… [+10331 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Dasmond Koh hints at possible bullying incident between Elvin Ng and NoonTalk artiste Angel Lim - AsiaOne", "description": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story. First, local celebrity host Danny Yeo chimed in over the weekend about his unpleasant experience with Taiwanese actor Patrick…", "url": "https://www.asiaone.com/entertainment/dasmond-koh-hints-possible-bullying-incident-between-elvin-ng-and-angel-lim", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/elvin-angel_IG.jpg?h=0429cc9e&itok=hchS82ZG", "publishedAt": "2021-04-13T06:35:00Z", "content": "Well, now that Elvin Ng has called out bullying in the showbiz industry, everyone is coming out of the woodwork with their own story.\r\nFirst, local celebrity host Danny Yeo chimed in over the weekend… [+4704 chars]"}]}