{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Shalinder Wangu", "title": "Russia, Central Asia to Attend Afghan Meet in India on Nov 10: Here’s What’s on Table - News18", "description": "The NSA-level dialogue will be the first-of-its-kind conference on the situation in Afghanistan after it was taken over by the Taliban in August.", "url": "https://www.news18.com/news/india/nsa-level-meet-on-afghanistan-on-nov-10-heres-whats-on-table-4418489.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/ajit-doval-1-163611054316x9.jpg", "publishedAt": "2021-11-08T11:55:00Z", "content": "Iran, Russia and all five Central Asian countries, including Tajikistan, Kyrgyzstan, Kazakhstan, Uzbekistan, and Turkmenistan, have confirmed that they will participate in the NSA level meeting on Af… [+3164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Energy Crisis In India, China That Helped Revive Coal Is Easing, For Now - NDTV", "description": "An energy crisis in two of Asia's key economies that caused power shortages and threatened slower growth is beginning to ease, though further risks remain.", "url": "https://www.ndtv.com/world-news/energy-crisis-in-india-china-that-helped-revive-coal-is-easing-for-now-2602634", "urlToImage": "https://c.ndtvimg.com/2021-11/5bpcrtf4_coal-bloomberg-new-650_625x300_08_November_21.jpg", "publishedAt": "2021-11-08T04:21:00Z", "content": "China and India pushed state-backed miners to accelerate coal output\r\nAn energy crisis in two of Asia's key economies that caused power shortages and threatened slower growth is beginning to ease, th… [+5509 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Australia begins Covid-19 vaccine booster roll-out as more curbs ease in Sydney - AsiaOne", "description": "SYDNEY - Australia will begin administering booster shots of Pfizer's Covid-19 vaccine from Monday (Nov 8) as millions in its largest city, Sydney, woke up to more freedom amid an accelerating immunisation drive against the coronavirus. Australia's vaccinatio…", "url": "https://www.asiaone.com/world/australia-begins-covid-19-vaccine-booster-roll-out-more-curbs-ease-sydney", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/20211108_booster_reuters.jpg?h=0429cc9e&itok=tPv6cJew", "publishedAt": "2021-11-08T01:41:31Z", "content": "SYDNEY - Australia will begin administering booster shots of Pfizer's Covid-19 vaccine from Monday (Nov 8) as millions in its largest city, Sydney, woke up to more freedom amid an accelerating immuni… [+1796 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Kaithreen Cruz", "title": "Group rallies support for smoking alternatives - The Manila Times", "description": "TOBACCO harm reduction advocate and Executive Director of the Coalition of Asia Pacific Harm Reduction Advocates Nancy Loucas urged officials of the World Health Organization (WHO)...", "url": "https://www.manilatimes.net/2021/11/08/news/national/group-rallies-support-for-smoking-alternatives/1821372", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/07/25138.jpg", "publishedAt": "2021-11-07T15:06:49Z", "content": "TOBACCO harm reduction advocate and Executive Director of the Coalition of Asia Pacific Harm Reduction Advocates Nancy Loucas urged officials of the World Health Organization (WHO) to stop turning a … [+2220 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Man in Brazil dies after jumping into piranha-infested lake to escape swarm of bees - AsiaOne", "description": "A man in Brazil reportedly died after jumping into a lake to escape a swarm of bees, only to be partially devoured by flesh-eating piranhas. His mangled body was found last Sunday (Oct 31), although it was initially unclear if he had died by drowning before b…", "url": "https://www.asiaone.com/world/man-brazil-dies-after-jumping-piranha-infested-lake-escape-swarm-bees", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/piranha-pexels-piya-nimityongskul.jpeg?h=10d202d3&itok=CJZ2Vpld", "publishedAt": "2021-11-07T05:27:00Z", "content": "A man in Brazil reportedly died after jumping into a lake to escape a swarm of bees, only to be partially devoured by flesh-eating piranhas.\r\nHis mangled body was found last Sunday (Oct 31), although… [+1450 chars]"}]}