{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Lifestyleasia.com"}, "author": null, "title": "BIGBANG reveals the date of their long-awaited comeback in April - Lifestyle Asia Singapore", "description": "BIGBANG and YG Entertainment have announced that the Korean boy band will make its long-awaited comeback this April. Here's what we know.", "url": "https://www.lifestyleasia.com/sg/culture/entertainment/bigbang-confirms-date-of-long-awaited-comeback-on-5-april-2022/", "urlToImage": "https://cdn.lifestyleasia.com/wp-content/uploads/sites/6/2022/03/21163711/bigbang-comeback-single-release-date-square.jpg", "publishedAt": "2022-03-21T09:00:00Z", "content": "The bands long-awaited comeback on 5 April 2022 has officially been confirmed by both BIGBANG and YG Entertainment’s official accounts.\r\nBIGBANG will return  and soon. Over the weekend, the social me… [+2783 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Include These 6 Healthy Lifestyle Habits to Avoid Obstructive Sleep Apnea - India.com", "description": "Dr Tilak Suvarna, Senior Interventional Cardiologist, Asian Heart Institute, Mumbai share a few healthy lifestyle habits that can help avoid obstructive sleep apnea (OSA).", "url": "https://www.india.com/health/include-these-6-healthy-lifestyle-habits-to-avoid-obstructive-sleep-apnea-5295079/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/03/sleeping-problems.png", "publishedAt": "2022-03-21T03:48:23Z", "content": "Do you feel lethargic even after a good night’s sleep? Do you wake up often during the night? Do you snore? If yes, then you may be suffering from a condition known as obstructive sleep apnoea (OSA).… [+3560 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Barbie Hsu and new husband DJ Koo finally meet in person after over 20 years - AsiaOne", "description": "TAIPEI - South Korean musician DJ Koo has been reunited with his new wife, Taiwanese actress Barbie Hsu, for the first time in more than 20 years. Koo, whose real name is Koo Jun-yup, was spotted by the Taiwanese media leaving his quarantine hotel around midn…", "url": "https://www.asiaone.com/entertainment/barbie-hsu-and-new-husband-dj-koo-finally-meet-person-after-over-20-years", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/20220321_barbie_weibo.jpg?h=9097d733&itok=xbkK9pDW", "publishedAt": "2022-03-21T01:16:10Z", "content": "TAIPEI - South Korean musician DJ Koo has been reunited with his new wife, Taiwanese actress Barbie Hsu, for the first time in more than 20 years.\r\nKoo, whose real name is Koo Jun-yup, was spotted by… [+2090 chars]"}]}