{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Newshub"}, "author": null, "title": "China warns of 'consequences' for New Zealand, Asia-Pacific countries if they move closer to NATO - Newshub", "description": "\"The sewage of the Cold War cannot be allowed to flow into the Pacific Ocean.\"", "url": "https://www.newshub.co.nz/home/politics/2022/06/china-warns-of-consequences-for-new-zealand-asia-pacific-countries-if-they-move-closer-to-nato.html", "urlToImage": "https://www.newshub.co.nz/home/politics/2022/06/china-warns-of-consequences-for-new-zealand-asia-pacific-countries-if-they-move-closer-to-nato/_jcr_content/par/video/image.dynimg.1280.q75.jpg/v1656456501361/GettyImages-1241584152-ardern-nato-1120.jpg", "publishedAt": "2022-06-28T22:48:26Z", "content": "The veiled threat comes as Prime Minister Jacinda Ardern attends a NATO leaders summit in Madrid, Spain, where member nations are expected to release a new Strategic Concept document, outlining their… [+2390 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Big crowds, big dreams: Meet Jeff Ng, the 'Cathay busker' who became a TikTok phenomenon - Channel NewsAsia", "description": "What’s the story behind the Singaporean busker whose performances have gone viral in recent weeks? CNA Lifestyle talked to Jeff Ng, aka JeffHelloMusic, about his musical journey from a cafe to Chinatown, and his plans for the future.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/cathay-busker-crowds-jeff-ng-jeffhellomusic-317906", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--hP0Zej7g--/c_crop,h_723,w_1285,x_108,y_180/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/06/28/dsc_4471_copy.jpg?itok=7zl89qNr", "publishedAt": "2022-06-28T22:40:00Z", "content": "He later worked as a waiter at the Ark Music Cafe, where he would sing along to the open mic performances while making drinks. His then-boss noticed his singing and urged him to audition to sing at t… [+851 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Reassessment Of Greenhouse Gas Emissions From African Lakes - Eurasia Review", "description": "The emissions of carbon dioxide (CO2) and methane (CH4) – the most potent greenhouse gases – into the atmosphere from African lakes are reassessed in a study undertaken by the Laborator…", "url": "https://www.eurasiareview.com/29062022-reassessment-of-greenhouse-gas-emissions-from-african-lakes/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2019/11/a-60.jpg?fit=800%2C445&ssl=1", "publishedAt": "2022-06-28T22:38:53Z", "content": "The emissions of carbon dioxide (CO2) and methane (CH4) – the most potent greenhouse gases – into the atmosphere from African lakes are reassessed in a study undertaken by the Laboratory of Chemical … [+4312 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Wasilat Azeez", "title": "BHM named third fastest-growing PR agency in Asia-Pacific, Africa - TheCable", "description": "BlackHouse Media (BHM) has been ranked as the third fastest growing agency in APMEA, according to PRovoke’s Global PR Agency Rankings ‘Fast Mover 2022.’", "url": "https://www.thecable.ng/bhm-named-third-fastest-growing-pr-agency-in-asia-pacific-africa", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2022/06/BHM.png", "publishedAt": "2022-06-28T16:13:00Z", "content": "BlackHouse Media (BHM), a Lagos-based reputation management and marketing communications firm, has been ranked as the third fastest-growing agency in Asia-Pacific, Middle East, and Africa (APMEA), ac… [+1925 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Raymond Lam, Richie Jen, Alec Su and Singaporean Huang Yida reportedly in rehearsals for Call Me By Fire 2 - AsiaOne", "description": "While participants of its sister series are making waves for the wrong reasons, the spark has been lit under Call Me By Fire 2. Filming of the hit Chinese singing reality TV show will reportedly begin tomorrow (June 29), according to Hong Kong media HK01 citi…", "url": "https://www.asiaone.com/entertainment/raymond-lam-richie-jen-alec-su-singaporean-huang-yida-rehearsals-call-me-by-fire", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2022/280622_raymondlamalecsu_insta.jpg?h=039f19f8&itok=PLRouRro", "publishedAt": "2022-06-28T10:36:00Z", "content": "While participants of its sister series are making waves for the wrong reasons, the spark has been lit under Call Me By Fire 2.\r\nFilming of the hit Chinese singing reality TV show will reportedly beg… [+2427 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "The impact of the euthanasia assessment procedure: a qualitative interview study among adults with psychiatric conditions - BMC Psychiatry - BMC Psychiatry", "description": "Background Assisted dying for adults with psychiatric conditions (APC) is highly controversial but legally possible in a few countries, including Belgium. Previous research has suggested that the complex euthanasia assessment procedure may cause additional su…", "url": "https://bmcpsychiatry.biomedcentral.com/articles/10.1186/s12888-022-04039-2", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12888.jpg", "publishedAt": "2022-06-27T10:47:35Z", "content": null}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Glenn Yong sleeps 4 hours a night to give parents a good life and landed house - AsiaOne", "description": "Since the release of Ah Girls Go Army, local actor Glenn Yong has become a rising star. While he’s certainly come a long way in terms of his career, the 25-year-old isn’t resting on his laurels. Just last month, he announced that he would be taking on a corpo…", "url": "https://www.asiaone.com/entertainment/glenn-yong-sleeps-4-hours-night-give-parents-good-life-landed-house-ah-girls-go-army", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2022/260622_Glenn%20Yong_IG.jpg?h=972ebfac&itok=PE_LwPtD", "publishedAt": "2022-06-27T06:31:00Z", "content": "Since the release of Ah Girls Go Army, local actor Glenn Yong has become a rising star. \r\nWhile hes certainly come a long way in terms of his career, the 25-year-old isnt resting on his laurels. Just… [+4029 chars]"}]}