{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "N Mahalakshmi", "title": "Sensex, Nifty stare at a gap-down opening today, as hot US CPI inflation roils global markets - Moneycontrol", "description": "Indian stock markets are likely to open with losses on February 14, following sharp fall in major US indices overnight and weakness in Asian markets this morning. Experts are in wait and watch mode for more data after US CPI inflation came in hotter than expe…", "url": "https://www.moneycontrol.com/news/business/markets/sensex-nifty-today-open-weak-global-domestic-cues-gift-nifty-in-red-12262431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/Market_down-770x433.jpeg", "publishedAt": "2024-02-14T01:18:43Z", "content": "After recovering yesterday from the meltdown over the previous two trading sessions, Indian stocks may see a precipitous fall today following negative cues from the US markets last night. All major U… [+3507 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Indonesia election: What the maps don't show about this Asian nation - BBC.com", "description": "The BBC’s Frances Mao explains why Indonesia's election is a big one to watch in a crucial region.", "url": "https://www.bbc.com/news/av/world-asia-68281092", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/131CA/production/_132628287_p0hblsx1.jpg", "publishedAt": "2024-02-13T23:03:47Z", "content": "Indonesia is probably larger than you think it is - much bigger than it looks on the world map. \r\nAnd with a population of about 275 million people, it's also the third-largest democracy in the world… [+131 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Heart disease hits South Asians earlier and harder. Blood vessel repairs offer clue as to why: study - CBC News", "description": "A potential reason why South Asians face a greater risk of heart disease than white people could be a diminished ability to repair blood vessel damage, according to a new Canadian study.", "url": "https://www.cbc.ca/news/health/heart-disease-south-asians-1.7112676", "urlToImage": "https://i.cbc.ca/1.7112668.1707784995!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/heart-research-model.JPG", "publishedAt": "2024-02-13T09:00:00Z", "content": "The timeline for heart disease is sped up in people of South Asian ethnicity, and part of the answer for why may lie with faulty repairs to blood vessel damage, a new Canadian study suggests.\r\nCardio… [+3889 chars]"}, {"source": {"id": null, "name": "Olympics.com"}, "author": "Ali Asgar Nalwala", "title": "Badminton Asia Team Championships 2024: Get schedule and watch live streaming in India - Olympics", "description": "PV Sindhu and HS Prannoy will lead India at the Badminton Asia Team Championships 2024. Get the Indian squad, schedule and know where to watch live streaming.", "url": "https://olympics.com/en/news/badminton-asia-team-championships-2024-india-live-streaming-schedule", "urlToImage": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/til07ujpjyc1ad6rhadx", "publishedAt": "2024-02-12T11:29:00Z", "content": "Two-time Olympic medallist PV Sindhu will lead the Indian womens team while HS Prannoy will spearhead the Indian mens charge in Malaysia. Watch live!"}]}