{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Minister Cancels China Asian Games Visit As Arunachal Players Denied Visa - NDTV", "description": "India on Friday filed a formal protest against China's \"deliberate and selective obstruction of sportspersons\" after Beijing denied visas and accreditation to athletes from Arunachal Pradesh.", "url": "https://www.ndtv.com/india-news/discrimination-against-arunachal-athletes-minister-anurag-thakur-cancels-asian-games-visit-to-china-4413580", "urlToImage": "https://c.ndtvimg.com/2022-05/v23vqdhg_2022-asian-games_625x300_06_May_22.jpeg", "publishedAt": "2023-09-22T12:06:31Z", "content": "New Delhi: India on Friday filed a formal protest against China's \"deliberate and selective obstruction of sportspersons\" after Beijing denied visas and accreditation to athletes from Arunachal Prade… [+2707 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Lim Hui Jie", "title": "Asia markets slide ahead of Bank of Japan rate decision - CNBC", "description": "The BOJ is expected to hold rates at -0.1%, but investors will be watching if the bank shifts its stance on other parts of its monetary policy, like its yield curve control policy.", "url": "https://www.cnbc.com/2023/09/22/asia-stock-markets-today-live-updates.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107278335-1690527835437-gettyimages-1559103286-JAPAN_BOJ.jpeg?v=1695340666&w=1920&h=1080", "publishedAt": "2023-09-22T01:45:00Z", "content": "Hong Kong's inflation rate stood at 1.8% in August, unchanged from the previous month and slightly lower than the 2% expected by economists polled by Reuters.\r\nThe city's statistics department said t… [+384 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Vijainder K Thakur", "title": "Ukraine’s ‘Biggest Ever’ Storm Shadow Attack Fails Miserably As Russia Learns From Sep 13 Missile Strikes - EurAsian Times", "description": "In an unprecedented daylight strike on September 20, Ukraine launched 8 Strom Shadows stealth cruise missiles from 11 Su-24M tactical bombers targeting Russia’s Black Sea Fleet (BSF) at Sevastopol. Despite the use of sophisticated tactics such as flying low o…", "url": "https://www.eurasiantimes.com/ukraines-biggest-ever-storm-shadow-attack-fails-miserably/", "urlToImage": "https://www.eurasiantimes.com/wp-content/uploads/2023/05/StormShadow-1.png", "publishedAt": "2023-09-21T05:26:24Z", "content": "In an unprecedented daylight strike on September 20, Ukraine launched 8 Strom Shadows stealth cruise missiles from 11 Su-24M tactical bombers targeting Russia’s Black Sea Fleet (BSF) at Sevastopol.\r\n… [+7402 chars]"}]}