{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Yen Nee Lee", "title": "Rising energy prices will squeeze company profits, says business consultant - CNBC", "description": "U.S. firms have a better chance at protecting their margins thanks to a \"very buoyant\" consumer market, said Richard Martin, managing director of IMA Asia.", "url": "https://www.cnbc.com/2021/10/13/rising-energy-prices-will-hurt-companies-profit-margins-ima-asia.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106867533-1618326244036-gettyimages-1230798297-AFP_8ZK6LP.jpeg?v=1634096170", "publishedAt": "2021-10-13T04:53:09Z", "content": "Rising energy prices will increase business costs and narrow profit margins of companies around the world, a management consultant said Wednesday.\r\nPrices of energy commodities including oil, natural… [+1073 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore teen who did backflip in rhino enclosure allegedly consumed cannabis while out on bail - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): A youth who was caught on video last December doing a backflip inside a white rhinoceros enclosure at the Singapore Zoo allegedly consumed cannabis while he was out on bail.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/10/13/singapore-teen-who-did-backflip-in-rhino-enclosure-allegedly-consumed-cannabis-while-out-on-bail", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/13/1329409.jpg", "publishedAt": "2021-10-13T04:23:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): A youth who was caught on video last December doing a backflip inside a white rhinoceros enclosure at the Singapore Zoo allegedly consumed cannabis wh… [+3021 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Petrol price climbs to new high in Singapore - except at SPC - AsiaOne", "description": "SINGAPORE - Pump prices have crept up to chalk new highs on the back of a post-pandemic recovery, although at least one operator here is resisting raising retail rates. China-owned SPC has not adjusted its pump prices since July 7, and is now posting markedly…", "url": "https://www.asiaone.com/singapore/petrol-price-climbs-new-high-singapore-except-spc", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/20211013_spc_st.jpg?h=4a809957&itok=l-Q8IWyc", "publishedAt": "2021-10-13T00:53:20Z", "content": "SINGAPORE - Pump prices have crept up to chalk new highs on the back of a post-pandemic recovery, although at least one operator here is resisting raising retail rates.\r\nChina-owned SPC has not adjus… [+3264 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Rappler.com", "title": "Q&A: Lenovo Asia Pacific president on consumer electronic trends - Rappler", "description": "Lenovo's Amar Babu tells us how consumer trends shifted during the pandemic, and how he sees them evolving as more people get vaccinated", "url": "https://www.rappler.com/technology/features/interview-lenovo-asia-pacific-president-amar-babu-october-2021", "urlToImage": "https://assets2.rappler.com/2021/03/lenovo-legion-s-7i-2-1633938516200.jpg", "publishedAt": "2021-10-11T08:05:00Z", "content": "In the past, accessories such as a good headset, microphone and laptop stands were seen as luxuries. Today, they are considered necessities in the online office and classroom. Midstream to higher end… [+213 chars]"}]}