{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Asianscientist.com"}, "author": "Asian Scientist Newsroom", "title": "Tapping Into Nature To Address Peritoneal Adhesion - Asian Scientist Magazine", "description": "Using pollen grains, the Singapore Institute of Technology (SIT) and local startup Sporogenics have teamed up to develop a hydrogel film with superior properties to prevent this post-surgery complication.", "url": "https://www.asianscientist.com/2023/01/sponsored-feature/sit-hydogels-for-post-surgery-peritoneal-adhesion/", "urlToImage": "https://www.asianscientist.com/wp-content/uploads/2023/01/230113_Hydrogel_Film0676_final-Cover-image_1024x607.jpeg", "publishedAt": "2023-01-30T02:27:24Z", "content": "AsianScientist (Jan. 30, 2023) The human abdomen is lined with a thin, continuous membrane layer called the peritoneum, which covers and protects the organs from friction against each other and the w… [+6022 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Meet 5 celebrity yoga instructors at Glow Festival who are leading the wellness scene - Channel NewsAsia", "description": "You might already have seen their work on Netflix, or read that their students include Deepak Chopra and Jane Fonda. Work out with these celebrity trainers – and know more about them – at the Glow Festival on Feb 4 to 12 at Marina Bay Sands.", "url": "https://cnalifestyle.channelnewsasia.com/wellness/glow-festival-2023-yoga-hiro-landazuri-jonah-kest-tara-stiles-amanda-bisk-sjana-elise-345876", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--YMKrHc_D--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/21/1.jpg?itok=4sizXLiG", "publishedAt": "2023-01-29T23:17:04Z", "content": "With their lithe and toned limbs, six-pack abs (but of course), winning smiles and impressive social media followings (we're talking millions here), its easy to want to emulate celebrity yoga instruc… [+664 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Is it the norm nowadays?' Diner charged 50 cents for milk in fish soup at Kopitiam food court, staff responds - AsiaOne", "description": "Being charged extra for takeaway containers isn't new, but what about for a regular ingredient in a dish? One bewildered customer recently highlighted they were charged 50 cents for the addition of evaporated milk to their bowl of fish soup. The experience wa…", "url": "https://www.asiaone.com/lifestyle/it-norm-nowadays-diner-charged-50-cents-milk-fish-soup-kopitiam-food-court-vivocity-staff-responds", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/receipt.jpeg?h=43f8d81d&itok=jeAEXmN-", "publishedAt": "2023-01-29T05:41:00Z", "content": "Being charged extra for takeaway containers isn't new, but what about for a regular ingredient in a dish?\r\nOne bewildered customer recently highlighted they were charged 50 cents for the addition of … [+3065 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'How can I see my child get hit and not do anything?' Police called in after maid and employer get into fight at home - AsiaOne", "description": "She had hired a maid to help care for her four children while she went to work. However, barely three months in, helper and employer got into a physical altercation at home, which was captured on CCTV cameras within the flat. The police were also called in. T…", "url": "https://www.asiaone.com/singapore/how-can-i-see-my-child-get-hit-not-do-anything-police-called-after-maid-employer-fight-home", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/fightmain.jpeg?h=0429cc9e&itok=Ll-cdia7", "publishedAt": "2023-01-29T03:58:00Z", "content": "She had hired a maid to help care for her four children while she went to work. However, barely three months in, helper and employer got into a physical altercation at home, which was captured on CCT… [+2881 chars]"}]}