{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Netizens question why POFMA directive was not issued to original source of 'Singapore variant' falsehood, but instead to social media platforms - The Online Citizen Asia", "description": "The Online Citizen Asia Netizens question why POFMA directive was not issued to original source of ‘Singapore variant’ falsehood, but instead to social media platforms Comments", "url": "https://www.theonlinecitizen.com/2021/05/20/netizens-question-why-pofma-directive-was-not-issued-to-original-source-of-singapore-variant-falsehood-but-instead-to-social-media-platforms/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/05/POFMA.jpg", "publishedAt": "2021-05-20T15:14:41Z", "content": "General correction directions under the Protection from Online Falsehoods and Manipulation Act (POFMA) Office have been issued to Facebook, Twitter and SPH Magazines over falsehoods about an unknown … [+3102 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "COVID-19 vaccines have spawned nine new billionaires: campaign group - The Online Citizen Asia", "description": "The Online Citizen Asia COVID-19 vaccines have spawned nine new billionaires: campaign group Health", "url": "https://www.theonlinecitizen.com/2021/05/20/covid-19-vaccines-have-spawned-nine-new-billionaires-campaign-group/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/12/featured-image-COVID-19-vaccine.png", "publishedAt": "2021-05-20T03:55:35Z", "content": "Profits from COVID-19 jabs have helped at least nine people become billionaires, a campaign group said Thursday, calling for an end to pharmaceutical corporations’ “monopoly control” on vaccine techn… [+2692 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Terence Cao invited only 5 guests to birthday party at home but friend invited more, court hears - AsiaOne", "description": "Local actor Terence Cao is facing a charge in court for breaking Covid-19 social distancing rules. But from what transpired during court proceedings yesterday (May 18), it appeared that wasn't his original intention. The court heard that Terence had initially…", "url": "https://www.asiaone.com/entertainment/terence-cao-invited-only-5-guests-birthday-party-home-friend-invited-more-court-hears", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210428_terence.jpeg?h=0b1efbb4&itok=5qTpj-Os", "publishedAt": "2021-05-19T10:38:00Z", "content": "Local actor Terence Cao is facing a charge in court for breaking Covid-19 social distancing rules. But from what transpired during court proceedings yesterday (May 18), it appeared that wasn't his or… [+1429 chars]"}]}