{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Edith M. Lederer", "title": "UN chief warns world is one step from `nuclear annihilation' - The Associated Press - en Español", "description": "UNITED NATIONS (AP) — The United Nations chief warned Monday that “humanity is just one misunderstanding, one miscalculation away from nuclear annihilation,” citing the war in Ukraine, nuclear threats in Asia and the Middle East and many other factors.", "url": "https://apnews.com/article/russia-ukraine-covid-health-antonio-guterres-2871563e530f9a676d7884b3e2d871c3", "urlToImage": "https://storage.googleapis.com/afs-prod/media/fc7f3ed4dba54bccbe77cf134df8d284/3000.jpeg", "publishedAt": "2022-08-01T15:59:58Z", "content": "UNITED NATIONS (AP) The United Nations chief warned Monday that humanity is just one misunderstanding, one miscalculation away from nuclear annihilation, citing the war in Ukraine, nuclear threats in… [+8252 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": "Neil", "title": "Philippines nabs 3 golds in ASEAN Para Games - BusinessWorld Online", "description": "SURAKARTA — Swimming delivered the country’s first pair of gold medals in the 11th Association of Southeast Asian Nations (ASEAN) Para Games Monday as Ernie Gawilan and Roland Sabido splashed their way to the top of their respective events at the Jatadiri Spo…", "url": "https://www.bworldonline.com/sports/2022/08/01/465242/philippines-nabs-3-golds-in-asean-para-games/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/08/para-games.jpg", "publishedAt": "2022-08-01T11:12:35Z", "content": "SURAKARTA Swimming delivered the countrys first pair of gold medals in the 11th Association of Southeast Asian Nations (ASEAN) Para Games Monday as Ernie Gawilan and Roland Sabido splashed their way … [+2643 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'The price is definitely not healthy': Pan Lingling and Xiang Yun are selling traditional mooncakes at $168 per box - AsiaOne", "description": "After teaming up to sell yusheng, Pan Lingling and Xiang Yun are back with another festive treat — traditional mooncakes at the hefty price of $168. While most mooncakes have a bad rep for being high in calories, the ones from Ju Xing Ji, Lingling's and Xiang…", "url": "https://www.asiaone.com/lifestyle/price-definitely-not-healthy-pan-lingling-and-xiang-yun-are-selling-traditional-mooncakes", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2022/010822_mooncake_ig%20%281%29.jpg?h=0429cc9e&itok=3u7vY3Af", "publishedAt": "2022-08-01T07:56:00Z", "content": "After teaming up to sell yusheng, Pan Lingling and Xiang Yun are back with another festive treat  traditional mooncakes at the hefty price of $168.\r\nWhile most mooncakes have a bad rep for being high… [+1685 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "3 years in the making: Naomi Neo shares update on long-awaited house with swimming pool - AsiaOne", "description": "Naomi Neo gave her followers a sneak peak at her new house and we are envious. In a TikTok post uploaded yesterday (July 31), the 26-year-old brought her four-year-old son Kyzo for a tour of their new home. In the caption, she shared that it has been nearly t…", "url": "https://www.asiaone.com/lifestyle/3-years-making-naomi-neo-shares-update-long-awaited-house-swimming-pool", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2022/220801_naomi%20and%20kyzo.png?h=0429cc9e&itok=pXOghauF", "publishedAt": "2022-08-01T07:14:00Z", "content": "Naomi Neo gave her followers a sneak peak at her new house and we are envious.\r\nIn a TikTok post uploaded yesterday (July 31), the 26-year-old brought her four-year-old son Kyzo for a tour of their n… [+1874 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "From Golden Mile to The Cathay: The Projector's long and 'organic' journey as Singapore's only indie cinema - Channel NewsAsia", "description": "What drives The Projector forward, and do the people behind it have a dream space they'd like to occupy next? Co-founder Karen Tan sat with CNA Lifestyle to tell us more (Hint: Think about old airports).", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/projector-golden-mile-cathay-singapore-cinema-karen-tan-323951", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--dfwGrcpq--/c_crop,h_843,w_1500,x_0,y_64/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/07/20/redrum_blue_mansion.jpeg?itok=iWQH9Kg8", "publishedAt": "2022-07-31T23:09:00Z", "content": "Moving on to the spaces that The Projector will be taking over: Their cinema halls at Golden Mile Tower can house about 550 audience members at any one time, while the Neon Room at Projector X: River… [+1839 chars]"}]}