{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Abigail Ng", "title": "Asia markets trade mixed amid recession fears; China to report trade data - CNBC", "description": "Asia-Pacific shares are poised to slip on Wednesday after major U.S. indexes fell more than 1% each overnight on concerns about a recession weigh on markets.", "url": "https://www.cnbc.com/2022/12/07/asia-markets-china-trade-australia-gdp-stocks-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107104311-1660624646118-gettyimages-1415096704-vcg111396525351.jpeg?v=1670370451&w=1920&h=1080", "publishedAt": "2022-12-07T02:19:00Z", "content": "Australia's economy grew by 0.6% from the previous quarter, official data showed missing estimates expecting a 0.7% quarterly growth predicted in a Reuters poll.\r\nThe latest gross domestic product sh… [+598 chars]"}, {"source": {"id": null, "name": "Amfar.org"}, "author": null, "title": "HIV Care Continuum & Beyond: A New Era for Asia - amfAR, The Foundation for AIDS Research", "description": "With amfAR as co-partner, an initiative to promote strengthening access to the HIV care continuum assesses what policies and programs are working.", "url": "https://www.amfar.org/news/hiv-care-continuum-beyond-a-new-era-for-asia/", "urlToImage": "https://www.amfar.org/wp-content/uploads/2022/12/HIV-Care-Continuum-Beyond-A-New-Era-for-Asia-White-Paper-SEO-1.jpg", "publishedAt": "2022-12-06T15:52:30Z", "content": "There are an estimated 6.0 million people living with HIV in the Asia-Pacific region. A quarter of new HIV infections are among young people aged 15 to 24, and almost all occur among members of key p… [+1231 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "US Modified HIMARS To Prevent Ukraine From Launching Long-Range ATACMS Missiles Into Russia — WSJ Report - EurAsian Times", "description": "US modified the powerful HIMARS rocket launchers it handed Ukraine so they cannot be used to launch long-range missiles, including ATACMS", "url": "https://eurasiantimes.com/us-modified-himars-to-prevent-ukraine-from-launching-russia/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/12/HIMARS-Ukraine-US-1.jpg", "publishedAt": "2022-12-06T10:30:38Z", "content": "The US quietly modified the powerful HIMARS rocket launchers it sent to Ukraine to prevent launching long-range missiles into Russia, reported WSJ. \r\nSince June, the United States has given the Ukrai… [+4129 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "William Ukpe", "title": "Nigeria moves to become gateway to AfCFTA, signs MoU with Vietnam - Nairametrics", "description": "The Nigerian government, in a bid to boost trade with South East Asia and maximize the African Continental Free Trade", "url": "https://nairametrics.com/2022/12/06/nigeria-wants-300-billion-exporter-vietnam-to-use-nigeria-as-a-gateway-to-afcfta-signs-mou/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/04/Yemi-Osinbajo.png", "publishedAt": "2022-12-06T08:17:08Z", "content": "The Nigerian government, in a bid to boost trade with South East Asia and maximize the African Continental Free Trade Area (AfCFTA) agreement, has announced plans to make $336 billion exporter Vietna… [+2423 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Orange is the new white: Priscilla Ku decks her Christmas tree with dozens of Hermes boxes - AsiaOne", "description": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas ‘tree’ to promote environmental causes, to people lighting up their homes with fairy lights. One woman who is giving th…", "url": "https://www.asiaone.com/entertainment/orange-new-white-priscilla-ku-decks-her-christmas-tree-dozens-hermes-boxes", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2022/221205_priscilla%20ku.png?h=7d6973a9&itok=TVOJuRuD", "publishedAt": "2022-12-05T10:24:00Z", "content": "For those who celebrate Christmas, decorations can be a big deal: from Mercedes-Benz bringing out a giant eight-metre interactive Christmas tree to promote environmental causes, to people lighting up… [+2670 chars]"}]}