{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Maya Yang", "title": "Russia-Ukraine war latest: what we know on day 207 of the invasion - The Guardian", "description": "Czech Republic calls for ‘special international tribunal’ after Izium mass grave found; Turkish and Indian leaders call for end to war at Asia summit", "url": "https://amp.theguardian.com/world/2022/sep/18/russia-ukraine-war-latest-what-we-know-on-day-207-of-the-invasion", "urlToImage": null, "publishedAt": "2022-09-18T01:47:00Z", "content": "<li>The Czech Republic, which currently holds the EU presidency, have called for a special international tribunal after a mass grave was discovered in Izium, a town in north-eastern Ukraine. In the 2… [+3319 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Street-style photographer: Leong Su Shan - Channel NewsAsia", "description": "Leong Su Shan could very well be Singapore’s first international street portrait photographer – and her snaps have graced magazines such as Vogue. Meet her in this week’s instalment of Creative Capital.", "url": "https://cnalifestyle.channelnewsasia.com/style-beauty/creative-capital-leong-su-shan-street-style-photographer-vogue-327591", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--lukSTIYo--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/09/13/hero_leong_su_san_photo_by_hanna_lassen_of_me_2_mod.png?itok=S_yVRg9H", "publishedAt": "2022-09-17T23:02:15Z", "content": "I am one of those people old enough to remember when Bill Cunningham was the worlds only famous street-style photographer. Cunningham spent close to four decades producing gorgeous candid fashion-dri… [+1741 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Noemi Lardizabal-Dado", "title": "AsiaBerlin Summit, connecting startup - The Manila Times", "description": "THE AsiaBerlin Summit held from September 12 to 16, celebrated 25 years of history, with opening ceremonies both in Japan and Berlin. An initiative of the Berlin Government (Berlin...", "url": "https://www.manilatimes.net/2022/09/18/business/sunday-business-it/asiaberlin-summit-connecting-startup/1858865", "urlToImage": "https://www.manilatimes.net/theme_manilatimes/images/TMTFB_1920x1008.jpg", "publishedAt": "2022-09-17T12:22:30Z", "content": "THE AsiaBerlin Summit held from September 12 to 16, celebrated 25 years of history, with opening ceremonies both in Japan and Berlin. An initiative of the Berlin Government (Berlin Senate Department … [+4461 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Singapore's 'Benjamin Button'? 50-year-old man is biologically just 27 - AsiaOne", "description": "\"Hashtag, 50 is the new 30,\" says Tiat Lim when asked about his age. And for Tiat, who turned half-a-century old early this year, the statement isn't a hollow one by a mid-lifer in denial either. After all, the man has been found to have successfully reversed…", "url": "https://www.asiaone.com/lifestyle/singapores-benjamin-button-50-year-old-man-biologically-just-27", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/tiatlimbeforeafter2.jpeg?h=0429cc9e&itok=lbqvLWJp", "publishedAt": "2022-09-17T12:00:00Z", "content": "\"Hashtag, 50 is the new 30,\" says Tiat Lim when asked about his age.\r\nAnd for Tiat, who turned half-a-century old early this year, the statement isn't a hollow one by a mid-lifer in denial either.\r\nA… [+7073 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "The reason why women still look pregnant after giving birth - AsiaOne", "description": "Do you find yourself wondering why you still look pregnant after giving birth? After giving birth, many mothers try to get back into shape only to be frustrated because it's not happening fast enough. In fact, some women look very much pregnant after giving b…", "url": "https://www.asiaone.com/lifestyle/reason-why-women-still-look-pregnant-after-giving-birth", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/220913_unsplash.jpg?h=0429cc9e&itok=kzeBMWnE", "publishedAt": "2022-09-17T08:00:00Z", "content": "Do you find yourself wondering why you still look pregnant after giving birth? \r\nAfter giving birth, many mothers try to get back into shape only to be frustrated because it's not happening fast enou… [+7111 chars]"}, {"source": {"id": null, "name": "TODAYonline"}, "author": null, "title": "National powerlifter overcomes fatigue from F&B work, calluses and illness to eye a 7th gold medal in the sport - TODAY", "description": "SINGAPORE — National powerlifter Matthias Yap pushed his way through calluses and illness, as well as regularly training while juggling a full time job, to \"lift\" himself into podium chances as the second seed for the Southeast Asian Cup.", "url": "https://www.todayonline.com/singapore/national-powerlifter-matthias-yap-eyes-7th-gold-medal-sport-1994216", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--sQfxxOKc--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/tdy/image/2022/09/16/20220915_ili_matthias_yap_powerlifter-1.jpg?itok=pcJxRUlv", "publishedAt": "2022-09-17T00:00:00Z", "content": "Yap is working in the food-and-beverage industry. It is his first job since graduating from the Singapore Hotel and Tourism Education Centre, where he pursued a Diploma in Pastry and Baking. \r\nHe exp… [+2727 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "India’s Adani briefly listed as world’s second-richest person - Punch Newspapers", "description": "Indian industrialist Gautam Adani briefly became the world's second-richest person on the Forbes real-time billionaire tracker on Friday, weeks after becoming the first Asian to break into the top three.", "url": "https://punchng.com/indias-adani-briefly-listed-as-worlds-second-richest-person/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/09/16142806/Gautam-Adani.jpg", "publishedAt": "2022-09-16T13:31:23Z", "content": "Indian industrialist Gautam Adani briefly became the world’s second-richest person on the Forbes real-time billionaire tracker on Friday, weeks after becoming the first Asian to break into the top th… [+2488 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "9 ancient Chinese sex positions to spice up your marriage - AsiaOne", "description": "Believe it or not, you probably tried different Chinese sex positions with your spouse or partner at some point. The names of the movements may not be familiar to you but once you read them, you'll know. Additionally, these classic-sounding Chinese sex positi…", "url": "https://www.asiaone.com/lifestyle/9-ancient-chinese-sex-positions-spice-your-marriage", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2022/220916_couple_pexels.jpg?h=0429cc9e&itok=JaPF0-ux", "publishedAt": "2022-09-16T13:00:00Z", "content": "Believe it or not, you probably tried different Chinese sex positions with your spouse or partner at some point. The names of the movements may not be familiar to you but once you read them, you'll k… [+5715 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Anthony Lim", "title": "Petronas officially launches Gentari – EV leasing via VaaS, 25,000 EV charging points in Asia-Pac by 2030 - paultan.org - Paul Tan's Automotive News", "description": "Following the announcement of its formation in June, clean energy solutions provider Gentari has now been officially introduced. The brand, which is fully-owned by Petronas, was launched last night by prime minister Datuk Seri Ismail …", "url": "https://paultan.org/2022/09/16/petronas-officially-launches-gentari-ev-leasing-via-vaas-25000-ev-charging-points-in-asia-pac-by-2030/", "urlToImage": "https://paultan.org/image/2022/09/Gentari_Launch_Malaysia-22-1200x800.jpg", "publishedAt": "2022-09-16T11:01:19Z", "content": "Following the announcement of its formation in June, clean energy solutions provider Gentari has now been officially introduced. The brand, which is fully-owned by Petronas, was launched last night b… [+2970 chars]"}]}