{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Yoonjung Seo", "title": "Asiana Airlines to stop selling seats near emergency exit on Airbus A321s - CNN", "description": "Asiana Airlines will no longer sell tickets for certain emergency exit seats of its Airbus A321-200 aircraft, the airline said Sunday, following a recent incident in which a man allegedly opened a jetliner door during a flight.", "url": "https://www.cnn.com/travel/article/south-korea-asiana-emergency-exit-seats-sales-stop-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230529113830-asiana-airlines-airbus-a321-200.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-29T04:50:00Z", "content": "Asiana Airlineswill no longer sell tickets for certain emergency exit seats of its Airbus A321-200 aircraft, the airline said Sunday, following a recent incident in which a man allegedly opened a jet… [+1458 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jihye Lee, Lim Hui Jie", "title": "Asia markets set to mostly rise after U.S. reached tentative debt ceiling deal over weekend - CNBC", "description": "U.S. President Joe Biden and congressional leaders reached a tentative deal on raising the debt ceiling.", "url": "https://www.cnbc.com/2023/05/29/asia-markets.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107247599-1685319324892-gettyimages-1175711976-cr029529_2019091921729279.jpeg?v=1685319421&w=1920&h=1080", "publishedAt": "2023-05-28T23:36:00Z", "content": "Singapore state-owned investor Temasek cut the compensation of senior management and its investment team responsible for the recommendation to invest in failed cryptocurrency exchange FTX.\r\n\"Although… [+679 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "Climate change may lead to massive tsunamis from Antarctica - study - The Jerusalem Post", "description": "A recent study found that massive tsunamis from Antarctica hit South America, New Zealand and Southeast Asia during two previous periods of global warming.", "url": "https://www.jpost.com/environment-and-climate-change/article-744460", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/526869", "publishedAt": "2023-05-28T18:25:00Z", "content": "Climate change may lead to massive tsunamis from Antarctica, according to a study published last week in the peer-reviewed Nature Communications journal.\r\nThe study explained that the tsunamis would … [+2534 chars]"}]}