{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Reuters", "title": "ASEAN ministers urge Myanmar to halt violence - ABS-CBN News", "description": "Southeast Asian foreign ministers urged Myanmar on Monday to halt violence, free prisoners and start its agreed dialogue during a meeting in China, while Singapore's top diplomat said the group was disappointed at its \"very, very slow progress\".", "url": "https://news.abs-cbn.com/overseas/06/08/21/asean-ministers-urge-myanmar-to-halt-violence", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/reuters/06/07/myanmar-politics.jpg", "publishedAt": "2021-06-07T16:26:00Z", "content": "Southeast Asian foreign ministers urged Myanmar on Monday to halt violence, free prisoners and start its agreed dialogue during a meeting in China, while Singapore's top diplomat said the group was d… [+3784 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Jamie Smyth", "title": "Global investors pressure Asian utilities to cut emissions - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/c1e59e76-3ba3-44d8-b939-15723a61047c", "urlToImage": null, "publishedAt": "2021-06-06T23:01:30Z", "content": "Expert insights, analysis and smart data help you cut through the noise to spot trends,\r\nrisks and opportunities.\r\nJoin over 300,000 Finance professionals who already subscribe to the FT."}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Solar Eclipse Visible On June 10 From UK, Canada And Greenland - Eurasia Review", "description": "An annular eclipse of the Sun will take place on June 10, visible from Canada, Greenland, the Arctic Ocean and Siberia. In the UK and Ireland observers will see a partial solar eclipse, w…", "url": "https://www.eurasiareview.com/07062021-solar-eclipse-visible-on-june-10-from-uk-canada-and-greenland/", "urlToImage": "https://i1.wp.com/www.eurasiareview.com/wp-content/uploads/2021/06/a-61.jpg?fit=800%2C450&ssl=1", "publishedAt": "2021-06-06T22:07:24Z", "content": "An annular eclipse of the Sun will take place on June 10, visible from Canada, Greenland, the Arctic Ocean and Siberia. In the UK and Ireland observers will see a partial solar eclipse, with up to tw… [+1716 chars]"}, {"source": {"id": null, "name": "The-afc.com"}, "author": "AFC", "title": "Asian Qualifiers – Group G Preview: Vietnam return to action against Indonesia, UAE locks horns with Thailand | Football | News | Asian Qualifiers 2022 - The Official Home of Asian Football", "description": "Dubai: A heated matchday in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023 awaits as Vietnam, the UAE and Thailand all go into their Monday games with a chance of being top of the group by end of the night.", "url": "https://www.the-afc.com/competitions/afc-asian-cup/news/asian-qualifiers-group-g-preview-vietnam-return-to-action-against-indonesia-uae-", "urlToImage": "https://www.the-afc.com/img/image/upload/t_l10/v1622926951/fop2dvcumzzdodkaj0mo.jpg", "publishedAt": "2021-06-06T10:06:17Z", "content": "Dubai: A heated matchday in Group G of the Asian Qualifiers for the FIFA World Cup Qatar 2022 and AFC Asian Cup China 2023 awaits as Vietnam, the UAE and Thailand all go into their Monday games with … [+3207 chars]"}]}