{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Live Updates, Asian Champions Trophy Hockey, India vs Korea: Mandeep Singh Scores | India 3-1 Korea In 4th Quarter - NDTV Sports", "description": "India vs Korea Asian Champions Trophy 2023 Highlights: India men's hockey team defeated Korea 3-2 in the Asian Champions Trophy match on Monday", "url": "https://sports.ndtv.com/hockey/india-vs-korea-asian-champions-trophy-hockey-2023-live-score-updates-4276560", "urlToImage": "https://c.ndtvimg.com/2023-08/jgsk2oc_sadsa_625x300_07_August_23.jpeg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-08-07T16:28:02Z", "content": "India vs Korea, Asian Champions Trophy 2023 Highlights: India maintained their dominance in the Asian Champions Trophy hockey tournament with a nervy 3-2 victory over South Korea. With 10 points from… [+626 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Warning sting on Asia's bee pollinators - Phys.org", "description": "Bee pollinators are a crucial link to food production and food security for more than have the world's population living in Asia—but few species have been closely studied or assessed for their range, numbers and conservation status.", "url": "https://phys.org/news/2023-08-asia-bee-pollinators.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/warning-sting-on-asias.jpg", "publishedAt": "2023-08-07T10:50:31Z", "content": "Bee pollinators are a crucial link to food production and food security for more than have the world's population living in Asiabut few species have been closely studied or assessed for their range, … [+3474 chars]"}, {"source": {"id": null, "name": "Asianews.network"}, "author": "Zhaki Abdullah, Zhaki Abdullah", "title": "Artificial intelligence developed to identify cancer mutations - Asia News NetworkAsia News Network - asianews.network", "description": "An AI-based approach could potentially perform the same task in a fraction of the time it would take a human expert, said Dr Skanderup.", "url": "https://asianews.network/artificial-intelligence-developed-to-identify-cancer-mutations/", "urlToImage": "https://asianews.network/wp-content/uploads/2023/08/2023-08-07_090510.jpg", "publishedAt": "2023-08-07T02:10:52Z", "content": "August 7, 2023\r\nSINGAPORE  – The development of personalised cancer treatments will get a boost from an artificial intelligence-based method that can identify cancer mutations in DNA fragments inside… [+4311 chars]"}]}