{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Cricketnext Staff", "title": "'Kam se Kam Hamaare Chairman ko Phone Karte': Wasim Akram Adds to BCCI-PCB Tussle Over Asia Cup 2023 - News18", "description": "Former Pakistan captain Wasim Akram has condemned Jay Shah’s statement, saying that India can’t dictate their way of playing cricket", "url": "https://www.news18.com/cricketnext/news/kam-se-kam-hamaare-chairman-ko-phone-karte-wasim-akram-adds-to-bcci-pcb-tussle-over-asia-cup-2023-6210967.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/08/wasim-akram-afp-166132776516x9.jpg", "publishedAt": "2022-10-21T03:50:47Z", "content": "BCCI secretary Jay Shahs statement about Indias visit to Pakistan for the 2023 Asia Cup has caused quite a stir in the neighbouring cricket fraternity. After the conclusion of the boards 91st Annual … [+2310 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "Ashish Dangwal", "title": "Ukraine Says 200+ Iranian UAVs Shot Down; Expert Admits Russian Drones Are Bleeding Kyiv Militarily & Financially - EurAsian Times", "description": "Moscow's extensive use of Iranian-made drones against Ukrainian targets is putting a great deal of strain on Ukraine's air defense systems, which are forced to use high-priced missiles to counter these low-cost drones.", "url": "https://eurasiantimes.com/killing-cheap-drones-with-million-dollars-worth-of-missiles-ukraine/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/09/IranDrone.jpg", "publishedAt": "2022-10-21T01:20:12Z", "content": "Russia’s extensive use of Iranian-made drones against Ukrainian targets puts a great deal of strain on Ukraine’s air defense systems, which are forced to use high-priced missiles to counter these low… [+7480 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Schooled by love: Singaporean couple returns to secondary school for wedding shoot - AsiaOne", "description": "In life, everyone wishes that they can have do-overs. Don't you wish you can travel back in time and improve your cherished memories? Like not acting like a babbling idiot on your first date with your secondary school sweetheart. Step aside Marty McFly, enter…", "url": "https://www.asiaone.com/lifestyle/schooled-love-singaporean-couple-returns-secondary-school-wedding-shoot", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2022/20221020_secschoolweddingshootbanner_tiktok.jpg?h=10d202d3&itok=xQzYtpCP", "publishedAt": "2022-10-20T10:00:15Z", "content": "In life, everyone wishes that they can have do-overs.\r\nDon't you wish you can travel back in time and improve your cherished memories? Like not acting like a babbling idiot on your first date with yo… [+2309 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Chef Sam Leong's son Joe now runs his own restaurant and he's doing one thing differently from his famous father - Channel NewsAsia", "description": "At Sonder, the young chef serves up elegant nostalgia-tinged dishes that honour his family’s generations of chefs that came before him, while forging his own path beyond his father’s shadow.", "url": "https://cnalifestyle.channelnewsasia.com/dining/chef-joe-leong-sonder-restaurant-sam-forest-336246", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--qOoX1aY8--/c_crop,h_1800,w_3200,x_0,y_53/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/10/17/_al_7765.jpg?itok=KZgdw5SO", "publishedAt": "2022-10-19T23:00:00Z", "content": "There might be some who will point to the fact that Leong was approached to open the restaurant by an old family friend who runs several companies, and say that he got his break because of his famous… [+880 chars]"}, {"source": {"id": null, "name": "HeritageDaily"}, "author": "HeritageDaily", "title": "Ancient genomes of thirteen Neandertals provide a rare snapshot of their community and social organisation - HeritageDaily", "description": "The first Neandertal draft genome was published in 2010. Since then, researchers from the Max Planck Institute for Evolutionary Anthropology have sequenced a further 18 genomes from 14 different archaeological sites throughout Eurasia. - HeritageDaily - Archa…", "url": "https://www.heritagedaily.com/2022/10/ancient-genomes-of-thirteen-neandertals-provide-a-rare-snapshot-of-their-community-and-social-organisation/145029", "urlToImage": "https://www.heritagedaily.com/wp-content/uploads/2022/10/shutterstock-1964610211-scaled.jpg", "publishedAt": "2022-10-19T21:15:29Z", "content": "The first Neandertal draft genome was published in 2010. Since then, researchers from the Max Planck Institute for Evolutionary Anthropology have sequenced a further 18 genomes from 14 different arch… [+5050 chars]"}]}