{"articles": [{"author": "Bob Yirka", "content": "A team of researchers from Universidade de São Paulo, Universidade Federal do Rio Grande do Sul and Universitat Pompeu Fabra, has found evidence of a genetic Australasian influence in more parts of S… [+3062 chars]", "description": "A team of researchers from Universidade de São Paulo, Universidade Federal do Rio Grande do Sul and Universitat Pompeu Fabra, has found evidence of a genetic Australasian influence in more parts of South America than just the Amazon. In their paper published …", "publishedAt": "2021-03-30T13:44:48Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Australasian genetic influence spread wider in South America than previously thought - Phys.org", "url": "https://phys.org/news/2021-03-australasian-genetic-wider-south-america.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/2-southamerica.jpg"}, {"author": "Rezaul H Laskar", "content": "India backs a regional process to be convened under the UN to achieve a political settlement and comprehensive ceasefire in Afghanistan as the situation in the war-torn country continues to be cause … [+5561 chars]", "description": "The external affairs minister made the remarks in Dushanbe while speaking at the ministerial meeting of the Heart of Asia-Istanbul Process, a regional initiative of 15 countries, including China, Russia, Iran and Central Asian states, to find a lasting soluti…", "publishedAt": "2021-03-30T10:06:49Z", "source": {"id": null, "name": "Hindustan Times"}, "title": "India backs UN-led initiative for ceasefire in Afghanistan: Jaishankar - Hindustan Times", "url": "https://www.hindustantimes.com/india-news/india-backs-un-led-initiative-for-ceasefire-in-afghanistan-jaishankar-101617098810055.html", "urlToImage": "https://images.hindustantimes.com/img/2021/03/30/1600x900/e374f088-9146-11eb-9899-db3d5d6a7e7e_1617102048085.jpg"}, {"author": null, "content": "Jio-ing the right friend to partner you when you pick up a new sport is so important because they can make tough times seem like a breeze.\r\nAnd after watching the first episode of meWATCH's new serie… [+1995 chars]", "description": "Jio-ing the right friend to partner you when you pick up a new sport is so important because they can make tough times seem like a breeze. And after watching the first episode of meWATCH's new series #justswipelah, we can see why drama Ah Jie Zoe Tay is learn…", "publishedAt": "2021-03-30T06:22:00Z", "source": {"id": null, "name": "AsiaOne"}, "title": "Vivian Lai flirts with skateboard instructors, kena suan by Zoe Tay - AsiaOne", "url": "https://www.asiaone.com/entertainment/vivian-lai-flirts-skateboard-instructors-kena-suan-zoe-tay", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2021/20210331_zoevivian.jpg?h=28e53560&itok=_khJ_j2i"}, {"author": "Gregg Keizer", "content": "There's nothing like $30,000 to show that an app has made it to the big time.\r\nMicrosoft last week underscored the importance of Teams to its current and future strategic planning by inaugurating a n… [+2056 chars]", "description": "The company has launched a new bug bounty program for Teams that offers as much as $30,000 to security researchers for previously-unknown vulnerabilities. It's a sign of the software's growing importance.", "publishedAt": "2021-03-30T00:00:22Z", "source": {"id": null, "name": "Computerworld"}, "title": "Microsoft elevates Teams' importance by offering top-dollar bug bounties - Channel Asia Singapore", "url": "https://www.computerworld.com/article/3613179/microsoft-elevates-teams-importance-by-offering-top-dollar-bug-bounties.html", "urlToImage": "https://images.idgesg.net/images/article/2020/09/digital_bugs_amid_binary_code_security_threats_malware_breach_hack_attack_by_whatawin_gettyimages-1188254819_2400x1600-100858616-large.jpg"}, {"author": "Travis Prasad, Travis Prasad", "content": "VANCOUVER -- \r\nHundreds of people gathered at the Vancouver Art Gallery on Sunday afternoon to rally against anti-Asian hate crimes.\r\nThe protest was organized by the Asian Canadian Equity Alliance.\r… [+2293 chars]", "description": "The demonstration was held simultaneously with rallies in several other Canadian cities, including Coquitlam, Victoria, and Toronto.", "publishedAt": "2021-03-29T02:10:00Z", "source": {"id": null, "name": "Ctvnews.ca"}, "title": "Hundreds join rally against anti-Asian hate crimes - CTV News Vancouver", "url": "https://bc.ctvnews.ca/hundreds-join-rally-against-anti-asian-hate-crimes-1.5366071", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5366050.1616981069!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "asia"}