{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "ign", "name": "IGN"}, "author": "Rebekah Valentine", "title": "Facebook Gaming Expands Its Cloud Platform to Most of US, Begins International Rollout - IGN SOUTH EAST ASIA", "description": "The free service now has over 25 games, including Assassin's Creed Rebellion.", "url": "https://sea.ign.com/assassins-creed-rebellion/173796/news/facebook-gaming-expands-its-cloud-platform-to-most-of-us-begins-international-rollout", "urlToImage": "https://sm.ign.com/t/ign_ap/news/f/facebook-g/facebook-gaming-expands-its-cloud-platform-to-most-of-us-beg_9fdc.1200.jpg", "publishedAt": "2021-07-01T16:30:04Z", "content": "Facebook Gaming has announced a broader rollout of its cloud gaming service, bringing support to over 98% of the mainland United States, and is beginning to open availability to users in Canada and M… [+1631 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "NTU students launch petition after many failed to secure accommodation, forced to vacate rooms by 15 July - The Online Citizen Asia", "description": "The Online Citizen Asia NTU students launch petition after many failed to secure accommodation, forced to vacate rooms by 15 July Education", "url": "https://www.theonlinecitizen.com/2021/07/01/ntu-students-launch-petition-after-many-failed-to-secure-accommodation-forced-to-vacate-rooms-by-15-july/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/ntu.jpg", "publishedAt": "2021-07-01T12:15:45Z", "content": "Many students of the Nanyang Technological University (NTU) were in uproar after failed to secure accommodation on campus for the upcoming academic year, and were forced to vacate their current rooms… [+4354 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "AGENCY", "title": "Hong Kong star Louis Koo to launch China-Korean girl group Skyle this month - The Star Online", "description": "The actor has formed a four-member girl group, selected from auditions held all over Asia.", "url": "https://www.thestar.com.my/lifestyle/entertainment/2021/07/01/hong-kong-star-louis-koo-to-launch-china-korean-girl-group-skyle-this-month", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/01/1205140.jpg", "publishedAt": "2021-07-01T12:00:00Z", "content": "Actor and film producer Louis Koo has formed a four-member girl group Skyle, which will make its debut in mid-July.\r\nThe members, who are from China and South Korea, have not been unveiled, although … [+1386 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Two sons of former president Ong Teng Cheong embroiled in court dispute over shareholding issues in family business - The Online Citizen Asia", "description": "The Online Citizen Asia Two sons of former president Ong Teng Cheong embroiled in court dispute over shareholding issues in family business Court Cases", "url": "https://www.theonlinecitizen.com/2021/07/01/two-sons-of-former-president-ong-teng-cheong-embroiled-in-court-dispute-over-shareholding-issues-in-family-business/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/Screenshot-2021-07-01-at-6.37.55-PM.png", "publishedAt": "2021-07-01T11:33:43Z", "content": "Disagreements over shareholdings related to a family business have prompted one of former Singapore president Ong Teng Cheong’s sons to sue his younger brother for minority oppression.\r\nOng Tze Guan,… [+2684 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Anti-vaxxer disinformation spreads in Asia, endangering millions - The Edge Markets MY", "description": "(July 1): Though Gerry Casida is on the priority list for a free Covid-19 vaccine in the Philippines because of his asthma, he’s isn’t planning to get the shot any time soon. A video he found on social media of a woman claiming vaccines are being used for gen…", "url": "https://www.theedgemarkets.com/article/antivaxxer-disinformation-spreads-asia-endangering-millions", "urlToImage": "https://assets.theedgemarkets.com/vaccine-pholippines-78465_bloomberg.jpg?Y1aVraZicPfi0JSSqqVdJGw7Hx_M9lOp", "publishedAt": "2021-07-01T05:16:16Z", "content": "(July 1): Though Gerry Casida is on the priority list for a free Covid-19 vaccine in the Philippines because of his asthma, hes isnt planning to get the shot any time soon. A video he found on social… [+6756 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anti-Vaxxer Disinformation Spreads in Asia, Endangering Millions - NDTV", "description": "Though Gerry Casida is on the priority list for a free Covid-19 vaccine in the Philippines because of his asthma, he's isn't planning to get the shot any time soon.", "url": "https://www.ndtv.com/world-news/anti-vaxxer-disinformation-spreads-in-asia-endangering-millions-2476596", "urlToImage": "https://c.ndtvimg.com/2021-07/ppvfoivg_covid-drivethru-vaccination-site-philippine-bloomberg_625x300_01_July_21.jpg", "publishedAt": "2021-07-01T04:59:56Z", "content": "Health worker directs a motorcycle taxi drivers at Covid drive-thru vaccination site set up at Philippine\r\nThough Gerry Casida is on the priority list for a free Covid-19 vaccine in the Philippines b… [+7396 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "Secret society: What the Chinese Communist Party doesn't want you to know - The Online Citizen Asia", "description": "The Online Citizen Asia Secret society: What the Chinese Communist Party doesn't want you to know China", "url": "https://www.theonlinecitizen.com/2021/07/01/secret-society-what-the-chinese-communist-party-doesnt-want-you-to-know/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/07/CCP.jpg", "publishedAt": "2021-07-01T02:58:16Z", "content": "China’s ruling Communist Party, which celebrates its 100th anniversary Thursday, is characterised by secrecy in leading the world’s second-biggest economic power from the shadows.\r\nFounded as an ille… [+4458 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Case closed: 'Cheek fillers' legal fight between Fann Wong and aesthetics doctor Siew Tuck Wah ends - AsiaOne", "description": "When Fann Wong appeared on Star Awards 2021 in April with pronounced cheeks, a local aesthetic doctor, Dr Siew Tuck Wah, wrote an opinion piece about it. He then received a letter of demand from a lawyer representing the actress' management. In a Facebook pos…", "url": "https://www.asiaone.com/entertainment/case-closed-cheek-fillers-legal-fight-between-fann-wong-and-aesthetics-doctor-siew-tuck-wah", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jun2021/fannwong-stw_IG.jpg?h=c208c3e0&itok=LqzbktPD", "publishedAt": "2021-07-01T02:00:00Z", "content": "When Fann Wong appeared on Star Awards 2021 in April with pronounced cheeks, a local aesthetic doctor, Dr Siew Tuck Wah, wrote an opinion piece about it.\r\nHe then received a letter of demand from a l… [+4263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Helen Regan, CNN", "title": "Singapore wants to stop counting Covid cases. Its roadmap could be a model for other countries - CNN ", "description": "As countries around the Asia-Pacific region tighten restrictions once again to curb potential breakouts of the Delta coronavirus variant, Singapore has laid out a new vision for life to return to normal.", "url": "https://www.cnn.com/travel/article/singapore-covid-plan-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629001836-singapore-covid-plan-intl-hnk-super-tease.jpg", "publishedAt": "2021-06-30T02:45:11Z", "content": "(CNN) As countries around the Asia-Pacific region tighten restrictions once again to curb potential breakouts of the Delta coronavirus variant, Singapore has laid out a new vision for life to return … [+6155 chars]"}]}