{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "When and How to Screen for Colorectal Cancer? New NCCN Patient Guideline Explains Latest Timing and Approaches - AsiaOne", "description": "National Comprehensive Cancer Network shares new guide on effective tools for preventing and early detection of colorectal cancer and reducing cancer death; providing patients and caregivers free access to the latest expert recommendations at NCCN.org/patient…", "url": "https://www.asiaone.com/business/when-and-how-screen-colorectal-cancer-new-nccn-patient-guideline-explains-latest-timing", "urlToImage": null, "publishedAt": "2021-12-01T13:37:00Z", "content": "National Comprehensive Cancer Network shares new guide on effective tools for preventing and early detection of colorectal cancer and reducing cancer death; providing patients and caregivers free acc… [+8246 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "KANG WAN CHERN", "title": "Singapore now Asia's priciest city as inflation adds to Omicron fears - The Straits Times", "description": "New Economist Intelligence Unit report puts Singapore up two places in its index to second globally.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/business/economy/singapore-now-asias-priciest-city-as-inflation-adds-to-omicron-fears", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/12/01/yq-sgcbd-01122021.jpg?itok=GcFzToTs", "publishedAt": "2021-12-01T11:26:34Z", "content": "SINGAPORE - Singapore is the most expensive Asian city to live in, with supply chain disruptions and rising fuel costs driving inflation to its highest level in years, noted a report on Wednesday (De… [+577 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I've kept my HIV diagnosis and sexuality a secret from my family for 9 years. Here's why - AsiaOne", "description": "Dec 1 marks World Aids Day, which is dedicated to raising awareness on acquired immunodeficiency syndrome (Aids) and human immunodeficiency virus (HIV).This year, the Joint United Nations Programme on HIV and Aids has adopted the tagline \"End inequalities. En…", "url": "https://www.asiaone.com/lifestyle/ive-kept-my-hiv-diagnosis-and-sexuality-secret-my-family-9-years-heres-why", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Dec2021/011221_hiv_pexels.jpg?h=2e181f1f&itok=QOzCucQ6", "publishedAt": "2021-12-01T05:25:00Z", "content": "Dec 1 marks World Aids Day, which is dedicated to raising awareness on acquired immunodeficiency syndrome (Aids) and human immunodeficiency virus (HIV).This year, the Joint United Nations Programme o… [+7030 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Eustance Huang", "title": "Asia-Pacific stocks bounce as investors assess omicron Covid variant concerns; oil prices jump nearly 4% - CNBC", "description": "Major markets across Asia-Pacific bounced back on Wednesday, with South Korean stocks leading gains regionally.", "url": "https://www.cnbc.com/2021/12/01/asia-markets-wall-street-chinese-economy-federal-reserve-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106960916-1634274081377-gettyimages-1234768766-AFP_9LD9J8.jpeg?v=1638333252", "publishedAt": "2021-11-30T23:40:46Z", "content": "SINGAPORE Major markets across Asia-Pacific bounced back on Wednesday, following losses the day before that were triggered by renewed uncertainty on the omicron Covid variant.\r\nSouth Korea's Kospi le… [+2464 chars]"}]}