{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Telangana Today"}, "author": "Telanganatoday", "title": "New Omicron variant BA 2.2 on the watch - Telangana Today", "description": "Hyderabad: There are worrying signs on the horizon, as countries in Europe and Asia are now grappling with the rise of a new sub-lineage of BA 2 Omicron variant of the coronavirus, which has been unofficially christened as BA 2.2. After enduring the Omicron d…", "url": "https://telanganatoday.com/new-omicron-variant-ba-2-2-on-the-watch", "urlToImage": "https://telanganatoday.com/wp-content/uploads/2022/03/COVID-4.jpeg", "publishedAt": "2022-03-11T17:38:40Z", "content": null}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Sezairi celebrates becoming first Singapore artiste to hit 100 million streams on Spotify - Channel NewsAsia", "description": "In an Instagram post announcing the news, the local singer said he wrote It’s You “with the conscious thought that I wanted to turn my life around and be a better person, husband, lover and human being”.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/sezairi-its-you-spotify-100-million-streams-307011", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--XG4L_u75--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/sezairi---1872186.jpg?itok=E7babeZv", "publishedAt": "2022-03-11T04:17:00Z", "content": "Local singer Sezairi Sezali had a big announcement to make earlier this week. In a social media post on Monday (Mar 7), he wrote that he was the first Singapore artist to have 100 million streams for… [+533 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Gary Chaw curses repeatedly in restaurant and he's not apologising - AsiaOne", "description": "In a YouTube video uploaded on March 9 that has gone viral overnight, a man — not seen in the clip — could be heard cursing angrily for almost a minute. What makes it so sensational is that the title of the video says the man is a singer who was drunk. \"What …", "url": "https://www.asiaone.com/entertainment/gary-chaw-curses-repeatedly-restaurant-and-hes-not-apologising", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/20220310_gary.jpg?h=b60d0d99&itok=2azkte-Q", "publishedAt": "2022-03-10T11:48:00Z", "content": "In a YouTube video uploaded on March 9 that has gone viral overnight, a man  not seen in the clip  could be heard cursing angrily for almost a minute.\r\nWhat makes it so sensational is that the title … [+2486 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Star Awards 2022: Chantalle Ng and Xu Bin nominated for Favourite CP, Top 40 Most Popular Artistes revealed - AsiaOne", "description": "The annual extravaganza of the local entertainment scene is just around the corner and it is none other than the glitzy Star Awards 2022. To add to all the buzz and excitement, the list of nominees for the Top 40 Most Popular Artistes categories was unveiled …", "url": "https://www.asiaone.com/entertainment/star-awards-2022-chantalle-ng-xu-bin-nominated-favourite-cp-top-40-most-popular", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Mar2022/20220310%20Star%20Awards%202022.jpg?h=c8bad6ec&itok=v3VAXILt", "publishedAt": "2022-03-10T11:43:00Z", "content": "The annual extravaganza of the local entertainment scene is just around the corner and it is none other than the glitzy Star Awards 2022. \r\nTo add to all the buzz and excitement, the list of nominees… [+5392 chars]"}]}