{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Bloomberg", "title": "Gautam Adani surpasses Mukesh Ambani as Asia’s richest person - Mint", "description": "In barely three years, Adani has gained control of seven airports and almost a quarter of India’s air traffic.Gautam Adani is a survivor of crises. More than two decades ago, he was kidnapped and held for ransom. In 2008, he was among the hostages at Mumbai’s…", "url": "https://www.livemint.com/companies/news/gautam-adani-surpasses-mukesh-ambani-as-asia-s-richest-person-11644277925576.html", "urlToImage": "https://images.livemint.com/img/2022/02/08/600x338/Gautam_Adani_1644279584181_1644279584276.JPG", "publishedAt": "2022-02-08T00:21:52Z", "content": "Gautam Adani, the Indian billionaire who turned a small commodities trading business into a conglomerate spanning ports, mines and green energy, is now Asias richest person.\r\nThe 59-year-old moguls n… [+5528 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Fann Wong releasing bilingual children's picture books she illustrated - AsiaOne", "description": "Actress, model, mother, home baker and illustrator extraordinaire Fann Wong will be releasing two of four bilingual children's picture books that she wrote and illustrated on Thursday (Feb 10). Aside from starting her bakery Fanntasy during the Covid-19 pande…", "url": "https://www.asiaone.com/entertainment/fann-wong-releasing-bilingual-childrens-picture-books-she-illustrated", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Feb2022/070222_fannwongbook2_instagram.jpg?h=52494307&itok=QQwK-vRT", "publishedAt": "2022-02-07T11:07:00Z", "content": "Actress, model, mother, home baker and illustrator extraordinaire Fann Wong will be releasing two of four bilingual children's picture books that she wrote and illustrated on Thursday (Feb 10).\r\nAsid… [+3226 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Does Wearing a Hat Effect Hair Loss Problem? - AsiaOne", "description": "Can wearing a hat really rub the hair follicles on your head so much that it causes your hair to fall out? Possibly, but there’s not much science to support the idea. Mystic, United States - February 7, 2022 /MarketersMEDIA/ — Can wearing a hat really rub the…", "url": "https://www.asiaone.com/business/does-wearing-hat-effect-hair-loss-problem", "urlToImage": null, "publishedAt": "2022-02-07T11:04:55Z", "content": "Can wearing a hat really rub the hair follicles on your head so much that it causes your hair to fall out? Possibly, but theres not much science to support the idea.\r\nMystic, United States - February… [+3627 chars]"}]}