{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Man spent over a month convincing bed-bound mum to get Covid-19 jab - AsiaOne", "description": "SINGAPORE - It took Mr Soh Thiam Huat more than a month to convince his bed-bound mother to get the Covid-19 vaccine. His 83-year-old mother Ang Kim Kee had fractured her hip bone after a fall last year. She was initially reluctant to take the vaccine, fearin…", "url": "https://www.asiaone.com/singapore/man-spent-over-month-convincing-bed-bound-mum-get-covid-19-jab", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/20210830_bedridden_st_0.jpg?h=0429cc9e&itok=cNNzf2lw", "publishedAt": "2021-08-30T02:20:25Z", "content": "SINGAPORE - It took Mr Soh Thiam Huat more than a month to convince his bed-bound mother to get the Covid-19 vaccine.\r\nHis 83-year-old mother Ang Kim Kee had fractured her hip bone after a fall last … [+3283 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Sunil Jagtiani", "title": "Asia Stocks Steady as Traders Mull Powell Remarks: Markets Wrap - Yahoo Finance", "description": "(Bloomberg) -- Asian stocks rose Monday and Treasuries held an advance, bolstered by Jerome Powell’s signal that pandemic-era Federal Reserve policy support ...", "url": "https://finance.yahoo.com/news/stocks-set-climb-powell-dovish-213955371.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/PVfPhIjRsvYH.rWBkwrGoQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/HDc4sOsaB9CXy7HZ5LzwsA--~B/aD0xMzM0O3c9MjAwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/bloomberg_markets_842/d60022dbd8c1a7075f658121fd7de23c", "publishedAt": "2021-08-30T00:22:30Z", "content": "(Bloomberg) -- Asian stocks rose Monday and Treasuries held an advance, bolstered by Jerome Powells signal that pandemic-era Federal Reserve policy support will be withdrawn cautiously and gradually.… [+3030 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Phillip Inman", "title": "Recovery in global trade hit by Covid outbreaks in east Asia - The Guardian", "description": "Decline in exports from Taiwan combines with port closures in China and Japan to hinder growth", "url": "https://amp.theguardian.com/business/2021/aug/29/recovery-in-global-trade-hit-by-covid-outbreaks-in-east-asia", "urlToImage": null, "publishedAt": "2021-08-29T19:56:00Z", "content": "International tradeDecline in exports from Taiwan combines with port closures in China and Japan to hinder growth\r\nA recovery in global trade during the summer is beginning to wane, according to some… [+3898 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'I don't know how long I cried': Dasmond Koh opens up on how he broke down after Aloysius Pang's death - AsiaOne", "description": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him. The boss of Noontalk Media choked up on the latest episode of Hear U Out, a talk show hosted by Quan Yifeng, when he s…", "url": "https://www.asiaone.com/entertainment/i-dont-know-how-long-i-cried-dasmond-koh-opens-how-he-broke-down-after-aloysius-pangs", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Aug2021/image_1262.jpg?h=72faa102&itok=vxK5MmfZ", "publishedAt": "2021-08-29T01:43:58Z", "content": "SINGAPORE - Actor-host Damond Koh, who was the mentor of Aloysius Pang, has opened up about how the death of the young actor devastated him.\r\nThe boss of Noontalk Media choked up on the latest episod… [+1490 chars]"}]}