{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "EurAsian Times Desk", "title": "Su-27 Fighter Pilots That ‘Downed’ US MQ-9 Reaper Drone Nominated For State Awards: Moscow - EurAsian Times", "description": "Russian Defense Minister Sergei Shoigu has nominated pilots of the Su-27 fighters for state awards who “prevented” a border violation by a US MQ-9 Reaper drone, the ministry said on Friday. “Minister of Defense of the Russian Federation, General of the Army S…", "url": "https://eurasiantimes.com/su-27-fighter-pilots-that-downed-us-mq-9-reaper-drone-nominated-for-state-awards-moscow/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2023/03/su-27drone-1.png", "publishedAt": "2023-03-17T13:10:17Z", "content": "Russian Defense Minister Sergei Shoigu has nominated pilots of the Su-27 fighters for state awards who “prevented” a border violation by a US MQ-9 Reaper drone, the ministry said on Friday.\r\n“Ministe… [+2384 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Ozempic for weight loss? Experts give their take on the diabetes medicine trending on TikTok and among US celebs - Channel NewsAsia", "description": "Seen a rash of comments with the hashtag #Ozempic under US celebrity posts on social media? Here's a closer look at the drug, reportedly used for dramatic weight loss.", "url": "https://cnalifestyle.channelnewsasia.com/wellness/ozempic-shortage-type-2-diabetes-weight-loss-349251", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--xHvRo8rO--/c_crop,h_843,w_1500,x_0,y_79/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/02/24/istock-1252389104.jpg?itok=7zzk3NJN", "publishedAt": "2023-03-15T23:23:39Z", "content": "In some studies, participants lost 10 pounds to 30 pounds, said US-based endocrinologist Dr Seth Charatz on Health Hive. The results, combined with celebrities talking about their own experiences, le… [+1369 chars]"}]}