{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thousands Of Covid-Like Infections Show Risk Of Next Pandemic - NDTV", "description": "Hundreds of thousands of people may be infected annually by animals carrying coronaviruses related to the one that causes Covid-19 each year in China and Southeast Asia, according to a study emphasizing the ongoing pandemic threat from spillover even", "url": "https://www.ndtv.com/world-news/thousands-of-covid-like-infections-show-risk-of-next-pandemic-2541223", "urlToImage": "https://c.ndtvimg.com/2021-09/rqid1ldo_risk-of-next-pandemic-bloomberg-_625x300_15_September_21.jpg", "publishedAt": "2021-09-15T03:27:56Z", "content": "No evidence supporting the coronavirus lab-leak theory has emerged.\r\nHundreds of thousands of people may be infected annually by animals carrying coronaviruses related to the one that causes Covid-19… [+4063 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Thousands of Covid-like infections show risk of next pandemic - The Star Online", "description": "SINGAPORE (Bloomberg): Hundreds of thousands of people may be infected annually by animals carrying coronaviruses related to the one that causes Covid-19 each year in China and South-east Asia, according to a study emphasising the ongoing pandemic threat from…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/09/15/thousands-of-covid-like-infections-show-risk-of-next-pandemic", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/09/15/1294291.jpg", "publishedAt": "2021-09-15T01:30:00Z", "content": "SINGAPORE (Bloomberg): Hundreds of thousands of people may be infected annually by animals carrying coronaviruses related to the one that causes Covid-19 each year in China and South-east Asia, accor… [+3977 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Stocks set to drop; Treasuries rallied after CPI - The Edge Markets MY", "description": "(Sept 15): Asian stocks look set to fall Wednesday after Wall Street slipped on growth concerns, while Treasuries rallied in the wake of an inflation report that suggested the Federal Reserve won’t rush to taper stimulus.Equity futures slid in Japan, Australi…", "url": "https://www.theedgemarkets.com/article/stocks-set-drop-treasuries-rallied-after-cpi", "urlToImage": "https://assets.theedgemarkets.com/Market-Preview_20210915091540_theedgemarkets.jpg?ibLktwnor9f1eL1kMttpqQWOUnogpqst", "publishedAt": "2021-09-14T23:18:02Z", "content": "(Sept 15): Asian stocks look set to fall Wednesday after Wall Street slipped on growth concerns, while Treasuries rallied in the wake of an inflation report that suggested the Federal Reserve wont ru… [+2431 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Sofia Tomacruz", "title": "Japan warns citizens of possible terror attack in Southeast Asia - Rappler", "description": "Officials in Southeast Asian countries covered by the advisory say there is no new information about heightened security threats in their respective countries and that threats will be continuously monitored", "url": "https://www.rappler.com/world/asia-pacific/japan-warns-citizens-possible-attack-southeast-asia?fbclid=IwAR3WsmcbIw5wOdNhNWhQ0sGlueEqs4uRKgqxr1OHUxoR24B6qPaHc67IPss", "urlToImage": "https://assets2.rappler.com/612F469A6EA84F6BAE882D2B94A4B421/img/C5C196F99FCB48CC9FBB0CE1B2C83A55/shutterstock-generic-terrorism-1631619327238.jpg", "publishedAt": "2021-09-14T11:58:00Z", "content": "The Associated Press (AP) had earlier reported that Japans Ministry of Foreign Affairs urged its citizens to stay away from crowds and religious facilities in the Philippines, Indonesia, Singapore, M… [+116 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Jamie Chua flaunts her Louis Vuitton collection and reveals why she doesn't put anything in half of them - AsiaOne", "description": "We're all familiar with Jamie Chua's vast Hermes handbag collection that is neatly stowed away in her fingerprint-password protected wardrobe. However, less has been said about her extensive Louis Vuitton (LV) collection. Showing off some of her favourite LV …", "url": "https://www.asiaone.com/lifestyle/jamie-chua-flaunts-her-louis-vuitton-collection-and-reveals-why-she-doesnt-put-anything", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/Jamie%20cover.jpg?h=0429cc9e&itok=2PM-DNNi", "publishedAt": "2021-09-14T10:47:00Z", "content": "We're all familiar with Jamie Chua's vast Hermes handbag collection that is neatly stowed away in her fingerprint-password protected wardrobe. However, less has been said about her extensive Louis Vu… [+3016 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore opts for home recovery for bulk of vaccinated people who get Covid-19 - The Star Online", "description": "SINGAPORE (The Straits Times/Asia News Network): Most people who are vaccinated and contract Covid-19 will be put on home recovery from Wednesday (Sept 15), the Ministry of Health (MOH) said on Tuesday.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/09/14/singapore-opts-for-home-recovery-for-bulk-of-vaccinated-people-who-get-covid-19", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/09/14/1293677.jpg", "publishedAt": "2021-09-14T10:31:00Z", "content": "SINGAPORE (The Straits Times/Asia News Network): Most people who are vaccinated and contract Covid-19 will be put on home recovery from Wednesday (Sept 15), the Ministry of Health (MOH) said on Tuesd… [+1608 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'This is our body and our choice': Actress Ase Wang pushes for government to lift social egg freezing ban - AsiaOne", "description": "In 2017, Singaporean actress Ase Wang, was told by doctors that she'll face difficulties trying to conceive naturally. She had low reserves of eggs, they said. So in the following year she decided to freeze of her eggs, even though social egg freezing isn't a…", "url": "https://www.asiaone.com/lifestyle/our-body-and-our-choice-actress-ase-wang-pushes-government-lift-social-egg-freezing-ban", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/140921_asewang_instagram.jpg?h=0429cc9e&itok=pVW4ZpX0", "publishedAt": "2021-09-14T05:27:00Z", "content": "In 2017, Singaporean actress Ase Wang, was told by doctors that she'll face difficulties trying to conceive naturally. She had low reserves of eggs, they said.\r\nSo in the following year she decided t… [+3624 chars]"}, {"source": {"id": null, "name": "Macworld"}, "author": null, "title": "macOS Big Sur: 11.6 update is now available with security patches - Channel Asia Singapore", "description": "Here is what you need to know about Apple’s current version of the Mac operating system.", "url": "https://www.macworld.com/article/234324/macos-big-sur-faq.html", "urlToImage": "https://d2bs8hqp6qvsw6.cloudfront.net/article/images/800x800/dimg/mac-os-big-sur-100849697-orig-100902713-orig.jpgautowebp", "publishedAt": "2021-09-14T04:21:26Z", "content": "The newest version of the Mac operating system, macOS Big Sur, is a major upgrade with several features that users can take advantage of. In this article, we cover the major new features, as well as … [+11278 chars]"}]}