{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Inkoo Kang", "title": "'Minari' Broke New Ground for Storytellers of Color, But Creatives Don't Want to Be Pigeonholed - Hollywood Reporter", "description": "The Oscar-nominated film navigates the immigrant American journey, but writer-director Lee Isaac Chung, producer Christina Oh and Steven Yeun emphasize its themes are broader than the Asian American experience: \"We were just trying to tell something honest.\"", "url": "https://www.hollywoodreporter.com/features/minari-broke-new-ground-for-storytellers-of-color-but-creatives-dont-want-to-be-pigeonholed", "urlToImage": "https://static.hollywoodreporter.com/wp-content/uploads/2021/04/minari_group_splash_h_2021-1618280018-1024x576.jpg", "publishedAt": "2021-04-14T13:00:16Z", "content": "It was a church scene that first caught producer Christina Oh's attention when she was introduced to the Minariscript in February 2019 by the film's future star, Steven Yeun. In the handful of pages … [+22480 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Singapore braces for deluge of container ships sailing from Suez - The Star Online", "description": "SINGAPORE (Bloomberg): One of Asia’s busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/04/14/singapore-braces-for-deluge-of-container-ships-sailing-from-suez", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/14/1113285.jpg", "publishedAt": "2021-04-14T07:26:00Z", "content": "SINGAPORE (Bloomberg): One of Asias busiest ports is preparing for an influx of ships after a week-long blockage at the Suez Canal.\r\nLogjams and delays are expected to worsen in Singapore, which alre… [+955 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "PSP's new chief criticises lack of contingency planning in PAP's leadership transition process - The Online Citizen Asia", "description": "The Online Citizen Asia PSP’s new chief criticises lack of contingency planning in PAP’s leadership transition process Politics", "url": "https://www.theonlinecitizen.com/2021/04/14/psps-new-chief-criticises-lack-of-contingency-planning-in-paps-leadership-transition-process/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/psp-francis.jpg", "publishedAt": "2021-04-14T06:06:58Z", "content": "The newly elected secretary-general of the Progress Singapore Party (PSP), Francis Yuen took to Facebook on Tuesday (13 Apr) to criticise the lack of contingency planning in the Peoples Action Partys… [+1630 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "International travel may resume in 2nd half of 2021. What should you expect? - AsiaOne", "description": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore — with a few conditions. When Singapore first announced its blanket advisory against overseas travel back in March 2020, the …", "url": "https://www.asiaone.com/lifestyle/international-travel-may-resume-2nd-half-2021-what-should-you-expect", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210414_travellers_st.jpg?h=0429cc9e&itok=48IkeWsH", "publishedAt": "2021-04-14T03:13:47Z", "content": "With vaccination rollouts under way in multiple countries, our dreams of jet-setting around the world may not be that far off anymore with a few conditions.\r\nWhen Singapore first announced its blanke… [+7562 chars]"}, {"source": {"id": null, "name": "SoyaCincau.com"}, "author": "https://www.facebook.com/alexwnl", "title": "Fave acquired by Pine Labs for RM185 mil, will launch in India this year - SoyaCincau.com", "description": "With the acquisition, Pine Labs aims to reinforce Fave's market position in Southeast Asia. Fave will also launch in India this year via Pine Lab's merchant network.", "url": "https://soyacincau.com/2021/04/13/fave-acquired-by-pine-labs-for-rm185-mil-will-launch-in-india-this-year/", "urlToImage": "https://soyacincau.com/wp-content/uploads/2021/04/210413-pine-labs-fave-1.jpg", "publishedAt": "2021-04-13T12:18:32Z", "content": "Merchant platform provider, Pine Labs has announced that it has acquired deals discovery and eWallet platform Fave for USD 45 million (about RM185 million). According to the press statement, the acqu… [+1735 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "A look into alternative parties' positions on PAP's failed Prime Minister succession plan - The Online Citizen Asia", "description": "The Online Citizen Asia A look into alternative parties' positions on PAP's failed Prime Minister succession plan Politics", "url": "https://www.theonlinecitizen.com/2021/04/13/a-look-into-alternative-parties-positions-on-paps-failed-prime-minister-succession-plan/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/04/heng-swee-keat-apr-8-2021-press-conference-1-.jpg", "publishedAt": "2021-04-13T10:22:31Z", "content": "Deputy Prime Minister Heng Swee Keats announcement on Thursday (8 Apr) that he will not be running for the Prime Minister position shocked the country and has raised concerns not only among members o… [+10331 chars]"}]}