{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Got Your Covid Shot But News of Fake Vaccines Giving You Sleepless Nights? Here's How to Identify An Origin - News18", "description": "Days after the World Health Organisation (WHO) said it has identified counterfeit versions of Covishield in South-East Asia and Africa, the Union Health Ministry issued a slew of guidelines to identify fake Covid-19 vaccines and ensure that they are not admin…", "url": "https://www.news18.com/news/india/got-your-covid-shot-but-news-of-fake-vaccines-giving-you-sleepless-nights-heres-how-to-identify-an-original-jab-4167434.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/2021-09-02t034953z_1_lynxmpeh8103n_rtroptp_4_health-coronavirus-india-vaccine-163055812416x9.jpg", "publishedAt": "2021-09-05T08:10:00Z", "content": "Days after the World Health Organisation (WHO) said it has identified counterfeit versions of Covishield in South-East Asia and Africa, the Union Health Ministry issued a slew of guidelines to identi… [+2637 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Get out, get out!': Woman kicks valet out of car after he beats red light, almost drives through another traffic stop - AsiaOne", "description": "One woman in Singapore gave her valet driver the boot, quite literally, after he ran a red light and didn't appear to slow down when they approached a second traffic stop. Based on dashcam footage that the woman posted to her Facebook page, the incident occur…", "url": "https://www.asiaone.com/singapore/get-out-get-out-woman-kicks-valet-out-car-after-he-beats-red-light-almost-drives-through", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/winniehengredlight.png?h=22a1dab9&itok=Ilc04dO2", "publishedAt": "2021-09-05T05:30:15Z", "content": "One woman in Singapore gave her valet driver the boot, quite literally, after he ran a red light and didn't appear to slow down when they approached a second traffic stop.\r\nBased on dashcam footage t… [+4528 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "What's behind the decision to close Yale-NUS College? - AsiaOne", "description": "SINGAPORE - More than a week since the shock announcement that Yale-NUS College will close its doors in 2025, students and alumni are still wondering if they will get a more detailed explanation of the decision. On Aug 27, the National University of Singapore…", "url": "https://www.asiaone.com/singapore/whats-behind-decision-close-yale-nus-college", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Sep2021/image_158.jpg?h=18ef716e&itok=3LX2Mwqi", "publishedAt": "2021-09-05T02:50:00Z", "content": "SINGAPORE - More than a week since the shock announcement that Yale-NUS College will close its doors in 2025, students and alumni are still wondering if they will get a more detailed explanation of t… [+14282 chars]"}, {"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Trilby Beresford", "title": "Simu Liu Says ‘Shang-Chi’ Will Change the World By Bringing “Pride Where There Was Shame” - Hollywood Reporter", "description": "Shang-Chi and the Legend of the Ten Rings actor Simu Liu posted a lengthy message on Friday, the day of the film’s opening, citing the importance of Asian representation in storytelling and thanking Disney for “throwing the full weight” of its platform behind…", "url": "https://www.hollywoodreporter.com/movies/movie-news/simu-liu-shang-chi-and-the-legend-of-the-ten-rings-will-change-the-world-1235008794/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2021/09/Simu-Liu-Getty-H-2021.jpg?w=1024", "publishedAt": "2021-09-05T01:40:39Z", "content": "Shang-Chi and the Legend of the Ten Rings actor Simu Liu posted a lengthy message on Friday, the day of the film’s opening, citing the importance of Asian representation in storytelling and thanking … [+2403 chars]"}]}