{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'At least speak to us like we're human': TTSH healthcare workers say they have been refused by cab drivers, turned away by hotels - AsiaOne", "description": "SINGAPORE - On May 5, a few days after the emergence of the Tan Tock Seng Hospital (TTSH) Covid-19 cluster, Mr Nigel Rankine tried to book a hotel stay but was told he could not be accommodated. The 27-year-old staff nurse works at TTSH. He decided to move ou…", "url": "https://www.asiaone.com/singapore/least-speak-us-were-human-ttsh-healthcare-workers-say-they-have-been-refused-cab-drivers", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2021/20210518_ttshstaff1_st.jpg?h=0429cc9e&itok=I5t97oRk", "publishedAt": "2021-05-18T03:25:00Z", "content": "SINGAPORE - On May 5, a few days after the emergence of the Tan Tock Seng Hospital (TTSH) Covid-19 cluster, Mr Nigel Rankine tried to book a hotel stay but was told he could not be accommodated.\r\nThe… [+4220 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Ottawa 'concerned' as Centerra reports Kyrgyz government taking control of gold mine - Business News - castanet.net", "description": "Canadian miner Centerra Gold Inc. says the Kyrgyz Republic is moving to install external management at its Kumtor gold mine in the Central Asian country after \"effectively seizing control\" of the operation over the weekend.", "url": "https://www.castanet.net/news/Business/334227/Ottawa-concerned-as-Centerra-reports-Kyrgyz-government-taking-control-of-gold-mine", "urlToImage": "https://www.castanet.net/content/2021/5/20210517140512-60a2b2c3a2ce494f8776928ejpeg_p3531273.jpg", "publishedAt": "2021-05-17T22:00:00Z", "content": "Canadian miner Centerra Gold Inc. says the Kyrgyz Republic is moving to install external management at its Kumtor gold mine in the Central Asian country after \"effectively seizing control\" of the ope… [+2082 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lunar Eclipse 2021: Day-By-Day Moon Guide In The Run-up To The Blood Moon - NDTV", "description": "Total Lunar Eclipse 2021: A total Lunar Eclipse will occur on May 26th. People living in the western parts of the United States, New Zealand, Australia and East Asia will enjoy the best view. Here is all you need to know about the Blood Moon", "url": "https://www.ndtv.com/india-news/lunar-eclipse-2021-day-by-day-moon-guide-in-the-run-up-to-the-blood-moon-of-may-26-2443445", "urlToImage": "https://c.ndtvimg.com/a1k2naeo_blood-moon-lunar-eclipse_625x300_28_July_18.jpg", "publishedAt": "2021-05-17T10:36:11Z", "content": "Lunar Eclipse 2021: The Blood Moon or total Lunar Eclipse will be on May 26th\r\nTotal Lunar Eclipse 2021: In less than 10 days, we will witness the first Lunar Eclipse of the year as the Full Moon pas… [+1809 chars]"}]}