{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "Nominees for 2021 Mnet Asian Music Awards announced with new judging criteria - Manila Bulletin", "description": "The Nation's Leading Newspaper", "url": "https://mb.com.ph/2021/11/04/nominees-for-2021-mnet-asian-music-awards-announced-with-new-judging-criteria/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/11/42701.jpeg", "publishedAt": "2021-11-04T03:12:00Z", "content": "The nominees in different categories for the 2021 Mnet Asian Music Awards (MAMA) have been announced on Nov. 3. \r\nThis year, drastic changes have been implemented in the criteria to select the winner… [+3385 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Food prices expected to go up in coming months: Gan Kim Yong - AsiaOne", "description": "SINGAPORE - Food is expected to become more expensive in Singapore in the coming months as energy prices increase amid higher prices for global food commodities, supply chain bottlenecks and labour shortages, said Trade and Industry Minister Gan Kim Yong. In …", "url": "https://www.asiaone.com/singapore/food-prices-expected-go-coming-months-gan-kim-yong", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/041121_foodprices_st.jpg?h=0429cc9e&itok=a0IYP_pO", "publishedAt": "2021-11-04T02:05:00Z", "content": "SINGAPORE - Food is expected to become more expensive in Singapore in the coming months as energy prices increase amid higher prices for global food commodities, supply chain bottlenecks and labour s… [+4260 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Eustance Huang", "title": "Asia-Pacific stocks rise after Fed announces plans to start tapering bond purchases; oil falls 1% - CNBC", "description": "The U.S. Federal Reserve announced Wednesday it will begin tapering the pace of asset purchases later in November.", "url": "https://www.cnbc.com/2021/11/04/asia-markets-us-federal-reserve-currencies-oil.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106868547-1618443427035-gettyimages-1230415697-JAPAN_STOCK.jpeg?v=1635982105", "publishedAt": "2021-11-03T23:43:42Z", "content": "Fed announces tapering plans\r\nThe Fed announced Wednesday it will begin reducing the pace of monthly bond purchases later this month. The move was in line with market expectations following a series … [+1070 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Local singer Nadya Dean, 27, dies 16 days after delivering premature baby - AsiaOne", "description": "Local singer Nadya Dean died on Oct 31, 11 days after falling into a coma following a premature childbirth. According to Berita Harian, her cause of death was eclampsia, a rare but severe condition where a patient suffers seizures caused by high blood pressur…", "url": "https://www.asiaone.com/entertainment/local-singer-nadya-dean-27-dies-16-days-after-delivering-premature-baby", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/New%20Project%20%2850%29.jpg?h=5be70471&itok=JvZDXqRo", "publishedAt": "2021-11-03T09:45:00Z", "content": "Local singer Nadya Dean died on Oct 31, 11 days after falling into a coma following a premature childbirth. \r\nAccording to Berita Harian, her cause of death was eclampsia, a rare but severe condition… [+1421 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Mario Ho and wife Ming Xi welcome second child - AsiaOne", "description": "It seems like congratulations are in order for Mario Ho and his wife Ming Xi. Mario, the son of late Macau casino tycoon Stanley Ho, went on Weibo earlier today (Nov 3) to share the arrival of his second child — a daughter. The 26-year-old entrepreneur wrote:…", "url": "https://www.asiaone.com/entertainment/mario-ho-and-wife-ming-xi-welcome-second-child", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2021/mario-mingxi-daughter_IG-weibo.png?h=1cb451e1&itok=A7mexN3n", "publishedAt": "2021-11-03T08:26:00Z", "content": "It seems like congratulations are in order for Mario Ho and his wife Ming Xi.\r\nMario, the son of late Macau casino tycoon Stanley Ho, went on Weibo earlier today (Nov 3) to share the arrival of his s… [+1084 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "AirAsia interested in potential Airbus A321neo freighter - The Star Online", "description": "KUALA LUMPUR: Malaysia's AirAsia Group Bhd is in talks with Airbus SE about its interest in the manufacturer developing a new factory-built freighter version of the A321neo passenger plane, the head of its cargo arm said on Wednesday.", "url": "https://www.thestar.com.my/business/business-news/2021/11/03/airasia-interested-in-potential-airbus-a321neo-freighter", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/03/1355372.JPG", "publishedAt": "2021-11-03T04:48:00Z", "content": "KUALA LUMPUR: Malaysia's AirAsia Group Bhd is in talks with Airbus SE about its interest in the manufacturer developing a new factory-built freighter version of the A321neo passenger plane, the head … [+678 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "uing", "title": "Wanna One In Talks To Reunite For New Music, Performances, And More - soompi", "description": "We may be getting a Wanna One reunion soon! On November 3, JTBC News reported that several industry sources had revealed that Wanna One is planning to reunite ahead of the 2021 Mnet Asian Music Awards. One source said, “Talks of a reunion always take place ah…", "url": "https://www.soompi.com/article/1496747wpp/wanna-one-in-talks-to-reunite-for-new-music-performances-and-more", "urlToImage": "https://6.viki.io/image/fe472ceb047b483491e1c7967b7b7396/dummy.jpeg?s=900x600&e=t", "publishedAt": "2021-11-03T03:53:10Z", "content": "We may be getting a Wanna One reunion soon!\r\nOn November 3, JTBC News reported that several industry sources had revealed that Wanna One is planning to reunite ahead of the 2021 Mnet Asian Music Awar… [+1117 chars]"}]}