{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Everyone deserves a second chance': Crowd gathers at Cathay despite busker Jeff Ng cancelling show - AsiaOne", "description": "The higher you rise, the harder you fall (or so the saying goes). But it seems that busker Jeff Ng might not have flamed out completely just yet. Hours after the scandal-ridden singer cancelled his regular 7.30pm gig at The Cathay yesterday (July 2), a small …", "url": "https://www.asiaone.com/lifestyle/everyone-deserves-second-chance-crowd-gathers-cathay-despite-busker-jeff-ng-cancelling", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2022/070222_cathay_jeff_asiaone.jpg?h=2e181f1f&itok=GCARZtCM", "publishedAt": "2022-07-03T03:20:00Z", "content": "The higher you rise, the harder you fall (or so the saying goes). But it seems that busker Jeff Ng might not have flamed out completely just yet.\r\nHours after the scandal-ridden singer cancelled his … [+2406 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Meet Yellow Mushmellow, the Singaporean artist empowering people with special needs - Channel NewsAsia", "description": "In this week's instalment of Creative Capital, meet Nur Aida Sa’ad, or Yellow Mushmellow, whose two sisters with special needs inspire her fun and quirky artistic concepts and installations. CNA Lifestyle dives into a world where rainbows are re-imagined as p…", "url": "https://cnalifestyle.channelnewsasia.com/living/creative-capital-nur-aida-saad-yellow-mushmellow-artist-illustrator-318601", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--6ywFE_d0--/c_crop,h_843,w_1500,x_0,y_1/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/06/29/Hero.png?itok=eUlOshx2", "publishedAt": "2022-07-02T22:50:00Z", "content": "In that vein, I often chronicle my experiences living with two special needs sisters in comics. It is not happy and colourful, but my candid depictions of our everyday encounters are well-received be… [+2743 chars]"}, {"source": {"id": null, "name": "Eurasia Review"}, "author": "Eurasia Review", "title": "Capturing The Onset Of Galaxy Rotation In The Early Universe - Eurasia Review", "description": "As telescopes have become more advanced and powerful, astronomers have been able to detect more and more distant galaxies. These are some of the earliest galaxies to form in our universe that began…", "url": "https://www.eurasiareview.com/03072022-capturing-the-onset-of-galaxy-rotation-in-the-early-universe/", "urlToImage": "https://i0.wp.com/www.eurasiareview.com/wp-content/uploads/2022/07/b-20.png?fit=800%2C450&ssl=1", "publishedAt": "2022-07-02T22:21:25Z", "content": "As telescopes have become more advanced and powerful, astronomers have been able to detect more and more distant galaxies. These are some of the earliest galaxies to form in our universe that began t… [+3829 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": null, "title": "LIVE UPDATES: Philippines vs India – FIBA World Cup Asian Qualifiers 2022 - Rappler", "description": "Coming off a 46-point beating from New Zealand, Gilas Pilipinas needs a quick turnaround as it looks to repeat over India", "url": "https://www.rappler.com/sports/gilas-pilipinas/updates-results-philippines-india-fiba-world-cup-asian-qualifiers-july-3-2022/", "urlToImage": "https://www.rappler.com/tachyon/2022/07/fiba-world-cup-asian-qualifiers-carousel.jpg", "publishedAt": "2022-07-02T11:14:25Z", "content": "MANILA, Philippines Gilas Pilipinas’ ability to bounce back from a crushing loss will be tested when it hosts India to wrap up the third window of the FIBA World Cup Asian Qualifiers at the Mall of A… [+979 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Elvin Ng jets off to New York, hopes to 'upgrade' his acting - AsiaOne", "description": "His new hostel might be a downgrade from his usual lifestyle, but local actor Elvin Ng said it's worth the hassle for the \"enriching\" experience. In an Instagram post on Thursday (June 30), Elvin bid farewell to fellow Singaporeans as he departed for New York…", "url": "https://www.asiaone.com/entertainment/elvin-ng-jets-new-york-hopes-upgrade-his-acting", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2022/elvinngairport_ig.jpg?h=410e763d&itok=bFiNNaEH", "publishedAt": "2022-07-02T05:25:00Z", "content": "His new hostel might be a downgrade from his usual lifestyle, but local actor Elvin Ng said it's worth the hassle for the \"enriching\" experience.\r\nIn an Instagram post on Thursday (June 30), Elvin bi… [+2495 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Show everyone!' Cabby of 'mobile shrine' to Manchester United tells thrilled passenger - AsiaOne", "description": "English Premier League football club Manchester United may not have won a trophy in a while, but they have one diehard fan in a Comfort CityCab driver in Singapore. When Stomp contributor Ms Nurfa used Grab to book a taxi in Choa Chu Kang on Thursday (June 30…", "url": "https://www.asiaone.com/singapore/show-everyone-cabby-mobile-shrine-manchester-united-tells-thrilled-passenger", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jul2022/02072022_manchester_stomp.jpg?h=0429cc9e&itok=5awdA78Z", "publishedAt": "2022-07-02T03:09:53Z", "content": "English Premier League football club Manchester United may not have won a trophy in a while, but they have one diehard fan in a Comfort CityCab driver in Singapore.\r\nWhen Stomp contributor Ms Nurfa u… [+1175 chars]"}, {"source": {"id": null, "name": "Galencentre.org"}, "author": null, "title": "Problems Urinating? Check If You Have An Enlarged Prostate - CodeBlue", "description": "Men above 40 years of age are at risk of developing enlarged prostate, a more common condition known as benign prostatic hyperplasia, that is often associated with underlying chronic conditions like obesity, heart disease, and diabetes; or those who don’t exe…", "url": "https://codeblue.galencentre.org/2022/07/02/problems-urinating-check-if-you-have-an-enlarged-prostate/", "urlToImage": "https://codeblue.galencentre.org/wp-content/uploads/2022/06/urinal_jetcarson_pixabay.jpg", "publishedAt": "2022-07-02T02:00:55Z", "content": "KUALA LUMPUR, July 2 If you are a man with urination problems, such as frequently needing to pass urine especially disturbing your night sleep or trouble starting to pee, you should consider getting … [+7844 chars]"}]}