{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CNA"}, "author": null, "title": "Inspired by a childhood in Brazil, this carbon trader started her own 'cheeky' kids' clothing line in Singapore - Channel NewsAsia", "description": "In this instalment of Creative Capital, we meet Angela Li, founded Bochechas (Portugese for \"cheeks\") when she couldn't find high-quality clothing in vibrant colours for her daughters.", "url": "https://cnalifestyle.channelnewsasia.com/living/children-kids-clothing-bochechas-parent-twinning-outfits-337446", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--N6-IDgMW--/c_crop,h_562,w_1000,x_0,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/01/hero.jpg?itok=4qoKpBuB", "publishedAt": "2022-11-05T23:02:43Z", "content": "The idea of twinning did sound very cheesy before I became a mum, but after, it hit me that it is actually so sweet to twin with your little ones when they still want to twin with you! But there are … [+1114 chars]"}, {"source": {"id": null, "name": "Asianatimes.com"}, "author": "Siddhartha Goyal", "title": "Zombie Planets Were Spotted A Few Miles Away From Supernovas - Asiana Times", "description": "Zombie planets are planets that exist without any stars or even after their stars’ supernovas. Supernovae NASA   Space News: All stars have a limited lifespan which can feel a bit longer as they could live for billion human years. As stars shine through the n…", "url": "https://asianatimes.com/zombie-planets-were-spotted-near-supernova/", "urlToImage": "https://i0.wp.com/asianatimes.com/wp-content/uploads/2022/11/globular-star-cluster-NASA-Space.jpg", "publishedAt": "2022-11-05T09:58:20Z", "content": "Zombie planets are planets that exist without any stars or even after their stars supernovas.\r\nSupernovae NASA\r\nSpace News: All stars have a limited lifespan which can feel a bit longer as they could… [+5953 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Hong Kong actor Ai Wai reveals he separated from wife due to her mahjong addiction - AsiaOne", "description": "Many have lost money to mahjong games, but veteran Hong Kong actor Ai Wai might have lost more. In a recent episode of Chinese variety show See You Again's second season, Ai Wai and his wife revealed that their relationship fell apart because of the latter's …", "url": "https://www.asiaone.com/entertainment/hong-kong-actor-ai-wai-reveals-separated-wife-mahjong-addiction-see-you-again", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Nov2022/41122_aiwai_mangotv.jpg?h=3e44ebd3&itok=9CvlsY6B", "publishedAt": "2022-11-05T01:53:00Z", "content": "Many have lost money to mahjong games, but veteran Hong Kong actor Ai Wai might have lost more.\r\nIn a recent episode of Chinese variety show See You Again's second season, Ai Wai and his wife reveale… [+3445 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Zoe Tay: 'I've been crazy over Louis Vuitton from a very young age' - Channel NewsAsia", "description": "She even went as far as to purchase a monogrammed item to use in a role, the actress told us while in Sydney for the opening of SEE LV, Louis Vuitton’s travelling exhibition.", "url": "https://cnalifestyle.channelnewsasia.com/style-beauty/zoe-tay-louis-vuitton-see-lv-favourite-fashion-brand-bag-337791", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--hUl8H529--/c_crop,h_843,w_1500,x_0,y_303/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/11/05/GridArt_20221105_001358177.jpg?itok=y-sMl2Sr", "publishedAt": "2022-11-04T23:46:00Z", "content": "Mediacorp artiste Zoe Tay was in Sydney for the opening of the exhibition. While perusing the Bags Stories universe, Tay took a walk down her own memory lane. \r\nIve been crazy over Louis Vuitton from… [+1023 chars]"}]}