{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Decoding imagined language to treat people suffering from aphasia - News-Medical.Net", "description": "What if it were possible to decode the internal language of individuals deprived of the ability to express themselves? This is the objective of a team of neuroscientists from the University of Geneva (UNIGE) and the University Hospitals of Geneva.", "url": "https://www.news-medical.net/news/20220111/Decoding-imagined-language-to-treat-people-suffering-from-aphasia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Neuroscience-620x480.jpg", "publishedAt": "2022-01-12T02:27:00Z", "content": "What if it were possible to decode the internal language of individuals deprived of the ability to express themselves? This is the objective of a team of neuroscientists from the University of Geneva… [+4502 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Genting's shipbuilding units in Germany file for bankruptcy - The Star Online", "description": "Frankfurt: Asian tourism and casinos giant Genting’s shipbuilding subsidiaries in Germany filed for bankruptcy on Monday, which one union leader described as a “dark day” for the country’s dockyards.", "url": "https://www.thestar.com.my/business/business-news/2022/01/12/gentings-shipbuilding-units-in-germany-file--for-bankruptcy", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/01/12/1440547.jpg", "publishedAt": "2022-01-11T23:27:30Z", "content": "Frankfurt: Asian tourism and casinos giant Gentings shipbuilding subsidiaries in Germany filed for bankruptcy on Monday, which one union leader described as a dark day for the countrys dockyards.\r\nWi… [+2653 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Single's Inferno: Who are the couples supposedly dating in real life after the series? - AsiaOne", "description": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. Well, we might just have an answer after all, thanks to the detective w…", "url": "https://www.asiaone.com/entertainment/netflix-singles-inferno-who-are-couples-dating-an-yea-won-cha-hyun-seung-oh-jin-taek-kang-so-yeon", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/100122_Singles%20Inferno%20couples_IG.jpg?h=79e3e4c1&itok=Cmr0eyzY", "publishedAt": "2022-01-10T12:00:00Z", "content": "As Korean reality series Single's Inferno came to an end last weekend, perhaps one question lingering in fans' minds would be whether any of the cast members have coupled up in real life. \r\nWell, we … [+3088 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "I didn't dare let my classmates know mum is a celebrity, says Chen Xiuhuan's daughter Shanisse - AsiaOne", "description": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmates to know. The 24-year-old made that revelation while speaki…", "url": "https://www.asiaone.com/entertainment/i-didnt-dare-let-my-classmates-know-my-mum-celebrity-says-chen-xiuhuan-daughter-shanisse", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2022/shanisse-chenxiuhuan_IG.jpg?h=05d90210&itok=IuhIcEQY", "publishedAt": "2022-01-10T10:30:00Z", "content": "Being a celebrity's kid might sound like a surefire way to be popular at school but for Shanisse Tsai, the daughter of local veteran actress Chen Xiuhuan, it wasn't something she wanted her classmate… [+2966 chars]"}]}