{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "S&P Global"}, "author": null, "title": "Crude oil futures edge higher as easing restrictions in Europe offset India's COVID-19 surge - S&P Global", "description": "0316 GMT: Crude oil futures edged higher during mid morning trade in Asia May 4 as plans to ease travel restrictions in Europe lifted hopes of stronger demand, countering the demand erosion in India c", "url": "https://www.spglobal.com/platts/en/market-insights/latest-news/oil/050421-crude-oil-futures-edge-higher-as-easing-restrictions-in-europe-offset-indias-covid-19-surge", "urlToImage": null, "publishedAt": "2021-05-04T03:46:00Z", "content": "Singapore 0316 GMT: Crude oil futures edged higher during mid-morning trade in Asia May 4 as plans to ease travel restrictions in Europe lifted hopes of stronger demand, countering the demand erosion… [+2556 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "ICA puts officer to work in front line processing arrival clearance despite he can't be vaccinated - The Online Citizen Asia", "description": "The Online Citizen Asia ICA puts officer to work in front line processing arrival clearance despite he can't be vaccinated Current Affairs", "url": "https://www.theonlinecitizen.com/2021/05/04/ica-puts-officer-to-work-in-front-line-processing-arrival-clearance-despite-he-cant-be-vaccinated/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2020/11/201118-arrival-immigration-of-Changi-International-Airport-in-Singapore.jpg", "publishedAt": "2021-05-04T02:11:58Z", "content": "On Sunday (2 May), the Ministry of Health (MOH) said that one of the community cases was linked to the earlier ICA officer who was infected with COVID-19 while working at the Changi Airport Terminal … [+2236 chars]"}, {"source": {"id": null, "name": "Macworld"}, "author": "Roman Loyola", "title": "Apple releases important security update to iOS, iPadOS, macOS, and watchOS - Channel Asia Singapore", "description": "The iOS and iPadOS 14.5.1, macOS 11.3.1, and watchOS 7.4.1 updates contain security patches along with an App Tracking Transparency fix.", "url": "https://www.macworld.com/article/345223/ios-and-ipados-14-5-1-watchos-7-4-1-and-macos-big-sur-11-3-1-updates-are-now-available.html", "urlToImage": "https://www.macworld.com/wp-content/uploads/2021/05/apple-product-family-2017-4.jpg?quality=50&strip=all&w=1024", "publishedAt": "2021-05-03T23:44:16Z", "content": "Apple on Monday released updates for iOS 14.5, iPadOS 14.5, watchOS 7.4, and macOS 11.3, which contain critical security patches that should be installed immediately. We’ve seen these types of fixes … [+3104 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Asia's obsession with food and beauty has a dark side - BusinessWorld Online", "description": "AT A RECENT doctor’s visit, my endocrinologist admonished me for gaining two pounds. “You’re not obese” — I’m not even close — “but it’s something to watch,” he told me.", "url": "https://www.bworldonline.com/asias-obsession-with-food-and-beauty-has-a-dark-side/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/05/broccoli-measurement-tape-dish.jpg", "publishedAt": "2021-05-03T11:12:15Z", "content": "AT A RECENT doctors visit, my endocrinologist admonished me for gaining two pounds. Youre not obese Im not even close but its something to watch, he told me.\r\nI left the appointment equal parts indig… [+8011 chars]"}]}