{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "Biden seeks to keep China in focus by welcoming ASEAN leaders - INQUIRER.net", "description": "WASHINGTON - President Joe Biden will host Southeast Asian leaders in Washington this week, seeking to show his administration remains focused on the Indo-Pacific and the long-term challenge of", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/05/2022-05-11T102433Z_1_LYNXNPEI4A0G5_RTROPTP_4_USA-ASEAN-620x413.jpg", "publishedAt": "2022-05-11T22:31:00Z", "content": "A worker adjusts an ASEAN flag at a meeting hall in Kuala Lumpur, Malaysia, October 28, 2021. (REUTERS)\r\nWASHINGTON – President Joe Biden will host Southeast Asian leaders in Washington this week, se… [+5072 chars]"}, {"source": {"id": null, "name": "Insidethegames.biz"}, "author": null, "title": "Relief as Southeast Asian Games underway in Hanoi at last - Insidethegames.biz", "description": "The Southeast Asian Games formally opens tomorrow in Vietnam's capital\nHanoi after two years of delays as a result of the COVID-19, although\nthe first...", "url": "https://www.insidethegames.biz/articles/1123037/south-east-asian-games-set-to", "urlToImage": "https://cdn.dmcl.biz/media/image/240004/o/sea+2+thumbnail_image003.jpg", "publishedAt": "2022-05-11T21:50:20Z", "content": "The Southeast Asian Games (SEA Games) formally opens tomorrow in Vietnam's capital Hanoi after two years of delays as a result of the COVID-19, although the first gold medals have already been awarde… [+2420 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Took me 11 days to pen this note without crying': Sharon Au's Paris apartment burglarised but her cat waited for her - AsiaOne", "description": "Imagine coming home to your apartment only to find it emptied and your favourite things taken. That's what happened to former Mediacorp actress Sharon Au who shared this in an emotional post today (May 11), adding it \"took me 11 days to pen this note, without…", "url": "https://www.asiaone.com/entertainment/took-me-11-days-pen-note-without-crying-sharon-au-paris-apartment-burglarised-her-cat-waited", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/sharonau_IG.jpg?h=e626e126&itok=7Ncqa4I7", "publishedAt": "2022-05-11T10:20:00Z", "content": "Imagine coming home to your apartment only to find it emptied and your favourite things taken.\r\nThat's what happened to former Mediacorp actress Sharon Au who shared this in an emotional post today (… [+982 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Malaysia central bank lifts key rate from all-time low on inflation risk - CNA", "description": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to recover from the COVID-19 pandemic.Bank Negara Malaysia (BNM) r…", "url": "https://www.channelnewsasia.com/business/malaysia-central-bank-lifts-key-rate-all-time-low-inflation-risk-2677786", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--b4IO0NSj--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-05-11t071306z_1_lynxnpei4a0a0_rtroptp_3_malaysia-economy-rates.jpg?itok=tvkbAlOw", "publishedAt": "2022-05-11T09:07:22Z", "content": "KUALA LUMPUR :Malaysia's central bank unexpectedly raised its benchmark interest rate from an historic low on Wednesday, to cool inflationary pressures as the Southeast Asian country continues to rec… [+3096 chars]"}, {"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "Pencak silat's bet Padios wins PH's first gold in Vietnam SEAG - pna.gov.ph", "description": "HANOI – Mary Francine Padios won the Philippines’ first gold medal in the 31st Southeast Asian Games by ruling on Wednesday pencak silat’s women’s seni (artistic or form) tunggal single at the Bac Tu Lien Gymnasium here.Padios thus put the Philippines on the …", "url": "https://www.pna.gov.ph/articles/1174208", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/05/11/seag-first-gold.jpg", "publishedAt": "2022-05-11T07:04:00Z", "content": "(Photo courtesy of PSC)\r\nHANOI – Mary Francine Padios won the Philippines’ first gold medal in the 31st Southeast Asian Games by ruling on Wednesday pencak silat’s women’s seni (artistic or form) tun… [+3372 chars]"}, {"source": {"id": null, "name": "Malaysiakini"}, "author": "Malaysiakini Team", "title": "Kuching MP blasts AirAsia over flight delays - Malaysiakini", "description": "Don't sell tickets if not enough planes, says Yii.", "url": "https://www.malaysiakini.com/news/620831", "urlToImage": "https://i.ncdn.xyz/publisher-c1a3f893382d2b2f8a9aa22a654d9c97/2021/01/e4d1c39d8a1df896ab04367fa5cae924.jpg", "publishedAt": "2022-05-11T04:47:50Z", "content": "Bandar Kuching MP Kelvin Yii has taken AirAsia to task, saying that the company's excuses for frequent and constant delays and rescheduling of domestic flights were unacceptable, and the budget airli… [+279 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "'Their parents are younger than me': Dennis Chew on classmates, poly life and taking pay cut - AsiaOne", "description": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. So, how have the first few weeks of school been for the 48-year-old? Speaking to Shin Min Daily New…", "url": "https://www.asiaone.com/entertainment/their-parents-are-younger-me-dennis-chew-classmates-poly-life-and-taking-pay-cut", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/May2022/100522_Dennis%20Chew%20Plytechnic_SMDN.jpg?h=a30d54cd&itok=xO-JpSUV", "publishedAt": "2022-05-10T05:06:00Z", "content": "Since winning the All-Time Favourite Artiste honour at Star Awards last month, actor-DJ Dennis Chew has been busy pursuing his diploma at Ngee Ann Polytechnic. \r\nSo, how have the first few weeks of s… [+2339 chars]"}]}