{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Simon Smale", "title": "Ange Postecoglou silences doubters with superb debut season in Europe, claiming Scottish Premiership with Celtic - ABC News", "description": "There were few in the British press who heralded Ange Postecoglou's appointment as Celtic manager. Fast forward a season and those doubters have been left eating their words as the Australian did what he does best. Win.", "url": "https://www.abc.net.au/news/2022-05-12/ange-postecoglou-celtic-scottish-premiership-silence-critics/101030972", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/971bfc5ee14abe4bfe5f09b284647c58?impolicy=wcms_crop_resize&cropH=2347&cropW=4172&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2022-05-11T20:53:17Z", "content": "We shouldn't have been surprised.\r\nIn fact, plenty of Australian football fans will say they foresaw this success for Ange Postecoglou, even if the rest of the footballing world barely disguised thei… [+7318 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "EPL: We must close the gap – Mikel Arteta reacts to Haaland’s move to Man City - Daily Post Nigeria", "description": "Arsenal boss, Mikel Arteta, has reacted to Manchester City's acquisition of Europe's top striker, Erling Haaland from Borussia Dortmund. Manchester City announced during the week that 21-year-old Norway international will join the club this summer after agree…", "url": "https://dailypost.ng/2022/05/11/epl-we-must-close-the-gap-mikel-arteta-reacts-to-haalands-move-to-man-city/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/04/b9818e53-da13-43ac-9b3d-723a0140112d.jpg", "publishedAt": "2022-05-11T19:08:20Z", "content": "Arsenal boss, Mikel Arteta, has reacted to Manchester City’s acquisition of Europe’s top striker, Erling Haaland from Borussia Dortmund.\r\nManchester City announced during the week that 21-year-old No… [+1593 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "AFP", "title": "WATCH | London Irish's Creevy cited for alleged hair-pull on Etzebeth - News24", "description": "London Irish hooker Agustin Creevy has been cited for allegedly pulling Eben Etzebeth's hair during a European Challenge Cup quarter-final away to Toulon.", "url": "https://www.news24.com/sport/rugby/watch-london-irishs-creevy-cited-for-alleged-hair-pull-on-etzebeth-20220511", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1143/cfb288cef7974a1cbd43b488ce0f5fde.jpg", "publishedAt": "2022-05-11T07:07:32Z", "content": "London Irish hooker Agustin Creevy has been cited for allegedly pulling South African World Cup-winner Eben Etzebeth's hair during a European Challenge Cup quarter-final away to Toulon on Sunday.\r\nRE… [+631 chars]"}, {"source": {"id": null, "name": "Open Access Government"}, "author": null, "title": "Loneliness during COVID increased by 5% across Global North - Open Access Government", "description": "The data, looking at loneliness during COVID in North America and Europe, finds \"the pandemic does appear to have increased loneliness\"", "url": "https://www.openaccessgovernment.org/loneliness-during-covid-increased-by-5-across-global-north/135267/", "urlToImage": "https://www.openaccessgovernment.org/wp-content/uploads/2022/05/dreamstime_m_78019555-scaled.jpg", "publishedAt": "2022-05-10T10:46:07Z", "content": "The findings, published in the American Psychologist, suggests that loneliness during COVID significantly increased across North America and Europe.\r\nLoneliness increased by 5% across North America a… [+2681 chars]"}]}