{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Arab News"}, "author": null, "title": "EU approves fifth jab as WHO urges greater effort to end pandemic - Arab News", "description": "BRUSSELS: The European Union approved its fifth Covid-19 vaccine Monday, stepping up its battle against the omicron virus variant as the WHO called for greater efforts to ensure the pandemic ends next year. Europe is already far ahead of other parts of the wo…", "url": "https://www.arabnews.com/node/1990411", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2021/12/21/2976481-278531844.jpg", "publishedAt": "2021-12-20T23:24:42Z", "content": "WATERLOO, Canada: As the last US troops departed Kabul on Aug. 31, drawing 20 years of war in Afghanistan to a dispiriting end, Taliban commanders were quick to declare victory. Little did they know,… [+8128 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "EU approves Novavax shot as fifth COVID vaccine - Al Jazeera English", "description": "The European Medicines Agency paves the way for a fifth authorised COVID jab in the bloc, approving its use in adults.", "url": "https://www.aljazeera.com/news/2021/12/20/eu-approves-novavax-shot-as-fifth-covid-vaccine", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/12/000_9UZ6RW.jpg?resize=1024%2C630", "publishedAt": "2021-12-20T20:15:17Z", "content": "The European Union has approved the use of Novavaxs COVID-19 vaccine in people 18 years and older, giving a boost to the US biotech after long delays and paving the way for a fifth shot in the EU as … [+4090 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "As omicron surges, nations announce rules on gatherings and travel ahead of holidays - NPR", "description": "European nations implemented a wave of new restrictions as case numbers rise. And Israel added the U.S. and Canada to its \"red list\" of countries from which citizens are barred from travel.", "url": "https://www.npr.org/2021/12/20/1065865472/omicron-holiday-travel-gatherings-restrictions-world", "urlToImage": "https://media.npr.org/assets/img/2021/12/20/gettyimages-1237326003_wide-3332bd3acc81d10fe08151020588a03c8e164db1.jpg?s=1400", "publishedAt": "2021-12-20T19:18:36Z", "content": "A man walks by a closed cheese store on a normally bustling shopping street in the center of Amsterdam on Monday. Nations across Europe have moved to reimpose tougher measures to stem a new wave of C… [+4861 chars]"}, {"source": {"id": null, "name": "Daily Sun"}, "author": "David", "title": "EU approves 5th COVID-19 vaccine for bloc, one by Novavax - Daily Sun", "description": "(AP) The European Union’s drugs regulator gave the green light Monday to a fifth COVID-19 vaccine for use in the", "url": "https://www.sunnewsonline.com/eu-approves-5th-covid-19-vaccine-for-bloc-one-by-novavax/", "urlToImage": "https://sunnewsonline.com/wp-content/uploads/2021/12/800-9.jpeg", "publishedAt": "2021-12-20T16:55:51Z", "content": "(AP)\r\nThe European Unions drugs regulator gave the green light Monday to a fifth COVID-19 vaccine for use in the 27-nation bloc, granting conditional marketing authorization to the two-dose vaccine m… [+3732 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "AFP", "title": "EU health watchdog approves fifth Covid vaccine - TheJournal.ie", "description": "This will be the fifth Covid-19 vaccine approved for use in the European Union.", "url": "https://www.thejournal.ie/novavax-eu-approval-5635718-Dec2021/", "urlToImage": "https://img2.thejournal.ie/article/5635718/river/?height=400&version=5635719", "publishedAt": "2021-12-20T15:36:00Z", "content": "Updated 1 hour ago\r\nEUROPES MEDICINES WATCHDOG has approved a Covid jab by US-based Novavax, which uses a more conventional technology that the biotech firm hopes will reduce vaccine hesitancy.\r\nThe … [+3967 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Omicron fears send Bursa, regional markets lower - The Star Online", "description": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling in equities.", "url": "https://www.thestar.com.my/business/business-news/2021/12/20/omicron-fears-send-bursa-regional-markets-lower", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/20/1413398.JPG", "publishedAt": "2021-12-20T05:03:00Z", "content": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling … [+1049 chars]"}]}