{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Emma Roth, Richard Lawler", "title": "Apple’s Self Service Repair now includes the M1 MacBook Air and MacBook Pro - The Verge", "description": "You can repair an M1 MacBook Air or MacBook Pro laptop at home using some of the same parts and tools used by Apple stores and its authorized repair providers. It will expand to Europe and support more Macs later this year.", "url": "https://www.theverge.com/2022/8/22/23316259/apple-laptop-self-service-diy-repair-m1-macbook-air-pro", "urlToImage": "https://cdn.vox-cdn.com/thumbor/apc1ySvnzn6NqviUZq1vyQsD6fo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22038526/akramer_201113_4290_0021.0.jpg", "publishedAt": "2022-08-22T13:44:57Z", "content": "A $49 rental kit lets you swap out the logic board or Touch ID sensor on a MacBook Air or MacBook Pro\r\nPhoto by Alexander Kramer for The Verge\r\nApples expanding its DIY repair program to include MacB… [+1513 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Ahmed Areff", "title": "Chinese, UAE and European giants shortlisted for R100bn Durban port upgrade - along with SA firms - News24", "description": "International port and logistics firms have joined local players like Grindrod and Remgro on Transnet's shortlist for private partners for the R100 billion Durban port upgrade", "url": "https://www.news24.com/fin24/companies/chinese-uae-and-european-giants-shortlisted-for-r100bn-durban-port-upgrade-along-with-sa-firms-20220822", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3549/a43ef45145294151a7ea56eb1418bcd0.jpg", "publishedAt": "2022-08-22T06:22:47Z", "content": "<ul><li>International port and logistics firms have joined local players like Grindrod and Remgro on Transnet's shortlist for private partners for the Durban port upgrade</li><li>Getting Durban’s por… [+3734 chars]"}, {"source": {"id": null, "name": "Voonze.com"}, "author": "https://www.facebook.com/TheDeepLines", "title": "When the Thames and the Seine flowed into the Rhine: there is another Europe under the sea and not long ago there were humans living there - How smart Technology changing lives - InTallaght", "description": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, and part of Atlantic France. It was more than a land bridge; i…", "url": "https://voonze.com/when-the-thames-and-the-seine-flowed-into-the-rhine-there-is-another-europe-under-the-sea-and-not-long-ago-there-were-humans-living-there/", "urlToImage": "https://voonze.com/wp-content/uploads/2022/08/When-the-Thames-and-the-Seine-flowed-into-the-Rhine.jpg", "publishedAt": "2022-08-21T17:12:42Z", "content": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, an… [+2373 chars]"}]}