{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "Study places Homo Sapiens in Europe earlier than thought - Jakarta Post", "description": "Up to now, archaeological discoveries had indicated that Neanderthals disappeared from the European continent about 40,000 years ago, shortly after the arrival of their \"cousin\" Homo sapiens, barely 5,000 years earlier and there was no evidence of an encounte…", "url": "http://www.thejakartapost.com/culture/2022/02/10/study-places-homo-sapiens-in-europe-earlier-than-thought-.html", "urlToImage": "https://img.jakpost.net/c/2021/04/09/2021_04_09_112181_1617937840._large.jpg", "publishedAt": "2022-02-10T05:31:53Z", "content": "Homo sapiens ventured into Neanderthal territory in Europe much earlier than previously thought, according to an archaeological study published in Science magazine on Wednesday.\r\nUp to now, archaeolo… [+4152 chars]"}, {"source": {"id": null, "name": "Impartial Reporter"}, "author": "PA News Agency", "title": "Child's tooth 'earliest known evidence of modern humans in western Europe' - Impartial Reporter", "description": "The discovery of the molar was made in a cave – known as Grotte Mandrin – in France’s Rhone Valley.", "url": "https://www.impartialreporter.com/news/19912412.childs-tooth-earliest-known-evidence-modern-humans-western-europe/", "urlToImage": "https://www.impartialreporter.com/resources/images/13459866/", "publishedAt": "2022-02-09T19:24:48Z", "content": "The fossil of a childs tooth is the earliest known evidence of modern humans in western Europe, researchers say.The discovery of the molar was made in a cave known as Grotte Mandrin in Frances Rhone … [+2696 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Frank Jordans", "title": "French cave tells new story about Neanderthals, early humans - Phys.org", "description": "A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thought to have reached that part of Europe, a new study suggests.", "url": "https://phys.org/news/2022-02-french-cave-story-neanderthals-early.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/french-cave-tells-new.jpg", "publishedAt": "2022-02-09T19:18:45Z", "content": "A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thoug… [+6902 chars]"}]}