{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Lamiat Sabin", "title": "Archie Battersbee: European Court of Human Rights refuses to postpone withdrawal of life support - The Independent", "description": "Application to ECHR was expected to be Archie’s family’s last chance to keep him on life support", "url": "https://www.independent.co.uk/news/uk/home-news/archie-battersbee-life-support-european-court-b2137579.html", "urlToImage": "https://static.independent.co.uk/2022/08/03/13/archie%20battersbee-1.PNG?quality=75&width=1200&auto=webp", "publishedAt": "2022-08-03T19:01:00Z", "content": "The European Court of Human Rights (ECHR) has refused an application by Archie Battersbees parents to postpone the withdrawal of his life support.\r\nArchie, 12, has been kept alive by ventilation and … [+3276 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "European Court of Human Rights refuses to postpone the withdrawal of UK boy’s life support - TheJournal.ie", "description": "Archie Battersbee has been in a coma since he was found unconscious in April.", "url": "https://www.thejournal.ie/archie-batterbee-legal-battle-5832025-Aug2022/", "urlToImage": "https://img2.thejournal.ie/article/5832025/river/?height=400&version=5832028", "publishedAt": "2022-08-03T19:00:00Z", "content": "Updated 1 hour ago\r\nA LAST-DITCH bid by the parents of a 12-year-old UK boy to postpone the withdrawal of his life support has been refused by the European Court of Human Rights.\r\nArchie Battersbee h… [+2157 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Having a partner more important than children to staving off loneliness during pandemic, new study finds - Medical Xpress", "description": "A new study released in the European Journal of Ageing found that having a partner had a greater impact than having children in helping to stave off loneliness among older adults during the pandemic's first wave. Researchers at the University of Rhode Island,…", "url": "https://medicalxpress.com/news/2022-08-partner-important-children-staving-loneliness.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2018/loneliness.jpg", "publishedAt": "2022-08-03T17:33:10Z", "content": "A new study released in the European Journal of Ageing found that having a partner had a greater impact than having children in helping to stave off loneliness among older adults during the pandemic'… [+4257 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "John Leicester", "title": "Cold showers, no lights: Europe saves as Russian gas wanes - The Associated Press - en Español", "description": "PARIS (AP) — Fanning out like urban guerrillas through Paris' darkened streets well after midnight, the anti-waste activists shinny up walls and drain pipes, reaching for switches to turn off the lights.", "url": "https://apnews.com/article/russia-ukraine-paris-germany-90d38aea4805b0667b63b3dedfe8a00d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/7b44f875a5ca4e2385884a105af3673f/3000.jpeg", "publishedAt": "2022-08-03T06:22:30Z", "content": "PARIS (AP) Fanning out like urban guerrillas through Paris darkened streets well after midnight, the anti-waste activists shinny up walls and drain pipes, reaching for switches to turn off the lights… [+5782 chars]"}]}