{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Balazs Koranyi and Francesco Canepa", "title": "ECB set to promise even longer support to charge inflation - Yahoo Finance", "description": "The European Central Bank is all but certain to promise an even longer period of stimulus on Thursday to make good on its commitment to boost inflation but...", "url": "https://finance.yahoo.com/news/ecb-set-promise-even-longer-220001275.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/8jC6vsrOoANoeUKg6giLnQ--~B/aD01Mzc7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/ececb5fe864624b1fd1a09949b876fca", "publishedAt": "2021-07-21T22:00:01Z", "content": "* First policy meeting since ECB's strategy review \r\n  * ECB set to promise more prolonged stimulus \r\n  * Implications of new strategy for policy still being discussed \r\n  By Balazs Koranyi and Franc… [+4257 chars]"}, {"source": {"id": null, "name": "Siliconrepublic.com"}, "author": "Vish Gain", "title": "New group aims to make Ireland Europe's insurtech hub - Siliconrepublic.com", "description": "InsTech.ie aims to unite insurance firms, start-ups and third-level institutions to promote innovation in the insurance sector.", "url": "https://www.siliconrepublic.com/start-ups/insurtech-ireland-europe-insurance-innovation-hub", "urlToImage": "https://www.siliconrepublic.com/wp-content/uploads/2021/07/AdobeStock_291017215.jpeg", "publishedAt": "2021-07-21T14:59:45Z", "content": "InsTech.ie will bring together insurance firms, start-ups and third-level institutions to drive innovation in insurance.\r\nIn a bid to make Ireland a European hub for the growing insurtech sector, 12 … [+2118 chars]"}, {"source": {"id": null, "name": "360aproko.com"}, "author": "360aproko Information", "title": "The beta Covid variant is causing concerns in Europe, should we be worried - 360aproko", "description": "While the world is busy tackling further Covid-19 waves caused by the highly infectious delta variant, there are growing concerns in parts of Europe about a “beta” coronavirus strain first discovered in South Africa. Last week, the British government announce…", "url": "https://360aproko.com/the-beta-covid-variant-is-causing-concerns-in-europe-should-we-be-worried/", "urlToImage": null, "publishedAt": "2021-07-21T11:16:48Z", "content": "While the world is busy tackling further Covid-19 waves caused by the highly infectious delta variant, there are growing concerns in parts of Europe about a beta coronavirus strain first discovered i… [+7108 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Fossil reveals burrowing lifestyle of tiny dino, Europe News & Top Stories - The Straits Times", "description": "PARIS (AFP) - A finger-sized fossil from 308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures that may be the forerunners of reptiles, researchers revealed Wednesday (July 21).. Read more a…", "url": "https://www.straitstimes.com/world/europe/fossil-reveals-burrowing-lifestyle-of-tiny-dino", "urlToImage": "https://www.straitstimes.com/s3/files/styles/x_large/public/articles/2021/07/05/afph0507.jpg?itok=O2MjpGzg", "publishedAt": "2021-07-20T23:38:23Z", "content": "PARIS (AFP) - A finger-sized fossil from 308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures that may be the forerunners of rept… [+3007 chars]"}, {"source": {"id": null, "name": "Thedailyguardian.net"}, "author": "Martin Woolridge", "title": "Martian methane mystery deepens with lack of signals - thedailyguardian.net", "description": "Madrid, 20 July. (European Press) - The European Space Agency and Roscosmos's Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the", "url": "https://thedailyguardian.net/martian-methane-mystery-deepens-with-lack-of-signals/", "urlToImage": null, "publishedAt": "2021-07-20T22:21:20Z", "content": "Madrid, 20 July. (European Press) – \r\n The European Space Agency and Roscosmos’s Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the Martian atmosphere at New data collection… [+4330 chars]"}]}