{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "John Wagner, Colby Itkowitz, Eugene Scott, Felicia Sonmez", "title": "Live updates: Harris warns Guatemalans they will be turned back if they come to the U.S. border illegally - The Washington Post", "description": "The president also plans to speak again with the lead Republican negotiator on an infrastructure bill, either later Monday or possibly Tuesday ahead of a trip to Europe.", "url": "https://www.washingtonpost.com/politics/2021/06/07/joe-biden-live-updates/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QJSZF2WFKYI6XCNEW6XCFKQZHY.jpg&w=1440", "publishedAt": "2021-06-07T18:18:00Z", "content": "The Rev. William Barber II said Monday that the Poor Peoples Campaign will hold a Moral March in West Virginia next week to protest Sen. Joe Manchin III a day after the Democratic senator announced h… [+1702 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Emily Craig", "title": "Moderna seeks approval for giving its Covid vaccine to children in Europe - Daily Mail", "description": "Covid-19 vaccine maker Moderna has asked the European Medicines Agency for permission to give its jab to children aged between 12 and 17.", "url": "https://www.dailymail.co.uk/news/article-9660467/Moderna-seeks-approval-giving-Covid-vaccine-children-Europe.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/06/07/15/43826697-0-image-a-8_1623076475595.jpg", "publishedAt": "2021-06-07T16:50:54Z", "content": "Covid vaccine manufacturer Moderna has today asked European drug regulators for permission to give its jab to children.\r\nThe US-based company submitted its request to the European Medicines Agency wi… [+6076 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moderna Seeks Approval Of Covid Vaccine For Teens In Europe, Canada - NDTV", "description": "US biotech firm Moderna said Monday it was seeking conditional approval for use of its Covid-19 vaccine on teens in Europe and Canada, in what will assuredly be a boost for inoculation campaigns.", "url": "https://www.ndtv.com/world-news/moderna-seeks-approval-of-covid-19-vaccine-for-teens-in-europe-canada-2458408", "urlToImage": "https://c.ndtvimg.com/2021-04/r9rjee5g_moderna-covid19-vaccine_625x300_06_April_21.jpg", "publishedAt": "2021-06-07T12:50:41Z", "content": "Moderna has also planned to file for emergency approval with US Food and Drug Administration. (File)\r\nWashington: US biotech firm Moderna said Monday it was seeking conditional approval for use of it… [+1900 chars]"}]}