{"articles": [{"author": "Greg Allen", "content": "Much has been made of the size of the 23-strong Irish team which will compete over the four days of the upcoming European Indoor Championships in Torun this weekend, but ultimately the currency of su… [+7239 chars]", "description": "Much has been made of the size of the 23-strong Irish team which will compete over the four days of the upcoming European Indoor Championships in Torun this weekend, but ultimately the currency of success is medals and winning even one from four days of compe…", "publishedAt": "2021-03-04T08:01:20Z", "source": {"id": "rte", "name": "RTE"}, "title": "Daunting task for strong Irish team at European Indoors - RTE.ie", "url": "https://www.rte.ie/sport/athletics/2021/0304/1200860-daunting-task-for-strong-irish-team-at-european-indoors/", "urlToImage": "https://img.rasset.ie/001654cc-1600.jpg"}, {"author": "https://www.facebook.com/chapree", "content": "Almost three months after its debut in Europe, the Nokia 5.4 has now made its way to Malaysia. Its availability in our market was confirmed earlier today by HMD Globals partner in Malaysia, Macpie Di… [+1189 chars]", "description": "Almost three months after its debut in Europe, the Nokia 5.4 has now made its way to Malaysia. Its availability in our market was confirmed earlier today by HMD Global’s partner in Malaysia, Macpie Distribution.    In", "publishedAt": "2021-03-04T06:19:37Z", "source": {"id": null, "name": "Lowyat.NET"}, "title": "Nokia 5.4 Now Available In Malaysia For RM 899 - Lowyat.NET", "url": "https://www.lowyat.net/2021/234094/nokia-5-4-malaysia-official-price/", "urlToImage": "https://www.lowyat.net/wp-content/uploads/2021/03/nokia-5-4-01.jpg"}, {"author": "Anadolu", "content": "Amid concerns over the spread of new coronavirus variants, the EU has expressed determination to speed up its vaccination program, which began on Dec. 27.\r\nThe European Medicines Agency greenlighted … [+4633 chars]", "description": "Amid concerns over the spread of new coronavirus variants, the EU has expressed determination to speed up its vaccination program, which began on Dec. 27. The European Medicines Agency greenlighted the use of the vaccine developed by Pfizer-BioNTech, and late…", "publishedAt": "2021-03-03T11:15:24Z", "source": {"id": null, "name": "The Nation"}, "title": "Why is EU lagging behind in COVID-19 vaccinations? - The Nation", "url": "https://nation.com.pk/03-Mar-2021/why-is-eu-lagging-behind-in-covid-19-vaccinations", "urlToImage": "https://nation.com.pk/digital_images/large/2021-03-03/why-is-eu-lagging-behind-in-covid-19-vaccinations-1614770111-3459.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "europe"}