{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "COVID-19: Regulator increases time Pfizer jab can be stored in a fridge to one month - Sky News", "description": "The changes to its handling are expected to have a \"significant impact\" on the planning and logistics of its roll-out in Europe.", "url": "https://news.sky.com/story/covid-19-regulator-increases-time-pfizer-jab-can-be-stored-in-a-fridge-to-one-month-12309663", "urlToImage": "https://e3.365dm.com/21/02/1600x900/skynews-pfizer-biontech-vaccine_5285236.jpg?20210225203943", "publishedAt": "2021-05-18T06:58:08Z", "content": null}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "AfDB, EBRD partner to address $2.5t financing gap in Africa - Guardian", "description": "The African Development Bank Group (AfDB) and the European Bank for Reconstruction and Development (EBRD) have signed a memorandum of understanding to promote sustainable private sector development in Africa.", "url": "https://guardian.ng/business-services/afdb-ebrd-partner-to-address-2-5t-financing-gap-in-africa/", "urlToImage": "https://guardian.ng/wp-content/uploads/2020/02/afdb.jpg", "publishedAt": "2021-05-18T04:10:52Z", "content": "The African Development Bank Group (AfDB) and the European Bank for Reconstruction and Development (EBRD) have signed a memorandum of understanding to promote sustainable private sector development i… [+2166 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Antony Thrower", "title": "EU is set to agree to allow in British tourists who can prove they've had Covid jabs - Daily Mail", "description": "The EU is expected to sign off on plans for people from Britain who have had both jabs to fly anywhere in Europe without having to quarantine on their arrival or show a negative Covid test.", "url": "https://www.dailymail.co.uk/news/article-9589403/EU-set-welcome-British-holidaymakers-Covid-vaccine-passports.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/17/23/43106399-0-image-a-72_1621291179882.jpg", "publishedAt": "2021-05-17T22:29:41Z", "content": "The EU is expected to sign off on plans for Britons who have had both jabs to fly to Europe without having to quarantine or take a Covid test. \r\nThe European Union's new plan would see member states … [+34937 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Kane tells Spurs he wants to leave club before Euros - Sky Sports - The Star Online", "description": "(Reuters) -     Tottenham Hotspur striker Harry Kane has informed the Premier League club of his desire to leave this summer, with the England international looking to resolve his future before next month's European Championship, Sky Sports reported on Monday.", "url": "https://www.thestar.com.my/sport/football/2021/05/18/soccer-kane-tells-spurs-he-wants-to-leave-club-before-euros---sky-sports", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/18/1151961.JPG", "publishedAt": "2021-05-17T19:11:00Z", "content": "(Reuters) - Tottenham Hotspur striker Harry Kane has informed the Premier League club of his desire to leave this summer, with the England international looking to resolve his future before next mont… [+1514 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "`Rich countries can donate more jabs’ – The Manila Times - The Manila Times", "description": "Countries belonging to the G7 and the European Union can afford to donate more than 150 million vaccines to countries in need without compromising their own goals, United Nations Children’s Emergency Fund (Unicef) said Monday. The world’s seven richest states…", "url": "https://www.manilatimes.net/2021/05/18/news/national/rich-countries-can-donate-more-jabs/873673/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/02/TMTFB_1920x1008.jpg", "publishedAt": "2021-05-17T16:02:44Z", "content": "Countries belonging to the G7 and the European Union can afford to donate more than 150 million vaccines to countries in need without compromising their own goals, United Nations Childrens Emergency … [+2444 chars]"}, {"source": {"id": null, "name": "Vulture"}, "author": "Justin Curto", "title": "Watch Pink and Her Children Frolic Through Europe in Her New Documentary - Vulture", "description": "“The only way I can justify dragging my family all over the world is that we’re making memories together.”", "url": "https://www.vulture.com/2021/05/pink-all-i-know-so-far-clip-daughters.html", "urlToImage": "https://pyxis.nymag.com/v1/imgs/695/16e/10a587be1beccaf5cdb1f88b88223e57cb-pink-.1x.rsocial.w1200.jpg", "publishedAt": "2021-05-17T15:00:05Z", "content": "Pink is one of pops best touring musicians, finding career longevity with a reputation for live shows that literally soar. Shes also a mom of two who isnt afraid to be open about the experience. Pink… [+1302 chars]"}]}