{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "EU regulator advices against second AstraZeneca shot in those with blood clots - Reuters", "description": "Europe's drug regulator said on Friday AstraZeneca's COVID-19 vaccine must not be given to anyone who has had blood clots with low blood platelets after receiving the shot, and that patients must be monitored for signs within three weeks of vaccination.", "url": "https://www.reuters.com/article/health-coronavirus-astrazeneca-ema-idUSL3N2N82YV", "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800", "publishedAt": "2021-05-21T12:04:23Z", "content": "By Reuters Staff\r\nMay 21 (Reuters) - Europes drug regulator said on Friday AstraZenecas COVID-19 vaccine must not be given to anyone who has had blood clots with low blood platelets after receiving t… [+393 chars]"}, {"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/mariella-moon", "title": "NASA, ESA and JAXA want to figure out COVID-19's environmental effects - Engadget", "description": "NASA, the European Space Agency and the Japan Aerospace Exploration Agency (JAXA) are hosting a hackathon to figure out COVID-19's environmental effect..", "url": "https://www.engadget.com/nasa-esa-jaxa-covid-19-environmental-effects-115033335.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/08676f70-ba18-11eb-b9ef-309fde6f2a32", "publishedAt": "2021-05-21T11:48:45Z", "content": "The COVID-19 pandemic has changed the way the world works, and large-scale lockdowns, the shift to work-from-home arrangements, as well as the increase in medical waste would have corresponding effec… [+1464 chars]"}, {"source": {"id": null, "name": "European Gaming Industry News"}, "author": "George Miller", "title": "SPORTS BRAND HUMMEL PARTNER WITH FIFA COMMUNITY BRAND – European Gaming Industry News - European Gaming Industry News", "description": "Hummel Announced as Official Kit Partner For 2022 FIFA Esports Season FUTWIZ, the ultimate FIFA community brand with more than a million registered users, today announces their partnership with leading sports and lifestyle brand hummel to become the Official …", "url": "https://europeangaming.eu/portal/latest-news/2021/05/21/92858/sports-brand-hummel-partner-with-fifa-community-brand/", "urlToImage": "https://i0.wp.com/europeangaming.eu/portal/wp-content/uploads/2021/05/fw-hummel.jpg?resize=1000%2C600&ssl=1", "publishedAt": "2021-05-21T06:55:50Z", "content": "Reading Time: 2minutesTier One Entertainment announced their partnership with the worlds leading media investment company, GroupM. As the first and only Philippine esports and gaming company GroupM i… [+3040 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Europe plans sat-nav and telecoms network at the Moon - BBC News", "description": "A satellite constellation would tell astronauts and robots their exact position on the lunar surface.", "url": "https://www.bbc.co.uk/news/science-environment-57191359", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/1750A/production/_118589459_habitats_grouped_together_pillars.jpg", "publishedAt": "2021-05-20T15:22:56Z", "content": "Jonathan AmosScience correspondent@BBCAmoson Twitter\r\nimage copyrightPierre Carril/TAS\r\nimage captionArtwork: Europe will work with the US on its Artemis project\r\nThe European Space Agency is proposi… [+5403 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}]}