{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ellen Francis", "title": "Europeans, Zelensky cite unity with Trump ahead of Putin summit in Alaska - The Washington Post", "description": "European leaders said a call with President Donald Trump was unifying and that he agreed Ukraine should be part of any negotiations over territory, but some still worry he could give in to Russian President Vladimir Putin.", "url": "https://www.washingtonpost.com/world/2025/08/13/europe-trump-putin-alaska-summit/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EWXP7SG2KL7W42RLZVOSD2GZZE.JPG&w=1440", "publishedAt": "2025-08-14T02:32:06Z", "content": "European leaders said a call with President Donald Trump was unifying and that he agreed Ukraine should be part of any negotiations over territory, but some still worry he could give in to Russian Pr… [+86 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, Isabelle Khurshudyan, Zachary Cohen, Natasha Bertrand, Jennifer Hansler", "title": "Ahead of summit, Trump questions what’s changed about Putin - CNN", "description": "President Donald Trump has often bragged about his warm relationship with Russia’s Vladimir Putin. But in the months leading up to the leaders’ first meeting in six years, Trump began asking Europeans and White House aides what’s changed about his counterpart.", "url": "https://www.cnn.com/2025/08/13/politics/us-intel-skeptical-putin-alaska-summit", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-1000092400.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-08-13T23:37:00Z", "content": "President Donald Trump has often bragged about his warm relationship with Russias Vladimir Putin. But in the months leading up to the leaders first meeting in six years, Trump began asking Europeans … [+10940 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Teri Schultz", "title": "Zelenskyy in Berlin for critical talks with European leaders and Trump - NPR", "description": "President Trump will join European leaders and Ukrainian President Volodymyr Zelenskyy for an emergency virtual summit on Wednesday, ahead of the U.S. president's meeting with Putin on Friday.", "url": "https://www.npr.org/2025/08/13/nx-s1-5500465/european-leaders-to-hold-emergency-virtual-summit-with-trump-on-wednesday", "urlToImage": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4180x2351+0+309/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F16%2F58%2Fa4fdcb654ef497048e5c23192a6c%2Fgettyimages-2229124939.jpg", "publishedAt": "2025-08-13T08:57:53Z", "content": "INKOO, Finland Ukraine's President has arrived in Berlin ahead of a series of high stakes European summits on Wednesday. Volodymyr Zelenskyy was met by German Chancellor Friedrich Merz ahead of a ser… [+2833 chars]"}]}