{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Independent.ie"}, "author": "Tim Healy", "title": "School's case over 'coarse and vulgar' Instagram posts about staff and students referred to European Court of Justice - Independent.ie", "description": "A legal dispute over efforts by a school to find out who is behind a closed down Instagram account which made &quot;coarse and vulgar&quot; remarks about certain staff and students is to be referred to the European Court of Justice (ECJ).", "url": "https://www.independent.ie/irish-news/courts/schools-case-over-coarse-and-vulgar-instagram-posts-about-staff-and-students-referred-to-european-court-of-justice-40444244.html", "urlToImage": "https://www.independent.ie/irish-news/courts/e9543/40444243.ece/AUTOCROP/w1240h700/court%20court.jpg", "publishedAt": "2021-05-19T09:26:00Z", "content": "A legal dispute over efforts by a school to find out who is behind a closed down Instagram account which made \"coarse and vulgar\" remarks about certain staff and students is to be referred to the Eur… [+4441 chars]"}, {"source": {"id": null, "name": "Cork Beo"}, "author": "Frances Watkins", "title": "Home fitness brand Peloton eyes up Cork office with potential for 700 new jobs - Cork Beo", "description": "The fitness company are reportedly looking to expand their European operations in Ireland", "url": "https://www.corkbeo.ie/news/jobs/home-fitness-brand-peloton-eyes-20628186", "urlToImage": "https://i2-prod.corkbeo.ie/incoming/article20628256.ece/ALTERNATES/s1200/4_JS200838323.jpg", "publishedAt": "2021-05-19T07:13:15Z", "content": "Home fitness brand Peloton are reportedly eyeing up a massive site in Cork to expand their European operations and potentially create 700 new jobs. \r\nThe company is weighing up plans to set up on Lee… [+1075 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Buhari seeks debt relief for African countries - Punch Newspapers", "description": "Buhari (retd.), on Tuesday in Paris, France, called on European countries and global financial institutions to consider debt relief for", "url": "https://punchng.com/buhari-seeks-debt-relief-for-african-countries/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/05/14062848/Muhammadu-Buhari.jpg", "publishedAt": "2021-05-19T06:27:11Z", "content": "Published19 May 2021\r\nThe President, Major General Muhammadu Buhari (retd.), on Tuesday in Paris, France, called on European countries and global financial institutions to consider debt relief for Af… [+2307 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Sterling Walker", "title": "The orbiting solar probe saw its first solar flare and provided us with a beautiful video - Awani Review", "description": "Last February, the European Space Agency (ESA) and NASA sent their Solar Orbiter probe to enjoy our beautiful sun from every angle. An opportunity for the", "url": "https://www.awanireview.com/the-orbiting-solar-probe-saw-its-first-solar-flare-and-provided-us-with-a-beautiful-video/", "urlToImage": null, "publishedAt": "2021-05-18T23:58:18Z", "content": "Last February, the European Space Agency (ESA) and NASA sent their Solar Orbiter probe to enjoy our beautiful sun from every angle. An opportunity for the probe to observe and photograph its first so… [+2749 chars]"}, {"source": {"id": null, "name": "Icirnigeria.org"}, "author": "Vincent Ufuoma", "title": "Nigerians advised to consider other social media platforms as WhatsApp implements new policy | International Centre for Investigative Reporting - Internatinal Centre For Investigative Reporting", "description": "THE National Information Technology Development Agency (NITDA) has advised Nigerians to consider adopting other social media platforms as WhatsApp implements a new privacy policy for its users worldwide, except countries under the European Union.The", "url": "https://www.icirnigeria.org/nigerians-advised-to-consider-other-social-media-platforms-as-whatsapp-implements-new-policy/", "urlToImage": "https://www.icirnigeria.org/wp-content/uploads/2020/08/WhatsApp-Image-2020-08-23-at-9.18.57-PM.jpeg", "publishedAt": "2021-05-18T11:36:02Z", "content": "We need your support to produce excellent journalism at all times. \r\nTHE National Information Technology Development Agency (NITDA) has advised Nigerians to consider adopting other social media platf… [+3064 chars]"}]}