{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "'Monkeypox cases drop 21%, reversing month-long increase' - Daily Pioneer", "description": "The number of monkeypox cases reported globally dropped by 21% in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting to decline, according to a World Health Organisation report issued …", "url": "https://www.dailypioneer.com/2022/world/---monkeypox-cases--drop-21---reversing--month-long-increase---.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-08-25T20:53:08Z", "content": "The number of monkeypox cases reported globally dropped by 21% in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting to decl… [+2725 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kieran Gill", "title": "Viborg 0-3 West Ham (agg 1-6): Hammers sail into the Conference League group stage - Daily Mail", "description": "KIERAN GILL: Memories of losing to Romanian minnows Astra Giurgiu - twice - in 2015 and 2016 to miss out on Europe remain vivid, but the Hammers encountered no such trouble last night.", "url": "https://www.dailymail.co.uk/sport/live/article-11133927/Viborg-vs-West-Ham-Europa-Conference-League-2022-23-Live-Result.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/25/19/61734701-0-image-a-64_1661453901902.jpg", "publishedAt": "2022-08-25T19:35:27Z", "content": "West Ham will embark on a European adventure this season after a night in which Gianluca Scamacca showed David Moyes why he should start against Aston Villa on Sunday.\r\nThe clubs new £35.5million sig… [+2638 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "Ukrainian nuclear plant near fighting is cut off from power grid - TheJournal.ie", "description": "The Zaporizhzhia plant operator said the cut-off meant two remaining reactors at Europe’s biggest nuclear power plant were disconnected from the grid.", "url": "https://www.thejournal.ie/ukraine-nuclear-plant-5849713-Aug2022/", "urlToImage": "https://img2.thejournal.ie/article/5849713/river/?height=400&version=5849728", "publishedAt": "2022-08-25T18:32:00Z", "content": "UKRAINES NUCLEAR POWER operator has said the Zaporizhzhia plant has been cut off from the electricity grid for the first time after fires damaged the last remaining transmission line.\r\nIt was not cle… [+4823 chars]"}, {"source": {"id": null, "name": "Gizmodo Australia"}, "author": null, "title": "Webb Telescope Just Detected Carbon Dioxide in a Distant World - Gizmodo Australia", "description": "Webb Space Telescope has detected “unequivocal” evidence of carbon dioxide in a distant exoplanet’s atmosphere, according to a European Space...", "url": "https://www.gizmodo.com.au/2022/08/webb-telescope-just-detected-carbon-dioxide-in-a-distant-world/", "urlToImage": "https://www.gizmodo.com.au/wp-content/uploads/sites/2/2022/08/26/52dd27fce94e0937c3af6ea96e62eba4.jpg?quality=80&resize=1280,720", "publishedAt": "2022-08-25T16:32:00Z", "content": "Webb Space Telescope has detected unequivocal evidence of carbon dioxide in a distant exoplanets atmosphere, according to a European Space Agency release. According to the ESA, it is the first clear,… [+2591 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Monkeypox cases drop 21% globally, reversing month-long increase: WHO - CBC News", "description": "The number of monkeypox cases reported globally dropped by 21 per cent in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting to decline, according to a new report from the World Health…", "url": "https://www.cbc.ca/news/health/world-health-organization-monkeypox-cases-1.6561689", "urlToImage": "https://i.cbc.ca/1.6538319.1660858880!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/health-monkeypox-india.JPG", "publishedAt": "2022-08-25T13:45:49Z", "content": "The number of monkeypox cases reported globally dropped by 21 per cent in the last week, reversing a month-long trend of rising infections and a possible signal the outbreak in Europe may be starting… [+4845 chars]"}]}