{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Meta will cease political ads in European Union by fall, blaming bloc’s new rules - AP News", "description": "Meta has announced it will stop all political advertising in the European Union by October. The decision comes in response to new EU rules aimed at increasing transparency in election campaigns. Meta says the regulations create significant operational challen…", "url": "https://apnews.com/article/meta-instagram-facebook-eu-european-union-political-89efeac96723308d2a0469740d24d433", "urlToImage": "https://dims.apnews.com/dims4/default/d734a41/2147483647/strip/true/crop/6528x3672+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5e%2Fae%2F0ff6e842a50e28f929f86b43d16d%2F9c53a94fad0641ada09f3fc9b8197233", "publishedAt": "2025-07-25T12:47:00Z", "content": "LONDON (AP) Facebook and Instagram owner Meta said Friday that it will stop all political advertising in the European Union by October, blaming legal uncertainty over new rules designed to increase t… [+1945 chars]"}, {"source": {"id": null, "name": "SamMobile"}, "author": "Mihai Matei", "title": "Galaxy Z Fold 7 is a hit in Europe, Blue Shadow shines worldwide - SamMobile", "description": "Recently, the European Union introduced a rule that brands should offer a label for their phones that shows their energy efficiency, battery life and longevity, durability against drops, IP rating for water and dust resistance, and repairability scores. Well,…", "url": "https://www.sammobile.com/news/galaxy-z-fold-7-battery-durability-repairability-details-revealed/", "urlToImage": "https://www.sammobile.com/wp-content/uploads/2025/07/Samsung-Galaxy-Z-Fold-7-19-1200x675.jpg", "publishedAt": "2025-07-25T11:48:00Z", "content": "While announcing the global launch of the Galaxy Z Fold 7, Flip 7/7FE, and Watch 8 earlier today, Samsung snuck in an exciting detail regarding early pre-order numbers. The Galaxy Z Fold 7 in Europe … [+1962 chars]"}]}