{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "ECG can pinpoint hospitalized COVID-19 patients at high risk of mortality - News-Medical.Net", "description": "A simple electrocardiogram (ECG) can pinpoint hospitalized COVID-19 patients at high risk of death who might need intensive management. That's the finding of a study presented at EHRA 2022, a scientific congress of the European Society of Cardiology.", "url": "https://www.news-medical.net/news/20220404/ECG-can-pinpoint-hospitalized-COVID-19-patients-at-high-risk-of-mortality.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Intensive_Care-620x480.jpg", "publishedAt": "2022-04-05T00:12:00Z", "content": "A simple electrocardiogram (ECG) can pinpoint hospitalized COVID-19 patients at high risk of death who might need intensive management. That's the finding of a study presented at EHRA 2022, a scienti… [+3788 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Maina Maina", "title": "Insecurity: EU delivers 30 boats, forensic equipment to Nigeria, others - Daily Post Nigeria", "description": "The European Union is to deliver an array of security hardware including 30 rigid-hull inflatable boats and forensic equipment to the Economic Community of West African States to tackle maritime crime and other security challenges in West Africa. The issue of…", "url": "https://dailypost.ng/2022/04/04/insecurity-eu-delivers-30-boats-forensic-equipment-to-nigeria-others/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/04/EU.jpeg", "publishedAt": "2022-04-04T17:44:37Z", "content": "The European Union is to deliver an array of security hardware including 30 rigid-hull inflatable boats and forensic equipment to the Economic Community of West African States to tackle maritime crim… [+3098 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Lili Bayer", "title": "Hungarian election wasn’t a fair fight, observers say - POLITICO Europe", "description": "Media bias and murky campaign finance rules favored Prime Minister Viktor Orbán’s government, according to international experts.", "url": "http://www.politico.eu/article/hungary-election-level-playing-field-fair-observer/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/04/04/GettyImages-1239662631-scaled.jpg", "publishedAt": "2022-04-04T17:08:10Z", "content": "BUDAPEST International observers raised concerns Monday about Hungarys general election, saying the electoral conditions had been tilted in favor of Prime Minister Viktor Orbán’s government.\r\nOrbáns … [+2784 chars]"}]}