{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Four suspects charged in probe into European Parliament bribery by Gulf state - BBC", "description": "A Gulf state - reportedly Qatar - is accused of attempting to bribe parliament officials.", "url": "https://www.bbc.com/news/world-europe-63936360", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/C090/production/_127969294_mediaitem127969293.jpg", "publishedAt": "2022-12-11T15:02:46Z", "content": "Four people have been charged in an investigation into suspected bribery at the European Parliament by a Gulf state - reportedly Qatar.\r\nGreek MEP and European Parliament Vice President Eva Kaili was… [+2758 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bloomberg", "title": "Russia is feeling the pain of Europe’s oil embargo - Economic Times", "description": "The US Administration feared that EU sanctions on Russias seaborne crude, which came into effect on Monday, would send prices soaring. The particular worry was a ban on the provision of ships and services like insurance and financing for Russian cargoes movin…", "url": "https://economictimes.indiatimes.com/news/international/business/russia-is-feeling-the-pain-of-europes-oil-embargo/articleshow/96148465.cms", "urlToImage": "https://img.etimg.com/thumb/msid-96148493,width-1070,height-580,imgsize-32632,overlay-economictimes/photo.jpg", "publishedAt": "2022-12-11T08:50:00Z", "content": "A near-total ban on imports of Russian crude into the European Union is finally hitting Russias oil revenue. Concerns that it would provide the Kremlin with a windfall to fund its war in Ukraine have… [+3486 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Huawei P40 Lite grabs November 2022 update in Europe - HC Newsroom", "description": "Huawei is rolling out a November 2022 EMUI update for the P40 Lite smartphone in Europe that includes various new security improvements for the smartphone. This software rollout was spotted first earlier this month. Huaweiblog reports that the November 2022 f…", "url": "https://www.huaweicentral.com/huawei-p40-lite-grabs-november-2022-update-in-europe/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/10/huawei-p40-lite-ig1-1000x576.jpg", "publishedAt": "2022-12-11T04:54:37Z", "content": "A few days ago, Huawei summarized December EMUI security patch details. Now, Huawei released the list of monthly and quarterly EMUI devices for December 2022. These phones are eligible to get the lat… [+1732 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "PM Lee to officiate launch of RSN submarines in Germany, attend ASEAN-EU summit in Brussels - CNA", "description": "SINGAPORE: Prime Minister Lee Hsien Loong will make an official visit to Germany this week, as well as attend the ASEAN-European Union (EU) commemorative summit in Brussels. He will visit Kiel on Monday (Dec 12) and Tuesday, where he will meet German Chancell…", "url": "https://www.channelnewsasia.com/singapore/pm-lee-officiate-launch-rsn-submarines-germany-attend-asean-eu-summit-brussels-3136956", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--UXm2DoDc--/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/mediacorp/cna/image/2022/11/13/BT7_7226.jpeg?itok=UM5_WFes", "publishedAt": "2022-12-11T04:01:48Z", "content": "SINGAPORE: Prime Minister Lee Hsien Loong will make an official visit to Germany this week, as well as attend the ASEAN-European Union (EU) commemorative summit in Brussels.\r\nHe will visit Kiel on Mo… [+1107 chars]"}]}