{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "Reuters", "title": "SpaceX capsule carrying latest astronaut crew docks with International Space Station - Deccan Herald", "description": "Four astronauts, three from NASA and one from the European Space Agency, arrived at the International Space Station (ISS) on Wednesday and docked their SpaceX capsule, just two days after the last crew to depart the orbiting outpost returned to Earth. Rendezv…", "url": "https://www.deccanherald.com/international/world-news-politics/spacex-capsule-carrying-latest-astronaut-crew-docks-with-international-space-station-1104592.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/04/28/2022-04-27t084818z1664975472rc2jvt9ishjartrmadp3space-exploration-spacexjpg-1104592-1651113177.jpg", "publishedAt": "2022-04-28T02:32:57Z", "content": "Four astronauts, three from NASA and one from the European Space Agency, arrived at the International Space Station (ISS) on Wednesday and docked their SpaceX capsule, just two days after the last cr… [+4254 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Matina Stevis-Gridneff, Neil MacFarquhar, Shashank Bengali, Megan Specia", "title": "Ukraine-Russia War News: Live Updates - The New York Times", "description": "The Kremlin halted natural gas shipments to Poland and Bulgaria in its toughest response yet to European sanctions. Explosions inside Russia near the Ukraine border raised fears that the war might spread.", "url": "https://www.nytimes.com/live/2022/04/27/world/ukraine-russia-war-news", "urlToImage": "https://static01.nyt.com/images/2022/04/27/world/27ukraine-blog-header-830pm/27ukraine-blog-header-830pm-facebookJumbo.jpg", "publishedAt": "2022-04-28T02:24:00Z", "content": "BRUSSELS Reverberations from the Ukraine war widened on Wednesday, jolting energy markets and spilling across borders, as Russia responded to the Wests escalating arms shipments and economic penaltie… [+9464 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "SpaceX capsule carrying latest astronaut crew docks with International Space Station - Malay Mail", "description": "CAPE CANAVERAL, April 28 — Four astronauts, three from Nasa and one from the European Space Agency, arrived ahead of schedule at the International Space Station (ISS) on Wednesday and docked their SpaceX capsule, just two days after the last crew to depart th…", "url": "https://www.malaymail.com/news/world/2022/04/28/spacex-capsule-carrying-latest-astronaut-crew-docks-with-international-spac/2056051", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-04/20220409_SpaceX_Private_Space_AFP-seo.jpg", "publishedAt": "2022-04-28T00:39:09Z", "content": "A SpaceX Falcon 9 rocket carrying the companys Crew Dragon spacecraft is launched on Axiom Mission 1 to the International Space Station, at Nasas Kennedy Space Centre in Florida April 8, 2022. Pictur… [+1114 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": "Rob Dawson", "title": "Manchester United won't 'give away' remaining games this season - Ralf Rangnick - ESPN", "description": "Ralf Rangnick has accepted that Erik ten Hag's first season as Manchester United manager may be easier to navigate without European football.", "url": "https://www.espn.com/soccer/manchester-united-engman_utd/story/4652251/manchester-united-wont-give-away-remaining-games-this-season-ralf-rangnick", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0313%2Fr985762_1296x729_16%2D9.jpg", "publishedAt": "2022-04-27T22:40:54Z", "content": "Ralf Rangnick has accepted that Erik ten Hag's first season as Manchester United manager may be easier to navigate without European football, but insists that will not stop his team trying to finish … [+2492 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Patrick Wintour", "title": "UK leading G7 allies to weaken Putin’s military arsenal - The Guardian", "description": "Western nations aim to blunt Russia’s ability to wage future wars in Europe after Ukraine invasion", "url": "https://amp.theguardian.com/world/2022/apr/27/uk-leading-g7-allies-to-weaken-putins-military-arsenal", "urlToImage": "https://i.guim.co.uk/img/media/8c36a8dd60d4b600bb1a670afa86c073bbbaa2a5/0_161_3621_2173/master/3621.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=073544566083a080fad42d67819fb616", "publishedAt": "2022-04-27T21:16:00Z", "content": "Britain is pressing with its allies for Vladimir Putin to be so weakened militarily by the war in Ukraine that he can never pose a threat to European security and his forces to entirely leave Ukraine… [+2995 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "Crew-4: NASA TV Coverage Continues, Dragon Ahead of Schedule for Docking - NASA (.gov)", "description": "NASA Television, the NASA app, and the agency’s website are providing live continuous coverage of NASA’s SpaceX Crew-4 mission carrying NASA astronauts Kjell Lindgren, Bob Hines, and Jessica Watkins, and ESA (European Space Agency) astronaut Samantha Cristofo…", "url": "https://blogs.nasa.gov/spacestation/2022/04/27/crew-4-nasa-tv-coverage-continues-dragon-ahead-of-schedule-for-docking/", "urlToImage": "https://blogs.nasa.gov/spacestation/wp-content/uploads/sites/240/2022/04/jsc2022e011416_blog.png", "publishedAt": "2022-04-27T21:15:19Z", "content": "NASA astronaut and SpaceX Crew-4 Commander Kjell Lindgren, representing NASA’s Commercial Crew Program, is pictured during a training session inside a mockup of the Crew Dragon vehicle at SpaceX Head… [+1084 chars]"}, {"source": {"id": null, "name": "Patently Apple"}, "author": "Jack Purcher", "title": "Apple Ireland opens a first-of-its-kind product testing facility in Europe while Apple U.S. hires Anti-Union lawyers and more - Patently Apple", "description": "It's being report today that Apple has opened a new multi-million euro engineering and test facility at its campus in Hollyhill in a significant addition to its operations in Cork. In other Apple news, the company has hired anti-union lawyers...", "url": "https://www.patentlyapple.com/2022/04/apple-ireland-opens-a-first-of-its-kind-product-testing-facility-in-europe-while-apple-us-hires-anti-union-lawyers-and-more.html", "urlToImage": "https://patentlyapple.typepad.com/.a/6a0120a5580826970c02942fa7896f200c-600wi", "publishedAt": "2022-04-26T21:19:41Z", "content": "It's being report today that Apple has opened a new multi-million euro engineering and test facility at its campus in Hollyhill in a significant addition to its operations in Cork.\r\nLocated in the fo… [+2186 chars]"}, {"source": {"id": null, "name": "Vaccinestoday.eu"}, "author": "Gary Finnegan", "title": "'Long Life for All' - VaccinesToday - Vaccines Today", "description": "WHO Europe: ‘Vaccines help children get a good start to life and continue to keep people safe from many diseases throughout their lives.’", "url": "https://www.vaccinestoday.eu/stories/long-life-for-all/", "urlToImage": "https://www.vaccinestoday.eu/wp-content/uploads/2022/04/An-elderly-woman-talking-to-a-young-woman.jpg", "publishedAt": "2022-04-26T12:21:39Z", "content": "WHO Europe: Vaccines help children get a good start to life and continue to keep people safe from many diseases throughout their lives.Health systems in Europe are catching up on vaccine appointments… [+5391 chars]"}]}