{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "European Space Agency wants to connect the moon to Earth! - SwordsToday.ie", "description": "C 'The new lunar attack is a grand project driven by a desire to make Europe a major player. The European Space Agency (ESA) plans to launch a cluster of", "url": "https://swordstoday.ie/european-space-agency-wants-to-connect-the-moon-to-earth/", "urlToImage": null, "publishedAt": "2021-05-22T03:49:30Z", "content": "C ‘The new lunar attack is a grand project driven by a desire to make Europe a major player. The European Space Agency (ESA) plans to launch a cluster of three or five satellites into orbit around th… [+2382 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Andre-Pierre Cronje", "title": "Serfontein, Goosen combine to seal Challenge Cup win for Montpellier - SARugbymag", "description": "A moment of magic from Springboks Jan Serfontein and Johan Goosen inspired Montpellier to an 18-17 victory over Leicester Tigers in the European Challenge Cup final.", "url": "https://www.sarugbymag.co.za/serfontein-goosen-challenge-cup-1/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2020/10/Jan_Serfontein_Montpellier_.jpg", "publishedAt": "2021-05-21T21:39:13Z", "content": "A moment of magic from Springboks Jan Serfontein and Johan Goosen inspired Montpellier to an 18-17 victory over Leicester Tigers in the European Challenge Cup final.\r\nREAD: From famine to feast for S… [+3031 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Andrew McGarry, Yasmin Jeffery", "title": "Eurovision 2021 song contest's top 10 favourites face showdown in Rotterdam - ABC News", "description": "Australia's no longer in it to win it, but the good news is Europe's entries are *giving* this year. Who are you going to support out of the hot favourites to win the Eurovision Song Contest?", "url": "https://www.abc.net.au/news/2021-05-22/eurovision-2021-favourites-win-song-contest-rotterdam/100153888", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2e56c42e172948b57062cff864f89f66?impolicy=wcms_crop_resize&cropH=2808&cropW=4991&xPos=0&yPos=94&width=862&height=485", "publishedAt": "2021-05-21T18:45:43Z", "content": "The Eurovision Song Contest is back in all its glory after a year off due to COVID-19. \r\nAll you need to know about Eurovision\r\nIt's Eurovision Song Contest time again. Whether you're a newbie or a l… [+9968 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Natacha Larnaud", "title": "American tourists are making Europe summer travel plans. But many Europeans who work in the U.S. still can't visit home - CBS News", "description": "\"The E.U. reopening borders to non-essential travel is a positive step forward. Nevertheless, the fact that thousands of Europeans living in the U.S. under a visa might still have to wait to do the same seems pretty inconsistent,\" said one visa holder.", "url": "https://www.cbsnews.com/news/american-travel-europe-summer/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/05/21/180fc527-df27-48ca-acdc-036454693aec/thumbnail/1200x630/3ea9b8e094f4d1f482ba5c0b0d463444/gettyimages-1228039400.jpg", "publishedAt": "2021-05-21T18:37:00Z", "content": "As many vaccinated Americans make plans to visit Europe this summer following a full year of travel restrictions, many Europeans who live and work in the United States can't go home — if they do, the… [+4110 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Kolbe faces former Stormers touring room-mate Leyds in European Champions Cup final - News24", "description": "Springboks Cheslin Kolbe and Rynhardt Elstadt of Toulouse will face off against compatriots Raymond Rhule and Dillyn Leyds of La Rochelle in the European Champions Cup final.", "url": "https://www.news24.com/sport/rugby/springboks/kolbe-faces-former-stormers-touring-room-mate-leyds-in-european-champions-cup-final-20210521", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/491/93aa3a1931a24d0699113db07d5768bc.png", "publishedAt": "2021-05-21T15:11:36Z", "content": "<ul><li>Toulouse's Cheslin Kolbe and Rynhardt Elstadt face off against fellow Springboks Raymond Rhule and Dillyn Leyds against La Rochelle in the European Champions Cup final.</li><li>Of the two Fre… [+3060 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Pushkala Aripaka", "title": "EU advises against second AstraZeneca shot for people with blood clots - Reuters", "description": "The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving the first, Europe's medicines regulator said on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-astrazeneca-ema-idUSKCN2D21EU", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210521&t=2&i=1562951231&r=LYNXNPEH4K0Q9&w=800", "publishedAt": "2021-05-21T13:29:07Z", "content": "(Reuters) -The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving t… [+2060 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "European Space Agency reveals ambitious plans to build sat-nav around the moon - Daily Mail", "description": "The new infrastructure could turn our natural satellite into the 'eighth continent' as humanity spreads its wings and builds cities on the moon, according to the Paris-based space agency.", "url": "https://www.dailymail.co.uk/sciencetech/article-9604425/European-Space-Agency-reveals-ambitious-plans-build-sat-nav-moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/21/14/43272787-0-image-a-6_1621602667047.jpg", "publishedAt": "2021-05-21T13:10:28Z", "content": "The European Space Agency (ESA) has launched an ambitious new project to build a sat-nav and communication satellite network in orbit around the moon.\r\nThis new infrastructure could one day turn our … [+12926 chars]"}, {"source": {"id": null, "name": "Vanguard"}, "author": "David O Royal", "title": "EU COVID-19 passport scheme set to take effect on July 1 - Vanguard", "description": "The European Union’s COVID-19 certificate should be up and running by July 1.European Justice Commissioner Didier Reynders", "url": "https://www.vanguardngr.com/2021/05/eu-covid-19-passport-scheme-set-to-take-effect-on-july-1/", "urlToImage": "https://i2.wp.com/www.vanguardngr.com/wp-content/uploads/2021/05/960x0.jpg?fit=959%2C632&ssl=1", "publishedAt": "2021-05-21T12:49:06Z", "content": "The European Unions COVID-19 certificate should be up and running by July 1.\r\nEuropean Justice Commissioner Didier Reynders said on Friday, hailing a freshly struck deal on the scheme as good news fo… [+1402 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}]}