{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Cochrane Today"}, "author": "Matt O'brien And Raf Casert, The Associated Press", "title": "EU's Call of Duty: Probe Microsoft-Activision Blizzard deal - Cochrane Today", "description": "BRUSSELS (AP) — The European Union has launched an investigation into Microsoft’s planned takeover of video game giant Activision Blizzard, fearing the $69 billion deal would distort fair competition to popular titles like Call of Duty .", "url": "https://www.cochranetoday.ca/national-entertainment/eus-call-of-duty-probe-microsoft-activision-blizzard-deal-6072304", "urlToImage": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2022/11/20221108111136-636a8570821cf083b81fb536jpeg.jpg;w=1200;h=800;mode=crop", "publishedAt": "2022-11-08T22:56:28Z", "content": "BRUSSELS (AP) The European Union has launched an investigation into Microsofts planned takeover of video game giant Activision Blizzard, fearing the $69 billion deal would distort fair competition to… [+4504 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Genetic variant associated with slimness estimated to be present in almost 60% of the Europeans - News-Medical.Net", "description": "How much do genes influence our body weight? For the general population this influence is around 20%, according to studies that in recent years have analyzed the complete genome of tens of thousands of people.", "url": "https://www.news-medical.net/news/20221108/Genetic-variant-associated-with-slimness-estimated-to-be-present-in-almost-6025-of-the-Europeans.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg", "publishedAt": "2022-11-08T18:00:00Z", "content": "How much do genes influence our body weight? For the general population this influence is around 20%, according to studies that in recent years have analyzed the complete genome of tens of thousands … [+4708 chars]"}]}