{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Paddison", "title": "Heat waves in US and Europe would have been ‘virtually impossible’ without climate change, new report finds - CNN", "description": "Extreme heat waves across three continents this month were made significantly more likely by the human-caused climate crisis, according to a new analysis released Tuesday as temperatures are still blazing in parts of the Northern Hemisphere.", "url": "https://www.cnn.com/2023/07/25/world/heat-wave-climate-change-us-china-europe-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230724080131-heatwave-phoenix-071823.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-07-25T06:44:00Z", "content": "Extreme heat waves across three continents this monthwere made significantly more likely by the human-caused climate crisis, according to a new analysis released Tuesday as temperatures are still bla… [+4883 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Webb detects water vapour in rocky planet-forming zone - European Space Agency", "description": "New measurements by the NASA/ESA/CSA James Webb Space Telescope’s Mid-InfraRed Instrument (MIRI) has detected water vapour in the inner disc of the system PDS 70, located 370 light-years away. This is the first detection of water in the terrestrial region of …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_detects_water_vapour_in_rocky_planet-forming_zone", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/07/pds_70_artist_concept/25018255-1-eng-GB/PDS_70_artist_concept_pillars.jpg", "publishedAt": "2023-07-24T14:53:53Z", "content": "New measurements by the NASA/ESA/CSA James Webb Space Telescopes Mid-InfraRed Instrument (MIRI) has detected water vapour in the inner disc of the system PDS 70, located 370 light-years away. This is… [+4717 chars]"}]}