{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Tencent buys stake worth USD 264 million in Flipkart from Binny Bansal - Moneycontrol", "description": "Singapore-headquartered e-commerce firm Flipkart has operations in India only. Bansal holds around 1.84 percent stake in Flipkart after selling part of his stake to Tencent Cloud Europe BV.", "url": "https://www.moneycontrol.com/news/business/tencent-buys-stake-worth-usd-264-million-in-flipkart-from-binny-bansal-8674991.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/06/Tensent_22062020-770x433.jpg", "publishedAt": "2022-06-12T09:07:28Z", "content": "Chinese technology conglomerate Tencent has bought stake worth USD 264 million (about Rs 2,060 crore) in Flipkart from its co-founder Binny Bansal through its European subsidiary, according to offici… [+1662 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Europe’s Largest Predatory Dinosaur Unearthed on the Isle of Wight - SciTechDaily", "description": "Despite a land area of just 148 square miles (384 km2), the Isle of Wight, an island off England, is one of the richest dinosaur localities in Europe. In fact, over 20 species of dinosaur have been found there from the early Cretaceous Period, including some …", "url": "https://scitechdaily.com/europes-largest-predatory-dinosaur-unearthed-on-the-isle-of-wight/", "urlToImage": "https://scitechdaily.com/images/White-Rock-Spinosaurid-scaled.jpg", "publishedAt": "2022-06-12T03:24:29Z", "content": "ByUniversity of SouthamptonJune 11, 2022\r\nIllustration of White Rock spinosaurid by Anthony Hutchings. Credit: UoS/A Hutchings\r\nDespite a land area of just 148 square miles (384 km2), the Isle of Wig… [+4732 chars]"}, {"source": {"id": null, "name": "Leitrimobserver.ie"}, "author": "Reporter", "title": "Remains of Europe's largest ever land predator dinosaur discovered - Leitrim Live", "description": "The remains of Europe’s largest ever land-based hunter which measured more than 10 metres long and lived 125 million years ago have been found on the Isle of Wight. Several prehistoric bones belonging to the two-legged, crocodile-faced spinosaurid dinosaur we…", "url": "https://www.leitrimobserver.ie/news/arts---entertainment/834122/remains-of-europes-largest-ever-land-predator-dinosaur-discovered.html", "urlToImage": "https://www.leitrimobserver.ie/resizer/1200/700/true/pa/2022_06_09/1654773906108_0.jpg--remains_of_europe_s_largest_ever_land_predator_dinosaur_discovered.jpg?1654773906000", "publishedAt": "2022-06-11T09:26:32Z", "content": "The remains of Europes largest ever land-based hunter which measured more than 10 metres long and lived 125 million years ago have been found on the Isle of Wight.\r\nSeveral prehistoric bones belongin… [+2362 chars]"}]}