{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Net Newsledger"}, "author": "https://business.facebook.com/NetNewsledger/", "title": "Is Europe on the Verge of a New Era of Rocket Launches with Orbex Space? - Net Newsledger", "description": "The European Space Agency is widening its net to include funding for British rocket companies like Orbex Space. Can UK firms rely on Europe for future funding, or will they be forced to look inwards for investment? Is Europe on the Verge of a New Era of Rocke…", "url": "https://www.netnewsledger.com/2021/07/01/is-europe-on-the-verge-of-a-new-era-of-rocket-launches-with-orbex-space/", "urlToImage": "https://www.netnewsledger.com/wp-content/uploads/2019/02/NASA-Space-Exploration.jpg", "publishedAt": "2021-07-02T03:55:02Z", "content": "The European Space Agency is widening its net to include funding for British rocket companies like Orbex Space. Can UK firms rely on Europe for future funding, or will they be forced to look inwards … [+4254 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "NASA's James Webb telescope is 'go' for launch on Halloween - Daily Mail", "description": "It will take off no earlier than October 31 from Europe's spaceport in French Guiana, with the review marking a major milestone in its 25 year development program.", "url": "https://www.dailymail.co.uk/sciencetech/article-9746527/NASAs-James-Webb-telescope-launch-Halloween.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/07/01/17/44924029-0-image-a-56_1625158146901.jpg", "publishedAt": "2021-07-01T16:49:33Z", "content": "The James Webb space telescope, a joint NASA, European and Canadian mission, has been given a 'go' to launch after it and the rocket launcher passed a final review. \r\nThe $10 billion (£7.3 billion) s… [+10673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Data Shows 2 Covid Jabs Protect Against Delta Strain: European Regulator - NDTV", "description": "Two doses of Covid vaccine appear to provide protection against the rapidly spreading Delta variant, the European Medicines Agency said Thursday.", "url": "https://www.ndtv.com/world-news/2-covid-jabs-seem-to-protect-against-delta-strain-europe-medicines-body-2477063", "urlToImage": "https://c.ndtvimg.com/2021-06/r6e5kmv8_vaccine-generic-650_625x300_25_June_21.jpeg", "publishedAt": "2021-07-01T12:37:28Z", "content": "4 vaccines are currently approved for use in the EU: Pfizer, Moderna, AstraZeneca, Johnson &amp; Johnson.\r\nThe Hague, Netherlands: Two doses of Covid vaccine appear to provide protection against the … [+1832 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Cara Anna", "title": "Africa's COVID-19 envoy blasts EU, COVAX over vaccine crisis - KULR-TV", "description": "NAIROBI, Kenya (AP) — The African Union special envoy tasked with leading efforts to procure COVID-19 vaccines for the continent is blasting Europe as Africa struggles amid a crushing third surge of infections, saying Thursday that “not one dose, not one vial…", "url": "https://apnews.com/926c80134a8543efef16e2c7ca4d43c2", "urlToImage": "https://storage.googleapis.com/afs-prod/media/33fe4b834026441db25fba258e3bfe23/3000.jpeg", "publishedAt": "2021-07-01T11:46:05Z", "content": "NAIROBI, Kenya (AP) The African Union special envoy tasked with leading efforts to procure COVID-19 vaccines for the continent is blasting Europe as Africa struggles amid a crushing third surge of in… [+5913 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Switzerland, 8 European Union members approve Covishield for Green Pass - Moneycontrol", "description": "The European Union's Digital COVID certificate or \"Green Pass\" is set to be rolled out on July 1 with an aim to facilitate free movement during the COVID-19 pandemic.", "url": "https://www.moneycontrol.com/news/india/european-union-members-approve-covishield-for-green-pass-7112021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/RTXAHPU4-770x433.jpg", "publishedAt": "2021-07-01T06:35:02Z", "content": "At least seven European countries including, Austria, Germany, Slovenia, Greece, Iceland, Ireland and Spain, and Switzerland have approved the Covishield COVID-19 vaccine for 'Green Pass'.\r\nSeparatel… [+1671 chars]"}]}