{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Symptoms of long Covid in kids may change over time: Lancet study - Deccan Herald", "description": "Symptoms of long Covid experienced by children and young people may change over time, according to the largest study of its kind published in The Lancet Regional Health - Europe. Researchers asked children aged 11 to 17 about their health six months and 12 mo…", "url": "https://www.deccanherald.com/science-and-environment/symptoms-of-long-covid-in-kids-may-change-over-time-lancet-study-1168627.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/12/05/covidistock-1-1168627-1670236125.jpg", "publishedAt": "2022-12-05T10:28:45Z", "content": "Symptoms of long Covid experienced by children and young people may change over time, according to the largest study of its kind published in The Lancet Regional Health - Europe.\r\nResearchers asked c… [+2659 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Mick Chan", "title": "Borgward declared bankrupt in China following 2015 relaunch, RM2.94 billion loss sustained last year - paultan.org - Paul Tan's Automotive News", "description": "Chinese-owned German brand Borgward has been declared bankrupt by a court in Beijing, China according to Foton, reports Automotive News Europe, The ruling was issued by the First Intermediate People’s Court of Beijing, and Borgward …", "url": "https://paultan.org/2022/12/05/borgward-declared-bankrupt-in-china-following-2015-relaunch-rm2-94-billion-loss-sustained-last-year/", "urlToImage": "https://paultan.org/image/2018/04/Borgward_BX5_Ext-18-630x420.jpg", "publishedAt": "2022-12-05T03:08:30Z", "content": "Chinese-owned German brand Borgward has been declared bankrupt by a court in Beijing, China according to Foton, reports Automotive News Europe, The ruling was issued by the First Intermediate People’… [+1620 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Arne Delfs", "title": "German minister pursues hydrogen in Namibia, South Africa after Russian gas cut-off - News24", "description": "German Economy Minister Robert Habeck began a five-day trip to Namibia and South Africa Sunday, part of a push to secure new energy resources for Europe’s biggest economy to compensate for the cut-off from Russian gas supplies.", "url": "https://www.news24.com/fin24/climate_future/energy/german-minister-pursues-hydrogen-in-namibia-south-africa-after-russian-gas-cut-off-20221204", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1965/e15ee987e12a496f9d2dce2d97460c38.jpg", "publishedAt": "2022-12-04T10:29:10Z", "content": "During his first stop in the Namibian capital Windhoek, Habeck, who’ll be accompanied by a delegation of 24 German business leaders, will sign an agreement on the production of green hydrogen.\"Namibi… [+1665 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Healthcare-associated hepatitis B and C transmission to patients in the EU/EEA and UK: a systematic review of reported outbreaks between 2006 and 2021 - BMC Public Health - BMC Public Health", "description": "Healthcare-associated transmission was the second most common hepatitis B (HBV) and hepatitis C (HCV) transmission route according to 2006–2012 European surveillance data, but data quality and completeness issues hinder comprehensive characterisation of this …", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-14726-0", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-12-03T13:36:24Z", "content": null}]}