{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "Levi's creates trucker jackets with terno and barong elements for AAPI Heritage Month - Manila Bulletin", "description": "Check out these 'East meets West' jackets \nThe terno and barong-inspired Trucker jackets\n The concept of East meets West can be defined in many ways. There are Asian-European fusion cuisines, bringing exotic and fine flavors together. Mixing delicate filigree…", "url": "https://mb.com.ph/2021/05/27/levis-creates-trucker-jackets-with-terno-and-barong-elements-for-aapi-heritage-month/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/05/7565.jpeg", "publishedAt": "2021-05-27T04:08:00Z", "content": "Dear Reader, Thank you for taking time to read on our site. It would mean a great deal to us if you can answer this short survey about your experience with the Manila Bulletin website. Participants a… [+63 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Zidane resigns as Real Madrid coach: reports - Eyewitness News", "description": "The Frenchman's reported departure comes at the end of a disappointing campaign for the 13-time European champions, who also lost to Chelsea in the Champions League semi-finals as they failed to win a trophy for the first time in 11 seasons.", "url": "https://ewn.co.za/2021/05/27/zidane-resigns-as-real-madrid-coach-reports", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/iomsjw42wbredy3nbyck", "publishedAt": "2021-05-27T03:26:34Z", "content": "The Frenchman's reported departure comes at the end of a disappointing campaign for the 13-time European champions, who also lost to Chelsea in the Champions League semi-finals as they failed to win … [+1740 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": "By\nRoland Oliphant,", "title": "‘He hypnotises you’: How Alexander Lukashenko rose to become Europe’s last dictator - Telegraph.co.uk", "description": "The leader of Belarus is said to be a talented judge of character and has a gift for both manipulating and inspiring his underlings", "url": "https://www.telegraph.co.uk/news/2021/05/26/hypnotises-alexander-lukashenko-rose-become-europes-last-dictator/", "urlToImage": "https://www.telegraph.co.uk/content/dam/news/2021/05/26/TELEMMGLPICT000259619638_trans_NvBQzQNjv4BqLeUJvOJqnV613e1NxllMSd6BnMf0kzF1WPsn9AqaDz8.jpeg?impolicy=logo-overlay", "publishedAt": "2021-05-26T20:51:00Z", "content": "Like many successful dictators, he is also a talented judge of character and has a gift for both manipulating and inspiring his underlings.\r\nHe has a magnetic presence. He hypnotises you, said the fo… [+1098 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Yuras Karmanau", "title": "Belarus leader denounces EU sanctions over plane diversion - CTV News", "description": "Belarus' authoritarian president lashed out Wednesday at Europe for trying to 'strangle' his country with sanctions over the diversion of a passenger jet, and he accused a dissident journalist arrested after the flight landed in Minsk of working to foment a '…", "url": "https://www.ctvnews.ca/world/belarus-leader-denounces-eu-sanctions-over-plane-diversion-1.5443208", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5443212.1622038070!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-05-26T14:09:00Z", "content": "KYIV, UKRAINE -- \r\nBelarus' authoritarian president lashed out Wednesday at Europe for trying to \"strangle\" his country with sanctions over the diversion of a passenger jet, and he accused a dissiden… [+4875 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "Defiant Lukashenko Defends Plane Diversion, Blasts Critics - CHANNELS TELEVISION", "description": "A defiant President Alexander Lukashenko on Wednesday defended Belarus’s diversion of a European flight and arrest of a dissident on board, lashing out at critics at home and abroad. In his first public statement since the Ryanair flight was diverted and oppo…", "url": "https://www.channelstv.com/2021/05/26/defiant-lukashenko-defends-plane-diversion-blasts-critics/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/05/Alexander_Lukashenko_Belarus.jpg", "publishedAt": "2021-05-26T10:03:31Z", "content": "Belarusian President Alexander Lukashenko speaks during his meeting with parliamentarians, members of Constitutional Commission and representatives of public administration bodies in Minsk on May 26,… [+4900 chars]"}]}