{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": ".", "title": "All You Need To Know About Europe-based Ghanian Rapper TBKOfficixl - Leadership News", "description": "Either back home or in the diaspora, Africans have continously expoused the fact that all they require is an environment to showcase that they are", "url": "https://leadership.ng/all-you-need-to-know-about-europe-based-ghanian-rapper-tbkofficixl/", "urlToImage": "https://leadership.ng/wp-content/uploads/2022/05/LeadershipHeader.png", "publishedAt": "2023-01-01T20:56:16Z", "content": "Either back home or in the diaspora, Africans have continously expoused the fact that all they require is an environment to showcase that they are super-talented. Someone who is again proving that to… [+2521 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Global economy faces tougher year in 2023, IMF's Georgieva warns - Reuters", "description": "For much of the global economy, 2023 is going to be a tough year as the main engines of global growth - the United States, Europe and China - all experience weakening activity, the head of the International Monetary Fund said on Sunday.", "url": "https://www.reuters.com/markets/tough-year-ahead-global-economy-imfs-georgieva-warns-2023-01-01/", "urlToImage": "https://www.reuters.com/resizer/dX1Uu7vUY5NNTs3JGBSaB_BmpFI=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/ZXBWR4SEPFJ7ZFZ6XFLS6ESYRY.jpg", "publishedAt": "2023-01-01T20:00:00Z", "content": "Jan 1 (Reuters) - For much of the global economy, 2023 is going to be a tough year as the main engines of global growth - the United States, Europe and China - all experience weakening activity, the … [+3993 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Global economy faces tougher year in 2023, IMF's Georgieva warns - CNA", "description": "For much of the global economy, 2023 is going to be a tough year as the main engines of global growth - the United States, Europe and China - all experience weakening activity, the head of the International Monetary Fund said on Sunday (Jan 1). The new year i…", "url": "https://www.channelnewsasia.com/business/global-economy-faces-tougher-year-2023-imfs-georgieva-warns-3177971", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--6cdUcmRI--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2023-01-01t200044z_3_lynxmpej000dq_rtroptp_3_germany-economy-imf.jpg?itok=Kk_I_zfd", "publishedAt": "2023-01-01T16:48:00Z", "content": "For much of the global economy, 2023 is going to be a tough year as the main engines of global growth - the United States, Europe and China - all experience weakening activity, the head of the Intern… [+3790 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "AP", "title": "UN Official Meets Taliban Deputy PM Over Women NGO Ban - Radio Free Europe / Radio Liberty", "description": "A senior UN official in Afghanistan met on January 1 with the deputy prime minister of the Taliban-led government to discuss a ban on women working for nongovernmental groups that Afghan authorities have announced in a series of measures rolling back women's …", "url": "https://www.rferl.org/a/afghanistan-un-meeting-women-ngos/32203167.html", "urlToImage": "https://gdb.rferl.org/10040000-0aff-0242-7237-08da5fc215c0_w1200_r1.jpg", "publishedAt": "2023-01-01T13:39:50Z", "content": "Lost status and a desperate existence in Iran are driving thousands of former Afghan troops -- many of them elite commandos trained by the United States -- to consider fighting as mercenaries in Ukra… [+9731 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "AFP", "title": "Croatia switches to the euro and enters Europe's passport-free zone - TheJournal.ie", "description": "It is now the 27th nation in the passport-free Schengen zone.", "url": "https://www.thejournal.ie/croatia-switches-to-the-euro-and-enters-europes-passport-free-zone-5958915-Jan2023/", "urlToImage": "https://img2.thejournal.ie/article/5958915/river/?height=400&version=5958916", "publishedAt": "2023-01-01T08:39:42Z", "content": "CROATIA HAS SWITCHED to the euro and entered Europes passport-free zone two major milestones for the country after joining the EU nearly a decade ago.\r\nAt midnight (23:00 Irish time Saturday) the Bal… [+4304 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "news24", "title": "World steps into 2023 after turbulent year - News24", "description": "The world's eight billion people Saturday ushered in 2023, bidding farewell to a turbulent 12 months marked by war in Europe, stinging price rises, Lionel Messi's World Cup glory and the deaths of Queen Elizabeth, Pele and former pope Benedict.", "url": "https://www.news24.com/news24/world/news/world-steps-into-2023-after-turbulent-year-20230101", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/554/9eb427de8f244747b0c43934f9d5d6ae.jpg", "publishedAt": "2023-01-01T06:34:22Z", "content": "<ul><li>The world ushered in the New Year in the first 'normal' celebrations since the onset of the Covid-19 pandemic. </li><li>2023 was a tumultuous year, with several high profile deaths and the wa… [+5527 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Associated Press", "title": "Time zone by time zone, another new year sweeps into view - The Manila Times", "description": "NEW YORK: New Year's celebrations swept across the globe, ushering in 2023 with countdowns and fireworks — and marking an end to a year that brought war in Europe, a new...", "url": "https://www.manilatimes.net/2023/01/01/news/time-zone-by-time-zone-another-new-year-sweeps-into-view/1872407", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2023/01/01/142728.jpg", "publishedAt": "2023-01-01T04:11:36Z", "content": "NEW YORK: New Year's celebrations swept across the globe, ushering in 2023 with countdowns and fireworks and marking an end to a year that brought war in Europe, a new chapter in the British monarchy… [+5853 chars]"}]}