{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "Mars-bound astronauts can avoid aggression, muscle loss with hibernation during trips - Republic World", "description": "A European Space Agency (ESA) study has suggested that putting astronauts into hibernation could be the best way to ensure their safe trip to Mars", "url": "https://www.republicworld.com/technology-news/science/mars-bound-astronauts-can-avoid-aggression-muscle-loss-with-hibernation-during-trips-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/1inpdtz0qd9erpaw_1643822251.jpeg", "publishedAt": "2022-02-02T17:23:00Z", "content": "An investigation being conducted by the European Space Agency (ESA) has suggested that putting astronauts into hibernation could be the best way to ensure their safe trip to Mars. Considering how lon… [+2395 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "United States sending 3,000 extra troops to Eastern Europe in coming days amid stand-off with Russia over Ukraine - ABC News", "description": "The Pentagon says the troop deployment, coming amid a stand-off with Russia over Ukraine, is a signal of US readiness to defend NATO allies.", "url": "https://www.abc.net.au/news/2022-02-03/ukraine-russia-crisis-us-troops-nato-allies-eastern-europe/100800480", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/9e4c39d439b0248bcb9cb2a516c79877?impolicy=wcms_crop_resize&cropH=1125&cropW=2000&xPos=0&yPos=104&width=862&height=485", "publishedAt": "2022-02-02T16:01:54Z", "content": "US President Joe Biden has approved the deployment of nearly 3,000 American troops to eastern Europe in the coming days amid a stand-off with Russia over Ukraine in what the Pentagon said was a signa… [+5098 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Robert Burns, Lolita C. Baldor, Lorne Cook and Dasha Litvinova", "title": "Ukraine: Biden announces more troops to Europe - CTV News", "description": "U.S. President Joe Biden is sending about 2,000 U.S.-based troops to Poland and Germany and shifting 1,000 soldiers from Germany to Romania as demonstrations of America's commitments to allies on NATO's eastern flank amid fears of a Russian invasion of Ukrain…", "url": "https://www.ctvnews.ca/world/biden-orders-forces-to-europe-amid-stalled-ukraine-talks-1.5764284", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5764290.1643807485!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-02T13:13:00Z", "content": "WASHINGTON -- \r\nU.S. President Joe Biden is ordering 2,000 U.S.-based troops to Poland and Germany and shifting 1,000 more from Germany to Romania, demonstrating to both allies and foes America's com… [+7607 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BusinessMirror", "title": "EU commits €21-M aid for PHL, SEA recovery - Business Mirror", "description": "ON January 28the European Commission announced an allocation of €21 million for disaster preparedness and humanitarian aid in the Philippines, Nepal and other Southeast Asian countries. The funding will support people affected by natural hazards, the pandemic…", "url": "https://businessmirror.com.ph/2022/02/02/eu-commits-e21-m-aidfor-phl-sea-recovery/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/11/BusinessMirror-BM-lettermark.jpg", "publishedAt": "2022-02-02T11:35:43Z", "content": "ON January 28the European Commission announced an allocation of 21 million for disaster preparedness and humanitarian aid in the Philippines, Nepal and other Southeast Asian countries. The funding wi… [+2307 chars]"}]}