{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "ESPN"}, "author": "ESPN", "title": "Trent Alexander-Arnold injured in England friendly against Austria - ESPN", "description": "Trent Alexander-Arnold gave England an injury scare barely a week before the European Championship by picking up a suspected left thigh injury.", "url": "https://www.espn.com/soccer/england-eng/story/4399916/trent-alexander-arnold-injured-in-england-friendly-against-austria", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0602%2Fr862218_1296x729_16%2D9.jpg", "publishedAt": "2021-06-02T22:01:49Z", "content": "Trent Alexander-Arnold gave England an injury scare barely a week before the European Championship by hobbling off with a suspected left thigh injury in a warmup match on Wednesday.\r\n- Euro 2020 on E… [+1481 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Josep Borrell, European Union High Representative for Foreign Affairs and Security Policy/Vice Presi-dent of the European Commission", "title": "Closing the vaccination gap | Josep Borrell, European Union High Representative for Foreign Affairs and Security Policy/Vice Presi-dent of the European Commission - Business Mirror", "description": "WE need to close the vaccination gap between advanced economies and developing countries to avoid what Tedros Ghebreyesus, head of the World Health Organization (WHO), has called “vaccination apartheid.” Therefore, we need global multilateral action to increa…", "url": "https://businessmirror.com.ph/2021/06/03/closing-the-vaccination-gap/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/envoys01-060321.jpg", "publishedAt": "2021-06-02T16:03:00Z", "content": "WE need to close the vaccination gap between advanced economies and developing countries to avoid what Tedros Ghebreyesus, head of the World Health Organization (WHO), has called vaccination aparthei… [+5507 chars]"}, {"source": {"id": "techcrunch", "name": "TechCrunch"}, "author": "Ingrid Lunden", "title": "Etsy is acquiring UK-based social selling site Depop for $1.625B in a mostly-cash deal - TechCrunch", "description": "Very big news today coming out of Europe in the world of e-commerce. Etsy, the New York-based marketplace where crafty creators and those interested in their styles can discover and buy those goods, today announced that it is acquiring Depop, a London-based m…", "url": "http://techcrunch.com/2021/06/02/etsy-is-acquiring-social-selling-site-depop-for-1-625b-in-a-mostly-cash-deal/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/02/GettyImages-469939874.jpg?w=574", "publishedAt": "2021-06-02T11:15:00Z", "content": "Very big news today coming out of Europe in the world of e-commerce. Etsy, the New York-based marketplace where crafty creators and those interested in their styles can discover and buy those goods, … [+4076 chars]"}, {"source": {"id": null, "name": "The Sun Daily"}, "author": null, "title": "France cannot be dependent on Benzema, warns Lloris - The Sun Daily", "description": "PARIS: France cannot become dependent on the returning Karim Benzema (pix) if they are to become European champions three years after winning the Worl...", "url": "https://www.thesundaily.my/home/france-cannot-be-dependent-on-benzema-warns-lloris-YM7925320", "urlToImage": "https://www.thesundaily.my/binrepository/480x270/0c10/480d250/none/11808/ILHU/karim-benzema_1693897_20210602124717.jpg", "publishedAt": "2021-06-02T04:50:00Z", "content": "PARIS: France cannot become dependent on the returning Karim Benzema (pix) if they are to become European champions three years after winning the World Cup, captain Hugo Lloris said on Tuesday.\r\nReal… [+1220 chars]"}]}