{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Live Gas prices jump on new Russian pipeline delay - live updates - Telegraph.co.uk", "description": "European and British wholesale gas prices have surged after Germany suspended the certification process for Russia's controversial Nord Stream 2 pipeline.", "url": "https://www.telegraph.co.uk/business/2021/11/16/markets-live-latest-coronavirus-news-pound-euro-ftse-100/", "urlToImage": "https://www.telegraph.co.uk/content/dam/business/2021/11/16/TELEMMGLPICT000277840683_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?impolicy=logo-overlay", "publishedAt": "2021-11-16T12:35:00Z", "content": "Theres plenty of reaction to this mornings labour market figures, with analysts seeming to agree that falling unemployment will put more pressure on the Bank of England to hike interest rates.\r\nSusan… [+2339 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matthew Chance, Antonia Mortensen, Katharina Krebs and Eliza Mackintosh, CNN", "title": "Violence erupts on Poland-Belarus border as Polish guards fire water cannon on migrants throwing rocks - CNN", "description": "Violence erupted at the Poland-Belarus border on Tuesday, as migrants desperate to cross into the European Union threw stones at Polish border guards who responded with water cannon and tear gas.", "url": "https://www.cnn.com/2021/11/16/europe/poland-belarus-border-crisis-tuesday-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211116061259-poland-belarus-border-111621-super-tease.jpg", "publishedAt": "2021-11-16T12:23:00Z", "content": "Bruzgi-Kunica border region, Belarus (CNN)Violence erupted at the Poland-Belarus border on Tuesday, as migrants desperate to cross into the European Union threw stones at Polish border guards who res… [+3173 chars]"}, {"source": {"id": null, "name": "Sky Sports"}, "author": "Sky Sports", "title": "Rory McIlroy looking to end 'year of exploration' on a high at DP World Tour Championship - Sky Sports", "description": "Rory McIlroy has set his sights on a strong finish to a 'year of exploration' as he chases a third victory at the European Tour's DP World Tour Championship.", "url": "https://www.skysports.com/golf/news/12176/12469807/rory-mcilroy-looking-to-end-year-of-exploration-on-a-high-at-dp-world-tour-championship", "urlToImage": "https://e2.365dm.com/21/11/1600x900/skysports-rory-mcilroy-golf_5584653.jpg", "publishedAt": "2021-11-16T10:14:09Z", "content": "Rory McIlroy has set his sights on a strong finish to an eventful 2021 as he chases a third victory at the European Tour's DP World Tour Championship.\r\nThe former world No 1 is a two-time winner on t… [+4079 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "Farah Hancock", "title": "Pressure on takeaway chains as Domino's ditches 'fast chickens' - RNZ", "description": "Domino's says fast food brands in NZ risk falling behind European standards for chicken welfare, as it moves to phase out controversial fast-growing breeds.", "url": "https://www.rnz.co.nz/news/in-depth/455865/pressure-on-takeaway-chains-as-domino-s-ditches-fast-chickens", "urlToImage": "https://www.rnz.co.nz/assets/news/280281/eight_col_AA-meat-chickens_002.jpg?1637009450", "publishedAt": "2021-11-16T06:10:43Z", "content": "Warning: Readers may find images in this story upsetting\r\nDomino's says fast food brands in NZ risk falling behind European standards for chicken welfare, as it moves to phase out controversial fast-… [+14207 chars]"}, {"source": {"id": null, "name": "Eurosport.com AU"}, "author": "Graham Ruthven", "title": "Switzerland beat Bulgaria to snatch Group C top spot from Italy to qualify automatically for World Cup - Eurosport.com", "description": "Switzerland qualified automatically for the 2022 World Cup after beating Bulgaria to snatch top spot in Group C away from European champions Italy.", "url": "https://www.eurosport.com/football/world-cup-qualification-uefa/2022/switzerland-v-bulgaria-follow-live-world-cup-qualifying_sto8629288/story.shtml", "urlToImage": "https://i.eurosport.com/2021/11/15/3254816-66613588-2560-1440.jpg", "publishedAt": "2021-11-15T22:12:00Z", "content": "Switzerland celebrate scoring against Bulgaria\r\nImage credit: Getty Images"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Lorne Cook", "title": "EU to add airlines to Belarus sanctions as tensions mount - CP24 Toronto's Breaking News", "description": "The European Union ratcheted up pressure on Belarus by agreeing Monday to slap sanctions on airlines accused of helping Belarus President Alexander Lukashenko wage a \"hybrid attack\" against the bloc using migrants, as tensions mounted on the Polish and Lithua…", "url": "https://www.cp24.com/world/eu-to-add-airlines-to-belarus-sanctions-as-tensions-mount-1.5666906", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5666907.1637004660!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-11-15T19:31:24Z", "content": "BRUSSELS (AP) -- The European Union ratcheted up pressure on Belarus by agreeing Monday to slap sanctions on airlines accused of helping Belarus President Alexander Lukashenko wage a \"hybrid attack\" … [+5233 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL", "title": "Space Debris Threatened Crew Of ISS - Radio Free Europe / Radio Liberty", "description": "The United States denounced Russia for conducting a “dangerous and irresponsible” missile test that blew up a defunct Russian satellite, creating a debris cloud that now endangers satellites and the International Space Station.", "url": "https://www.rferl.org/a/international-space-station-debris-russia/31562770.html", "urlToImage": "https://gdb.rferl.org/6235cd63-7667-4aa1-b576-1afe2a831bfb_cx0_cy2_cw0_w1200_r1.jpg", "publishedAt": "2021-11-15T17:42:54Z", "content": "The United States denounced Russia for conducting a dangerous and irresponsible missile test that blew up a defunct Russian satellite, creating a debris cloud that now endangers satellites and the In… [+3328 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Fikayo Olowolagba", "title": "MTV EMA 2021: Wizkid wins Best African Act - Daily Post Nigeria", "description": "Award-winning Nigerian superstar, Wizkid, has won the award for the Best African Act in this year’s edition of the MTV Europe Music Awards (EMA) Wizkid beat the likes of Tems, Diamond Platnumz, Amaarae, and Focalistic in the tightly-contested category. MTV ba…", "url": "https://dailypost.ng/2021/11/15/mtv-ema-2021-wizkid-wins-best-african-act/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/06/Wizkid.jpg", "publishedAt": "2021-11-15T05:02:54Z", "content": "Award-winning Nigerian superstar, Wizkid, has won the award for the Best African Act in this years edition of the MTV Europe Music Awards (EMA)\r\nWizkid beat the likes of Tems, Diamond Platnumz, Amaar… [+501 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "Air pollution in Europe still killing 300,000 a year – report - The Manila Times", "description": "COPENHAGEN: Premature deaths caused by fine particle air pollution have fallen 10 percent annually across Europe, but the invisible killer still accounts for 307,000 premature...", "url": "https://www.manilatimes.net/2021/11/15/news/air-pollution-in-europe-still-killing-300000-a-year-report/1822297", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/15/26801.jpg", "publishedAt": "2021-11-15T04:56:48Z", "content": "COPENHAGEN: Premature deaths caused by fine particle air pollution have fallen 10 percent annually across Europe, but the invisible killer still accounts for 307,000 premature deaths a year, the Euro… [+3013 chars]"}]}