{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Ukraine crisis latest: Joe Biden to send additional 3,000 troops to Eastern Europe - Telegraph.co.uk", "description": "Joe Biden has ordered the deployment of a further 3,000 American troops to Eastern Europe in the first major movement of US forces since the Ukraine crisis began.", "url": "https://www.telegraph.co.uk/world-news/2022/02/02/russia-ukraine-news-invasion-sanctions-nato-putin-boris-latest/", "urlToImage": "https://www.telegraph.co.uk/content/dam/world-news/2022/02/02/TELEMMGLPICT000284412968_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?impolicy=logo-overlay", "publishedAt": "2022-02-02T16:33:00Z", "content": "A senior Russian official at the United Nations has  slammed British diplomacy, just hours before Boris Johnson speaks to Vladimir Putin to try to defuse the Ukraine crisis.\r\n\"There is always room fo… [+1402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Barbara Starr and Jeremy Herb, CNN", "title": "US troops to deploy to Eastern Europe amid Ukraine crisis - CNN", "description": "President Joe Biden has formally approved the deployment of 3,000 US troops to Poland, Germany and Romania, the Pentagon announced Wednesday, in a move to bolster NATO countries in Eastern Europe with tens of thousands of Russian troops amassed along Ukraine'…", "url": "https://www.cnn.com/2022/02/02/politics/us-troops-europe-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220128160025-01-biden-0111-super-tease.jpg", "publishedAt": "2022-02-02T16:28:00Z", "content": "(CNN)President Joe Biden has formally approved the deployment of 3,000 US troops to Poland, Germany and Romania, the Pentagon announced Wednesday, in a move to bolster NATO countries in Eastern Europ… [+3737 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Canada relocated its military trainers in Ukraine in response to fears of Russian invasion - CBC News", "description": "The Canadian military was forced to relocate about 30 per cent of its 200 trainers in Ukraine — including sniper instructors — because of the threat of a Russian invasion, says the Canadian commander on the ground in the eastern European country.", "url": "https://www.cbc.ca/news/politics/ukraine-russia-operation-unifier-1.6335886", "urlToImage": "https://i.cbc.ca/1.6335932.1643759142!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ukraine-us-russia.jpg", "publishedAt": "2022-02-02T12:41:31Z", "content": "The Canadian military was forced to relocate about 30 per cent of its 200 trainers in Ukraine including sniper instructors  because of the threat of a Russian invasion, says the Canadian commander on… [+4047 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BusinessMirror", "title": "EU commits €21-M aid for PHL, SEA recovery - Business Mirror", "description": "ON January 28the European Commission announced an allocation of €21 million for disaster preparedness and humanitarian aid in the Philippines, Nepal and other Southeast Asian countries. The funding will support people affected by natural hazards, the pandemic…", "url": "https://businessmirror.com.ph/2022/02/02/eu-commits-e21-m-aidfor-phl-sea-recovery/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/11/BusinessMirror-BM-lettermark.jpg", "publishedAt": "2022-02-02T11:35:43Z", "content": "ON January 28the European Commission announced an allocation of 21 million for disaster preparedness and humanitarian aid in the Philippines, Nepal and other Southeast Asian countries. The funding wi… [+2307 chars]"}]}