{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Jillian Ambrose", "title": "IEA calls on Russia to send more gas to Europe before winter - The Guardian", "description": "World’s energy watchdog intervenes after Russia decides not to increase exports despite record prices", "url": "https://amp.theguardian.com/business/2021/sep/21/iea-calls-on-russia-to-send-more-gas-to-europe-before-winter", "urlToImage": null, "publishedAt": "2021-09-21T17:29:00Z", "content": "GasWorlds energy watchdog intervenes after Russia decides not to increase exports despite record prices\r\nTue 21 Sep 2021 18.16 BST\r\nThe worlds energy watchdog has called on Russia to send more gas to… [+3029 chars]"}, {"source": {"id": null, "name": "Golf Channel"}, "author": null, "title": "2020 Ryder Cup: The significance of the numbers on Team Europe's Ryder Cup golf bags - Golf Channel", "description": "Stitched on the golf bags of all 12 of Padraig Harrington’s players this week at Whistling Straits is a number.", "url": "https://www.golfchannel.com/news/2020-ryder-cup-significance-numbers-team-europes-ryder-cup-golf-bags", "urlToImage": "https://www.golfchannel.com/sites/default/files/2021/09/21/europe_team_bags_1920_ryder21_tue.jpg", "publishedAt": "2021-09-21T16:52:29Z", "content": "Analytics have become an increasingly important part of the entire Ryder Cup process, but European captain Padraig Harrington is taking his numbers game to a new level literally.\r\nStitched on the gol… [+3340 chars]"}, {"source": {"id": null, "name": "Sputnik International"}, "author": "Ilya Tsukanov", "title": "US Suddenly ‘Concerned’ About Shortages of Gas in Europe After Spending Years Fighting Nord Stream 2 - Sputnik International", "description": "Construction of the Nord Stream 2 gas pipeline wrapped up earlier this month, with German regulators now working to approve its commissioning. Once up and running, the pipeline will be able to deliver up to 55 billion cubic metres of gas...", "url": "https://sputniknews.com/20210921/us-suddenly-concerned-about-shortages-of-gas-in-europe-after-spending-years-fighting-nord-stream-2-1089276322.html", "urlToImage": "https://cdn1.img.sputniknews.com/images/sharing/article/eng/1089276322.jpg?10533035061632244656", "publishedAt": "2021-09-21T16:28:16Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Physicists probe light smashups to guide future research: Understanding photon collisions could aid search for physics beyond the Standard Model - Science Daily", "description": "Light has no mass, but Europe's Large Hadron Collider (LHC) can convert light's energy into massive particles. Physicists studied matter-generating collisions of light and showed the departure angle of their debris is subtly distorted by quantum interference …", "url": "https://www.sciencedaily.com/releases/2021/09/210920152005.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-09-20T20:01:17Z", "content": "Hot on the heels of proving an 87-year-old prediction that matter can be generated directly from light, Rice University physicists and their colleagues have detailed how that process may impact futur… [+7308 chars]"}]}