{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Amy Kazmin", "title": "Italy and Spain lead fresh round of European expulsions of Russian diplomats - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/a41a1c75-2705-400e-872d-9b1d4ea8e67c", "urlToImage": null, "publishedAt": "2022-04-05T15:17:25Z", "content": "Get local insights from Lisbon to Moscow with an unrivalled network of journalists across Europe,\r\nexpert analysis, our dedicated Brussels Briefing newsletter. Customise your myFT page to track\r\nthe … [+24 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Shane Phelan", "title": "'Slave and master' text message evidence in doubt as Graham Dwyer murder appeal boosted by European Court ruling - Independent.ie", "description": "The Court of Justice for the European Union (CJEU) has ruled in favour of convicted killer Graham Dwyer in his challenge against Ireland&rsquo;s data retention laws.", "url": "https://www.independent.ie/irish-news/courts/slave-and-master-text-message-evidence-in-doubt-as-graham-dwyer-murder-appeal-boosted-by-european-court-ruling-41521593.html", "urlToImage": "https://www.independent.ie/irish-news/courts/f4d0d/41521979.ece/AUTOCROP/w1240h700/dwyer-trial-4.jpg", "publishedAt": "2022-04-05T10:30:00Z", "content": "The Court of Justice for the European Union (CJEU) has ruled in favour of convicted killer Graham Dwyer in his challenge against Irelands data retention laws.\r\nIt published a judgment this morning wh… [+14580 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Global Times: US ramps up oil imports from Russia, pursues own interests at expense of European allies amid Ukraine crisis - The Edge Markets MY", "description": "(April 4): In a contrasting move to its pressuring of European allies to not buy Russian oil against the backdrop of the ongoing Ukraine crisis, the US increased crude oil supplies from Russia by 43 percent, or 100,000 barrels per day, over the past week, Rus…", "url": "https://www.theedgemarkets.com/article/global-times-us-ramps-oil-imports-russia-pursues-own-interests-expense-european-allies-amid", "urlToImage": "https://assets.theedgemarkets.com/pump_petrol_03032022_reuters_6.png?Ndf_bXpZLHCh7wi8sh8xbjLCOdN8HzRy", "publishedAt": "2022-04-05T03:56:38Z", "content": "(April 4): In a contrasting move to its pressuring of European allies to not buy Russian oil against the backdrop of the ongoing Ukraine crisis, the US increased crude oil supplies from Russia by 43 … [+703 chars]"}, {"source": {"id": null, "name": "Energymonitor.ai"}, "author": "Nick Ferris", "title": "Data insight: The permitting problem for EU wind farms - Energy Monitor", "description": "Europe has a massive challenge scaling up renewables to meet net zero. To achieve the EU’s target of reducing emissions by 55% by 2030 versus 1990, the European Commission has indicated that the overa", "url": "https://www.energymonitor.ai/policy/data-insight-the-permitting-problem-for-eu-wind-farms", "urlToImage": "https://www.energymonitor.ai/wp-content/uploads/sites/2/2022/04/shutterstock_1525041203.jpg", "publishedAt": "2022-04-05T03:22:58Z", "content": "Europe has a massive challenge scaling up renewables to meet net zero. To achieve the EUs target of reducing emissions by 55% by 2030 versus 1990, the European Commission has indicated that the overa… [+3473 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Alberto Nardelli, with assistance from Iain Rogers and Tony Czuczka", "title": "Europe warns Russia faces new sanctions for \"war crimes\" - News24", "description": "Some nations are said to be calling for a new set of sanctions, triggered by evidence of war crimes by Russian soldiers in Ukraine.", "url": "https://www.news24.com/fin24/economy/world/europe-warns-russia-faces-new-sanctions-for-war-crimes-20220403", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/546/a361efd7a1b740a186d7bdb61b7f1acf.jpg", "publishedAt": "2022-04-03T16:07:33Z", "content": "<ul><li>Some European Union governments are pushing for fresh sanctions to be imposed on Russia.</li><li>Nations argue evidence of war crimes are a trigger for new penalties.</li><li>Ukraine has accu… [+5892 chars]"}]}