{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exploring Earth From Space: Lake Trasimeno – The Fourth Largest Lake in Italy - SciTechDaily", "description": "Lake Trasimeno, the fourth largest lake in Italy, is featured in this week’s European Space Agency (ESA) Earth From Space image. Lake Trasimeno is located in central Italy, around 20 km (12 miles) west of Perugia, and encompasses an area of around 128 sq km (…", "url": "https://scitechdaily.com/exploring-earth-from-space-lake-trasimeno-the-fourth-largest-lake-in-italy/", "urlToImage": "https://scitechdaily.com/images/Lake-Trasimeno-Italy.jpg", "publishedAt": "2022-10-09T12:48:24Z", "content": "In this Copernicus Sentinel-2 image, captured on August 6, 2022, the lakes emerald green color is likely due to the presence of phytoplankton. Streaks in the water, particularly visible in the west, … [+3192 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Mohammed Babangida", "title": "Police, NIS rescue 30 victims of human trafficking in Katsina, Kebbi - Premium Times", "description": "Nigerian states sharing borders with Niger Republic are trafficking gateways of the brutal trafficking route across the Sahara Desert to Libya towards Europe.", "url": "https://www.premiumtimesng.com/news/top-news/558665-police-nis-rescue-30-victims-of-human-trafficking-in-katsina-kebbi.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/10/Rescue-in-Katsina.jpg", "publishedAt": "2022-10-09T07:50:39Z", "content": "The police and immigration personnel in Katsina and Kebbi have rescued 30 persons being trafficked across the state.\r\nIn separate statements on Friday, the victims confessed they were being trafficke… [+2701 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "NORA BULI, GWLADYS FOUCHE, Reuters", "title": "In echo of Cold War, Nobel Peace Prize goes to Ukraine, Russia, Belarus rights campaigners - GMA News Online", "description": "Jailed Belarusian activist Ales Byalyatski, Russian rights group Memorial and Ukraine&#39;s Center for Civil Liberties won the 2022 Nobel Peace Prize on Friday, amid a war in their region that is the worst conflict in Europe since World War Two. &nbsp;", "url": "https://www.gmanetwork.com/news/topstories/world/847334/in-echo-of-cold-war-nobel-peace-prize-goes-to-ukraine-russia-belarus-rights-campaigners/story/", "urlToImage": "https://images.gmanews.tv/webpics/2022/10/2022-10-07T144339Z_154343199_RC2EWW9YRS2Q_RTRMADP_3_NOBEL-PRIZE-PEACE-MEMORIAL_2022_10_07_23_28_13.JPG", "publishedAt": "2022-10-07T15:30:54Z", "content": "OSLO, Norway - Jailed Belarusian activist Ales Byalyatski, Russian rights group Memorial and Ukraine's Center for Civil Liberties won the 2022 Nobel Peace Prize on Friday, amid a war in their region … [+5283 chars]"}]}