{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Spacewalking Astronauts Complete Second Roll Out Solar Array Installation on Space Station - SciTechDaily", "description": "NASA astronaut Shane Kimbrough and ESA (European Space Agency) astronaut Thomas Pesquet concluded their spacewalk at 2:37 p.m. EDT, after 6 hours and 45 minutes. In the ninth spacewalk of the year outside the International Space Station, the two astronauts in…", "url": "https://scitechdaily.com/spacewalking-astronauts-complete-second-roll-out-solar-array-installation-on-space-station/", "urlToImage": "https://scitechdaily.com/images/Spacewalking-Astronauts-Shane-Kimbrough-and-Thomas-Pesquet.jpg", "publishedAt": "2021-06-26T16:42:19Z", "content": "Spacewalkers (from left) Shane Kimbrough and Thomas Pesquet work to install new roll out solar arrays on the International Space Stations P-6 truss structure on June 16, 2021. Credit: NASA\r\nNASA astr… [+2653 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "'Space is for everyone': Europe's space agency to hire first disabled astronaut - The Straits Times", "description": "Several hundred would-be para-astronauts have already applied for the role as part of the ESA's latest recruitment call.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/space-is-for-everyone-europes-space-agency-to-hire-first-disabled-astronaut", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/06/26/topshots-topshot-space-us-iss-science-072655.jpg?itok=wYlwvFVF", "publishedAt": "2021-06-25T16:18:10Z", "content": "BERLIN (REUTERS) - The European Space Agency hopes to hire and launch the world's first physically disabled astronaut and several hundred would-be para-astronauts have already applied for the role, E… [+2339 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Emmet Gates", "title": "UEFA rule change leaves Liverpool at a disadvantage, and Jürgen Klopp won't be happy - Liverpool.com", "description": "The away goal rule has been axed by the European governing body after 56 years, and the resulting change will mean Liverpool and other teams in European competition face the potential of more game time.", "url": "https://www.liverpool.com/liverpool-fc-news/features/uefa-rule-change-klopp-liverpool-20895684", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article20686224.ece/ALTERNATES/s1200/1_GettyImages-1147641162.jpg", "publishedAt": "2021-06-24T21:00:00Z", "content": "The away goal rule in European competition is no more. After 56 years, Uefa have called time on the law. \"It is no longer appropriate for an away goal to carry more weight,\" said Uefa president Aleks… [+4037 chars]"}]}