{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Emeatribune.com"}, "author": "News Agencies", "title": "The ExoMars Trace Gas Orbiter – a joint project by the European Space A - EMEA Tribune, Breaking News, World News, Latest News, Top Headlines", "description": "The ExoMars Trace Gas Orbiter – a joint project by the European Space Agency (ESA) and Russia’s Roscosmos – has captured an image of Mars’ southern highlands, with an intricate pattern made of windswept knobs, conical mounds, and ridges.The ESA poste", "url": "https://emeatribune.com/the-exomars-trace-gas-orbiter-a-joint-project-by-the-european-space-agenc/", "urlToImage": "https://cdni.rt.com/files/2022.02/article/6208c67e85f5400631153f42.jpg", "publishedAt": "2022-02-13T09:13:04Z", "content": "The ExoMars Trace Gas Orbiter a joint project by the European Space Agency (ESA) and Russias Roscosmos has captured an image of Mars southern highlands, with an intricate pattern made of windswept kn… [+1784 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Raf Casert", "title": "Ukraine-Russia crisis: What to know about the fears of war - CP24 Toronto's Breaking News", "description": "The chill of a Cold War hung over Eastern Europe again Friday, with Russian military maneuvers and drills close to Ukraine and the U.S. escalating its dire warnings about a possible Russian invasion of Ukraine, saying it could take place within days.", "url": "https://www.cp24.com/world/ukraine-russia-crisis-what-to-know-about-the-fears-of-war-1.5777376", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5777378.1644585461!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-11T13:18:21Z", "content": "BRUSSELS (AP) - The chill of a Cold War hung over Eastern Europe again Friday, with Russian military maneuvers and drills close to Ukraine and the U.S. escalating its dire warnings about a possible R… [+5195 chars]"}]}