{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Roman Olearchyk", "title": "Ukraine gas chief urges Europe to resist Russia pipeline pressure - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/8c02955c-de12-4caa-9716-0f6507d4f254", "urlToImage": null, "publishedAt": "2021-11-01T05:00:44Z", "content": "Expert insights, analysis and smart data help you cut through the noise to spot trends,\r\nrisks and opportunities.\r\nJoin over 300,000 Finance professionals who already subscribe to the FT."}, {"source": {"id": null, "name": "Global News"}, "author": "Aamer Madhani", "title": "White House press secretary Jen Psaki tests positive for COVID-19 - Global News", "description": "Jen Psaki had planned to travel with Joe Biden but scrapped the trip just as he was set to depart for Europe after learning that members of her household had COVID-19.", "url": "https://globalnews.ca/news/8339440/white-house-jen-psaki-covid-19/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/04/800-50.jpeg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-10-31T22:11:34Z", "content": "White House press secretary Jen Psaki said Sunday she has contracted COVID-19.\r\nPsaki was not traveling with President Joe Biden, who was in Rome this weekend for the Group of 20 summit and is headed… [+776 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Cronje", "title": "EU seeking to launch project to help SA phase out coal at COP26 climate summit - News24", "description": "The European Union is looking to officially launch its project to help SA phase out coal at the COP26 climate summit which started on Sunday in Glasgow, Scotland.", "url": "https://www.news24.com/fin24/economy/eu-seeking-to-launch-project-to-help-sa-to-phase-out-coal-at-cop26-climate-summit-20211031", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7395/9ecf794543c34bb9a2b3be183f5a3f39.jpg", "publishedAt": "2021-10-31T13:47:41Z", "content": "The European Union is seeking to launch its project to help SA phase out coal at the COP26 climate summit which started on Sunday in Glasgow, Scotland. \r\nSpeaking in the runup to the summit, European… [+1090 chars]"}]}