{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": null, "title": "Hamilton, Serena Williams join Chelsea bid; Man Utd skipper gets bomb threat - Sydney Morning Herald", "description": "UK media reports indicate the former world No.1 and seven-time F1 world champion have each pledged more than $17 million to the bid to buy the European champions.", "url": "https://www.smh.com.au/sport/soccer/manchester-united-captain-receives-bomb-threat-at-home-20220422-p5afb0.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5519%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/e594a7067a9c92b2b3e8881977bc1b8c917ea109", "publishedAt": "2022-04-21T22:51:29Z", "content": "A consortium led by Chicago Cubs owners the Ricketts family pulled out of the running.\r\nThe clubs sale is being overseen by US bank Raine Group.\r\nLewis Hamilton is an Arsenal fan but has shown intere… [+2341 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Hartley Charlton", "title": "EU Moves One Step Closer to Mandating Apple to Switch iPhone, iPad, and AirPods to USB-C - MacRumors", "description": "Members of the European Parliament this week voted overwhelmingly in support of legislation that will compel Apple to offer a USB-C port on all...", "url": "https://www.macrumors.com/2022/04/21/eu-closer-to-mandate-apple-switch-to-usb-c/", "urlToImage": "https://images.macrumors.com/t/aEGd0KYgvcicmxBxC5QCJXQxJcU=/2500x/article-new/2021/09/USB-C-Over-Lightning-Feature.jpg", "publishedAt": "2022-04-21T14:54:48Z", "content": "Members of the European Parliament this week voted overwhelmingly in support of legislation that will compel Apple to offer a USB-C port on all iPhones, iPads, and AirPods in Europe.\r\nThe proposal, k… [+2339 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Micronovae: A New Kind of Thermonuclear Stellar Explosion - SciTechDaily", "description": "A team of astronomers, with the help of the European Southern Observatory’s Very Large Telescope (ESO’s VLT), have observed a new type of stellar explosion — a micronova. These outbursts happen on the surface of certain stars, and can each burn through around…", "url": "https://scitechdaily.com/astronomers-discover-micronovae-a-new-kind-of-thermonuclear-stellar-explosion/", "urlToImage": "https://scitechdaily.com/images/Micronova.gif", "publishedAt": "2022-04-21T09:27:07Z", "content": "A team of astronomers, with the help of the European Southern Observatorys Very Large Telescope (ESOs VLT), have observed a new type of stellar explosion a micronova. These outbursts happen on the su… [+8541 chars]"}]}