{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Emiko Matsui", "title": "Huawei Mate 50 Pro launching soon in Germany - HC Newsroom", "description": "Huawei has confirmed that the Mate 50 Pro flagship will launch soon in Germany. This mark the official entrance of Huawei Mate 50 Pro in Europe, as the phone is already available to purchase in Poland. Up until today, the Chiense tech giant didn’t promote the…", "url": "https://www.huaweicentral.com/huawei-mate-50-pro-launching-soon-in-germany/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/09/huawei-mate-50-pro-live-image-3-1000x576.jpg", "publishedAt": "2022-10-25T11:08:02Z", "content": "Huawei is the first global leader that highly serves in the 5G network solutions. The company has achieved several rewards and praise for its powerful 5G devices. Despite the success, 5G phones have … [+3275 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Jesse Whittock", "title": "‘House Of The Dragon’ Overtakes ‘Game Of Thrones’ To Become Most Viewed HBO Title In Europe, Claims Streamer - Deadline", "description": "House of the Dragon has smashed HBO’s SVoD ratings records in Europe, Warner Bros Discovery has claimed. The fantasy drama’s debut run has surpassed season eight of progenitor Game of Thrones to become the most-viewed title on HBO’s subscription streaming ser…", "url": "https://deadline.com/2022/10/hbo-house-of-the-dragon-game-of-thrones-most-viewed-europe-1235154155/", "urlToImage": "https://deadline.com/wp-content/uploads/2022/10/819106_6150343_5867x4000.jpeg?w=1024", "publishedAt": "2022-10-25T10:54:00Z", "content": "House of the Dragon has smashed HBO’s SVoD ratings records in Europe, Warner Bros Discovery has claimed.\r\nThe fantasy drama’s debut run has surpassed season eight of progenitor Game of Thrones to bec… [+1462 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "How the gamma-ray burst of the century surprised spacecraft operators - Space.com", "description": "Europe's galaxy mapper Gaia sent a strange signal that ground controllers first couldn't explain.", "url": "https://www.space.com/gamma-ray-burst-surprises-satellite-operators", "urlToImage": "https://cdn.mos.cms.futurecdn.net/KXhYs62f7EpZxAU7tGCjyL-1200-80.jpg", "publishedAt": "2022-10-24T14:03:46Z", "content": "A fleet of space telescopes unexpectedly detected the record-breaking gamma-ray burst GRB221009A onOct.9, sparking concern among spacecraft operators about the blast's odd signal. \r\nThe European Spac… [+2964 chars]"}, {"source": {"id": null, "name": "Ras.ac.uk"}, "author": "Florin Simion @Yonescat", "title": "The RAS and JWST - The Royal Astronomical Society", "description": "At its meeting in July the governing council of the Royal Astronomical Society (RAS) took a decision to write to the UK Space Agency, the European Space\nAgency (ESA)...", "url": "https://ras.ac.uk/news-and-press/news/ras-and-jwst", "urlToImage": "https://ras.ac.uk/sites/default/files/2020-04/RoyalAstronomicalSociety_SecondaryLogo_Black_2.jpg", "publishedAt": "2022-10-24T09:32:00Z", "content": "At its meeting in July the governing council of the Royal Astronomical Society (RAS) took a decision to write to the UK Space Agency, the European Space Agency (ESA) and NASA to express its concerns … [+2172 chars]"}]}