{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Q4FY23 just a sneak peak, banks crisis in US, Europe may impact Indian IT firms' first quarter of FY24 | Mint - Mint", "description": "For FY24, Kotak said, the estimates for the fiscal were supposed to be weak and should play out that way. The brokerage expects banking crisis in US and Europe to impact Indian IT firms in June 2023 quarter.", "url": "https://www.livemint.com/companies/news/q4fy23-just-a-sneak-peak-banking-crisis-in-us-europe-may-impact-indian-it-firms-first-quarter-of-fy24-11681896098261.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/04/19/600x338/3-0-97431674-iStock-834792042-0_1679787577110_1681897575556.jpg", "publishedAt": "2023-04-19T09:48:10Z", "content": "Indian tech firms have been trading extremely volatile this week sparkled after TCS and Infosys posted lower-than-expected Q4 earnings. Wednesday was no different, as the majority of IT stocks are in… [+4268 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Passant Rabie", "title": "Desperate to Launch: Europe Looks to SpaceX as Rocket Woes Continue - Gizmodo", "description": "With Vega-C grounded and Ariane 6 not ready, the European Commission is considering agreements with U.S. companies to \"exceptionally launch\" its satellites.", "url": "https://gizmodo.com/europe-looks-spacex-rocket-woes-continue-1850348711", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/09125a155d24f20d4252a6edaf655e79.jpg", "publishedAt": "2023-04-18T19:30:00Z", "content": "Europes navigation satellites are in desperate need of a ride to space, so much so that the European government is seeking to forge deals with U.S. companies to provide much-needed orbital access. \r\n… [+2813 chars]"}, {"source": {"id": null, "name": "WFLA"}, "author": "Kaycee Sloan", "title": "Sloth steals the show during Jupiter mission launch broadcast - WFLA", "description": "As viewers turned in to watch the European Space Agency’s (ESA) mission launch to Jupiter Saturday, they were surprised and delighted to see a sloth’s brief onscreen appearance.", "url": "https://www.wfla.com/news/national/sloth-steals-the-show-during-jupiter-mission-launch-broadcast/", "urlToImage": "https://www.wfla.com/wp-content/uploads/sites/71/2023/04/Sloth.png?w=1280", "publishedAt": "2023-04-18T14:28:47Z", "content": "TAMPA, Fla. (WFLA) As viewers turned in to watch the European Space Agency’s (ESA) mission launch to Jupiter Saturday, they were surprised and delighted to see a sloth’s brief onscreen appearance. \r\n… [+719 chars]"}]}