{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Nord Stream 1: Gas pipeline shuts down for maintenance - CTV News", "description": "A major natural gas pipeline from Russia to western Europe shut down Monday for annual maintenance as Germany prepared to give the green light for 10 coal-fired power plants to restart because of concerns that Russia may not resume the flow of gas as schedule…", "url": "https://www.ctvnews.ca/world/gas-pipeline-shutdown-starts-amid-german-suspicion-of-russia-1.5982237", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/11/nord-stream-1-1-5982238-1657534855412.jpg", "publishedAt": "2022-07-11T20:56:22Z", "content": "BERLIN - \r\nA major natural gas pipeline from Russia to western Europe shut down Monday for annual maintenance as Germany prepared to give the green light for 10 coal-fired power plants to restart bec… [+5827 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Mark Sweney", "title": "Klarna sees its value slashed by 85% in latest round of fundraising - The Guardian", "description": "‘Buy now, pay later’ firm, once Europe’s most valuable private tech company, valued at less than $7bn", "url": "https://amp.theguardian.com/technology/2022/jul/11/klarna-sees-its-value-slashed-by-85-in-latest-round-of-fundraising", "urlToImage": null, "publishedAt": "2022-07-11T19:41:00Z", "content": "Buy now, pay laterBuy now, pay later firm, once Europes most valuable private tech company, valued at less than $7bn\r\nKlarna, the buy now, pay later fintech darling that was once Europes most valuabl… [+2991 chars]"}, {"source": {"id": null, "name": "Easternmirrornagaland.com"}, "author": "https://www.facebook.com/teka.longkumer.1", "title": "Samsung's Galaxy S23 series to ditch Exynos for Qualcomm's Snapdragon SoC - Eastern Mirror", "description": "It has long been a tradition for Samsung to release its flagship Galaxy S series devices with two different processors—Samsung-made Exynos SoC for European and Asian markets and Qualcomm’s flagship processor for the rest. The company has always been criticise…", "url": "https://easternmirrornagaland.com/samsungs-galaxy-s23-series-to-ditch-exynos-for-qualcomms-snapdragon-soc/", "urlToImage": "https://easternmirrornagaland.com/wp-content/uploads/2022/07/Samsungs-Exynos-SoC.jpg", "publishedAt": "2022-07-11T18:58:16Z", "content": "Photo: Samsung India.\r\nIt has long been a tradition for Samsung to release its flagship Galaxy S series devices with two different processorsSamsung-made Exynos SoC for European and Asian markets and… [+1984 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "AFP", "title": "EU to slash growth forecast again as high inflation persists - TheJournal.ie", "description": "The European Commission is to hike its expectations for inflation.", "url": "https://www.thejournal.ie/eu-commission-inflation-5813958-Jul2022/", "urlToImage": "https://img2.thejournal.ie/article/5813958/river/?height=400&version=5813968", "publishedAt": "2022-07-11T14:53:00Z", "content": "THE EUROPEAN COMMISSION has said it will again cut its growth forecast for this year and hike its expectations for inflation, but it signalled it saw no sign yet of recession in Europe.\r\nWhat we see … [+1884 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Ed Stoddard", "title": "THE ECONOMY: Recession and stagflation loom in South Africa thanks to load shedding - Daily Maverick", "description": "Talk about recession is all the rage these days in the US, Europe and other leading economies such as Japan and Canada.", "url": "https://www.dailymaverick.co.za/article/2022-07-10-recession-and-stagflation-loom-in-south-africa-thanks-to-load-shedding/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/06/fdloadshedding4.jpg?w=1280", "publishedAt": "2022-07-10T18:31:05Z", "content": "Against the backdrop of worldwide fears of recession, South Africas battered economy can hardly escape unscathed.\r\nIndeed, recession and stagflation are looming on the horizon in the face of intensif… [+6742 chars]"}]}