{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Ancient Origins"}, "author": "Nathan Falde", "title": "Humans and Neanderthals Lived Together in Europe for 2000 Years! - Ancient Origins", "description": "When humans first arrived on the European continent about 42,500 years ago, the Neanderthals were still living there, and would remain there for another 1,400 to 2,900 years before finally disappearing from the face of the Earth.", "url": "https://www.ancient-origins.net/news-evolution-human-origins/humans-and-neanderthals-0017403", "urlToImage": "https://www.ancient-origins.net/sites/default/files/field/image/humans-and-Neanderthals_0.jpg", "publishedAt": "2022-10-16T13:53:00Z", "content": "When humans first arrived on the European continent about 42,500 years ago, the Neanderthals were still living there, and would remain there for another 1,400 to 2,900 years before finally disappeari… [+6796 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL", "title": "'The Hell With It': SpaceX CEO Musk Reverses Position On Funding Satellite Internet For Ukraine - Radio Free Europe / Radio Liberty", "description": "SpaceX CEO Elon Musk now says that his company will continue to pay for the Starlink satellite Internet service for Ukraine, a day after suggesting SpaceX could no longer afford it.", "url": "https://www.rferl.org/a/musk-starlink-ukraine-funding-spacex/32084855.html", "urlToImage": "https://gdb.rferl.org/04230000-0aff-0242-cea3-08daa6cbb779_cx0_cy4_cw0_w1200_r1.jpg", "publishedAt": "2022-10-16T04:36:06Z", "content": "Russian forces continue to target civilian infrastructure in towns and villages across Ukraine as President Volodymyr Zelenskiy said Ukrainian troops are fending off repeated Russian attacks on the s… [+5382 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Perspectives on cancer screening participation in a highly urbanized region: a Q-methodology study in The Hague, the Netherlands - BMC Public Health - BMC Public Health", "description": "Background The Netherlands hosts, as many other European countries, three population-based cancer screening programmes (CSPs). The overall uptake among these CSPs is high, but has decreased over recent years. Especially in highly urbanized regions the uptake …", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-14312-4", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-10-15T13:49:31Z", "content": null}]}