{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": ".", "title": "All You Need To Know About Europe-based Ghanian Rapper TBKOfficixl - Leadership News", "description": "Either back home or in the diaspora, Africans have continously expoused the fact that all they require is an environment to showcase that they are", "url": "https://leadership.ng/all-you-need-to-know-about-europe-based-ghanian-rapper-tbkofficixl/", "urlToImage": "https://leadership.ng/wp-content/uploads/2022/05/LeadershipHeader.png", "publishedAt": "2023-01-01T20:56:16Z", "content": "Either back home or in the diaspora, Africans have continously expoused the fact that all they require is an environment to showcase that they are super-talented. Someone who is again proving that to… [+2521 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Historic new year for Croatia as it joins euro, Schengen area - Reuters", "description": "Croatia rang in two historic changes with the new year, as the European Union's youngest member joined both the EU's border-free Schengen zone and the euro common currency, fulfilling longstanding ambitions of close integration with Europe.", "url": "https://www.reuters.com/world/europe/historic-new-year-croatia-it-joins-euro-schengen-area-2023-01-01/", "urlToImage": "https://www.reuters.com/resizer/R5y8QI2HxJqGpGfWbZj9Jw0k_dk=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/J56IJ6FFORLFJMSQ5LNWOXK42E.jpg", "publishedAt": "2023-01-01T18:17:00Z", "content": "BREGANA BORDER CROSSING, Croatia, Jan 1 (Reuters) - Croatia rang in two historic changes with the new year, as the European Union's youngest member joined both the EU's border-free Schengen zone and … [+1887 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "YUKI IWAMURA, Agence France-Presse", "title": "World steps into 2023 after turbulent year - GMA News Online", "description": "The world&#39;s eight billion people have been ushering in 2023, bidding farewell to a turbulent year marked by war in Europe, stinging price rises, Lionel Messi&#39;s World Cup glory and the deaths of Queen Elizabeth, Pele and former pope Benedict.", "url": "https://www.gmanetwork.com/news/topstories/world/856031/world-steps-into-2023-after-turbulent-year/story/", "urlToImage": "https://images.gmanews.tv/webpics/2022/04/000_327J347_2022_04_03_18_02_44.jpg", "publishedAt": "2023-01-01T15:59:19Z", "content": "NEW YORK — The world's eight billion people have been ushering in 2023, bidding farewell to a turbulent year marked by war in Europe, stinging price rises, Lionel Messi's World Cup glory and the deat… [+5168 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "news24", "title": "World steps into 2023 after turbulent year - News24", "description": "The world's eight billion people Saturday ushered in 2023, bidding farewell to a turbulent 12 months marked by war in Europe, stinging price rises, Lionel Messi's World Cup glory and the deaths of Queen Elizabeth, Pele and former pope Benedict.", "url": "https://www.news24.com/news24/world/news/world-steps-into-2023-after-turbulent-year-20230101", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/554/9eb427de8f244747b0c43934f9d5d6ae.jpg", "publishedAt": "2023-01-01T06:34:22Z", "content": "<ul><li>The world ushered in the New Year in the first 'normal' celebrations since the onset of the Covid-19 pandemic. </li><li>2023 was a tumultuous year, with several high profile deaths and the wa… [+5527 chars]"}]}