{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Lakes under Mars south pole may not be real - Free Press Journal", "description": "Subsurface lakes found under Mars' south pole, using data from the European Space Agency's Mars Express orbiter, may not really be lakes at all, argue researchers. Two research teams in 2018, working on data from the Mars Express orbiter announced a surprisin…", "url": "https://www.freepressjournal.in/science/lakes-under-mars-south-pole-may-not-be-real", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-07%2F9a47d38d-4944-476a-b6fb-1c99806a8243%2Fmars.jpg?rect=0%2C73%2C760%2C399&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-07-04T16:01:50Z", "content": "It revealed dozens of additional bright radar reflections over a far greater range of area and depth than ever before. In some places, they were less than a mile from the surface, where temperatures … [+686 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid-19: Europe's view on vaccine certificates - BBC News", "description": "As Ireland considers vaccine certificates, how is the scheme working in other EU countries?", "url": "https://www.bbc.com/news/world-europe-57681709", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/70A6/production/_119183882_passepa.jpg", "publishedAt": "2021-07-04T06:11:38Z", "content": "By Ross McKeeBBC News\r\nimage copyrightCaroline Corr\r\nimage captionCaroline Corr is originally from Carryduff in County Down, but is now based in Luxembourg\r\nThe Digital Covid Certificate is being rol… [+7974 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Europe in vaccination race against COVID-19’s delta variant - The Indian Express", "description": "The risk of infection from the delta variant is “high to very high” for partially or unvaccinated communities, according to the European Centre for Disease Control, which monitors 30 countries on the continent.", "url": "https://indianexpress.com/article/world/europe-in-vaccination-race-against-covid-19s-delta-variant-7388097/", "urlToImage": "https://images.indianexpress.com/2021/07/vaccine-covid.jpg", "publishedAt": "2021-07-04T03:06:13Z", "content": "Countries across Europe are scrambling to accelerate coronavirus vaccinations and outpace the spread of the more infectious delta variant, in a high-stakes race to prevent hospital wards from filling… [+5833 chars]"}, {"source": {"id": null, "name": "Chicago Daily Herald"}, "author": "Associated Press", "title": "England to play Denmark in Euro 2020 semifinals at Wembley - Chicago Daily Herald", "description": "England will play Denmark in the semifinals of the European Championship at Wembley Stadium on Wednesday", "url": "https://www.dailyherald.com/article/20210703/sports/307039942", "urlToImage": "https://www.dailyherald.com/storyimage/DA/20210703/sports/307039942/AR/0/AR-307039942.jpg&updated=202107031713&imageversion=Facebook&exactH=630&exactW=1200&exactfit=crop&noborder", "publishedAt": "2021-07-03T23:06:31Z", "content": "LONDON -- The last team to beat England is the next team they'll play: Denmark.\r\nThe Danes will travel to London for a European Championship semifinal match on Wednesday with memories still fresh of … [+2307 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "COVID: Europe races to vaccinate amid surge in Delta variant - msnNOW", "description": "Experts predict that the delta variant could become the predominant strain in Europe by August. Many are calling for a more comprehensive vaccination campaign to prevent the spread of the highly transmissible mutation.", "url": "https://www.dw.com/en/covid-europe-races-to-vaccinate-amid-surge-in-delta-variant/a-58146241", "urlToImage": "https://static.dw.com/image/55970655_6.jpg", "publishedAt": "2021-07-03T11:17:00Z", "content": "European nations are racing to vaccinate their populations against the coronavirus amid fears that the highly transmissible delta variant could spark another COVID wave and overwhelm health systems.\r… [+2333 chars]"}]}