{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The42"}, "author": "Gavin Cooney", "title": "Shamrock Rovers beat Shkupi to guarantee European group stage football - The42", "description": "A 2-1 win away from home means Rovers will face Ferencvaros for a spot in the Europa League, with a spot in the Conference League guaranteed.", "url": "https://www.the42.ie/shamrock-rovers-22-5837203-Aug2022/", "urlToImage": "https://img2.thejournal.ie/article/5837203/river/?height=400&version=5837379", "publishedAt": "2022-08-09T21:01:00Z", "content": "FC Shkupi 1\r\nShamrock Rovers 2\r\nShamrock Rovers win 5-2 on aggregate \r\nTRULY THE OPPOSITE of Having A (North) Macedonia.\r\nShamrock Rovers tonight took care of the challenge of FC Shkupi with all of t… [+5569 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stephen Mcgowan", "title": "Rangers 3-0 Union Saint-Gilloise (agg 3-2): Gers overcome two-goal deficit in Champions League win - Daily Mail", "description": "STEPHEN McGOWAN AT IBROX: On another pulsating European night at Ibrox Malik Tillman's first goal for the club came with both immaculate timing and a slice of history.", "url": "https://www.dailymail.co.uk/sport/football/article-11096455/Rangers-3-0-Union-Saint-Gilloise-agg-3-2-Gers-overcome-two-goal-deficit-Champions-League-win.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/09/22/61231737-0-image-a-8_1660080503354.jpg", "publishedAt": "2022-08-09T20:40:13Z", "content": "Never before had Rangers overcome a two-goal first leg defeat to progress in a UEFA competition. On another pulsating European night at Ibrox Malik Tillmans first goal for the club came with both imm… [+7978 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Rising fears as Ukraine nuclear plant shelled - CBC News", "description": "Russia and Ukraine traded accusations Monday that each side is shelling Europe's biggest nuclear power plant in southern Ukraine. Nuclear experts have warned that more shelling of the Zaporizhzhia nuclear power station, which was captured by Russia early in t…", "url": "https://www.cbc.ca/news/world/ukraine-nuclear-plant-shelled-1.6544727", "urlToImage": "https://i.cbc.ca/1.6544746.1659976209!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/russia-ukraine.jpg", "publishedAt": "2022-08-08T16:46:00Z", "content": "Russia and Ukraine traded accusations Monday that each side is shelling Europe's biggest nuclear power plant in southern Ukraine. Russia claimed that Ukrainian shelling caused a power surge and fire … [+6206 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This job title is in high-demand in South Africa right now – and international firms are also hiring - BusinessTech", "description": "OfferZen’s co-founder, Phil Joubert, says that massive global digital transformation has only made it more challenging for companies to find software developers. Demand for software developers’ skills is up by 20%, but the pool of developers in Europe is only…", "url": "https://businesstech.co.za/news/technology/614791/this-job-title-is-in-high-demand-in-south-africa-right-now-and-international-firms-are-also-hiring/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/07/WeWorkOffice-e1657698235646.png", "publishedAt": "2022-08-08T15:38:53Z", "content": "OfferZens co-founder, Phil Joubert, says that massive global digital transformation has only made it more challenging for companies to find software developers. Demand for software developers skills … [+4669 chars]"}]}