{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "POLITICO.eu"}, "author": "Murdo Gordon, executive vice president, global commercial operations, Amgen", "title": "Innovation is the foundation of resilient health care systems - POLITICO Europe", "description": "R&D to discover, develop and deliver transformative medicines that address important treatment gaps in severe illnesses, at a speed that rapidly and appropriately meets our communities’ health…", "url": "https://www.politico.eu/sponsored-content/innovation-is-the-foundation-of-resilient-health-care-systems/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/07/20/iStock-1165067633-scaled.jpeg", "publishedAt": "2022-07-25T03:16:04Z", "content": "Recent crises have highlighted the critical need for Europe to secure and strengthen its position as leader in medical innovation. As the European Commission works on the review of the Pharmaceutical… [+7621 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Chike Olisah", "title": "European Union intensifies pressure on FG to replace Russian gas with Nigerian supplies - Nairametrics", "description": "The European Union (EU) has intensified its pressure on Nigeria for additional gas supplies to the bloc as it gets", "url": "https://nairametrics.com/2022/07/24/__trashed-11/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/07/Matthew-Baldwin.jpg", "publishedAt": "2022-07-24T14:22:34Z", "content": "The European Union (EU) has intensified its pressure on Nigeria for additional gas supplies to the bloc as it gets set to cut supply from Russia due to its invasion of Ukraine.\r\nThis was made known b… [+3321 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bloomberg", "title": "Africa: Banned in Europe, Kremlin-backed RT channel to set up hub in South Africa - Daily Maverick", "description": "RT is setting up an Africa English language hub in South Africa. An earlier African plan had focused on a Nairobi office.", "url": "https://www.dailymaverick.co.za/article/2022-07-24-banned-in-europe-kremlin-backed-rt-channel-to-set-up-hub-in-south-africa/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/07/RT-bloomberg-e1658647275511.jpeg?w=1280", "publishedAt": "2022-07-24T07:31:14Z", "content": "(Bloomberg) — RT, the Kremlin-backed TV network formerly called Russia Today, is setting up its first Africa bureau as President Vladimir Putin seeks to entrench support in a continent thats largely … [+2228 chars]"}]}