{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "POLITICO.eu"}, "author": "Ashleigh Furlong", "title": "Coronavirus vaccine booster trial begins in UK - POLITICO Europe", "description": "Study comes as governments debate how to reopen amid concern about the spread of new variants of concern.", "url": "http://www.politico.eu/article/worlds-first-vaccine-booster-trial-begins-in-uk/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2021/05/19/GettyImages-1232945664-1200x628.jpg", "publishedAt": "2021-05-19T17:38:47Z", "content": "A study looking at coronavirus vaccine boosters has launched in the U.K. to test the effects of an extra dose.\r\nThe trial, hailed by the British government as a world-first for the COVID-19 jab, will… [+940 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Yuliya Talmazan", "title": "European Union set to allow U.S. travelers as Covid restrictions lift - NBC News", "description": "Ambassadors from the 27 European Union countries agreed on Wednesday that restrictions for travelers from outside the E.U. should be eased.", "url": "https://www.nbcnews.com/news/world/european-union-set-allow-u-s-travelers-covid-restrictions-lift-n1267913", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2021_20/3475981/210519-eu-tourism-mc-13394.JPG", "publishedAt": "2021-05-19T13:59:00Z", "content": "LONDON The prospect of international travel resuming this summer just got a step closer.\r\nAmbassadors from the 27 European Union countries agreed on Wednesday that restrictions for travelers from out… [+3059 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "How a change in the Pfizer's storage temperature could completely change vaccine access - CBC.ca", "description": "The Pfizer vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, a move that could have major implications on the rollout of vaccines across Canada and the world.", "url": "https://www.cbc.ca/news/health/pfizer-vaccine-canada-storage-temperature-1.6031823", "urlToImage": "https://i.cbc.ca/1.6014567.1621384276!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-ont-vaccine-20210107.jpg", "publishedAt": "2021-05-19T08:00:00Z", "content": "The Pfizer-BioNTech COVID-19 vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, which could have major implications on the rollout of v… [+6590 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Murray Kinsella", "title": "'I'm in it to win. I'm not in it to partake' - ROG and La Rochelle target European crown - The42", "description": "The Cork man’s coaching philosophy continues to impress.", "url": "https://www.the42.ie/rog-la-rochelle-5440605-May2021/", "urlToImage": "https://img2.thejournal.ie/article/5440605/river/?height=400&version=5440871", "publishedAt": "2021-05-19T05:00:00Z", "content": "IT DOESNT COME as any surprise given that hes nearing the end of his sixth season of coaching in the Top 14, but its still impressive to listen to Ronan OGara run through the first half of a press co… [+6818 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "WhatsApp changes South Africans should know about: legal expert - BusinessTech", "description": "South Africa’s Information Regulation is taking legal advice on WhatsApp’s updated privacy policy, which gives more disclosure about use of their personal information to users in the European Union than outside it.", "url": "https://businesstech.co.za/news/mobile/491095/whatsapp-changes-south-africans-should-know-about-legal-expert/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/05/Whatsapp-1.jpg", "publishedAt": "2021-05-18T06:54:32Z", "content": "South Africas Information Regulation is taking legal advice on WhatsApps updated privacy policy – which discloses more about the use of personal information to users in the European Union, than in pl… [+3529 chars]"}]}