{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Football.London"}, "author": "Daniel Orme", "title": "Chelsea, Tottenham and Arsenal make major decision after European Super League failure - Football.London", "description": "The three London outfits have been welcomed back having left the association in the midst of the European Super League plan", "url": "https://www.football.london/arsenal-fc/news/chelsea-arsenal-tottenham-super-league-21325692", "urlToImage": "https://i2-prod.football.london/incoming/article21325680.ece/ALTERNATES/s1200/0_GettyImages-1232438474.jpg", "publishedAt": "2021-08-16T16:30:00Z", "content": "Chelsea, Tottenham Hotspur and Arsenal have all rejoined the European Club Association just four months after leaving.\r\nThe three Premier League clubs each departed the association in April amid the … [+3054 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Europe eyes arthritis drug for COVID-19 cases - Fox News", "description": "The European Medicines Agency has started an accelerated review process to determine if a common arthritis drug might help people hospitalized with severe COVID-19, months after the drug was granted an emergency use authorization in the U.S.", "url": "https://www.foxnews.com/health/europe-eyes-arthritis-drug-covid-19", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/06/zook_vaccnie.jpg", "publishedAt": "2021-08-16T14:38:06Z", "content": "AMSTERDAM The European Medicines Agency has started an accelerated review process to determine if a common arthritis drug might help people hospitalized with severe COVID-19, months after the drug wa… [+874 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "The Associated Press", "title": "The Latest: Europe eyes arthritis drug for COVID-19 cases - Manchestertimes", "description": "JERUSALEM — Israel says that more than 1 million people over the age of 50 have received a third dose of the coronavirus vaccine. Israel began offering the boosters to its older population two weeks ago, becoming the first country in the world using a western…", "url": "https://apnews.com/0af50baa25dbd410d229af8588068f52", "urlToImage": "https://storage.googleapis.com/afs-prod/media/96eabd11c3f949a29c87fa1c7f17b08c/3000.jpeg", "publishedAt": "2021-08-16T13:43:36Z", "content": "JERUSALEM Israel says that more than 1 million people over the age of 50 have received a third dose of the coronavirus vaccine.\r\nIsrael began offering the boosters to its older population two weeks a… [+15060 chars]"}, {"source": {"id": null, "name": "Metro.co.uk"}, "author": "Joe Roberts", "title": "Spain: Firefighters dwarfed by flames as temperatures hit 47.2°C - Metro.co.uk", "description": "A new provisional heat record of 47.2C was recorded in Cordoba on Saturday, as much of Southern Europe sweltered under a relentless heatwave.", "url": "https://metro.co.uk/2021/08/16/spain-firefighters-dwarfed-by-flames-as-temperatures-hit-47-2c-15097055/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2021/08/PRC_194979119_1629108361.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2021-08-16T09:56:00Z", "content": "Hundreds of firefighters were dispatched to forests near Avila, central Spain (Picture: AFP)\r\nAt least 800 people were evacuated in Spain as wildfires decimated forests and temperatures soared to an … [+2264 chars]"}, {"source": {"id": null, "name": "Theroar.com.au"}, "author": "Will Genia", "title": "WILL GENIA: 'Samu must start, Tate can wear No.9 jersey for 10 years and time to ditch Giteau Law' - The Roar", "description": "Will Skelton left Australia early in 2017 to take up a contract with Saracens, where he won two domestic titles and a European Cup. He moved to La Rochelle in France and has been their best player all year. He’s dominating European rugby, and completely chang…", "url": "https://www.theroar.com.au/2021/08/16/will-genia-time-to-shed-old-school-thinking-we-need-our-best-on-the-field-to-stand-a-chance/", "urlToImage": "https://cdn4.theroar.com.au/wp-content/uploads/2019/09/samu-kerevi-wallabies-world-cup-1200x675.jpg", "publishedAt": "2021-08-16T01:59:38Z", "content": "Will Skelton left Australia early in 2017 to take up a contract with Saracens, where he won two domestic titles and a European Cup.\r\nHe moved to La Rochelle in France and has been their best player a… [+10370 chars]"}]}