{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Andrew McGarry, Yasmin Jeffery", "title": "Eurovision 2021 song contest's top 10 favourites face showdown in Rotterdam - ABC News", "description": "Australia's no longer in it to win it, but the good news is Europe's entries are *giving* this year. Who are you going to support out of the hot favourites to win the Eurovision Song Contest?", "url": "https://www.abc.net.au/news/2021-05-22/eurovision-2021-favourites-win-song-contest-rotterdam/100153888", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/2e56c42e172948b57062cff864f89f66?impolicy=wcms_crop_resize&cropH=2808&cropW=4991&xPos=0&yPos=94&width=862&height=485", "publishedAt": "2021-05-21T18:45:43Z", "content": "The Eurovision Song Contest is back in all its glory after a year off due to COVID-19. \r\nAll you need to know about Eurovision\r\nIt's Eurovision Song Contest time again. Whether you're a newbie or a l… [+9968 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Kolbe faces former Stormers touring room-mate Leyds in European Champions Cup final - News24", "description": "Springboks Cheslin Kolbe and Rynhardt Elstadt of Toulouse will face off against compatriots Raymond Rhule and Dillyn Leyds of La Rochelle in the European Champions Cup final.", "url": "https://www.news24.com/sport/rugby/springboks/kolbe-faces-former-stormers-touring-room-mate-leyds-in-european-champions-cup-final-20210521", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/491/93aa3a1931a24d0699113db07d5768bc.png", "publishedAt": "2021-05-21T15:11:36Z", "content": "<ul><li>Toulouse's Cheslin Kolbe and Rynhardt Elstadt face off against fellow Springboks Raymond Rhule and Dillyn Leyds against La Rochelle in the European Champions Cup final.</li><li>Of the two Fre… [+3060 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Pushkala Aripaka", "title": "EU advises against second AstraZeneca shot for people with blood clots - Reuters", "description": "The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving the first, Europe's medicines regulator said on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-astrazeneca-ema-idUSKCN2D21EU", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210521&t=2&i=1562951231&r=LYNXNPEH4K0Q9&w=800", "publishedAt": "2021-05-21T13:29:07Z", "content": "(Reuters) -The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving t… [+2060 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "European Space Agency reveals ambitious plans to build sat-nav around the moon - Daily Mail", "description": "The new infrastructure could turn our natural satellite into the 'eighth continent' as humanity spreads its wings and builds cities on the moon, according to the Paris-based space agency.", "url": "https://www.dailymail.co.uk/sciencetech/article-9604425/European-Space-Agency-reveals-ambitious-plans-build-sat-nav-moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/05/21/14/43272787-0-image-a-6_1621602667047.jpg", "publishedAt": "2021-05-21T13:10:28Z", "content": "The European Space Agency (ESA) has launched an ambitious new project to build a sat-nav and communication satellite network in orbit around the moon.\r\nThis new infrastructure could one day turn our … [+12926 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}, {"source": {"id": null, "name": "New Straits Times"}, "author": "AFP", "title": "WHO: Vaccines effective against variants but overseas travel still not safe - New Straits Times", "description": "COPENHAGEN: Progress against the coronavirus pandemic remains \"fragile\" and international travel should be avoided, the World Health Organization's Europe director warned on Thursday, but stressed that authorised vaccines do work against variants of concern.", "url": "https://www.nst.com.my/world/world/2021/05/691796/who-vaccines-effective-against-variants-overseas-travel-still-not-safe", "urlToImage": "https://assets.nst.com.my/images/articles/not_safe-MS2005_NSTfield_image_socialmedia.var_1621517409.jpg", "publishedAt": "2021-05-20T13:30:15Z", "content": null}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Current Covid-19 vaccines appear protective against variants, WHO Europe says - The Straits Times", "description": "Countries across Europe are rolling out vaccines from several drugmakers, including Pfizer and Moderna.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/current-covid-19-vaccines-appear-protective-against-variants-who-europe-says", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/05/20/af_vaccine_2005.jpg?itok=k184mVUx", "publishedAt": "2021-05-20T11:29:23Z", "content": "LONDON (REUTERS) - Covid-19 vaccines currently being deployed in the fight against the pandemic in Europe appear able to protect against all variants that are circulating and causing concern, the Wor… [+1499 chars]"}]}