{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "First case of children's mystery liver disease detected in Asia - BusinessWorld Online", "description": "JAPAN’s health ministry found one probable case of the mysterious severe acute hepatitis affecting children in the US, the UK, and 10 other countries, raising concerns that the disease is spreading outside of Europe and the US.", "url": "https://www.bworldonline.com/health/2022/04/27/444678/first-case-of-childrens-mystery-liver-disease-detected-in-asia/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/04/stethoscope.jpg", "publishedAt": "2022-04-26T16:04:56Z", "content": "JAPANs health ministry found one probable case of the mysterious severe acute hepatitis affecting children in the US, the UK, and 10 other countries, raising concerns that the disease is spreading ou… [+1690 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "P&O ferry European Causeway has power restored after drifting in Irish Sea due to 'mechanical issue' - Sky News", "description": "", "url": "https://news.sky.com/story/three-lifeboats-sent-to-p-o-ferry-with-mechanical-issue-in-the-irish-sea-12599463", "urlToImage": "https://e3.365dm.com/22/03/1600x900/skynews-ferry-pando-ship-union_5719371.jpg?20220325215249", "publishedAt": "2022-04-26T15:56:15Z", "content": "Power has been restored to a P&amp;O ferry after three lifeboats were launched following a \"mechanical issue\" in the Irish Sea.\r\nIt was adrift five miles off Larne in Northern Ireland for more than a… [+2147 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Santander profits boosted by Europe, costs rise in Brazil - Reuters.com", "description": "Santander <a href=\"https://www.reuters.com/companies/SAN.MC\" target=\"_blank\">(SAN.MC)</a> reported a surge in first-quarter profit on Tuesday and reiterated financial targets for 2022, buoyed by higher revenues in Europe though higher costs and lending pressu…", "url": "https://www.reuters.com/business/spains-santander-q1-profit-rises-58-compared-same-period-year-ago-2022-04-26/", "urlToImage": "https://www.reuters.com/resizer/VIYRLS_UsYpJLULwP6cXSNr-hBM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/MWILOHBSYBP35JKGKQGXJTPGW4.jpg", "publishedAt": "2022-04-26T14:44:00Z", "content": "MADRID, April 26 (Reuters) - Santander (SAN.MC) reported a surge in first-quarter profit on Tuesday and reiterated financial targets for 2022, buoyed by higher revenues in Europe though higher costs … [+3121 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Chris Doyle", "title": "Unai Emery spots Liverpool \"difficulties\" as Villarreal boss drops Champions League hint - The Mirror", "description": "It would be a fairytale story for Villarreal if they managed to get the better of Liverpool but they shouldn't be underestimated since they've already disposed of two European powerhouses", "url": "https://www.mirror.co.uk/sport/football/news/liverpool-klopp-unai-emery-villarreal-26803338", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26793614.ece/ALTERNATES/s1200/1_Jurgen-Klopp-speech-after-Unai-Emery-meeting-sparked-belief-in-Liverpool-vision.jpg", "publishedAt": "2022-04-26T14:13:01Z", "content": "Unai Emery reckons Villarreal have lost their element of surprise as the Spanish boss is wary of facing a Liverpool side who are in their \"best moment.\" \r\n The La Liga have made a stunning run to the… [+2454 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "First probable case of children's mystery liver disease detected in Asia - The Star Online", "description": "Japan's Health Ministry found one probable case of the mysterious severe acute hepatitis affecting children in the United States, Britain and 10 other countries, raising concerns that the disease is spreading outside of Europe and the US.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/04/26/first-probable-case-of-children039s-mystery-liver-disease-detected-in-asia", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/04/26/1565234.jpg", "publishedAt": "2022-04-26T11:24:00Z", "content": "TOKYO, April 26 (Bloomberg): Japan's Health Ministry found one probable case of the mysterious severe acute hepatitis affecting children in the United States, Britain and 10 other countries, raising … [+1645 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "Champions League: I can’t see their weaknesses – Coquelin names best team in Europe - Daily Post Nigeria", "description": "Villarreal midfielder, Francis Coquelin has named Liverpool as the best team in Europe. Coquelin admitted that he could not see Liverpool's weaknesses, adding that the Premier League giants have two players who fight for Ballon d'Or. The former Arsenal star s…", "url": "https://dailypost.ng/2022/04/26/champions-league-i-cant-see-their-weaknesses-coquelin-names-best-team-in-europe/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/04/Francis-Coquelin.jpg", "publishedAt": "2022-04-26T07:17:13Z", "content": "Villarreal midfielder, Francis Coquelin has named Liverpool as the best team in Europe.\r\nCoquelin admitted that he could not see Liverpool’s weaknesses, adding that the Premier League giants have two… [+737 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Dr. Kamal Kant Kohli", "title": "Longest known COVID-19 infection - 505 days - describe UK researchers - Medical Dialogues", "description": "The longest known COVID-19 infection is described by UK researchers at this years European Congress ...", "url": "https://medicaldialogues.in/medicine/news/longest-known-covid-19-infection-505-days-describe-uk-researchers-91975", "urlToImage": "https://medicaldialogues.in/h-upload/2022/04/26/175045-covid.jpg", "publishedAt": "2022-04-26T05:00:40Z", "content": "The longest known COVID-19 infection is described by UK researchers at this year's European Congress of Clinical Microbiology &amp; Infectious Diseases (ECCMID) in Lisbon, Portugal, (23-26 April). \r\n… [+4685 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "EU, IOM organise reporting migration competition | The Guardian Nigeria News - Nigeria and World News — Features — The Guardian Nigeria News – Nigeria and World News - Guardian Nigeria", "description": "The European Union and International Organisation for Migration (IOM) Joint Initiative for Migrant Protection and Reintegration is organising a reporting migration competition in West and Central African countries to foster quality...", "url": "https://editor.guardian.ng/features/eu-iom-organise-reporting-migration-competition/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/04/EU22.jpg", "publishedAt": "2022-04-26T04:00:00Z", "content": "The European Union and International Organisation for Migration (IOM) Joint Initiative for Migrant Protection and Reintegration is organising a reporting migration competition in West and Central Afr… [+2648 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "David M. Herszenhorn, Jacopo Barigazzi", "title": "EU celebrates, and frets, over Macron’s victory - POLITICO Europe", "description": "Election result means no Marine Le Pen — but it does mean 5 more years of Emmanuel Macron.", "url": "http://www.politico.eu/article/eu-celebrates-and-frets-over-macrons-victory/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/04/25/GettyImages-1240215384-scaled.jpg", "publishedAt": "2022-04-25T21:03:49Z", "content": "No need for any more conferences: Emmanuel Macron is the future of Europe.\r\nWith his decisive electoral victory over right-wing challenger Marine Le Pen on Sunday, Macron not only clinched five more … [+7880 chars]"}, {"source": {"id": null, "name": "Irish Mirror"}, "author": "John Hand", "title": "Kinahan gang's drug route exposed as cartel 'employs African thugs to threaten EU port workers' - Irish Mirror", "description": "EXCLUSIVE: Senior gardai and Interpol have established that Moroccan thugs work with Daniel Kinahan’s two main intermediaries in Europe", "url": "https://www.irishmirror.ie/news/irish-news/crime/kinahan-gangs-drug-route-exposed-26788585", "urlToImage": "https://i2-prod.irishmirror.ie/sport/article26697044.ece/ALTERNATES/s1200/0_dkPNG.png", "publishedAt": "2022-04-25T06:15:47Z", "content": "The Kinahan cartel is allegedly employing ruthless north African thugs to target dock workers at Europes busiest ports.\r\nIt is claimed they attempt to pay them up to 60,000 to allow drug shipments in… [+4712 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "France's Macron is re-elected but far-right rival raises game - World News - Castanet.net", "description": "French President Emmanuel Macron comfortably won re-election to a second term Sunday, according to polling agencies' projections. The result offered France and the European Union the reassurance of leadership stability in the bloc's only nuclear-armed power a…", "url": "https://www.castanet.net/news/World/366905/France-s-Macron-is-re-elected-but-far-right-rival-raises-game", "urlToImage": "https://www.castanet.net/content/2022/4/par117-1214_2020_130950_p3499392_p3589185.jpg", "publishedAt": "2022-04-24T19:40:00Z", "content": "French President Emmanuel Macron comfortably won re-election to a second term Sunday, according to polling agencies' projections. The result offered France and the European Union the reassurance of l… [+5914 chars]"}]}