{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL's Ukrainian Service", "title": "Kyiv Repels Fresh Drone Strike as Russia Claims It Repulsed Ukraine Attack On Black Sea Vessel - Radio Free Europe / Radio Liberty", "description": "British Prime Minister Rishi Sunak and President Volodymyr Zelenskiy spoke early on July 25 about how to ensure the flow of Ukrainian grain to international markets as the EU announced a 1.5 billion-euro aid disbursement to help Ukraine repair infrastructure …", "url": "https://www.rferl.org/a/ukraine-russia-civilians-cluster-bombs/32517879.html", "urlToImage": "https://gdb.rferl.org/abf14a0f-cca4-49f5-9deb-49fb6b07dd95_w1200_r1.jpg", "publishedAt": "2023-07-25T09:18:26Z", "content": "British Prime Minister Rishi Sunak and Ukrainian President Volodymyr Zelenskiy spoke early on July 25 about how to ensure the flow of Ukrainian grain to international markets as the European Union an… [+6556 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Webb detects water vapour in rocky planet-forming zone - European Space Agency", "description": "New measurements by the NASA/ESA/CSA James Webb Space Telescope’s Mid-InfraRed Instrument (MIRI) has detected water vapour in the inner disc of the system PDS 70, located 370 light-years away. This is the first detection of water in the terrestrial region of …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_detects_water_vapour_in_rocky_planet-forming_zone", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/07/pds_70_artist_concept/25018255-1-eng-GB/PDS_70_artist_concept_pillars.jpg", "publishedAt": "2023-07-24T14:53:53Z", "content": "New measurements by the NASA/ESA/CSA James Webb Space Telescopes Mid-InfraRed Instrument (MIRI) has detected water vapour in the inner disc of the system PDS 70, located 370 light-years away. This is… [+4717 chars]"}]}