{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Ukraine: Russia takes small cities, aims to widen east - CTV News", "description": "As Russia asserted progress in its goal of seizing the entirety of contested eastern Ukraine, President Vladimir Putin tried to shake European resolve Saturday to punish his country with sanctions and to keep supplying weapons that have supported Ukraine's de…", "url": "https://www.ctvnews.ca/world/putin-warns-against-continued-arming-of-ukraine-kremlin-claims-another-city-captured-1.5922549", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/5/28/kharkiv-1-5922562-1653740093253.jpeg", "publishedAt": "2022-05-28T12:17:00Z", "content": "KRAMATORSK, Ukraine - \r\nAs Russia asserted progress in its goal of seizing the entirety of contested eastern Ukraine, President Vladimir Putin tried to shake European resolve Saturday to punish his c… [+8654 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Daniel Orme", "title": "Carlo Ancelotti has already hinted at how easily Liverpool could beat Real Madrid - The Mirror", "description": "Liverpool head to Paris aiming to lift their seventh European Cup at the expense of Real Madrid and judging from Carlo Ancelotti’s previous comments, it could potentially be a straightforward evening for the Reds", "url": "https://www.mirror.co.uk/sport/football/news/carlo-ancelotti-liverpool-real-madrid-27088552", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article27088557.ece/ALTERNATES/s1200/0_Ancelotti.png", "publishedAt": "2022-05-28T08:33:58Z", "content": "Real Madrid boss Carlo Ancelotti has already dropped a huge hint to Liverpool over how the Reds could beat them in the Champions League final. \r\n The two sides come together in the French capital Par… [+2567 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Garry Doyle", "title": "As it happened: Leinster versus La Rochelle, Heineken Champions Cup final - The42", "description": "We are following the action from Marseille as Leinster try to win a fifth European Cup.", "url": "https://www.the42.ie/champions-cup-final-2-5776757-May2022/", "urlToImage": "https://img2.thejournal.ie/article/5776757/river/?height=400&version=5776880", "publishedAt": "2022-05-28T06:21:00Z", "content": "4:34PMHere are the teams for today’s big game.\r\nLEINSTER: Hugo Keenan; Jimmy O’Brien, Garry Ringrose, Robbie Henshaw, James Lowe; Johnny Sexton (captain), Jamison Gibson-Park; Andrew Porter, Ronan Ke… [+630 chars]"}]}