{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Pna.gov.ph"}, "author": null, "title": "4 envoys vow to boost diplomatic, trade ties with PH under BBM - pna.gov.ph", "description": "MANILA &ndash; President-elect Ferdinand \"Bongbong\" Marcos Jr. on Monday received ambassadors from Singapore, United Kingdom, France, and European Union during separate courtesy calls at BBM headquarters in Mandaluyong City.First to visit Marcos was Gerard Ho…", "url": "https://www.pna.gov.ph/articles/1175395", "urlToImage": "https://files01.pna.gov.ph/ograph/2022/05/30/bbm-singapore-envoy.jpg", "publishedAt": "2022-05-30T05:48:27Z", "content": "STRONGER TIES. Ambassador of Singapore H.E. Gerard Ho pays courtesy call to Philippine President-Elect Bongbong Marcos at BBM headquarters in Mandaluyong City on Monday (May 30, 2022). Ho and three o… [+4026 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Andrew E. Kramer, Jason Horowitz", "title": "Latest Russia and Ukraine News - The New York Times", "description": "As his military announced a counteroffensive around the southern port city of Kherson, President Volodymyr Zelensky made a rare visit to frontline positions. European leaders are gathering in Brussels on Monday for a two-day summit on Ukraine.", "url": "https://www.nytimes.com/live/2022/05/29/world/russia-ukraine-war", "urlToImage": "https://static01.nyt.com/images/2022/05/29/world/29UKRAINE-BLOG-HEADER-9pm/29UKRAINE-BLOG-HEADER-9pm-facebookJumbo.jpg", "publishedAt": "2022-05-30T01:39:00Z", "content": "KRAMATORSK, Ukraine Ukrainian soldiers, seeking to spread Russian forces thin, launched a counteroffensive on Sunday in Kherson, the key southern city that Moscow considered so securely under its thu… [+7762 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "AFP", "title": "Leinster's Josh van der Flier wins European rugby player of the year award - The42", "description": "The Ireland back-row forward follows in the footsteps of Sean O’Brien (2011) and Rob Kearney (2012).", "url": "https://www.the42.ie/leinsters-josh-van-der-flier-wins-european-rugby-player-of-the-year-award-5777164-May2022/", "urlToImage": "https://img2.thejournal.ie/article/5777164/river/?height=400&version=5777167", "publishedAt": "2022-05-28T22:37:00Z", "content": "LEINSTERS JOSH van der Flier was announced as rugby unions European player of the year on Saturday, just moments after the Irish province had been beaten in a thrilling Champions Cup final by La Roch… [+921 chars]"}]}