{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "TheJournal.ie"}, "author": "Christina Finn & Ian Curran", "title": "Ireland follows Europe's lead as package aimed at surging household costs to be unveiled today - thejournal.ie", "description": "Tánaiste Leo Varadkar said the cost of living is now the ‘burning issue’ for most people.", "url": "https://www.thejournal.ie/cost-of-living-package-5678324-Feb2022/", "urlToImage": "https://img2.thejournal.ie/article/5678324/river/?height=400&version=5678383", "publishedAt": "2022-02-10T00:05:00Z", "content": "THE COST OF living package due to be announced today will have targeted supports as well as a universal benefit for all households, according to Tánaiste Leo Varadkar.\r\nSpeaking at an event in Trinit… [+7701 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "‘Neanderthal Pompeii’: dig places humans in Europe earlier than thought - The Guardian", "description": "Researchers find Homo sapiens moved into Madrin cave in France one year after Neanderthals abandoned it", "url": "https://amp.theguardian.com/science/2022/feb/09/neanderthal-pompeii-dig-places-humans-in-europe-earlier-than-thought", "urlToImage": null, "publishedAt": "2022-02-09T21:09:00Z", "content": "ArchaeologyResearchers find Homo sapiens moved into Madrin cave in France one year after Neanderthals abandoned it\r\nHomo sapiens ventured into Neanderthal territory in Europe much earlier than previo… [+4334 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Frank Jordans", "title": "French cave tells new story about Neanderthals, early humans - Phys.org", "description": "A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thought to have reached that part of Europe, a new study suggests.", "url": "https://phys.org/news/2022-02-french-cave-story-neanderthals-early.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/french-cave-tells-new.jpg", "publishedAt": "2022-02-09T19:18:45Z", "content": "A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thoug… [+6902 chars]"}]}