{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "NICHOLAS RICCARDI", "title": "What the far-right victories in the European Union could say about US elections this year - The Associated Press", "description": "The far right racked up wins across much of Europe in the EU Parliamentary elections that just concluded. Former President Donald Trump is trying to ride the same populist wave to return to the White House in November. But while the movements are propelled by…", "url": "https://apnews.com/article/european-union-far-right-trump-us-elections-7356075127d7889cb670cfa25367ecdc", "urlToImage": "https://dims.apnews.com/dims4/default/4994a5e/2147483647/strip/true/crop/5000x2813+0+260/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fef%2F50%2Fd4f699f1109bfdbeb2c29698fa63%2Fc5da2340273740199824162cb64271df", "publishedAt": "2024-06-11T20:25:00Z", "content": "The just-concluded European Union elections were yet another milestone for far-right parties on the continent. They racked up gains across many of the EUs 27 countries, and the surprising scale of th… [+8117 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dengue, Mosquito-Borne Diseases Rising In Europe Due To Climate Change - NDTV", "description": "Cases of dengue and other mosquito-borne diseases are rising significantly in Europe as climate change creates warmer conditions that help invasive mosquitos spread, the EU's health agency warned on Tuesday.", "url": "https://www.ndtv.com/world-news/dengue-mosquito-borne-diseases-rising-in-europe-due-to-climate-change-5869806", "urlToImage": "https://c.ndtvimg.com/2023-11/0nqt9qb_dengue_625x300_22_November_23.jpg", "publishedAt": "2024-06-11T18:40:13Z", "content": "The mosquito responsible for spreading the West Nile virus is native to Europe (Representational)\r\nCases of dengue and other mosquito-borne diseases are rising significantly in Europe as climate chan… [+2659 chars]"}]}