{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Football.London"}, "author": "George Smith, Bobby Vincent", "title": "Graeme Souness makes James Maddison and Mason Mount claim after Chelsea's win over Leicester - Football.London", "description": "Chelsea midfielder Mason Mount has played a key role in the Blues' success over the last few months, and Graeme Souness has high hopes for him ahead of this summer's European Championships", "url": "https://www.football.london/chelsea-fc/players/mason-mount-england-southgate-souness-20629392", "urlToImage": "https://i2-prod.football.london/chelsea-fc/article20361928.ece/ALTERNATES/s1200/0_sounessJPG.jpg", "publishedAt": "2021-05-19T10:00:00Z", "content": "Sky Sports pundit Graeme Souness heaped praise on the shoulders of Chelsea star Mason Mount ahead of last night's 2-1 victory over Leicester City at Stamford Bridge, insisting \"he should be one of th… [+3190 chars]"}, {"source": {"id": null, "name": "Irish Examiner"}, "author": "Ann O'Loughlin", "title": "Court case on 'vulgar' Instagram account about Limerick school referred to Europe - Irish Examiner", "description": "", "url": "https://www.irishexaminer.com/news/courtandcrime/arid-40292885.html", "urlToImage": "https://www.irishexaminer.com/cms_media/module_img/4933/2466629_2_googlediscover_InstagramAppMAy2020_1_.jpg", "publishedAt": "2021-05-19T08:51:00Z", "content": "A legal dispute over efforts by a school to find out who is behind a closed-down Instagram account that made \"coarse and vulgar\" remarks about certain staff and students is to be referred to the Euro… [+4485 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "How a change in the Pfizer's storage temperature could completely change vaccine access - CBC.ca", "description": "The Pfizer vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, a move that could have major implications on the rollout of vaccines across Canada and the world.", "url": "https://www.cbc.ca/news/health/pfizer-vaccine-canada-storage-temperature-1.6031823", "urlToImage": "https://i.cbc.ca/1.6014567.1621384276!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-ont-vaccine-20210107.jpg", "publishedAt": "2021-05-19T08:00:00Z", "content": "The Pfizer-BioNTech COVID-19 vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, which could have major implications on the rollout of v… [+6590 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Buhari seeks debt relief for African countries - Punch Newspapers", "description": "Buhari (retd.), on Tuesday in Paris, France, called on European countries and global financial institutions to consider debt relief for", "url": "https://punchng.com/buhari-seeks-debt-relief-for-african-countries/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/05/14062848/Muhammadu-Buhari.jpg", "publishedAt": "2021-05-19T06:27:11Z", "content": "Published19 May 2021\r\nThe President, Major General Muhammadu Buhari (retd.), on Tuesday in Paris, France, called on European countries and global financial institutions to consider debt relief for Af… [+2307 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Gerry Thornley", "title": "Leinster win fills O’Gara with belief La Rochelle can claim first European title - The Irish Times", "description": "Coach hopeful his underdogs can rise to the challenge again in final against Toulouse", "url": "https://www.irishtimes.com/sport/rugby/european-cup/leinster-win-fills-o-gara-with-belief-la-rochelle-can-claim-first-european-title-1.4568656", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4568655&origw=1440", "publishedAt": "2021-05-19T05:00:33Z", "content": "Its rare for a club to win the Heineken Champions Cup without having cut their teeth and suffered a little pain along the way. Pedigree also counts, almost inordinately so.\r\nIn September Exeter becam… [+5176 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Renata Brito and Aritz Parra", "title": "Spain, Morocco square off after 7000 migrants arrive by sea - CTV News", "description": "Spain deployed its military to the Moroccan border Tuesday and expelled nearly half of the thousands of migrants who jumped fences or swam onto European soil over two days after Rabat loosened border controls amid a deepening diplomatic spat.", "url": "https://www.ctvnews.ca/world/spain-morocco-square-off-after-7-000-migrants-arrive-by-sea-1.5432834", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5432843.1621354327!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-05-18T18:04:00Z", "content": "CEUTA, SPAIN -- \r\nSpain deployed its military to the Moroccan border Tuesday and expelled nearly half of the thousands of migrants who jumped fences or swam onto European soil over two days after Rab… [+7409 chars]"}]}