{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Kane tells Spurs he wants to leave club before Euros - Sky Sports - The Star Online", "description": "(Reuters) -     Tottenham Hotspur striker Harry Kane has informed the Premier League club of his desire to leave this summer, with the England international looking to resolve his future before next month's European Championship, Sky Sports reported on Monday.", "url": "https://www.thestar.com.my/sport/football/2021/05/18/soccer-kane-tells-spurs-he-wants-to-leave-club-before-euros---sky-sports", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/05/18/1151961.JPG", "publishedAt": "2021-05-17T19:11:00Z", "content": "(Reuters) - Tottenham Hotspur striker Harry Kane has informed the Premier League club of his desire to leave this summer, with the England international looking to resolve his future before next mont… [+1514 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "EU drugs regulator says Pfizer Covid-19 vaccine can be stored in fridge for up to a month - RT", "description": "The European Medicines Agency (EMA) has said the Covid-19 vaccine developed by US drug maker Pfizer and German firm BioNTech can be stored in the fridge for up to a month, significantly extending the jab's lifespan in EU nations.", "url": "https://www.rt.com/news/524072-ema-extends-pfizer-vaccine-fridge-life/", "urlToImage": "https://cdni.rt.com/files/2021.05/article/60a2ad0a85f54066a701eb95.JPG", "publishedAt": "2021-05-17T18:03:00Z", "content": "On Monday the regulator said its decision, which follows advice from its human medicines committee, will better “facilitate the handling of the vaccine.”\r\nUnopened thawed Pfizer vials can now be kept… [+1046 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "`Rich countries can donate more jabs’ – The Manila Times - The Manila Times", "description": "Countries belonging to the G7 and the European Union can afford to donate more than 150 million vaccines to countries in need without compromising their own goals, United Nations Children’s Emergency Fund (Unicef) said Monday. The world’s seven richest states…", "url": "https://www.manilatimes.net/2021/05/18/news/national/rich-countries-can-donate-more-jabs/873673/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/02/TMTFB_1920x1008.jpg", "publishedAt": "2021-05-17T16:02:44Z", "content": "Countries belonging to the G7 and the European Union can afford to donate more than 150 million vaccines to countries in need without compromising their own goals, United Nations Childrens Emergency … [+2444 chars]"}]}