{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Nationwide Paid Holiday Comes Into Effect To Curb Covid - NDTV", "description": "New coronavirus restrictions came into effect across Russia on Saturday with authorities looking to stem soaring infections and deaths in Europe's worst hit country by fatalities.", "url": "https://www.ndtv.com/world-news/russias-nationwide-paid-holiday-comes-into-effect-to-curb-covid-2593521", "urlToImage": "https://c.ndtvimg.com/2021-10/31m7nj9g_russia-covid_625x300_27_October_21.jpg", "publishedAt": "2021-10-30T10:32:36Z", "content": "Just 32.5% of Russia's population have been fully vaccinated (File)\r\nMoscow: New coronavirus restrictions came into effect across Russia on Saturday with authorities looking to stem soaring infection… [+1641 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Satvik Khare", "title": "OnePlus 7 Pro, OnePlus 7 Getting OxygenOS 11.0.4.1 Update With Call Interface Fix, Latest Security Patch - Gadgets 360", "description": "OnePlus 7 Pro and OnePlus 7 are getting OxygenOS 11.0.4.1 update that is bundled with the October 2021 Android security patch. Alongside, the update also gets a couple of bug fixes and improvements. OnePlus 7 series users in the global market and Europe will …", "url": "https://gadgets.ndtv.com/mobiles/news/oneplus-7-pro-oxygenos-11-0-4-1-update-october-2021-android-security-patch-changelog-2593427", "urlToImage": "https://i.gadgets360cdn.com/large/oneplus_7_oneplus_7_pro_1574422099207.jpg", "publishedAt": "2021-10-30T09:05:12Z", "content": "OnePlus 7 Pro and the OnePlus 7 are getting an update that brings the October 2021 Android security patch to the flagship smartphone series from 2019. Alongside, the update is also bundled with a cou… [+1808 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "FACTBOX-Latest on the worldwide spread of the coronavirus - Devdiscourse", "description": "* The European Union will produce more than 3.5 billion doses of COVID-19 vaccines next year, the head of the bloc's executive said.  * The Russian capital brought in its strictest lockdown measures in more than a year as nationwide one-day pandemic deaths an…", "url": "https://www.devdiscourse.com/article/health/1786433-factbox-latest-on-the-worldwide-spread-of-the-coronavirus", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/26_10_2021_06_20_23_0075619.jpg?width=920&format=jpeg", "publishedAt": "2021-10-28T20:50:06Z", "content": "The World Health Organization and other aid groups appealed to leaders of the world's 20 biggest economies to fund a $23.4 billion plan to bring COVID-19 vaccines, tests and drugs to poorer countries… [+3080 chars]"}]}