{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "ECG can pinpoint hospitalized COVID-19 patients at high risk of mortality - News-Medical.Net", "description": "A simple electrocardiogram (ECG) can pinpoint hospitalized COVID-19 patients at high risk of death who might need intensive management. That's the finding of a study presented at EHRA 2022, a scientific congress of the European Society of Cardiology.", "url": "https://www.news-medical.net/news/20220404/ECG-can-pinpoint-hospitalized-COVID-19-patients-at-high-risk-of-mortality.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Intensive_Care-620x480.jpg", "publishedAt": "2022-04-05T00:12:00Z", "content": "A simple electrocardiogram (ECG) can pinpoint hospitalized COVID-19 patients at high risk of death who might need intensive management. That's the finding of a study presented at EHRA 2022, a scienti… [+3788 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Civilian killings at Bucha raise outcry as Russian attacks shift east - Reuters", "description": "The United States and European countries pledged on Monday to punish Moscow over civilian killings in northern Ukraine, where a mass grave and tied bodies of people shot at close range were found in a town seized back from Russian forces.", "url": "https://www.reuters.com/world/europe/ukraine-accuses-russia-war-crimes-after-bodies-found-bound-shot-2022-04-04/", "urlToImage": "https://www.reuters.com/resizer/VQzACz522L4FIaZCoDnfu-yhCCo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NQSQVOMURVNO5I5LLO4I3CNWJU.jpg", "publishedAt": "2022-04-04T16:42:00Z", "content": "BUCHA, Ukraine, April 4 (Reuters) - The United States and European countries pledged on Monday to punish Moscow over civilian killings in northern Ukraine, where a mass grave and tied bodies of peopl… [+7155 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Keertan Ayamany", "title": "EU recognises MySejahtera as equal to its Digital Covid Certificate - Malay Mail", "description": "KUALA LUMPUR, April 4 — The European Union (EU) has accepted Malaysia’s request to recognise MySejahtera’s certification as being equal to EU’s Digital Covid Certificate, effective today. EU’s ambassador to Malaysia Michalis Rokas announced the matter in a Tw…", "url": "https://www.malaymail.com/news/malaysia/2022/04/04/eu-recognises-mysejahtera-as-equal-to-its-digital-covid-certificate/2051504", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2020/2020-06/FW1046012_KL32_06052020_MY_SEJAHTERA-lpr-seo.jpg", "publishedAt": "2022-04-04T09:02:40Z", "content": "A woman holds up a phone displaying the MySejahtera app in Kuala Lumpur May 6, 2020. Bernama pic\r\nKUALA LUMPUR, April 4 The European Union (EU) has accepted Malaysias request to recognise MySejahtera… [+1474 chars]"}]}