{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "engadget", "name": "Engadget"}, "author": "https://www.engadget.com/about/editors/steve-dent", "title": "Tesla drastically lowers EV pricing in the US and Europe - Engadget", "description": "After steadily increasing prices over the past couple of years, Tesla has cut them massively across its lineup in the US and Europe..", "url": "https://www.engadget.com/tesla-implements-huge-us-price-cuts-across-its-lineup-083211088.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2022-06/8bb55db0-ed48-11ec-b3fb-ba5734d864fa", "publishedAt": "2023-01-13T08:33:04Z", "content": "After steadily increasing prices over the past couple of years, Tesla has cut them drastically across its lineup in the US and Europe, in an apparent bid to boost sales. The least expensive EV, the M… [+1952 chars]"}, {"source": {"id": null, "name": "Driveteslacanada.ca"}, "author": null, "title": "Tesla cuts Model 3/Y prices across Europe - Drive Tesla Canada", "description": "North America wasn’t the only region which saw price reductions as many countries across Europe have also been impacted by the changes. Although unlike in Canada and the US the price reductions so far appear [...]", "url": "https://driveteslacanada.ca/news/tesla-cuts-model-3-y-prices-across-europe/", "urlToImage": "https://driveteslacanada.ca/wp-content/uploads/2021/10/Tesla-Surrey-Langley-e1633453881982.png", "publishedAt": "2023-01-13T06:37:43Z", "content": "Credit: Ben Apilot\r\nNorth America wasnt the only region which saw price reductions as many countries across Europe have also been impacted by the changes. Although unlike in Canada and the US the pri… [+1875 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": "KN Pandita", "title": "Awakening The Sleeping Giant, Chinese Belligerence Prompts Japan To Move Away From Post-War Pacifist Constitution - EurAsian Times", "description": "Of all the Axis powers of World War II, it was Japan that the US chose to be targeted as the first victim of the atomic bomb. Historians believe the US wanted a maiden target for its atomic bomb as far away from the European continent as possible. Yet some fi…", "url": "https://eurasiantimes.com/awakening-the-sleeping-giant-chinese-belligerence-prompts-japan/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2023/01/Fumio-Kishida-1.jpg", "publishedAt": "2023-01-13T05:47:23Z", "content": "Of all the Axis powers of World War II, it was Japan that the US chose to be targeted as the first victim of the atomic bomb. \r\nHistorians believe the US wanted a maiden target for its atomic bomb as… [+6580 chars]"}]}