{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Agence France-Presse", "title": "Afghans face ‘impossible’ race against time to flee Kabul - INQUIRER.net", "description": "KABUL -- Tens of thousands of Afghans were racing Sunday to flee their country as the United States warned of security threats at Kabul&#039;s chaotic airport and the European Union said it was", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/08/afghans-evacuation-620x413.jpg", "publishedAt": "2021-08-22T06:07:00Z", "content": "Afghans gather on a roadside near the military part of the airport in Kabul on August 20, 2021, hoping to flee from the country after the Taliban’s military takeover of Afghanistan. AFP\r\nKABUL — Tens… [+4454 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Shishir Gupta", "title": "Under Taliban, Afghanistan is the address of global jihad - Hindustan Times", "description": "India due to its geographical location, regional adversaries, democratic polity and culture will face increased radicalisation and will be the prime target of terror along with the US, Europe and Australia. | World News", "url": "https://www.hindustantimes.com/world-news/under-taliban-afghanistan-is-the-address-of-global-jihad-101629601393384.html", "urlToImage": "https://images.hindustantimes.com/img/2021/08/22/1600x900/Taliban_Afghanistan_1629605774088_1629605787068.jpg", "publishedAt": "2021-08-22T04:17:36Z", "content": "US President Joe Biden has played politics with terror when he claimed mission accomplished in his August 20 speech after taking credit for the decimation of al Qaeda in Afghanistan and 2011 neutrali… [+3557 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Shaw", "title": "Greece extends border wall amid European fears of Afghan migrant wave - Fox News", "description": "Greece announced on Friday that it has extended its border wall with Turkey as part of its efforts to stop migrants coming up from Afghanistan -- amid European fears of an Afghan migrant wave sparked by the Taliban takeover.", "url": "https://www.foxnews.com/world/greece-extends-border-wall-european-fears-afghan-migrant-wave", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21232595558464.jpg", "publishedAt": "2021-08-21T20:15:56Z", "content": "Greece announced on Friday that it has extended its border wall with Turkey as part of its efforts to stop migrants coming up from Afghanistan -- amid European fears of an Afghan migrant wave sparked… [+2957 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "MAGDALENE FUNG", "title": "Singapore's Covid-19 travel lane with Germany: Should you go? - The Straits Times", "description": "ST assesses pandemic life in the European powerhouse to help you decide.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/singapores-covid-19-travel-lane-with-germany-should-you-go", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/08/21/yq-germanytourism-21082021.jpg?itok=YmIxLuIs", "publishedAt": "2021-08-21T10:30:00Z", "content": "SINGAPORE - Singapore's plan to pilot leisure travel for those vaccinated against Covid-19 - starting with Germany - has given cheer to travel-starved residents who have been kept at home by the coro… [+11598 chars]"}]}