{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "Outgunning NASA’s Hubble, China Claims Its Xuntian Telescope With 350-Fold Bigger View Can Unravel ‘Cosmic Mysteries’ - EurAsian Times", "description": "China is ramping up its efforts to explore the universe as it is set to launch its space telescope ‘Xuntian’ next year. Known as China’s own ‘Hubble,’ authorities in Beijing claim it outmatches the NASA and European Space Agency (ESA) telescope’s capabilities…", "url": "https://eurasiantimes.com/china-claims-its-xuntian-telescope-with-350-fold-bigger/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/05/China-Telescope-e1651981266451.jpg", "publishedAt": "2022-05-08T03:45:39Z", "content": "China is ramping up its efforts to explore the universe as it is set to launch its space telescope Xuntian next year. Known as Chinas own Hubble, authorities in Beijing claim it outmatches the NASA a… [+7503 chars]"}, {"source": {"id": null, "name": "Sky Sports"}, "author": "Sky Sports", "title": "Munster 24-24 Toulouse (AET): Defending champions win dramatic European Cup quarter-final on penalty shootout - Sky Sports", "description": "Defending European champions Toulouse progressed to the semi-finals in dramatic fashion with a penalty shoot-out victory over Munster.", "url": "https://www.skysports.com/rugby-union/news/33694/12607866/munster-24-24-toulouse-aet-defending-champions-win-dramatic-european-cup-quarter-final-on-penalty-shootout", "urlToImage": "https://e2.365dm.com/22/05/1600x900/skysports-munster-toulouse_5763996.jpg", "publishedAt": "2022-05-07T17:40:31Z", "content": "Defending European champions Toulouse progressed to the semi-finals in dramatic fashion as they registered a penalty shooutout victory over Munster in Dublin, after the match had finished 24-24.\r\nPla… [+7606 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL", "title": "Chelsea Soccer Club Sold To U.S.-Led Investors, Ending Ownership By Russian Oligarch Abramovich - Radio Free Europe / Radio Liberty", "description": "The British soccer club Chelsea will be sold to a group of investors led by an American billionaire, formally ending nearly two decades of ownership by Kremlin-connected oligarch Roman Abramovich.", "url": "https://www.rferl.org/a/chelsea-sold-abramovich-us-investors/31838620.html", "urlToImage": "https://gdb.rferl.org/C6C0A3BF-1379-4EDA-878F-A9E4DAC5749B_w1200_r1.jpg", "publishedAt": "2022-05-07T08:03:41Z", "content": "Ukrainian officials have declared that all women, children, and elderly have been evacuated from the Mariupol steel plant, which has been besieged for weeks by Russian forces amid the ruins of the po… [+7046 chars]"}]}