{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "FX Empire"}, "author": null, "title": "Explainer-Scientists investigate hepatitis outbreak in children in Europe, US - FX Empire", "description": "By Jennifer Rigby and Natalie Grover LONDON (Reuters) -   Health authorities around the world are investigating a mysterious increase in severe cases of hepatitis - inflammation of the liver – in young children.", "url": "https://www.fxempire.com/news/article/explainer-scientists-investigate-hepatitis-outbreak-in-children-in-europe-us-976178", "urlToImage": "https://responsive.fxempire.com/width/600/webp-lossy-70.q50/_fxempire_/2022/04/tagreuters.com2022newsml_LYNXNPEI3L0B41.jpg", "publishedAt": "2022-04-22T09:38:00Z", "content": "Below is a summary of what is known about the outbreak. \r\nWHATS HAPPENED?\r\nMore than 130 cases have been identified, with the majority in Britain, which has reported 108 cases since January.\r\nOther c… [+3538 chars]"}, {"source": {"id": null, "name": "Search Engine Land"}, "author": "https://www.facebook.com/MrDannyGoodwin", "title": "Google unveils a simpler way for European users to reject cookies - Search Engine Land", "description": "After being fined by France, Google unveils Reject All or Accept All buttons for Google search and YouTube visitors.", "url": "https://searchengineland.com/google-cookie-consent-europe-383765", "urlToImage": "https://searchengineland.com/wp-content/seloads/2022/04/google-cookies.png", "publishedAt": "2022-04-22T07:00:00Z", "content": "Google is making it easier to reject all cookies on search and YouTube in Europe. These changes will begin in France before expanding to the European Economic Area, the UK and Switzerland. \r\nVisitors… [+1185 chars]"}, {"source": {"id": null, "name": "The European Scientist"}, "author": "Alex Reis", "title": "Less use of mobile phones for better health - The European Scientist", "description": "We may all use our mobile phones too much, but the good news is that we don't have to give them up altogether to be healthier, according to a study published in the Journal of Experimental Psychology.", "url": "https://www.europeanscientist.com/en/public-health/less-use-of-mobile-phones-for-better-health/", "urlToImage": "https://www.europeanscientist.com/wp-content/uploads/2022/04/715C6781-36DE-4DCF-B832-007DCAA01B71.jpeg", "publishedAt": "2022-04-21T14:39:26Z", "content": "We may all use our mobile phones too much, but the good news is that we don’t have to give them up altogether to be healthier, according to a study published in the Journal of Experimental Psychology… [+2441 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Micronovae: A New Kind of Thermonuclear Stellar Explosion - SciTechDaily", "description": "A team of astronomers, with the help of the European Southern Observatory’s Very Large Telescope (ESO’s VLT), have observed a new type of stellar explosion — a micronova. These outbursts happen on the surface of certain stars, and can each burn through around…", "url": "https://scitechdaily.com/astronomers-discover-micronovae-a-new-kind-of-thermonuclear-stellar-explosion/", "urlToImage": "https://scitechdaily.com/images/Micronova.gif", "publishedAt": "2022-04-21T09:27:07Z", "content": "A team of astronomers, with the help of the European Southern Observatorys Very Large Telescope (ESOs VLT), have observed a new type of stellar explosion a micronova. These outbursts happen on the su… [+8541 chars]"}]}