{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "John Leicester", "title": "2022 French election: Polling agencies project reelection for Macron - The Associated Press", "description": "PARIS (AP) — French President Emmanuel Macron comfortably won a second term Sunday, triggering relief among allies that the nuclear-armed power won't abruptly shift course in the midst of the war in Ukraine from European Union and NATO efforts to punish and c…", "url": "https://apnews.com/f5b549e3b99930ee05bed17a9d3870b6", "urlToImage": "https://storage.googleapis.com/afs-prod/media/921a53f314964fc1857c32f5f599c489/3000.jpeg", "publishedAt": "2022-04-25T03:57:44Z", "content": "PARIS (AP) French President Emmanuel Macron comfortably won a second term Sunday, triggering relief among allies that the nuclear-armed power wont abruptly shift course in the midst of the war in Ukr… [+5296 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "US study suggests COVID-19 pandemic may be accelerating antimicrobial resistance - EurekAlert", "description": "**Note: this is a press release from the European Congress of Clinical Microbiology & Infectious Diseases (ECCMID 2022, Lisbon, 23-26 April). Please credit the congress if you use this story**\n\nAmong those hospitalised during the pandemic, both COVID-19 patie…", "url": "https://www.eurekalert.org/news-releases/950576", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-04-25T00:31:45Z", "content": "Among those hospitalised during the pandemic, both COVID-19 patients and those tested for SARS-COV-2 but negative, had higher rates of antibiotic-resistant bacterial infections compared to patients h… [+5640 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Lara Marlowe", "title": "Mood one of relief as much as joy for Macron supporters after election win - The Irish Times", "description": "Re-election of French president Emmanuel Macron hailed by European leaders", "url": "https://www.irishtimes.com/news/world/europe/mood-one-of-relief-as-much-as-joy-for-macron-supporters-after-election-win-1.4860867", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4860865&origw=1440", "publishedAt": "2022-04-24T22:38:36Z", "content": "There were as many blue and yellow European flags as French tricolours at President Emmanuel Macrons victory celebration beneath the Eiffel Tower on Sunday night. \r\nThe re-elected president and his w… [+3279 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "WATCH: 2023 BMW M2 takes to the Nürburgring along with M4 CSL - Carmag South Africa", "description": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to the Nürburgring after the 2023 BMW M2 was spotted along with …", "url": "https://www.carmag.co.za/news/new-models/watch-2023-bmw-m2-m4-csl/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/04/BMW-1-5.jpg", "publishedAt": "2022-04-24T10:00:06Z", "content": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to t… [+1877 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "siteadmin", "title": "Russian President, Putin, To Meet United Nations Secretary-General Over Ukraine Invasion - SaharaReporters.com", "description": "Thousands had been killed and more than 12 million people displaced in Europe’s worst refugee crisis since World War II.", "url": "https://saharareporters.com/2022/04/23/russian-president-putin-meet-united-nations-secretary-general-over-ukraine-invasion", "urlToImage": null, "publishedAt": "2022-04-23T13:18:21Z", "content": "Russian President, Vladimir Putin, would hold talks with the United Nations Secretary-General, Antonio Guterres, in Russia, on Tuesday, AFP reports.\r\nThe Kremlin made the announcement on Friday, the … [+1420 chars]"}]}