{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Li Cohen", "title": "See what the rare \"super flower blood moon\" total lunar eclipse looked like around the world - CBS News", "description": "Millions in the Americas, Europe and Africa were able to see the spectacular red glow of the total lunar eclipse.", "url": "https://www.cbsnews.com/news/super-flower-blood-moon-total-lunar-eclipse-pictures/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/05/16/81658f7b-016e-4e40-bee5-5b01da56add2/thumbnail/1200x630/d74aee6043d7bbb27d6738d1dd419655/ap22136240524309.jpg", "publishedAt": "2022-05-16T13:57:00Z", "content": "Millions of people across the Americas, Europe and Africa on Sunday were able to see the reddish glow of a rare and spectacular show in the sky — a lunar eclipse known as a \"super flower blood moon.\"… [+2312 chars]"}, {"source": {"id": null, "name": "Evening Standard"}, "author": "David Bond", "title": "Don’t risk a trade war with Europe, top Tories tell Boris - Evening Standard", "description": "Boris Johnson greeted by protesters as he arrives in Belfast for crunch talks on resolving the stalemate at Stormont", "url": "https://www.standard.co.uk/news/politics/trade-war-northern-ireland-protocol-brexit-europe-tories-boris-johnson-b1000247.html", "urlToImage": "https://static.standard.co.uk/2022/05/16/12/newFile-1.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2022-05-16T13:45:53Z", "content": "Boris Johnson was warned on Monday not to risk a Brexit trade war with the European Union when millions of households are facing a growing cost of living crisis.\r\nThree senior Tory MPs lined up to de… [+6599 chars]"}, {"source": {"id": null, "name": "Euro Weekly News"}, "author": null, "title": "Parents in Europe warned as mystery hepatitis outbreak claims 12 children - Euro Weekly News", "description": "Mystery hepatitis outbreak has now claimed 12 children worldwide", "url": "https://euroweeklynews.com/2022/05/16/parents-in-europe-warned-as-mystery-hepatitis-outbreak-claims-12-children/", "urlToImage": "https://euroweeklynews.com/wp-content/uploads/2022/05/doctor-in-laboratory.jpg", "publishedAt": "2022-05-16T13:37:01Z", "content": "Image of a scientist in a laboratory.\r\nCredit: Pexels - Artem Podrez Health officials in Europe have reported today, Monday, May 16, that the death toll across the globe from the mystery hepatitis ou… [+2888 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Oleksandr Stashevskyi And Ciaran Mcquillan", "title": "Ukraine troops reach Russian border east of Kharkiv in symbolic win - CP24 Toronto's Breaking News", "description": "Europe pushed to toughen its response Monday to Moscow's invasion of Ukraine, with Sweden joining Finland in deciding to seek NATO membership and European Union officials working to rescue proposed sanctions on Russian oil.", "url": "https://www.cp24.com/world/in-ukraine-and-internationally-scenario-darkens-for-russia-1.5904773", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5904781.1652701550!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-05-16T11:48:00Z", "content": "KYIV, Ukraine (AP) -- Europe pushed to toughen its response Monday to Moscow's invasion of Ukraine, with Sweden joining Finland in deciding to seek NATO membership and European Union officials workin… [+4070 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Your plans to join NATO grave mistake – Russia warns Finland, Sweden - Daily Post Nigeria", "description": "Russia has reacted angrily to the plans by Finland and Sweden to join the North Atlantic Treaty Organization (NATO). The intergovernmental military alliance already has 30 member states - 28 in Europe, the United States, and Canada. On Monday, Moscow warned t…", "url": "https://dailypost.ng/2022/05/16/your-plans-to-join-nato-grave-mistake-russia-warns-finland-sweden/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/Sergei-Ryabkov.jpg", "publishedAt": "2022-05-16T10:56:52Z", "content": "Russia has reacted angrily to the plans by Finland and Sweden to join the North Atlantic Treaty Organization (NATO).\r\nThe intergovernmental military alliance already has 30 member states – 28 in Euro… [+637 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Rise of acute hepatitis among kids: Find out what is causing it, symptoms to note and all about the role of vaccines - Times of India", "description": "According to the European Centre for Disease Prevention and Control (ECDPC), nearly 450 children have been affected by mysterious acute hepatitis worldwide.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/rise-of-acute-hepatitis-among-kids-find-out-what-is-causing-it-symptoms-to-note-and-all-about-the-role-of-vaccines/photostory/91595316.cms", "urlToImage": "https://static.toiimg.com/photo/91595324.cms", "publishedAt": "2022-05-16T10:30:00Z", "content": "Besides the adenovirus 41, scientists continue to investigate COVID-19 as a potential underlying cause of the rise in recent cases of acute hepatitis in children.\r\nAn Indian study conducted by a team… [+1779 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Murray Kinsella", "title": "Peerless Sexton drives Leinster's relentless pursuit of fifth European star - The42", "description": "The 36-year-old was superb once again as Leinster set up a Champions Cup final against La Rochelle.", "url": "https://www.the42.ie/johnny-sexton-leinster-3-5764833-May2022/", "urlToImage": "https://img2.thejournal.ie/article/5764833/river/?height=400&version=5765058", "publishedAt": "2022-05-16T05:00:00Z", "content": "WHEN THE TOPIC of Tadhg Furlongs passing came up, Johnny Sexton couldnt resist a joke.\r\nLike everyone else, Leinsters captain will be hoping that tighthead prop Furlongs ankle issue doesnt prove to b… [+4702 chars]"}]}