{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Niamh Kennedy, Christian Edwards, Xiaofei Xu", "title": "Macron gambles on snap election after crushing loss to French far right in EU vote - CNN", "description": "France’s President Emmanuel Macron has dissolved the country’s parliament, the National Assembly, and called a snap election after an exit poll showed his Renaissance party is set to be trounced by the far-right opposition in European parliamentary elections …", "url": "https://www.cnn.com/2024/06/09/europe/macron-dissolves-french-parliament-europe-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/1fdde837-9e8e-40fd-9d35-fb1eb9a65aa7.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-06-09T21:42:00Z", "content": "Frances President Emmanuel Macron has dissolved the countrys parliament, the National Assembly, and called a snap election after an exit poll showed his Renaissance party is set to be trounced by the… [+3230 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Reuters", "title": "French preisdent Macron to dissolve parliament, call new elections after defeat by far-right party - Hindustan Times", "description": "French President Macron to hold new legislative elections after trouncing in European elections | World News", "url": "https://www.hindustantimes.com/world-news/french-preisdent-macron-to-dissolve-parliament-call-new-elections-after-defeat-by-far-right-party-101717961646398.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/09/1600x900/EU-ELECTION-FRANCE-65_1717961698291_1717961799139.JPG", "publishedAt": "2024-06-09T19:42:46Z", "content": "In a shock move, French President Emmanuel Macron on Sunday said he would dissolve parliament and call new legislative elections later this month after he was trounced in European elections by Marine… [+1052 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Nette Nöstlinger", "title": "German conservatives first, far-right AfD second in EU election - POLITICO Europe", "description": "Alternative for Germany beats Chancellor Olaf Scholz’s Social Democrats, who had their worst result in a national election in the party’s history.", "url": "https://www.politico.eu/article/conservatives-finish-first-germany-eu-election-early-projection-cdu-csu/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2024/06/09/GettyImages-2155828726-scaled.jpg", "publishedAt": "2024-06-09T17:27:00Z", "content": "If the result holds, it will be seen as a big success for a party that has been beset by scandals in recent months. \r\nThe party’s top two candidates for EU election were implicated in a series of sen… [+1096 chars]"}, {"source": {"id": null, "name": "DAWN.com"}, "author": "Reuters", "title": "European Parliament set for rightward shift as final votes cast - DAWN.com", "description": "The vote will shape how the blocks 450 million citizens view issues such as a hostile Russia and immigration.", "url": "https://www.dawn.com", "urlToImage": "https://i.dawn.com/large/2024/06/092149040b7e0b2.jpg?r=214924", "publishedAt": "2024-06-09T16:43:05Z", "content": "Voters in 21 EU countries, including France and Germany, cast their ballots on Sunday in an election for the European Parliament that is expected to shift the assembly to the right and boost the numb… [+4436 chars]"}]}