{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jeanette Settembre", "title": "European Union to ease travel restrictions for vaccinated Americans - Fox News", "description": "The European Union on Wednesday agreed on a proposal to relax COVID-19 travel restrictions on travelers visiting from outside its 27 countries", "url": "https://www.foxnews.com/travel/european-union-ease-travel-restrictions-vaccinated-americans", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/GettyImages-1231950320.jpg", "publishedAt": "2021-05-19T14:14:41Z", "content": "Vaccinated Americans will soon be able to travel to Europe with ease.\r\nThe European Union on Wednesday agreed on a proposal to relax COVID-19 travel restrictions for travelers visiting from outside i… [+1411 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Philip Blenkinsop", "title": "EU to allow fully-vaccinated travellers to visit this summer: report - Global News", "description": "European Union countries agreed on Wednesday to ease COVID-19 travel restrictions on non-EU visitors ahead of the summer tourist season, two EU sources said.", "url": "https://globalnews.ca/news/7875367/covid-eu-travellers-summer-2021/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/05/GettyImages-1219589883.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-05-19T12:09:10Z", "content": "European Union countries agreed on Wednesday to ease COVID-19 travel restrictions on non-EU visitors ahead of the summer tourist season, two EU sources said.\r\nAmbassadors from the 27 EU countries app… [+1712 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Buhari seeks debt relief, COVID-19 vaccines for Africa - Guardian Nigeria", "description": "President Muhammadu Buhari has called on European countries and global financial institutions to consider reducing the devastating effect of the COVID-19 pandemic on African economies by restructuring debt portfolios and providing complete debt relief.", "url": "https://guardian.ng/news/buhari-seeks-debt-relief-covid-19-vaccines-for-africa/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/02/000_9383DJ-scaled.jpg", "publishedAt": "2021-05-19T08:48:00Z", "content": "(FILES) In this file photo taken on October 03, 2019 Nigeria’s President Muhammadu Buhari looks on while giving a press conference during his official state visit at Union Buildings in Pretoria. – Ni… [+2598 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "How a change in the Pfizer's storage temperature could completely change vaccine access - CBC.ca", "description": "The Pfizer vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, a move that could have major implications on the rollout of vaccines across Canada and the world.", "url": "https://www.cbc.ca/news/health/pfizer-vaccine-canada-storage-temperature-1.6031823", "urlToImage": "https://i.cbc.ca/1.6014567.1621384276!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-ont-vaccine-20210107.jpg", "publishedAt": "2021-05-19T08:00:00Z", "content": "The Pfizer-BioNTech COVID-19 vaccine can now be stored at typical refrigerator temperatures in Europe for weeks longer than previously thought, which could have major implications on the rollout of v… [+6590 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "WhatsApp changes South Africans should know about: legal expert - BusinessTech", "description": "South Africa’s Information Regulation is taking legal advice on WhatsApp’s updated privacy policy, which gives more disclosure about use of their personal information to users in the European Union than outside it.", "url": "https://businesstech.co.za/news/mobile/491095/whatsapp-changes-south-africans-should-know-about-legal-expert/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/05/Whatsapp-1.jpg", "publishedAt": "2021-05-18T06:54:32Z", "content": "South Africas Information Regulation is taking legal advice on WhatsApps updated privacy policy – which discloses more about the use of personal information to users in the European Union, than in pl… [+3529 chars]"}]}