{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Tara John, Nadine Schmidt, Tim Lister and Chris Liakos, CNN", "title": "Russian authorities deny entry to European airlines as EU mulls sanctions on Belarus - CNN ", "description": "More planes are being diverted or canceled due to aviation bans over Belarusian airspace as the European Union mulls fresh sanctions on the country over what has been described as a state-sanctioned hijacking.", "url": "https://www.cnn.com/2021/05/27/europe/belarus-airlines-sanctions-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210524132552-02-raman-pratasevich-file-2017-super-tease.jpg", "publishedAt": "2021-05-27T15:28:00Z", "content": null}, {"source": {"id": null, "name": "Premium Times"}, "author": "Jide Alaka", "title": "Chukwueze joins five other Nigerians who have won the Europa League - Premium Times", "description": "Chukwueze played 11 matches to help Villarreal win their first-ever European title.........................................", "url": "https://www.premiumtimesng.com/sports/football/464145-chukwueze-joins-five-other-nigerians-who-have-won-the-europa-league.html", "urlToImage": "https://i0.wp.com/media.premiumtimesng.com/wp-content/files/2020/07/IMG_20200704_092453.jpg?fit=1724%2C1150&ssl=1", "publishedAt": "2021-05-27T13:31:23Z", "content": "A hamstring injury meant Samuel Chukwueze could not physically help Villarreal overcome Manchester United on Wednesday in the 2020/21 UEFA Europa League final.\r\nHowever, he had done enough over the s… [+4639 chars]"}, {"source": {"id": null, "name": "Wareable"}, "author": "James Stables", "title": "Oppo Watch Free could be next smartwatch to run the new Wear OS - Wareable", "description": "Oppo is cooking up a new smartwatch – the Oppo Watch Free – which has passed through European regulators.  LetsGoDigital has spotted the trademark passing t...", "url": "https://www.wareable.com/smartwatches/oppo-watch-free-rumor-8438", "urlToImage": "https://www.wareable.com/media/imager/202105/35516-posts.facebook_lg.jpg", "publishedAt": "2021-05-27T12:35:43Z", "content": "Oppo is cooking up a new smartwatch the Oppo Watch Free which has passed through European regulators.\r\nLetsGoDigital has spotted the trademark passing through the EU Intellectual Property Office, whi… [+1393 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Champions League final - Man City v Chelsea: ‘This trophy will acknowledge their greatness’ - Ruud Gullit on Phil Foden and Mason Mount - BBC Sport", "description": "Two-time European Cup winner Ruud Gullit says we should forget about what Phil Foden and Mason Mount can do next because Saturday's Champions League final is their moment now.", "url": "https://www.bbc.co.uk/sport/football/57249055", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/5436/production/_118685512_foden_mount_index.png", "publishedAt": "2021-05-27T10:00:29Z", "content": "Forget about what Phil Foden and Mason Mount can do next - this is their moment now.\r\nSaturday's Champions League final is a chance for them to show why they are special, in one of the biggest games … [+5911 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Joel Rabinowitz", "title": "Alberto Moreno's Manchester United humbling uncovers a wider Jürgen Klopp reality for Liverpool - Liverpool.com", "description": "The Spaniard endeared himself to Liverpool supporters after winning the third major European trophy of his career last night.", "url": "https://www.liverpool.com/liverpool-fc-news/features/liverpool-alberto-moreno-manchester-united-20688162", "urlToImage": "https://i2-prod.liverpool.com/incoming/article20688215.ece/ALTERNATES/s1200/0_GettyImages-1320230159.jpg", "publishedAt": "2021-05-27T09:46:58Z", "content": "Even the mere mention of the name Alberto Moreno is enough to bring back painful, vivid memories of the 2016 Europa League final in Basel, in which he was at the centre of Liverpools spectacular seco… [+4228 chars]"}]}