{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "ITV News"}, "author": "ITV News", "title": "Lockdowns and bans on unvaccinated: How Europe is coping with Covid surge - ITV News", "description": "As Austria prepares to enter another national lockdown, we take a look at how other European countries are coping with the spread of the virus.", "url": "https://www.itv.com/news/2021-11-19/lockdowns-and-public-transport-bans-across-europe-as-covid-cases-rise-again", "urlToImage": "https://images.ctfassets.net/pjshm78m9jt4/6PuBmregeUrCIluyHBRhBB/25dc3c7e878de34c9aa8d0f17112cc93/AP_21324011346717.jpg", "publishedAt": "2021-11-20T12:01:21Z", "content": "As Austria prepares to go into a full nationwide lockdown and makes vaccinations mandatory to tackle surging Covid cases, how are other countries across Europe coping with the virus?\r\nSeveral Europea… [+9065 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: WHO says it is very worried about Europe surge - BBC News", "description": "The health organisation's regional director warns of half a million more deaths by March without action.", "url": "https://www.bbc.co.uk/news/world-europe-59358074", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/84AB/production/_121736933_0d44d890-ac7f-47cb-8765-013c845da27a.jpg", "publishedAt": "2021-11-20T11:50:58Z", "content": "Image caption, Dr Kluge said introducing measures like mask wearing could immediately help\r\nThe World Health Organization (WHO) is \"very worried\" about the spread of Covid-19 within Europe as the con… [+2546 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Corky Siemaszko, Khalid Razak, Chantal Da Silva, Yuliya Talmazan", "title": "As Europe's border crisis eases, migrants face return to reality they sought to escape - NBC News", "description": "The deadly crisis Belarus was accused of creating at its border with Europe appeared to subside this week, raising hopes of an end to what had become a", "url": "https://www.nbcnews.com/news/world/belarus-poland-border-migrant-crisis-europe-iraq-rcna5988", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-11/211118-belarus-iraq-migrants-mn-1106-46bed9.jpg", "publishedAt": "2021-11-20T10:30:52Z", "content": "BAGHDAD The deadly crisis Belarus was accused of creating at its border with Europe appeared to subside this week, raising hopes of an end to what had become a spiraling confrontation between East an… [+8068 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Europe's COVID crisis pits vaccinated against unvaccinated - Economic Times", "description": "Governments desperate to shield overburdened healthcare systems are imposing rules that limit choices for the unvaccinated in the hope that doing so will drive up rates of vaccinations. Austria on Friday went a step further, making vaccinations mandatory as o…", "url": "https://economictimes.indiatimes.com/news/international/world-news/europes-covid-crisis-pits-vaccinated-against-unvaccinated/articleshow/87815314.cms", "urlToImage": "https://img.etimg.com/thumb/msid-87815452,width-1070,height-580,imgsize-22294,overlay-economictimes/photo.jpg", "publishedAt": "2021-11-20T08:05:00Z", "content": "This was supposed to be the Christmas in Europe where family and friends could once again embrace holiday festivities and one another. Instead, the continent is the global epicentre of the COVID-19 p… [+5405 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Moto G200 hits AnTuTu leaderboard with a high score disguised as the Moto Edge 30S - Notebookcheck.net", "description": "The Moto G200 has achieved an impressive AnTuTu score, having been tested as the Moto Edge 30S, its Chinese sibling. Motorola's latest budget flagship scored nearly 860,000 points, despite only costing €449.99 in Europe.", "url": "https://www.notebookcheck.net/Moto-G200-hits-AnTuTu-leaderboard-with-a-high-score-disguised-as-the-Moto-Edge-30S.580323.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/Untitled4439.jpg", "publishedAt": "2021-11-20T00:57:35Z", "content": "Motorola launched the Moto G200 globally earlier this week with a Snapdragon 888 Plus SoC and a 144 Hz display, among other impressive hardware. The Moto G200 is thought to be the global version of t… [+1201 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Danny Tan", "title": "2022 Perodua Myvi facelift spec-by-spec comparison - how to pick between 1.3G, 1.5X, 1.5H, 1.5AV variants - paultan.org - Paul Tan's Automotive News", "description": "Perodua started the next chapter of the Myvi story yesterday night with the launch of the 2022 Perodua Myvi facelift. Much like the Volkswagen Golf in Europe and the Proton Saga here, back in the …", "url": "https://paultan.org/2021/11/19/2022-perodua-myvi-facelift-spec-by-spec-comparison/", "urlToImage": "https://paultan.org/image/2021/11/2022-Myvi-4-Variants-FB-1200x691.png", "publishedAt": "2021-11-19T03:38:14Z", "content": "Perodua started the next chapter of the Myvi story yesterday night with the launch of the 2022 Perodua Myvi facelift. Much like the Volkswagen Golf in Europe and the Proton Saga here, back in the day… [+7244 chars]"}]}