{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Martin Farrer", "title": "New Zealand interest rate hike raises pressure on central banks over inflation - The Guardian", "description": "RBNZ could lift borrowing costs to 3% by 2023, economists say, as focus shifts to policymakers in US, UK and Europe", "url": "https://amp.theguardian.com/world/2021/nov/24/new-zealand-interest-rate-hike-raises-pressure-on-central-banks-over-inflation", "urlToImage": null, "publishedAt": "2021-11-24T04:24:00Z", "content": "New ZealandRBNZ could lift borrowing costs to 3% by 2023, economists say, as focus shifts to policymakers in US, UK and Europe\r\nTue 23 Nov 2021 22.03 EST\r\nNew Zealands central bank has lifted interes… [+4273 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jack Walters", "title": "AstraZeneca chief claims company’s COVID-19 jab can keep Britain safer than Europe - Daily Express", "description": "ASTRAZENECA CHIEF Pascal Soriot has claimed Britain might be better protected against the coronavirus as the UK relied more heavily on doses of the Anglo-Swedish manufactured jab, reports show.", "url": "https://www.express.co.uk/news/uk/1526040/astrazeneca-latest-news-vaccine-jab-coronavirus-europe-britain-covid-jab-pascal-soriot-ont", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/1/750x445/1526040.jpg", "publishedAt": "2021-11-24T02:51:45Z", "content": "However, the Times reports other medical experts are sceptical about Mr Soriot’s claims.\r\nCellular microbiology professor Dr Simon Clarke said: “Care is needed when comparing the effectiveness of the… [+1019 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Efficacy and safety of the CVnCoV SARS-CoV-2 mRNA vaccine candidate in ten countries in Europe and Latin America (HERALD): a randomised, observer-blinded, placebo-controlled, phase 2b/3 trial - The Lancet", "description": "CVnCoV was efficacious in the prevention of COVID-19 of any severity and had an acceptable\nsafety profile. Taking into account the changing environment, including the emergence\nof SARS-CoV-2 variants, and timelines for further development, the decision has be…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00677-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a10b0d67-6de1-4ee7-be6e-33794a3d1268/gr1.jpg", "publishedAt": "2021-11-23T23:31:01Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2021 Elsevier In… [+157 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Joe Sommerlad", "title": "Will there be a new UK lockdown before Christmas? - The Independent", "description": "Boris Johnson remains committed to encouraging vaccine take-up and booster jabs but storm clouds gathering over Europe provide grounds for concern as infection rates remain high", "url": "https://www.independent.co.uk/news/health/uk-lockdown-2021-christmas-covid-b1962688.html", "urlToImage": "https://static.independent.co.uk/2021/10/20/16/iStock-1283053989.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-11-23T16:00:06Z", "content": "With Austria and the Netherlands reintroducing lockdowns in response to spiking coronavirus cases in western Europe, many in the UK will be glancing anxiously across the English Channel, fearing soci… [+5762 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Total Covid deaths in Europe could exceed 2.2 million by March: WHO - Times of India", "description": "Europe News: The World Health Organization (WHO) said on Tuesday there could be a further 700,000 deaths from COVID-19 in Europe by March, taking the total to abov", "url": "https://timesofindia.indiatimes.com/world/europe/total-covid-deaths-in-europe-could-exceed-2-2-million-by-march-who/articleshow/87874262.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-87874293,width-1070,height-580,imgsize-850201,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-11-23T15:43:00Z", "content": "Total Covid deaths in Europe could exceed 2.2 million by March: WHO"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Paul Hyland", "title": "Ireland needs up to 200 extra ICU beds to meet EU average, says leading intensive care consultant - Independent.ie", "description": "A leading ICU consultant said the country&rsquo;s healthcare system needs up to 200 additional intensive care beds to treat patients and meet the European average.", "url": "https://www.independent.ie/news/ireland-needs-up-to-200-extra-icu-beds-to-meet-eu-average-says-leading-intensive-care-consultant-41076323.html", "urlToImage": "https://www.independent.ie/news/7ed5f/41076322.ece/AUTOCROP/w1240h700/Hospital.jpg", "publishedAt": "2021-11-22T08:24:00Z", "content": "A leading ICU consultant said the countrys healthcare system needs up to 200 additional intensive care beds to treat patients and meet the European average.\r\nDr Andrew Westbrook, who is an intensive … [+2176 chars]"}]}