{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Katrin Bennhold, Melissa Eddy", "title": "Germany’s Merkel Hands Over Chancellor’s Office to Scholz - The New York Times", "description": "Chancellor Olaf Scholz and his new cabinet were sworn in, beginning a new chapter for Europe’s largest democracy. Angela Merkel wished him well and called the chancellorship “one of the most beautiful duties there are.”", "url": "https://www.nytimes.com/live/2021/12/08/world/germany-scholz-merkel", "urlToImage": "https://static01.nyt.com/images/2021/12/08/world/08germany-scholz-briefing-HP/08germany-scholz-briefing-HP-facebookJumbo.jpg", "publishedAt": "2021-12-08T20:34:47Z", "content": "For the photographer Herlinde Koelbl, the end of Angela Merkels tenure as Germanys chancellor isnt just the end of a political era its also the end of one of the longest-running art projects in world… [+3083 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Annabelle Dickson", "title": "7 times Boris Johnson botched a scandal - POLITICO Europe", "description": "British prime minister has a habit of insisting there isn’t a problem and then changing his mind.", "url": "http://www.politico.eu/article/boris-johnson-7-times-botched-scandal/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2021/12/08/GettyImages-1236851238.jpg", "publishedAt": "2021-12-08T16:28:13Z", "content": "LONDON  Boris Johnson’s in firefighting mode again but he has a habit of making things worse.\r\nIt has long been a hallmark of the U.K. prime minister’s governing style to duck questions or even make … [+7281 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Surprise Planet Discovered Around Extreme Star Pair - SciTechDaily", "description": "The European Southern Observatory’s Very Large Telescope (ESO’s VLT) has captured an image of a planet orbiting b Centauri, a two-star system that can be seen with the naked eye. This is the hottest and most massive planet-hosting star system found to date, a…", "url": "https://scitechdaily.com/surprise-planet-discovered-around-extreme-star-pair/", "urlToImage": "https://scitechdaily.com/images/Surprise-Planet-Discovered-Around-Extreme-Star-Pair-scaled.jpg", "publishedAt": "2021-12-08T16:00:52Z", "content": "ByEuropean Southern Observatory (ESO)December 8, 2021\r\nThis image shows the most massive planet-hosting star pair to date, b Centauri, and its giant planet b Centauri b. This is the first time astron… [+6536 chars]"}]}