{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Image.ie"}, "author": "Amanda Cassidy", "title": "Meet the Irish astrophysicist aiming for the stars - image.ie", "description": "Cillian Murphy is an Irish astrophysicist working towards becoming an astronaut with the European Space Agency", "url": "https://www.image.ie/self/meet-the-irish-astrophysicist-aiming-for-the-stars-291603", "urlToImage": "https://imageirl.imageresizer.io/5mt50iJVl2-s1280x720-q85.jpg", "publishedAt": "2021-08-08T18:32:41Z", "content": "“Ive always had a curious mind. \r\nIve loved science, discovery, and exploration since I can remember. My mom loves to tell a story that when I was only four or five years old, I was told I could pick… [+8800 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jon Henley, Bethan McKernan, Helena Smith", "title": "Thousands flee Greek island as wildfires raze forest and homes - The Guardian", "description": "Firefighters tackle blazes on two major fronts on Evia as devastation across southern Europe continues", "url": "https://amp.theguardian.com/world/2021/aug/08/thousands-flee-greek-island-evia-wildfires-raze-forest-and-homes", "urlToImage": null, "publishedAt": "2021-08-08T15:51:00Z", "content": "GreeceFirefighters tackle blazes on two fronts on Evia as heatwave-driven devastation across southern Europe continues\r\nThousands of people have fled wildfires that are destroying vast swathes of pin… [+7096 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Raf Casert", "title": "Once lagging, Europe catches up to the US in vaccinations - Associated Press", "description": "BRUSSELS (AP) — Despite a sluggish start, the European Union's COVID-19 vaccination drive has caught up to that of the United States, where the slowdown of the country's once-vaunted campaign has contributed to the virus's deadly comeback.", "url": "https://apnews.com/article/covid-19-vaccine-europe-surpasses-us-f58d8301dba700337d0998f16667e341", "urlToImage": "https://storage.googleapis.com/afs-prod/media/f356a28a3d1d4da8a5ef9bf45568d2ad/3000.jpeg", "publishedAt": "2021-08-08T06:06:03Z", "content": "BRUSSELS (AP) Despite a sluggish start, the European Unions COVID-19 vaccination drive has caught up to that of the United States, where the slowdown of the countrys once-vaunted campaign has contrib… [+5571 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Rappler.com", "title": "No link found so far between menstrual disorders and COVID-19 vaccines, EU says - Rappler", "description": "The European Medicines Agency says its safety committee had studied cases of menstrual disorders reported after vaccination, adding it had requested more data from vaccine developers to assess the issue", "url": "https://www.rappler.com/world/global-affairs/no-link-found-so-far-between-menstrual-disorders-covid-19-vaccines-eu", "urlToImage": "https://assets2.rappler.com/2021/06/vaccine-kinds-vials-1628305899293.jpg", "publishedAt": "2021-08-07T03:13:00Z", "content": "Separately, the EMA on Friday recommended that immune thrombocytopenia, or low blood platelets, dizziness, and tinnitus, or ringing in the ear, be added to the labels of J&amp;J's single-shot vaccine… [+31 chars]"}]}