{"articles": [{"author": null, "content": "A man receives a dose of AstraZeneca's COVID-19 vaccine at a conference center in Rome on 24 March. Italy halted use of the vaccine on 15 March but resumed immunizations four days later.\r\nAntonio Mas… [+11723 chars]", "description": "Researchers propose a mechanism and a treatment for possible deadly side effect seen in at least 30 European vaccine recipients", "publishedAt": "2021-03-27T14:20:00Z", "source": {"id": null, "name": "Science Magazine"}, "title": "A rare clotting disorder may cloud the world's hopes for AstraZeneca's COVID-19 vaccine - Science Magazine", "url": "https://www.sciencemag.org/news/2021/03/rare-clotting-disorder-may-cloud-worlds-hopes-astrazenecas-covid-19-vaccine", "urlToImage": "https://www.sciencemag.org/sites/default/files/styles/article_main_large/public/AstraZeneca_online3.jpg?itok=FP6WZMCS"}, {"author": "Rachel Aiello", "content": "OTTAWA -- \r\nAfter concerns raised earlier this week, the federal government says it has received assurances from the European Union that Canadas coming vaccine shipments will not be held back, despit… [+2289 chars]", "description": "After concerns raised earlier this week, the federal government says it has received assurances from the European Union that Canada's coming vaccine shipments will not be held back, despite the EU's new export controls.", "publishedAt": "2021-03-26T18:16:00Z", "source": {"id": null, "name": "Ctvnews.ca"}, "title": "Canada assured vaccine exports from EU won't be blocked - CTV News", "url": "https://www.ctvnews.ca/politics/canada-assured-vaccine-exports-from-eu-won-t-be-blocked-1.5363955", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5363963.1616782501!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg"}, {"author": "Bloomberg", "content": "For years China has sought to draw moral equivalence with the West over human rights, insisting that other countries have no standing to criticize its policies. Now Beijing is making companies pay if… [+6430 chars]", "description": "China this week has pushed a campaign to boycott Western retailers after the U.S., U.K., Canada and the European Union imposed sanctions over human-rights abuses against ethnic minority Uyghurs in Xinjiang.", "publishedAt": "2021-03-26T09:49:30Z", "source": {"id": null, "name": "The Indian Express"}, "title": "Xi’s red line on China human rights makes companies like H&M, Nike, Uniqlo pick sides - The Indian Express", "url": "https://indianexpress.com/article/world/china-xinjiang-hm-nike-uniqlo-7246442/", "urlToImage": "https://images.indianexpress.com/2021/03/China-5.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "europe"}