{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Stan Choe", "title": "Stocks tumble on Wall Street on renewed fears about banks - The Associated Press - en Español", "description": "NEW YORK (AP) — Stocks are back to falling on Wall Street Wednesday as worries worsen about the strength of banks on both sides of the Atlantic. The S&P 500 was 1.3% lower in midday trading, while markets in Europe fell more sharply as shares of Switzerland’s…", "url": "https://apnews.com/article/stocks-economy-china-banks-svb-fed-crude-f3e78bc438027148ee1302b003c6a8a8", "urlToImage": "https://storage.googleapis.com/afs-prod/media/b39131425b21495cb44e86347ea159ad/3000.webp", "publishedAt": "2023-03-15T15:33:45Z", "content": "NEW YORK (AP) Stocks are back to falling on Wall Street Wednesday as worries worsen about the strength of banks on both sides of the Atlantic.\r\nThe S&amp;P 500 was 1.3% lower in midday trading, while… [+5086 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Pooja Sitaram Jaiswar", "title": "Black Wednesday? Credit Suisse stock nosedives 78% from 1-year high, sparks $60 bn rout in European banks | Mint - Mint", "description": "Investors are dumping Credit Suisse's share price after its biggest backer ruled out the possibility of aiding the troubled Swiss bank as a bigger shareholding could lead to additional regulatory hurdles. Also, the Swiss lender has come under regulatory radar…", "url": "https://www.livemint.com/market/stock-market-news/black-wednesday-credit-suisse-stock-nosedives-78-from-1-year-high-sparks-60-bn-rout-in-european-banks-11678884231871.html", "urlToImage": "https://images.livemint.com/img/2023/03/15/600x338/CREDIT-SUISSE-GP-FIRST-BOSTON-0_1678067436790_1678067436790_1678884322568_1678884322568.JPG", "publishedAt": "2023-03-15T14:45:14Z", "content": "It's a bloodbath in Switzerland-based global investment bank and financial services firm, Credit Suisse's share price. It almost gives the vibe of Black Wednesday as financial stocks have dragged bro… [+6144 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Yousef Gamal El-Din, Marion Halftermeyer", "title": "Credit Suisse Top Shareholder Saudi National Bank Rules Out More Assistance - Bloomberg", "description": "A top shareholder ruled out adding to its stake in Credit Suisse Group AG, deepening the crisis at the storied Swiss bank and leaving its leaders struggling to shore up confidence amid market chaos that’s spreading from Europe to the US.", "url": "https://www.bloomberg.com/news/articles/2023-03-15/credit-suisse-top-shareholder-rules-out-more-assistance-to-bank-lf9gfhbr", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ik9ofIQT_7FY/v0/1200x800.jpg", "publishedAt": "2023-03-15T14:32:12Z", "content": "A top shareholder ruled out adding to its stake in \r\nCredit Suisse Group AG, deepening the crisis at the storied Swiss bank and leaving its leaders struggling to shore up confidence amid market chaos… [+240 chars]"}]}