{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Vishwam Sankaran", "title": "‘Black Death’ may not have killed half of Europe as previously believed, study finds - The Independent", "description": "Parts of Poland, the Baltic countries, and central Spain may have experienced ‘much lighter touch’ of pandemic, research suggests", "url": "https://www.independent.co.uk/news/science/black-death-plague-outbreak-europe-b2012775.html", "urlToImage": "https://static.independent.co.uk/2022/02/11/04/268182_web.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-02-11T06:38:31Z", "content": "The 14th-century bubonic plague pandemic may not have had the same devastating widespread effects in all parts of Europe as previously thought, according to a new study.\r\nHistorians have long held th… [+4624 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Previous COVID-19 Infection – But NOT Vaccination – Improves Performance of Antibodies - SciTechDaily", "description": "Researchers also found that previously-infected patients with obesity, contrary to expectations, had a higher and more sustained immune response. New research to be presented at this year’s European Congress of Clinical Microbiology & Infectious Diseases (ECC…", "url": "https://scitechdaily.com/previous-covid-19-infection-but-not-vaccination-improves-performance-of-antibodies/", "urlToImage": "https://scitechdaily.com/images/COVID-19-Coronvirus-Vaccine-Illustration.jpg", "publishedAt": "2022-02-10T23:00:45Z", "content": "ByEuropean Society of Clinical Microbiology and Infectious DiseasesFebruary 10, 2022\r\nResearchers also found that previously-infected patients with obesity, contrary to expectations, had a higher and… [+6075 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Gráinne Ní Aodha", "title": "Ombudsman opens inquiry into whether EU is properly monitoring GDPR application in Ireland - TheJournal.ie", "description": "The European Ombudsman is carrying out the inquiry on foot of a complaint from the Irish Council for Civil Liberties.", "url": "https://www.thejournal.ie/inquiry-gdpr-in-ireland-5680194-Feb2022/", "urlToImage": "https://img2.thejournal.ie/article/5680194/river/?height=400&version=5680200", "publishedAt": "2022-02-10T22:01:00Z", "content": "The @EUombudsman's letter to @vonderleyen today re our @ICCLtweet complaint that the Commission failed to monitor the application of the GDPR. @DReynders@EUOmbudsmanEORpic.twitter.com/oDPLzefFYB\r\n— J… [+1886 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "International trade bans imposed on N.L. and N.S. poultry after avian flu kills 1000s of birds - CBC.ca", "description": "The European Union and nine countries, including the U.S., have put trade restrictions on some poultry products from two Atlantic Canadian provinces after a strain of avian flu that's deadly for birds was identified at a Nova Scotian turkey farm.", "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/bird-flu-trade-bans-1.6346229", "urlToImage": "https://i.cbc.ca/1.6203552.1633631904!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/turkey-barn.jpg", "publishedAt": "2022-02-10T20:16:53Z", "content": "The European Union and nine countries, including the U.S., have put trade restrictions on some poultry products from two Atlantic Canadian provinces after a deadly strain of avian flu was identified … [+4595 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Agency Report", "title": "EU unveils €150bn investment plan for Africa - Punch Newspapers", "description": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent's biggest and \"most reliable\" partner.", "url": "https://punchng.com/eu-unveils-e150bn-investment-plan-for-africa/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2019/07/16193245/Ursula-von-der-Leyen.png", "publishedAt": "2022-02-10T20:00:03Z", "content": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent’s biggest and “most reliable” partner.\r… [+3441 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Black death mortality not as widespread as believed - Phys.org", "description": "The black death, which plagued Europe, West Asia and North Africa from 1347 to 1352, is the most infamous pandemic in history. Historians have estimated that up to 50 percent of Europe's population died during the pandemic and credit the black death with tran…", "url": "https://phys.org/news/2022-02-black-death-mortality-widespread-believed.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/black-death-mortality.jpg", "publishedAt": "2022-02-10T16:00:05Z", "content": "The black death, which plagued Europe, West Asia and North Africa from 1347 to 1352, is the most infamous pandemic in history. Historians have estimated that up to 50 percent of Europe's population d… [+4745 chars]"}, {"source": {"id": null, "name": "Wales Online"}, "author": "Matt Gibson", "title": "Johnson flies to Poland as a thousand UK troops go on standby for eastern Europe - Devon Live", "description": "Meanwhile, Foreign Secretary Liz Truss is in Moscow for talks with her counterpart Sergei Lavrov", "url": "https://www.walesonline.co.uk/news/uk-news/boris-johnson-flies-poland-more-23045435", "urlToImage": "https://i2-prod.nottinghampost.com/incoming/article6431669.ece/ALTERNATES/s1200/0_escenic-43.jpg", "publishedAt": "2022-02-10T05:00:27Z", "content": "One thousand British troops are being put on standby in case of a humanitarian crisis in eastern Europe if the current Russian military build-up leads to war, Downing Street has announced.\r\nBoris Joh… [+3297 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Frank Jordans", "title": "Cave Fossils Show Humans Came to France 10,000 Years Earlier Than Thought - NBC 6 South Florida", "description": "BERLIN (AP) — A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thought to have reached that part of Europe, a new …", "url": "https://apnews.com/642207a40773a229ea65925574eede2b", "urlToImage": "https://storage.googleapis.com/afs-prod/media/810c790c89734f798f470f9687ab25f3/3000.jpeg", "publishedAt": "2022-02-10T02:06:01Z", "content": "BERLIN (AP) A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latte… [+3295 chars]"}]}