{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "The Galileo constellation grows bigger after successful Launch 11 - Geospatial World", "description": "Two new Galileo satellites were successfully launched from the European spaceport in Kourou, French Guiana on 4 December 2021, bringing the number of Galileo satellites launched to a total of 28 satellites, thereby enabling the provision of more robust servic…", "url": "http://data.wordlift.io/wl01287/post/the_galileo_constellation_grows_bigger_after_successful_launch_11", "urlToImage": "https://www.geospatialworld.net/wp-content/uploads/2021/12/Galileo_satellites_27-28_liftoff-scaled.jpg", "publishedAt": "2021-12-06T05:24:00Z", "content": "Two new Galileo satellites were successfully launched from the European spaceport in Kourou, French Guiana on 4 December 2021, bringing the number of Galileo satellites launched to a total of 28 sate… [+2343 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Pope chides Europe, comforts migrants on return to Lesbos - Fox News", "description": "Pope Francis returned Sunday to the Greek island of Lesbos to offer comfort to migrants at a refugee camp and blast what he said was Europe's indifference and self-interest “that condemns to death those on the fringes.”", "url": "https://www.foxnews.com/world/pope-europe-comforts-migrants-lesbos", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/AP213393728567411.jpg", "publishedAt": "2021-12-05T21:15:10Z", "content": "Pope Francis returned Sunday to the Greek island of Lesbos to offer comfort to migrants at a refugee camp and blast what he said was Europe's indifference and self-interest \"that condemns to death th… [+7029 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "When the (lack of) vaccine of the other interferes: Ômicron brings debate on distribution - Play Crazy Game", "description": "Suddenly, life was almost back to normal. Perhaps not so 'suddenly' in Brazil, with its more than 615,000 killed by covid-19 and a long saga for the distribution of vaccines. But the fact is that, in countries like Europe and the United States, the high rates…", "url": "https://playcrazygame.com/2021/12/05/when-the-lack-of-vaccine-of-the-other-interferes-omicron-brings-debate-on-distribution/", "urlToImage": "https://www.correio24horas.com.br/fileadmin/_processed_/c/3/csm_vacina_arisson_64082baf3a.jpg", "publishedAt": "2021-12-05T13:53:27Z", "content": "Suddenly, life was almost back to normal. Perhaps not so ‘suddenly’ in Brazil, with its more than 615,000 killed by covid-19 and a long saga for the distribution of vaccines. But the fact is that, in… [+12497 chars]"}]}