{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Theregister.com"}, "author": "Laura Dobberstein", "title": "Field trip! European Space Agency sends astronauts abroad to learn about rocks - The Register", "description": "Astronauts need better autonomy as ground control gets further away", "url": "https://www.theregister.com/2023/02/06/field_trip_european_space_agency/", "urlToImage": "https://regmedia.co.uk/2015/06/09/glass_on_mars.jpg", "publishedAt": "2023-02-06T12:30:00Z", "content": "While astronauts are often engineers or scientists, they usually arent geologists, which is why the European Space Agency (ESA) is investing in training to make sure its next mission crew can accurat… [+2033 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Oshoala hits third hat-trick in Barca win - Punch Newspapers", "description": "It was another great weekend for Nigerian duo Asisat Oshoala and Victor Osimhen in Europe, while Alex Iwobi, Kelechi Iheancho also returned to winning ways with their various clubs. ANTHONY NLEBEM takes a look at how Nigeria players performed for their variou…", "url": "https://punchng.com/oshoala-hits-third-hat-trick-in-barca-win/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2023/02/06001554/OSHOALA-AND-OTHERS.jpg", "publishedAt": "2023-02-06T03:41:06Z", "content": "… Osimhen bags brace …Iheanacho, Olayinka on target \r\nIt was another great weekend for Nigerian duo Asisat Oshoala and Victor Osimhen in Europe, while Alex Iwobi, Kelechi Iheancho also returned to wi… [+10142 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "AP", "title": "Ukraine-Russia war: Europe imposes ban on Russian diesel, other oil products | Mint - Mint", "description": "The goal is allowing Russian diesel to keep flowing to countries like China and India and avoiding a sudden price rise that would hurt consumers worldwide, while reducing the profits funding Moscow's budget and war.", "url": "https://www.livemint.com/news/world/ukrainerussia-war-europe-imposes-ban-on-russian-diesel-other-oil-products-11675628110042.html", "urlToImage": "https://images.livemint.com/img/2023/02/05/600x338/Russian-Diesel_1675628307302_1675628307526_1675628307526.jpg", "publishedAt": "2023-02-05T20:22:18Z", "content": "Europe imposed a ban Sunday on Russian diesel fuel and other refined oil products, slashing energy dependency on Moscow and seeking to further crimp the Kremlin's fossil fuel earnings as punishment f… [+3541 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "European Union bans Russian diesel, oil products over Ukraine - Al Jazeera English", "description": "Move comes after the bloc found new supplies of diesel from the US, Middle East and India to replace Russian energy.", "url": "https://www.aljazeera.com/news/2023/2/5/europe-bans-russian-diesel-and-other-oil-products-over-ukraine", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/05/2022-05-01T105125Z_349816858_RC29YT9KV71D_RTRMADP_3_UKRAINE-CRISIS-EU.jpg?resize=1920%2C1440", "publishedAt": "2023-02-05T18:37:20Z", "content": "Europe has imposed a ban on Russian diesel fuel and other refined oil products, slashing energy dependency on Moscow and seeking to further crimp the Kremlins fossil fuel earnings as punishment for i… [+3327 chars]"}]}