{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta", "title": "Poland votes in high-stakes election, as populist ruling group looks to cling to power - CNN", "description": "Poland is voting Sunday in a high-stakes and unpredictable national election, the results of which could have major ramifications for the country’s direction, the balance of power in the European Union and the future of the war in Ukraine.", "url": "https://www.cnn.com/2023/10/15/europe/poland-election-voting-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231009180623-poland-divisions-7.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-10-15T12:21:00Z", "content": "Poland is voting Sunday in a high-stakes and unpredictable national election, the results of which could have major ramifications for the countrys direction, the balance of power in the European Unio… [+2161 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Victor Tangermann", "title": "Amazing Video Soars Over Mars' Epic \"Labyrinth of Night\" - Futurism", "description": "A stunning new video put together by the European Space Agency shows the vastness of the Noctis Labyrinthus, a Martian canyon.", "url": "https://futurism.com/the-byte/amazing-video-soars-mars-epic-labyrinth-night-canyon", "urlToImage": "https://wp-assets.futurism.com/2023/10/amazing-video-soars-mars-epic-labyrinth-night-canyon.jpg", "publishedAt": "2023-10-15T10:32:43Z", "content": "Woah.\r\nLabyrinth of Night\r\nA stunning new video by the European Space Agency shows the vastness of Mars' gigantic 2,500-miles-across Valles Marineris, the Red Planet's equivalent of our Earth's Grand… [+1873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yashee", "title": "How Jews first migrated to Palestine, and how Israel was born - The Indian Express", "description": "Israel-Hamas War: Much before the official creation of Israel in May 1948, Jewish migrants had been settling in Palestine. How did Palestine 'end up paying for Europe's crimes'?", "url": "https://indianexpress.com/article/explained/explained-history/how-jews-first-migrated-to-palestine-how-israel-was-born-8983611/", "urlToImage": "https://images.indianexpress.com/2023/10/Gazaa-1200.jpg", "publishedAt": "2023-10-15T03:43:10Z", "content": "While the modern contours of the Israel-Palestine conflict are well-known Palestinians saying Israel was forcibly established on their homeland, Israel claiming it has every right to exist on its Bib… [+10695 chars]"}]}