{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Hanna Arhirova, Frank Jordans", "title": "Nobel Peace Prize to activists from Belarus, Russia, Ukraine - The Associated Press", "description": "KYIV, Ukraine (AP) — Human rights activists from Ukraine, Belarus and Russia won the Nobel Peace Prize on Friday, a strong rebuke to Russian President Vladimir Putin, whose invasion of Ukraine ruptured decades of nearly uninterrupted peace in Europe, and to t…", "url": "https://apnews.com/ba114b1802b85dfdddc5274efd060b2c", "urlToImage": "https://storage.googleapis.com/afs-prod/media/044380ae782746cbabfbb232a618878b/2470.jpeg", "publishedAt": "2022-10-07T16:52:30Z", "content": "KYIV, Ukraine (AP) Human rights activists from Ukraine, Belarus and Russia won the Nobel Peace Prize on Friday, a strong rebuke to Russian President Vladimir Putin, whose invasion of Ukraine ruptured… [+6142 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "EU leaders reaffirm support for Ukraine, squabble over gas cap - Reuters", "description": "European Union leaders on Friday agreed to give more financial and military aid to Ukraine, but a full day of talks in Prague's ornate royal castle seemed to bring them no closer to deciding on whether or how to cap gas prices.", "url": "https://www.reuters.com/business/energy/eu-leaders-turn-gas-price-caps-end-energy-crunch-2022-10-06/", "urlToImage": "https://www.reuters.com/resizer/BGF4akIBMm66bSpBng77T6YZEgE=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/O2H3I5G32BKK5LJU6OXOQNS5QQ.jpg", "publishedAt": "2022-10-07T15:47:00Z", "content": "PRAGUE, Oct 7 (Reuters) - European Union leaders on Friday agreed to give more financial and military aid to Ukraine, but a full day of talks in Prague's ornate royal castle seemed to bring them no c… [+4458 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Chris Pleasance", "title": "UK energy crisis will be worse next year than this year, expert warns - Daily Mail", "description": "James Rogers, co-founder of the think-tank Council on Geostrategy, told MailOnline that Europe can get through this winter because it stockpiled Russia gas before the supplies were cut off.", "url": "https://www.dailymail.co.uk/news/article-11287843/UK-energy-crisis-worse-year-year-expert-warns.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/07/16/63231049-0-image-a-47_1665156003710.jpg", "publishedAt": "2022-10-07T12:58:51Z", "content": "Amidst warnings of three-day blackouts and industry shut-downs in Britain if the months ahead turn particularly cold, you might be forgiven for thinking that this is the winter of our discontent.\r\nWe… [+8868 chars]"}, {"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Newsroom", "title": "Covid wave looms in Europe as booster campaign makes slow start - Kathimerini English Edition", "description": "A new Covid-19 wave appears to be brewing in Europe as cooler weather arrives, with public health experts warning that vaccine fatigue and confusion over types of available vaccines will likely limit booster uptake.", "url": "https://www.ekathimerini.com/news/1195109/covid-wave-looms-in-europe-as-booster-campaign-makes-slow-start/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2022/10/pfizer_AP-2-960x600.jpg", "publishedAt": "2022-10-07T10:26:15Z", "content": "A new Covid-19 wave appears to be brewing in Europe as cooler weather arrives, with public health experts warning that vaccine fatigue and confusion over types of available vaccines will likely limit… [+3804 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Covid wave looms in Europe as booster campaign makes slow start - CNN", "description": "A new Covid-19 wave appears to be brewing in Europe as cooler weather arrives, with public health experts warning that vaccine fatigue and confusion over types of shots available will likely limit booster uptake.", "url": "https://www.cnn.com/2022/10/07/europe/covid-wave-europe-intl-scli/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221007044053-01-covid-wave-europe.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-07T09:46:00Z", "content": "A new Covid-19 wave appears to be brewing in Europe as cooler weather arrives, with public health experts warning that vaccine fatigue and confusion over types of shots available will likely limit bo… [+3752 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "IANS", "title": "iPod inventor Tony Fadell says Apple should move iPhone to USB-C - Business Standard", "description": "Tony Fadell inventor of the iPod has said that Apple should include USBC port in iPhones as the European Union passed a resolution on USB TypeC as standard charging port", "url": "https://www.business-standard.com/article/technology/ipod-inventor-tony-fadell-says-apple-should-move-iphone-to-usb-c-122100700447_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2022-05/12/full/1652293824-7973.jpg", "publishedAt": "2022-10-07T09:11:00Z", "content": "Tony Fadell, inventor of the iPod, has said that Apple should include USB-C port in iPhones, as the European Union passed a resolution on USB Type-C as standard charging port.\r\nThe debate started whe… [+1622 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The Western Cape has another plan to move away from load shedding - BusinessTech", "description": "The Western Cape government has been on an investment drive to Europe, exploring ways to make the province more energy efficient.", "url": "https://businesstech.co.za/news/energy/632153/the-western-cape-has-another-plan-to-move-away-from-load-shedding/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/07/Power-light-hydrogen.png", "publishedAt": "2022-10-06T15:22:30Z", "content": "The Western Cape government has been on an investment drive to Europe, exploring ways to make the province more energy efficient.\r\nWestern Cape premier Alan Winde has taken a delegation to France and… [+3775 chars]"}]}