{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BioSpace"}, "author": "BioSpace", "title": "Horizon Therapeutics plc Receives European Commission (EC) Approval of UPLIZNA® (inebilizumab) for the Treatment of Adults With Neuromyelitis Optica Spectrum Disorder (NMOSD) - BioSpace", "description": "Horizon Therapeutics plc announced the European Commission approval of UPLIZNA® as monotherapy for the treatment of adult patients with neuromyelitis optica spectrum disorder who are anti-aquaporin-4 immunoglobulin G seropositive, following the positive opini…", "url": "https://www.biospace.com/article/releases/horizon-therapeutics-plc-receives-european-commission-ec-approval-of-uplizna-inebilizumab-for-the-treatment-of-adults-with-neuromyelitis-optica-spectrum-disorder-nmosd-/", "urlToImage": null, "publishedAt": "2022-05-02T08:08:26Z", "content": "DUBLIN--(BUSINESS WIRE)-- Horizon Therapeutics plc (Nasdaq: HZNP) today announced the European Commission (EC) approval of UPLIZNA® (inebilizumab) as monotherapy for the treatment of adult patients w… [+13452 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Oil down US$1 on China growth worries, while EU weighs Russian crude ban - CNA", "description": "MELBOURNE: Oil prices fell on Monday (May 2) in holiday-sapped trade in Asia as concerns about weak economic growth in China, the world's top oil importer, outweighed fears of potential supply stress from a looming European Union ban on Russian crude.\r\n\r\nBren…", "url": "https://www.channelnewsasia.com/business/oil-down-us1-china-growth-worries-while-eu-weighs-russian-crude-ban-2659946", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--BTFQllcD--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2022-05-02t021201z_2_lynxnpei4101i_rtroptp_3_global-economy-oil.jpg?itok=88OWFk-O", "publishedAt": "2022-05-02T05:40:55Z", "content": "MELBOURNE: Oil prices fell on Monday (May 2) in holiday-sapped trade in Asia as concerns about weak economic growth in China, the world's top oil importer, outweighed fears of potential supply stress… [+2476 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ELAINE GANLEY", "title": "May Day rallies in Europe urge more help as inflation bites - The Associated Press", "description": "PARIS (AP) — Tens of thousands of people marched Sunday in cities around Europe for May Day protests to honor workers and shame governments into doing more for their citizens. In France, protesters shouted slogans against newly elected President Emmanuel Macr…", "url": "https://apnews.com/article/russia-ukraine-business-macron-europe-slovakia-0af9d56da54d0f22925af240ed253368", "urlToImage": "https://storage.googleapis.com/afs-prod/media/3b2898c78d1c46208adbe1048b5bd742/3000.jpeg", "publishedAt": "2022-05-01T18:09:19Z", "content": "PARIS (AP) Tens of thousands of people marched Sunday in cities around Europe for May Day protests to honor workers and shame governments into doing more for their citizens. In France, protesters sho… [+5412 chars]"}]}