{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lorne Cook", "title": "EU takes major step toward Russian oil ban, new sanctions - The Associated Press", "description": "BRUSSELS (AP) — The European Union's top official on Wednesday called on the 27-nation bloc to ban oil imports from Russia and target the country’s biggest bank and major broadcasters in a sixth package of sanctions over the war in Ukraine .", "url": "https://apnews.com/article/russia-ukraine-business-global-trade-moscow-europe-c6c7a1960b88c363ce5f3eaf0ea07dcd", "urlToImage": "https://storage.googleapis.com/afs-prod/media/2985e7021572414bb2aad77657d03aaf/3000.jpeg", "publishedAt": "2022-05-04T19:41:04Z", "content": "BRUSSELS (AP) The European Unions top official on Wednesday called on the 27-nation bloc to ban oil imports from Russia and target the countrys biggest bank and major broadcasters in a sixth package … [+5811 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "EU proposes Russian oil ban to make Putin 'pay high price' for Ukraine - CBC News", "description": "The European Union's executive on Wednesday proposed the toughest package of sanctions yet against Moscow for its war in Ukraine, but several countries worried about the impact of cutting off Russia oil imports stood in the way of agreement.", "url": "https://www.cbc.ca/news/world/europe-russian-oil-ban-1.6440704", "urlToImage": "https://i.cbc.ca/1.6401670.1648586827!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/russia-oil-irkutskoilcompany.JPG", "publishedAt": "2022-05-04T17:34:21Z", "content": "The European Union's executive on Wednesday proposed the toughest package of sanctions yet against Moscow for its war in Ukraine, but several countries worried about the impact of cutting off Russia … [+4459 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Russia targets train stations, weapons depots in latest deadly attacks in Ukraine - CBC News", "description": "Complaining that the West is \"stuffing Ukraine with weapons,\" Russia bombarded rail stations and other supply-line points across the country Wednesday, as the European Union moved to further punish Moscow for the war by proposing a ban on oil imports.", "url": "https://www.cbc.ca/news/world/russia-ukraine-war-1.6440695", "urlToImage": "https://i.cbc.ca/1.6441231.1651686579!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/vehicles-are-seen-burning-in-aftermath-of-missile-strike-at-ukrainian-oil-depot-in-makiivka.jpg", "publishedAt": "2022-05-04T17:06:40Z", "content": "Complaining that the West is \"stuffing Ukraine with weapons,\" Russia bombarded railway stations and other supply-line targets across the country on Wednesday, as the European Union moved to further p… [+6698 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Q&A on hepatitis in children - WHO/Europe", "description": "In recent weeks, a number of cases of severe hepatitis of unknown origin in children have been reported. These have been detected in several countries including the United Kingdom of Great Britain and Northern Ireland, Spain and the United States of America.", "url": "https://www.euro.who.int/en/health-topics/communicable-diseases/hepatitis/news/news/2022/4/q-and-a-on-hepatitis-in-children", "urlToImage": "https://www.euro.who.int/__data/assets/image/0005/243581/who-europe-250.png", "publishedAt": "2022-05-04T13:07:49Z", "content": "In recent weeks, a number of cases of severe hepatitis of unknown origin in children have been reported.These have been detected in several countries including the United Kingdom of Great Britain and… [+3917 chars]"}, {"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Newsroom", "title": "UN: Obesity levels in Europe at ‘epidemic proportions’ - Kathimerini English Edition", "description": "The World Health Organization says the rates of people who are obese and overweight in Europe have hit “epidemic proportions,” with nearly 60% of adults and a third of children in one of those categories.", "url": "https://www.ekathimerini.com/news/1183552/un-obesity-levels-in-europe-at-epidemic-proportions/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2022/05/obesity_AP-960x600.jpg", "publishedAt": "2022-05-04T11:53:26Z", "content": "The World Health Organization says the rates of people who are obese and overweight in Europe have hit epidemic proportions,” with nearly 60% of adults and a third of children in one of those categor… [+1783 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Ricci Rox", "title": "Sony Xperia 1 IV and Xperia 10 IV pricing details leak ahead of May 11 event - Notebookcheck.net", "description": "The Sony Xperia 1 IV is officially confirmed to be announced at an event scheduled for May 11, and could be joined by the Xperia 10 IV mid-ranger. Pricing details of the two phones for the European market have now leaked ahead of time, and it appears Sony is …", "url": "https://www.notebookcheck.net/Sony-Xperia-1-IV-and-Xperia-10-IV-pricing-details-leak-ahead-of-May-11-event.617095.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/xperia_1_iii.JPG", "publishedAt": "2022-05-04T10:14:55Z", "content": "Sony is apparently geared to unveil two new devices on May 11. The flagship Xperia 1 IV will be announced at the event for certain, and is expected to be joined by the mid-range Xperia 10 IV. A new l… [+991 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Chief Proposes \"Phasing Out Russian Oil In Orderly Fashion\" - NDTV", "description": "The European Union's executive unveiled Wednesday plans for a gradual ban on Russian oil imports as part of a raft of new sanctions to punish Moscow for invading Ukraine.", "url": "https://www.ndtv.com/world-news/eu-chief-proposes-phasing-out-russian-oil-in-orderly-fashion-news-agency-afp-2944344", "urlToImage": "https://c.ndtvimg.com/2020-03/kl0o7hto_crude-oil-daqing-oil-field-china--reuters_625x300_13_March_20.jpg", "publishedAt": "2022-05-04T07:28:32Z", "content": "The EU chief today presented a sixth package of sanctions against Moscow. (Representational)\r\nStrasbourg, France: The European Commission proposed a gradual ban on Russian oil imports Wednesday to pu… [+6227 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Andrew Gregory", "title": "Obesity ‘epidemic’ leading to 1.2m deaths a year in Europe, says WHO - The Guardian", "description": "Health body issues stark warning as report finds disease causing 200,000 cancer cases a year in region", "url": "https://amp.theguardian.com/society/2022/may/03/obesity-epidemic-proportions-across-europe-world-health-organization-who", "urlToImage": null, "publishedAt": "2022-05-03T21:41:00Z", "content": "ObesityHealth body issues stark warning as report finds disease causing 200,000 cancer cases a year in region \r\nObesity has reached epidemic proportions in Europe, the World Health Organization says,… [+3650 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Stefanie Waldek", "title": "A total lunar eclipse will turn the moon red the night of May 15 - Space.com", "description": "It will be visible from the Americas, Europe, Africa, the Middle East, the eastern Pacific, the South Pacific and even Antarctica.", "url": "https://www.space.com/total-lunar-eclipse-blood-moon-coming-may-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/dLozRKi7UDBmLeMEG5soP6-1200-80.jpg", "publishedAt": "2022-05-03T17:10:07Z", "content": "Hot on the heels of the year's first solar eclipse — a partial eclipse on April 30 — a total lunar eclipse is on the horizon.\r\nBetween the late evening of May 15 and the early morning of May 16, depe… [+2973 chars]"}]}