{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "¿Cuánto falta para el fin del mundo? Agencia Espacial Europea hizo el cálculo - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/appearance/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2022-10-10T20:22:15Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New antibiotic comes from a pathogenic bacterium in potatoes - Science Daily", "description": "A multinational team of researchers in Europe report the discovery of a new antifungal antibiotic named solanimycin. The compound, initially isolated from a pathogenic bacterium that infects potatoes, appears to be produced by a broad spectrum of related plan…", "url": "https://www.sciencedaily.com/releases/2022/10/221010115341.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-10-10T16:45:37Z", "content": "The growing threat of antimicrobial resistance has led researchers to search for new compounds everywhere. This week in mBio, a multinational team of researchers in Europe report the discovery of a n… [+3501 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Tim Ross, Esther Webber", "title": "'Panicked' Truss abandons plan to hire outsider to shake-up Treasury - POLITICO Europe", "description": "British PM picks Treasury veteran James Bowler in last minute U-turn, even after Antonia Romeo was offered the job.", "url": "https://www.politico.eu/article/liz-truss-uk-treasury-chief-drops-antonia-romeo-kwasi-kwarteng/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/10/10/GettyImages-1243769107.jpg", "publishedAt": "2022-10-10T14:16:48Z", "content": "Prime Minister Liz Truss has ditched her plan to hire a dynamic senior official to shake-up the Treasury and lead a sweeping overhaul of U.K. economic policy, in a sign that a crisis of confidence ha… [+5288 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Emily Rauhala, Rick Noack, Loveday Morris, Alex Horton", "title": "Ukraine strikes raise pressure on Western allies for air defense systems - The Washington Post", "description": "Ukraine's defense minister said more antiaircraft and antimissile systems would protect the “sky over Ukraine” and “the future of Europe.”", "url": "https://www.washingtonpost.com/world/2022/10/10/ukraine-strikes-allies-air-defense/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/10-10-2022/t_280b975c91f244e8ac1147ea3e3a8874_name_DHZBG6B3MUVQYXCIEL3C4HXJAE_scaled.jpg&w=1440", "publishedAt": "2022-10-10T14:00:00Z", "content": "BRUSSELS The string of strikes against Ukrainian cities and key infrastructure on Monday galvanized long-standing calls from the government to its allies for more sophisticated air defense systems an… [+6665 chars]"}, {"source": {"id": null, "name": "Moneyweb.co.za"}, "author": "https://www.facebook.com/Moneyweb/", "title": "RMH shareholders to get a large dividend - Moneyweb", "description": "Proceeds of Atterbury Europe disposal and distribution of excess capital returns nearly R2bn to shareholders.", "url": "https://www.moneyweb.co.za/news/companies-and-deals/rmh-shareholders-to-get-a-large-dividend/", "urlToImage": "https://www.moneyweb.co.za/wp-content/uploads/2022/10/Atterbury-new-fully-let-office-development-at-Castle-Gate-1024x767.jpg", "publishedAt": "2022-10-09T22:01:14Z", "content": "The sudden dive in the share price of RMB Holdings (RMH) wasn’t unexpected. The nearly 70% drop from R1.96 to 60 cents last Wednesday (5 October) happened because it was the last day to trade in the … [+6841 chars]"}]}