{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "KSL.com"}, "author": "Elizabeth Piper and Andreas Rinke, Reuters", "title": "European leaders tell Putin to agree to Ukraine ceasefire or face new sanctions - KSL News", "description": "Major European powers threw their weight behind an unconditional 30-day Ukraine ceasefire on Saturday, with the backing of President Donald Trump, and threatened President Vladimir Putin with \"massive\" new sanctions if he did not accept within days.", "url": "https://www.ksl.com/article/51310413/european-leaders-tell-putin-to-agree-to-ukraine-ceasefire-or-face-new-sanctions", "urlToImage": "https://img.ksl.com/slc/3084/308478/30847855.JPG?filter=kslv2/responsive_story_lg", "publishedAt": "2025-05-11T02:29:25Z", "content": "KYIV Major European powers threw their weight behind an unconditional 30-day Ukraine ceasefire on Saturday, with the backing of President Donald Trump, and threatened President Vladimir Putin with \"m… [+4805 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Putin suggests Russia and Ukraine have 'direct' talks next week - BBC", "description": "A rare televised late-night statement from the Kremlin came hours after European leaders travelled to Kyiv and urged Moscow to commit to a 30-day ceasefire.", "url": "https://www.bbc.com/news/articles/ce821nl3251o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/334c/live/611101a0-2df4-11f0-8ff1-59f5dcf8e9f5.jpg", "publishedAt": "2025-05-10T23:41:21Z", "content": "Russian President Vladimir Putin has called for \"direct talks\" with Ukraine, saying they should \"start without delay, as early as 15 May\". \r\n\"We seek serious talks... to remove the root causes of the… [+3042 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "FRANCE 24, FRANCE 24", "title": "Soviet-era spacecraft crashes back to Earth after 53 years stuck in orbit - France 24", "description": "A Soviet-era spacecraft that was designed to land on the surface of Venus crashed down to earth on Saturday, decades after it was launched. The European Union Space Surveillance and Tracking agency confirmed the uncontrolled re-entry of Kosmos 482 but could n…", "url": "https://www.france24.com/en/europe/20250510-soviet-era-spacecraft-crashes-back-to-earth-after-53-years-stuck-in-orbit", "urlToImage": "https://s.france24.com/media/display/be2b6826-2cdc-11f0-9e23-005056bf30b7/w:1280/p:16x9/000_36FW7Y7.jpg", "publishedAt": "2025-05-10T18:29:12Z", "content": "A Soviet-era spacecraft plunged to Earth on Saturday, more than a half-century after its failed launch to Venus. \r\nIts uncontrolled entry was confirmed by both the Russian Space Agency and European U… [+2604 chars]"}]}