{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Investor's Business Daily"}, "author": null, "title": "European Defense Stocks Rally As Military Worldview Shifts - Investor's Business Daily", "description": "European defense stocks rally as developments between President Trump and Russia prompt an emergency meeting. U.S. defense stocks rise.", "url": "https://www.investors.com/news/defense-stocks-trump-russia-ukraine-europe-emergency-meeting-lmt-rtx/", "urlToImage": "https://www.investors.com/wp-content/uploads/2025/02/BIZ02TrumpPutin021825news.jpg", "publishedAt": "2025-02-18T15:12:00Z", "content": "Information in Investors Business Daily is for informational and educational purposes only and should not be construed as an offer, recommendation, solicitation, or rating to buy or sell securities. … [+1064 chars]"}, {"source": {"id": null, "name": "The Daily Galaxy --Great Discoveries Channel"}, "author": null, "title": "Europe Approves First \"Disabled Astronaut\" for Long-Term ISS Mission—a Historic Leap for Space - The Daily Galaxy --Great Discoveries Channel", "description": "Space just took a historic leap forward, but not everyone is on board. A former Paralympian is about to break barriers that once seemed impossible. Despite skepticism, ESA has given the green light for something never done before.", "url": "https://dailygalaxy.com/2025/02/europes-first-disabled-astronaut-approved-for-long-term-iss-missions/", "urlToImage": "https://dailygalaxy.com/wp-content/uploads/2025/02/john-mcfall.jpg", "publishedAt": "2025-02-18T13:00:00Z", "content": "John McFall, the European Space Agency (ESA)s first para-astronaut, has been medically cleared for a long-duration stay aboard the International Space Station (ISS), ESAs Director of Human and Roboti… [+3527 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Tim Ross", "title": "Europe’s big guns sideline the EU to get real on Ukraine - POLITICO Europe", "description": "Macron’s mini-summit shunned Brussels’ normal obsession with consensus and revealed a new core with the region’s future in their hands.", "url": "https://www.politico.eu/article/sidelines-nato-europe-ukraine-politics-war-russia-emmanuel-macron-uk/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2025/02/18/GettyImages-2199610657.jpg", "publishedAt": "2025-02-18T03:00:00Z", "content": "This is not the way EU politics is meant to be conducted, but the Paris format lays bare the severity of the geopolitical shock that is currently roiling the continent. The streamlined summitry is a … [+1853 chars]"}]}