{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-England fined 30000 euros for use of laser pointer, booing Denmark anthem - The Star Online", "description": "(Reuters) -     UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding moment of their Euro 2020 semi-final, Europe's governing b…", "url": "https://www.thestar.com.my/sport/football/2021/07/10/soccer-england-fined-30000-euros-for-use-of-laser-pointer-booing-denmark-anthem", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/10/1215950.jpg", "publishedAt": "2021-07-10T11:49:00Z", "content": "(Reuters) - UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding mo… [+923 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Forget the Euros, Argentina v Brazil is weekend's big match - The Star Online", "description": "RIO DE JANEIRO (Reuters) -     Europe might be waiting for England against Italy in Sunday's Euro 2020 showpiece but there is an even bigger match to look forward to in South America as an older rivalry between two more successful teams kicks off in Saturday'…", "url": "https://www.thestar.com.my/sport/football/2021/07/09/soccer-forget-the-euros-argentina-v-brazil-is-weekend039s-big-match", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/09/1215224.jpg", "publishedAt": "2021-07-09T14:38:00Z", "content": "RIO DE JANEIRO (Reuters) - Europe might be waiting for England against Italy in Sunday's Euro 2020 showpiece but there is an even bigger match to look forward to in South America as an older rivalry … [+2864 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Deirdre O&#039;Donnell", "title": "OPPO designs what might be its take on the Android gaming phone - Notebookcheck.net", "description": "OPPO has registered schematics for a new phone with the European Union's Intellectual Property Office (EUIPO). It looks a lot like one of the new Reno6 series - except for the new chassis that seems intended to come across as much more \"gamer\" than the existi…", "url": "https://www.notebookcheck.net/OPPO-designs-what-might-be-its-take-on-the-Android-gaming-phone.549935.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/OPPO_gaming_smartphone_euipo.jpg", "publishedAt": "2021-07-08T20:14:21Z", "content": "OPPO has recently updated its Reno smartphones with the latest 6 series. Now, it seems the OEM is working on a new variant for the line - albeit one with a very different rear panel than usual. Accor… [+846 chars]"}]}