{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Jagmeet Singh", "title": "Samsung Galaxy Unpacked Event Set for August 11; Galaxy Z Fold 3, Galaxy Z Flip 3 Price Surface Again - Gadgets 360", "description": "Samsung Galaxy Unpacked 2021: Samsung on Wednesday confirmed that the event is taking place on August 11. The South Korean company is rumoured to unveil the Samsung Galaxy Z Fold 3 and Galaxy Z Flip 3 at its forthcoming event. Meanwhile, a European retailer h…", "url": "https://gadgets.ndtv.com/mobiles/news/samsung-z-fold-3-flip-launch-date-august-11-galaxy-unpacked-confirmed-price-leak-2491273", "urlToImage": "https://i.gadgets360cdn.com/large/samsung_galaxy_unpacked_august_11_2021_z_fold_3_flip_launch_teaser_1626846906042.jpg", "publishedAt": "2021-07-21T05:59:29Z", "content": "Samsung on Wednesday confirmed that it is hosting the next Galaxy Unpacked event on August 11. Alongside confirming the launch date, the South Korean company teased the launch of its two new foldable… [+3529 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Fossil reveals burrowing lifestyle of tiny dino, Europe News & Top Stories - The Straits Times", "description": "PARIS (AFP) - A finger-sized fossil from 308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures that may be the forerunners of reptiles, researchers revealed Wednesday (July 21).. Read more a…", "url": "https://www.straitstimes.com/world/europe/fossil-reveals-burrowing-lifestyle-of-tiny-dino", "urlToImage": "https://www.straitstimes.com/s3/files/styles/x_large/public/articles/2021/07/05/afph0507.jpg?itok=O2MjpGzg", "publishedAt": "2021-07-20T23:38:23Z", "content": "PARIS (AFP) - A finger-sized fossil from 308 million years ago unearthed in the United States gives tantalising clues to the habits of tiny dinosaur-like creatures that may be the forerunners of rept… [+3007 chars]"}, {"source": {"id": null, "name": "Thedailyguardian.net"}, "author": "Martin Woolridge", "title": "Martian methane mystery deepens with lack of signals - thedailyguardian.net", "description": "Madrid, 20 July. (European Press) - The European Space Agency and Roscosmos's Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the", "url": "https://thedailyguardian.net/martian-methane-mystery-deepens-with-lack-of-signals/", "urlToImage": null, "publishedAt": "2021-07-20T22:21:20Z", "content": "Madrid, 20 July. (European Press) – \r\n The European Space Agency and Roscosmos’s Exomars TGO (Trace Gas Orbiter) satellite detected no sign of methane in the Martian atmosphere at New data collection… [+4330 chars]"}]}