{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Abs-cbn.com"}, "author": "John Miller and Ludwig Burger, Reuters", "title": "How worried should we be about links of blood clots to AstraZeneca's vaccine? - ABS-CBN News", "description": "Europe's drug regulator on Wednesday said it had found a possible link between AstraZeneca's COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recommended people under 30 get an alternative COVID-19 vaccine if possible.", "url": "https://news.abs-cbn.com/spotlight/04/09/21/how-worried-should-we-be-about-links-of-blood-clots-to-astrazenecas-vaccine", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/tvpatrol/04/08/astrazeneca-s-vaccine_1.jpg", "publishedAt": "2021-04-09T11:00:00Z", "content": "ZURICH - Europe's drug regulator on Wednesday said it had found a possible link between AstraZeneca's COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recommended p… [+4958 chars]"}, {"source": {"id": null, "name": "Herald Sun"}, "author": "Shoba Rao, Angira Bharadwaj, Ellen Ransley, Zoe Smith and Nadia Salemme", "title": "AstraZeneca cut for under-50s due to blood clot fears - Chinchilla News", "description": "The Government has made a dramatic change to the AstraZeneca rollout following a number of people getting fatal blood clots in Europe.", "url": "https://www.heraldsun.com.au/coronavirus/covid19-australian-man-has-blood-clot-condition-after-astrazeneca-vaccine/news-story/1462d9c67cb20424a7f808ae6d6f2bde", "urlToImage": "https://media.apnarm.net.au/media/images/2021/04/08/jabs3-qcu8pu79twure25x5w2_ct1880x930.JPG", "publishedAt": "2021-04-08T07:03:00Z", "content": "Scott Morrison is holding his second press conference of the day, announcing changes to the use of the AstraZeneca vaccine in Australia.  \r\nThe Prime Minister, along with chief medical officer Profes… [+27075 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jonathan Keane", "title": "From California to Brazil: Europe's privacy laws have created a recipe for the world - CNBC", "description": "As Europe's sweeping GDPR laws approach their third anniversary, other jurisdictions around the world are taking cues from it to develop their own frameworks.", "url": "https://www.cnbc.com/2021/04/08/from-california-to-brazil-gdpr-has-created-recipe-for-the-world.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106768372-1603974256518-gettyimages-1229337652-PGONCHAR_3E1948.jpeg?v=1603974321", "publishedAt": "2021-04-08T05:32:00Z", "content": "In this photo illustration, Facebook CEO Mark Zuckerberg seen on a mobile screen as he remotely testifies during the hearing of U.S. Senate Committee on Commerce, Science, and Transportation titled \"… [+5356 chars]"}]}