{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Times"}, "author": "Marc Bennetts, Moscow", "title": "Russia tells Nato to back off or face a 'nightmare' amid spiralling crisis over Ukraine - The Times", "description": "Russia said yesterday that Nato expansion into eastern Europe risked plunging the world into a “nightmare” of military confrontation and accused Ukraine of send", "url": "https://www.thetimes.co.uk/article/russia-has-no-say-in-ukraine-joining-nato-moscow-told-t9q3r5vx5", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fcb086eae-535f-11ec-8d72-b8ab431649b1.jpg?crop=3333%2C1875%2C83%2C100&resize=1200", "publishedAt": "2021-12-03T00:00:00Z", "content": "Russia said yesterday that Nato expansion into eastern Europe risked plunging the world into a nightmare of military confrontation and accused Ukraine of sending more than 100,000 troops to its Donba… [+672 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Joanna Kakissis", "title": "Portuguese kids are suing European countries because of climate change - NPR", "description": "Adults \"can see us as serious or they can see us as a joke,\" one of the kids says. \"A lawsuit is not a joke,\" her brother adds. The European Court of Human Rights has fast-tracked their 2020 lawsuit.", "url": "https://www.npr.org/2021/12/02/1058350093/climate-change-portuguese-children-lawsuit", "urlToImage": "https://media.npr.org/assets/img/2021/11/23/_dsc0265-edit_wide-7de1f7d6519c9289cd43eb9237c7aaef3a529cb4.jpg?s=1400", "publishedAt": "2021-12-02T18:08:00Z", "content": "Sixteen-year-old Sofia (left) and 13-year-old André Oliveira stand in Parque da Paz in Lisbon. The siblings are two of six young people in Portugal who are suing the governments of Europe's most poll… [+9198 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "Theto Mahlakoana", "title": "Nigeria backs SA in criticism of travel bans over Omicron COVID variant - Eyewitness News", "description": "Several countries including the UK, US and Rwanda have moved to ban southern Africans from travelling to their shores after scientists in South Africa identified the new variant which has since been found in several European countries as well.", "url": "https://ewn.co.za/2021/12/02/nigeria-backs-sa-in-criticism-of-travel-bans-over-omicron-covid-variant", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/ttjl8va8liq2g28mm1bn", "publishedAt": "2021-12-02T07:48:24Z", "content": "Several countries including the UK, US and Rwanda have moved to ban southern Africans from travelling to their shores after scientists in South Africa identified the new variant which has since been … [+1768 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Olivia Kelleher", "title": "European Karate champion jailed for six years for sexual assault on college student - thejournal.ie", "description": "Rachel McElroy told the court she cried for hours after the attack as videos of which bystanders posted on social media.", "url": "https://www.thejournal.ie/cork-sexual-attacker-jailed-5616868-Dec2021/", "urlToImage": "https://img2.thejournal.ie/article/5616868/river/?height=400&version=5616894", "publishedAt": "2021-12-01T14:28:00Z", "content": "A EUROPEAN KARATE champion who sexually assaulted a young college student outside a nightclub and then lifted her up the road to further attack her has been jailed for six years.\r\nBagrat Kudzievi of … [+5902 chars]"}]}