{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Genetic sequencing reveals previously unknown human migration into Europe - Firstpost", "description": "The study also found that intermixing with Neanderthals in that period was more common than previously thought.", "url": "https://www.firstpost.com/tech/science/genetic-sequencing-reveals-previously-unknown-human-migration-into-europe-9507151.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2018/08/4307907897_ba4215984a_o-1.jpg", "publishedAt": "2021-04-08T04:33:10Z", "content": "Agence France-PresseApr 08, 2021 10:03:10 IST\r\nGenetic sequencing of human remains dating back 45,000 years has revealed a previously unknown migration into Europe and showed intermixing with Neander… [+4175 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "ALLISON LAI", "title": "M'sia to deliberate on use of AstraZeneca vaccine after EU findings, says Khairy - The Star Online", "description": "PETALING JAYA: Malaysia will decide on the use of the AstraZeneca vaccine for Covid-19 following a report by the European Medicines Agency (EMA) of rare blood clots being a possible side-effect, says Khairy Jamaluddin.", "url": "https://www.thestar.com.my/news/nation/2021/04/08/m039sia-to-deliberate-on-use-of-astrazeneca-vaccine-after-eu-findings-says-khairy", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/08/1105627.jpg", "publishedAt": "2021-04-08T03:04:00Z", "content": "PETALING JAYA: Malaysia will decide on the use of the AstraZeneca vaccine for Covid-19 following a report by the European Medicines Agency (EMA) of rare blood clots being a possible side-effect, says… [+1280 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Genome analysis reveals unknown ancient human migration in Europe - Malay Mail", "description": "TOKYO, April 8 — Genetic sequencing of human remains dating back 45,000 years has revealed a previously unknown migration into Europe and showed intermixing with Neanderthals in that period was more common than previously thought. The research is based on ana…", "url": "https://www.malaymail.com/news/life/2021/04/08/genome-analysis-reveals-unknown-ancient-human-migration-in-europe/1964769", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-04/20210408_Genetics_Analysis_AFP-seo.jpg", "publishedAt": "2021-04-08T02:32:32Z", "content": "This handout picture released on April 7, 2021, by the National Museum of Prague shows the skull of a modern human female individual from Zlaty kun. Picture courtesy of Prague National Museum via AFP… [+4198 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "Genome analysis reveals unknown ancient human migration in Europe - Macau Business", "description": "Genetic sequencing of human remains dating back 45,000 years has revealed a previously unknown migration into Europe .....", "url": "https://www.macaubusiness.com/genome-analysis-reveals-unknown-ancient-human-migration-in-europe-2/", "urlToImage": null, "publishedAt": "2021-04-08T01:57:31Z", "content": "Genetic sequencing of human remains dating back 45,000 years has revealed a previously unknown migration into Europe and showed intermixing with Neanderthals in that period was more common than previ… [+3914 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Agence France-Presse", "title": "AstraZeneca vaccine: What we know and don't know - ABS-CBN News", "description": "A European Medicines Agency (EMA) recommendation Wednesday that a dangerous type of blood clot should be listed as a \"very rare side effect\" of the AstraZeneca jab stopped just short of saying there is a causal link between the vaccine and the deadly conditio…", "url": "https://news.abs-cbn.com/spotlight/04/08/21/astrazeneca-vaccine-what-we-know-and-dont-know", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/reuters/03/18/coronavirus-germany.jpg", "publishedAt": "2021-04-08T00:07:00Z", "content": "PARIS - A European Medicines Agency (EMA) recommendation Wednesday that a dangerous type of blood clot should be listed as a \"very rare side effect\" of the AstraZeneca jab stopped just short of sayin… [+6659 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Claire O'Connell", "title": "'Is Muidne ESA': An Irish launch mission for the European Space Agency - The Irish Times", "description": "Do you know your satailít and your carr Mhars from your cóiméad or spásfort?", "url": "https://www.irishtimes.com/news/science/is-muidne-esa-an-irish-launch-mission-for-the-european-space-agency-1.4524901", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4524893&origw=1440", "publishedAt": "2021-04-08T00:00:35Z", "content": "A new, Irish-language brochure about European Space Agency (Gníomhaireacht Spáis na hEorpa) activities is helping to make Irelands involvement with space more visible.\r\nIs Muidne ESA (We Are ESA), is… [+3067 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sarah Polus", "title": "#GiveHerASeat trends after female EU leader not given chair on official visit | TheHill - The Hill", "description": "Social media users quickly adopted a new hashtag after two European Union leaders visited Turkey...", "url": "https://thehill.com/homenews/news/546992-giveheraseat-trends-after-female-eu-leader-not-given-chair-on-official-visit", "urlToImage": "https://thehill.com/sites/default/files/vonderleyen_getty121120.jpg", "publishedAt": "2021-04-07T20:29:53Z", "content": "Social media users quickly adopted a new hashtag after two European Union leaders visited Turkey and only one was offered a chair during a meeting.\r\nUrsula von der Leyen, president of the European Co… [+1910 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Ancient human migration into Europe revealed via genome analysis - The Guardian", "description": "Genetic sequencing dating back 45,000 years shows intermixing with Neanderthals more common than previously thought", "url": "https://amp.theguardian.com/science/2021/apr/07/ancient-human-migration-europe-neanderthals-genetic-sequencing", "urlToImage": null, "publishedAt": "2021-04-07T17:35:00Z", "content": "AnthropologyGenetic sequencing dating back 45,000 years shows intermixing with Neanderthals more common than previously thought\r\nGenetic sequencing of human remains dating back 45,000 years has revea… [+4446 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "EU drug regulator: 169 cases of rare brain blood clot identified in people who received AstraZeneca jabs - The Straits Times", "description": "The European drug regulator has received reports of 169 cases of a rare brain blood clot in people who received the AstraZeneca Covid-19 vaccine, a senior official said on Wednesday (April 7).. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/eu-drug-regulator-finds-link-between-astrazeneca-covid-19-vaccine-and-blood-clots", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/04/07/yq-azvac-07042021.jpg?itok=9YzVOvSL", "publishedAt": "2021-04-07T14:22:41Z", "content": "AMSTERDAM (REUTERS, AFP) - The European drug regulator has received reports of 169 cases of a rare brain blood clot in people who received the AstraZeneca Covid-19 vaccine, a senior official said on … [+1774 chars]"}]}