{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "European Union makes USB-C mandatory for phones - Times of India", "description": "is bad news for Apple and all other details Looking to take your career to the next level? Here’s how IIT Delhi’s Project Management programme will help! Blow for Apple: EU capitals, MEPs agree rules for single phone charger Google Play June system update imp…", "url": "https://timesofindia.indiatimes.com/videos/international/european-union-makes-usb-c-mandatory-for-phones/videoshow/92087324.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-92087324,imgsize-70286.cms", "publishedAt": "2022-06-08T14:30:23Z", "content": "Jun 08, 2022, 08:00PM ISTSource: TIMESOFINDIA.COMis bad news for Apple and all other details Looking to take your career to the next level? Heres how IIT Delhis Project Management programme will help… [+755 chars]"}, {"source": {"id": null, "name": "Eurogamer.net"}, "author": "Ed Nightingale", "title": "Portable electronic devices sold in the EU will require USB-C charging by autumn 2024 - Eurogamer.net", "description": "By autumn 2024, all portable electronic devices sold in the EU will need to use USB Type-C for charging. The European C…", "url": "https://www.eurogamer.net/portable-electronic-devices-sold-in-the-eu-will-require-usb-c-charging-by-autumn-2024", "urlToImage": "https://assets.reedpopcdn.com/iphone-charging.png/BROK/thumbnail/1600x900/format/jpg/quality/80/iphone-charging.png", "publishedAt": "2022-06-08T10:04:44Z", "content": "By autumn 2024, all portable electronic devices sold in the EU will need to use USB Type-C for charging.\r\nThe European Commission announced plans for this last year and has now issued a press release… [+1260 chars]"}, {"source": {"id": null, "name": "Cork Beo"}, "author": "Sara Rountree", "title": "Major change coming for iPhone users as EU backs change to phone chargers - Cork Beo", "description": "From 2024, every new device sold in Europe will need to use a common one-for-all charger connection", "url": "https://www.corkbeo.ie/news/major-change-coming-iphone-users-24172311", "urlToImage": "https://i2-prod.dublinlive.ie/incoming/article24164361.ece/ALTERNATES/s1200/0_GettyImages-1235497353.jpg", "publishedAt": "2022-06-08T09:56:38Z", "content": "Companies producing mobile devices will have to make some changes to the phones, laptops and cameras they sell in Europe after the EU Commission's decision to scrap every charger type bar one.\r\nFrom … [+1787 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Zacarian Sarao", "title": "PH signs labor agreements opening more job opportunities in Germany - INQUIRER.net", "description": "MANILA, Philippines — The Philippines signed two new labor accords with Germany providing better employment opportunities for migrant workers in the European country, said the Department of Labor", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2019/07/dole-620x323.jpg", "publishedAt": "2022-06-08T09:51:00Z", "content": "MANILA, Philippines The Philippines signed two new labor accords with Germany providing better employment opportunities for migrant workers in the European country, said the Department of Labor and E… [+2724 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Céimin Burke", "title": "Taoiseach tells European Parliament that Ireland strongly supports Ukraine joining EU - TheJournal.ie", "description": "Micheál Martin said Ireland supports the strongest possible sanctions on Russia, understanding that it will involve costs.", "url": "https://www.thejournal.ie/taoiseach-european-parliament-speech-ukraine-5785344-Jun2022/", "urlToImage": "https://img2.thejournal.ie/article/5785344/river/?height=400&version=5785359", "publishedAt": "2022-06-08T08:19:00Z", "content": "THE TAOISEACH HAS told the European Parliament that Ireland strongly supports Ukraines application to join the bloc.\r\nAddressing the parliament in Strasbourg today, Micheál Martin said membership of … [+2814 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "All sides must honour Good Friday Agreement, Taoiseach says at unveiling of John Hume bust - TheJournal.ie", "description": "Micheal Martin is in Strasbourg for a series of engagements in the Council of Europe, marking Ireland’s presidency of the body.", "url": "https://www.thejournal.ie/johhn-hume-bust-european-parliament-5784502-Jun2022/", "urlToImage": "https://img2.thejournal.ie/article/5784502/river/?height=400&version=5784503", "publishedAt": "2022-06-07T17:05:00Z", "content": "Updated 1 hour ago\r\nALL SIDES MUST honour the Good Friday Agreement, the Taoiseach has said at the unveiling of a bust of Nobel laureate John Hume at the European Parliament in Strasbourg.\r\nMicheál M… [+3614 chars]"}]}