{"articles": [{"author": "Samuel Meade", "content": "Sergio Aguero will depart Manchester City after a decade this summer with his contract expiring.\r\n The Premier League leaders confirmed the exit of one of their all-time greats on Monday night. \r\nAgu… [+3192 chars]", "description": "Sergio Aguero's Man City departure has been confirmed and it is now a case of where he goes with clubs in Europe, America and South America all linked with his signature", "publishedAt": "2021-03-30T06:00:00Z", "source": {"id": null, "name": "Mirror Online"}, "title": "5 potential destinations for Sergio Aguero after Man City exit confirmed - Mirror Online", "url": "https://www.mirror.co.uk/sport/football/transfer-news/sergio-aguero-next-club-latest-23818277", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23817989.ece/ALTERNATES/s1200/0_FBL-ENG-PR-MAN-CITY-SHEFFIELD-UTD.jpg"}, {"author": "Rasheed Sobowale", "content": "Libya’s coastguard intercepted almost 1,000 Europe-bound migrants off its western coast in two days, the International Organization for Migration said on Monday.\r\nThe North African country is a major… [+841 chars]", "description": "Libya’s coastguard intercepted almost 1,000 Europe-bound migrants off its western coast in two days, the International Organization for Migration said on Monday. The North African country is a major route for migrants trying to reach Europe via the Mediterran…", "publishedAt": "2021-03-30T03:37:35Z", "source": {"id": null, "name": "Vanguard"}, "title": "Libya stops 1,000 Europe-bound migrants in two days - Vanguard", "url": "https://www.vanguardngr.com/?p=1562462", "urlToImage": "https://www.vanguardngr.com/wp-content/uploads/2020/03/Libya-300x169.png"}, {"author": "Christy Somos", "content": "TORONTO -- \r\nCanadas National Advisory Committee on Immunization (NACI) has recommended pausing administration of the AstraZeneca coronavirus vaccine to those under the age of 55 due to fears of reci… [+7124 chars]", "description": "Canada's National Advisory Committee on Immunization has recommended pausing administration of the AstraZeneca coronavirus vaccine to those under the age of 55 due to reports of blood clots occurring in vaccine recipients in Europe.", "publishedAt": "2021-03-30T01:49:00Z", "source": {"id": null, "name": "Ctvnews.ca"}, "title": "The AstraZeneca vaccine, blood clots and VIPIT: What you need to know - CTV News", "url": "https://www.ctvnews.ca/health/coronavirus/the-astrazeneca-vaccine-blood-clots-and-vipit-what-you-need-to-know-1.5367509", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5367516.1617068157!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "europe"}