{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Global News"}, "author": "Kathryn Mannie", "title": "Monkeypox cases are now suspected in U.K., Spain, Portugal — here’s what you need to know - Global News", "description": "There are 13 confirmed cases of monkeypox in Europe, with 23 more cases being tested as potential infections.", "url": "https://globalnews.ca/news/8844568/monkeypox-uk-spain-portugal/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/05/GettyImages-1144024289.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2022-05-18T15:27:37Z", "content": "Cases of monkeypox are emerging in the U.K., Spain and Portugal, raising concerns about further transmission of the monkeypox virus.\r\nHealth officials in Spain issued a national alert today to guaran… [+6524 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Saphora Smith", "title": "EU proposes making solar panels mandatory on all new buildings - The Independent", "description": "New proposal aims to rapidly reduce dependence on Russian fossil and supercharge Europe’s transition to green energy", "url": "https://www.independent.co.uk/climate-change/news/solar-panels-new-buildings-eu-mandatory-b2081732.html", "urlToImage": "https://static.independent.co.uk/2022/05/18/12/iStock-170456526.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-05-18T13:53:25Z", "content": "Solar panels would be mandatory on all new buildings in the European Union under a new proposal aimed at ending its reliance on Russian fossil fuels by 2027 and supercharging its transition to green … [+4962 chars]"}, {"source": {"id": null, "name": "Daily Record"}, "author": "Gavin Berry, Mark Pirie, Robbie Copeland, Robbie Hanratty", "title": "Rangers vs Eintracht Frankfurt LIVE as fans George Square celebrations prospect ended by barricades - Daily Record", "description": "The game of games is here as the Blue Sea of Ibrox descends on Spain in search of a first European trophy in 50 years.", "url": "https://www.dailyrecord.co.uk/sport/football/football-news/rangers-vs-eintracht-frankfurt-live-26992993", "urlToImage": "https://i2-prod.dailyrecord.co.uk/sport/football/football-news/article26993136.ece/ALTERNATES/s1200/0_01.jpg", "publishedAt": "2022-05-18T13:25:45Z", "content": "What can you say about a game that has had Rangers supporters on tenterhooks over the past fortnight? \r\nA heady mix of nerves and excitement is about to come spilling out as Ibrox diehards believe th… [+1381 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Huawei Mate Xs 2: Flagship foldable smartphone unveiled outside China for €1999 with a Snapdragon 888 4G and a 120 Hz display - Notebookcheck.net", "description": "Huawei has unveiled the Mate Xs 2 in Europe, the successor to not only the Mate Xs, but also to the Mate X2. Equipped with a Snapdragon 888 4G chipset, the Mate Xs 2 has a 7.8-inch OLED display that folds around its chassis to form a smaller 6.5-inch panel. T…", "url": "https://www.notebookcheck.net/Huawei-Mate-Xs-2-Flagship-foldable-smartphone-unveiled-outside-China-for-EUR1-999-with-a-Snapdragon-888-4G-and-a-120-Hz-display.620526.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/HUAWEI_Mate_Xs_2_KSP_Shot_20_4.jpg", "publishedAt": "2022-05-18T12:52:20Z", "content": "Huawei has announced the Mate Xs 2 outside China, its first foldable smartphone since the P50 Pocket. However, the Mate Xs 2 succeeds the Mate X2, albeit with the Mate X's and Mate Xs' form factor. L… [+1540 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Peter Fabricius", "title": "WAR IN EUROPE: Former Russian military officer says Ukraine conflict will only get worse — for Russia - Daily Maverick", "description": "One of Russia’s top defence commentators, a former military officer, has warned his country to brace itself for an ever harder war against a resurgent force of one million well-armed and highly motivated Ukrainians.", "url": "https://www.dailymaverick.co.za/article/2022-05-17-former-russian-military-officer-says-ukraine-conflict-will-only-get-worse-for-russia/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/05/GettyImages-1397531513.jpg?w=1280", "publishedAt": "2022-05-17T19:49:47Z", "content": "Almost all the Russian pundit commentary has been obsequious, presenting the war in Ukraine as going well. But in a very rare moment of brutal candour on Russian state TV this week, former colonel Mi… [+7578 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "A new law unchains fusion energy - Phys.org", "description": "Physicists at EPFL, within a large European collaboration, have revised one of the fundamental laws that has been foundational to plasma and fusion research for over three decades, even governing the design of megaprojects like ITER. The update shows that we …", "url": "https://phys.org/news/2022-05-law-unchains-fusion-energy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/plasma.jpg", "publishedAt": "2022-05-17T17:13:17Z", "content": "Physicists at EPFL, within a large European collaboration, have revised one of the fundamental laws that has been foundational to plasma and fusion research for over three decades, even governing the… [+6584 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Could Finland and Sweden's bid to join NATO spell the end of 'neutral' European countries? - ABC News", "description": "Finland and Sweden's announcement that they intend to join NATO has dashed Vladimir Putin's hopes his war in Ukraine would deter expansion of the military alliance. But could it also mark the end of neutral states in Europe?", "url": "https://www.abc.net.au/news/2022-05-17/finland-sweden-nato-european-neutrality/101073248", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e22723f147c5057b9ba2391ace4ef553?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2022-05-17T06:38:17Z", "content": "Finland and Sweden have announced they intend to join the NATO military alliance, a major shift away from their policy of military non-alignment. \r\nSecurity concerns over Russia's invasion of Ukraine… [+6708 chars]"}]}