{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Financial Times"}, "author": "Mehul Srivastava, Andrew England", "title": "Israel warns of ‘prolonged campaign’ against Iran as Europeans push for truce - Financial Times", "description": "Foreign ministers hold Geneva talks in bid to end war and keep US out of conflict", "url": "https://www.ft.com/content/dddd5869-3f5a-4cff-ae77-cf78c27ae295", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2dc8dded-e22e-4c77-9e79-dab372dd467d.jpg?source=next-barrier-page", "publishedAt": "2025-06-20T17:29:24Z", "content": "White House Watch newsletter\r\nSign up for your free, indispensable guide to what Trumps second term means for Washington, business and the world."}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kelsey Ables, Victoria Bisset, Angie Orellana Hernandez, Joshua Yang, Frances Vinall, Natalia Abbakumova, Lior Soroka, Adam Taylor, Sammy Westfall, Tim Meko, Leo Sands, Ellen Francis, Washington Post staff, Mary Ilyushina, Heidi Levine, Julie Yoon, Amaya Verde, Álvaro Valiño, N. Kirkpatrick, Ilan Ben Zion, Natalie Allison", "title": "Israel-Iran live updates: Trump weighs negotiations; European ministers to meet for Iran talks - The Washington Post", "description": "President Donald Trump said he will wait up to two weeks to decide whether to attack Tehran’s nuclear program, as Israel and Iran continued to trade fire.", "url": "https://www.washingtonpost.com/world/2025/06/20/israel-iran-strikes-live-us-trump/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2OHLWHWHEIKR7DDMNHJFZ5VTFM_size-normalized.JPG&w=1440", "publishedAt": "2025-06-20T14:14:37Z", "content": "Moshe Carmon, a resident of the Israeli city of Beersheba, told The Washington Post that his apartment, located on the first floor of a residential building, was damaged by Fridays Iranian missile la… [+267 chars]"}]}