{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Newly introduced butterfly could become widespread in Canada - Science Daily", "description": "This summer, if you see a butterfly with wings that are blue on top with orange spots underneath, you may have crossed paths with a male European Common Blue (or Polyommatus icarus), a newly introduced species in Canada. Could it be a fluke? Probably not, acc…", "url": "https://www.sciencedaily.com/releases/2021/07/210719110317.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-07-20T01:23:49Z", "content": "This summer, if you see a butterfly with wings that are blue on top with orange spots underneath, you may have crossed paths with a male European Common Blue (or Polyommatus icarus), a newly introduc… [+3747 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: Asia follows global shares slide amid recovery fears - BBC News", "description": "Stocks in Asia, the US, the UK and Europe fall on concerns that rising cases may slow a recovery.", "url": "https://www.bbc.co.uk/news/business-57885183", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10C01/production/_119490686_whatsubject.jpg", "publishedAt": "2021-07-20T00:57:11Z", "content": "image copyrightGetty Images\r\nStock markets across the world have dropped on fears that increasing numbers of Covid cases will hamper economic recovery.\r\nIn Asia, Japan's benchmark Nikkei 225 index op… [+2512 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "UK opts not to vaccinate most under-18s against COVID-19 - Devdiscourse", "description": "But the JCVI will continue to review new data, and consider whether to recommend vaccinating under-18s without underlying health conditions at a future date. The move puts the UK at odds with France and several other European countries, which have decided to …", "url": "https://www.devdiscourse.com/article/health/1657821-uk-opts-not-to-vaccinate-most-under-18s-against-covid-19", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_18_59_53_6525806.jpg?width=920&format=jpeg", "publishedAt": "2021-07-19T16:31:02Z", "content": "The British government decided on Monday not to inoculate most children and teenagers against COVID-19 until more data on the available vaccines becomes available. Children as young as 12 with severe… [+1548 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "EPL: Chelsea ready to sell Timo Werner after Giroud’s exit - Daily Post Nigeria", "description": "Chelsea is ready to sell Timo Werner this summer, according to Sky Germany. The Blues have been touting the 25-year-old to top European clubs, in a bid to find a potential suitor. Should Werner leave, Chelsea is planning to use the money to fund their pursuit…", "url": "https://dailypost.ng/2021/07/19/epl-chelsea-ready-to-sell-timo-werner-after-girouds-exit/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/10/Timo-Werner.jpeg", "publishedAt": "2021-07-19T16:11:44Z", "content": "Chelsea is ready to sell Timo Werner this summer, according to Sky Germany.\r\nThe Blues have been touting the 25-year-old to top European clubs, in a bid to find a potential suitor.\r\nShould Werner lea… [+573 chars]"}]}