{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Ukraine, Russia sign deal to reopen grain export ports as war rages on - Times of India", "description": "Europe News: Russia and Ukraine signed a landmark deal on Friday to reopen Ukrainian Black Sea ports for grain exports, raising hopes that an international food cr", "url": "https://timesofindia.indiatimes.com/world/europe/ukraine-russia-sign-deal-to-reopen-grain-export-ports-as-war-rages-on/articleshow/93059108.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-93059139,width-1070,height-580,imgsize-93620,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-07-22T15:18:00Z", "content": "Russia blockade of Ukrainian grain a war crime, says top EU diplomatBRUSSELS: Russia is committing a war crime by blocking the export of millions of tonnes of Ukrainian grain, the EU's foreign policy… [+167 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Supermassive black hole influences star formation - Phys.org", "description": "A European team of astronomers led by Professor Kalliopi Dasyra of the National and Kapodistrian University of Athens, Greece, under participation of Dr. Thomas Bisbas, University of Cologne modeled several emission lines in Atacama Large Millimeter Array (AL…", "url": "https://phys.org/news/2022-07-supermassive-black-hole-star-formation.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/4-blackhole.jpg", "publishedAt": "2022-07-22T14:30:03Z", "content": "A European team of astronomers led by Professor Kalliopi Dasyra of the National and Kapodistrian University of Athens, Greece, under participation of Dr. Thomas Bisbas, University of Cologne modeled … [+4541 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "EU launches new legal procedures against UK over Northern Ireland - Al Jazeera English", "description": "The European Commission’s move comes after the UK legislature cleared a bill to scrap parts of post-Brexit trade deal.", "url": "https://www.aljazeera.com/news/2022/7/22/eu-launches-new-legal-procedures-against-uk-over-northern-ireland", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/07/h_57749289.jpg?resize=1200%2C630", "publishedAt": "2022-07-22T12:23:59Z", "content": "The European Unions executive arm has launched four new legal procedures against the United Kingdom after the British parliaments lower house cleared a bill to scrap some of the rules governing post-… [+2193 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Michael Janda", "title": "ECB raises interest rates for the first time in more than a decade, ASX set for modest gains - ABC News", "description": "The European Central Bank has raised interest rates for the first time in more than a decade, with financial markets generally taking the move in their stride.", "url": "https://www.abc.net.au/news/2022-07-22/ecb-raises-rates-shares-set-to-rise/101260100", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/216467a360cd69df7e5edeeb00f8ccbf?impolicy=wcms_crop_resize&cropH=1689&cropW=3000&xPos=0&yPos=265&width=862&height=485", "publishedAt": "2022-07-21T22:57:22Z", "content": "The European Central Bank (ECB) has raised interest rates for the first time in more than a decade, with markets taking the move in their stride.\r\nKey points:\r\n<ul><li>The ECB's key interest rate has… [+3393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Russian and European astronauts conduct rare joint spacewalk - CNN", "description": "Two astronauts — one European and one Russian — exited the airlock on the International Space Station for a spacewalk on Thursday, marking the first time in more than 20 years such a joint endeavor has taken place.", "url": "https://www.cnn.com/2022/07/21/tech/spacewalk-iss-esa-russia-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220721124251-04-iss-spacewalk-0721-screenshot-super-tease.jpg", "publishedAt": "2022-07-21T17:17:00Z", "content": "New York (CNN Business)Two astronauts one European and one Russian exited the airlock on the International Space Station for a spacewalk on Thursday, marking the first time in more than 20 years such… [+1560 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Italy's Draghi resigns, spelling trouble for nation, Europe - CTV News", "description": "Italy is headed for an early election after its president accepted Premier Mario Draghi's resignation Thursday and decided there was no possibility for cobbling together another government following the rapid collapse of the ruling coalition.", "url": "https://www.ctvnews.ca/world/italy-heads-to-early-election-after-draghi-s-coalition-fails-1.5996352", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/21/mario-draghi-1-5996353-1658397606918.jpg", "publishedAt": "2022-07-21T10:00:00Z", "content": "ROME - \r\nItaly is headed for an early election after its president accepted Premier Mario Draghi's resignation Thursday and decided there was no possibility for cobbling together another government f… [+5487 chars]"}]}