{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Deadline"}, "author": "Nancy Tartaglione", "title": "‘Babylon’ Trailer: Brad Pitt & Margot Robbie Party Like It’s 1920s Hollywood In Damien Chazelle Epic - Deadline", "description": "First at April’s CinemaCon, and then June’s CineEurope, exhibition got a glimpse of Damien Chazelle’s upcoming Hollywood-set period extravaganza Babylon. On Monday, Paramount showed off the trailer at TIFF, and today dropped it for the rest of the world – che…", "url": "https://deadline.com/2022/09/babylon-trailer-brad-pitt-margot-robbie-damien-chazelle-video-1235117130/", "urlToImage": "https://deadline.com/wp-content/uploads/2022/09/bab23073r4.jpg?w=1024", "publishedAt": "2022-09-13T14:02:00Z", "content": "First at April’s CinemaCon, and then June’s CineEurope, exhibition got a glimpse of Damien Chazelle’s upcoming Hollywood-set period extravaganza Babylon. On Monday, Paramount showed off the trailer a… [+1709 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What to expect from the rand in the coming months - BusinessTech", "description": "South Africa’s rand is expected to be beaten around by global markets in the coming months, as inflationary and interest rate pressure from central banks in the US and the European Union continue to dominate global market movements.", "url": "https://businesstech.co.za/news/finance/624959/what-to-expect-from-the-rand-in-the-coming-months-3/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/Rand-e1601546534500.png", "publishedAt": "2022-09-12T14:47:50Z", "content": "The rand is expected to be beaten around by global markets in the coming months, as inflationary and interest rate pressure from central banks in the US and the European Union continue to dominate gl… [+4226 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Swedish voters boost anti-immigration party amid high crime - CTV News", "description": "A populist anti-immigration party has surged to become Sweden's second-largest political force after a national election dominated by fears of gang violence, which has given the once-safe Scandinavian country one of Europe's highest levels of gun violence.", "url": "https://www.ctvnews.ca/world/swedish-voters-boost-anti-immigration-party-amid-high-crime-1.6064860", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/9/12/sweden-democrats-leader-jimmie-akesson-1-6064869-1662991177277.jpg", "publishedAt": "2022-09-12T14:01:16Z", "content": "STOCKHOLM - \r\nA populist anti-immigration party has surged to become Sweden's second-largest political force after a national election dominated by fears of gang violence, which has given the once-sa… [+5035 chars]"}]}