{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Previous COVID-19 Infection – But NOT Vaccination – Improves Performance of Antibodies - SciTechDaily", "description": "Researchers also found that previously-infected patients with obesity, contrary to expectations, had a higher and more sustained immune response. New research to be presented at this year’s European Congress of Clinical Microbiology & Infectious Diseases (ECC…", "url": "https://scitechdaily.com/previous-covid-19-infection-but-not-vaccination-improves-performance-of-antibodies/", "urlToImage": "https://scitechdaily.com/images/COVID-19-Coronvirus-Vaccine-Illustration.jpg", "publishedAt": "2022-02-10T23:00:45Z", "content": "ByEuropean Society of Clinical Microbiology and Infectious DiseasesFebruary 10, 2022\r\nResearchers also found that previously-infected patients with obesity, contrary to expectations, had a higher and… [+6075 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "International trade bans imposed on N.L. and N.S. poultry after avian flu kills 1000s of birds - CBC.ca", "description": "The European Union and nine countries, including the U.S., have put trade restrictions on some poultry products from two Atlantic Canadian provinces after a strain of avian flu that's deadly for birds was identified at a Nova Scotian turkey farm.", "url": "https://www.cbc.ca/news/canada/newfoundland-labrador/bird-flu-trade-bans-1.6346229", "urlToImage": "https://i.cbc.ca/1.6203552.1633631904!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_620/turkey-barn.jpg", "publishedAt": "2022-02-10T20:16:53Z", "content": "The European Union and nine countries, including the U.S., have put trade restrictions on some poultry products from two Atlantic Canadian provinces after a deadly strain of avian flu was identified … [+4595 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Agency Report", "title": "EU unveils €150bn investment plan for Africa - Punch Newspapers", "description": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent's biggest and \"most reliable\" partner.", "url": "https://punchng.com/eu-unveils-e150bn-investment-plan-for-africa/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2019/07/16193245/Ursula-von-der-Leyen.png", "publishedAt": "2022-02-10T20:00:03Z", "content": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent’s biggest and “most reliable” partner.\r… [+3441 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Adam Izdebski, Alessia Masi, Timothy P Newfield", "title": "The Black Death was not as widespread or catastrophic as long thought – new study - The Conversation AU", "description": "The Black Death is believed to have been the most devastating pandemic in Europe’s history. Now paleoecologists and historians have cast doubt on how bad it was.", "url": "https://theconversation.com/the-black-death-was-not-as-widespread-or-catastrophic-as-long-thought-new-study-175461", "urlToImage": "https://images.theconversation.com/files/442457/original/file-20220125-15-wg6fjz.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-10T16:03:10Z", "content": "In popular imagination, the Black Death is the most devastating pandemic to have ever hit Europe. Between 1346 and 1353, plague is believed to have reached nearly, if not every, corner of the contine… [+6955 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Pictured: Russia and Belarus hold major war games in 'violent gesture' to Europe - Telegraph.co.uk", "description": "Some 30,000 Russian combat troops plus weapons and military equipment have been deployed for the 10-day war games", "url": "https://www.telegraph.co.uk/world-news/2022/02/10/pictured-russia-belarus-hold-major-war-games-violent-gesture/", "urlToImage": "https://img.youtube.com/vi/EIohtlIAb6A/maxresdefault.jpg", "publishedAt": "2022-02-10T11:30:00Z", "content": "\"This is probably the most dangerous moment, I would say, in the course of the next few days, in what is the biggest security crisis that Europe has faced for decades, and we've got to get it right,\"… [+747 chars]"}, {"source": {"id": null, "name": "Wales Online"}, "author": "Matt Gibson", "title": "Johnson flies to Poland as a thousand UK troops go on standby for eastern Europe - Devon Live", "description": "Meanwhile, Foreign Secretary Liz Truss is in Moscow for talks with her counterpart Sergei Lavrov", "url": "https://www.walesonline.co.uk/news/uk-news/boris-johnson-flies-poland-more-23045435", "urlToImage": "https://i2-prod.nottinghampost.com/incoming/article6431669.ece/ALTERNATES/s1200/0_escenic-43.jpg", "publishedAt": "2022-02-10T05:00:27Z", "content": "One thousand British troops are being put on standby in case of a humanitarian crisis in eastern Europe if the current Russian military build-up leads to war, Downing Street has announced.\r\nBoris Joh… [+3297 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Frank Jordans", "title": "Cave Fossils Show Humans Came to France 10,000 Years Earlier Than Thought - NBC 6 South Florida", "description": "BERLIN (AP) — A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latter were thought to have reached that part of Europe, a new …", "url": "https://apnews.com/642207a40773a229ea65925574eede2b", "urlToImage": "https://storage.googleapis.com/afs-prod/media/810c790c89734f798f470f9687ab25f3/3000.jpeg", "publishedAt": "2022-02-10T02:06:01Z", "content": "BERLIN (AP) A hillside dwelling overlooking the picturesque Rhone Valley in southern France proved irresistible for our ancestors, attracting both Neanderthals and modern humans long before the latte… [+3295 chars]"}]}