{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Awanireview.com"}, "author": "Mandy Sims", "title": "A physicist from Paimpol was shortlisted for the European Inventor Prize - Awani Review", "description": "Michael Tanter and partner Matthias Fink have been working in the field of medical imaging and ultrasound therapy for over thirty years. In particular,", "url": "https://www.awanireview.com/a-physicist-from-paimpol-was-shortlisted-for-the-european-inventor-prize/", "urlToImage": null, "publishedAt": "2021-06-13T09:28:09Z", "content": "Michael Tanter and partner Matthias Fink have been working in the field of medical imaging and ultrasound therapy for over thirty years. In particular, they and their team developed an ultra-fast ult… [+2254 chars]"}, {"source": {"id": null, "name": "Commentaryboxsports.com"}, "author": "Faye Welch", "title": "Europe will attack Venus with the EnVision mission - Commentary Box Sports", "description": "EnVision will be the European Space Agency's next orbiter on its way to Venus, which will provide a global view of the planet from the inner core to the", "url": "https://commentaryboxsports.com/europe-will-attack-venus-with-the-envision-mission/", "urlToImage": null, "publishedAt": "2021-06-13T05:31:23Z", "content": "EnVision will be the European Space Agency’s next orbiter on its way to Venus, which will provide a global view of the planet from the inner core to the upper atmosphere. The goal is to understand ho… [+5495 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "AFP", "title": "Rare earth metals at the heart of China's rivalry with US, Europe - Deccan Herald", "description": "What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones? At a time of frequent geopolitical friction among those three powers, Washington and Brussels want to av…", "url": "https://www.deccanherald.com/business/rare-earth-metals-at-the-heart-of-chinas-rivalry-with-us-europe-996927.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/06/13/istock-531546832-1-996927-1623557475.jpg", "publishedAt": "2021-06-13T04:11:15Z", "content": "What if China were to cut off the United States and Europe from access to rare minerals that are essential to electric vehicles, wind turbines and drones?\r\nAt a time of frequent geopolitical friction… [+4174 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "EU adds another rare blood condition as side effect of AstraZeneca shot - MENAFN.COM", "description": "June 12 (Reuters) – Europe’s drug regulator on Friday identified another very rare blood condition as a potential side effect of AstraZen", "url": "https://menafn.com/1102258274/EU-adds-another-rare-blood-condition-as-side-effect-of-AstraZeneca-shot", "urlToImage": "https://menafn.com/updates/pr/2021-06/12/N_80f08image_story.jpg", "publishedAt": "2021-06-12T18:13:17Z", "content": "(MENAFN - NewsIn.Asia)\r\nJune 12 (Reuters) – Europe’s drug regulator on Friday identified another very rare blood condition as a potential side effect of AstraZeneca’s COVID-19 vaccine and said it was… [+3849 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Top 10 best and worst cities to live in - BusinessTech", "description": "Covid-19 is shattering Europe’s claims to have some of the world’s most liveable cities, according to a new ranking.", "url": "https://businesstech.co.za/news/wealth/497085/top-10-best-and-worst-cities-to-live-in/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Auckland-e1623398693457.jpeg", "publishedAt": "2021-06-12T13:01:08Z", "content": "Covid-19 is shattering Europes claims to have some of the worlds most liveable cities, according to a new ranking.\r\nVienna, which topped the Economist Intelligence Units index from 2018 to 2020, tumb… [+2809 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Jill Lawless", "title": "European Union, U.K. Brexit spat over Northern Ireland clouds G7 summit - Globalnews.ca", "description": "The spat has drawn in U.S. President Joe Biden, who is concerned about the potential threat to Northern Ireland's peace accord.", "url": "https://globalnews.ca/news/7944466/eu-uk-brexit-northern-ireland/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/06/1000-90.jpeg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-06-12T12:33:46Z", "content": "British Prime Minister Boris Johnson held meetings with German Chancellor Angela Merkel and French President Emmanuel Macron on Saturday on the sidelines of a G-7 summit, as post-Brexit turbulence st… [+2537 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Tasneem Akolawala", "title": "Realme Laptop, Tablet Arrival Alongside Realme GT 5G Phone on June 15 Teased - Gadgets 360", "description": "Realme CEO for India and Europe Madhav Sheth took to Twitter to announce the arrival of a laptop and a tablet from the company in new ‘product categories’ alongside the Realme GT 5G launch on June 15. His tweet reads, “We've been working and hinting about som…", "url": "https://gadgets.ndtv.com/laptops/news/realme-laptop-tablet-launch-date-june-15-teaser-gt-5g-phone-madhav-sheth-2462264", "urlToImage": "https://i.gadgets360cdn.com/large/realme_laptop_tablet_teaser_1623485153568.jpg", "publishedAt": "2021-06-12T08:09:51Z", "content": "Realme GT 5G is all set to launch at a global event on June 15. Alongside the phone, the company is also largely anticipated to launch a new laptop and tablet, expanding its portfolio into new catego… [+1425 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "The European Space Agency has approved the Venus Exploration Mission - SwordsToday.ie", "description": "Posted by: 2021-06-11 12:25 Venus. NASA (\"ScanPix\" / AP) Neuter. BNS The European Space Agency (ESA) at the beginning of a decade confirmed plans to", "url": "https://swordstoday.ie/the-european-space-agency-has-approved-the-venus-exploration-mission/", "urlToImage": "https://swordstoday.ie/wp-content/uploads/2021/06/The-European-Space-Agency-has-approved-the-Venus-Exploration-Mission.jpeg", "publishedAt": "2021-06-11T20:53:41Z", "content": "Venus. NASA (“ScanPix” / AP) Neuter.\r\nAccording to a report published on the agency’s website, the mission will focus primarily on the planet’s surface relief, atmosphere, geography, structure and gr… [+952 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "EU drugs regulator lists another rare blood condition as possible AstraZeneca Covid-19 vaccine side effect - RT", "description": "The European Medicines Agency’s (EMA) safety committee has added another rare blood condition to the potential side effects of AstraZeneca’s vaccine, as the UK regulator weighs precautionary advice over capillary leak syndrome.", "url": "https://www.rt.com/news/526340-eu-drugs-regulator-astrazeneca-covid-vaccine/", "urlToImage": "https://cdni.rt.com/files/2021.06/article/60c38d5a2030271ed656941d.JPG", "publishedAt": "2021-06-11T16:28:00Z", "content": "The EMA’s addition of the very rare syndrome to its list of potential side effects for the AstraZeneca Covid-19 jab comes as the regulator also examines reports of heart inflammation in recipients of… [+2055 chars]"}]}