{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Non-native species likely to continue spreading in North America, Australia and Europe - Science Daily", "description": "Naturalized species, which are not native but have established themselves in new locations, have the potential to spread even further to suitable habitats in many parts of the world, reports a new study.", "url": "https://www.sciencedaily.com/releases/2023/11/231114143909.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2023-11-14T22:18:15Z", "content": "Naturalized species, which are not native but have established themselves in new locations, have the potential to spread even further to suitable habitats in many parts of the world, reports a new st… [+2040 chars]"}, {"source": {"id": null, "name": "SpaceNews"}, "author": "Jeff Foust", "title": "European governments and companies seek changes to georeturn - SpaceNews", "description": "European government and industry officials say the policy of “georeturn” needs to be adjusted to make Europe’s launch industry more competitive.", "url": "https://spacenews.com/european-governments-and-companies-seek-changes-to-georeturn/", "urlToImage": "https://spacenews.com/wp-content/uploads/2023/11/baptiste-spacetechexpo.jpg", "publishedAt": "2023-11-14T22:02:50Z", "content": "BREMEN, Germany European government and industry officials say the policy of georeturn, which guarantees nations receive contracts in proportion to their investments, needs to be adjusted, particular… [+3671 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Blast from the past: gamma-ray burst strikes Earth from distant exploding star - European Space Agency", "description": "An enormous burst of gamma rays, detected by ESA’s Integral space telescope, has struck Earth. The blast caused a significant disturbance in our planet’s ionosphere. Such disturbances are usually associated with energetic particle events on the Sun but this o…", "url": "https://www.esa.int/Science_Exploration/Space_Science/Integral/Blast_from_the_past_gamma-ray_burst_strikes_Earth_from_distant_exploding_star", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2023/11/gamma-ray_burst_strikes_earth_from_distant_exploding_star/25181307-1-eng-GB/Gamma-ray_burst_strikes_Earth_from_distant_exploding_star_pillars.jpg", "publishedAt": "2023-11-14T16:01:27Z", "content": "Science &amp; Exploration14/11/20232923 views38 likes\r\nAn enormous burst of gamma rays, detected by ESAs Integral space telescope, has struck Earth. The blast caused a significant disturbance in our … [+6309 chars]"}]}