{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Thecherawchronicle.com"}, "author": "Gaylord Greenwood", "title": "The ancients in Italy made an amazing set of tools from elephant bones - Cheraw Chronicle", "description": "About 400,000 years ago, Neanderthals (neanderthal man) After all, it just appeared in Europe. So...", "url": "https://www.thecherawchronicle.com/the-ancients-in-italy-made-an-amazing-set-of-tools-from-elephant-bones/", "urlToImage": null, "publishedAt": "2021-09-01T00:09:03Z", "content": "About 400,000 years ago, Neanderthals (neanderthal man) After all, it just appeared in Europe. So Villa suspects that the prehistoric people of Castel di Guido were Neanderthals. \r\nAbout 400,000 year… [+864 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "LLANESCA T. PANTI, GMA News", "title": "Duterte on 33,000 COVID-19 deaths: Hindi masyado ganoon karami - GMA News Online", "description": "&ldquo;Hirap ang Amerika ngayon. Ang Europe is suffering from a&hellip;maraming mas namatay, Turkey, maraming patay. Saudi Arabia, mas marami ang patay. Ito atin, hawa lang (America is struggling, Europe is suffering from more deaths, Turkey, they have more d…", "url": "https://www.gmanetwork.com/news/news/nation/801526/duterte-on-33-000-covid-19-deaths-hindi-masyado-ganoon-karami/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/08/duts_2021_08_31_10_26_34.jpg", "publishedAt": "2021-08-31T08:13:31Z", "content": "President Rodrigo Duterte said Tuesday that the number of COVID-19 deaths in the Philippines is not that high.\r\n Duterte said this in a taped speech aired Tuesday morning or a day after the country r… [+1438 chars]"}, {"source": {"id": null, "name": "The Online Citizen"}, "author": null, "title": "WHO sounds alarm over rising COVID deaths in Europe - The Online Citizen Asia", "description": "The Online Citizen Asia WHO sounds alarm over rising COVID deaths in Europe Health", "url": "https://www.theonlinecitizen.com/2021/08/30/who-sounds-alarm-over-rising-covid-deaths-in-europe/", "urlToImage": "https://www.theonlinecitizen.com/wp-content/uploads/2021/08/featured-image-covid-france.png", "publishedAt": "2021-08-30T13:38:49Z", "content": "The World Health Organization warned on Monday that another 236,000 people could die from COVID in Europe by 1 December, sounding the alarm over rising infections and stagnating vaccine rates on the … [+3515 chars]"}]}