{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Bayern Munich 5-0 Viktoria Plzen: Bundesliga champions continue perfect European start - BBC", "description": "Bayern Munich continue their perfect start to Champions League Group C with a routine win over Viktoria Plzen on Tuesday night.", "url": "https://www.bbc.co.uk/sport/football/63080257", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/3F6D/production/_126973261_gettyimages-1430407005.jpg", "publishedAt": "2022-10-04T18:53:25Z", "content": "Sadio Mane fired Bayern Munich ahead after only seven minutes\r\nBayern Munich continued their perfect start to Champions League Group C with a routine win over Czech side Viktoria Plzen.\r\nLeroy Sane, … [+6806 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "EU moves ahead with plans to standardize phone chargers by 2024 - CBC News", "description": "The European Parliament approved new rules on Tuesday that will introduce a single charging port for mobile phones, tablets and cameras in the EU by 2024, a world first that is expected to affect iPhone maker Apple more than its rivals.", "url": "https://www.cbc.ca/news/business/eu-phone-charger-1.6605231", "urlToImage": "https://i.cbc.ca/1.5448228.1580506507!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/three-cables.jpg", "publishedAt": "2022-10-04T13:16:01Z", "content": "The European Parliament approved new rules on Tuesday that will introduce a single charging port for mobile phones, tablets and cameras in the EU by 2024, a world first that is expected to affect iPh… [+1599 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Emiko Matsui", "title": "Huawei Nova 9/9 SE receives September 2022 EMUI update - HC Newsroom", "description": "Huawei Nova 9 and Nova 9 SE are now grabbing the September 2022 EMUI security patch update in European markets. The latest software update for the Nova series devices brings system stability improvement alongside Android patches. The September 2022 security u…", "url": "https://www.huaweicentral.com/huawei-nova-9-9-se-receives-september-2022-emui-update/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/10/Huawei-Nova-9-SE-September-2022-EMUI-Update-1000x576.jpg", "publishedAt": "2022-10-04T06:03:45Z", "content": "Huawei has brought the October 2022 EMUI security patch details with a big bag of fixes and improvements for the threatening issues. Consequently, users will notice overall enhancement and stability … [+5293 chars]"}]}