{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Laura Sharman", "title": "Denmark, rattled by mysterious UAV sightings, bans drone flights ahead of European Union summit - CNN", "description": "Denmark has temporarily banned civil drone flights in its airspace as it prepares to host a top European Union meeting on defense and the war in Ukraine, and after a surge of suspicious drone activity at several airports and military sites last week.", "url": "https://www.cnn.com/2025/09/29/europe/denmark-civil-drone-flight-ban-eu-summit-intl-hnk", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap25268310045288.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-09-29T04:38:33Z", "content": "Denmark has temporarily banned civil drone flights in its airspace as it prepares to host a top European Union meeting on defense and the war in Ukraine, and after a surge of suspicious drone activit… [+2650 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Doug Ferguson", "title": "Europe wins the Ryder Cup and reasserts its dominance over the Americans - AP News", "description": "Europe has won the Ryder Cup, just like everyone expected. It just didn't happen without a few nervous moments. The Americans rallied from a seven-point deficit to have a flicker of hope. Europe needed only two points to retain the cup. Ludvig Åberg in the fi…", "url": "https://apnews.com/article/ryder-cup-europe-bethpage-black-usa-235b5ce3869dc7636d58222e9f41730b", "urlToImage": "https://dims.apnews.com/dims4/default/339b416/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F05%2Fda%2Ffa9df8903ba5aa1fde02490a4419%2Fc61d4989dd6b401d9d67ef1ea859394c", "publishedAt": "2025-09-29T00:31:00Z", "content": "FARMINGDALE, N.Y. (AP) Staked to the largest lead in history, Europe fully expected to win the Ryder Cup on Sunday. The surprise was how much emotion poured out of the team on a final day that produc… [+5478 chars]"}]}