{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Times"}, "author": "The Times Leading Article", "title": "The Times view on the end of Covid self-isolation: Towards Normality - The Times", "description": "It has been nearly two years since the prime minister announced the first national lockdown. In March 2020, as European hospitals overflowed with Covid-19 cases, shortages of medical equipment intensified and fears grew that the NHS would be unable to cope wi…", "url": "https://www.thetimes.co.uk/article/the-times-view-on-the-end-of-covid-self-isolation-towards-normality-nxkgc2tpz", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F6f6574e2-9271-11ec-bcf4-9dde9b8243da.jpg?crop=3333%2C1875%2C111%2C415&resize=1200", "publishedAt": "2022-02-21T00:01:00Z", "content": "It has been nearly two years since the prime minister announced the first national lockdown. In March 2020, as European hospitals overflowed with Covid-19 cases, shortages of medical equipment intens… [+588 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Tina G. Santos", "title": "DFA disputes EU Parliament resolution on PH rights record - INQUIRER.net", "description": "MANILA, Philippines — The Department of Foreign Affairs (DFA) condemned what it called the “misguided attempt” of the European Union (EU) Parliament to interfere in the country’s electoral", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2020/04/dfa.jpg", "publishedAt": "2022-02-20T21:00:00Z", "content": "Department of Foreign Affairs building. (File photo from the Philippine Daily Inquirer)\r\nMANILA, Philippines The Department of Foreign Affairs (DFA) condemned what it called the misguided attempt of … [+4752 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Stephen Dziedzic", "title": "Australia promises cyber support to Ukraine as Russian forces array along its borders - ABC News", "description": "Australia will expand cyber training for Ukrainian officials and could join a broader coalition of Western countries to provide the besieged Eastern European nation with support as fear of a Russian invasion continues.", "url": "https://www.abc.net.au/news/2022-02-21/ukraine-australia-cyberattack-russia-war-cybersecurity/100846870", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/a773a4f97a7cbf9700caaeeb57502862?impolicy=wcms_crop_resize&cropH=1959&cropW=3483&xPos=0&yPos=93&width=862&height=485", "publishedAt": "2022-02-20T20:36:30Z", "content": "Australia will expand cyber training for Ukrainian officials and could join a broader coalition of Western countries to provide the besieged Eastern European nation with military equipment or other s… [+6767 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Edward Wong", "title": "Amid Ukraine Crisis, China and Russia's Bond Alarms U.S. and Europe - The New York Times", "description": "The Biden administration plans to build up global coalitions to counter a pact between Vladimir V. Putin and Xi Jinping, portending a new type of Cold War.", "url": "https://www.nytimes.com/2022/02/20/us/politics/russia-china-ukraine-biden.html", "urlToImage": "https://static01.nyt.com/images/2022/02/18/us/politics/XXdc-china-russia-1/XXdc-china-russia-1-facebookJumbo.jpg", "publishedAt": "2022-02-20T13:29:40Z", "content": "Mr. Xi and Mr. Putin have denounced the initiatives. They have long seen those two main strategic prongs of Washington promotion of democracy abroad and the deployment or sharing of troops and milita… [+2322 chars]"}]}