{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Gareth Willmer", "title": "Is Europe entering a golden age of astronomy? - Phys.org", "description": "Groundbreaking discoveries about gravitational waves, black holes, cosmic rays, neutrinos and other areas of cutting-edge astronomy may soon become more frequent due to the convergence of two major communities of astronomers in a fresh project.", "url": "https://phys.org/news/2021-12-europe-golden-age-astronomy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/is-europe-entering-a-g-1.jpg", "publishedAt": "2021-12-10T13:10:13Z", "content": "Groundbreaking discoveries about gravitational waves, black holes, cosmic rays, neutrinos and other areas of cutting-edge astronomy may soon become more frequent due to the convergence of two major c… [+9501 chars]"}, {"source": {"id": null, "name": "TODAYonline"}, "author": null, "title": "As Covid-19 cases surge abroad, Singaporean travellers make adjustments to their trips, take extra precautions - TODAY", "description": "SINGAPORE — As Covid-19 cases are once again surging in parts of Europe and South Korea, travellers from Singapore who have planned their highly anticipated holidays abroad via the various vaccinated travel lanes are making adjustments to their trips and taki…", "url": "https://www.todayonline.com/singapore/covid-19-cases-surge-abroad-singaporean-travellers-make-adjustments-their-trips-take-extra-precautions-1766911", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--GIvU4UZ6--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/tdy/image/2021/12/09/20211209_afp_changiairport.jpg?itok=F9YGuYzn", "publishedAt": "2021-12-09T12:59:00Z", "content": "SINGAPORE  As Covid-19 cases are once again surging in parts of Europe and South Korea, travellers from Singapore who have planned their highly anticipated holidays abroad via the various vaccinated … [+2778 chars]"}]}