{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Scientists propose global plan to save oceans for human health - Health Europa", "description": "An interdisciplinary European collaboration called the Seas Oceans and Public Health in Europe (SOPHIE) Project has put forward a global plan to save the oceans for the sake of human health.", "url": "https://www.healtheuropa.eu/scientists-propose-global-plan-to-save-oceans-for-human-health/108314/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2021/05/iStockThitareeSarmkasat-1208247613.jpg", "publishedAt": "2021-05-17T09:48:34Z", "content": "The SOPHIE Project, led by the University of Exeter and funded by Horizons 2020, has outlined initial steps that organisations can take to protect the oceans, calling for the current UN Ocean Decade … [+3058 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Call for Global Action Plan: Save Our Oceans to Protect Human Health - SciTechDaily", "description": "Scientists have proposed the first steps towards a united global plan to save our oceans, for the sake of human health. An interdisciplinary European collaboration called the Seas Oceans and Public Health In Europe (SOPHIE) Project, led by the University of E…", "url": "https://scitechdaily.com/scientists-call-for-global-action-plan-save-our-oceans-to-protect-human-health/", "urlToImage": "https://scitechdaily.com/images/Tropical-Beach.jpg", "publishedAt": "2021-05-17T07:50:10Z", "content": "Scientists have proposed the first steps towards a united global plan to save our oceans, for the sake of human health.\r\nAn interdisciplinary European collaboration called the Seas Oceans and Public … [+4285 chars]"}, {"source": {"id": null, "name": "European Gaming Industry News"}, "author": "George Miller", "title": "EVOS Esports Collaborates with PUMA – European Gaming Industry News - European Gaming Industry News", "description": "EVOS Esports, the leading esports organization in Southeast Asia, has announced a collaboration with global sports apparel, PUMA. The collaboration includes an exclusive co-branded EVOS Esports PUMA tracksuit and the first-ever unique activation by bundling b…", "url": "https://europeangaming.eu/portal/latest-news/2021/05/17/92476/evos-esports-collaborates-with-puma/", "urlToImage": "https://i2.wp.com/europeangaming.eu/portal/wp-content/uploads/2021/05/evos-puma.png?resize=1000%2C600&ssl=1", "publishedAt": "2021-05-17T06:26:23Z", "content": "Reading Time: 3minutesChiliz, creators of the Chiliz Blockchain and Socios, the worlds leading sports tech fan engagement and monetization platform, have announced partnerships with three IPL franchi… [+4087 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "Orlando Pirates vs Raja Casablanca: Three mistakes that cost Bucs - Goal.com", "description": "With the European Golden Shoe race under way, Goal tallies up the top goalscorers from across the continent's best leagues in 2020-21", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-05-16T18:48:02Z", "content": null}]}