{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Watch a NASA spacewalk to prepare for a space station power boost - CNN", "description": "European Space Agency astronaut Thomas Pesquet and Japan Aerospace Exploration Agency astronaut Akihiko Hoshide embarked on a spacewalk outside the International Space Station on Sunday to prepare for more solar array upgrades.", "url": "https://www.cnn.com/2021/09/12/world/nasa-sunday-spacewalk-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210622164600-01-iss-kimbrough-pesquet-spacewalk-super-tease.jpg", "publishedAt": "2021-09-12T10:59:00Z", "content": null}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": null, "title": "Another 1 million Moderna COVID 19 vaccine doses coming to Australia after EU deal - ABC News", "description": "Scott Morrison says the vaccines will arrive from Europe as early as next week, with children as young as 12 able to receive the jab at community pharmacies.", "url": "https://www.abc.net.au/news/2021-09-12/one-million-moderna-vaccines-secured-from-eu-scott-morrison/100455502", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4f50a74792f330e5a6ff315016c74312?impolicy=wcms_crop_resize&cropH=394&cropW=700&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2021-09-12T03:47:47Z", "content": "Australia will receive 1 million doses of the Moderna vaccine from European nations as early as next week, with children as young as 12 to soon receive the jab at community pharmacies.\r\nKey points:\r\n… [+3017 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "BioNTech ‘preparing production’ of Covid-19 vaccine for children under 12, which may be approved in Europe next month – media - RT", "description": "German company BioNTech, which in partnership with Pfizer developed one of the most widely used anti-Covid shots, says it’s preparing for the worldwide launch of its jab for younger recipients and might get approval in October.", "url": "https://www.rt.com/news/534576-biontech-children-vaccine-production/", "urlToImage": "https://cdni.rt.com/files/2021.09/article/613ca9a920302742b332a4d9.jpg", "publishedAt": "2021-09-11T13:21:00Z", "content": "An mRNA vaccine against coronavirus for children aged between five and 11 years old could be approved for use in Germany in a few weeks’ time, as early as by mid-October, Der Spiegel reported on Frid… [+1898 chars]"}]}