{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Monkeypox outbreak: Drugmaker SIGA says EU authorities seeking to stockpile its smallpox antiviral - euronews", "description": "Shares in companies that make antiviral drugs to fight smallpox and related viruses have soared as monkeypox cases multiply in Europe and North America.READ ...", "url": "https://www.youtube.com/watch?v=lU9Ab0_XJEg", "urlToImage": "https://i.ytimg.com/vi/lU9Ab0_XJEg/hqdefault.jpg", "publishedAt": "2022-05-20T18:27:45Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Latest global alert on monkeypox outbreak: UK probes gay bars and saunas as virus spreads in sexual circles - Times Now", "description": "Monkeypox cases in the UK have been reflecting a trend. Six of Britain's nine confirmed cases are men who have sex with men, which officials say is 'highly suggestive of spread in sexual networks'. The other European countries are seeing similar patterns as s…", "url": "https://www.timesnownews.com/health/latest-global-alert-on-monkeypox-outbreak-uk-probes-gay-bars-and-saunas-as-virus-spreads-in-sexual-circles-article-91695087", "urlToImage": "https://static.tnn.in/thumb/msid-91695087,imgsize-100,width-1280,height-720,resizemode-75/91695087.jpg", "publishedAt": "2022-05-20T17:33:14Z", "content": "Former Norwegian diplomat shares aerial shot of beachside road in India's Karnataka, calls it Worlds Most Beautiful Cycling Route'"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Investigations ongoing into atypical cases of monkeypox now reported in eight countries in Europe - World - ReliefWeb", "description": "English News and Press Release on World and 8 other countries about Health and Epidemic; published on 20 May 2022 by WHO", "url": "https://reliefweb.int/report/world/investigations-ongoing-atypical-cases-monkeypox-now-reported-eight-countries-europe", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/disaster-type/EP.png", "publishedAt": "2022-05-20T15:44:23Z", "content": "Statement by Dr Hans Henri P. Kluge, WHO Regional Director for Europe\r\n20 May 2022\r\nTo date, at least eight countries in the WHO European Region – Belgium, France, Germany, Italy, Portugal, Spain, Sw… [+3634 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": null, "title": "WHO calls emergency meeting as monkeypox cases cross 100 in Europe - Rappler", "description": "Scientists do not expect the outbreak to evolve into a pandemic like COVID-19, given the virus does not spread as easily as SARS-COV-2", "url": "https://www.rappler.com/world/global-affairs/who-emergency-meeting-monkeypox-may-20-2022/", "urlToImage": "https://www.rappler.com/tachyon/2021/08/world-health-HEALTH-CORONAVIRUS-WHO-TRIALS.jpg", "publishedAt": "2022-05-20T15:00:54Z", "content": "LONDON, United Kingdom The World Health Organization was due to hold an emergency meeting on Friday, May 20, to discuss the recent outbreak of monkeypox, a viral infection more common to west and cen… [+3725 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "Jennifer Rigby, Natalie  Grover", "title": "WHO calls emergency meeting as monkeypox cases cross 100 in Europe - The Star Online", "description": "LONDON (Reuters) -     The World Health Organization was due to hold an emergency meeting on Friday to discuss the recent outbreak of monkeypox, a viral infection more common to west and central Africa, after more than 100 cases were confirmed or suspected in…", "url": "https://www.thestar.com.my/news/world/2022/05/20/monkeypox-outbreak-in-europe-039largest-ever039-in-region-as-cases-cross-100", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/05/20/1592533.jpg", "publishedAt": "2022-05-20T14:07:00Z", "content": "LONDON (Reuters) - The World Health Organization was due to hold an emergency meeting on Friday to discuss the recent outbreak of monkeypox, a viral infection more common to west and central Africa, … [+4808 chars]"}, {"source": {"id": null, "name": "Ecr.co.za"}, "author": null, "title": "Monkeypox: a rare disease with low fatality rates - East Coast Radio", "description": "Several cases of monkeypox have been detected in North America and Europe since early May, sparking concern that the disease, endemic in parts of Africa, is spreading.", "url": "https://www.ecr.co.za/news/news/monkeypox-a-rare-disease-with-low-fatality-rates/", "urlToImage": "https://turntable.kagiso.io/images/microscope_medica_tests.width-400.png", "publishedAt": "2022-05-20T13:41:00Z", "content": "Most people recover within several weeks and monkeypox has only been fatal\r\nin rare cases.\r\nThere have been thousands of human infections in parts of Central and\r\nWestern Africa in recent years but i… [+3655 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Malou Talosig-Bartolome", "title": "Ukraine war, pandemic won't derail EU vow to protect oceans | Malou Talosig-Bartolome - BusinessMirror", "description": "RAVENNA, ITALY—The war between Russia and Ukraine and the Covid-19 pandemic still dominate the concerns in Europe as member states are still reeling from the impact of these twin economic storms. But the European Union (EU) said they are still focused on prot…", "url": "https://businessmirror.com.ph/2022/05/20/ukraine-war-pandemic-wont-derail-eu-vow-to-protect-oceans/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2022/05/news01-052122.jpg", "publishedAt": "2022-05-20T13:27:42Z", "content": "RAVENNA, ITALYThe war between Russia and Ukraine and the Covid-19 pandemic still dominate the concerns in Europe as member states are still reeling from the impact of these twin economic storms.\r\nBut… [+2651 chars]"}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "Explainer: What is monkeypox and where is it spreading? - Al Arabiya English", "description": "European and American health authorities have identified a number of monkeypox cases in recent days, mostly in young men. It’s a surprising outbreak of a d", "url": "https://english.alarabiya.net/features/2022/05/20/Explainer-What-is-monkeypox-and-where-is-it-spreading-", "urlToImage": "https://vid.alarabiya.net/images/2022/05/20/6aca765a-9634-48d0-9e95-7a0ec175af2e/6aca765a-9634-48d0-9e95-7a0ec175af2e_16x9_600x338.JPG", "publishedAt": "2022-05-20T12:21:00Z", "content": "European and American health authorities have identified a number of monkeypox cases in recent days, mostly in young men. Its a surprising outbreak of a disease that rarely appears outside Africa.\r\nH… [+4268 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "France, Germany, Belgium report first monkeypox virus cases - Al Jazeera English", "description": "The disease endemic in parts of Africa has already been reported in Australia, the US, Canada and other European states.", "url": "https://www.aljazeera.com/news/2022/5/20/france-germany-belgium-report-first-monkeypox-virus-cases", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/05/AP20084299905760.jpg?resize=1200%2C630", "publishedAt": "2022-05-20T11:58:52Z", "content": "France, Belgium and Germany have reported their first cases of monkeypox, joining Australia, and several European and North American nations in detecting the disease, endemic in parts of Africa.\r\nMon… [+1662 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "As global cases rise, researchers race to solve puzzle of mysterious hepatitis cases in children - CNN", "description": "The global toll of sudden and unexplained hepatitis in children has risen to 621 cases from 34 countries, the European Centre for Disease Prevention and Control said in an update on Thursday.", "url": "https://www.cnn.com/2022/05/20/health/hepatitis-children-cases-rise/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519221734-01-hepatitis-children-cases-super-tease.jpg", "publishedAt": "2022-05-20T11:03:00Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT News Desk", "title": "Over 100 monkeypox cases in Europe, WHO calls for emergency meet: Report - Hindustan Times", "description": "Monkeypox is a virus transmitted to humans from animals, with symptoms very similar to smallpox but less severe clinically. | World News", "url": "https://www.hindustantimes.com/world-news/france-belgium-germany-join-growing-list-of-nations-with-monkeypox-cases-101653041930501.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/20/1600x900/HEALTH-MONKEYPOX--0_1653056350529_1653056362615.JPG", "publishedAt": "2022-05-20T10:22:32Z", "content": "The World Health Organization has called for an emergency meeting to discuss the rapidly growing monkeypox outbreak, British publication Telegraph said Friday hours after France, Germany and Belgium … [+3823 chars]"}]}