{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "EPL: Wayne Rooney reveals club Cristiano Ronaldo will join instead Man City - Daily Post Nigeria", "description": "Former Manchester United striker, Wayne Rooney has revealed that Cristiano Ronaldo would rather join Paris Saint-Germain instead of Manchester City. Reports in Italy and the whole of Europe say that the Portugal captain has concluded plans to move to the blue…", "url": "https://dailypost.ng/2021/08/27/epl-wayne-rooney-reveals-club-cristiano-ronaldo-will-join-instead-man-city/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/08/Cristiano-RonaldoWayne-Rooney.jpg", "publishedAt": "2021-08-27T11:26:57Z", "content": "Former Manchester United striker, Wayne Rooney has revealed that Cristiano Ronaldo would rather join Paris Saint-Germain instead of Manchester City.\r\nReports in Italy and the whole of Europe say that… [+873 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Jaclyn Diaz", "title": "Western Europe Can Expect More Heavy Rainfall And Fatal Floods As The Climate Warms - NPR", "description": "The World Weather Attribution initiative has issued a report that said July's historic flooding in Europe is more likely to happen today due to global warming.", "url": "https://www.npr.org/2021/08/27/1031193790/western-europe-fatal-floods-climate-change", "urlToImage": "https://media.npr.org/assets/img/2021/08/26/ap21196707504898_wide-328809d2adf57588e5c04f0396b88110c13aedc3.jpg?s=1400", "publishedAt": "2021-08-27T09:00:00Z", "content": "Destroyed houses are seen in Schuld, Germany, on July 15 after devastating floods hit the region.\r\nMichael Probst/AP\r\nHeavy rainfall and catastrophic flooding events like those that hit Western Europ… [+2216 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ali Daher", "title": "Unlikely Married At First Sight couple come out on top - as Australian series airs in Europe - Daily Mail", "description": "They were arguably one of the most controversial couples to ever appear on the Australian season of Married At First Sight.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-9931203/Unlikely-Married-Sight-couple-come-Australian-series-airs-Europe.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/27/00/47151285-0-image-a-9_1630020327828.jpg", "publishedAt": "2021-08-27T00:06:19Z", "content": "They were arguably one of the most controversial couples to ever appear on the Australian version of Married At First Sight.\r\nBut Bryce Ruthven and Melissa Rawson are having the last laugh, as they h… [+3520 chars]"}, {"source": {"id": null, "name": "Teamtalk.com"}, "author": "Samuel Bannister", "title": "Champions League draw: Man City meet Messi; Man Utd get chance for revenge - Teamtalk.com", "description": "Chelsea's defence of Europe's top trophy will include games against Juventus, while Manchester City will be facing Lionel Messi's PSG after the Champions League draw for the group stage was made.", "url": "https://www.teamtalk.com/news/champions-league-draw-man-city-meet-messi-man-utd-revenge", "urlToImage": "https://d3vlf99qeg6bpx.cloudfront.net/content/uploads/2021/05/28230301/PA.60056106-1.jpg", "publishedAt": "2021-08-26T17:18:36Z", "content": "Chelsea’s defence of Europe’s top trophy will include games against Juventus, while Manchester City will be facing Lionel Messi’s PSG after the Champions League draw for the group stage was made.\r\nCh… [+2436 chars]"}]}