{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Europe esports startup targets US - The Star Online", "description": "BERLIN: Video gaming entrepreneur Carlos “Ocelote” Rodriguez is turning to the US entertainment market after building one of Europe’s biggest esport franchises.", "url": "https://www.thestar.com.my/business/business-news/2021/07/05/europe-esports-startup-targets-us", "urlToImage": "https://cdn.thestar.com.my/Themes/img/newTsol_logo_socmedia.png", "publishedAt": "2021-07-05T00:07:31Z", "content": "BERLIN: Video gaming entrepreneur Carlos Ocelote Rodriguez is turning to the US entertainment market after building one of Europes biggest esport franchises.\r\nRodriguez is in talks with several strea… [+3650 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Lakes under Mars south pole may not be real - Free Press Journal", "description": "Subsurface lakes found under Mars' south pole, using data from the European Space Agency's Mars Express orbiter, may not really be lakes at all, argue researchers. Two research teams in 2018, working on data from the Mars Express orbiter announced a surprisin…", "url": "https://www.freepressjournal.in/science/lakes-under-mars-south-pole-may-not-be-real", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-07%2F9a47d38d-4944-476a-b6fb-1c99806a8243%2Fmars.jpg?rect=0%2C73%2C760%2C399&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-07-04T16:01:50Z", "content": "It revealed dozens of additional bright radar reflections over a far greater range of area and depth than ever before. In some places, they were less than a mile from the surface, where temperatures … [+686 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "COVID: Europe races to vaccinate amid surge in Delta variant - msnNOW", "description": "Experts predict that the delta variant could become the predominant strain in Europe by August. Many are calling for a more comprehensive vaccination campaign to prevent the spread of the highly transmissible mutation.", "url": "https://www.dw.com/en/covid-europe-races-to-vaccinate-amid-surge-in-delta-variant/a-58146241", "urlToImage": "https://static.dw.com/image/55970655_6.jpg", "publishedAt": "2021-07-03T11:17:00Z", "content": "European nations are racing to vaccinate their populations against the coronavirus amid fears that the highly transmissible delta variant could spark another COVID wave and overwhelm health systems.\r… [+2333 chars]"}]}