{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "EU regulator advices against second AstraZeneca shot in those with blood clots - Reuters", "description": "Europe's drug regulator said on Friday AstraZeneca's COVID-19 vaccine must not be given to anyone who has had blood clots with low blood platelets after receiving the shot, and that patients must be monitored for signs within three weeks of vaccination.", "url": "https://www.reuters.com/article/health-coronavirus-astrazeneca-ema-idUSL3N2N82YV", "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800", "publishedAt": "2021-05-21T12:04:23Z", "content": "By Reuters Staff\r\nMay 21 (Reuters) - Europes drug regulator said on Friday AstraZenecas COVID-19 vaccine must not be given to anyone who has had blood clots with low blood platelets after receiving t… [+393 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Murray Kinsella", "title": "Botia fit for La Rochelle as Toulouse centre gets first European start in Champions Cup final - The42", "description": "Ronan O’Gara’s side have brought Kevin Gourdon and Dany Priso back into the starting XV.", "url": "https://www.the42.ie/la-rochelle-toulouse-team-news-5443578-May2021/", "urlToImage": "https://img2.thejournal.ie/article/5443578/river/?height=400&version=5443728", "publishedAt": "2021-05-21T11:23:00Z", "content": "LA ROCHELLE HAVE been handed a big boost ahead of tomorrows Heineken Champions Cup final against Toulouse in Twickenham [KO 4.45pm, Virgin Media/BT Sport] with the return to fitness of influential ce… [+2044 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "Current Covid-19 vaccines appear protective against variants, WHO Europe says - The Straits Times", "description": "Countries across Europe are rolling out vaccines from several drugmakers, including Pfizer and Moderna.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/current-covid-19-vaccines-appear-protective-against-variants-who-europe-says", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/05/20/af_vaccine_2005.jpg?itok=k184mVUx", "publishedAt": "2021-05-20T11:29:23Z", "content": "LONDON (REUTERS) - Covid-19 vaccines currently being deployed in the fight against the pandemic in Europe appear able to protect against all variants that are circulating and causing concern, the Wor… [+1499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reuters", "title": "Facebook, Google, Other Big Tech Firms Must Pledge to Do More to Curb False Information Through Ads: EU - Gadgets 360", "description": "Facebook, Google, and other tech giants will have to pledge to do more to curb the monetisation of false information through advertisement placements, according to a European Commission document.", "url": "https://gadgets.ndtv.com/internet/news/google-facebook-fake-news-fight-false-information-advertisement-monetisation-eu-european-commission-2445586", "urlToImage": "https://i.gadgets360cdn.com/large/alphabet_reuters_1621498944404.jpg", "publishedAt": "2021-05-20T08:26:15Z", "content": "Facebook, Alphabet unit Google, and other tech giants will have to pledge to do more to curb the monetisation of false information through advertisement placements, according to a European Commission… [+1691 chars]"}]}