{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Researchers create lunar life support system by baking moon dust - Digital Trends", "description": "Future lunar explorers may be able to create water and oxygen from moon dust, using new research from the European Space Agency and others.", "url": "https://www.digitaltrends.com/news/moon-regolith-oxygen-water/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/artist_impression_of_a_moon_base_concept-scaled1.jpg", "publishedAt": "2021-09-25T16:02:55Z", "content": "For future missions to the moon — especially if we want to send a crew there for a significant period of time — we’ll need to find a way to provide for essential needs. Bringing a whole lot of water … [+2043 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Tiger Woods' text to US Ryder Cup team inspired big first day, players say - Fox News", "description": "The U.S. Ryder Cup team built the biggest opening-day lead over Europe since 1975 on the first day of the tournament, finishing leading 6-2.", "url": "https://www.foxnews.com/sports/tiger-woods-text-us-ryder-cup-team", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/04f23fd6-Tiger-Woods.jpg", "publishedAt": "2021-09-25T14:47:24Z", "content": "The U.S. Ryder Cup team built the biggest opening day lead over Europe since 1975 on the first day of the tournament, finishing leading 6-2.\r\nWhile Tiger Woods did not make the trip to Whistling Stra… [+2186 chars]"}, {"source": {"id": null, "name": "Gizchina.com"}, "author": "https://web.facebook.com/udinmwen.efosa", "title": "European Commission formally submits a proposal for a unified charging interface - Gizchina.com", "description": "European Commission formally submits a proposal for a unified charging interface. This is obviously a very bad news for Apple", "url": "https://www.gizchina.com/2021/09/24/european-commission-formally-submits-a-proposal-for-a-unified-charging-interface/", "urlToImage": "https://www.gizchina.com/wp-content/uploads/images/2019/07/EU.png", "publishedAt": "2021-09-24T22:49:01Z", "content": "There have been reports and speculations that the European Commission is proposing a unified charger for smartphones in the region. However, it is no longer speculation as the European Commission for… [+2782 chars]"}]}