{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": "Agency Report", "title": "WTO Considers Nigeria, 3 Others As Vaccine Production Hubs - LEADERSHIP NEWS", "description": "The World Trade Organisation (WTO) has said Africa is working with the European Union and other partners to create regional vaccine manufacturing hubs with Nigeria, South Africa, Senegal and Rwanda. The director-general WTO, Ngozi Okonjo-Iweala, who stated th…", "url": "https://leadership.ng/wto-considers-nigeria-3-others-as-vaccine-production-hubs/", "urlToImage": "https://leadership.ng/wp-content/uploads/2020/10/Ngozi-Okonjo-Iweala.jpg", "publishedAt": "2021-06-22T03:35:56Z", "content": "The World Trade Organisation (WTO) has said Africa is working with the European Union and other partners to create regional vaccine manufacturing hubs with Nigeria, South Africa, Senegal and Rwanda.\r… [+383 chars]"}, {"source": {"id": null, "name": "Jagran Josh"}, "author": null, "title": "What is ESA's EnVision mission to Venus? - Jagran Josh", "description": "Recently, a new mission- EnVision mission to Venus has been announced by the European Space Agency (ESA). It is likely to be launched sometime in the", "url": "https://www.jagranjosh.com/general-knowledge/envision-mission-to-venus-1624276216-1", "urlToImage": "https://img.jagranjosh.com/images/2021/June/2162021/EnVision-Mission.png", "publishedAt": "2021-06-21T11:49:00Z", "content": "EnVision is a European Space Agency mission with contributions from NASA. Recently, NASA announced plans to return to planet Venus after over 30 years. At the end of the decade, the two missions will… [+3902 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": null, "title": "Switzerland vs. Turkey - Football Match Report - June 20, 2021 - ESPN", "description": "Get a report of the Switzerland vs. Turkey 2020 European Championship, Group Stage football match.", "url": "https://www.espn.com/soccer/report/_/gameId/560319", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2021%2F0620%2Fr870025_1296x729_16%2D9.jpg", "publishedAt": "2021-06-20T17:53:48Z", "content": "Xherdan Shaqiri scored two superb goals as Switzerland secured third place in Group A at Euro 2020 with a 3-1 win over Turkey, but they now face an anxious wait to see if they will reach the last 16.… [+3124 chars]"}]}