{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak", "title": "How Trump-Zelensky meeting turned acrimonious over demands for territorial concessions - CNN", "description": "President Donald Trump’s working lunch with his Ukrainian counterpart Volodymyr Zelensky on Friday turned acrimonious when the US leader insisted Ukraine make territorial concessions to Russia to end the war, according to European officials briefed on the mee…", "url": "https://www.cnn.com/2025/10/20/politics/trump-zelensky-meeting-territorial-concessions", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2025-10-17t182155z-1668561259-rc2udhapvjqq-rtrmadp-3-ukraine-crisis.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-10-20T15:23:48Z", "content": "President Donald Trumps working lunch with his Ukrainian counterpart Volodymyr Zelensky on Friday turned acrimonious when the US leader insisted Ukraine make territorial concessions to Russia to end … [+5014 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Abhinav Fating", "title": "New Anker Prime 160 W charger with smart touch display now official in Europe - Notebookcheck", "description": "Anker’s newly announced Prime 160 W charger is now officially available in the European markets. The portable gadget has three USB-C ports and offers a total of 160 W of power output. On top of that, it has a smart touch display and app-based controls for fur…", "url": "https://www.notebookcheck.net/New-Anker-Prime-160-W-charger-with-smart-touch-display-now-official-in-Europe.1142445.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/Anker-Prime-160-W-charger-2.jpg", "publishedAt": "2025-10-20T08:00:00Z", "content": "Following its US debut, the new Anker Prime 160 W fast charger is now officially available for purchase in European markets. The product is priced at 129, and buyers can now purchase the accessory di… [+1670 chars]"}]}