{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Voonze.com"}, "author": "https://www.facebook.com/TheDeepLines", "title": "When the Thames and the Seine flowed into the Rhine: there is another Europe under the sea and not long ago there were humans living there - How smart Technology changing lives - InTallaght", "description": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, and part of Atlantic France. It was more than a land bridge; i…", "url": "https://voonze.com/when-the-thames-and-the-seine-flowed-into-the-rhine-there-is-another-europe-under-the-sea-and-not-long-ago-there-were-humans-living-there/", "urlToImage": "https://voonze.com/wp-content/uploads/2022/08/When-the-Thames-and-the-Seine-flowed-into-the-Rhine.jpg", "publishedAt": "2022-08-21T17:12:42Z", "content": "8,000 years ago, what we now call the North Sea was an almost endless series of calm and relatively fertile plains. That land connected the British Isles with present-day Denmark, the Netherlands, an… [+2373 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Zahra Tayeb", "title": "Europe's energy crisis gets 8 out of 10 on a scale of scariness. Here are 4 countries central to crunch - Business Insider South Africa", "description": "Rystad Energy analyst Fabian Ronningen told Insider Europe's energy crisis is \"scary\" and \"it's going to be a very expensive winter\" for consumers.", "url": "https://www.businessinsider.co.za/energy-crisis-8-out-of-10-scariness-scale-rystad-russia-2022-8", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3518/f7dc6a275d54446aa7fb2020ff20d618.jpg", "publishedAt": "2022-08-21T09:54:34Z", "content": "Europe's energy crisis is \"scary\" and problems are piling up to worsen it further, according to Fabian Ronningen, a senior analyst at Rystad Energy.\r\n\"From one to ten, I would probably give it eight,… [+4747 chars]"}, {"source": {"id": null, "name": "XDA Developers"}, "author": "Adam Conway", "title": "The Google Pixel 6a highlights everything wrong with the U.S. phone market - XDA Developers", "description": "The Google Pixel 6a is a great mid-range phone in its own right, but it has a lot of trouble when compared to other European devices.", "url": "https://www.xda-developers.com/google-pixel-6a-us-market-editorial/", "urlToImage": "https://www.xda-developers.com/files/2022/07/Google-Pixel-6a-2-354345.jpg", "publishedAt": "2022-08-20T13:00:00Z", "content": "It’s no secret that the United States has a terrible smartphone market, and you’d be hard pressed to find evidence to the contrary. Between the stranglehold that carriers have on the market, coupled … [+10395 chars]"}]}