{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Amanda Macias, Kevin Breuninger, Sam Meredith, Chloe Taylor", "title": "U.S., Europe restrict Russian trade as Putin's forces advance on Kyiv - CNBC", "description": "New satellite images appear to show that a large Russian convoy approaching Kyiv has been redeployed to towns and forests outside the city.", "url": "https://www.cnbc.com/2022/03/11/russia-ukraine-live-updates.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107017546-1645203095802-putin.jpg?v=1645203206", "publishedAt": "2022-03-12T04:13:00Z", "content": "President Joe Biden will announce that the U.S. is moving to revoke Russia's status as a \"most-favored nation,\" a senior administration official told reporters at CNBC and NBC News.\r\n\"Most-favored na… [+788 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Press Association", "title": "France close in on Grand Slam after battling to victory over Wales in Cardiff - The42", "description": "Victory over England in Paris next week will see France crowned kings of Europe.", "url": "https://www.the42.ie/france-4-5708778-Mar2022/", "urlToImage": "https://img2.thejournal.ie/article/5708778/river/?height=400&version=5708832", "publishedAt": "2022-03-11T22:09:00Z", "content": "FRANCE MOVED TO within sight of a first Guinness Six Nations title and Grand Slam since 2010 after beating Wales 13-9 at the Principality Stadium.\r\nVictory over England in Paris next week will see Fr… [+3657 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Trudeau hits Russian oligarch Abramovich with Canada's new wave of sanctions - POLITICO", "description": "The prime minister announced the move at the close of a weeklong trip to Europe.", "url": "https://www.politico.com/news/2022/03/11/canada-russia-abramovich-sanctions-00016480", "urlToImage": "https://static.politico.com/1d/b8/a04272dc49c0b4da946dccbf2ce3/britain-russia-oligarchs.JPEG", "publishedAt": "2022-03-11T16:26:06Z", "content": "The individuals targeted will no longer be able to profit or benefit from business dealings in Canada. They will also have their assets frozen.\r\nAbramovich, the billionaire owner of Britains Chelsea … [+2786 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "Ballon d’ Or 2022: Organizers announce date for award ceremony - Daily Post Nigeria", "description": "Ballon d'Or organizers, France Football, has announced this year's Ballon d'Or ceremony will be held in October 2022. The 2021 Ballon d'Or will now be given to the best player over a standard European season rather than during a calendar year. The 2021-22 cam…", "url": "https://dailypost.ng/2022/03/11/ballon-d-or-2022-organizers-announce-date-for-award-ceremony/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/07/Ballon-d-Or.jpg", "publishedAt": "2022-03-11T15:45:02Z", "content": "Ballon d’Or organizers, France Football, has announced this year’s Ballon d’Or ceremony will be held in October 2022.\r\nThe 2021 Ballon d’Or will now be given to the best player over a standard Europe… [+474 chars]"}]}