{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "City A.M."}, "author": "Jack Barnett", "title": "Post-Brexit rebound: London muscles out Amsterdam to reclaim trading top spot - City A.M.", "description": "The City reclaimed its place at the top of Europe’s largest share trading centre rankings last month for the first time since Brexit.", "url": "https://www.cityam.com/post-brexit-rebound-london-muscles-out-amsterdam-to-reclaim-trading-top-spot/", "urlToImage": "https://www.cityam.com/assets/uploads/main-image/full_width_article_body_image/2015/03/city-of-london-skyline-corbis-1024x640-57ff778d0e03d-57ff778d2bdb1.jpg", "publishedAt": "2021-07-02T09:45:00Z", "content": "The City reclaimed its place at the top of Europes largest share trading centre rankings last month for the first time since Brexit, muscling out Amsterdam from top spot.\r\n£7.6bn (8.9bn) of shares a … [+2291 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "Vaccines \"seem to\" protect against all coronavirus variants, EMA - cgtn.com", "description": "The European Medicines Agency (EMA) has requested all vaccine developers to investigate if their vaccines", "url": "https://africa.cgtn.com/2021/07/02/vaccines-seem-to-protect-against-all-coronavirus-variants-ema/", "urlToImage": "https://africa.cgtn.com/wp-content/photo-gallery/2021/06/GettyImages-1253358164.jpg", "publishedAt": "2021-07-02T07:53:22Z", "content": "The European Medicines Agency (EMA) has requested all vaccine developers to investigate if their vaccines provide protection against new virus variants, saying that vaccines seem to be protective, an… [+1635 chars]"}, {"source": {"id": null, "name": "Net Newsledger"}, "author": "https://business.facebook.com/NetNewsledger/", "title": "Is Europe on the Verge of a New Era of Rocket Launches with Orbex Space? - Net Newsledger", "description": "The European Space Agency is widening its net to include funding for British rocket companies like Orbex Space. Can UK firms rely on Europe for future funding, or will they be forced to look inwards for investment? Is Europe on the Verge of a New Era of Rocke…", "url": "https://www.netnewsledger.com/2021/07/01/is-europe-on-the-verge-of-a-new-era-of-rocket-launches-with-orbex-space/", "urlToImage": "https://www.netnewsledger.com/wp-content/uploads/2019/02/NASA-Space-Exploration.jpg", "publishedAt": "2021-07-02T03:55:02Z", "content": "The European Space Agency is widening its net to include funding for British rocket companies like Orbex Space. Can UK firms rely on Europe for future funding, or will they be forced to look inwards … [+4254 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "ABP News Bureau", "title": "BREAKING | Double Covid Jab 'Protects' Against Delta Variant, Says European Medicines Agency - ABP Live", "description": "Marco Cavaleri, the EMA head of vaccine strategy, said the “emerging data from real world evidence are showing that two doses of vaccines are protective against the Delta variant”.", "url": "https://news.abplive.com/health/double-covid-jab-seems-to-protect-against-delta-variant-shows-ema-data-1466871", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2021/07/01/f11a18c37206fec225ac8d0881116517_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2021-07-01T13:41:10Z", "content": "The Hague: The European Medicines Agency (EMA) on Thursday said data shows that two doses of Covid vaccine appear to provide protection against the rapidly spreading Delta variant of the coronavirus.… [+1103 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Cara Anna", "title": "Africa's COVID-19 envoy blasts EU, COVAX over vaccine crisis - KULR-TV", "description": "NAIROBI, Kenya (AP) — The African Union special envoy tasked with leading efforts to procure COVID-19 vaccines for the continent is blasting Europe as Africa struggles amid a crushing third surge of infections, saying Thursday that “not one dose, not one vial…", "url": "https://apnews.com/926c80134a8543efef16e2c7ca4d43c2", "urlToImage": "https://storage.googleapis.com/afs-prod/media/33fe4b834026441db25fba258e3bfe23/3000.jpeg", "publishedAt": "2021-07-01T11:46:05Z", "content": "NAIROBI, Kenya (AP) The African Union special envoy tasked with leading efforts to procure COVID-19 vaccines for the continent is blasting Europe as Africa struggles amid a crushing third surge of in… [+5913 chars]"}]}