{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Italy vs England Euro 2020 final: Meet the Italians who stand in the way of England and European glory - BBC Sport", "description": "Everything you need to know about the Italians who stand in the way of England and the European Championship trophy", "url": "https://www.bbc.co.uk/sport/football/57768655", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/D2C9/production/_119316935_gettyimages-1327462803.jpg", "publishedAt": "2021-07-11T05:04:05Z", "content": "Chiellini celebrating Italy's penalty shoot-out against Spain\r\nEngland are one win away from a first major trophy since 1966 but standing in the way of the Three Lions and European glory is a revital… [+6086 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "TSN.ca Staff", "title": "Clash of the titans EURO 2020 final: England vs. Italy - TSN", "description": "Sunday’s European Championship final between traditional powerhouses Italy and England at Wembley Stadium has all the makings of a classic as both the Azzurri and the Three Lions will look to end lengthy championship droughts.", "url": "https://www.tsn.ca/euro-2020-england-italy-final-1.1666380", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1666394!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/harry-kane-phil-foden.jpg", "publishedAt": "2021-07-10T22:41:42Z", "content": "It all comes down to this. After 50 matches of Euro 2020, only one remains and its the biggest of all. At Wembley Stadium on Sunday, Italy looks to win its first Euro since 1968 and will have to do s… [+4655 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-England fined 30000 euros for use of laser pointer, booing Denmark anthem - The Star Online", "description": "(Reuters) -     UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding moment of their Euro 2020 semi-final, Europe's governing b…", "url": "https://www.thestar.com.my/sport/football/2021/07/10/soccer-england-fined-30000-euros-for-use-of-laser-pointer-booing-denmark-anthem", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/10/1215950.jpg", "publishedAt": "2021-07-10T11:49:00Z", "content": "(Reuters) - UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding mo… [+923 chars]"}]}