{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Vineet Washington", "title": "Poco M3 Pro 5G Launch in India Today: How to Watch Livestream, Expected Price, Specifications - Gadgets 360", "description": "Poco M3 Pro 5G is set to launch in India today, June 8, at 11:30am through a virtual event that will be livestreamed on the company’s YouTube channel and Instagram social account. The phone debuted in the European market last month.", "url": "https://gadgets.ndtv.com/mobiles/news/poco-m3-pro-5g-india-launch-today-how-to-watch-livestream-expected-price-specifications-xiaomi-2458415", "urlToImage": "https://i.gadgets360cdn.com/large/Poco_M3_Pro_launch_todau_1623070557431.jpg", "publishedAt": "2021-06-08T02:26:16Z", "content": "Poco M3 Pro 5G is set to launch in India today, at 11:30am through a virtual event. The Xiaomi sub-brand will livestream the event on its YouTube channel and Instagram social account. The phone debut… [+2377 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PR Newswire", "title": "New X-ray map reveals the growing supermassive black holes in next-generation survey fields - Yahoo Finance", "description": "For the first time, one of the largest X-ray surveys using the European Space Agency's XMM-Newton space observatory has captured the growth of supermassive...", "url": "https://finance.yahoo.com/news/x-ray-map-reveals-growing-204000455.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ztedtyX7X3.VLtJHx4mLSw--~B/aD04MDt3PTQwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/9a87134e8fe156d896e5fcb5bddd7ccb", "publishedAt": "2021-06-07T20:40:00Z", "content": "The XMM-SERVS survey lays key groundwork for studying the cosmic history and physical properties of active galaxies\r\nCOLUMBIA, Md., June 7, 2021 /PRNewswire/ -- For the first time, one of the largest… [+6893 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Agence France-Presse", "title": "Moderna seeks approval of COVID-19 vaccine for teens in Europe, Canada - INQUIRER.net", "description": "WASHINGTON — US biotech firm Moderna said Monday it was seeking conditional approval for use of its COVID-19 vaccine on teens in Europe and Canada, in what will assuredly be a boost for", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/02/000_9392EJ-620x388.jpg", "publishedAt": "2021-06-07T12:45:00Z", "content": "In this file photo, Registered Nurse Emily Enos loads the Moderna COVID-19 vaccine into a syringe ahead of the distribution of vaccines to seniors above the age of 65 who are experiencing homelessnes… [+1315 chars]"}]}