{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Pushkala Aripaka", "title": "EU advises against second AstraZeneca shot for people with blood clots - Reuters", "description": "The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving the first, Europe's medicines regulator said on Friday.", "url": "https://www.reuters.com/article/us-health-coronavirus-astrazeneca-ema-idUSKCN2D21EU", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210521&t=2&i=1562951231&r=LYNXNPEH4K0Q9&w=800", "publishedAt": "2021-05-21T13:29:07Z", "content": "(Reuters) -The second shot of the COVID-19 vaccine developed by AstraZeneca and the University of Oxford must not be given to anyone who has had blood clots with low blood platelets after receiving t… [+2060 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Football: England's Champions League race goes down to the wire - CNA", "description": "The battle for the final two Champions League qualification spots goes down to the wire on Sunday with Chelsea, Liverpool and Leicester City all vying for a place in Europe's elite competition.", "url": "https://www.channelnewsasia.com/news/sport/football-england-s-champions-league-race-goes-down-to-the-wire-14851754", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14851748/16x9/991/557/682836c826c7f17e8e98486c52ad8d8c/IT/file-photo--premier-league---burnley-v-liverpool-1.jpg", "publishedAt": "2021-05-20T19:53:06Z", "content": "MANCHESTER, England: The battle for the final two Champions League qualification spots goes down to the wire on Sunday with Chelsea, Liverpool and Leicester City all vying for a place in Europe's eli… [+1777 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reuters", "title": "Facebook, Google, Other Big Tech Firms Must Pledge to Do More to Curb False Information Through Ads: EU - Gadgets 360", "description": "Facebook, Google, and other tech giants will have to pledge to do more to curb the monetisation of false information through advertisement placements, according to a European Commission document.", "url": "https://gadgets.ndtv.com/internet/news/google-facebook-fake-news-fight-false-information-advertisement-monetisation-eu-european-commission-2445586", "urlToImage": "https://i.gadgets360cdn.com/large/alphabet_reuters_1621498944404.jpg", "publishedAt": "2021-05-20T08:26:15Z", "content": "Facebook, Alphabet unit Google, and other tech giants will have to pledge to do more to curb the monetisation of false information through advertisement placements, according to a European Commission… [+1691 chars]"}]}