{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "NICOLE WINFIELD", "title": "People and pets seek shade and cool as Europe sizzles under heat wave that's only going to get worse - The Associated Press", "description": "Scorching temperatures across Europe have forced the closure of the Acropolis in Athens for a second day. Meteorologists say even hotter weather is expected next week, when the mercury is forecast to top 40 degrees Celsius, or about 104 degrees Fahrenheit, in…", "url": "https://apnews.com/article/europe-heat-wave-weather-1efc3122a96e8692dfa43da5164110cf", "urlToImage": "https://dims.apnews.com/dims4/default/2e1eb53/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F73%2Fa2f07c05419d68fa6d53b3e9e9e6%2Fb44fac49e7964ed3b6aad46a6512bac9", "publishedAt": "2023-07-15T15:01:00Z", "content": "ROME (AP) Scorching temperatures across Europe forced the closure of the Acropolis in Athens for a second day as officials warned Saturday of even hotter weather next week, when the mercury is foreca… [+3965 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AFP", "title": "Record heatwaves sweep the world from US to Japan via Europe - Economic Times", "description": "Record-breaking heatwaves are forecast around the world, with the US, Europe, Japan and Morocco already battling high temperatures. Italy is facing weekend predictions of temperatures as high as 48C, potentially the hottest ever in Europe. Other countries exp…", "url": "https://economictimes.indiatimes.com/news/international/world-news/record-heatwaves-sweep-the-world-from-us-to-japan-via-europe/articleshow/101785310.cms", "urlToImage": "https://img.etimg.com/thumb/msid-101785354,width-1070,height-580,imgsize-148362,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-15T13:19:00Z", "content": "Record heat is forecast around the world from the United States, where tens of millions are battling dangerously high temperatures, to Europe and Japan, in the latest example of the threat from globa… [+4732 chars]"}]}