{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Russia-Ukraine: EU to consider Nigerian gas - Punch Newspapers", "description": "The European Union Delegation to Nigeria and the Economic Community of West African States has said it would replace the gas from Russia with Nigeria's on account of the Russian invasion of Ukraine.", "url": "https://punchng.com/russia-ukraine-eu-to-consider-nigerian-gas/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2017/04/01101212/fuel-import.jpg", "publishedAt": "2022-07-22T21:18:08Z", "content": "The European Union Delegation to Nigeria and the Economic Community of West African States has said it would replace the gas from Russia with Nigeria’s on account of the Russian invasion of Ukraine.\r… [+1800 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Long COVID patients seek blood washing treatment, experts concerned for safety - Geo News", "description": "Long COVID patients are travelling to private clinics in Europe for “invasive blood-washing treatment”", "url": "https://www.geo.tv/latest/429255-long-covid-patients-seek-blood-washing-treatment-experts-concerned-for-safety", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2022-07-22/429255_111434_updates.jpg", "publishedAt": "2022-07-22T18:36:00Z", "content": "A shocking investigative feature piece by BMJ revealed that patients with long COVID are seeking a “blood washing treatment” in private clinics in Cyprus, Germany and Switzerland — but medical expert… [+2426 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": "", "title": "Russian and European astronauts complete rare joint spacewalk - CGTN", "description": "A Russian cosmonaut and an European Space Agency (ESA) astronaut worked together outside of the International Space Station (ISS) Thursday, according to NASA, marking the first time in 23 years a European participated in a Russian-operated spacewalk.", "url": "https://news.cgtn.com/news/2022-07-22/Russian-and-European-astronauts-complete-rare-joint-spacewalk-1bSuK2ZGjcc/index.html", "urlToImage": "https://video.cgtn.com/news/2022-07-22/Russian-and-European-astronauts-complete-rare-joint-spacewalk-1bSuK2ZGjcc/video/3c3530d278044f5a93d7c7152d19072d/3c3530d278044f5a93d7c7152d19072d-1280.jpg", "publishedAt": "2022-07-22T13:07:30Z", "content": "A Russian cosmonaut and an European Space Agency (ESA) astronaut worked together outside of the International Space Station (ISS) Thursday, according to NASA, marking the first time in 23 years a Eur… [+816 chars]"}, {"source": {"id": null, "name": "Leitrimobserver.ie"}, "author": "Reporter", "title": "European study reveals potassium-rich foods reduce negative effect of salt in women's diets - Leitrim Live", "description": "Eating foods such as bananas, avocados and salmon could help reduce the negative effects of salt in the diet of women, new research suggests. The study found that potassium-rich diets were associated with lower blood pressure, particularly in women with high …", "url": "https://www.leitrimobserver.ie/news/national-news/866996/european-study-reveals-potassium-rich-foods-reduce-negative-effect-of-salt-in-women-s-diets.html", "urlToImage": "https://www.leitrimobserver.ie/resizer/1200/700/true/pa/2022_07_22/1658445926745_0.jpg--european_study_reveals_potassium_rich_foods_reduce_negative_effect_of_salt_in_women_s_diets.jpg?1658445927000", "publishedAt": "2022-07-22T10:05:24Z", "content": "Eating foods such as bananas, avocados and salmon could help reduce the negative effects of salt in the diet of women, new research suggests.\r\nThe study found that potassium-rich diets were associate… [+3069 chars]"}, {"source": {"id": null, "name": "Investigate-europe.eu"}, "author": null, "title": "Beyond robo-bees: can technology really help halt the biodiversity crisis? - Investigate Europe", "description": "Investigate Europe drones out the noise to find out if technology does hold solutions to combat pesticides and protect ecosystems.", "url": "https://www.investigate-europe.eu/en/2022/beyond-robo-bees-can-technology-really-help-halt-the-biodiversity-crisis/", "urlToImage": "https://www.investigate-europe.eu/wp-content/uploads/2022/07/robobee-1.jpg", "publishedAt": "2022-07-22T06:00:00Z", "content": "The apple trees were coming into bloom, but no bees droned among the blossoms, wrote Rachel Carson, 60 years ago, in the opening chapter of Silent Spring. She imagined a future town with no birds, no… [+8602 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "Mars sample return details coming next week, NASA and European Space Agency promise - Space.com", "description": "The briefing will present a mission architecture proposal by NASA and the European Space Agency.", "url": "https://www.space.com/mars-sample-return-mission-briefing-webcast-july-2022", "urlToImage": "https://cdn.mos.cms.futurecdn.net/QQQ2wmfX7PGEPmdqHEWyzc-1200-80.jpeg", "publishedAt": "2022-07-21T21:05:51Z", "content": "NASA and the European Space Agency (ESA) have new details to share on how they will bring pieces of Mars to Earth, and they'll share their plans next week.\r\nThe agencies will hold a news conference a… [+3340 chars]"}]}