{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Andrew E. Kramer", "title": "How a Dispute Over Groceries Led to Artillery Strikes in Ukraine - The New York Times", "description": "In a sign of volatile East-West relations, a dispute over shopping in the Ukrainian conflict zone spiraled into fighting that sent war jitters rippling through Europe and the U.S.", "url": "https://www.nytimes.com/2021/11/15/world/europe/ukraine-russia-war-putin.html", "urlToImage": "https://static01.nyt.com/images/2021/11/10/world/00ukraine-war01/00ukraine-war01-facebookJumbo.jpg", "publishedAt": "2021-11-15T17:19:05Z", "content": "The battle came at an increasingly volatile moment in the conflict. This fall, commercial satellite photos and videos posted on social media have shown that Russian armored vehicles had massed near t… [+1429 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Belarus must be held accountable for human trafficking, Baltic states say - CBC.ca", "description": "Belarus is forcing migrants to breach the European Union border, and the government of President Alexander Lukashenko must be held accountable for human trafficking, EU members Lithuania, Latvia and Estonia said on Monday.", "url": "https://www.cbc.ca/news/world/belarus-migrants-baltic-states-poland-1.6249101", "urlToImage": "https://i.cbc.ca/1.6249114.1636982237!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/migration-belarus-poland.jpg", "publishedAt": "2021-11-15T15:22:17Z", "content": "Belarus is forcing migrants to breach the European Union border, and the government of President Alexander Lukashenko must be held accountable for human trafficking, EU members Lithuania, Latvia and … [+2137 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "Portugal vs Serbia: Santos explains Ronaldo’s outburst after 2-1 loss - Daily Post Nigeria", "description": "Portugal boss, Fernando Santos, has explained Cristiano Ronaldo’s behaviour after Portugal failed to grab the automatic ticket for the 2022 World Cup on Sunday. Ronaldo was left furious at Santos on Sunday after the former European champions suffered a shocki…", "url": "https://dailypost.ng/2021/11/15/portugal-vs-serbia-santos-explains-ronaldos-outburst-after-2-1-loss/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/06/Portugal-head-coach-Fernando-Santos.jpg", "publishedAt": "2021-11-15T13:30:00Z", "content": "Portugal boss, Fernando Santos, has explained Cristiano Ronaldos behaviour after Portugal failed to grab the automatic ticket for the 2022 World Cup on Sunday.\r\nRonaldo was left furious at Santos on … [+1228 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Wizkid Wins Best African Act At MTV EMA 2021 - Guardian", "description": "Grammy-award winning singer Wizkid won the Best African Act award at the 2021 MTV Europe Music Awards (MTV EMA), which took place at Papp László Budapest Sportaréna in Budapest, Hungary on Sunday. The Afrobeats superstar competed with other African musicians,…", "url": "https://editor.guardian.ng/life/wizkid-wins-best-african-act-at-mtv-ema-2021/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/09/Wizkid-GQ-Prince-Gyasi-3-1-e1631720108120-1062x598.jpg", "publishedAt": "2021-11-15T11:55:00Z", "content": "Wizkid | Image: Prince Gyasi for GQ\r\nGrammy-award winning singer Wizkid won the Best African Act award at the 2021 MTV Europe Music Awards (MTV EMA), which took place at Papp László Budapest Sportaré… [+2181 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "Air pollution in Europe still killing 300,000 a year – report - The Manila Times", "description": "COPENHAGEN: Premature deaths caused by fine particle air pollution have fallen 10 percent annually across Europe, but the invisible killer still accounts for 307,000 premature...", "url": "https://www.manilatimes.net/2021/11/15/news/air-pollution-in-europe-still-killing-300000-a-year-report/1822297", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/15/26801.jpg", "publishedAt": "2021-11-15T04:56:48Z", "content": "COPENHAGEN: Premature deaths caused by fine particle air pollution have fallen 10 percent annually across Europe, but the invisible killer still accounts for 307,000 premature deaths a year, the Euro… [+3013 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "Covid-19: Austria orders nationwide lockdown for unvaccinated - RNZ", "description": "Austria is placing about 2 million unvaccinated people in lockdown amid record infection levels as Europe's Covid-19 surge grows.", "url": "https://www.rnz.co.nz/news/world/455733/covid-19-austria-orders-nationwide-lockdown-for-unvaccinated", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/133829/eight_col_000_9RM4ZV.jpg?1636927613", "publishedAt": "2021-11-14T22:44:08Z", "content": "Austria is placing about 2 million unvaccinated people in lockdown from Monday (local time) amid record infection levels and growing pressure on hospitals.\r\nA demonstrator holds a placard reading 'No… [+3390 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stephen Wynn-davies", "title": "Homo sapiens made several failed attempts to populate Europe before eventually settling - Daily Mail", "description": "A group of researchers made the discovery while they were studying the disappearance of Homo sapiens from Africa tens of thousands of years ago, when they found remains dating back 50,000 years.", "url": "https://www.dailymail.co.uk/news/article-10200487/Homo-sapiens-failed-attempts-populate-Europe-eventually-settling.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/14/11/50466013-0-image-a-22_1636890863932.jpg", "publishedAt": "2021-11-14T12:01:26Z", "content": "Modern humans eventually took over Europe after several failed attempts to settle in the continent, according to scientists, but doubts remain over what caused their eventual success.\r\nA group of res… [+4853 chars]"}]}