{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Europe on edge as Nord Stream Russian gas link enters planned shutdown - Reuters.com", "description": "The biggest single pipeline carrying Russian gas to Germany started annual maintenance on Monday, with flows expected to stop for ten days, but governments, markets and companies are worried the shutdown might be extended due to war in Ukraine.", "url": "https://www.reuters.com/business/energy/europe-edge-nord-stream-russian-gas-link-set-planned-shut-down-2022-07-10/", "urlToImage": "https://www.reuters.com/resizer/RWpIUqqT4W1J1f9xfW5DaTQRpn4=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PPL6A6BLXRNZJKI63JHEOBACBM.jpg", "publishedAt": "2022-07-11T06:39:00Z", "content": "LONDON/FRANKFURT, July 11 (Reuters) - The biggest single pipeline carrying Russian gas to Germany started annual maintenance on Monday, with flows expected to stop for ten days, but governments, mark… [+5680 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Stephanie Taylor", "title": "Ukraine criticizes Canada over return of turbines for Russia-Germany pipeline - CP24 Toronto's Breaking News", "description": "The Ukrainian government is calling on Canada to reconsider its decision to allow the delivery of turbines from a Russia-Europe natural gas pipeline to Germany, saying it sets a \"dangerous precedent\" when it comes to sanctions against the Russian regime.", "url": "https://www.cp24.com/news/ukraine-criticizes-canada-over-return-of-turbines-for-russia-germany-pipeline-1.5981912", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5981915.1657491055!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-07-10T22:11:39Z", "content": "The Ukrainian government is calling on Canada to reconsider its decision to allow the delivery of turbines from a Russia-Europe natural gas pipeline to Germany, saying it sets a \"dangerous precedent\"… [+4321 chars]"}]}