{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daringfireball.net"}, "author": null, "title": "Apple's Plans for the DMA in the European Union - Daring Fireball", "description": "The delicious irony in Apple’s not knowing if these massive proposals will be deemed DMA-compliant is that their dealings with the European Commission sound exactly like App Store developers’ dealings with Apple. Do all the work to build it first, and only *t…", "url": "https://daringfireball.net/2024/01/apples_plans_for_the_dma", "urlToImage": "https://daringfireball.net/graphics/df-wide-card.png", "publishedAt": "2024-01-27T05:03:22Z", "content": "Apple yesterday announced a broad, wide-ranging, and complex set of new policies establishing their intended compliance with the European Unions Digital Markets Act, which comes into effect March 7. … [+28005 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Sean Hollister", "title": "Microsoft Teams went down around the world for over eight hours — it's recovering - The Verge", "description": "Microsoft Teams is down — with outages in North America, South America, Europe, the Middle East, and Africa, according to the latest status update from Microsoft’s official account.", "url": "https://www.theverge.com/2024/1/26/24051966/microsoft-teams-down-outage", "urlToImage": "https://cdn.vox-cdn.com/thumbor/5X0IGMLrTUsRnyo97W-GRqDZBiA=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/24347781/STK095_Microsoft_03.jpg", "publishedAt": "2024-01-27T02:05:00Z", "content": "Microsoft Teams went down around the world for over eight hours its recovering\r\nMicrosoft Teams went down around the world for over eight hours its recovering\r\n / The status lights stayed green for h… [+5207 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Alabama Nitrogen Gas Execution Smith US UN React Call It Deeply Troubled Cruel Inhuman - NDTV", "description": "The White House said Friday it was \"deeply troubled\" by the first-ever execution in the United States using nitrogen gas, an untested method which also drew condemnation from the United Nations and European Union.", "url": "https://www.ndtv.com/world-news/alabama-nitrogen-gas-execution-smith-us-un-react-call-it-deeply-troubled-cruel-inhuman-4939767", "urlToImage": "https://c.ndtvimg.com/2024-01/0fqimca_nitrogen_120x90_27_January_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738?ver-20240117.06", "publishedAt": "2024-01-27T01:46:53Z", "content": "Smith was sentenced to death for the 1988 murder-for-hire of Elizabeth Sennett, a pastor's wife\r\nAlabama: The White House said Friday it was \"deeply troubled\" by the first-ever execution in the Unite… [+4275 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, Alex Marquardt, Becky Anderson", "title": "Efforts to secure hostage deal and pause in Gaza fighting step up as Biden dispatches CIA chief for crucial talks in Europe - CNN", "description": "Efforts to secure the release of hostages held in Gaza and broker a prolonged pause in fighting are arriving at an important juncture as President Joe Biden deploys a top official to Europe for multiparty talks on the contours of a possible agreement.", "url": "https://www.cnn.com/2024/01/26/politics/israel-hamas-hostage-talks-bill-burns-europe/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221005093158-william-burns-2021-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-01-26T19:27:00Z", "content": "Efforts to secure the release of hostages held in Gaza and broker a prolonged pause in fighting are at an important juncture as President Joe Biden deploys his point person on hostage talks to Europe… [+7096 chars]"}]}