{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The European Scientist"}, "author": "Alex Reis", "title": "Sometimes big data is not enough - The European Scientist", "description": "Big data is not always enough to predict the course of a particular situation, according to a team from the Ludwig-Maximilians-University in Munich, Germany. When big data analysis reaches its limits, information obtained from individual observations can be e…", "url": "https://www.europeanscientist.com/en/big-data/sometimes-big-data-is-not-enough/", "urlToImage": "https://www.europeanscientist.com/wp-content/uploads/2021/07/0FB19683-4E64-47C7-9659-F944DD3AB24C.jpeg", "publishedAt": "2021-07-05T14:39:19Z", "content": "Big data is not always enough to predict the course of a particular situation, according to a team from the Ludwig-Maximilians-University in Munich, Germany (1) When big data analysis reaches its lim… [+3112 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Cheryl Hines", "title": "Kovid-19 - Variant Lamda: An unusual mutation that is more unusual and resistant to vaccines than the Delta variant in Europe - SwordsToday.ie", "description": "Not even a month goes by without a new variant appearing. After the British variant, the Indian variant known as the Delta variant is threatening new", "url": "https://swordstoday.ie/kovid-19-variant-lamda-an-unusual-mutation-that-is-more-unusual-and-resistant-to-vaccines-than-the-delta-variant-in-europe/", "urlToImage": null, "publishedAt": "2021-07-05T13:48:36Z", "content": "Not even a month goes by without a new variant appearing. After the British variant, the Indian variant known as the Delta variant is threatening new waves of pollution around the world. That’s not i… [+1531 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Bureau", "title": "Vivo second-fastest growing 5G smartphone brand globally: Report - Economic Times", "description": "Vivos growth was led by its stronghold in the China and Europe 5G phone market, according to research firm Strategy Analytics.", "url": "https://economictimes.indiatimes.com/industry/cons-products/electronics/vivo-second-fastest-growing-5g-smartphone-brand-globally-report/articleshow/84140248.cms", "urlToImage": "https://img.etimg.com/thumb/msid-84140236,width-1070,height-580,imgsize-86137,overlay-economictimes/photo.jpg", "publishedAt": "2021-07-05T10:50:00Z", "content": "Smartphone company has become the second-fastest growing 5G smartphone brand globally after Samsung in the January-March quarter, by shipping 19.4 million units and growing 62 per cent sequentially.\r… [+715 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Shane McGlaun", "title": "ESA completes the first ExoMars high-altitude parachute drop test - SlashGear", "description": "The European Space Agency (ESA) has announced that it has completed the first high-altitude drop test for the ExoMars parachute system. The successful test was completed after delays due to several…", "url": "https://www.slashgear.com/esa-completes-the-first-exomars-high-altitude-parachute-drop-test-05681049/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/07/ESA-completes-the-first-ExoMars-high-altitude-parachute-drop-test.jpg", "publishedAt": "2021-07-05T10:26:00Z", "content": "The European Space Agency (ESA) has announced that it has completed the first high-altitude drop test for the ExoMars parachute system. The successful test was completed after delays due to several w… [+1805 chars]"}, {"source": {"id": null, "name": "Wordlift.io"}, "author": "News Desk", "title": "Airbus-built European Robotic Arm ready for Space - Geospatial World", "description": "Airbus space engineers have installed ESA’s European Robotic Arm (ERA) onto the Russian Multipurpose Laboratory Module (MLM) and it is now ready for its flight to the International Space Station (ISS). Together with this module, known as ‘Nauka’, ERA and its …", "url": "http://data.wordlift.io/wl01287/post/airbus-built_european_robotic_arm_ready_for_space", "urlToImage": "https://geospatialmedia.s3.amazonaws.com/wp-content/uploads/2020/11/airbus_2.png", "publishedAt": "2021-07-05T09:08:21Z", "content": "Airbus space engineers have installed ESAs European Robotic Arm (ERA) onto the Russian Multipurpose Laboratory Module (MLM) and it is now ready for its flight to the International Space Station (ISS)… [+2248 chars]"}, {"source": {"id": null, "name": "GSMArena.com"}, "author": "Victor", "title": "Samsung Galaxy M22 European pricing leaks - GSMArena.com news - GSMArena.com", "description": "The budget handset is currently making its certification rounds and should be launching shortly.", "url": "https://www.gsmarena.com/samsung_galaxy_m22_european_pricing_leaks-news-49878.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/21/07/samsung-galaxy-m22-price-leak/-476x249w4/gsmarena_001.jpg", "publishedAt": "2021-07-03T20:00:01Z", "content": "Samsung is yet to provide any official info on the Galaxy M22. We do, however know that it is right around the corner, especially now that a Bluetooth certification for it has surfaced, under the SM-… [+1584 chars]"}]}