{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Why do migrants risk their lives in the English channel over staying in France? - Telegraph.co.uk", "description": "After the heartbreaking scenes in the Channel, our Europe Editor breaks down what motivates people to attempt the perilous crossing", "url": "https://www.telegraph.co.uk/world-news/2021/11/25/do-migrants-risk-lives-english-channel-staying-france/", "urlToImage": "https://img.youtube.com/vi/QTc1WPRYF1g/maxresdefault.jpg", "publishedAt": "2021-11-25T08:47:00Z", "content": "Those who do attempt the crossing are likely to speak English rather than French or have family members already in Britain.\r\nOthers may come from countries with historical ties to Britain or places w… [+1182 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "COVID cases break records in Europe, prompting booster shot expansion - BusinessWorld Online", "description": "BRUSSELS/PRAGUE — Coronavirus infections broke records in parts of Europe on Wednesday, with the continent once again the epicenter of a pandemic that has prompted new curbs on movement and seen health experts push to widen the use of booster vaccination shot…", "url": "https://www.bworldonline.com/covid-cases-break-records-in-europe-prompting-booster-shot-expansion/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/vaccine-5439120.jpg", "publishedAt": "2021-11-25T04:37:06Z", "content": "BRUSSELS/PRAGUE Coronavirus infections broke records in parts of Europe on Wednesday, with the continent once again the epicenter of a pandemic that has prompted new curbs on movement and seen health… [+5087 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Catherine S. Valente", "title": "Duterte to join virtual Asia-Europe Meeting Summit this week – Palace - The Manila Times", "description": "PRESIDENT Rodrigo Duterte is scheduled to speak virtually in the 13th Asia-Europe Meeting (ASEM) Summit this week about 'rebuilding a resilient future' and the current...", "url": "https://www.manilatimes.net/2021/11/25/news/duterte-to-join-virtual-asia-europe-meeting-summit-this-week-palace/1823590", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/25/29257.jpg", "publishedAt": "2021-11-25T04:19:23Z", "content": "PRESIDENT Rodrigo Duterte is scheduled to speak virtually in the 13th Asia-Europe Meeting (ASEM) Summit this week about \"rebuilding a resilient future\" and the current international and regional chal… [+1634 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Hans von der Burchard", "title": "What’s in the German coalition deal for Europe (and the UK) - POLITICO.eu", "description": "Incoming government vows to push Brussels to be tough on rule of law and Brexit.", "url": "http://www.politico.eu/article/germany-elections-government-europe-olaf-scholz-angela-merkel-sdp-fdp-greens-brussels/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2021/11/24/GettyImages-1236769181-1200x628.jpg", "publishedAt": "2021-11-25T03:35:16Z", "content": "Germany's incoming government plans to urge Brussels to be tougher on the rule of law, supports EU treaty changes and might just be open to changing Europe's debt rules.\r\nThose were just some of the … [+6446 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Geir Moulson", "title": "German parties reach deal for government to end Merkel era - Associated Press", "description": "BERLIN (AP) — Germany's would-be governing parties vowed Wednesday to modernize Europe’s biggest economy and step up efforts against climate change as they announced an agreement that leaves center-left leader Olaf Scholz poised to replace longtime Chancellor…", "url": "https://apnews.com/9d65ea0d9b2c4a51da16faae14354d68/", "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e5ceae13f864d93b4638d13e3f24a5c/3000.jpeg", "publishedAt": "2021-11-24T17:37:30Z", "content": "BERLIN (AP) Germanys would-be governing parties vowed Wednesday to modernize Europes biggest economy and step up efforts against climate change as they announced an agreement that leaves center-left … [+5229 chars]"}]}