{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "ESA's 2030+ roadmap envisions Europeans on the Moon and Mars - The Register", "description": "But the agency is distinctly aware that it needs more autonomy", "url": "https://www.theregister.com/2022/07/05/esa_terrae_novae/", "urlToImage": "https://regmedia.co.uk/2021/02/24/artemislogos.jpg", "publishedAt": "2022-07-05T14:00:00Z", "content": "The European Space Agency (ESA) has released a strategy roadmap to take it into the 2030s and beyond.\r\nThe publication comes on the eve of much-anticipated images from the James Webb Space Telescope,… [+2397 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Cause of 'staggering' disease in cats in Europe unraveled - Phys.org", "description": "A large team of researchers affiliated with multiple institutions in Germany, Austria and Sweden has found the virus behind the mysterious \"staggering\" disease killing cats across Europe. The group has written a paper describing their work but it has not yet …", "url": "https://phys.org/news/2022-07-staggering-disease-cats-europe-unraveled.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/staggering-disease-in.jpg", "publishedAt": "2022-07-05T12:51:34Z", "content": "Sequence comparison of complete rustrela virus (RusV) genome sequences from cats from Sweden, Austria, and Germany. (a) The amino acid sequences of the structural polyprotein (p110/sPP) of all known … [+3951 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "SUNDY LOCUS, GMA News", "title": "EU invites Marcos to visit Brussels for a meeting on foreign policy issues - GMA News Online", "description": "The European Union (EU) has invited President Ferdinand &quot;Bongbong&quot; Marcos Jr. to visit its headquarters in Brussels, Belgium to discuss foreign policy issues and bilateral relations between the Philippines and the bloc.&nbsp;", "url": "https://www.gmanetwork.com/news/topstories/nation/837146/eu-invites-marcos-to-visit-brussels-for-a-meeting-on-foreign-policy-issues/story/", "urlToImage": "https://images.gmanews.tv/webpics/2018/05/European_Union_flags_2018_05_05_01_29_04.JPG", "publishedAt": "2022-07-05T12:05:07Z", "content": "The European Union (EU) has invited President Ferdinand \"Bongbong\" Marcos Jr. to visit its headquarters in Brussels, Belgium to discuss foreign policy issues and bilateral relations between the Phili… [+1640 chars]"}]}