{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Apoorva Kaul", "title": "European Space Agency's images of galaxy leave netizens amazed; See pics - Republic World", "description": "The European Space Agency has shared pictures of the edge-on galaxy. The images captured by the Hubble telescope have grabbed the attention of users.", "url": "https://www.republicworld.com/technology-news/science/european-space-agencys-images-of-galaxy-leave-netizens-amazed-see-pics.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/q6d3eehabjpqnrvb_1633420130.jpeg", "publishedAt": "2021-10-05T08:10:00Z", "content": "The Instagram account of the European Space Agency is filled with pictures of galaxies and space. These pictures shared on the account often leave netizens amazed. In the latest post, ESA has shared … [+1800 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Global player? EU summit to seek answers on China, U.S. strategy - Reuters", "description": "The European Union's 27 leaders will seek a new approach to China on Tuesday in their first summit on Sino-European strategy since the bloc imposed sanctions on Beijing in March and faced retaliation, jeopardising a new investment pact.", "url": "https://www.reuters.com/world/global-player-eu-summit-seek-answers-china-us-strategy-2021-10-05/", "urlToImage": "https://www.reuters.com/resizer/NpMBGFnkpFVhFf563knQuQ63-8I=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/PDMIJDF2IFKSRL5MV4WSSK4OYY.jpg", "publishedAt": "2021-10-05T02:58:00Z", "content": "BRUSSELS, Oct 5 (Reuters) - The European Union's 27 leaders will seek a new approach to China on Tuesday in their first summit on Sino-European strategy since the bloc imposed sanctions on Beijing in… [+2506 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "A European-Japanese spacecraft snapped the clearest photo of Mercury in 6 years as it flew past the planet - Yahoo News", "description": "The BepiColombo spacecraft just flew past Mercury — its ultimate destination — for the first time. The resulting photos reveal a moon-like surface.", "url": "https://www.businessinsider.com/bepicolombo-spacecraft-snaps-flies-past-mercury-craters-photos-2021-10", "urlToImage": "https://i.insider.com/615b42a9542a580019a8aff0?width=1200&format=jpeg", "publishedAt": "2021-10-04T21:14:41Z", "content": "Mercury is finally back in the spotlight, with a space probe zooming past its cratered surface for the first time in six years.\r\nAs it flew past Mercury on Friday, the BepiColombo spacecraft snapped … [+2722 chars]"}, {"source": {"id": null, "name": "Eminetra.com"}, "author": "Amol Rajput", "title": "Covid-19 booster shots have gained widespread support from European regulators - Eminetra.com", "description": "Europe's top health regulators, unlike US authorities, have announced widespread support for the Covid-19 vaccine booster shot. More limited recommendations, And more countries across the continent pa", "url": "https://eminetra.com/covid-19-booster-shots-have-gained-widespread-support-from-european-regulators/772878/", "urlToImage": "https://images.wsj.net/im-410972/social", "publishedAt": "2021-10-04T18:09:48Z", "content": "Europe’s top health regulators, unlike US authorities, have announced widespread support for the Covid-19 vaccine booster shot. More limited recommendations, And more countries across the continent p… [+576 chars]"}]}