{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Draft history curriculum misses 600 years of Aotearoa New Zealand's past - Stuff.co.nz", "description": "An expert panel has criticised Aotearoa New Zealand's Histories curriculum draft for omitting topics such as women, economics and 600 years of pre-European Māori life.", "url": "https://www.stuff.co.nz/national/education/300312287/draft-history-curriculum-misses-600-years-of-aotearoa-new-zealands-past", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/s/q/f/y/image.related.StuffLandscapeSixteenByNine.1420x800.4ysqfz.png/1621461280116.jpg", "publishedAt": "2021-05-19T21:54:00Z", "content": "An expert panel has criticised Aotearoa New Zealand's Histories curriculum draft for omitting topics, including women, labour and economics, and the single largest block of the country's human histor… [+3788 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "European Commission VP and UK's Brexit minister invited to give evidence to Stormont committee - TheJournal.ie", "description": "The committee chairman said they’re being asked to give evidence on the impact of Brexit and the NI Protocol.", "url": "https://www.thejournal.ie/european-commission-vp-stormont-brexit-5442026-May2021/", "urlToImage": "https://img2.thejournal.ie/article/5442026/river/?height=400&version=5442028", "publishedAt": "2021-05-19T17:51:00Z", "content": "THE VICE PRESIDENT of the European Commission and the UKs Brexit minister have been invited to address a Northern Ireland Assembly committee.\r\nMembers of Stormonts Executive Office oversight committe… [+1924 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Ashleigh Furlong", "title": "Coronavirus vaccine booster trial begins in UK - POLITICO Europe", "description": "Study comes as governments debate how to reopen amid concern about the spread of new variants of concern.", "url": "http://www.politico.eu/article/worlds-first-vaccine-booster-trial-begins-in-uk/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2021/05/19/GettyImages-1232945664-1200x628.jpg", "publishedAt": "2021-05-19T17:38:47Z", "content": "A study looking at coronavirus vaccine boosters has launched in the U.K. to test the effects of an extra dose.\r\nThe trial, hailed by the British government as a world-first for the COVID-19 jab, will… [+940 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "WhatsApp changes South Africans should know about: legal expert - BusinessTech", "description": "South Africa’s Information Regulation is taking legal advice on WhatsApp’s updated privacy policy, which gives more disclosure about use of their personal information to users in the European Union than outside it.", "url": "https://businesstech.co.za/news/mobile/491095/whatsapp-changes-south-africans-should-know-about-legal-expert/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/05/Whatsapp-1.jpg", "publishedAt": "2021-05-18T06:54:32Z", "content": "South Africas Information Regulation is taking legal advice on WhatsApps updated privacy policy – which discloses more about the use of personal information to users in the European Union, than in pl… [+3529 chars]"}]}