{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Science News Roundup: Vaccine-linked heart condition tends to resolve quickly; Delta variant fuses cells to infect more efficiently; \"Space is for everyone\": Europe's Space Agency to hire first disabled astronaut - Devdiscourse", "description": "Following is a summary of current science news briefs.  Vaccine-linked heart condition tends to resolve quickly; Delta variant fuses cells to infect more efficiently  The following is a roundup of some of the latest scientific studies on the novel coronavirus…", "url": "https://www.devdiscourse.com/article/science-environment/1628867-science-news-roundup-vaccine-linked-heart-condition-tends-to-resolve-quickly-delta-variant-fuses-cells-to-infect-more-effi", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/16_06_2021_09_55_18_5215178.jpg?width=920&format=jpeg", "publishedAt": "2021-06-27T05:00:10Z", "content": "Following is a summary of current science news briefs.\r\nVaccine-linked heart condition tends to resolve quickly; Delta variant fuses cells to infect more efficiently\r\nThe following is a roundup of so… [+765 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermes", "title": "Europe's space agency to hire first disabled astronaut - The Straits Times", "description": "BERLIN • The European Space Agency (ESA) hopes to hire and launch the world's first physically disabled astronaut, and several hundred would-be para-astronauts have already applied for the role, ESA head Josef Aschbacher said.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/europes-space-agency-to-hire-first-disabled-astronaut", "urlToImage": "https://www.straitstimes.com/sites/all/themes/custom/bootdemo/images/facebook_default_pic_new.jpg", "publishedAt": "2021-06-26T21:00:00Z", "content": "BERLIN The European Space Agency (ESA) hopes to hire and launch the world's first physically disabled astronaut, and several hundred would-be para-astronauts have already applied for the role, ESA he… [+1661 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Kim Lyons", "title": "Volkswagen plans to stop selling combustion engine vehicles in Europe by 2035 - The Verge", "description": "A Volkswagen board member told a German newspaper that the company would “exit the business with internal combustion engine cars in Europe between 2033 and 2035.” But, he added, it would take longer to stop selling combustion engines in other parts of the wor…", "url": "https://www.theverge.com/2021/6/26/22551956/volkswagen-stop-selling-combustion-engine-vehicles-europe-2035", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pkDqqKIo5sKwwf30wo5xzP-ombU=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19881625/acastro_200406_1777_volkswagen_0003.0.jpg", "publishedAt": "2021-06-26T19:57:26Z", "content": "The US and China will come somewhat later, a board member said\r\nIllustration by Alex Castro / The Verge\r\nVolkswagen plans to stop selling combustion engines in Europe by 2035, a board member told Ger… [+1272 chars]"}, {"source": {"id": null, "name": "eNCA"}, "author": null, "title": "Australia battles Delta Covid surge as Europe eases restrictions - eNCA", "description": "Sydney's normally bustling harbourside centre was nearly deserted after its lockdown took effect, with officials bracing the public for a spiralling crisis.", "url": "https://www.enca.com/news/australia-battles-delta-covid-surge-europe-eases-restrictions", "urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/afp/2021-06/doc-9D77C6-%40photo4.jpg?h=b284d102&itok=F7C6MqCO", "publishedAt": "2021-06-26T09:26:06Z", "content": "\"We do need to brace ourselves for a potentially large number of cases in the following days,\" said Gladys Berejiklian, the Premier of New South Wales state.\r\n\"When you have a contagious variant, lik… [+988 chars]"}]}