{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Hero Cycles delivers first batch of Made in India e-bikes to Europe - Moneycontrol.com", "description": "The shipment, under the HNF brand of Hero International (HIT), marks the start of the Indian bicycle major's plan to become a leader in the European Union (EU) market, the company said this week.", "url": "https://www.moneycontrol.com/news/technology/auto/hero-cycles-delivers-first-batch-of-made-in-india-e-bikes-to-europe-7091261.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/07/madhya-pradesh-cycle-girl-770x433.jpg", "publishedAt": "2021-06-26T09:51:44Z", "content": "India's Hero Motors Company (HMC) Group has said that Hero Cycles has successfully delivered its first batch of Made in India e-bikes to Europe.\r\nThe shipment, under the HNF brand of Hero Internation… [+4293 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "JO TIMBUONG", "title": "Khairy stands by belief EU hoarding Covid-19 vaccines, referring to purchase of more than it needs - The Star Online", "description": "KUALA LUMPUR: The European Union (EU) may have dismissed claims that it is stockpiling large amounts of the Covid-19 vaccine but Khairy Jamaluddin stands by his belief that it is among groups of developed nations that are hoarding the valued products.", "url": "https://www.thestar.com.my/news/nation/2021/06/26/khairy-stands-by-belief-eu-hoarding-covid-19-vaccines-referring-to-purchase-of-more-than-it-needs", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/06/26/1198860.jpg", "publishedAt": "2021-06-26T08:56:00Z", "content": "KUALA LUMPUR: The European Union (EU) may have dismissed claims that it is stockpiling large amounts of the Covid-19 vaccine but Khairy Jamaluddin stands by his belief that it is among groups of deve… [+1326 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "sport", "title": "Ex-All Black Jerome Kaino ends career with 'incredible' Toulouse double - News24", "description": "Former New Zealand back-rower Jerome Kaino said he was lost for words after capping his illustrious career by winning a European and French double after Toulouse secured the Top 14 title.", "url": "https://www.news24.com/sport/rugby/ex-all-black-jerome-kaino-ends-career-with-incredible-toulouse-double-20210626", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11183/8efcb114198141f493f01d7c11f844fd.jpg", "publishedAt": "2021-06-26T06:51:35Z", "content": "Former New Zealand back-rower Jerome Kaino said he was lost for words after capping his illustrious career by winning a European and French double after Toulouse's18-8 victory over La Rochelle on Fri… [+2806 chars]"}, {"source": {"id": null, "name": "Empire of The Kop"}, "author": "Farrell Keeling", "title": "Liverpool enquire about European heavyweight’s 27-goal star - Empire of The Kop", "description": "Liverpool have enquired about the availability of PSG superstar Kylian Mbappe this summer. This comes from Marca journalist Chris Winterburn, with the publication claiming that the Frenchman’…", "url": "https://www.empireofthekop.com/2021/06/26/liverpool-enquire-about-european-heavyweights-27-goal-star/", "urlToImage": "https://icdn.empireofthekop.com/wp-content/uploads/2021/06/Mbappe-Liverpool.jpg", "publishedAt": "2021-06-26T05:30:57Z", "content": "Liverpool have enquired about the availability of PSG superstar Kylian Mbappe this summer.\r\nThis comes from Marca journalist Chris Winterburn, with the publication claiming that the Frenchmans prefer… [+1395 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Euro 2020: Unity after adversity - are Denmark European Championship dark horses again? - BBC Sport", "description": "Denmark have come through a traumatic event to reach the last 16 of Euro 2020 and now they will hope to replicate their 1992 championship-winning team.", "url": "https://www.bbc.co.uk/sport/football/57395822", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/1844B/production/_119030499_denmarkfans.jpg", "publishedAt": "2021-06-26T05:24:05Z", "content": "Denmark beat Germany 2-0 in the Euro 1992 final in Gothenburg, Sweden\r\nAlmost 30 years ago, Denmark pulled off the seemingly impossible - they won the European Championship for the first time.\r\nTo th… [+5206 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Andrew Leeson, with AFP bureaus", "title": "Australia battles Delta Covid surge as Europe eases restrictions - Yahoo News Australia", "description": "Australia's largest city Sydney entered a two-week lockdown on Saturday to contain a sudden Covid surge, but several European nations lifted restrictions...", "url": "https://au.news.yahoo.com/australia-battles-delta-covid-surge-042939185.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/D3ozAZ3SdYDT3HAHs601Sw--~B/aD01MTA7dz03Njg7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/afp.com.au/5a2c1424fb14d685eb691ad90f3633c1", "publishedAt": "2021-06-26T04:29:39Z", "content": "Australia's largest city Sydney entered a two-week lockdown on Saturday to contain a sudden Covid surge, but several European nations lifted restrictions despite the global spread of a highly contagi… [+4283 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "'Space is for everyone': Europe's space agency to hire first disabled astronaut - The Straits Times", "description": "Several hundred would-be para-astronauts have already applied for the role as part of the ESA's latest recruitment call.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/europe/space-is-for-everyone-europes-space-agency-to-hire-first-disabled-astronaut", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/06/26/topshots-topshot-space-us-iss-science-072655.jpg?itok=wYlwvFVF", "publishedAt": "2021-06-25T16:18:10Z", "content": "BERLIN (REUTERS) - The European Space Agency hopes to hire and launch the world's first physically disabled astronaut and several hundred would-be para-astronauts have already applied for the role, E… [+2339 chars]"}, {"source": {"id": null, "name": "Liverpool.com"}, "author": "Emmet Gates", "title": "UEFA rule change leaves Liverpool at a disadvantage, and Jürgen Klopp won't be happy - Liverpool.com", "description": "The away goal rule has been axed by the European governing body after 56 years, and the resulting change will mean Liverpool and other teams in European competition face the potential of more game time.", "url": "https://www.liverpool.com/liverpool-fc-news/features/uefa-rule-change-klopp-liverpool-20895684", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article20686224.ece/ALTERNATES/s1200/1_GettyImages-1147641162.jpg", "publishedAt": "2021-06-24T21:00:00Z", "content": "The away goal rule in European competition is no more. After 56 years, Uefa have called time on the law. \"It is no longer appropriate for an away goal to carry more weight,\" said Uefa president Aleks… [+4037 chars]"}]}