{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Business Recorder"}, "author": "AFP", "title": "EU approves fifth jab as WHO urges greater effort to end pandemic - Business Recorder", "description": "BRUSSELS: The European Union approved its fifth Covid-19 vaccine Monday, stepping up its battle against the Omicron...", "url": "https://www.brecorder.com", "urlToImage": "https://i.brecorder.com/large/2021/12/61c110d91b951.jpg", "publishedAt": "2021-12-20T23:14:58Z", "content": "BRUSSELS: The European Union approved its fifth Covid-19 vaccine Monday, stepping up its battle against the Omicron virus variant as the WHO called for greater efforts to ensure the pandemic ends nex… [+3730 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "EU approves Novavax shot as fifth COVID vaccine - Al Jazeera English", "description": "The European Medicines Agency paves the way for a fifth authorised COVID jab in the bloc, approving its use in adults.", "url": "https://www.aljazeera.com/news/2021/12/20/eu-approves-novavax-shot-as-fifth-covid-vaccine", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/12/000_9UZ6RW.jpg?resize=1024%2C630", "publishedAt": "2021-12-20T20:15:17Z", "content": "The European Union has approved the use of Novavaxs COVID-19 vaccine in people 18 years and older, giving a boost to the US biotech after long delays and paving the way for a fifth shot in the EU as … [+4090 chars]"}, {"source": {"id": null, "name": "Football.London"}, "author": "Emma de Duve", "title": "Antonio Conte has already shown with Chelsea why UEFA decision could be beneficial to Tottenham - Football.London", "description": "Tottenham are now out of the Europa Conference League but it may not be all bad and Antonio Conte has succeeded without European football before", "url": "https://www.football.london/tottenham-hotspur-fc/fixtures-results/antonio-conte-chelsea-tottenham-uefa-22518941", "urlToImage": "https://i2-prod.football.london/incoming/article22520261.ece/ALTERNATES/s1200/0_GettyImages-1359570879.jpg", "publishedAt": "2021-12-20T18:00:00Z", "content": "Antonio Conte may see the positives from Tottenham now being out of the Europa Conference League and it wouldn't be the first time he has found success without European football.\r\nSpurs had a rollerc… [+4110 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "AFP", "title": "EU health watchdog approves fifth Covid vaccine - TheJournal.ie", "description": "This will be the fifth Covid-19 vaccine approved for use in the European Union.", "url": "https://www.thejournal.ie/novavax-eu-approval-5635718-Dec2021/", "urlToImage": "https://img2.thejournal.ie/article/5635718/river/?height=400&version=5635719", "publishedAt": "2021-12-20T15:36:00Z", "content": "Updated 1 hour ago\r\nEUROPES MEDICINES WATCHDOG has approved a Covid jab by US-based Novavax, which uses a more conventional technology that the biotech firm hopes will reduce vaccine hesitancy.\r\nThe … [+3967 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Omicron fears send Bursa, regional markets lower - The Star Online", "description": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling in equities.", "url": "https://www.thestar.com.my/business/business-news/2021/12/20/omicron-fears-send-bursa-regional-markets-lower", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/20/1413398.JPG", "publishedAt": "2021-12-20T05:03:00Z", "content": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling … [+1049 chars]"}]}