{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Santosh Chaubey", "title": "With China Running on Fumes, Time for India to Go Full Steam Ahead, Say Experts - News18", "description": "A Chinese slowdown that is expected to continue with Xi Jinping’s increased emphasis on the ‘zero Covid policy’, combined with the chances of recession in Europe and America means good things for India", "url": "https://www.news18.com/news/business/with-china-running-on-fumes-time-for-india-to-go-full-steam-ahead-say-experts-6201499.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/indian-economy-166581981016x9.jpg", "publishedAt": "2022-10-20T02:30:33Z", "content": "Xi Jinping has inaugurated the 20th National Congress of the Chinese Communist Party (CCP), reiterating his hardliner policies that aim to tackle corruption, regulate private industries, integrate Ho… [+8525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt", "title": "The Black Death is still affecting the human immune system - CNN", "description": "The Black Death, the world's most devastating plague outbreak, killed half of medieval Europe's population in the space of seven years, shifting the course of human history. It was more than luck that determined who died and who survived, a new study says.", "url": "https://www.cnn.com/2022/10/19/world/black-death-plague-immune-system-scn-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221019145852-04-black-death-plague-immune-system.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-19T15:59:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe Black Death, the worlds most devastating plague ou… [+4931 chars]"}, {"source": {"id": null, "name": "MacRumors"}, "author": "Tim Hardwick", "title": "Apple Hikes iPad Mini Prices Outside US, With Europe Faring Worst - MacRumors", "description": "Apple significantly increased the price of existing iPad mini models in non-US markets after updating its online store with new entry-level iPad and...", "url": "https://www.macrumors.com/2022/10/19/apple-hikes-ipad-mini-prices-outside-us/", "urlToImage": "https://images.macrumors.com/t/o-ezzPjfVjkPwjwgVNuR08M09Po=/1881x/article-new/2021/09/iPad-mini-6-orange-BG.jpg", "publishedAt": "2022-10-19T08:02:33Z", "content": "Apple significantly increased the price of existing iPad mini models in non-US markets after updating its online store with new entry-level iPad and iPad Pro models on Tuesday.\r\nIn the UK for example… [+1031 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Herman Mostert", "title": "Bok No 10 jersey: Jean de Villiers backs Willemse ahead of Goosen for Euro tour - News24", "description": "Former Springbok captain Jean de Villiers says he would prefer Damian Willemse to play flyhalf ahead of Johan Goosen during the Springboks' year-end tour to Europe.", "url": "https://www.news24.com/sport/rugby/springboks/bok-no-10-jersey-jean-de-villiers-backs-willemse-ahead-of-goosen-for-euro-tour-20221019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/5595/ba31f772bf2c41a48862888d5e703122.jpg", "publishedAt": "2022-10-19T03:04:31Z", "content": "Former Springbok captain Jean de Villiers says he would prefer Damian Willemse to play flyhalf ahead of Johan Goosen during the Springboks' year-end tour to Europe.\r\nBulls pivot Goosen was the only N… [+3085 chars]"}]}