{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Energy giant ExxonMobil sues EU to block energy windfall tax - BBC", "description": "The US company says the levy on its profits will discourage future investment in Europe.", "url": "https://www.bbc.co.uk/news/business-64113398", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F964/production/_128144836_mediaitem128144832.jpg", "publishedAt": "2022-12-28T22:41:02Z", "content": "US energy giant ExxonMobil is suing the EU in a bid to force the bloc to scrap its new windfall tax on oil firms.\r\nA windfall tax is imposed on firms that benefitted from something they were not resp… [+1631 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "Borys Sachalko", "title": "'We Fight With Our Brains. They Fight With Numbers': Ukrainian Paratroopers On The Battle For The Donbas City of Kreminna - Radio Free Europe / Radio Liberty", "description": "Amid relentless fighting, one official claims that Ukrainian forces are closing in on recapturing Kreminna, which would disrupt Russian supply lines in the Donbas and deal Moscow another setback. Here’s what Ukrainian paratroopers say about the situation on t…", "url": "https://www.rferl.org/a/ukraine-kreminna-battle-recapture-russia-supply-lines/32197165.html", "urlToImage": "https://gdb.rferl.org/034d0000-0aff-0242-2a9d-08dae8afa78d_cx0_cy12_cw0_w1200_r1.jpg", "publishedAt": "2022-12-28T12:56:02Z", "content": "KREMINNA, Ukraine -- For the paratroopers of a Ukrainian airborne brigade, theres only one way to describe the waves of Russian infantry who are relentlessly pressing the Ukrainian lines in and aroun… [+5722 chars]"}, {"source": {"id": null, "name": "Worldhealth.net"}, "author": null, "title": "Research Shows That Most Heart Disease Deaths Are Preventable By Changing Diets - Anti Aging News", "description": "According to recent research published in the journals of the European Society of Cardiology and the European Heart Journal - Quality of Care and Clinical Outcomes (ESC), more than two-thirds of heart disease fatalities could be avoided on a global scale if p…", "url": "https://www.worldhealth.net/news/research-shows-most-heart-disease-deaths-are-preventable-changing-diets", "urlToImage": "https://www.worldhealth.net/media/original_images/AdobeStock_24764019.jpeg", "publishedAt": "2022-12-27T21:35:37Z", "content": "According to recent research published in the journals of the European Society of Cardiology and the European Heart Journal - Quality of Care and Clinical Outcomes (ESC), more than two-thirds of hear… [+4210 chars]"}]}