{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "Champions League: Why Real Madrid may defeat Liverpool in France – Jurgen Klopp - Daily Post Nigeria", "description": "Liverpool boss Jurgen Klopp, has said Real Madrid may emerge European champions in Stade de France on Saturday. The German said the Spanish heavyweight have the experience needed to defeat the Reds and crowned Champions for a record 14th time. Liverpool is he…", "url": "https://dailypost.ng/2022/05/28/champions-league-why-real-madrid-may-defeat-liverpool-in-france-jurgen-klopp/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/01/Klopp.jpg", "publishedAt": "2022-05-28T06:08:23Z", "content": "Liverpool boss Jurgen Klopp, has said Real Madrid may emerge European champions in Stade de France on Saturday.\r\nThe German said the Spanish heavyweight have the experience needed to defeat the Reds … [+1067 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "AFP", "title": "Lyon dominate Toulon to land maiden Challenge Cup crown - The42", "description": "It’s a first European title for the Top 14 team.", "url": "https://www.the42.ie/lyon-toulon-challenge-cup-report-5776486-May2022/", "urlToImage": "https://img2.thejournal.ie/article/5776486/river/?height=400&version=5776493", "publishedAt": "2022-05-27T21:34:00Z", "content": "NEW ZEALANDERS JORDAN Taufua and Charles Ngatai were at the heart of a tough-as-teak Lyon defence that helped the Top 14 team to its first European title with a comprehensive 30-12 victory over Toulo… [+3595 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Gavan Casey", "title": "New stars Dossen and Eagleson secure European Championship medals for Ireland - The42", "description": "Eagleson, who had never before competed as a senior in any competition, is now an Elite European Championship medallist.", "url": "https://www.the42.ie/gabriel-dossen-5775616-May2022/", "urlToImage": "https://img2.thejournal.ie/article/5775616/river/?height=400&version=5776110", "publishedAt": "2022-05-27T15:40:00Z", "content": "Updated 9 hours ago\r\nANOTHER WEEK, ANOTHER memorable day in the ring for Irish amateur boxing.\r\nA youthful and inexperienced team will take home with them two medals from the mens Elite European Cham… [+4049 chars]"}]}