{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Firstpost"}, "author": "Bhagyasree Sengupta, Bhagyasree Sengupta", "title": "Macron dissolves National Assembly, calls for snap elections in France | Here's why - Firstpost", "description": "The move came shortly after projected results from France put the far-right National Rally party of Marine Le Pen well ahead in the European Union’s parliamentary election", "url": "https://www.firstpost.com/world/macron-dissolves-national-assembly-calls-for-snap-elections-in-france-heres-why-13780683.html", "urlToImage": "https://images.firstpost.com/uploads/2024/06/3000-7-2024-06-46c6d4f23099b9b23cbf13bbc1337399.jpg?im=FitAndFill=(1200,675)", "publishedAt": "2024-06-10T02:20:16Z", "content": "After a major defeat in the election for the European Parliament, French President Emmanuel Macron dissolved the country’s National Assembly and called for a snap legislative elections.\r\nMacron confi… [+3883 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: European Union Elections And Rise Of Far-Right Parties - NDTV", "description": "Far-right parties made striking gains in European Union elections on Sunday, while the ultimate losers were French President Emmanuel Macron -- and the Greens.", "url": "https://www.ndtv.com/world-news/explained-european-union-elections-and-rise-of-far-right-parties-5855997", "urlToImage": "https://c.ndtvimg.com/2024-06/7ghm7flo_macron-melonie-_625x300_10_June_24.jpeg?ver-20240506.08", "publishedAt": "2024-06-10T01:19:00Z", "content": "The biggest single loser of the elections was Macron after his liberal party received a drubbing.\r\nBrussels: Far-right parties made striking gains in European Union elections on Sunday, while the ult… [+4768 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christian Edwards", "title": "Far right surges in European Parliament elections but center still holds - CNN", "description": "Far-right parties are predicted to win a record number of seats in the European parliament, a result that, if confirmed, would deliver a stinging rebuke to Brussels’ political mainstream and add uncertainty to Europe’s future direction.", "url": "https://www.cnn.com/2024/06/09/europe/european-parliament-far-right-surge-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2152806118.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-06-10T00:26:22Z", "content": "Far-right parties are predicted to win a record number of seats in the European Parliament, a result that, if confirmed, would deliver a stinging rebuke to Brussels political mainstream and add uncer… [+4023 chars]"}]}