{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Emily Rauhala, Tyler Pager, Ashley Parker", "title": "Biden, E.U. announce plan to reduce Europe's reliance on Russian energy - The Washington Post", "description": "As part of the effort, the United States will increase liquefied natural gas exports to Europe by at least 15 billion cubic meters this year with the aim of providing larger shipments in the future, the White House said.", "url": "https://www.washingtonpost.com/world/2022/03/25/biden-eu-energy/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/I3TTBCVMDUI6ZCUOTRXJ7R5A3Y.jpg&w=1440", "publishedAt": "2022-03-25T21:03:00Z", "content": "Were going to have to make sure the families in Europe can get through this winter and the next while were building the infrastructure for a diversified, resilient and clean energy future, Biden said… [+8065 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Trudeau faced harsh critics in the EU Parliament this week. Here's who launched the attacks - CBC News", "description": "This week, criticism of Prime Minister Justin Trudeau by far-right, populist and anti-vaccine members of the European Parliament went viral on social media. CBC News takes a look at what was said, who said it and how the European Parliament is vastly differen…", "url": "https://www.cbc.ca/news/politics/european-members-parliament-attact-trudeau-1.6397579", "urlToImage": "https://i.cbc.ca/1.6397647.1648229085!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/trudeau-brussels-20220323.JPG", "publishedAt": "2022-03-25T20:10:45Z", "content": "When Prime Minister Justin Trudeau recently addressed the European Union Parliament and warned of growing threats to democracy, he received an angry backlash from some elected members who accused him… [+6259 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ryan Morrison", "title": "Solar Orbiter probe captures the most detailed ever image of the Sun's explosive lower atmosphere - Daily Mail", "description": "A joint project between NASA and the European Space Agency (ESA), the Solar Orbiter was 46 million miles from the surface of the sun when it took the images.", "url": "https://www.dailymail.co.uk/sciencetech/article-10648235/Solar-Orbiter-probe-captures-detailed-image-Suns-explosive-lower-atmosphere.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/24/15/55755523-0-image-a-20_1648137338191.jpg", "publishedAt": "2022-03-24T15:42:42Z", "content": "The Solar Orbiter space probe has captured the most detailed ever image of the sun's explosive lower atmosphere, revealing volatile, dynamic eruptions.\r\nA joint project between NASA and the European … [+8231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "ESA astronaut Matthias Maurer ends 1st spacewalk with water in his helmet - CNN", "description": "Two astronauts went on a spacewalk outside of the International Space Station Wednesday to conduct maintenance and upgrades for the orbiting laboratory. Astronauts Raja Chari of NASA and Matthias Maurer of the European Space Agency began the spacewalk at 8:32…", "url": "https://www.cnn.com/2022/03/23/world/iss-chari-maurer-spacewalk-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220322204125-esa-astronaut-matthias-maurer-030422-super-tease.jpg", "publishedAt": "2022-03-23T21:29:00Z", "content": "(CNN)European Space Agency astronaut Matthias Maurer's first spacewalk was an eventful one, beginning and ending with helmet issues.\r\nMaurer and NASA astronaut Raja Chari began the spacewalk at 8:32 … [+4190 chars]"}]}