{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "ALLISON LAI", "title": "KJ: Panel to decide on AstraZeneca vaccine - The Star Online", "description": "PETALING JAYA: Malaysia will decide on the use of the AstraZeneca vaccine for Covid-19 following a report by the European Medicines Agency (EMA) of rare blood clots being a possible side effect, says Science, Technology and Innovation Minister Khairy Jamaludd…", "url": "https://www.thestar.com.my/news/nation/2021/04/09/kj-panel-to-decide-on-astrazeneca-vaccine", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/09/1106933.jpg", "publishedAt": "2021-04-08T23:20:53Z", "content": "PETALING JAYA: Malaysia will decide on the use of the AstraZeneca vaccine for Covid-19 following a report by the European Medicines Agency (EMA) of rare blood clots being a possible side effect, says… [+1092 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "AstraZeneca Covid-19 vaccine: How common are blood clots and should I be worried? - CNN", "description": "Following weeks of speculation about whether Oxford-AstraZeneca's Covid-19 vaccine might be connected to dozens of cases of blood clots reported in the region, European drug regulators have now announced that they have indeed established a link.", "url": "https://www.cnn.com/2021/04/08/health/astrazeneca-covid-vaccine-blood-clots-explainer-cmd-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210404180056-01-astrazeneca-covid-19-vaccine-germany-0331-super-tease.jpg", "publishedAt": "2021-04-08T16:58:00Z", "content": "Our graphics to illustrate the potential benefits and potential harms of the AstraZeneca vaccine as announced by the MHRA this afternoon.\r\nBenefits accrued over 16 weeks, at three different levels of… [+100 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "FDA stops use of AstraZeneca – The Manila Times - The Manila Times", "description": "The Food and Drug Administration (FDA) has advised the Department of Health (DoH) to stop giving the AZD1222 vaccine of British-Swedish drugmaker AstraZeneca to persons below 60 years old. The recommendation comes after the European Medicines Agency (EMA) ann…", "url": "https://www.manilatimes.net/2021/04/09/news/fda-stops-use-of-astrazeneca/861689/", "urlToImage": "https://www.manilatimes.net/wp-content/uploads/2021/04/viber_image_2021-04-08_18-11-06-main-photo-1.jpg", "publishedAt": "2021-04-08T16:20:54Z", "content": "The Food and Drug Administration (FDA) has advised the Department of Health (DoH) to stop giving the AZD1222 vaccine of British-Swedish drugmaker AstraZeneca to persons below 60 years old.\r\nThe recom… [+3644 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Ian Curran", "title": "Minimum wage workers disproportionately affected by pandemic disruption, says ESRI - thejournal.ie", "description": "With cost of living taken into account, Ireland has just the seventh-highest minimum wage in Europe.", "url": "https://www.thejournal.ie/esri-minimum-wage-work-5403545-Apr2021/", "urlToImage": "https://img2.thejournal.ie/article/5403545/river/?height=400&version=5403596", "publishedAt": "2021-04-08T11:12:00Z", "content": "YOUNG MINIMUM WAGE workers in Ireland are likely to have suffered more as a result of pandemic-related employment disruption than their European peers, according to the Economic and Social Research I… [+3488 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Jonathan Keane", "title": "From California to Brazil: Europe's privacy laws have created a recipe for the world - CNBC", "description": "As Europe's sweeping GDPR laws approach their third anniversary, other jurisdictions around the world are taking cues from it to develop their own frameworks.", "url": "https://www.cnbc.com/2021/04/08/from-california-to-brazil-gdpr-has-created-recipe-for-the-world.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106768372-1603974256518-gettyimages-1229337652-PGONCHAR_3E1948.jpeg?v=1603974321", "publishedAt": "2021-04-08T05:32:00Z", "content": "In this photo illustration, Facebook CEO Mark Zuckerberg seen on a mobile screen as he remotely testifies during the hearing of U.S. Senate Committee on Commerce, Science, and Transportation titled \"… [+5356 chars]"}]}