{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Universe Today"}, "author": "https://www.facebook.com/Storiesbywilliams-205745679447998/?ref=hl", "title": "“Incident” that Occurred During Loading Pushes the Webb Launch Date to Dec. 22nd - Universe Today", "description": "An incident occurred at Europe's Spaceport as engineers were preparing the James Webb Space Telescope, delaying the launch until Dec. 22nd at the earliest.", "url": "https://www.universetoday.com/153378/incident-that-occurred-during-loading-pushes-the-webb-launch-date-to-dec-22nd/", "urlToImage": "https://www.universetoday.com/wp-content/uploads/2018/03/otis_lift_glam_shot-1024x751.jpg", "publishedAt": "2021-11-25T07:26:46Z", "content": "At Europe’s Spaceport near Kourou in French Guiana, technicians are busy getting the James Webb Space Telescope (JWST) ready for launch. The observatory arrived at the facility on Oct. 12th and was p… [+3758 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "COVID cases break records in Europe, prompting booster shot expansion - BusinessWorld Online", "description": "BRUSSELS/PRAGUE — Coronavirus infections broke records in parts of Europe on Wednesday, with the continent once again the epicenter of a pandemic that has prompted new curbs on movement and seen health experts push to widen the use of booster vaccination shot…", "url": "https://www.bworldonline.com/covid-cases-break-records-in-europe-prompting-booster-shot-expansion/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/11/vaccine-5439120.jpg", "publishedAt": "2021-11-25T04:37:06Z", "content": "BRUSSELS/PRAGUE Coronavirus infections broke records in parts of Europe on Wednesday, with the continent once again the epicenter of a pandemic that has prompted new curbs on movement and seen health… [+5087 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Catherine S. Valente", "title": "Duterte to join virtual Asia-Europe Meeting Summit this week – Palace - The Manila Times", "description": "PRESIDENT Rodrigo Duterte is scheduled to speak virtually in the 13th Asia-Europe Meeting (ASEM) Summit this week about 'rebuilding a resilient future' and the current...", "url": "https://www.manilatimes.net/2021/11/25/news/duterte-to-join-virtual-asia-europe-meeting-summit-this-week-palace/1823590", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/25/29257.jpg", "publishedAt": "2021-11-25T04:19:23Z", "content": "PRESIDENT Rodrigo Duterte is scheduled to speak virtually in the 13th Asia-Europe Meeting (ASEM) Summit this week about \"rebuilding a resilient future\" and the current international and regional chal… [+1634 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "Samsung Electronics Sold One Million Units of 'The Frame' in 2021 - Samsung Global Newsroom", "description": "Thanks to The Frame’s popularity in North American and European markets, total sales since 2017 expected to exceed two million units by year end", "url": "https://news.samsung.com/global/samsung-electronics-sold-one-million-units-of-the-frame-in-2021", "urlToImage": "https://img.global.news.samsung.com/global/wp-content/uploads/2021/11/The-Frame-1-Million-thumb728.jpg", "publishedAt": "2021-11-25T02:08:46Z", "content": "Samsung Electronics today announced that it has sold more than one million units of The Frame this year, making it Samsungs first single-year million-seller in its Lifestyle TV lineup. Total sales si… [+3907 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "WATCH | Covid-19 cases break records in Europe, prompting booster shot rethink - News24", "description": "Coronavirus infections broke records in parts of Europe with the continent once again the epicentre of a pandemic that has prompted new curbs on movement and made health experts think again about booster vaccination shots.", "url": "https://www.news24.com/news24/world/news/watch-covid-19-cases-break-records-in-europe-prompting-booster-shot-rethink-20211124", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11731/3e05d549e7a547b09261392843b9852c.jpg", "publishedAt": "2021-11-24T18:44:30Z", "content": "<ul><li>Europe is again the epicentre of coronavirus infections as the continent is breaking new records.</li><li>The European Centre for Disease Prevention and Control is now recommending vaccine bo… [+5503 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Geir Moulson", "title": "German parties reach deal for government to end Merkel era - Associated Press", "description": "BERLIN (AP) — Germany's would-be governing parties vowed Wednesday to modernize Europe’s biggest economy and step up efforts against climate change as they announced an agreement that leaves center-left leader Olaf Scholz poised to replace longtime Chancellor…", "url": "https://apnews.com/9d65ea0d9b2c4a51da16faae14354d68/", "urlToImage": "https://storage.googleapis.com/afs-prod/media/9e5ceae13f864d93b4638d13e3f24a5c/3000.jpeg", "publishedAt": "2021-11-24T17:37:30Z", "content": "BERLIN (AP) Germanys would-be governing parties vowed Wednesday to modernize Europes biggest economy and step up efforts against climate change as they announced an agreement that leaves center-left … [+5229 chars]"}]}