{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": "Agency Report", "title": "EU unveils €150bn investment plan for Africa - Punch Newspapers", "description": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent's biggest and \"most reliable\" partner.", "url": "https://punchng.com/eu-unveils-e150bn-investment-plan-for-africa/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2019/07/16193245/Ursula-von-der-Leyen.png", "publishedAt": "2022-02-10T20:00:03Z", "content": "EU chief Ursula von der Leyen on Thursday unveiled plans to muster investment of more than 150 billion euros for Africa, proclaiming Europe to be the continent’s biggest and “most reliable” partner.\r… [+3441 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Vivian Omotori", "title": "UK candidates make it to next round of European Space Agency's astronaut call - TDPel Media", "description": "The window to apply for ESA’s astronaut vacancy opened on 31 March 2021 and closed 18 June. This is the first call for new astronauts in over 10 years and", "url": "https://tdpelmedia.com/uk-candidates-make-it-through-to-next-round-of-european-space-agencys-astronaut-call", "urlToImage": "https://tdpelmedia.com/wp-content/uploads/2021/02/fig-21-02-2021_08-51-31.jpg", "publishedAt": "2022-02-10T18:28:10Z", "content": "Skip to content\r\nThe window to apply for ESA’s astronaut vacancy opened on 31 March 2021 and closed 18 June.\r\nThis is the first call for new astronauts in over 10 years and the first-time candidates … [+1681 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Vladimir Isachenkov", "title": "UK's Johnson cites 'a dangerous moment' in Ukraine crisis - CP24 Toronto's Breaking News", "description": "British Prime Minister Boris Johnson said Thursday the Ukraine crisis has grown into “the most dangerous moment” for Europe in decades, while his top diplomat held icy talks with her Moscow counterpart who said the Kremlin won't accept lectures from the West.", "url": "https://www.cp24.com/world/uk-s-johnson-cites-a-dangerous-moment-in-ukraine-crisis-1.5775694", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5775933.1644505161!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-10T11:24:00Z", "content": "MOSCOW (AP) - British Prime Minister Boris Johnson said Thursday the Ukraine crisis has grown into the most dangerous moment for Europe in decades, while his top diplomat held icy talks with her Mosc… [+8145 chars]"}]}