{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Therepublic.com"}, "author": null, "title": "Riding the omicron variant waves: Health officials anticipate an increase in COVID-19 infections - The Republic", "description": "Local health officials say they expect to see an increase in COVID-19 infections in the coming weeks as a more contagious version of the omicron variant that is already driving up cases in Europe and Asia makes its way across the United States.", "url": "https://www.therepublic.com/2022/03/27/riding-the-omicron-variant-waves-health-officials-anticipate-an-increase-in-covid-19-infections/", "urlToImage": "https://www.therepublic.com/wp-content/uploads/2022/03/128453011_web1_20211217cr-command-ctr-2.jpg", "publishedAt": "2022-03-27T07:33:00Z", "content": "Local health officials say they expect to see an increase in COVID-19 infections in the coming weeks as a more contagious version of the omicron variant that is already driving up cases in Europe and… [+5636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I'll Be Blunt...\": Ukraine MP After Biden Speech In Neighbouring Poland - NDTV", "description": "A Member of Parliament in Ukraine has criticised US President Joe Biden for not doing enough to help the east European nation counter the Russian invasion, in its second month now.", "url": "https://www.ndtv.com/world-news/ill-be-blunt-says-ukraine-mp-inna-sovsun-after-joe-biden-speech-in-neighbouring-poland-2845646", "urlToImage": "https://c.ndtvimg.com/2022-03/g8v37deo_inna-sovsun_625x300_27_March_22.jpg", "publishedAt": "2022-03-27T04:06:26Z", "content": "Ukraine's MP Inna Sovsun said West should do more to help Ukraine\r\nNew Delhi: A Member of Parliament in Ukraine has criticised US President Joe Biden for not doing enough to help the east European na… [+2279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Kyle Feldscher, CNN", "title": "8 takeaways from Biden's trip to Europe - CNN", "description": "President Joe Biden used a last-minute trip to Europe this week to rally the world's democracies and announce more actions against Russia for its invasion of Ukraine, while also causing a geopolitical stir with one of the final lines from his speech in Poland.", "url": "https://www.cnn.com/2022/03/26/politics/biden-europe-trip-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220326134253-11-biden-poland-0326-super-tease.jpg", "publishedAt": "2022-03-26T22:00:00Z", "content": "(CNN)President Joe Biden used a last-minute trip to Europe this week to rally the world's democracies and announce more actions against Russia for its invasion of Ukraine, while also causing a geopol… [+15859 chars]"}, {"source": {"id": null, "name": "Gadgettendency.com"}, "author": "https://www.facebook.com/gadgettendencycom/", "title": "\"The fastest Redmi Note.\" The global Redmi Note 11 Pro+ 5G is already on sale in regular stores - features, price and box contents - Gadget Tendency", "description": "While Xiaomi is preparing for a big international presentation of the “fastest Redmi Note”, sales of the brand new Redmi Note 11 Pro + 5G are already starting in European retail stores. A photo of a smartphone and retail packaging was published by several sou…", "url": "https://gadgettendency.com/the-fastest-redmi-note-the-global-redmi-note-11-pro-5g-is-already-on-sale-in-regular-stores-features-price-and-box-contents/", "urlToImage": "https://gadgettendency.com/wp-content/uploads/2022/03/The-fastest-Redmi-Note-The-global-Redmi-Note-11-Pro.jpg", "publishedAt": "2022-03-26T11:24:07Z", "content": "The premiere of Nvidia’s new most powerful 3D card, the GeForce RTX 3090 Ti, will take place next week, but in the meantime, we can look at the source’s official images of several versions of the vid… [+1772 chars]"}]}