{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Lokmat.com"}, "author": "ANI", "title": "Talks with Pfizer, Moderna for Covid-19 vaccines under consideration, No conclusion yet: Dr VK Paul - Lokmat", "description": "Even as Pfizer's Covid vaccine has being authorised for use in children in the US and parts of Europe, Dr VK Paul, Member-Health at Niti Aayog said that approval to the coronavirus vaccines of Pfizer and Moderna is under consideration in India.The Pfizer vacc…", "url": "https://english.lokmat.com/national/talks-with-pfizer-moderna-for-covid-19-vaccines-under-consideration-no-conclusion-yet-dr-vk-paul/", "urlToImage": "https://d3pc1xvrcw35tl.cloudfront.net/ln/feedImages/686x514/paul_8_dWsQbXB_202106.jpg", "publishedAt": "2021-06-08T18:32:07Z", "content": "Talks with Pfizer, Moderna for Covid-19 vaccines under consideration, No conclusion yet: Dr VK Paul\r\nEven as Pfizer's Covid vaccine has being authorised for use in children in the US and parts of Eur… [+1866 chars]"}, {"source": {"id": null, "name": "BNNBloomberg.ca"}, "author": "Bloomberg News", "title": "Google Bows to EU, Rivals With Android Choice-Screen Tweaks - BNN", "description": "Google will scrap a fee and add more mobile search apps for users to choose from on new Android phones, bowing to pressure from the European Union and smaller rivals.", "url": "http://www.bnnbloomberg.ca/google-bows-to-eu-rivals-with-android-choice-screen-tweaks-1.1614167", "urlToImage": "http://www.bnnbloomberg.ca/polopoly_fs/1.1614168!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/a-google-inc-pixel-5-smartphone-is-demonstrated-for-an-arranged-photograph-taken-in-tokyo.jpg", "publishedAt": "2021-06-08T13:32:25Z", "content": "(Bloomberg) -- Google will scrap a fee and add more mobile search apps for users to choose from on new Android phones, bowing to pressure from the European Union and smaller rivals.\r\nThe U.S. tech gi… [+2222 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Sam Sholtis", "title": "New X-ray map reveals growing supermassive black holes in next-gen survey fields - Phys.org", "description": "One of the largest X-ray surveys using the European Space Agency's XMM-Newton space observatory has mapped nearly 12,000 X-ray sources across three large, prime regions of the sky. The X-ray sources represent active galactic nuclei and galaxy clusters, and th…", "url": "https://phys.org/news/2021-06-x-ray-reveals-supermassive-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/new-x-ray-map-reveals.jpg", "publishedAt": "2021-06-08T12:47:52Z", "content": "One of the largest X-ray surveys using the European Space Agency's XMM-Newton space observatory has mapped nearly 12,000 X-ray sources across three large, prime regions of the sky. The X-ray sources … [+5137 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": "Reuters", "title": "Moderna seeks European approval for COVID-19 vaccine's use in teens - Regina Leader-Post", "description": "Moderna Inc said on Monday it has submitted an application to the European drugs regulator seeking conditional approval for its COVID-19 vaccine’s use in…", "url": "https://financialpost.com/pmn/business-pmn/moderna-seeks-european-approval-for-covid-19-vaccines-use-in-teens-2", "urlToImage": null, "publishedAt": "2021-06-07T12:12:49Z", "content": "Moderna Inc said on Monday it has submitted an application to the European drugs regulator seeking conditional approval for its COVID-19 vaccines use in adolescents.\r\nThe company also said on Monday … [+742 chars]"}]}