{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Danica Kirka", "title": "What we know about the fire that brought London’s Heathrow Airport to a standstill - The Associated Press", "description": "Hundreds of flights to and from London’s Heathrow Airport were canceled after a fire at a nearby substation knocked out power to Europe’s busiest airport. The fire disrupted travel plans for hundreds of thousands of people around the world. Heathrow was back …", "url": "https://apnews.com/article/heathrow-closed-shut-down-flights-cancelled-19a2b7426526a9a5bbf6d0e31d28b2db", "urlToImage": "https://dims.apnews.com/dims4/default/d28d84e/2147483647/strip/true/crop/3890x2188+0+202/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F49%2Fd9%2F9288ba64ca2a211679ed0742026c%2F751a56f260494d23894606e3e6d7fab4", "publishedAt": "2025-03-22T10:16:00Z", "content": "LONDON (AP) Heathrow Airport was up and running Saturday and airlines worked to clear the backlog after a fire at a nearby electricity substation knocked out power to Europes busiest airport, disrupt… [+5697 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "U.S. detention of European and Canadian tourists creates fear over traveling to America - PBS NewsHour", "description": "Since President Donald Trump took office, there have been multiple incidents of tourists being stopped at U.S. border crossings and held for weeks at U.S. immigration detention facilities before being allowed to fly home at their own expense.", "url": "https://www.pbs.org/newshour/world/u-s-detention-of-european-and-canadian-tourists-creates-fear-over-traveling-to-america", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2025/03/2025-02-23T000454Z_1211279341_RC2LZCAULR9D_RTRMADP_3_MIGRATION-USA-MEXICO-1024x683.jpg", "publishedAt": "2025-03-21T22:41:07Z", "content": "SAN DIEGO (AP) Lennon Tyler and her German fiancé often took road trips to Mexico when he vacationed in the United States since it was only a day’s drive from her home in Las Vegas, one of the perks … [+7721 chars]"}]}