{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "POLITICO.eu"}, "author": "Paul Ames", "title": "Exit polls show Socialist victory in Portuguese general election - POLITICO Europe", "description": "António Costa looks set for third term.", "url": "http://www.politico.eu/article/exit-polls-show-socialist-victory-in-portuguese-general-election/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=628,fit=crop,quality=80,format=auto,onerror=redirect/wp-content/uploads/2022/01/30/GettyImages-1238084548.jpg", "publishedAt": "2022-01-30T20:49:03Z", "content": "LISBON The Socialist Party of Prime Minister António Costa is set for a surprisingly comfortable victory in Sundays Portuguese general election, according to exit polls, setting up Costas third conse… [+2306 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Russia can choose negotiations or sanctions, Canada's defence minister says in Ukraine - CBC News", "description": "Defence Minister Anita Anand arrived in a snowy Kyiv on Sunday and echoed the warnings of western allies about the looming threat of an invasion by Russia amid an increasingly frosty international deadlock over the crisis in eastern Europe.", "url": "https://www.cbc.ca/news/politics/anand-ukraine-visit-russia-1.6332841", "urlToImage": "https://i.cbc.ca/1.6332856.1643550139!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/anand-ukraine.JPG", "publishedAt": "2022-01-30T18:57:52Z", "content": "Defence Minister Anita Anand arrived in a snowy Kyiv on Sunday and echoed the warnings of western allies about the looming threat of an invasion by Russia amid an increasingly frosty international de… [+5155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Clear Message To Kremlin\": UK Preps Big Troop Deployment In Europe - NDTV", "description": "Britain is poised to offer NATO a \"major\" deployment of troops, weapons, warships and jets in Europe, Prime Minister Boris Johnson announced Saturday, to respond to rising \"Russian hostility\" towards Ukraine.", "url": "https://www.ndtv.com/world-news/uk-to-offer-nato-major-military-deployment-in-europe-boris-johnson-2737586", "urlToImage": "https://c.ndtvimg.com/2022-01/fu954c9k_uk-troops_625x300_30_January_22.jpg", "publishedAt": "2022-01-30T03:50:00Z", "content": "\"This package would send a clear message to the Kremlin,\" Boris Johnson said.\r\nLondon: Britain is preparing to offer NATO a \"major\" deployment of troops, weapons, warships and jets in Europe, Prime M… [+3072 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Britain considering major NATO deployment amid Ukraine crisis as Russia encourages rebels to join army - ABC News", "description": "Britain says it is considering making a major NATO deployment as part of a plan to strengthen Europe's borders in response to Russia massing troops on the border with Ukraine.", "url": "https://www.abc.net.au/news/2022-01-30/russia-politician-encourages-rebel-area-ukraine-join-army/100790618", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/3063e6c32d87c80728b193d8fcc2fca6?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=74&width=862&height=485", "publishedAt": "2022-01-29T19:54:01Z", "content": "Britain is considering making a major NATO deployment as part of a plan to strengthen Europe's borders in response to Russia massing troops on the border with Ukraine, the government has said.\r\nKey p… [+6417 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "Is Infinix rolling out a phone with Dimensity 900 chipset and 5G? - TechCabal", "description": "Since 2013, Infinix has been growing in sales in parts of Europe and Asia, increasing patronage on new releases. Infinix released a premium lineup of Zero X series towards the tail end of last year, sporting MediaTek Helio G chipsets. It appears another model…", "url": "https://techcabal.com/2022/01/29/is-infinix-rolling-out-a-phone-with-dimensity-900-chipset-and-5g/", "urlToImage": "https://lh4.googleusercontent.com/ZWtXL4PD1cJdni1MBBQQDZlT-uVV5iDQJ07wdTuYYTgsf7f2uzRs6fRdt6d2gHOAQ3xVB2KgN8M7Z7hmesDHyly9mycIEgGkGS7kU8nxh4KT8jgQ3L2iXCOF3rlfqPCdjM7W_Nai", "publishedAt": "2022-01-29T10:41:51Z", "content": "Since 2013, Infinix has been growing in sales in parts of Europe and Asia, increasing patronage on new releases. Infinix released a premium lineup of Zero X series towards the tail end of last year, … [+1256 chars]"}]}