{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Huaweiupdate.com"}, "author": "Amit", "title": "Mate 30 Pro September 2022 security patch released - Huawei Update", "description": "Huawei Mate 30 Pro European units are reportedly grabbing the September 2022 security patch update. The latest software update is", "url": "https://www.huaweiupdate.com/mate-30-pro-september-2022-security-patch-released/", "urlToImage": "https://i0.wp.com/www.huaweiupdate.com/wp-content/uploads/2022/09/Mate-30-Pro-September-2022-security-patch.png?fit=1280%2C750&ssl=1", "publishedAt": "2022-09-18T13:51:08Z", "content": "Huawei Mate 30 Pro European units are reportedly grabbing the September 2022 security patch update. The latest software update is rolling out with the fresh build number 12.0.0.270 and it comes based… [+786 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lorne Cook", "title": "EU proposes to suspend billions in funds to Hungary - The Associated Press - en Español", "description": "BRUSSELS (AP) — The European Union’s executive branch recommended Sunday that the bloc suspend around 7.5 billion euros (dollars) in funding to Hungary over concerns about democratic backsliding and the possible mismanagement of EU money.", "url": "https://apnews.com/article/hungary-executive-branch-viktor-orban-aefd56b81ace179655d58ba0735dd292", "urlToImage": "https://storage.googleapis.com/afs-prod/media/8b34480b06c24c5abbc501fe19c8f77b/3000.jpeg", "publishedAt": "2022-09-18T09:00:11Z", "content": "BRUSSELS (AP) The European Unions executive branch recommended Sunday that the bloc suspend around 7.5 billion euros (dollars) in funding to Hungary over concerns about democratic backsliding and the… [+4250 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Barney Calman", "title": "NHS rejects ketamine for depression as psychiatrists accuse NICE of mental health discrimination - Daily Mail", "description": "Spravato (pictured), a nasal spray also known as esketamine, got the green light from the European Medicines Agency in December 2019 as a fast-acting treatment for depression sufferers.", "url": "https://www.dailymail.co.uk/health/article-11222317/NHS-rejects-ketamine-depression-psychiatrists-accuse-NICE-mental-health-discrimination.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/17/15/62509625-0-image-a-28_1663426560385.jpg", "publishedAt": "2022-09-17T21:01:05Z", "content": "A row has broken out between NHS spending watchdogs and top mental health doctors over approval of a controversial ketamine-based antidepressant.\r\nSpravato, a nasal spray also known as esketamine, go… [+5211 chars]"}]}