{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Could the European hedgehog be a sentinel for infectious agents and a harbinger of environmental pollution? - News-Medical.Net", "description": "A recent review paper by Portuguese and Spanish authors, recently published in the journal Biologics, revealed the current state of knowledge regarding hedgehog health – most notably the presence of infectious agents, diseases and other threats that can affec…", "url": "https://www.news-medical.net/news/20210621/Could-the-European-hedgehog-be-a-sentinel-for-infectious-agents-and-a-harbinger-of-environmental-pollution.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2021/6/shutterstock_1600247428.jpg", "publishedAt": "2021-06-21T16:27:00Z", "content": "A recent review paper by researchers in Portugal and Spain, published in the journal Biologics, revealed the current state of knowledge regarding hedgehog health – most notably the presence of infect… [+4776 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "ISS Astronauts Complete First Roll-Out Solar Array Installation During 6+ Hour Spacewalk - SciTechDaily", "description": "NASA astronaut Shane Kimbrough and ESA (European Space Agency) astronaut Thomas Pesquet concluded their spacewalk at 2:10 p.m. EDT, after 6 hours and 28 minutes. In the eighth spacewalk of the year outside the International Space Station, the two astronauts c…", "url": "https://scitechdaily.com/iss-astronauts-complete-first-roll-out-solar-array-installation-during-6-hour-spacewalk/", "urlToImage": "https://scitechdaily.com/images/Spacewalkers-Prepare-Roll-Out-Solar-Array.jpg", "publishedAt": "2021-06-21T09:29:32Z", "content": "Spacewalkers Shane Kimbrough (foreground) and Thomas Pesquet work to prepare the second roll out solar array ready for installation an upcoming spacewalk. Credit: NASA\r\nNASA astronaut Shane Kimbrough… [+3653 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "Ilyen nincs: az öt éve kárunkra tévedő orosz bíró vezeti a német–magyart - Goal.com", "description": "The 2021 Euros feature 24 teams vying for the European Championship for national teams. The tournament starts off with a round-robin group stage followed by knockout rounds through the final on July 11. Check out the latest standings and results.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-06-21T09:11:48Z", "content": ""}]}