{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "OpIndia"}, "author": "S. Sudhir Kumar", "title": "Even as India was shining after the G20 summit, Shekhar Gupta could not get over old habits – obsession with terror factory Pakistan - OpIndia", "description": "While we were all rejoicing at the monumental announcement of the India-Middle East-Europe Economic Corridor during the G20, Shekhar Gupta was obsessing about Pakistan | OpIndia News", "url": "https://www.opindia.com/2023/09/india-shining-g20-summit-shekhar-gupta-old-habits-obsession-pakistan/", "urlToImage": "https://www.opindia.com/wp-content/uploads/2023/09/5f37c8eca8875.png", "publishedAt": "2023-09-14T09:01:33Z", "content": "Old habits die hard. Pakistans focus on grooming terrorists to attack India is one such habit. Brave jawans and officers of our army continue to scuttle their attacks to ensure we civilians are safe.… [+4546 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "French regulators say iPhone 12 emits too much radiation, Apple must take it off market - PBS NewsHour", "description": "French regulators have ordered Apple to stop selling the iPhone 12, saying it emits electromagnetic radiation levels that are above European Union standards for exposure.", "url": "https://www.pbs.org/newshour/science/french-regulators-say-iphone-12-emits-too-much-radiation-apple-must-take-it-off-market", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/09/2021-06-24T221949Z_387821155_RC267O9P8HV2_RTRMADP_3_USA-APPLE-1024x683.jpg", "publishedAt": "2023-09-13T22:19:53Z", "content": "PARIS (AP) French regulators ordered Apple to stop selling the iPhone 12, saying it emits electromagnetic radiation levels that are above European Union standards for exposure. The company disputed t… [+4160 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "EU announces investigation into Chinese electric carmaker subsidies | DW News - DW News", "description": "The European Union has announced an investigation into Chinese electric carmakers. Brussels suspects state help from Beijing is giving them an unfair sales a...", "url": "https://www.youtube.com/watch?v=_2UbZC2oJZM", "urlToImage": "https://i.ytimg.com/vi/_2UbZC2oJZM/maxresdefault.jpg", "publishedAt": "2023-09-13T18:13:01Z", "content": null}]}