{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Shaw", "title": "Greece extends border wall amid European fears of Afghan migrant wave - Fox News", "description": "Greece announced on Friday that it has extended its border wall with Turkey as part of its efforts to stop migrants coming up from Afghanistan -- amid European fears of an Afghan migrant wave sparked by the Taliban takeover.", "url": "https://www.foxnews.com/world/greece-extends-border-wall-european-fears-afghan-migrant-wave", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/AP21232595558464.jpg", "publishedAt": "2021-08-21T20:15:56Z", "content": "Greece announced on Friday that it has extended its border wall with Turkey as part of its efforts to stop migrants coming up from Afghanistan -- amid European fears of an Afghan migrant wave sparked… [+2957 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "EU warns Taliban it has not recognised their regime - TheJournal.ie", "description": "European humanitarian aid to Afghanistan will hinge on the Taliban respecting human rights.", "url": "https://www.thejournal.ie/eu-humanitarian-support-afghanistan-human-rights-5528693-Aug2021/", "urlToImage": "https://img2.thejournal.ie/article/5528693/river/?height=400&version=5528700", "publishedAt": "2021-08-21T18:02:00Z", "content": "THE EUS TOP officials warned the Taliban today that the current conversations being held to secure the exit of as many Afghan evacuees as possible do not mean the bloc is prepared to recognise the ne… [+3741 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "MAGDALENE FUNG", "title": "Singapore's Covid-19 travel lane with Germany: Should you go? - The Straits Times", "description": "ST assesses pandemic life in the European powerhouse to help you decide.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/singapore/singapores-covid-19-travel-lane-with-germany-should-you-go", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/08/21/yq-germanytourism-21082021.jpg?itok=YmIxLuIs", "publishedAt": "2021-08-21T10:30:00Z", "content": "SINGAPORE - Singapore's plan to pilot leisure travel for those vaccinated against Covid-19 - starting with Germany - has given cheer to travel-starved residents who have been kept at home by the coro… [+11598 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Dylan Jack", "title": "Move the Rugby Championship to Europe, say fans - SARugbymag", "description": "Fans are keen to see the Rugby Championship break new ground by being completed in Europe, following the cancellation of the Springboks’ scheduled fixtures in New Zealand.", "url": "https://www.sarugbymag.co.za/move-rugby-championship-to-europe-say-fans/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2021/07/TW_0091312-1024x494.jpg", "publishedAt": "2021-08-21T06:25:45Z", "content": "Fans are keen to see the Rugby Championship break new ground by being completed in Europe, following the cancellation of the Springboks scheduled fixtures in New Zealand.\r\nThe original Rugby Champion… [+1834 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Restructuring: Afenifere tackles FG, says agitations for secession justified - Guardian", "description": "The Afenifere Group in the United Kingdom (UK) and Europe has said the Federal Government’s refusal to restructure the country gives credence", "url": "https://guardian.ng/news/restructuring-afenifere-tackles-fg-says-agitations-for-secession-justified/", "urlToImage": "https://guardian.ng/wp-content/uploads/2018/11/Adebanji-Akintoye.jpg", "publishedAt": "2021-08-21T03:12:00Z", "content": "Adebanji Akintoye is a retired Professor of History and an Afenifere leader\r\nThe Afenifere Group in the United Kingdom (UK) and Europe has said the Federal Governments refusal to restructure the coun… [+1916 chars]"}]}