{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Jesse O’Neill", "title": "Here’s how much it will cost to travel to see total solar eclipses in Iceland, Spain, Egypt and Australia - New York Post ", "description": "If last week’s eclipse left you wanting more, now’s the time to start thinking about planning trips to Europe, Africa and Australia, which will all see total solar eclipses over the nex…", "url": "https://nypost.com/2024/04/14/us-news/heres-how-much-it-will-cost-to-travel-to-see-total-solar-eclipses-in-iceland-spain-egypt-and-australia/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/04/total-solar-eclipse-august-2-79828759.jpg?quality=75&strip=all&w=1024", "publishedAt": "2024-04-14T12:11:00Z", "content": "For those who were left totally wanting more after last week’s eclipse, it’s not too early to start thinking about trips to Europe, African and Australia — which will all see total solar eclipses ove… [+4454 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "WATCH: Astronaut shows around International Space Station in this VIRAL video - WION", "description": "A European Space Agency (ESA) astronaut recently provided a virtual tour of the International Space Station (ISS) to the public. The ISS, the largest space station ever built, orbits low Earth and is managed collaboratively by five space agencies: NASA, JAXA,…", "url": "https://www.wionews.com/world/watch-astronaut-shows-around-international-space-station-in-this-viral-video-711153", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/04/14/425011-the-battle-for-kyiv-2024-04-14t162311203.jpg", "publishedAt": "2024-04-14T10:37:56Z", "content": "A European Space Agency (ESA) astronaut recently provided a virtual tour of the International Space Station (ISS) to the public. The ISS, the largest space station ever built, orbits low Earth and is… [+2055 chars]"}]}