{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Katherine Tangalakis-Lippert", "title": "Listen to the haunting audio of Earth's magnetic field released by the European Space Agency - Business Insider South Africa", "description": "Loudspeakers at Solbjerg Square in Copenhagen, Denmark, are broadcasting the recording of the crackling and deep breathing-like sounds.", "url": "https://www.businessinsider.co.za/european-space-agency-releases-haunting-audio-of-earth-magnetic-field-2022-10", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3969/a2052b675cd94a19a601afaf31e2c507.jpg", "publishedAt": "2022-10-30T07:57:59Z", "content": "The European Space Agency this week released five minutes of haunting, crackling audio — revealing what Earth's magnetic field sounds like.\r\nEarth's internal magnetism, called the magnetosphere, gene… [+1515 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "European Union bans sale of petrol and diesel cars from 2035 to boost electric vehicle uptake - ABC News", "description": "The European Union strikes a deal to effectively ban the sale of new petrol and diesel cars from 2035, aiming to speed up the switch to electric vehicles and combat climate change.", "url": "https://www.abc.net.au/news/2022-10-29/eu-ban-new-fossil-fuel-cars-boost-ev-uptake/101593696", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/6e8767a617fba407a4598ac1a2cac4bb?impolicy=wcms_crop_resize&cropH=2807&cropW=4990&xPos=5&yPos=0&width=862&height=485", "publishedAt": "2022-10-29T03:11:19Z", "content": "The European Union has struck a deal on a law to effectively ban the sale of new petrol and diesel cars from 2035, aiming to speed up the switch to electric vehicles and combat climate change.\r\nKey p… [+2598 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL", "title": "Iran Rejects Call For UN Probe Into Russian Use Of Its Drones In Ukraine War - Radio Free Europe / Radio Liberty", "description": "Iran has criticized a call by France, Germany, and Britain for the United Nations to investigate accusations that Russia has used Iranian-made drones to attack Ukraine.", "url": "https://www.rferl.org/a/iran-drones-rejects-un-probe-ukraine-russia/32095904.html", "urlToImage": "https://gdb.rferl.org/FECB0B29-DF64-491A-9353-F8C889F87C80_w1200_r1.jpg", "publishedAt": "2022-10-22T10:18:35Z", "content": "Ukraine's military says Russia is massing troops on the right bank of the Dnieper River as both sides appear poised for what could be a key battle for Kherson in Ukraine's south, while Russian offici… [+5488 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL's Ukrainian Service", "title": "'Massive' Russian Strikes Leave Millions In Ukraine Without Power; Russia Orders Kherson Evacuation - Radio Free Europe / Radio Liberty", "description": "Ukrainian forces shelled Russian positions in the occupied and illegally seized southern Kherson region, targeting Moscow's resupply routes across the Dnieper River in apparent preparation for a full assault on Kherson city.", "url": "https://www.rferl.org/a/ukraine-kherson-recapturing-territory-dam-evacuation/32095755.html", "urlToImage": "https://gdb.rferl.org/009e0000-0aff-0242-a4c7-08da94833dd2_cx0_cy10_cw0_w1200_r1.jpg", "publishedAt": "2022-10-22T06:59:52Z", "content": "KYIV -- Ukrainian officials said vile Russian missile strikes on civilian energy sites have caused power outages nationwide, leaving more than a million households without electricity, while Russian … [+5797 chars]"}]}