{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "David Goldman", "title": "Trump threatens 200% tariff on European alcohol as trade war escalates - CNN", "description": "President Donald Trump on Thursday threatened to impose a massive tariff on European alcohol in response to the European Union’s retaliation against his steel and aluminum tariffs – a tit-for-tat escalation of a trade war that could easily get out of hand.", "url": "https://www.cnn.com/2025/03/13/business/alcohol-tariffs-eu-trump-trade-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1178871042.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-13T13:41:15Z", "content": "President Donald Trump on Thursday threatened to impose a massive tariff on European alcohol in response to the European Unions retaliation against his steel and aluminum tariffs a tit-for-tat escala… [+5557 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Dharvi Vaid", "title": "Spain: Scientists uncover oldest face in Western Europe - DW (English)", "description": "The facial bones of an adult nicknamed \"Pink,\" unearthed in Spain, rewrite humankind's early history in Europe.", "url": "https://www.dw.com/en/spain-scientists-uncover-oldest-face-in-western-europe/a-71907278", "urlToImage": "https://static.dw.com/image/71905340_6.jpg", "publishedAt": "2025-03-13T07:51:14Z", "content": "Scientists in Spain have excavated fossilized facial bones that may be from a previously unknown species of the human family.\r\nThe bones are roughly 1.1 million to 1.4 million years old, according to… [+1891 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Hera asteroid mission spies Mars’s Deimos moon - European Space Agency", "description": "While performing yesterday’s flyby of Mars, ESA’s Hera mission for planetary defence made the first use of its payload for scientific purposes beyond Earth and the Moon. Activating a trio of instruments, Hera imaged the surface of the red planet as well as th…", "url": "https://www.esa.int/Space_Safety/Hera/Hera_asteroid_mission_spies_Mars_s_Deimos_moon", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2025/03/sir_brian_may_and_the_rest_of_hera_s_science_team_see_mars_image_arrive/26615674-1-eng-GB/Sir_Brian_May_and_the_rest_of_Hera_s_science_team_see_Mars_image_arrive_pillars.jpg", "publishedAt": "2025-03-12T14:33:20Z", "content": "Space Safety13/03/20253085 views22 likes\r\nWhile performing yesterdays flyby of Mars, ESAs Hera mission for planetary defence made the first use of its payload for scientific purposes beyond Earth and… [+4647 chars]"}]}