{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Novavax approved in EU as fifth vaccine effective against COVID-19 | DW News - DW News", "description": "The European Union's medicines regulator has approved a new coronavirus vaccine made by US biotech company Novavax. It's the fifth jab to be greenlighted for...", "url": "https://www.youtube.com/watch?v=10ieSiDI0dA", "urlToImage": "https://i.ytimg.com/vi/10ieSiDI0dA/maxresdefault.jpg", "publishedAt": "2021-12-20T18:15:42Z", "content": null}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "AFP", "title": "EU health watchdog approves fifth Covid vaccine - TheJournal.ie", "description": "This will be the fifth Covid-19 vaccine approved for use in the European Union.", "url": "https://www.thejournal.ie/novavax-eu-approval-5635718-Dec2021/", "urlToImage": "https://img2.thejournal.ie/article/5635718/river/?height=400&version=5635719", "publishedAt": "2021-12-20T15:36:00Z", "content": "Updated 1 hour ago\r\nEUROPES MEDICINES WATCHDOG has approved a Covid jab by US-based Novavax, which uses a more conventional technology that the biotech firm hopes will reduce vaccine hesitancy.\r\nThe … [+3967 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "EU regulator approves fifth Covid-19 vaccine - RT", "description": "The European Medicines Agency (EMA) has recommended the use of a Covid-19 vaccine made by US-based biotech firm Novavax for people aged 18 and older. Trial data suggests the vaccine is 90% effective.", "url": "https://www.rt.com/news/543772-ema-covid19-novavax-jab-coronavirus/", "urlToImage": "https://cdni.rt.com/files/2021.12/article/61c08f522030275953472af3.JPG", "publishedAt": "2021-12-20T14:13:00Z", "content": "On Monday, the EMA backed the use of Nuvaxovid, a vaccine developed by Novavax, for adults, making it the fifth Covid shot to date to be given the green light by the bloc’s drugs regulator.  \r\n“After… [+1815 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Ben Hall", "title": "Nato open to dialogue with Russia on European security demands - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/b3db6084-a190-44e6-8182-053d6371e6ee", "urlToImage": null, "publishedAt": "2021-12-20T13:59:08Z", "content": "Get local insights from Lisbon to Moscow with an unrivalled network of journalists across Europe,\r\nexpert analysis, our dedicated Brussels Briefing newsletter. Customise your myFT page to track\r\nthe … [+24 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Omicron fears send Bursa, regional markets lower - The Star Online", "description": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling in equities.", "url": "https://www.thestar.com.my/business/business-news/2021/12/20/omicron-fears-send-bursa-regional-markets-lower", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/12/20/1413398.JPG", "publishedAt": "2021-12-20T05:03:00Z", "content": "KUALA LUMPUR: The FBM KLCI extended its decline headed into midday as fears over the spread of the Omicron variant of Covid-19 intensified restriction measures in Europe and triggered global selling … [+1049 chars]"}]}