{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "French Guiana: Jupiter Icy Moons Explorer Mission postponed due to weather - The Telegraph", "description": "The European Space Agency is set to launch a satellite to Jupiter today in its biggest deep-space mission yet to explore whether its ocean-bearing moons can ...", "url": "https://www.youtube.com/watch?v=vQGasQ5E0zI", "urlToImage": "https://i.ytimg.com/vi/vQGasQ5E0zI/maxresdefault.jpg", "publishedAt": "2023-04-13T12:19:30Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "The Juice mission will soon launch to Jupiter's icy ocean worlds - CNN", "description": "The European Space Agency is about to send a spacecraft to explore Jupiter and three of its largest and most intriguing moons. The Jupiter Icy Moons Explorer missior, or Juice, is expected to launch on Thursday at 8:15 a.m ET.", "url": "https://www.cnn.com/2023/04/13/world/esa-jupiter-juice-mission-launch-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230104105917-esa-juice-mission-rendering.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-13T08:25:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nThe European Space Agency is about to send a spacecraf… [+6776 chars]"}, {"source": {"id": null, "name": "The Economist"}, "author": "The Economist", "title": "The hunt for life on Jupiter's icy moons - The Economist", "description": "Our podcast on science and technology. This week, our second episode on the hunt for life elsewhere—exploring the European Space Agency’s JUICE mission", "url": "https://www.economist.com/juice-pod", "urlToImage": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20230415_PDP566.jpg", "publishedAt": "2023-04-12T18:35:12Z", "content": "ON APRIL 13TH, the European Space Agency will launch a spacecraft towards Jupiter and three of its icy moonsGanymede, Europa and Callisto. The JUICE mission will carry ten instruments to the outer so… [+1357 chars]"}]}