{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Demetri Sevastopulo, Kathrin Hille", "title": "US warns Europe a conflict over Taiwan could cause global economic shock - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/c0b815f3-fd3e-4807-8de7-6b5f72ea8ae5", "urlToImage": null, "publishedAt": "2022-11-10T22:21:56Z", "content": "What is included in my trial?\r\nDuring your trial you will have complete digital access to FT.com with everything in both of our Standard Digital and Premium Digital packages.\r\nStandard Digital includ… [+1493 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "ESO images a wondrous star factory to mark 60 years of collaboration - Phys.org", "description": "For the past 60 years the European Southern Observatory (ESO) has been enabling scientists worldwide to discover the secrets of the universe. We mark this milestone by bringing you a spectacular new image of a star factory, the Cone Nebula, taken with ESO's V…", "url": "https://phys.org/news/2022-11-eso-images-wondrous-star-factory.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/eso-images-a-wondrous.jpg", "publishedAt": "2022-11-10T13:00:01Z", "content": "For the past 60 years the European Southern Observatory (ESO) has been enabling scientists worldwide to discover the secrets of the universe. We mark this milestone by bringing you a spectacular new … [+3314 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Diarmuid Pepper", "title": "Bank of Ireland immediately raises interest rates by 0.25% for new fixed rate mortgages - TheJournal.ie", "description": "Bank of Ireland says the move is ‘in light of recent interest rate increases by the European Central Bank’.", "url": "https://www.thejournal.ie/bank-of-ireland-immediately-raises-interest-rates-by-0-25-for-new-fixed-rate-mortgages-5915803-Nov2022/", "urlToImage": "https://img2.thejournal.ie/article/5915803/river/?height=400&version=5915808", "publishedAt": "2022-11-10T12:27:25Z", "content": "BANK OF IRELAND is set to raise interest rates by 0.25% for new fixed rate mortgages.\r\nIn a statement, Bank of Ireland says the move is in light of recent interest rate increases by the European Cent… [+1391 chars]"}]}