{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Measles highest in 25 years in European region, WHO says - BBC.com", "description": "Children under five constituted more than 40% of the cases reported in Europe and Central Asia last year.", "url": "https://www.bbc.com/news/articles/cy9dyp8e81zo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/f18b/live/ef898a10-fffa-11ef-a8b1-950887ddc6e5.jpg", "publishedAt": "2025-03-13T14:31:40Z", "content": "The rise is attributed to increasing scepticism about immunisation\r\nThe number of measles cases in the European region doubled last year to reach the highest level in 25 years, health officials say.\r… [+2953 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Goldman", "title": "Trump threatens 200% tariff on European alcohol as trade war escalates - CNN", "description": "President Donald Trump on Thursday threatened to impose a massive tariff on European alcohol in response to the European Union’s retaliation against his steel and aluminum tariffs – a tit-for-tat escalation of a trade war that could easily get out of hand.", "url": "https://www.cnn.com/2025/03/13/business/alcohol-tariffs-eu-trump-trade-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1178871042.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-03-13T13:41:15Z", "content": "President Donald Trump on Thursday threatened to impose a massive tariff on European alcohol in response to the European Unions retaliation against his steel and aluminum tariffs a tit-for-tat escala… [+5557 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Snow White: Disney holds small-scale European premiere amid controversy - BBC.com", "description": "The film is being released as debate continues about the way dwarfs re represented", "url": "https://www.bbc.com/news/articles/cvg1n00qknro", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/5b0b/live/776c7b40-0005-11f0-8c3d-b7dcc7510cb1.jpg", "publishedAt": "2025-03-13T12:18:54Z", "content": "Annabel Rackham and Steven McIntosh\r\nRachel Zegler performed at the film's European premiere, held in at a castle in Northern Spain\r\nDisney's live-action remake of Snow White is set to be released in… [+6128 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Dharvi Vaid", "title": "Spain: Scientists uncover oldest face in Western Europe - DW (English)", "description": "The facial bones of an adult nicknamed \"Pink,\" unearthed in Spain, rewrite humankind's early history in Europe.", "url": "https://www.dw.com/en/spain-scientists-uncover-oldest-face-in-western-europe/a-71907278", "urlToImage": "https://static.dw.com/image/71905340_6.jpg", "publishedAt": "2025-03-13T07:51:14Z", "content": "Scientists in Spain have excavated fossilized facial bones that may be from a previously unknown species of the human family.\r\nThe bones are roughly 1.1 million to 1.4 million years old, according to… [+1891 chars]"}]}