{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Pallavi Singhal", "title": "India-Middle East-Europe economic corridor more significant than silk and spice routes: Saudi minister - Moneycontrol", "description": "Prime Minister Narendra Modi on September 9 announced the launch of the India-Middle East-Europe mega economic corridor during G20 summit. The project includes India, the UAE, Saudi Arabia, the European Union, France, Italy, Germany and the US", "url": "https://www.moneycontrol.com/news/world/india-middle-east-europe-economic-corridor-more-significant-than-silk-and-spice-routes-saudi-minister-11349771.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/09/Saudi-Prince-Mohammed-bin-Salman-770x433.png", "publishedAt": "2023-09-11T13:22:18Z", "content": "India-Middle East- Europe economic corridor will be more significant than the silk and spice routes of the world, Saudis Investment Minister Khalid bin Abdulaziz Al-Falih has said.\r\nThe economic corr… [+1809 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Kids growing up in cities suffer from more respiratory infections, finds study - Times of India", "description": "Two studies presented at the European Respiratory Society International Congress in Milan, Italy talks about the effect of enviromental factors on the immune system of kids. Young children growing up in towns and cities suffer from more respiratory infections…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/kids-growing-up-in-cities-suffer-from-more-respiratory-infections-finds-study/photostory/103574936.cms", "urlToImage": "https://static.toiimg.com/photo/103575014.cms", "publishedAt": "2023-09-11T09:39:57Z", "content": "“Our findings suggest that urban living is an independent risk factor for developing infections in early life when taking account of several related factors such as exposure to air pollution and star… [+374 chars]"}]}