{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Www.tsn.ca"}, "author": "TSN.ca Staff", "title": "CanMNT announces roster for Sept. friendlies - TSN", "description": "Canada announced its 27-man roster for a pair of friendlies in Europe later this month as the team gears up for November's World Cup. John Herdman's side meets World Cup hosts Qatar in Austria on Sept. 23 before travelling to Slovakia to take on South America…", "url": "https://www.tsn.ca/canada-canmnt-roster-uruguay-qatar-world-cup-2022-1.1849685", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1715171!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/alphonso-davies.jpg", "publishedAt": "2022-09-16T16:36:21Z", "content": "Canada announced its 27-man roster for a pair of friendlies in Europe later this month as the team gears up for November's World Cup.\r\nJohn Herdman's side meets World Cup hosts Qatar in Austria on Se… [+1862 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Mark MacKinnon", "title": "Burial site with 445 bodies outside Izyum shows evidence of war crimes, Ukraine says - The Globe and Mail", "description": "Hundreds of bodies discovered in the newly liberated Kharkiv region would represent the biggest unmarked grave in Europe since the aftermath of the Balkan wars of the 1990s", "url": "https://www.theglobeandmail.com/world/article-mass-burial-site-outside-izyum-shows-evidence-of-war-crimes-ukraine/", "urlToImage": "https://www.theglobeandmail.com/resizer/OIBMDGog9PLH9hGCABo4_ukhs4I=/1200x800/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/WRE54ILNPJHYRNPVEAHGAZ2IEU.JPG", "publishedAt": "2022-09-16T15:20:54Z", "content": "Most of the graves outside Izyum, which could represent the largest mass burial discovered in Europe since the Balkan wars of the 1990s ,were marked only with a simple cross and a number.Anton Skyba/… [+7571 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Video-based program successful in treating children with obesity - EurekAlert", "description": "Children and adolescents with obesity lost weight and showed improvements in metabolic health after following a 12-month, video-based weight loss programme, according to research presented today at the 60th Annual European Society for Paediatric Endocrinology…", "url": "https://www.eurekalert.org/news-releases/964234", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/0da89bb7-8150-456e-a7da-844ef1a7e773/Rendition/thumbnail/Content/Public", "publishedAt": "2022-09-15T23:46:24Z", "content": "image: Example screenshot from the KiCK video-based programme for weight loss in children.view more \r\nCredit: Felix Reschke\r\nChildren and adolescents with obesity lost weight and showed improvements … [+7574 chars]"}, {"source": {"id": null, "name": "Soccernet.ng"}, "author": "Rilwan Balogun", "title": "Forgotten ex-Golden Eaglets star scores in Europe; Olayinka scores again to extend Slavia record - Soccernet.ng", "description": "The 30-year-old former U-17 star was a member of the 2009 Golden Eaglets team that emerged runners up in Nigeria Yusuf Otubanjo, a former U-17 and U-23 international was on the scoresheet for Armenian side, Pjunik Yerevan as they defeated in Slovan Bratislava…", "url": "https://soccernet.ng/2022/09/forgotten-ex-golden-eaglets-star-scores-in-europe-olayinka-scores-again-to-extend-slavia-record.html", "urlToImage": "https://soccernet.ng/wp-content/uploads/2022/09/AAFCFA41-0041-4D9E-99DC-12E7C18B9393.jpeg", "publishedAt": "2022-09-15T20:48:44Z", "content": "The 30-year-old former U-17 star was a member of the 2009 Golden Eaglets team that emerged runners up in Nigeria\r\nYusuf Otubanjo, a former U-17 and U-23 international was on the scoresheet for Armeni… [+1320 chars]"}]}