{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Dailytrust.com"}, "author": null, "title": "Women who take paracetamol more likely to have kids with autism or ADHD, study warns - Daily Trust", "description": "Women who take paracetamol while pregnant are more likely to give birth to children who have autism or Attention Deficit Hyperactivity Disorder (ADHD), according to a major international study. Health data on more than 70,000 children in six European countrie…", "url": "https://dailytrust.com/women-who-take-paracetamol-more-likely-to-have-kids-with-autism-or-adhd-study-warns", "urlToImage": "https://cms.dailytrust.com.ng/wp-content/uploads/2021/05/daily-trust-logo.jpg", "publishedAt": "2021-06-08T02:27:08Z", "content": "Women who take paracetamol while pregnant are more likely to give birth to children who have autism or Attention Deficit Hyperactivity Disorder (ADHD), according to a major international study.\r\nHeal… [+1878 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "PR Newswire", "title": "New X-ray map reveals the growing supermassive black holes in next-generation survey fields - Yahoo Finance", "description": "For the first time, one of the largest X-ray surveys using the European Space Agency's XMM-Newton space observatory has captured the growth of supermassive...", "url": "https://finance.yahoo.com/news/x-ray-map-reveals-growing-204000455.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/ztedtyX7X3.VLtJHx4mLSw--~B/aD04MDt3PTQwMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/prnewswire.com/9a87134e8fe156d896e5fcb5bddd7ccb", "publishedAt": "2021-06-07T20:40:00Z", "content": "The XMM-SERVS survey lays key groundwork for studying the cosmic history and physical properties of active galaxies\r\nCOLUMBIA, Md., June 7, 2021 /PRNewswire/ -- For the first time, one of the largest… [+6893 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Agence France-Presse", "title": "Moderna seeks approval of COVID-19 vaccine for teens in Europe, Canada - INQUIRER.net", "description": "WASHINGTON — US biotech firm Moderna said Monday it was seeking conditional approval for use of its COVID-19 vaccine on teens in Europe and Canada, in what will assuredly be a boost for", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/02/000_9392EJ-620x388.jpg", "publishedAt": "2021-06-07T12:45:00Z", "content": "In this file photo, Registered Nurse Emily Enos loads the Moderna COVID-19 vaccine into a syringe ahead of the distribution of vaccines to seniors above the age of 65 who are experiencing homelessnes… [+1315 chars]"}, {"source": {"id": "the-hindu", "name": "The Hindu"}, "author": "AP", "title": "Hungarians protest against planned Chinese university campus - The Hindu", "description": "If completed, it would be the first Chinese university campus in the 27-nation European Union.", "url": "https://www.thehindu.com/news/international/hungarians-protest-against-planned-chinese-university-campus/article34749753.ece", "urlToImage": "https://www.thehindu.com/news/international/ijzqs1/article34749752.ece/ALTERNATES/LANDSCAPE_615/thnakHungaryProtestjpg", "publishedAt": "2021-06-07T06:23:31Z", "content": "Several thousand people rallied in Hungarys capital Saturday against plans by Prime Minister Viktor Orban to host a Chinese university in Budapest. \r\nA strategic agreement that Hungary signed with Sh… [+1921 chars]"}]}