{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Scienceboard.net"}, "author": "The Science Advisory Board staff writers", "title": "Scientists create cell atlas of developing human lung - The Science Board", "description": "Researchers from the Wellcome Sanger Institute, EMBL’s European Bioinformatics Institute, the Gordone Institute at the University of Cambridge, and collaborators have created a spatiotemporal cell atlas of the developing human lung. From the mapping, they hav…", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=5105", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_can/2022_08_23_13_13_0913_lung_general_social.jpg", "publishedAt": "2022-12-09T15:44:24Z", "content": "The study, published December 8 in the journal Cell, is part of the Human Cell Atlas initiative to map every cell in the human body. The researchers examined which genes are activated in different st… [+2446 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sibusiso Mjikeliso", "title": "Springbok artillery rested as White heavily rotates Bulls for Champions Cup - News24", "description": "Bulls director of rugby Jake White selected a heavily-rotated side for their first-ever European encounter when they face French club Lyon at Loftus.", "url": "https://www.news24.com/sport/rugby/unitedrugbychampionship/springbok-artillery-rested-as-white-heavily-rotates-bulls-for-europe-20221209", "urlToImage": null, "publishedAt": "2022-12-09T12:45:10Z", "content": "Bulls director of rugby Jake White selected a heavily-rotated side for their first-ever Champions Cup encounter when they face French club Lyon at Loftus Versfeld on Saturday (19:30).\r\nBereft of any … [+2670 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Japanese dengue vaccine becomes second approved by EU - The Star Online", "description": "TOKYO (AFP): Japanese pharmaceutical company Takeda said the European Union had given the green light to its dengue fever vaccine, making it the second jab preventing the disease to be approved by the bloc.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/12/09/japanese-dengue-vaccine-becomes-second-approved-by-eu", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/12/09/1856413.jpg", "publishedAt": "2022-12-09T11:07:00Z", "content": "TOKYO (AFP): Japanese pharmaceutical company Takeda said the European Union had given the green light to its dengue fever vaccine, making it the second jab preventing the disease to be approved by th… [+1055 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Dylan Jack", "title": "Dupont lashes out at Saffas in Champions Cup - SARugbymag", "description": "Antoine Dupont, the 2021 World Player of the Year, hit out at the inclusion of South African teams in the new-look Champions Cup, saying it was \"no longer the European Cup\".", "url": "https://www.sarugbymag.co.za/dupont-lashes-saffas-champions-cup/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/12/09836853.jpg", "publishedAt": "2022-12-09T06:01:01Z", "content": "Antoine Dupont, the 2021 World Player of the Year, hit out at the inclusion of South African teams in the new-look Champions Cup, saying it was “no longer the European Cup”.\r\nThe DHL Stormers, Sharks… [+3047 chars]"}]}