{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "#SpaceTrends: Massive Solar Flare Creates A Larger-than-Usual Northern Lights Show | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "Some residents from the United States, Canada and Europe, who usually have to travel north to catch a glimpse of these lights, were lucky enough to observe this phenomenon from their own backyards. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2021-10-14-solar-flare-creates-a-larger-than-usual-northern-lights-show", "urlToImage": "https://s.w-x.co/in-northern%20lights%20%281%29.jpg", "publishedAt": "2021-10-15T04:54:22Z", "content": "Almost everyone aware of the northern lights dreams of observing the phenomenon at least once in their lifetime. But for a fortunate few that don't usually get to see these lights from their cities, … [+1845 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Migrant tenant shocked her landlord only allows white people to rent her properties - Stuff.co.nz", "description": "An Auckland woman is horrified her landlord told her the only reason she was allowed to rent a home in Remuera was because she initially thought she was European.", "url": "https://www.stuff.co.nz/business/126664900/migrant-tenant-shocked-her-landlord-only-allows-white-people-to-rent-her-properties", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/t/h/n/6/image.related.StuffLandscapeSixteenByNine.1420x800.23ev9g.png/1634265633507.jpg", "publishedAt": "2021-10-15T01:36:00Z", "content": "An Auckland woman is horrified her landlord told her the only reason she was allowed to rent a home in the suburb of Remuera was because the landlord initially thought she was European.\r\n She [the la… [+5251 chars]"}, {"source": {"id": null, "name": "Overtells.com"}, "author": "Arzu", "title": "Shocking image taken by the Hubble telescope: the moment when two constellations merge | They are located one hundred million light-years from Earth - OverTells Gaming", "description": "Space telescope NASA and the European Space Agency's Hubble captured the image of a \"dangerous dance\" of two combined galaxies.. They are two spiral", "url": "https://overtells.com/shocking-image-taken-by-the-hubble-telescope-the-moment-when-two-constellations-merge-they-are-located-one-hundred-million-light-years-from-earth/", "urlToImage": "https://images.pagina12.com.ar/styles/focal_16_9_960x540/public/2021-10/219989-whatsapp-20image-202021-10-13-20at-2020-22-59.jpeg?itok=Ghfng5fr", "publishedAt": "2021-10-14T08:03:38Z", "content": "Space telescope NASA and the European Space Agency’s Hubble captured the image of a “dangerous dance” of two combined galaxies.. They are two spiral galaxies about a hundred million light-years from … [+1252 chars]"}]}