{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Nord Stream ruptures revealed as Europe grapples with gas plan - Reuters", "description": "Damage to the Nord Stream gas pipeline from Russia to Europe was caused by powerful explosions, Danish police said on Tuesday, echoing earlier findings into leaks that erupted in the network under the Baltic Sea and that have been blamed on sabotage.", "url": "https://www.reuters.com/business/energy/nord-stream-ruptures-revealed-europe-grapples-with-gas-plan-2022-10-18/", "urlToImage": "https://www.reuters.com/resizer/u-d6GdHiNiIGSR9fpYZzThOve-M=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NWT7A4GJO5JURJWWRV7P7A4DXA.jpg", "publishedAt": "2022-10-18T17:53:00Z", "content": "COPENHAGEN/BRUSSELS , Oct 18 (Reuters) - Damage to the Nord Stream gas pipeline from Russia to Europe was caused by powerful explosions, Danish police said on Tuesday, echoing earlier findings into l… [+4975 chars]"}, {"source": {"id": null, "name": "Philippine Star"}, "author": null, "title": "German youths take climate case against government to European court - Philstar.com", "description": "The constitutional court would not accept another complaint on the same case, DUH said, leaving the activists with no choice to but appeal to the ECHR.", "url": "https://www.philstar.com/world/2022/10/18/2217621/german-youths-take-climate-case-against-government-european-court", "urlToImage": "https://media.philstar.com/photos/2022/10/18/flood-germany2021-07-1709-02-19_2022-10-18_18-37-20.jpg", "publishedAt": "2022-10-18T10:33:00Z", "content": "BERLIN — Climate activists who won a landmark case against the German government last year are now taking their case to the European Court of Human Rights, an organisation representing them said on T… [+1463 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lloyd Burnard", "title": "Elton Jantjies sidelined from Springbok tour, team dietician Simjee returns - News24", "description": "Elton Jantjies will not be part of the Springbok squad that will travel to Europe for four Tests in November, casting further doubts over his international future.", "url": "https://www.news24.com/sport/rugby/springboks/elton-jantjies-sidelined-from-springbok-tour-team-dietician-simjee-returns-20221018", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3929/7fe4a1d7273441319ac17afd3cff12fc.jpg", "publishedAt": "2022-10-18T08:34:59Z", "content": "<ul><li>Elton Jantjies will not be selected for the Springboks' year-end tour to Europe. </li><li>Director of rugby Rassie Erasmus says it was difficult to pick Jantjies given his lack of game time. … [+3718 chars]"}, {"source": {"id": null, "name": "Teslarati"}, "author": "https://www.facebook.com/13ericralph31", "title": "European spacecraft converge on the US for rides on SpaceX rockets - TESLARATI", "description": "Thanks in large part to delays suffered by Arianespace’s next-generation Ariane 6 rocket, a small fleet of European satellites are simultaneously converging on the United States to hitch rides into orbit with SpaceX. SpaceX launching European payloads is noth…", "url": "https://www.teslarati.com/european-spacecraft-spacex-falcon-9-launches/", "urlToImage": "https://www.teslarati.com/wp-content/uploads/2022/10/Hotbird-13G-KSC-Florida-arrival-Eutelsat-Airbus-1-crop-c.jpg", "publishedAt": "2022-10-18T06:16:07Z", "content": "Thanks in large part to delays suffered by Arianespace’s next-generation Ariane 6 rocket, a small fleet of European satellites are simultaneously converging on the United States to hitch rides into o… [+6522 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Kim Arendse", "title": "All about the clairvoyant Norwegian princess and her shaman fiancé who 'met in a previous life' | You - News24", "description": "Princess Märtha Louise of Norway and her fiancé, Durek Verrett, are head-over-heels in love – and if she marries him he’ll become the first black man to wed into a European royal family.", "url": "https://www.news24.com/you/royals/news/all-about-the-clairvoyant-norwegian-princess-and-her-shaman-fiance-who-met-in-a-previous-life-20221017", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7429/d9e90ae799b241cbab0ee94bc74b4640.jpg", "publishedAt": "2022-10-17T13:19:24Z", "content": "Theirs is a match made in heaven, they believe – a romance rooted in a previous life when she was a queen and he a pharaoh in ancient Egypt. Their stars are aligned, their thoughts in tune, their che… [+429 chars]"}]}