{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Christoph Rauwald", "title": "Germany Votes With Polls Pointing to Merz Victory: What to Watch - Bloomberg", "description": "German voters are choosing the next leaders of Europe’s biggest economy on Sunday with polls suggesting a likely victory for the opposition conservatives under Friedrich Merz and a bitter loss for Chancellor Olaf Scholz and his Social Democrats.", "url": "https://www.bloomberg.com/news/articles/2025-02-23/germany-votes-with-polls-pointing-to-merz-victory-what-to-watch", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iEOOF18E83Sc/v1/1200x800.jpg", "publishedAt": "2025-02-23T07:04:00Z", "content": "German voters are choosing the next leaders of Europes biggest economy on Sunday with polls suggesting a likely victory for the opposition conservatives under Friedrich Merz and a bitter loss for Cha… [+406 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Jill Lawless, Sylvie Corbet", "title": "The leaders of France and Britain head to Washington to urge Trump not to abandon Ukraine - The Associated Press", "description": "The leaders of France and Britain are making tag-team visits to Washington this week. It's part of European efforts to persuade President Donald Trump not to abandon Ukraine in pursuit of a peace deal in the three-year-old war with Russia. There is an element…", "url": "https://apnews.com/article/starmer-macron-uk-france-washington-trump-ukraine-5255fa5fb225145065cacdd437d6723f", "urlToImage": "https://dims.apnews.com/dims4/default/40f94a7/2147483647/strip/true/crop/2544x1431+0+133/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6b%2F7a%2F4757a351e5e04a25f62065810d62%2F3101a8dec33041b98e20159c8705bad3", "publishedAt": "2025-02-23T05:02:00Z", "content": "LONDON (AP) The leaders of France and Britain are making tag-team visits to Washington this week as Europe attempts to persuade President Donald Trump not to abandon Ukraine in pursuit of a peace dea… [+5159 chars]"}]}