{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Conspiracy Theories, Drawing Inspiration From US, Take Root In Europe - NDTV", "description": "\"It's not a virus, it's a tool to use power,\" says Monique Lustig in the Netherlands, while in Germany, Hellmuth Mendel argues that \"Covid is a story invented by an international financial mafia\". \"And what if this was all just a film?\" asks Christop", "url": "https://www.ndtv.com/world-news/covid-conspiracy-theories-drawing-inspiration-from-us-take-root-in-europe-2444685", "urlToImage": "https://c.ndtvimg.com/2021-05/gdj3qqho_a-demonstrator-holds-a-qanon-flag-and-a-poster-reading-freedom-during-a-protest-against-covid-restrictions-650_625x300_19_May_21.jpeg", "publishedAt": "2021-05-19T05:49:16Z", "content": "A demonstrator holds a QAnon flag and a poster during a protest against Covid restrictions in Austria.\r\nParis, France: \"It's not a virus, it's a tool to use power,\" says Monique Lustig in the Netherl… [+17222 chars]"}, {"source": {"id": null, "name": "Swordstoday.ie"}, "author": "Jake Pearson", "title": "Jupiter's fourth largest moon may contain life-giving pockets of water - SwordsToday.ie", "description": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of", "url": "https://swordstoday.ie/jupiters-fourth-largest-moon-may-contain-life-giving-pockets-of-water/", "urlToImage": "", "publishedAt": "2021-05-19T03:41:11Z", "content": "The team of scientists has revealed that there are pockets of water inside the icy surface that can sustain life in Europe, the fourth largest moon of Jupiter.\r\nA team from the Georgia Institute of T… [+2636 chars]"}, {"source": {"id": null, "name": "Icirnigeria.org"}, "author": "Vincent Ufuoma", "title": "Nigerians advised to consider other social media platforms as WhatsApp implements new policy | International Centre for Investigative Reporting - Internatinal Centre For Investigative Reporting", "description": "THE National Information Technology Development Agency (NITDA) has advised Nigerians to consider adopting other social media platforms as WhatsApp implements a new privacy policy for its users worldwide, except countries under the European Union.The", "url": "https://www.icirnigeria.org/nigerians-advised-to-consider-other-social-media-platforms-as-whatsapp-implements-new-policy/", "urlToImage": "https://www.icirnigeria.org/wp-content/uploads/2020/08/WhatsApp-Image-2020-08-23-at-9.18.57-PM.jpeg", "publishedAt": "2021-05-18T11:36:02Z", "content": "We need your support to produce excellent journalism at all times. \r\nTHE National Information Technology Development Agency (NITDA) has advised Nigerians to consider adopting other social media platf… [+3064 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Joshua Posaner", "title": "Eurostar says it’s been saved by French railways and other investors - POLITICO Europe", "description": "The company will start ramping up daily trains between London and Paris, Brussels and Amsterdam later this month.", "url": "http://www.politico.eu/article/eurostar-finances-saved-french-railways/", "urlToImage": "https://www.politico.eu/wp-content/uploads/2021/05/18/GettyImages-1230380632-1200x628.jpg", "publishedAt": "2021-05-18T08:30:25Z", "content": "Cross-Channel railway Eurostar says it is no longer at risk of collapse after its shareholders, including its French majority owner SNCF, agreed to back a refinancing deal with banks worth £250 milli… [+1391 chars]"}]}