{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Earth orbit, Moon, Mars: ESA's ambitious roadmap - Phys.org", "description": "In a bold vision to secure Europe's role in space exploration and so benefit from the many scientific, economic, and societal rewards, ESA is publicly releasing its new exploration roadmap after its presentation to its Council, the agency's highest ruling bod…", "url": "https://phys.org/news/2022-07-earth-orbit-moon-mars-esa.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/earth-orbit-moon-mars.jpg", "publishedAt": "2022-07-05T15:59:29Z", "content": "In a bold vision to secure Europe's role in space exploration and so benefit from the many scientific, economic, and societal rewards, ESA is publicly releasing its new exploration roadmap after its … [+3643 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Alex Lawson", "title": "UK gas prices hit three-month high as Norway workers strike - The Guardian", "description": "European energy crisis intensifies amid suspension of production in Equinor oil and gas fields", "url": "https://amp.theguardian.com/business/2022/jul/05/uk-gas-prices-norway-strike-energy-equinor-oil", "urlToImage": null, "publishedAt": "2022-07-05T14:01:00Z", "content": "GasEuropean energy crisis intensifies amid suspension of production in Equinor oil and gas fields\r\nNorwegian gas supplies to the UK could be shut off this weekend if a dispute over pay for oil and ga… [+4222 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "CERN collider will help study 'dark matter': All you need to know | Tech in Trend | WION Originals - WION", "description": "Scientists at Europe's physics research centre will on Tuesday (July 5) start delivering proton collisions in the 27 kilometer-long Large Hadron Collider (LH...", "url": "https://www.youtube.com/watch?v=kXWjG6nEFv0", "urlToImage": "https://i.ytimg.com/vi/kXWjG6nEFv0/maxresdefault.jpg", "publishedAt": "2022-07-05T13:02:14Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Bob Yirka", "title": "Cause of 'staggering' disease in cats in Europe unraveled - Phys.org", "description": "A large team of researchers affiliated with multiple institutions in Germany, Austria and Sweden has found the virus behind the mysterious \"staggering\" disease killing cats across Europe. The group has written a paper describing their work but it has not yet …", "url": "https://phys.org/news/2022-07-staggering-disease-cats-europe-unraveled.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/staggering-disease-in.jpg", "publishedAt": "2022-07-05T12:51:34Z", "content": "Sequence comparison of complete rustrela virus (RusV) genome sequences from cats from Sweden, Austria, and Germany. (a) The amino acid sequences of the structural polyprotein (p110/sPP) of all known … [+3951 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "SUNDY LOCUS, GMA News", "title": "EU invites Marcos to visit Brussels for a meeting on foreign policy issues - GMA News Online", "description": "The European Union (EU) has invited President Ferdinand &quot;Bongbong&quot; Marcos Jr. to visit its headquarters in Brussels, Belgium to discuss foreign policy issues and bilateral relations between the Philippines and the bloc.&nbsp;", "url": "https://www.gmanetwork.com/news/topstories/nation/837146/eu-invites-marcos-to-visit-brussels-for-a-meeting-on-foreign-policy-issues/story/", "urlToImage": "https://images.gmanews.tv/webpics/2018/05/European_Union_flags_2018_05_05_01_29_04.JPG", "publishedAt": "2022-07-05T12:05:07Z", "content": "The European Union (EU) has invited President Ferdinand \"Bongbong\" Marcos Jr. to visit its headquarters in Brussels, Belgium to discuss foreign policy issues and bilateral relations between the Phili… [+1640 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Rare clouds that glow in the dark are seen in upper US, Canada and Europe - Daily Mail", "description": "Noctilucent clouds were observed in parts of western US, Europe and Canada. The clouds consist of ice crystals that become visible when the sun is shining from blow the horizon.", "url": "https://www.dailymail.co.uk/sciencetech/article-10981137/Rare-clouds-glow-dark-seen-upper-Canada-Europe.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/04/19/59856717-0-image-a-30_1656959075847.jpg", "publishedAt": "2022-07-04T18:53:44Z", "content": "The rarest clouds on Earth were spotted by sky watchers in parts of western US, Europe and Canada over the weekend a vibrant display that has not been seen in about 15 years.\r\nKnown as noctilucent, t… [+4865 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "Monkeypox virus mutations 'challenging' what we know - DW (English)", "description": "New research suggests that monkeypox is mutating surprisingly fast in Europe and North America. The study shows how little we know about the virus.", "url": "https://www.dw.com/en/monkeypox-virus-mutations-challenging-what-we-know/a-62349012", "urlToImage": "https://static.dw.com/image/61918041_6.jpg", "publishedAt": "2022-07-04T14:29:18Z", "content": "The monkeypox virus spreading across the US, Europe and the UK is mutating surprisingly fast, according to a study conducted by Portuguese researchers and published in the journal Nature Medicine. Th… [+5296 chars]"}]}