{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Amit Kamath", "title": "Germany once ruled world javelin. Now, as Neeraj Chopra soars, they plot a return to the top - The Indian Express", "description": "While three Indians finished in the top-6 at the World Athletics Championships, just one German javelin thrower, Julian Weber, was in Budapest. The Indian Express talks to the three men who led the European country’s dominance – Olympic champion Thomas Rohler…", "url": "https://indianexpress.com/article/sports/sport-others/germany-once-ruled-world-javelin-now-as-neeraj-chopra-soars-they-plot-a-return-to-the-top-8920635/", "urlToImage": "https://images.indianexpress.com/2023/09/Javelin.jpg", "publishedAt": "2023-09-02T06:04:50Z", "content": "Not too long ago, the talk in track and field circles was about a golden generation of javelin throwers emerging from Germany, all of them having breached the hallowed 90m mark, a distance considered… [+9517 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Ted Bosworth", "title": "ESC Issues First Comprehensive Cardiomyopathy Guidelines - Medscape", "description": "The European Society of Cardiology has released the first major set of international guidelines to address cardiomyopathies beyond hypertrophic forms.", "url": "https://www.medscape.com/viewarticle/996083", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_220906_human_heart-circulatory_system_800x450.jpg", "publishedAt": "2023-09-01T20:51:16Z", "content": "The European Society of Cardiology has released new guidelines for cardiomyopathies, their first major comprehensive international guidelines to address diagnosis and treatment of the broad causes of… [+5541 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "European pricing for Google Pixel 8 and Pixel 8 Pro surfaces online before October launch - Notebookcheck.net", "description": "European pricing for the Pixel 8 and Pixel 8 Pro has now turned up online, weeks before the pair's launch alongside the Pixel Watch 2. Allegedly, the Pixel 8 series will start with 128 GB of storage in Europe; a 512 GB variant will not be offered for the smal…", "url": "https://www.notebookcheck.net/European-pricing-for-Google-Pixel-8-and-Pixel-8-Pro-surfaces-online-before-October-launch.745659.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/pixel8proheader222.jpeg", "publishedAt": "2023-09-01T16:57:30Z", "content": "The Tech Outlook claims to have received official European pricing for the Pixel 8 and Pixel 8 Pro, Google's next-generation smartphones. For reference, the website claims that these prices include 2… [+1387 chars]"}]}