{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Kerry Breen", "title": "A spacecraft captured images of \"spiders\" on the surface of Mars. Here's what they really are. - CBS News", "description": "The creepy patterns were observed by the European Space Agency's ExoMars Trace Gas Orbiter.", "url": "https://www.cbsnews.com/news/spiders-mars-surface-images-esa-orbiter/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2024/04/25/3bafccde-97c9-4f5c-a806-cb475e7262d4/thumbnail/1200x630/9386a4959fb9db9152ea8c21870cfa54/screen-shot-2024-04-25-at-12-12-07-pm.png?v=63c131a0051f3823d92b0d1dffb5e0e4", "publishedAt": "2024-04-25T16:33:56Z", "content": "A unique phenomenon that could be mistaken for spiders scuttling across the planet's surface has been spotted on Mars, according to the European Space Agency.\r\nThe ESA said in a news release that one… [+2190 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "Recently discovered black hole is part of a nearby disrupted star cluster, study finds - Phys.org", "description": "European astronomers have investigated a recently detected black hole designated Gaia BH3. In their results, they found that the black hole is associated with a nearby disrupted star cluster known as ED-2. The finding is reported in a paper published April 17…", "url": "https://phys.org/news/2024-04-black-hole-nearby-disrupted-star.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/recently-discovered-bl.jpg", "publishedAt": "2024-04-25T12:40:01Z", "content": "This article has been reviewed according to Science X's \r\neditorial process\r\nand policies.\r\nEditors have highlighted\r\nthe following attributes while ensuring the content's credibility:\r\nfact-checked\r… [+359 chars]"}, {"source": {"id": null, "name": "Eumetsat.int"}, "author": null, "title": "Image of the week: Earth view for Earth Day - EUMETSAT", "description": "EUMETSAT’s Meteosat satellites are a key part of the global ring of geostationary weather satellites and observe the Earth over Europe, Africa and the Indian Ocean. See their current view from our Earth view stream.Earth Day is an annual event held on 22 Apri…", "url": "https://www.eumetsat.int/image-week-earth-view-earth-day", "urlToImage": "https://www-cdn.eumetsat.int/files/2024-04/IOW-Aspot-earth.jpg", "publishedAt": "2024-04-24T12:22:45Z", "content": "Earth image\r\nThis image was captured by the imaging instrument on board the Meteosat-11 weather satellite.\r\nThe Meteosat weather satellites provide imagery for the early detection of fast-developing … [+214 chars]"}]}