{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Football Espana"}, "author": "Alan Feehely", "title": "Carlo Ancelotti's expected Real Madrid starting lineup for El Clasico with Barcelona revealed - Football Espana", "description": "Barcelona welcome Real Madrid to Camp Nou this Sunday afternoon in El Clasico, the most iconic fixture in the European game. Both sides are living different moments. Madrid are under the command of Carlo Ancelotti and sit third in La Liga, three points behind…", "url": "https://www.football-espana.net/2021/10/24/carlo-ancelottis-expected-real-madrid-starting-lineup-for-el-clasico-with-barcelona-revealed", "urlToImage": "https://icdn.football-espana.net/wp-content/uploads/2021/04/Karim-Benzema-4.jpg", "publishedAt": "2021-10-24T10:23:50Z", "content": "Barcelona welcome Real Madrid to Camp Nou this Sunday afternoon in El Clasico, the most iconic fixture in the European game. Both sides are living different moments.\r\nMadrid are under the command of … [+2313 chars]"}, {"source": {"id": null, "name": "Vaughantoday.ca"}, "author": "Jillian Castillo", "title": "mediacongo.net - News - An international team has provided proof of the validity of Einstein's theory of relativity there - Vaughan Today", "description": "Astronomers made these stunning observations using the European Southern Observatory’s Large Telescope located in the Atacama Desert in Chile. The biggest discovery is this: the star’s orbit shaped like a…", "url": "https://www.vaughantoday.ca/mediacongo-net-news-an-international-team-has-provided-proof-of-the-validity-of-einsteins-theory-of-relativity-there/", "urlToImage": "https://www.vaughantoday.ca/wp-content/uploads/2021/10/mediacongonet-News-An-international-team-has-provided-proof.jpg", "publishedAt": "2021-10-24T01:46:47Z", "content": "Astronomers made these stunning observations using the European Southern Observatory’s Large Telescope located in the Atacama Desert in Chile. The biggest discovery is this: the star’s orbit shaped l… [+2768 chars]"}]}