{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Facebook faces ‘devastating’ EU-to-US data transfer ban - Al Jazeera English", "description": "The social media giant failed to block a bid that could ban it from sending data about its European users to the US.", "url": "https://www.aljazeera.com/economy/2021/5/14/facebook-faces-devastating-data-transfer-ban-after-irish-ruling", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/05/fb.jpg?resize=1200%2C630", "publishedAt": "2021-05-14T20:04:29Z", "content": "Irelands data regulator can resume a probe that may trigger a ban on Facebooks transatlantic data transfers, the High Court ruled on Friday, raising the prospect of a stoppage that the company warns … [+2882 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "https://www.facebook.com/nkooverjee", "title": "Volkswagen Golf GTI tuned to Clubsport-levels by Manhart Performance - Carmag South Africa", "description": "The all-new eighth-generation Volkswagen Golf GTI is soon to arrive in SA without its hard-edged Clubsport 45 counterpart. Although this derivative is available in Europe, German-based tuner Manhart has put together a package for the standard GTI to match the…", "url": "https://www.carmag.co.za/news/new-models/volkswagen-golf-gti-tuned-manhart/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/05/Volkswagen-Golf-GTI-tuned-to-Clubsport-levels-by-Manhart-Performance-1.jpg", "publishedAt": "2021-05-14T12:47:47Z", "content": "The all-new eighth-generation Volkswagen Golf GTI is soon to arrive in SA without its hard-edged Clubsport 45 counterpart. Although this derivative is available in Europe, German-based tuner Manhart … [+1848 chars]"}, {"source": {"id": null, "name": "Thecherawchronicle.com"}, "author": "Haley Howe", "title": "Reducing emissions of carbon dioxide in the stratosphere, which could affect GPS and satellites - Cheraw Chronicle", "description": "Emissions Carbon Dioxide Man shrinks the stratosphere. According to a new study published on the website of European Geosciences Federation. We've known", "url": "https://www.thecherawchronicle.com/reducing-emissions-of-carbon-dioxide-in-the-stratosphere-which-could-affect-gps-and-satellites/", "urlToImage": null, "publishedAt": "2021-05-13T15:30:42Z", "content": "Emissions Carbon Dioxide Man shrinks the stratosphere. According to a new study published on the website of European Geosciences Federation.\r\nWe’ve known for quite some time that carbon dioxide (carb… [+1892 chars]"}]}