{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Sibusiso Mjikeliso", "title": "13-man Sharks beat Harlequins in enthralling, controversial Champions Cup opener - News24", "description": "Both sides scored five tries, Ox Nche suffered a red card, three players scored doubles as the Sharks beat Harlequins 39-31 in an enthralling, yet controversial first South African game in the European Champions Cup at Kings Park on Saturday.", "url": "https://www.news24.com/sport/rugby/unitedrugbychampionship/13-man-sharks-beat-harlequins-in-enthralling-controversial-champions-cup-opener-20221210", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7625/69a9d89cdece48f8b1cc854c188bf660.jpg", "publishedAt": "2022-12-10T15:37:04Z", "content": "South Africa’s historic first game as European Champions Cup participants had all the ingredients of refereeing drama, thrilling finishes and spectacular tries that rugby lovers enjoy as the Sharks b… [+4168 chars]"}, {"source": {"id": "wired", "name": "Wired"}, "author": "Boone Ashworth", "title": "Dyson’s Zone Air Purifying Headphones Will Cost $950 - WIRED", "description": "Plus: Apple expands its repair program in Europe, Google Chrome becomes less of a resource hog, and the FTC objects to Microsoft’s purchase of Activision Blizzard.", "url": "https://www.wired.com/story/dyson-zone-air-purifying-headset-costs-950-dollars/", "urlToImage": "https://media.wired.com/photos/63938708d87d46df54e99d13/191:100/w_1280,c_limit/Dyson-Zone-Mask-Gear-Roundup-Gear.jpg", "publishedAt": "2022-12-10T14:00:00Z", "content": "If you live somewhere with a great deal of air pollution, or are just eager to prepare for a dystopia where you have to shut your ears and mouth to the outside world, the Dyson Zone could be for you.… [+2659 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Niamh Kennedy, Chris Liakos", "title": "European Parliament vice president expelled by party amid corruption probe involving Gulf nation - CNN", "description": "Eva Kaili, one of the European Parliament's vice presidents, has been expelled by her political party in Greece amid a corruption probe.", "url": "https://www.cnn.com/2022/12/09/europe/eva-kaili-european-parliament-greece-expelled-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221209193710-eva-kaili-file-120922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-10T01:46:00Z", "content": "Eva Kaili, one of the European Parliaments vice presidents, has been expelled by her political party in Greece amid a corruption probe. \r\nThe Panhellenic Socialist Movement (PASOK), one of Greeces ma… [+1848 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "AFP", "title": "Japanese dengue vaccine becomes second approved by EU - GMA News Online", "description": "Japanese pharmaceutical company Takeda said the European Union had given the green light to its dengue fever vaccine, making it the second jab preventing the disease to be approved by the bloc.", "url": "https://www.gmanetwork.com/news/topstories/world/854044/japanese-dengue-vaccine-becomes-second-approved-by-eu/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/05/reeltime5_2021_05_21_21_56_49.jpg", "publishedAt": "2022-12-09T14:17:55Z", "content": "TOKYO, Japan - Japanese pharmaceutical company Takeda said the European Union had given the green light to its dengue fever vaccine, making it the second jab preventing the disease to be approved by … [+1078 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Dylan Jack", "title": "Dupont lashes out at Saffas in Champions Cup - SARugbymag", "description": "Antoine Dupont, the 2021 World Player of the Year, hit out at the inclusion of South African teams in the new-look Champions Cup, saying it was \"no longer the European Cup\".", "url": "https://www.sarugbymag.co.za/dupont-lashes-saffas-champions-cup/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/12/09836853.jpg", "publishedAt": "2022-12-09T06:01:01Z", "content": "Antoine Dupont, the 2021 World Player of the Year, hit out at the inclusion of South African teams in the new-look Champions Cup, saying it was “no longer the European Cup”.\r\nThe DHL Stormers, Sharks… [+3047 chars]"}]}