{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Highlights: Maccabi Playtika Tel Aviv vs Kiryat Ata 94:68 | תקציר הניצחון של מכבי על קרית אתא - Maccabi Tel Aviv Basketball", "description": "Maccabi Tel Aviv is the biggest basketball club in Israel and one of the biggest in Europe, having won six European Cups and 108 official titles in total. Ma...", "url": "https://www.youtube.com/watch?v=HbL-_3eFUj4", "urlToImage": "https://i.ytimg.com/vi/HbL-_3eFUj4/maxresdefault.jpg", "publishedAt": "2022-10-11T16:03:29Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen", "title": "A colonoscopy study has some wondering if they should have the procedure. What you should know - CNN", "description": "A new European study on colonoscopies -- the largest of its kind -- has complicated results, and it's left some people wondering whether they should have the procedure to screen for colon cancer.", "url": "https://www.cnn.com/2022/10/10/health/colonoscopy-study-q-and-a-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210616144146-colon-cancer-vls.jpg?q=x_2,y_0,h_1078,w_1915,c_crop/w_800", "publishedAt": "2022-10-11T14:23:00Z", "content": "A new European study on colonoscopies the largest of its kind has complicated results, and its left some people wondering whether they should have the procedure to screen for colon cancer.\r\nI think t… [+4336 chars]"}, {"source": {"id": null, "name": "Irish Mirror"}, "author": "Eithne Dodd, Anita McSorley", "title": "Revolut pulling out of Ireland and in process of dismantling its Dublin operations - Irish Mirror", "description": "Revolut currently serves its Irish customers using its new European full banking licence.", "url": "https://www.irishmirror.ie/news/irish-news/revolut-pulling-out-ireland-process-28209281", "urlToImage": "https://i2-prod.rsvplive.ie/news/irish-news/article26878831.ece/ALTERNATES/s1200/0_revolut-loto.jpg", "publishedAt": "2022-10-11T12:09:32Z", "content": "Financial technology company Revolut has reportedly abandoned plans to run its western European business from a hub in Dublin.\r\nThe Irish Independent report that it's currently in the process of dism… [+3014 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "¿Cuánto falta para el fin del mundo? Agencia Espacial Europea hizo el cálculo - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/appearance/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2022-10-10T20:22:15Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}]}