{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "India Today"}, "author": null, "title": "Prince Philip, a Greek Royal family member to Britain’s longest serving consort - India Today", "description": "Prince Philip, Queen Elizabeth's husband, died at the age of 99 on April 9. From a member of the Greek Royal family to Britain’s longest serving consort, his life spanned nearly a century of European history.", "url": "https://www.indiatoday.in/lifestyle/people/story/prince-philip-a-greek-royal-family-member-to-britain-s-longest-serving-consort-1789156-2021-04-09", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202104/PHILIP-647x363.jpeg?xBlTq1dWOQHRDiUSdijVCB2lFeOQhQU0", "publishedAt": "2021-04-09T11:55:46Z", "content": "Prince Philip, the irascible and tough-minded husband of Queen Elizabeth II who spent more than seven decades supporting his wife in a role that both defined and constricted his life, has died, Bucki… [+12146 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "How worried should we be about links of blood clots to AstraZeneca's COVID-19 vaccine? - CNA", "description": "ZURICH: Europe's drug regulator on Wednesday (Apr 7) said it had found a possible link between AstraZeneca's COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recommended people under 30 get an alternative COVID-19 vaccine if…", "url": "https://www.channelnewsasia.com/news/world/astrazeneca-vaccine-blood-clots-link-side-effects-covid-19-14589124", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14589122/16x9/991/557/284606733a8d1eb321f683bfb1845e3f/LM/covid-19-vaccinations-in-madrid-2.jpg", "publishedAt": "2021-04-09T10:24:27Z", "content": "ZURICH: Europe's drug regulator on Wednesday (Apr 7) said it had found a possible link between AstraZeneca's COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recomm… [+5232 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "John Miller, Ludwig Burger", "title": "How worried should we be about links of blood clots to AstraZeneca's vaccine? - Reuters", "description": "Europe's drug regulator on Wednesday said it had found a possible link between AstraZeneca's COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recommended people under 30 get an alternative COVID-19 vaccine if possible.", "url": "https://www.reuters.com/article/us-health-coronavirus-vaccines-sideeffec-idUSKBN2BW19B", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210409&t=2&i=1557839361&r=LYNXMPEH380MI&w=800", "publishedAt": "2021-04-09T10:08:00Z", "content": "ZURICH (Reuters) - Europes drug regulator on Wednesday said it had found a possible link between AstraZenecas COVID-19 vaccine and very rare blood clots in adults who received the shot. Britain recom… [+5451 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Claire O'Connell", "title": "'Is Muidne ESA': An Irish launch mission for the European Space Agency - The Irish Times", "description": "Do you know your satailít and your carr Mhars from your cóiméad or spásfort?", "url": "https://www.irishtimes.com/news/science/is-muidne-esa-an-irish-launch-mission-for-the-european-space-agency-1.4524901", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4524893&origw=1440", "publishedAt": "2021-04-08T00:00:35Z", "content": "A new, Irish-language brochure about European Space Agency (Gníomhaireacht Spáis na hEorpa) activities is helping to make Irelands involvement with space more visible.\r\nIs Muidne ESA (We Are ESA), is… [+3067 chars]"}]}