{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "GSMArena.com"}, "author": "Michail", "title": "FT: Apple argues iMessage is not gatekeeper in the EU - GSMArena.com", "description": "Apple has reportedly argued that iMessage does not have 45 million active users in the EU. The European Union’s Digital Markets Act (DMA) entered into...", "url": "https://www.gsmarena.com/ft_apple_argues_imessage_is_not_gatekeeper_in_the_eu-news-59793.php", "urlToImage": "https://fdn.gsmarena.com/imgroot/news/23/09/apple-imessage-not-gatekeeper/-952x498w6/gsmarena_000.jpg", "publishedAt": "2023-09-05T10:52:01Z", "content": "The European Unions Digital Markets Act (DMA) entered into force on August 25 with the goal of ensuring a higher degree of competition in the EU digital market by regulating the market power of large… [+1216 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Christiaan Hetzner", "title": "Europe’s biggest car show was long the stomping grounds of German brands—but it’s now ‘become the China show’ - Fortune", "description": "If cars like the BYD Seal are both premium and affordable, where does that leave the rest of the industry?", "url": "https://fortune.com/2023/09/05/iaa-munich-car-show-china-byd-nio-tesla-xpeng-germany/", "urlToImage": "https://content.fortune.com/wp-content/uploads/2023/09/GettyImages-454120986-e1693843419212.jpg?resize=1200,600", "publishedAt": "2023-09-05T10:24:00Z", "content": "Chinese carmakers are descending on Europes premier car show this week in such large numbers, the German media is reaching a state of near existential angst.Normally the IAA provides a biennial oppor… [+4722 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "In Australia's Ancient Stromatolites, NASA Finds a Blueprint for Mars Exploration - SciTechDaily", "description": "NASA is working with its international partners to study the ancient Earth as it relates to Mars. In June 2023, NASA's Mars Exploration Program leaders joined their counterparts from the Australian Space Agency, ESA (European Space Agency), and the Australian…", "url": "https://scitechdaily.com/in-australias-ancient-stromatolites-nasa-finds-a-blueprint-for-mars-exploration/", "urlToImage": "https://scitechdaily.com/images/Egg-Carton-Stromatolites-Trendall-Western-Australia.jpg", "publishedAt": "2023-09-04T22:42:41Z", "content": "ByNASASeptember 4, 2023\r\nMembers of NASAs Mars Exploration Program, the European Space Agency, the Australian Space Agency, and the Australian Commonwealth Scientific and Industrial Research Organiza… [+8859 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "ESA - Ariane 6 joint update report, 4 September 2023 - European Space Agency", "description": "The Ariane 6 Launcher Task Force consists of top management at ESA, the overall Ariane 6 procuring entity and launch system architect, launch base prime contractor and French space agency CNES, launcher system prime contractor ArianeGroup and launch service p…", "url": "https://www.esa.int/Enabling_Support/Space_Transportation/Ariane_6_joint_update_report_4_September_2023", "urlToImage": null, "publishedAt": "2023-09-04T11:43:27Z", "content": "18 July 2023: Combined tests, hot firing test of the main stage with Vulcain 2.1 engine ignition - At Europes Spaceport in Kourou, French Guiana, engineers from ArianeGroup, CNES and ESA, successfull… [+4225 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "New intriguing study claims humans might have first evolved in Europe, not Africa - WION", "description": "New intriguing study claims humans might have first evolved in Europe, not Africa", "url": "https://www.wionews.com/science/new-intriguing-study-claims-humans-might-have-first-evolved-in-europe-not-africa-632216", "urlToImage": "https://cdn.wionews.com/sites/default/files/2023/09/04/377458-master.jpg", "publishedAt": "2023-09-04T10:04:24Z", "content": "A new intriguing study has claimed that the long-held belief that all apes and humans originated from Africa might not be true. \r\nIt all started with the discovery of an ancient ape skull, called an … [+2549 chars]"}]}