{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Politics latest news: French fishermen won't pay for 'Britain's Brexit failure', warns Macron's Europe minister - Telegraph.co.uk", "description": "French fishermen will not suffer because of the UK's &quot;bad choice&quot; to leave the European Union, a member of Emmanuel Macron's government has said, as he doubles down on threats to cut off supplies.", "url": "https://www.telegraph.co.uk/politics/2021/10/08/boris-johnson-news-vaccines-gas-crisis-energy-prices/", "urlToImage": "https://www.telegraph.co.uk/content/dam/politics/2021/10/08/TELEMMGLPICT000272951933_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?impolicy=logo-overlay", "publishedAt": "2021-10-08T08:27:12Z", "content": "The UK is not directly exposed to Russian influence on energy prices, a Cabinet minister has said. \r\nThe Kremlin is facing accusations of withholding gas from Europe for political gain, to hold Germa… [+825 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Here's everything you need to know about NASA's SpaceX Crew-3 mission - Devdiscourse", "description": "The Crew-3 mission will carry NASA astronauts Raja Chari, Tom Marshburn and Kayla Barron as well as European Space Agency (ESA) astronaut Matthias Maurer on a science expedition to the microgravity laboratory as part of the Commercial Crew Program. The crew w…", "url": "https://www.devdiscourse.com/article/technology/1760544-heres-everything-you-need-to-know-about-nasas-spacex-crew-3-mission", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/22_04_2021_10_41_51_3007185.jpg?width=920&format=jpeg", "publishedAt": "2021-10-08T05:45:27Z", "content": "NASA's SpaceX Crew-3 mission, the third crew rotation flight that will carry an international crew of four astronauts to the International Space Station, will launch aboard a Crew Dragon spacecraft l… [+1184 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Holly Ellyatt", "title": "Russia offered to pump more gas to Europe. But analysts doubt that's ever going to happen - CNBC", "description": "Market analysts quickly suspected that the offer to increase supplies to Europe was likely intended to put pressure on Germany to certify the Nord Stream 2 gas pipeline.", "url": "https://www.cnbc.com/2021/10/08/doubts-over-whether-russia-will-pump-more-gas-to-europe-as-promised.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106954194-1633614470735-gettyimages-1230851516-RUSSIA_NORD_STREAM.jpeg?v=1633614564", "publishedAt": "2021-10-08T05:16:50Z", "content": "A worker adjusts a pipeline valve at the Gazprom PJSC Slavyanskaya compressor station, the starting point of the Nord Stream 2 gas pipeline, in Ust-Luga, Russia, on Thursday, Jan. 28, 2021.\r\nLONDON W… [+3990 chars]"}]}