{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "CDC Warns Doctors to Look Out for Mystery Liver Illness in Children - Gizmodo", "description": "At least nine children in the U.S. and over 100 in Europe have contracted the severe and unexplained hepatitis, with many needing a liver transplant.", "url": "https://gizmodo.com/cdc-warning-mystery-hepatitis-children-1848829452", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/4114d0c273ab68ebd0104da3ab344d98.jpg", "publishedAt": "2022-04-22T17:15:00Z", "content": "The Centers for Disease Control and Prevention is warning doctors to keep an eye out for mysterious cases of hepatitis that are affecting young kids in the U.S. and elsewhere. Two children in the U.S… [+3139 chars]"}, {"source": {"id": null, "name": "Ghacks Technology News"}, "author": null, "title": "Google is rolling out new cookie popups with \"reject all\" option in Europe - Ghacks", "description": "Google is changing its cookie popups on Google Search and YouTube in Europe. The new banner displays an option to reject everything with a single click.", "url": "https://www.ghacks.net/2022/04/22/google-is-rolling-out-new-cookie-popups-with-reject-all-option-in-europe/", "urlToImage": "https://www.ghacks.net/wp-content/uploads/2022/04/google-search-youtube-new-reject-all-cookie-banner.png", "publishedAt": "2022-04-22T16:30:00Z", "content": "Google is changing its cookie popups on Google Search and YouTube in Europe. The new cookie banner is rolling out already, and the main change that it introduces is the integration of an \"reject all\"… [+2888 chars]"}, {"source": {"id": null, "name": "The European Scientist"}, "author": "Alex Reis", "title": "Less use of mobile phones for better health - The European Scientist", "description": "We may all use our mobile phones too much, but the good news is that we don't have to give them up altogether to be healthier, according to a study published in the Journal of Experimental Psychology.", "url": "https://www.europeanscientist.com/en/public-health/less-use-of-mobile-phones-for-better-health/", "urlToImage": "https://www.europeanscientist.com/wp-content/uploads/2022/04/715C6781-36DE-4DCF-B832-007DCAA01B71.jpeg", "publishedAt": "2022-04-21T14:39:26Z", "content": "We may all use our mobile phones too much, but the good news is that we don’t have to give them up altogether to be healthier, according to a study published in the Journal of Experimental Psychology… [+2441 chars]"}]}