{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "UK sold off US$42b of semicon firms before review - The Star Online", "description": "LONDON: The U.K. was once the leading semiconductor innovator in Europe, producing the likes of Arm Ltd., whose technology is found in 90% of all mobile devices, and Imagination Technologies Group Ltd., which supplies chip designs used by Apple Inc.", "url": "https://www.thestar.com.my/business/business-news/2021/07/11/uk-sold-off-us42b-of-semicon-firms-before-review", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/11/1216455.jpeg", "publishedAt": "2021-07-11T05:48:00Z", "content": "LONDON: The U.K. was once the leading semiconductor innovator in Europe, producing the likes of Arm Ltd., whose technology is found in 90% of all mobile devices, and Imagination Technologies Group Lt… [+5019 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "TSN.ca Staff", "title": "Clash of the titans EURO 2020 final: England vs. Italy - TSN", "description": "Sunday’s European Championship final between traditional powerhouses Italy and England at Wembley Stadium has all the makings of a classic as both the Azzurri and the Three Lions will look to end lengthy championship droughts.", "url": "https://www.tsn.ca/euro-2020-england-italy-final-1.1666380", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1666394!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/harry-kane-phil-foden.jpg", "publishedAt": "2021-07-10T22:41:42Z", "content": "It all comes down to this. After 50 matches of Euro 2020, only one remains and its the biggest of all. At Wembley Stadium on Sunday, Italy looks to win its first Euro since 1968 and will have to do s… [+4655 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-England's Foden misses training ahead of Euro final v Italy - The Star Online", "description": "(Reuters) -     England midfielder Phil Foden did not take part in Saturday's team training session ahead of their European Championship final against Italy as a precaution due to a minor injury.", "url": "https://www.thestar.com.my/sport/football/2021/07/10/soccer-england039s-foden-misses-training-ahead-of-euro-final-v-italy", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/10/1215986.jpg", "publishedAt": "2021-07-10T12:41:00Z", "content": "(Reuters) - England midfielder Phil Foden did not take part in Saturday's team training session ahead of their European Championship final against Italy as a precaution due to a minor injury.\r\nThe 21… [+795 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-England fined 30000 euros for use of laser pointer, booing Denmark anthem - The Star Online", "description": "(Reuters) -     UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding moment of their Euro 2020 semi-final, Europe's governing b…", "url": "https://www.thestar.com.my/sport/football/2021/07/10/soccer-england-fined-30000-euros-for-use-of-laser-pointer-booing-denmark-anthem", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/10/1215950.jpg", "publishedAt": "2021-07-10T11:49:00Z", "content": "(Reuters) - UEFA have fined England's Football Association (FA) 30,000 euros ($36,000) after a laser pointer was shone at Denmark goalkeeper Kasper Schmeichel during what proved to be the deciding mo… [+923 chars]"}]}