{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Aawsat.com"}, "author": "", "title": "Faye Flam - Long Covid Could Reveal Clues to Alzheimer's, Lyme Disease - Asharq Al-awsat - English", "description": "Last week, the US Congress failed to approve $15 billion needed to continue Covid-19 precautions, even though today’s low case counts are likely to rise, as they are in Europe, with the sub-variant called BA.2. We’ve learned that some expensive mitig", "url": "https://english.aawsat.com/home/article/3536381/faye-flam/long-covid-could-reveal-clues-alzheimers-lyme-disease", "urlToImage": "https://english.aawsat.com/sites/default/files/styles/large/public/2018/01/18/flam.jpg?itok=7lbEcZgf", "publishedAt": "2022-03-17T05:51:40Z", "content": "Last week, the US Congress failed to approve $15 billion needed to continue Covid-19 precautions, even though todays low case counts are likely to rise, as they are in Europe, with the sub-variant ca… [+6197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore and Chris Liakos, CNN Business", "title": "Russia moves to seize hundreds of planes from foreign owners - CNN", "description": "Russia is seizing hundreds of commercial jets owned by US and European leasing companies, a further sign of the challenges the country's airline industry faces due to sanctions following its invasion of Ukraine.", "url": "https://www.cnn.com/2022/03/16/business/russia-aircraft-seizure/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316153245-aeroflot-airbus-jets-moscow-file-restricted-super-tease.jpg", "publishedAt": "2022-03-16T21:35:00Z", "content": null}, {"source": {"id": null, "name": "TribLIVE"}, "author": "Megan Guza", "title": "What to know about the omicron subvariant BA.2 - TribLIVE", "description": "A new version of the coronavirus that causes covid-19 has made its way through Europe and other parts of the world, and it now has been detected in the United States, including locally. It is not a new strain, but rather a variant of a variant &mdash; a subty…", "url": "https://triblive.com/local/regional/what-to-know-about-the-omicron-subvariant-ba-2/", "urlToImage": "https://assets-varnish.triblive.com/2022/03/4851463_web1_ptr-WhatToKnowBA2-031722.jpg", "publishedAt": "2022-03-16T20:33:54Z", "content": "A new version of the coronavirus that causes covid-19 has made its way through Europe and other parts of the world, and it now has been detected in the United States, including locally.\r\nIt is not a … [+2826 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louise Boyle", "title": "Satellite images show massive Saharan dust storm engulfing western Europe - The Independent", "description": "Storm Celia has carried dust from North Africa to Europe, affecting air quality in a number of countries", "url": "https://www.independent.co.uk/climate-change/news/saharan-dust-uk-today-2022-orange-b2037115.html", "urlToImage": "https://static.independent.co.uk/2022/03/16/13/20220316_SaharanDustWesternEurope.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-03-16T20:02:01Z", "content": "New satellite images have revealed the scale of the vast Saharan dust cloud blanketing western Europe.\r\nStorm Celia is driving a warm air mass filled with dust from North Africa to Europe, affecting … [+2356 chars]"}, {"source": {"id": null, "name": "Krishi Jagran"}, "author": "Shivam Dwivedi", "title": "Nissan Motor Appoints Frank Torres as New President of Indian Operations - Krishi Jagran ", "description": "Torres will take over as president of Indian operations on April 1 while continuing to oversee Nissan's European Regional Business Unit East (Russia) and Nissan's Spanish Industrial Operations, according to the company. He will report to Guillaume Cartier, Ni…", "url": "https://krishijagran.com/news/nissan-motor-appoints-frank-torres-as-new-president-of-indian-operations/", "urlToImage": "https://d2xsikgwxkxyoe.cloudfront.net/media/65966/iuhuh.jpg", "publishedAt": "2022-03-16T17:52:01Z", "content": "Frank Torres- New President of Nissan Motor of Indian Operations\r\nNissan Motor Co., a Japanese automaker, announced on Wednesday that Frank Torres, a senior executive, has been named president of its… [+1752 chars]"}, {"source": {"id": null, "name": "Leroyfcpress.com"}, "author": "lpadmin", "title": "Heat and drought soon to be a double pack – LeRoy Farmer City Press - LeRoy Farmer City Press", "description": "Hardly avoidable: Even with two degrees of warming, the combination of droughts and heat waves in Central Europe will occur far more frequently than before 40 years. However, how strongly these partic", "url": "https://www.leroyfcpress.com/heat-and-drought-soon-to-be-a-double-pack/", "urlToImage": "https://www.leroyfcpress.com/wp-content/uploads/2022/03/365-heat-and-drought-soon-to-be-a-double-pack-780x470.jpg", "publishedAt": "2022-03-15T05:57:48Z", "content": "Hardly avoidable: Even with two degrees of warming, the combination of droughts and heat waves in Central Europe will occur far more frequently than before 40 years. However, how strongly these parti… [+4711 chars]"}]}