{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Aurelien Breeden", "title": "Trial Begins Over 2015 Paris Terrorist Attacks - The New York Times", "description": "The attacks carried out by Islamic State extremists that killed 130 people deeply rattled France and sent shock waves through Europe. The trial is scheduled to last at least nine months.", "url": "https://www.nytimes.com/2021/09/08/world/europe/paris-terror-attacks-trial.html", "urlToImage": "https://static01.nyt.com/images/2021/09/08/world/08france-trail1/08france-trail1-facebookJumbo.jpg", "publishedAt": "2021-09-08T11:30:10Z", "content": "Xavier Nogueras, a lawyer for one of the accused, said the length and scope of the trial was dizzying. But the fact that there are so many people involved required that we take our time, he said. It … [+1146 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "NASA targeting October 31 for launch of SpaceX Crew-3 mission to space station - Devdiscourse", "description": "The Crew-3 astronauts include mission commander Raja Chari, pilot Tom Marshburn, mission specialist Kayla Barron, and Matthias Maurer of the European Space Agency (ESA), also a mission specialist. The astronauts will launch aboard a SpaceX Crew Dragon spacecr…", "url": "https://www.devdiscourse.com/article/science-environment/1722177-nasa-targeting-october-31-for-launch-of-spacex-crew-3-mission-to-space-station", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/01_08_2019_15_59_59_3021891.jpg?width=920&format=jpeg", "publishedAt": "2021-09-08T07:50:15Z", "content": "NASA said on Tuesday it is planning to launch the SpaceX Crew-3 mission to the International Space Station as early as Sunday, October 31. This will be the third crew rotation mission on SpaceX's hum… [+1366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A vaccine success in Europe that sinks in the east - The Indian Express", "description": "While 80% of the adult populations in countries such as Belgium, Denmark and Portugal have been fully vaccinated, in Bulgaria that figure plunges to only about 20%, while in Romania it lags at around 32%, according to European authorities.", "url": "https://indianexpress.com/article/world/a-vaccine-success-in-europe-that-sinks-in-the-east-7495873/", "urlToImage": "https://images.indianexpress.com/2021/09/EUROPE-VACCINE-2.jpg", "publishedAt": "2021-09-08T05:04:28Z", "content": "More than 70% of the European Unions adult population has been fully vaccinated, making it one of the worlds vaccination leaders. But some Eastern European countries are lagging far behind, exposing … [+6957 chars]"}]}