{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "NATO makes plans to boost its military presence in eastern Europe as Ukraine war grinds on - CBC News", "description": "NATO defence ministers have asked military commanders to draw up plans for a significantly larger long-term deployment of western forces in eastern Europe, the secretary general of the alliance said Wednesday.", "url": "https://www.cbc.ca/news/politics/nato-ukraine-russia-stoltenberg-1.6386902", "urlToImage": "https://i.cbc.ca/1.6371442.1647454328!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nato-russia.jpg", "publishedAt": "2022-03-16T20:49:12Z", "content": "NATO defence ministers have asked military commanders to draw up plans for a significantly larger long-term deployment of western forces in eastern Europe, the secretary general of the alliance said … [+4884 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Louise Boyle", "title": "Satellite images show massive Saharan dust storm engulfing western Europe - The Independent", "description": "Storm Celia has carried dust from North Africa to Europe, affecting air quality in a number of countries", "url": "https://www.independent.co.uk/climate-change/news/saharan-dust-uk-today-2022-orange-b2037115.html", "urlToImage": "https://static.independent.co.uk/2022/03/16/13/20220316_SaharanDustWesternEurope.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-03-16T20:02:01Z", "content": "New satellite images have revealed the scale of the vast Saharan dust cloud blanketing western Europe.\r\nStorm Celia is driving a warm air mass filled with dust from North Africa to Europe, affecting … [+2356 chars]"}, {"source": {"id": null, "name": "Krishi Jagran"}, "author": "Shivam Dwivedi", "title": "Nissan Motor Appoints Frank Torres as New President of Indian Operations - Krishi Jagran ", "description": "Torres will take over as president of Indian operations on April 1 while continuing to oversee Nissan's European Regional Business Unit East (Russia) and Nissan's Spanish Industrial Operations, according to the company. He will report to Guillaume Cartier, Ni…", "url": "https://krishijagran.com/news/nissan-motor-appoints-frank-torres-as-new-president-of-indian-operations/", "urlToImage": "https://d2xsikgwxkxyoe.cloudfront.net/media/65966/iuhuh.jpg", "publishedAt": "2022-03-16T17:52:01Z", "content": "Frank Torres- New President of Nissan Motor of Indian Operations\r\nNissan Motor Co., a Japanese automaker, announced on Wednesday that Frank Torres, a senior executive, has been named president of its… [+1752 chars]"}, {"source": {"id": null, "name": "Leroyfcpress.com"}, "author": "lpadmin", "title": "Heat and drought soon to be a double pack – LeRoy Farmer City Press - LeRoy Farmer City Press", "description": "Hardly avoidable: Even with two degrees of warming, the combination of droughts and heat waves in Central Europe will occur far more frequently than before 40 years. However, how strongly these partic", "url": "https://www.leroyfcpress.com/heat-and-drought-soon-to-be-a-double-pack/", "urlToImage": "https://www.leroyfcpress.com/wp-content/uploads/2022/03/365-heat-and-drought-soon-to-be-a-double-pack-780x470.jpg", "publishedAt": "2022-03-15T05:57:48Z", "content": "Hardly avoidable: Even with two degrees of warming, the combination of droughts and heat waves in Central Europe will occur far more frequently than before 40 years. However, how strongly these parti… [+4711 chars]"}]}