{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Joanna Tan, Jessica Bursztynsky, Amanda Macias, Samantha Subin, Matt Clinch, Chelsea Ong", "title": "Zelenskyy presses senior U.S. officials for more powerful weapons; Mariupol humanitarian corridor fails - CNBC", "description": "Russia's invasion of Ukraine entered its third month on Sunday, a conflict that has killed thousands and led to the worst refugee crisis Europe has seen since World War II.", "url": "https://www.cnbc.com/2022/04/24/russia-ukraine-live-updates.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107050427-16506514972022-04-22t181613z_842795368_rc2cst9pj5a0_rtrmadp_0_ukraine-crisis-mariupol.jpeg?v=1650651721&w=1920&h=1080", "publishedAt": "2022-04-25T02:36:00Z", "content": "The war in Ukraine will end only if Russian troops fully withdraw from the country, Ukrainian Prime Minister Denys Shmyhal said.\r\n\"We may protect democracy in Europe, on our continent, in the world b… [+762 chars]"}, {"source": {"id": null, "name": "Boston 25 News"}, "author": "Kelli Dugan, Cox Media Group National Content Desk", "title": "Mystery liver illness linked to 1 child death, 17 transplants in US, Europe, WHO says - Boston 25 News", "description": "One child has died and 17 others have required liver transplants as global health experts race to determine the origin of at least 169 cases of acute liver inflammation in children spanning 11 countries.", "url": "https://www.boston25news.com/news/trending/mystery-liver-illness-linked-1-child-death-17-transplants-us-europe-who-says/YM65TEZQINBKTC3J5ZMR4LBMYM/", "urlToImage": "https://cmg-cmg-tv-10020-prod.cdn.arcpublishing.com/resizer/rGo1yYjglz2ESXuOPikuojtOBJ4=/1440x810/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/cmg/A2Q72V4LIFBUJEK2RIBEVHID4I.jpg", "publishedAt": "2022-04-25T00:47:00Z", "content": "One child has died and 17 others have required liver transplants as global health experts race to determine the origin of at least 169 cases of acute liver inflammation in children spanning 11 countr… [+2845 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Lara Marlowe", "title": "Mood one of relief as much as joy for Macron supporters after election win - The Irish Times", "description": "Re-election of French president Emmanuel Macron hailed by European leaders", "url": "https://www.irishtimes.com/news/world/europe/mood-one-of-relief-as-much-as-joy-for-macron-supporters-after-election-win-1.4860867", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4860865&origw=1440", "publishedAt": "2022-04-24T22:38:36Z", "content": "There were as many blue and yellow European flags as French tricolours at President Emmanuel Macrons victory celebration beneath the Eiffel Tower on Sunday night. \r\nThe re-elected president and his w… [+3279 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "VG Cabuag", "title": "'War in Europe, Shanghai lockdown may affect ICTSI' | VG Cabuag - BusinessMirror", "description": "Billionaire Enrique K. Razon Jr. said port operator International Container Terminal Services Inc. (ICTSI) is ready to face the challenges brought about by the lockdown in China and the ongoing war between Russia and Ukraine. “This is similar to what happened…", "url": "https://businessmirror.com.ph/2022/04/25/war-in-europe-shanghailockdown-may-affect-ictsi/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/ictsi01.jpg", "publishedAt": "2022-04-24T16:01:00Z", "content": "Billionaire Enrique K. Razon Jr. said port operator International Container Terminal Services Inc. (ICTSI) is ready to face the challenges brought about by the lockdown in China and the ongoing war b… [+2413 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "WATCH: 2023 BMW M2 takes to the Nürburgring along with M4 CSL - Carmag South Africa", "description": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to the Nürburgring after the 2023 BMW M2 was spotted along with …", "url": "https://www.carmag.co.za/news/new-models/watch-2023-bmw-m2-m4-csl/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/04/BMW-1-5.jpg", "publishedAt": "2022-04-24T10:00:06Z", "content": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to t… [+1877 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Enitan Thompson", "title": "Pounds To Naira Exchange Rate/Black Market Rate Today, 23 April 2022 - TDPel Media", "description": "The table below shows the latest black market rate of the U.S Dollar To Naira Aboki, the European Euro to Naira, and Great Britain Pounds To Naira. Date", "url": "https://tdpelmedia.com/pounds-to-naira-exchange-rate-black-market-rate-today-23-april-2022", "urlToImage": "https://brandnewsday.com/wp-content/uploads/2022/01/Pound-to-Niara-rate-today-brand-news-day-nigeria-300x200.jpg", "publishedAt": "2022-04-23T15:07:07Z", "content": "Latest News Today, Interviews, Events Coverage TDPel Media\r\nTDPel Media is committed to simplicity of news, and being straight to the point, bringing you news without unnecessary information. TDPel M… [+395 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "siteadmin", "title": "Russian President, Putin, To Meet United Nations Secretary-General Over Ukraine Invasion - SaharaReporters.com", "description": "Thousands had been killed and more than 12 million people displaced in Europe’s worst refugee crisis since World War II.", "url": "https://saharareporters.com/2022/04/23/russian-president-putin-meet-united-nations-secretary-general-over-ukraine-invasion", "urlToImage": null, "publishedAt": "2022-04-23T13:18:21Z", "content": "Russian President, Vladimir Putin, would hold talks with the United Nations Secretary-General, Antonio Guterres, in Russia, on Tuesday, AFP reports.\r\nThe Kremlin made the announcement on Friday, the … [+1420 chars]"}]}