{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Irish Sun"}, "author": "Millie Turner", "title": "Scientists uncover new alien planet hiding a mind-boggling secret at its core... - The Irish Sun", "description": "A NEWFOUND alien planet is hiding a powerful secret at its core. It is the first planet to be discovered by Europe’s Gaia spacecraft, which started its space-bound mission a decade ago. An in…", "url": "https://www.thesun.ie/tech/10087297/scientists-uncover-new-alien-planet/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2023/01/OP-JS-SPACE-HD-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-01-20T14:28:00Z", "content": "A NEWFOUND alien planet is hiding a powerful secret at its core. \r\nIt is the first planet to be discovered by Europe's Gaia spacecraft, which started its space-bound mission a decade ago.\r\nThe planet… [+2076 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Europe's mission to Jupiter's icy moons ready for launch - BBC", "description": "The £1.4bn Juice probe will investigate the giant gas planet and its three large ocean-bearing moons.", "url": "https://www.bbc.com/news/science-environment-64336398", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/10E1A/production/_128364196_altindex.jpg", "publishedAt": "2023-01-20T14:16:51Z", "content": "Europe is about to undertake one of its grandest ever space missions, to explore the icy moons of Jupiter.\r\nThe Juice satellite is going through final testing in Toulouse, France, after which it will… [+5765 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Britain's Tim Peake retires from European astronaut corps - BBC", "description": "The British astronaut who inspired millions with his passion for space will concentrate on educational outreach.", "url": "https://www.bbc.co.uk/news/science-environment-64346185", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/12378/production/_128361647_esa_astronaut_tim_peake_in_cupola.jpg", "publishedAt": "2023-01-20T11:21:48Z", "content": "UK spaceman Tim Peake is stepping down permanently from his role as a European astronaut.\r\nHe's going to take up a full-time ambassadorial position for science and space instead - work he's been doin… [+3461 chars]"}, {"source": {"id": null, "name": "Thechronicle.com.au"}, "author": "", "title": "Europe's JUICE probe to head to Jupiter in search of signs of life - Toowoomba Chronicle", "description": "The European Space Agency has unveiled its latest probe, JUICE, which is set to explore Jupiter and three of its moons, where it will examine potential habitable zones under their icy crusts and, perhaps, establish whether or not they may contain life.", "url": "https://www.thechronicle.com.au/news/world/europes-juice-probe-to-head-to-jupiter-in-search-of-signs-of-life/video/ffcd5908690d32ae2d54f21b762a4ea3", "urlToImage": "https://content.api.news/v3/images/bin/83f90a991608152e2e05bf1f21ef615a", "publishedAt": "2023-01-20T10:52:03Z", "content": "The European Space Agency has unveiled its latest probe, JUICE, which is set to explore Jupiter and three of its moons, where it will examine potential habitable zones under their icy crusts and, per… [+52 chars]"}]}