{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Russia's Gazprom keeps pipeline shut as Siemens disputes maintenance challenge claims - CBC News", "description": "Russia kept one of its main gas supply routes to Europe shut on Saturday, stoking fears of winter fuel shortages and spotlighting differences between Gazprom and Germany's Siemens Energy over repair work on the pipeline.", "url": "https://www.cbc.ca/news/world/russia-gazprom-siemens-pipeline-nord-stream-1.6572114", "urlToImage": "https://i.cbc.ca/1.6572119.1662211909!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/gazprom-logo-as-seen-on-moscow-gas-station-in-september-2022.jpg", "publishedAt": "2022-09-03T15:27:17Z", "content": "Russia kept one of its main gas supply routes to Europe shut on Saturday, stoking fears of winter fuel shortages and spotlighting differences between Gazprom and Germany's Siemens Energy over repair … [+4148 chars]"}, {"source": {"id": null, "name": "POLITICO.eu"}, "author": "Sarah-Taïssir Bencharif", "title": "Gazprom reportedly to increase gas to EU via Ukraine after Nord Stream halt - POLITICO Europe", "description": "The Russian energy giant said on Friday that it would not restart the Nord Stream pipeline to Germany as planned.", "url": "https://www.politico.eu/article/gazprom-gas-europe-ukraine-nord-stream/", "urlToImage": "https://www.politico.eu/cdn-cgi/image/width=1200,height=630,fit=crop,quality=80,onerror=redirect/wp-content/uploads/2022/09/03/iStock-1397019552.jpg", "publishedAt": "2022-09-03T12:54:18Z", "content": "Russias Gazprom said on Saturday it would increase its shipments of gas to Europe via Ukraine, according to media reports.\r\nThe development comes after the Russian energy giant said on Friday that it… [+1227 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "EU ready if Russia halts gas supplies – Official - Punch Newspapers", "description": "The European Union Economy Commissioner, Paolo Gentiloni, said Saturday that the European Union was \"well prepared\" in the event of a total halt in Russian gas deliveries, thanks to storage capacity and energy-saving measures.", "url": "https://punchng.com/eu-ready-if-russia-halts-gas-supplies-official/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2016/11/15001652/European-Union-.jpg", "publishedAt": "2022-09-03T12:53:31Z", "content": "The European Union Economy Commissioner, Paolo Gentiloni, said Saturday that the European Union was “well prepared” in the event of a total halt in Russian gas deliveries, thanks to storage capacity … [+1586 chars]"}, {"source": {"id": null, "name": "Cybershack.com.au"}, "author": "Ray Shaw", "title": "EU commission may legislate on smartphone repairability - CyberShack", "description": "The European Union want to ensure smartphone repairability means energy efficient, durable, easy to repair, software upgradeable phones.", "url": "https://cybershack.com.au/announcements/eu-commission-may-legislate-on-smartphone-repairability/", "urlToImage": "https://cybershack.com.au/wp-content/uploads/2022/09/EU-smartphone-header.jpg", "publishedAt": "2022-09-03T05:54:11Z", "content": "The European Union is inviting feedback on its Circular Economy Action Plan to ensure that smartphone repairability means energy efficient, durable, easy to repair, software upgradeable, and easy to … [+5599 chars]"}, {"source": {"id": null, "name": "Euronews"}, "author": null, "title": "VIDEO : Cosmonauts conduct spacewalk aboard ISS - Euronews", "description": "VIDEO : Expedition 67 Commander Oleg Artemyev and Flight Engineer Denis Matveev, both of Roscosmos, began a spacewalk early Friday to continue outfitting the European robotic arm on the International Space Station's Nauka laboratory.", "url": "https://www.euronews.com/video/2022/09/02/cosmonauts-conduct-spacewalk-aboard-iss", "urlToImage": "https://static.euronews.com/articles/stories/06/99/02/96/1000x563_cmsv2_195a730d-acfd-5313-bcfe-158a12d77f86-6990296.jpg", "publishedAt": "2022-09-02T18:10:29Z", "content": "Expedition 67 Commander Oleg Artemyev and Flight Engineer Denis Matveev, both of Roscosmos, began a spacewalk early Friday to continue outfitting the European robotic arm on the International Space S… [+193 chars]"}, {"source": {"id": null, "name": "Pharmacytimes.com"}, "author": "Erin Hunter", "title": "Hepatitis of Unknown Origin Affecting Hundreds of Young Children - Pharmacy Times", "description": "Research indicates that there is a growing amount of unusual hepatitis cases in children throughout Europe.", "url": "https://www.pharmacytimes.com/view/hepatitis-of-unknown-origin-affecting-hundreds-of-young-children", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/667bc873c038c0cbc7f898909137e57362f252ef-986x988.png?fit=crop&auto=format", "publishedAt": "2022-09-02T12:11:40Z", "content": "From January-June 2022, 20 countries in the European Region of the World Health Organization reported an outbreak of 427 total cases of hepatitis of unknown origin in children. Adenovirus was concurr… [+2876 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Reasons for hospital admissions in people with type 2 diabetes are changing - EurekAlert", "description": "**Note this is an early release from the European Association for the Study of Diabetes (EASD) Annual Meeting in Stockholm, Sweden (19-23 Sept). Please credit the meeting if using this story**\n\nThe most common reasons why people with type 2 diabetes (T2DM) ar…", "url": "https://www.eurekalert.org/news-releases/963507", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-02T06:11:58Z", "content": "<ul><li>Non-traditional complications including anaemia, stress disorders, depression, and pneumonia are among the top reasons why people with type 2 diabetes are admitted to hospital at greater freq… [+11555 chars]"}, {"source": {"id": null, "name": "Esa.int"}, "author": null, "title": "Webb inspects the heart of the Phantom Galaxy - European Space Agency", "description": "New images of the spectacular Phantom Galaxy, M74, showcase the power of space observatories working together in multiple wavelengths. In this case, data from the NASA/ESA/CSA James Webb Space Telescope and the NASA/ESA Hubble Space Telescope complement each …", "url": "https://www.esa.int/Science_Exploration/Space_Science/Webb/Webb_inspects_the_heart_of_the_Phantom_Galaxy", "urlToImage": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2022/08/heart_of_the_phantom_galaxy/24419865-1-eng-GB/Heart_of_the_Phantom_Galaxy_pillars.jpg", "publishedAt": "2022-08-29T07:02:34Z", "content": "Science &amp; Exploration29/08/2022160041 views1211 likes\r\nNew images of the spectacular Phantom Galaxy, M74, showcase the power of space observatories working together in multiple wavelengths. In th… [+3308 chars]"}]}