{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "World Health Organization"}, "author": "World Health Organization: WHO", "title": "New collaboration targets better bone health and ageing - World Health Organization", "description": "<p>The World Health Organization (WHO) and the European Society for Clinical and Economic Aspects of Osteoporosis, Osteoarthritis and Musculoskeletal Diseases (ESCEO) today signed an agreement to develop a strategic roadmap on bone health and ageing and advoc…", "url": "https://www.who.int/news/item/23-02-2023-new-collaboration-targets-better-bone-health-and-ageing", "urlToImage": "https://cdn.who.int/media/images/default-source/health-topics/ageing/picture12.tmb-1200v.jpg?sfvrsn=c452a397_2", "publishedAt": "2023-02-23T15:15:01Z", "content": "The World Health Organization (WHO) and the European Society for Clinical and Economic Aspects of Osteoporosis, Osteoarthritis and Musculoskeletal Diseases (ESCEO) today signed an agreement to develo… [+3140 chars]"}, {"source": {"id": null, "name": "The Irish Sun"}, "author": "Charlotte Edwards", "title": "Perfectly 'normal' image of space hides horrifying secret – once you see it there's no going back... - The Irish Sun", "description": "A RESURFACED image of a seemingly innocent night sky actually has a dark secret. At first glance, the image captured by Europes LOw Frequency ARray (LOFAR) radio telescope looks like it’s pac…", "url": "https://www.thesun.ie/tech/news-tech/10277800/space-image-hiding-secret-supermassive-black-holes/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2023/02/SC-Black-Hole-Off-Plat-copy.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-02-23T15:09:22Z", "content": "A RESURFACED image of a seemingly innocent night sky actually has a dark secret.\r\nAt first glance, the image captured by Europes LOw Frequency ARray (LOFAR) radio telescope looks like it's packed ful… [+1324 chars]"}, {"source": {"id": null, "name": "The Irish Sun"}, "author": "Millie Turner", "title": "Inside the remarkable plan to GROW food on the Moon with astro-farmers and robots... - The Irish Sun", "description": "ASTRO-FARMERS are the key to a long-term future off-planet. European scientists have drawn up an ingenious plan to grow food on the Moon, and make humans a multi-planetary species. They’ve al…", "url": "https://www.thesun.ie/tech/10275230/inside-plan-to-grow-food-on-moon-astro-farmers/", "urlToImage": "https://www.thesun.ie/wp-content/uploads/sites/3/2023/02/comp-skc-farming-op-1.jpg?strip=all&quality=100&w=1920&h=1080&crop=1", "publishedAt": "2023-02-23T12:01:47Z", "content": "ASTRO-FARMERS are the key to a long-term future off-planet.\r\nEuropean scientists have drawn up an ingenious plan to grow food on the Moon, and make humans a multi-planetary species. \r\nScientists have… [+1932 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Shear ultrasound shaking found to lower friction between solids - Phys.org", "description": "When high-frequency shaking occurs at an interface between two solids, recent experiments have revealed that the frictional forces between the objects can be weakened. Through a simple new experiment detailed in The European Physical Journal E, Julien Léopold…", "url": "https://phys.org/news/2023-02-ultrasound-friction-solids.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/shear-ultrasound-shaki.jpg", "publishedAt": "2023-02-22T14:22:51Z", "content": "When high-frequency shaking occurs at an interface between two solids, recent experiments have revealed that the frictional forces between the objects can be weakened. Through a simple new experiment… [+2475 chars]"}]}