{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "European Immunization Week 2022 – celebrating progress and addressing new challenges in the control of vaccine-preventable diseases - WHO/Europe", "description": "Today marks the start of European Immunization Week (EIW), an opportune moment to celebrate the historic achievements in protecting lives and livelihoods made possible by vaccines, and to acknowledge their further potential to protect public health.", "url": "https://www.euro.who.int/en/health-topics/Life-stages/pages/news/news/2022/4/european-immunization-week-2022-celebrating-progress-and-addressing-new-challenges-in-the-control-of-vaccine-preventable-diseases", "urlToImage": "https://www.euro.who.int/__data/assets/image/0009/535365/Elerev-250.jpg", "publishedAt": "2022-04-25T08:30:44Z", "content": "Today marks the start of European Immunization Week (EIW), an opportune moment to celebrate the historic achievements in protecting lives and livelihoods made possible by vaccines, and to acknowledge… [+4698 chars]"}, {"source": {"id": null, "name": "Brytfmonline.com"}, "author": "Chris Skeldon", "title": "Scene evolution, we may have found life on Jupiter's satellite - brytfmonline.com", "description": "A few years ago, Europe became one of the most tangible targets for searching for...", "url": "https://www.brytfmonline.com/scene-evolution-we-may-have-found-life-on-jupiters-satellite/", "urlToImage": "https://www.brytfmonline.com/wp-content/uploads/2022/04/Scene-evolution-we-may-have-found-life-on-Jupiters-satellite.jpg", "publishedAt": "2022-04-25T07:30:13Z", "content": "A few years ago, Europe became one of the most tangible targets for searching for living things in our solar system. Despite its distance from the sun, this satellite is protected by a thick outer la… [+1606 chars]"}, {"source": {"id": null, "name": "Dublin Live"}, "author": "Exclusive-John Hand", "title": "Kinahan cartel's alleged drug route through Europe's busiest ports exposed - Dublin Live", "description": "A huge crackdown in Colombia has also seen a fall-off in production, impacting on the cartel’s business", "url": "https://www.dublinlive.ie/news/dublin-news/kinahan-cartels-alleged-drug-route-23772755", "urlToImage": "https://i2-prod.dublinlive.ie/news/article23773366.ece/ALTERNATES/s1200/1_rotterdam-GettyImages-843385974.jpg", "publishedAt": "2022-04-25T05:00:00Z", "content": "The Kinahan cartel is allegedly employing ruthless north African thugs to target dock workers at Europes busiest ports.\r\nIt is claimed they attempt to pay them up to 60,000 to allow drug shipments in… [+4839 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "John Leicester", "title": "2022 French election: Polling agencies project reelection for Macron - The Associated Press", "description": "PARIS (AP) — French President Emmanuel Macron comfortably won a second term Sunday, triggering relief among allies that the nuclear-armed power won't abruptly shift course in the midst of the war in Ukraine from European Union and NATO efforts to punish and c…", "url": "https://apnews.com/f5b549e3b99930ee05bed17a9d3870b6", "urlToImage": "https://storage.googleapis.com/afs-prod/media/921a53f314964fc1857c32f5f599c489/3000.jpeg", "publishedAt": "2022-04-25T03:54:58Z", "content": "PARIS (AP) French President Emmanuel Macron comfortably won a second term Sunday, triggering relief among allies that the nuclear-armed power wont abruptly shift course in the midst of the war in Ukr… [+5296 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Eric Andrew-Gee", "title": "French President Emmanuel Macron defeats far-right rival Marine Le Pen in runoff vote - The Globe and Mail", "description": "Macron’s win bolsters European unity and NATO at a time when they are being tested by Russia’s invasion of Ukraine", "url": "https://www.theglobeandmail.com/world/article-emmanuel-macron-french-election-runoff/", "urlToImage": "https://www.theglobeandmail.com/resizer/YHAqGCmHyzfVyGY3nc0qEKotmj8=/1200x800/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/3SLYGVAW7JLKJLQDMYGINYXN7Q.jpg", "publishedAt": "2022-04-24T20:19:44Z", "content": "French President Emmanuel Macron celebrates after his victory in France's presidential election, at the Champ de Mars in Paris, on April 24, 2022.THOMAS COEX/AFP/Getty Images\r\nFrance has re-elected i… [+6436 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "VG Cabuag", "title": "'War in Europe, Shanghai lockdown may affect ICTSI' | VG Cabuag - BusinessMirror", "description": "Billionaire Enrique K. Razon Jr. said port operator International Container Terminal Services Inc. (ICTSI) is ready to face the challenges brought about by the lockdown in China and the ongoing war between Russia and Ukraine. “This is similar to what happened…", "url": "https://businessmirror.com.ph/2022/04/25/war-in-europe-shanghailockdown-may-affect-ictsi/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/ictsi01.jpg", "publishedAt": "2022-04-24T16:01:00Z", "content": "Billionaire Enrique K. Razon Jr. said port operator International Container Terminal Services Inc. (ICTSI) is ready to face the challenges brought about by the lockdown in China and the ongoing war b… [+2413 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "WATCH: 2023 BMW M2 takes to the Nürburgring along with M4 CSL - Carmag South Africa", "description": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to the Nürburgring after the 2023 BMW M2 was spotted along with …", "url": "https://www.carmag.co.za/news/new-models/watch-2023-bmw-m2-m4-csl/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/04/BMW-1-5.jpg", "publishedAt": "2022-04-24T10:00:06Z", "content": "It seems to be the testing season in Europe, with warmer weather and more favourable track conditions we can understand why. BMW have been the latest to take one of their high performance models to t… [+1877 chars]"}]}