{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Theparadise.ng"}, "author": null, "title": "Crew of four, including Russian cosmonaut, launches from US on mission to ISS - The Paradise News", "description": "This article was originally published by Radio Free Europe/Radio Liberty and is reprinted with permission.", "url": "https://theparadise.ng/crew-of-four-including-russian-cosmonaut-launches-from-us-on-mission-to-iss/", "urlToImage": "https://americanmilitarynews.com/wp-content/uploads/US-NEWS-SPACEX-MCT-4-scaled.jpg", "publishedAt": "2022-10-09T15:21:03Z", "content": "This article was originally published by Radio Free Europe/Radio Liberty and is reprinted with permission.\r\nA Russian cosmonaut and three astronauts launched from the United States on October 5 on a … [+1573 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Exploring Earth From Space: Lake Trasimeno – The Fourth Largest Lake in Italy - SciTechDaily", "description": "Lake Trasimeno, the fourth largest lake in Italy, is featured in this week’s European Space Agency (ESA) Earth From Space image. Lake Trasimeno is located in central Italy, around 20 km (12 miles) west of Perugia, and encompasses an area of around 128 sq km (…", "url": "https://scitechdaily.com/exploring-earth-from-space-lake-trasimeno-the-fourth-largest-lake-in-italy/", "urlToImage": "https://scitechdaily.com/images/Lake-Trasimeno-Italy.jpg", "publishedAt": "2022-10-09T12:48:24Z", "content": "In this Copernicus Sentinel-2 image, captured on August 6, 2022, the lakes emerald green color is likely due to the presence of phytoplankton. Streaks in the water, particularly visible in the west, … [+3192 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Mohammed Babangida", "title": "Police, NIS rescue 30 victims of human trafficking in Katsina, Kebbi - Premium Times", "description": "Nigerian states sharing borders with Niger Republic are trafficking gateways of the brutal trafficking route across the Sahara Desert to Libya towards Europe.", "url": "https://www.premiumtimesng.com/news/top-news/558665-police-nis-rescue-30-victims-of-human-trafficking-in-katsina-kebbi.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/10/Rescue-in-Katsina.jpg", "publishedAt": "2022-10-09T07:50:39Z", "content": "The police and immigration personnel in Katsina and Kebbi have rescued 30 persons being trafficked across the state.\r\nIn separate statements on Friday, the victims confessed they were being trafficke… [+2701 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Ukraine nuclear plant on emergency generators after shelling cuts external power, UN says - CBC.ca", "description": "Ukraine's Zaporizhzhia nuclear power plant, the biggest in Europe, has lost its last remaining external power source as a result of renewed shelling and is now relying on emergency diesel generators, the UN nuclear watchdog said Saturday.", "url": "https://www.cbc.ca/news/world/zaporizhzhia-nuclear-plant-loses-external-power-1.6611063", "urlToImage": "https://i.cbc.ca/1.6611069.1665231677!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1243158385.jpg", "publishedAt": "2022-10-08T12:38:29Z", "content": "Ukraine's Zaporizhzhia nuclear power plant, the biggest in Europe, has lost its last remaining external power source as a result of renewed shelling and is now relying on emergency diesel generators,… [+1647 chars]"}]}