{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Christine Rendon, Brian Gallagher", "title": "Taylor Swift and Adele NOT collaborating together on new song - Daily Mail", "description": "The rumors all started after a fan alerted fans to a new song Broken Hearts on the Society of European Stage Authors and Composers, which had  Adele Laurie Blue Adkins.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-9755209/Taylor-Swift-Adele-NOT-collaborating-new-song.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/07/04/21/45029833-0-image-a-23_1625429089569.jpg", "publishedAt": "2021-07-04T20:05:20Z", "content": "They sparked collaboration speculation online after details of their rumored new song Broken Hearts emerged on Twitter.  \r\nBut alas, it turns out Taylor Swift and Adele are not working together, acco… [+5688 chars]"}, {"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "Lakes under Mars south pole may not be real - Free Press Journal", "description": "Subsurface lakes found under Mars' south pole, using data from the European Space Agency's Mars Express orbiter, may not really be lakes at all, argue researchers. Two research teams in 2018, working on data from the Mars Express orbiter announced a surprisin…", "url": "https://www.freepressjournal.in/science/lakes-under-mars-south-pole-may-not-be-real", "urlToImage": "https://gumlet.assettype.com/freepressjournal%2F2021-07%2F9a47d38d-4944-476a-b6fb-1c99806a8243%2Fmars.jpg?rect=0%2C73%2C760%2C399&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2021-07-04T16:01:50Z", "content": "It revealed dozens of additional bright radar reflections over a far greater range of area and depth than ever before. In some places, they were less than a mile from the surface, where temperatures … [+686 chars]"}, {"source": {"id": null, "name": "Toronto Star"}, "author": null, "title": "Today's coronavirus news: Ontario reporting 209 new cases, with 20 in Toronto; Newfoundland and Labrador lifts pandemic travel ban - Toronto.com", "description": "Meanwhile, countries across Europe are scrambling to accelerate COVID-19 vaccinations and outpace the spread of the more infectious Delta variant, in ...", "url": "https://www.thestar.com/news/canada/2021/07/03/covid-19-coronavirus-updates-toronto-canada-july-3.html", "urlToImage": "https://images.thestar.com/jzVz5QwAlCMHJMoV_mdsVHm1Vkk=/1200x800/smart/filters:cb(1625362804923)/https://www.thestar.com/content/dam/thestar/news/canada/2021/07/03/covid-19-coronavirus-updates-toronto-canada-july-3/rollingjuly3.jpg", "publishedAt": "2021-07-03T21:11:15Z", "content": "The latest coronavirus news from Canada and around the world Saturday. This file will be updated throughout the day. Web links to longer stories if available.\r\n9:05 p.m.: A San Francisco Bay Area zoo… [+12892 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "COVID: Europe races to vaccinate amid surge in Delta variant - msnNOW", "description": "Experts predict that the delta variant could become the predominant strain in Europe by August. Many are calling for a more comprehensive vaccination campaign to prevent the spread of the highly transmissible mutation.", "url": "https://www.dw.com/en/covid-europe-races-to-vaccinate-amid-surge-in-delta-variant/a-58146241", "urlToImage": "https://static.dw.com/image/55970655_6.jpg", "publishedAt": "2021-07-03T11:17:00Z", "content": "European nations are racing to vaccinate their populations against the coronavirus amid fears that the highly transmissible delta variant could spark another COVID wave and overwhelm health systems.\r… [+2333 chars]"}]}