{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "דורון ג'מצ'י מנתח את סדרת הפלייאוף של מכבי נגד ריאל מדריד אחרי משחק מספר 1 - Maccabi Tel Aviv Basketball", "description": "Maccabi Tel Aviv is the biggest basketball club in Israel and one of the biggest in Europe, having won six European Cups and 108 official titles in total. Ma...", "url": "https://www.youtube.com/watch?v=ZE_XJH5qLPA", "urlToImage": "https://i.ytimg.com/vi/ZE_XJH5qLPA/hqdefault.jpg", "publishedAt": "2022-04-21T11:41:08Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Astronomers Discover Micronovae: A New Kind of Thermonuclear Stellar Explosion - SciTechDaily", "description": "A team of astronomers, with the help of the European Southern Observatory’s Very Large Telescope (ESO’s VLT), have observed a new type of stellar explosion — a micronova. These outbursts happen on the surface of certain stars, and can each burn through around…", "url": "https://scitechdaily.com/astronomers-discover-micronovae-a-new-kind-of-thermonuclear-stellar-explosion/", "urlToImage": "https://scitechdaily.com/images/Micronova.gif", "publishedAt": "2022-04-21T09:27:07Z", "content": "A team of astronomers, with the help of the European Southern Observatorys Very Large Telescope (ESOs VLT), have observed a new type of stellar explosion a micronova. These outbursts happen on the su… [+8541 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "William Ukpe", "title": "4 European biotech companies, PIA BioPharma to set up Bio-Pharma industrial complex in Nigeria - Nairametrics", "description": "4 major European biotechnology companies, including Merck, Unizima, Rommelag, and Fredlab have announced plans to set up a Bio-Pharma Industrial", "url": "https://nairametrics.com/2022/04/21/merck-unizima-rommelag-and-fredlab-collaborating-with-pia-biopharma-to-set-up-bio-pharma-industrial-complex-in-nigeria/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2022/04/Merck-Unizima-Rommelag-and-Fredlab-to-set-up-Bi.jpg", "publishedAt": "2022-04-21T06:17:32Z", "content": "4 major European biotechnology companies, including Merck, Unizima, Rommelag, and Fredlab have announced plans to set up a Bio-Pharma Industrial Complex in Nigeria, in partnership with a Nigerian com… [+2078 chars]"}]}