{"articles": [{"author": "Callum Vurley", "content": "Gary Neville has accused five Arsenal players of ignoring Mikel Arteta's instructions during their match against Liverpool at the Emirates.\r\nThe Gunners were thrashed by Jurgen Klopp's side in a brut… [+1867 chars]", "description": "Arsenal were thrashed by Liverpool in the Premier League on Saturday night to hamper their efforts to make it into a European spot after goals from Diogo Jota and Mohamed Salah", "publishedAt": "2021-04-04T04:00:00Z", "source": {"id": null, "name": "Mirror Online"}, "title": "Gary Neville accuses five Arsenal stars of ignoring Mikel Arteta's instructions - Mirror Online", "url": "https://www.mirror.co.uk/sport/football/news/gary-neville-accuses-five-arsenal-23849670", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article23342276.ece/ALTERNATES/s1200/0_LCP_CHP_180121GaryNeville_6870CarraNevilleJPG.jpg"}, {"author": null, "content": "The UK medical regulator says that out of 30 people who suffered rare blood clots after receiving the Oxford-AstraZeneca vaccine, seven have died.\r\nThe British acknowledgement of deaths comes as seve… [+4633 chars]", "description": "A number of European countries have paused the rollout of the AstraZeneca vaccine or limited its use to older people, with the European Medicines Agency (EMA) expected to announce updated advice on 7 April.", "publishedAt": "2021-04-03T21:30:24Z", "source": {"id": null, "name": "SBS News"}, "title": "Seven deaths in UK linked to AstraZeneca jab as some European countries scale back rollout - SBS News", "url": "https://www.sbs.com.au/news/seven-deaths-in-uk-linked-to-astrazeneca-jab-as-some-european-countries-scale-back-rollout", "urlToImage": "https://sl.sbs.com.au/public/image/file/e08f3336-2e15-4358-a3e1-90f2b1c79697/crop/16x9"}, {"author": null, "content": "(Photo by Johan NILSSON / TT NEWS AGENCY / AFP) / Sweden OUT\r\nThe UK medical regulator said Saturday that out of 30 people who suffered blood clots after receiving the Oxford-AstraZeneca vaccine, sev… [+2149 chars]", "description": "The UK medical regulator said Saturday that out of 30 people who suffered blood clots after receiving the Oxford-AstraZeneca vaccine, seven have died. The British acknowledgement of deaths comes as several European countries have paused the use of the AstraZe…", "publishedAt": "2021-04-03T09:40:00Z", "source": {"id": null, "name": "Guardian Nigeria"}, "title": "Seven deaths in UK among AstraZeneca jab recipients after blood clots: medical regulator - Guardian", "url": "https://guardian.ng/news/seven-deaths-in-uk-among-astrazeneca-jab-recipients-after-blood-clots-medical-regulator/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/03/AstraZeneca-.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "europe"}