{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "EU unveils ambitious climate package as it cools on fossil fuels - CNN ", "description": "The European Union has unveiled some of the world's most ambitious proposals to reduce carbon emissions and wean its 27 members off fossil fuels, including taxes on emissions-heavy imports into the union and non-renewable energy, such as oil, gas and coal.", "url": "https://www.cnn.com/2021/07/14/europe/eu-climate-change-policies-fit-for-55-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210628122456-file-germany-coal-emissions-super-tease.jpg", "publishedAt": "2021-07-14T15:45:00Z", "content": "(CNN)The European Union has unveiled some of the world's most ambitious proposals to reduce carbon emissions and wean its 27 members off fossil fuels, including taxes on emissions-heavy imports into … [+6658 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "EU unveils tough new climate rules, including tax on foreign polluters - CBC.ca", "description": "The European Union is unveiling ambitious new climate change rules on Wednesday that will include forcing more emitters to pay for their carbon output, and forcing foreign companies to pay a levy for their carbon when they sell products into Europe.", "url": "https://www.cbc.ca/news/science/europe-climate-rules-1.6102053", "urlToImage": "https://i.cbc.ca/1.6102068.1626267863!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/climate-change-eu-air.JPG", "publishedAt": "2021-07-14T14:57:50Z", "content": "European Union policy-makers on Wednesday unveiled their most ambitious plan yet to tackle climate change, aiming to turn green goals into concrete action this decade, and in doing so lead the way fo… [+5161 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Ariane 6 targets new missions with Astris kick stage - Phys.org", "description": "ESA will enhance the versatility of Europe's Ariane 6 rocket with a kick stage called Astris in a €90 m development contract with prime contractor, ArianeGroup. This is part of ESA's strategy to extend Ariane 6's capabilities to serve a wider range of space t…", "url": "https://phys.org/news/2021-07-ariane-missions-astris-stage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/ariane-6-targets-new-m.jpg", "publishedAt": "2021-07-14T13:31:20Z", "content": "ESA will enhance the versatility of Europe's Ariane 6 rocket with a kick stage called Astris in a 90 m development contract with prime contractor, ArianeGroup. This is part of ESA's strategy to exten… [+3665 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "US, European space agencies join forces on climate change - Global Times", "description": "NASA and the European Space Agency (ESA) joined forces Tuesday in the battle against climate change, a move they said paves the way to a global response to the problem.", "url": "https://www.globaltimes.cn/page/202107/1228660.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-01-21/68e8fa22-527b-4f6e-ba32-c9ec1b7e0d0b.jpeg", "publishedAt": "2021-07-14T11:13:00Z", "content": "Photo taken on Jan. 20, 2021 shows the White House in Washington, D.C., the United States. U.S. President Joe Biden on Wednesday signed an executive order returning the United States to the 2015 Pari… [+1884 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Ciaran McGrath", "title": "Bullish Macron stakes EU army leadership claim: 'Only France and US can do this' - Daily Express", "description": "EMMANUEL Macron has stoked concerns about the prospect of a European army led by himself after touting his country's peacekeeping role in Mali - and bragging: 'Only France and the US can do this.'", "url": "https://www.express.co.uk/news/world/1462513/eu-army-emmanuel-macron-france-usa-nato-frontex-joe-biden-mali-sahel-barkhane", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/78/750x445/1462513.jpg", "publishedAt": "2021-07-14T10:51:00Z", "content": null}]}