{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Digital Trends"}, "author": "Georgina Torbet", "title": "Watch the European Space Agency test its Mars rover parachute - Digital Trends", "description": "The European and Russian ExoMars rover is scheduled to travel to Mars in 2022, and agencies recently performed a high-altitude test of the rover's parachute.", "url": "https://www.digitaltrends.com/news/exomars-rover-parachute-altitude-test/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/exomars_parachute_deployed_during_high-altitude_drop_tests_pillars1.jpg", "publishedAt": "2021-07-03T19:00:08Z", "content": "Despite what you might imagine, the trickiest part of sending a rover to Mars isn’t the journey through space — it’s slowing down and landing once you arrive there. Mars’s thin atmosphere makes slowi… [+2084 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Hannah Roberts", "title": "‘It would be nice if everyone said we were lovely’: Different army of England fans in Rome for big match - The Independent", "description": "English fans from across Europe headed to the Italian capital for the match against Ukraine", "url": "https://www.independent.co.uk/news/world/europe/england-ukraine-rome-fans-euros-b1877676.html", "urlToImage": "https://static.independent.co.uk/2021/07/03/17/SEI85807509.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-07-03T17:02:41Z", "content": "A slightly different England fan army than usual descended on Rome on Saturday for the Euro 2020 quarter-final against Ukraine.\r\nEnglish expatriates living in Italy and Europe stepped in to support t… [+2240 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Karin Valentine", "title": "'Lakes' under Mars' south pole: A muddy picture? - Phys.org", "description": "Two research teams, using data from the European Space Agency's Mars Express orbiter, have recently published results suggesting that what were thought to be subsurface lakes on Mars may not really be lakes at all.", "url": "https://phys.org/news/2021-07-lakes-mars-south-pole-muddy.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/lakes-under-mars-south.jpg", "publishedAt": "2021-07-03T08:59:24Z", "content": "Two research teams, using data from the European Space Agency's Mars Express orbiter, have recently published results suggesting that what were thought to be subsurface lakes on Mars may not really b… [+6591 chars]"}]}