{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Breaking ranks with EU, Hungary says ready to pay for Russian gas in roubles - Reuters.com", "description": "Hungary said on Wednesday it was prepared to pay roubles for Russian gas, breaking ranks with the European Union which has sought a united front in opposing Moscow's demand for payment in the currency.", "url": "https://www.reuters.com/world/europe/hungary-working-solution-pay-russian-gas-may-foreign-minister-2022-04-06/", "urlToImage": "https://www.reuters.com/resizer/B35Rf4KkPI6pr4DZXFcUNpG28-k=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/WH3SO2L4T5JMJKOV3BRKXYAZNA.jpg", "publishedAt": "2022-04-06T14:38:00Z", "content": "BUDAPEST/LONDON, April 6 (Reuters) - Hungary said on Wednesday it was prepared to pay roubles for Russian gas, breaking ranks with the European Union which has sought a united front in opposing Mosco… [+4293 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Niall O'Connor", "title": "MEP Clare Daly criticises EU sanctions on Russia in European Parliament speech - TheJournal.ie", "description": "Daly has previously voted against a resolution to condemn Russia’s invasion of Ukraine.", "url": "https://www.thejournal.ie/clare-daly-sanctions-russia-european-parliament-5731540-Apr2022/", "urlToImage": "https://img2.thejournal.ie/article/5731540/river/?height=400&version=5731595", "publishedAt": "2022-04-06T13:22:00Z", "content": "CLARE DALY HAS attacked the imposition of sanctions on Russia in a speech in the European Parliament.\r\nDaly, along with her colleague Mick Wallace, was one of 13 MEPs who previously voted against a m… [+3338 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Hindi Livinus", "title": "Food crisis: Hungry persons in West Africa to reach 38 million by June - Punch Newspapers", "description": "A report issued by 11 international organisations working closely with the European Union on food emergency has said that 11 million more persons could go hungry in West Africa in the next three months, bringing the total number of hungry people in the region…", "url": "https://punchng.com/food-crisis-hungry-persons-in-wafrica-to-reach-38-million-by-june/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/10/01115850/Food-market.jpg", "publishedAt": "2022-04-06T06:34:04Z", "content": "A report issued by 11 international organisations working closely with the European Union on food emergency has said that 11 million more persons could go hungry in West Africa in the next three mont… [+2018 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Alexis Moran", "title": "Ukraine-Russia live war updates: Evacuation buses blocked from entering Mariupol, leaving Ukrainians to flee on foot - ABC News", "description": "Kremlin spokesman Dmitry Peskov says the expulsions of Russian diplomats by European countries will prompt a response from Moscow.", "url": "https://www.abc.net.au/news/2022-04-06/ukraine-russia-war-live-kyiv-lviv-zelenskyy-putin-mariupol/100967626", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/88c9aaad08b58b26ffbc519b6492629c?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=270&width=862&height=485", "publishedAt": "2022-04-05T21:24:31Z", "content": "Ukrainian residents striving to live a 'normal life' during war\r\nReporting by Jenny Cai\r\nPolina Kozlovskaya, 31, is an English teacher who is staying in the southern Ukrainian city Mykolaiv to take c… [+1449 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Hannah Knowles, Reis Thebault, Paulina Firozi, Marisa Iati, John Hudson, Ellen Francis, Amy Cheng, Adela Suliman", "title": "U.S. plans new sanctions as Zelensky calls for tribunal - The Washington Post", "description": "International outrage over alleged war crimes in a Kyiv suburb is deepening Moscow’s isolation, as the European Commission proposes a ban on Russian coal and the United States plans a new package of sanctions.", "url": "https://www.washingtonpost.com/world/2022/04/05/russia-ukraine-war-news-zelensky-live-updates/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/04-05-2022/t_c0dad2142f3d4ef7b9ff8a9678b826d9_name_20220405_RussianAbuse_Thumb1.jpg&w=1440", "publishedAt": "2022-04-05T12:41:18Z", "content": "Technology stocks took a beating Tuesday after Federal Reserve Governor Lael Brainard said stronger action may be needed to put a lid on inflation and investors continued to monitor developments out … [+1833 chars]"}, {"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "Global Times: US ramps up oil imports from Russia, pursues own interests at expense of European allies amid Ukraine crisis - The Edge Markets MY", "description": "(April 4): In a contrasting move to its pressuring of European allies to not buy Russian oil against the backdrop of the ongoing Ukraine crisis, the US increased crude oil supplies from Russia by 43 percent, or 100,000 barrels per day, over the past week, Rus…", "url": "https://www.theedgemarkets.com/article/global-times-us-ramps-oil-imports-russia-pursues-own-interests-expense-european-allies-amid", "urlToImage": "https://assets.theedgemarkets.com/pump_petrol_03032022_reuters_6.png?Ndf_bXpZLHCh7wi8sh8xbjLCOdN8HzRy", "publishedAt": "2022-04-05T03:56:38Z", "content": "(April 4): In a contrasting move to its pressuring of European allies to not buy Russian oil against the backdrop of the ongoing Ukraine crisis, the US increased crude oil supplies from Russia by 43 … [+703 chars]"}]}