{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Japanese dengue vaccine gets European recommendation - CTV News", "description": "The European Medicines Agency on Friday recommended the authorization of a dengue vaccine made by the Japanese pharmaceutical Takeda that could provide a new tool for millions worldwide against the potentially fatal disease.", "url": "https://www.ctvnews.ca/health/eu-regulator-recommends-clearing-takeda-s-dengue-vaccine-1.6110643", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/10/15/dengue-patients-being-treated-in-prayagraj--india-1-6110645-1665848919302.jpg", "publishedAt": "2022-10-15T15:51:22Z", "content": "LONDON - \r\nThe European Medicines Agency on Friday recommended the authorization of a dengue vaccine made by the Japanese pharmaceutical Takeda that could provide a new tool for millions worldwide ag… [+2253 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Perspectives on cancer screening participation in a highly urbanized region: a Q-methodology study in The Hague, the Netherlands - BMC Public Health - BMC Public Health", "description": "Background The Netherlands hosts, as many other European countries, three population-based cancer screening programmes (CSPs). The overall uptake among these CSPs is high, but has decreased over recent years. Especially in highly urbanized regions the uptake …", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-14312-4", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-10-15T13:49:31Z", "content": null}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "The praying mantis was introduced to BC in the 1930s and spread to the Okanagan - Vernon News - Castanet.net", "description": "Today's bug of the week has a European flair.", "url": "https://www.castanet.net/news/Vernon/390180/The-praying-mantis-was-introduced-to-BC-in-the-1930s-and-spread-to-the-Okanagan", "urlToImage": "https://www.castanet.net/content/2022/10/screen_shot_2022-10-12_at_12.49.40_pm_p3626617.jpg", "publishedAt": "2022-10-15T11:00:00Z", "content": "Today's bug of the week has a European flair.\r\nThe praying mantis has been getting a lot of attention recently, on social media and emails to Castanet.\r\nWith their bulging eyes and long forearms, the… [+2412 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Yash Mishra", "title": "Huawei P50 Pocket September 2022 update now available in Europe - HC Newsroom", "description": "Huawei has started releasing the September 2022 EMUI update for P50 Pocket smartphone users in Europe. After making a stable push in the global market, it’s time for European users to fetch the updated security patch for their handsets. For your information, …", "url": "https://www.huaweicentral.com/huawei-p50-pocket-september-2022-update-now-available-in-europe/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/10/Huawei-P50-Pocket-Sept-2022-1000x576.jpg", "publishedAt": "2022-10-15T10:12:12Z", "content": "Finally! Huawei Nova Y70 has started receiving a new update with camera and, system stability improvements, as well as the September 2022 EMUI security. With a handful of improvements and additions, … [+2214 chars]"}]}