{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "Varun HK", "title": "Orbiter discovers hidden water in Mars's Grand Canyon - Deccan Herald", "description": "The ExoMars Trace Gas Orbiter, operated by the European Space Agency and Russian space agency Roscosmos, has detected \"significant amounts of water\" in Mars's Grand Canyon, Valles Marineris. The water, which is hidden beneath Mars’s surface, was found by the …", "url": "https://www.deccanherald.com/science-and-environment/orbiter-discovers-hidden-water-in-marss-grand-canyon-1061758.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2021/12/17/mars-afp-1061758-1639731522.jpg", "publishedAt": "2021-12-17T08:58:42Z", "content": "The ExoMars Trace Gas Orbiter, operated by the European Space Agency and Russian space agency Roscosmos, has detected \"significant amounts of water\" in Mars's Grand Canyon, Valles Marineris.\r\nThe wat… [+2612 chars]"}, {"source": {"id": null, "name": "Tribuneonlineng.com"}, "author": "Paul Omorogbe", "title": "'Significant amounts of water' found in Mars' massive version of the Grand Canyon - NIGERIAN TRIBUNE", "description": "Mars has its own version of the Grand Canyon, and scientists have learned this dramatic feature is home to \"significant amounts of water\" after a discovery made by an orbiter circling the red planet, according to the European Space Agency, CNN has re", "url": "https://tribuneonlineng.com/significant-amounts-of-water-found-in-mars-massive-version-of-the-grand-canyon/", "urlToImage": "https://tribuneonlineng.com/wp-content/uploads/2021/12/exomars-water-detection-exlarge.jpg", "publishedAt": "2021-12-17T08:07:52Z", "content": "Mars has its own version of the Grand Canyon, and scientists have learned this dramatic feature is home to “significant amounts of water” after a discovery made by an orbiter circling the red planet,… [+5113 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Gadgets 360 Newsdesk", "title": "James Webb, the Largest-Ever Space Telescope, to Be Launched on Christmas Eve; Rocket Mounting Complete - Gadgets 360", "description": "James Webb Space Telescope, the largest space telescope ever and the most noteworthy after Hubble, has been placed atop the Ariane 5, the rocket which will launch it to space from Europe's Spaceport in French Guiana.", "url": "https://gadgets.ndtv.com/science/news/james-webb-space-telescope-launch-date-december-24-christmas-eve-ariane-5-rocket-mount-2656301", "urlToImage": "https://i.gadgets360cdn.com/large/james_webb_space_telescrope_mount_esa_website_1639728098751.jpg", "publishedAt": "2021-12-17T08:05:21Z", "content": "James Webb Space Telescope, the largest space telescope ever and the most noteworthy after Hubble, has been placed atop the Ariane 5, the rocket which will launch it to space from Europe's Spaceport … [+1909 chars]"}, {"source": {"id": null, "name": "Halifax Courier"}, "author": "Abigail Kellett", "title": "European Space Agency astronaut Tim Peake to appear at the Victoria Theatre Halifax - Halifax Courier", "description": "Fasten your seatbelts and get ready for an awe-inspiring ride.", "url": "https://www.halifaxcourier.co.uk/arts-and-culture/theatre-and-stage/european-space-agency-astronaut-tim-peake-to-appear-at-the-victoria-theatre-halifax-3495474", "urlToImage": "https://www.halifaxcourier.co.uk/webimg/QVNIMTIzNzkwNTA3.jpg?width=2048&enable=upscale", "publishedAt": "2021-12-15T12:30:00Z", "content": "Tim Peake is a European Space Agency astronaut. In December 2015, he became the first British astronaut to visit the International Space Station to conduct a spacewalk (and run a marathon) whilst orb… [+1122 chars]"}]}