{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "Will Dunham", "title": "Bulgarian cave remains reveal surprises about earliest Homo sapiens in Europe - The Star Online", "description": "(Reuters) -     DNA extracted from remains found in a Bulgarian cave of three people who lived roughly 45,000 years ago is revealing surprises about some of the first Homo sapiens populations to venture into Europe, including extensive interbreeding with Nean…", "url": "https://www.thestar.com.my/news/world/2021/04/08/bulgarian-cave-remains-reveal-surprises-about-earliest-homo-sapiens-in-europe", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/08/1105373.JPG", "publishedAt": "2021-04-07T21:55:00Z", "content": "(Reuters) - DNA extracted from remains found in a Bulgarian cave of three people who lived roughly 45,000 years ago is revealing surprises about some of the first Homo sapiens populations to venture … [+3867 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Bevan Shields", "title": "More than 700,000 AstraZeneca doses secretly flown to Australia from Britain - Sydney Morning Herald", "description": "Australia’s vaccine rollout has been propped up by doses manufactured in Britain rather than from factories in Europe as had been widely believed.", "url": "https://www.smh.com.au/world/europe/more-than-700-000-astrazeneca-doses-secretly-flown-to-australia-from-britain-20210407-p57hcl.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.1936%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_83/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/7d4c315de0694d1d1ceee293d8c8ee9db31a61db", "publishedAt": "2021-04-07T20:41:54Z", "content": "Unlike the European Union, the UK government does not have a direct right to approve or reject vaccine exports. However government officials have known about the Australian shipments and never public… [+5160 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Ancient human migration into Europe revealed via genome analysis - The Guardian", "description": "Genetic sequencing dating back 45,000 years shows intermixing with Neanderthals more common than previously thought", "url": "https://amp.theguardian.com/science/2021/apr/07/ancient-human-migration-europe-neanderthals-genetic-sequencing", "urlToImage": null, "publishedAt": "2021-04-07T17:35:00Z", "content": "AnthropologyGenetic sequencing dating back 45,000 years shows intermixing with Neanderthals more common than previously thought\r\nGenetic sequencing of human remains dating back 45,000 years has revea… [+4446 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Ben Chapman", "title": "Brexit: JPMorgan may one day move all European business out of London, says bank boss - The Independent", "description": "Leaving the EU ‘cannot possibly be good for the United Kingdom’s GDP’, says investment bank boss", "url": "https://www.independent.co.uk/news/business/brexit-jpmorgan-job-jamie-dimon-b1828032.html", "urlToImage": "https://static.independent.co.uk/2021/04/07/16/PRI189635111.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-04-07T17:19:19Z", "content": "JPMorgan may one day move all of its EU-focused business out of London and into Europe, the investment bank's boss has said.\r\nJamie Dimon said any such move would be \"many years out\" but warned that … [+2017 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Clear link between AstraZeneca vaccine and rare blood clots in brain, EMA official tells paper - AsiaOne", "description": "ROME - There is a link between AstraZeneca’s Covid-19 vaccine and very rare blood clots in the brain but the possible causes are still unknown, a senior official for the European Medicines Agency (EMA) said in an interview published on Tuesday (April 6). Howe…", "url": "https://www.asiaone.com/world/clear-link-between-astrazeneca-vaccine-and-rare-blood-clots-brain-ema-official-tells-paper", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Apr2021/20210407_astrazenecavaccine_reuters.jpg?h=0429cc9e&itok=hIyvuV5J", "publishedAt": "2021-04-07T01:42:00Z", "content": "ROME - There is a link between AstraZenecas Covid-19 vaccine and very rare blood clots in the brain but the possible causes are still unknown, a senior official for the European Medicines Agency (EMA… [+3306 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Australia calls for release of 3.1 million COVID-19 vaccine doses if EU not blocking exports - CNA", "description": "SYDNEY: Australia said on Wednesday (Apr 7) it will ask the European Union to release more than 3 million doses of AstraZeneca's COVID-19 vaccine, testing Brussel's claim it is not blocking shipments, as the country struggles to vaccinate its population.", "url": "https://www.channelnewsasia.com/news/world/australia-calls-for-release-of-3-1-million-covid-19-vaccine-14571478", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14571264/16x9/991/557/1a429359aa8f014dcd952c44420eb707/GS/file-photo--oxfordastrazeneca-s-covid-19-vaccine-at-a-vaccination-centre-in-antwerp-1.jpg", "publishedAt": "2021-04-07T00:56:15Z", "content": "SYDNEY: Australia said on Wednesday (Apr 7) it will ask the European Union to release more than 3 million doses of AstraZeneca's COVID-19 vaccine, testing Brussel's claim it is not blocking shipments… [+2583 chars]"}, {"source": {"id": null, "name": "Autocar.co.nz"}, "author": null, "title": "Clock is ticking on Honda Civic Type R orders - Autocar - NZ Autocar", "description": "The end of an era will come later this year, as Honda’s European division prepares to close its Swindon production plant — simultaneously ending production of the current award-winning FK8-generation Civic Type R.", "url": "https://www.autocar.co.nz/autocar-news-app/clock-is-ticking-on-honda-civic-type-r-orders", "urlToImage": "https://www.autocar.co.nz/_News/Honda-Civic-Type-R-2021/3J9A9932-Edit.jpg", "publishedAt": "2021-04-06T01:27:40Z", "content": "The end of an era will come later this year, as Hondas European division prepares to close its Swindon production plant simultaneously ending production of the current award-winning FK8-generation Ci… [+1661 chars]"}]}