{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What to expect from the rand in the coming months - BusinessTech", "description": "South Africa’s rand is expected to be beaten around by global markets in the coming months, as inflationary and interest rate pressure from central banks in the US and the European Union continue to dominate global market movements.", "url": "https://businesstech.co.za/news/finance/624959/what-to-expect-from-the-rand-in-the-coming-months-3/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/Rand-e1601546534500.png", "publishedAt": "2022-09-12T14:47:50Z", "content": "The rand is expected to be beaten around by global markets in the coming months, as inflationary and interest rate pressure from central banks in the US and the European Union continue to dominate gl… [+4226 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Swedish voters boost anti-immigration party amid high crime - CTV News", "description": "A populist anti-immigration party has surged to become Sweden's second-largest political force after a national election dominated by fears of gang violence, which has given the once-safe Scandinavian country one of Europe's highest levels of gun violence.", "url": "https://www.ctvnews.ca/world/swedish-voters-boost-anti-immigration-party-amid-high-crime-1.6064860", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/9/12/sweden-democrats-leader-jimmie-akesson-1-6064869-1662991177277.jpg", "publishedAt": "2022-09-12T14:01:16Z", "content": "STOCKHOLM - \r\nA populist anti-immigration party has surged to become Sweden's second-largest political force after a national election dominated by fears of gang violence, which has given the once-sa… [+5035 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Karl Ritter", "title": "Last reactor at Ukraine's Zaporizhzhia nuclear plant stopped - CP24", "description": "Europe's largest nuclear plant has been reconnected to Ukraine's electricity grid, allowing engineers to shut down its last operational reactor in an attempt to avoid a radiation disaster as fighting rages in the area.", "url": "https://www.cp24.com/world/last-reactor-at-ukraine-s-zaporizhzhia-nuclear-plant-stopped-1.6063908", "urlToImage": "https://www.cp24.com/polopoly_fs/1.6063909.1662894882!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-09-11T11:15:08Z", "content": "KYIV, Ukraine (AP) Europe's largest nuclear plant has been reconnected to Ukraine's electricity grid, allowing engineers to shut down its last operational reactor in an attempt to avoid a radiation d… [+2294 chars]"}]}