{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "City A.M."}, "author": "Michiel Willems", "title": "Higher roaming bills for millions of Brits from this week as Brexit allows EE and Vodafone to slap steep new fees on trips to Europe - City A.M.", "description": "Two of the UK’s four biggest networks – EE and Vodafone – are reintroducing roaming charges for customers travelling to Europe from this month, with Three", "url": "https://www.cityam.com/higher-roaming-bills-for-millions-of-brits-from-this-week-as-brexit-allows-ee-and-vodafone-to-slap-steep-new-fees-on-trips-to-europe/", "urlToImage": "https://www.cityam.com/wp-content/uploads/2021/10/City-AM-OG-1.jpg", "publishedAt": "2022-01-03T09:59:00Z", "content": "Monday 03 January 2022 12:50 pm\r\nA man walks through a terminal at Paris Charles de Gaulle airport near Paris\r\nTwo of the UKs four biggest networks EE and Vodafone are reintroducing roaming charges f… [+1603 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Cristian Gnaticov", "title": "2022 Toyota Hilux GR Sport Brings Rally-Inspired Goodies to Europe's Truck Segment - autoevolution", "description": "Toyota has expanded its GR Sport lineup to include the 2022 Hilux. The pickup is said to have been inspired by the Dakar racer and brings a few styling and mechanical tweaks to the popular model.", "url": "https://www.autoevolution.com/news/2022-toyota-hilux-gr-sport-brings-rally-inspired-goodies-to-europe-s-truck-segment-178112.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/2022-toyota-hilux-gr-sport-brings-rally-inspired-goodies-to-europes-truck-segment-178112_1.jpg", "publishedAt": "2022-01-03T09:44:00Z", "content": "Aptly named the Toyota Hilux GR Sport, it features an upgraded suspension, with new monotube shocks, and front springs. Stiffened front coil springs are part of the makeover, and these changes, combi… [+1641 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Adam Samson", "title": "European stocks hit new record high in 2022 debut - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/71de0f7c-a643-4d65-bbaf-ce561e735489", "urlToImage": null, "publishedAt": "2022-01-03T09:19:13Z", "content": "Expert insights, analysis and smart data help you cut through the noise to spot trends,\r\nrisks and opportunities.\r\nJoin over 300,000 Finance professionals who already subscribe to the FT."}, {"source": {"id": null, "name": "Theinformant.co.nz"}, "author": "Callie Jensen", "title": "Will there soon be disabled astronauts in space? - theinformant.co.nz", "description": "Last March, the European Space Agency (ESA) took the initiative to allow people with disabilities", "url": "https://theinformant.co.nz/will-there-soon-be-disabled-astronauts-in-space/", "urlToImage": null, "publishedAt": "2022-01-03T07:34:38Z", "content": "Last March, the European Space Agency (ESA) took the initiative to allow people with disabilities to explore new horizons by opening a process to select disabled astronauts for a future space mission… [+1381 chars]"}]}