{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Monkeypox emergency could last months, with window closing to stop spread, experts say - Japan Today", "description": "Scientists advising the World Health Organization (WHO) on monkeypox say the window is closing to stop its spread, with cases currently doubling every two weeks, raising concerns that it will take several months for the outbreak to peak. WHO Europe has foreca…", "url": "https://japantoday.com/category/features/health/monkeypox-emergency-could-last-months-with-window-closing-to-stop-spread-experts-say2", "urlToImage": null, "publishedAt": "2022-07-30T20:30:00Z", "content": "Scientists advising the World Health Organization (WHO) on monkeypox say the window is closing to stop its spread, with cases currently doubling every two weeks, raising concerns that it will take se… [+3550 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "3 monkeypox deaths reported outside Africa; Spain reports second death in two days | WION - WION", "description": "Spain has reported second Monkeypox-related death in Europe. One death was also reported in Brazil. Spain is one of the worst hit countries by the Monkeypox ...", "url": "https://www.youtube.com/watch?v=WmkoWuK4zDA", "urlToImage": "https://i.ytimg.com/vi/WmkoWuK4zDA/maxresdefault.jpg", "publishedAt": "2022-07-30T15:17:34Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Spain reports second death related to monkeypox - The Guardian", "description": "Health ministry says 4,298 cases confirmed in Spain, as it records what is thought to be Europe’s second death in outbreak", "url": "https://amp.theguardian.com/world/2022/jul/30/spain-reports-second-death-related-to-monkeypox", "urlToImage": null, "publishedAt": "2022-07-30T12:55:00Z", "content": "MonkeypoxHealth ministry says 4,298 cases confirmed in Spain, as it records what is thought to be Europes second death in outbreak\r\nSat 30 Jul 2022 13.55 BST\r\nSpain reported its second monkeypox-rela… [+1749 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "Lulu Yilun Chen, Abhishek Vishnoi", "title": "Jack Ma escapes Beijing's crosshairs by giving up his power - The Star Online", "description": "Jack Ma is taking a weeks-long tour in Europe after largely disappearing from public view for almost two years, adding to signs that China’s government is easing pressure on the entrepreneur as he steps back from a business empire that had made him one of the…", "url": "https://www.thestar.com.my/tech/tech-news/2022/07/29/jack-ma-escapes-beijings-crosshairs-by-giving-up-his-power", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/07/29/1676941.jpg", "publishedAt": "2022-07-29T03:44:00Z", "content": "Jack Ma is taking a weeks-long tour in Europe after largely disappearing from public view for almost two years, adding to signs that Chinas government is easing pressure on the entrepreneur as he ste… [+6030 chars]"}]}