{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "EU wants to send more people back to Africa, Middle East, Asia - Reuters", "description": "European Union migration ministers meet on Thursday to discuss visa restrictions and better coordination inside the bloc to be able to send more people with no right to asylum in Europe back to their home countries including Iraq.", "url": "https://www.reuters.com/world/europe/eu-wants-send-more-people-back-africa-middle-east-asia-2023-01-26/", "urlToImage": "https://www.reuters.com/resizer/xjEcupDro7qg-LzYQH5lp-KX1zQ=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/K2CY53KSABJ6JIX3M5N3DIZ5WE.jpg", "publishedAt": "2023-01-26T09:57:00Z", "content": "STOCKHOLM, Jan 26 (Reuters) - European Union migration ministers meet on Thursday to discuss visa restrictions and better coordination inside the bloc to be able to send more people with no right to … [+3108 chars]"}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "Singapore female student rates European countries based on how safe she felt there - AsiaOne", "description": "When discussing vacations, the phrase \"safety first\" may not immediately spring to mind. But why shouldn't it? Before one can fully enjoy a trip, a sense of safety has to first be felt by the traveller. A Singapore student, known as Chri5tie on TikTok, was tr…", "url": "https://www.asiaone.com/lifestyle/singapore-female-student-rates-european-countries-based-how-safe-she-felt-there", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Jan2023/260123_ratingeuropecities_TikTokHL.jpg?h=0429cc9e&itok=7jZBsjZ5", "publishedAt": "2023-01-26T05:30:00Z", "content": "When discussing vacations, the phrase \"safety first\" may not immediately spring to mind.\r\nBut why shouldn't it? Before one can fully enjoy a trip, a sense of safety has to first be felt by the travel… [+3209 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kate Pickles", "title": "Pre-eclampsia raises risk of heart attack four-fold, study warns - Daily Mail", "description": "Researchers looked at the health records of more than a million pregnant women in Denmark between 1978 and 2017. Results were published in the European Journal of Preventive Cardiology.", "url": "https://www.dailymail.co.uk/health/article-11676055/Pre-eclampsia-raises-risk-heart-attack-four-fold-study-warns.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/01/25/17/66964499-0-image-a-5_1674666821974.jpg", "publishedAt": "2023-01-26T00:05:00Z", "content": "Pregnant women with pre-eclampsia are four times more likely to have a heart attack and stroke in middle age, a study found.\r\nThe condition, which causes high blood pressure during pregnancy, can rai… [+6635 chars]"}]}