{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mars Crater Resembling \"Eye Of Sahara\" Possibly Carried Water, Says Agency - NDTV", "description": "The crater's image also shows several colours on the surface, which according to European Space Agency (ESA), suggests that this region of Mars is made up of a variety of materials.", "url": "https://www.ndtv.com/science/mars-crater-resembling-eye-of-sahara-possibly-carried-water-says-agency-3062297", "urlToImage": "https://c.ndtvimg.com/2022-06/9fnc9u78_mars-aonia-crater-650_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T08:19:27Z", "content": "The image of the Mars crater released by the European Space Agency.\r\nThe European Space Agency (ESA) has released a photo of Martian landscape, which shows a crater on Aonia Terra in the southern hig… [+4450 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Jennifer Grant", "title": "Ask the doctor: Should my granddaughter have her adenoids removed? - Independent.ie", "description": "Question: My three-year-old granddaughter lives in another European country and has been sick a lot lately. The doctor there has suggested that she have her adenoids removed but my son is against it as he wants more information before they get it done and the…", "url": "https://www.independent.ie/life/health-wellbeing/health-features/ask-the-doctor-should-my-granddaughter-have-her-adenoids-removed-41745519.html", "urlToImage": "https://www.independent.ie/life/health-wellbeing/health-features/ba25a/41745518.ece/AUTOCROP/w1240h700/ih%20ask%20the%20doc3", "publishedAt": "2022-06-13T01:30:00Z", "content": "Question: My three-year-old granddaughter lives in another European country and has been sick a lot lately. The doctor there has suggested that she have her adenoids removed but my son is against it … [+3296 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Lauren Boland", "title": "Quiz: How much do you know about smartphones? - TheJournal.ie", "description": "The European Union made an important decision this week that’ll affect them.", "url": "https://www.thejournal.ie/smartphones-quiz-test-yourself-5786559-Jun2022/", "urlToImage": "https://img2.thejournal.ie/article/5786559/river/?height=400&version=5786912", "publishedAt": "2022-06-12T21:00:00Z", "content": "TheJournal.ie supports the work of the Press Council of Ireland and the Office of the Press Ombudsman, and our staff operate within the Code of Practice. You can obtain a copy of the Code, or contact… [+1012 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Oladayo Jonathan", "title": "2023: Lagos youth defy rain to get PVC at mega concert - Premium Times", "description": "The event was organised by the Independent National Electoral Commission, Yiaga Africa, and the European Union.", "url": "https://www.premiumtimesng.com/news/more-news/536619-2023-lagos-youth-defy-rain-to-get-pvc-at-mega-concert.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/06/images-52.jpeg", "publishedAt": "2022-06-12T15:33:02Z", "content": "Nigerian youth and stars defied the rain when they attended the Youth Vote Count Mega Concert 2.0 at the Tafawa Balewa Square, Lagos State, on Saturday.\r\nThe heavy downpour did not deter the mammoth … [+3256 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Europe’s Largest Predatory Dinosaur Unearthed on the Isle of Wight - SciTechDaily", "description": "Despite a land area of just 148 square miles (384 km2), the Isle of Wight, an island off England, is one of the richest dinosaur localities in Europe. In fact, over 20 species of dinosaur have been found there from the early Cretaceous Period, including some …", "url": "https://scitechdaily.com/europes-largest-predatory-dinosaur-unearthed-on-the-isle-of-wight/", "urlToImage": "https://scitechdaily.com/images/White-Rock-Spinosaurid-scaled.jpg", "publishedAt": "2022-06-12T03:24:29Z", "content": "ByUniversity of SouthamptonJune 11, 2022\r\nIllustration of White Rock spinosaurid by Anthony Hutchings. Credit: UoS/A Hutchings\r\nDespite a land area of just 148 square miles (384 km2), the Isle of Wig… [+4732 chars]"}]}