{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Russia's Gazprom further cuts gas flow to Europe by half amid turbine dispute - CBC News", "description": "Russia tightened its gas squeeze on Europe on Monday as Gazprom, Russia's state-owned energy corporation, said supplies through the Nord Stream 1 pipeline to Germany would drop to just 20 per cent of capacity.", "url": "https://www.cbc.ca/news/world/gazprom-russian-gas-europe-1.6531274", "urlToImage": "https://i.cbc.ca/1.6531289.1658769845!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1241836844.jpg", "publishedAt": "2022-07-25T19:12:15Z", "content": "Russia tightened its gas squeeze on Europe on Monday as Gazprom, Russia's state-owned energy corporation, said supplies through the Nord Stream 1 pipeline to Germany would drop to just 20 per cent of… [+3561 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "Japan Detects First Monkeypox Case; Man in His 30s Who Returned from Europe - News18", "description": "So far this year, there have been more than 16,000 monkeypox cases in more than 75 countries, and five deaths in Africa", "url": "https://www.news18.com/news/world/japan-detects-first-monkeypox-case-man-in-his-30s-who-returned-from-europe-5623471.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/07/reuters-monkeypox-vaccine-165777444716x9.png", "publishedAt": "2022-07-25T12:25:04Z", "content": "Japan detected its first case of the monkeypox virus, in Tokyo, the capitals governor said on Monday.\r\nThe infected person is a man in his 30s who has returned from Europe and is currently in a hospi… [+447 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "ASUS ROG Flow X16: Convertible gaming laptop launches in Europe from €2499 - Notebookcheck.net", "description": "ASUS has started selling the ROG Flow X16 in Europe, where it starts at €2,499. Paired with AMD Ryzen 6000 and NVIDIA GeForce RTX 30 series GPUs, the ROG Flow X16 also has a Mini LED display that peaks at 1,000 nits in a convertible design. The ROG Flow X16 n…", "url": "https://www.notebookcheck.net/ASUS-ROG-Flow-X16-Convertible-gaming-laptop-launches-in-Europe-from-EUR2-499.636793.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/ROG_Flow_X16.jpeg", "publishedAt": "2022-07-25T12:24:05Z", "content": "It has been a while since ASUS presented the ROG Flow X16, a 16-inch gaming laptop with a convertible design. Unveiled in May, it has taken over two months for ASUS to start selling the laptop in Eur… [+1306 chars]"}, {"source": {"id": null, "name": "Azoquantum.com"}, "author": null, "title": "Star Formation Impacted by Supermassive Blackhole - AZoQuantum", "description": "Using data from the Atacama Large Millimeter Array (ALMA) and Very Large Telescope (VLT) of the European Southern Observatory (ESO), a European team of astronomers measures the gas pressure and studies how the powerful jets of a supermassive black hole alter …", "url": "https://www.azoquantum.com/News.aspx?newsID=9115", "urlToImage": "https://dwg31ai31okv0.cloudfront.net/images/news/ImageForNews_9115_16587514915283323.jpg", "publishedAt": "2022-07-25T12:23:00Z", "content": "Jul 25 2022Reviewed by Alex Smith\r\nUsing data from the Atacama Large Millimeter Array (ALMA) and Very Large Telescope (VLT) of the European Southern Observatory (ESO), a European team of astronomers … [+5402 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Samantha Mathewson", "title": "Stunning new Mars photos explore the solar system's largest canyon - Space.com", "description": "The European Space Agency's Mars Express spacecraft captured impressive new views of Valles Marineris.", "url": "https://www.space.com/mars-photos-largest-canyon-solar-system", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cTsmeTevoZodxfWnBZJZUC-1200-80.jpg", "publishedAt": "2022-07-25T10:00:21Z", "content": "New images of Mars explore the depths of the Red Planet's Valles Marineris canyon, the largest canyon system in the solar system. \r\nThe European Space Agency's (ESA) images, which were taken using th… [+2979 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Greg Mills", "title": "African support of Russian invasion extraordinary after... - Daily Maverick", "description": "Many Africans seem ambivalent about Putin’s attempts to recreate Russia’s empire, even though colonialism caused the African continent so much personal pain and injury, and seeded state dysfunction. Liberation struggles should be worthy of support, in Europe …", "url": "https://www.dailymaverick.co.za/article/2022-07-24-african-support-of-russian-invasion-extraordinary-after-the-continents-colonial-past/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/07/A-reminder-in-Kyiv-ofthe-cost-of-war-Greg-Mills.jpg?w=1280", "publishedAt": "2022-07-24T21:02:20Z", "content": "No nation has the right to make decisions for another nation; no people for another people. These were the words of Tanzanian President Julius Kambarage Nyerere on colonialism in January 1968. Such p… [+6114 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bloomberg", "title": "Africa: Banned in Europe, Kremlin-backed RT channel to set up hub in South Africa - Daily Maverick", "description": "RT is setting up an Africa English language hub in South Africa. An earlier African plan had focused on a Nairobi office.", "url": "https://www.dailymaverick.co.za/article/2022-07-24-banned-in-europe-kremlin-backed-rt-channel-to-set-up-hub-in-south-africa/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/07/RT-bloomberg-e1658647275511.jpeg?w=1280", "publishedAt": "2022-07-24T15:00:55Z", "content": "RT, the Kremlin-backed TV network formerly called Russia Today, is setting up its first Africa bureau as President Vladimir Putin seeks to entrench support in a continent thats largely refrained from… [+2215 chars]"}]}