{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Susanne Gargiulo and Reuters", "title": "Russia's war on Ukraine prompts Denmark to vote to join EU shared defense policy - CNN", "description": "Danes overwhelmingly voted to join the European Union's defense policy on Wednesday, in yet another sign of how Russia's invasion of Ukraine is reshaping the bloc's security landscape.", "url": "https://www.cnn.com/2022/06/01/europe/denmark-eu-defense-policy-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220601055604-estonia-danish-soldiers-nato-exercise-052522-super-tease.jpg", "publishedAt": "2022-06-01T20:48:00Z", "content": null}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Laurence Norman", "title": "Europe Overcomes Hungary’s Veto on Russian Oil Embargo—at a Price - The Wall Street Journal", "description": "By holding up a deal on oil sanctions for weeks, Hungarian Prime Minister Viktor Orban exposed the EU’s divisions on how ambitiously to target Moscow’s coffers in response to Russia’s invasion of Ukraine.", "url": "https://www.wsj.com/articles/europe-overcomes-hungarys-veto-on-russian-oil-embargoat-a-price-11654092031", "urlToImage": "https://images.wsj.net/im-555171/social", "publishedAt": "2022-06-01T20:26:00Z", "content": "Two weeks into Russias invasion of Ukraine, Hungarian Prime Minister Viktor Orban warned that his support for international sanctions on Moscow would only go so far. It took months for the European U… [+321 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Emer Moreau", "title": "UK airlines under fire for jubilee and summer getaway chaos - TheJournal.ie", "description": "Airlines for Europe, which represents EU airlines, predicted the problem would continue ‘for a good chunk of the summer season’.", "url": "https://www.thejournal.ie/uk-airports-airlines-delays-jubilee-5780593-Jun2022/", "urlToImage": "https://img2.thejournal.ie/article/5780593/river/?height=400&version=5780613", "publishedAt": "2022-06-01T17:15:00Z", "content": "BRITAINS AIRPORTS ARE coming under fire for failing to prepare for this weeks jubilee bank holiday, as well as the upcoming summer season, as passengers face long delays and cancelled flights.\r\nSharo… [+3339 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Ukraine war: EU bans imports of most Russian oil - CTV News", "description": "The European Union's groundbreaking decision to ban nearly all oil from Russia to punish the country for its invasion of Ukraine is a blow to Moscow's economy, but its effects may be blunted by rising energy prices and other countries willing to buy some of t…", "url": "https://www.ctvnews.ca/business/high-prices-asian-markets-could-blunt-eu-ban-on-russian-oil-1.5925486", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/5/31/ukrainian-demonstrators-in-brussels-1-5925498-1653992215773.jpg", "publishedAt": "2022-05-31T09:38:00Z", "content": "BRUSSELS - \r\nThe European Union's groundbreaking decision to ban nearly all oil from Russia to punish the country for its invasion of Ukraine is a blow to Moscow's economy, but its effects may be blu… [+5337 chars]"}]}