{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Australia calls for release of 3.1 million COVID-19 vaccine doses if EU not blocking exports - CNA", "description": "SYDNEY: Australia said on Wednesday (Apr 7) it will ask the European Union to release more than 3 million doses of AstraZeneca's COVID-19 vaccine, testing Brussel's claim it is not blocking shipments, as the country struggles to vaccinate its population.", "url": "https://www.channelnewsasia.com/news/world/australia-calls-for-release-of-3-1-million-covid-19-vaccine-14571478", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14571264/16x9/991/557/1a429359aa8f014dcd952c44420eb707/GS/file-photo--oxfordastrazeneca-s-covid-19-vaccine-at-a-vaccination-centre-in-antwerp-1.jpg", "publishedAt": "2021-04-07T00:56:15Z", "content": "SYDNEY: Australia said on Wednesday (Apr 7) it will ask the European Union to release more than 3 million doses of AstraZeneca's COVID-19 vaccine, testing Brussel's claim it is not blocking shipments… [+2583 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Daniel Hurst, Paul Karp", "title": "Scott Morrison calls on European Union to supply outstanding AstraZeneca Covid vaccine doses - The Guardian", "description": "European Commission says just one shipment of 250,000 AstraZeneca doses has been formally blocked, but Coalition says AZ has not been able to secure an export licence from Europe", "url": "https://amp.theguardian.com/society/2021/apr/07/australia-accuses-eu-of-semantics-over-blocked-astrazeneca-covid-vaccine-claims", "urlToImage": null, "publishedAt": "2021-04-06T23:31:59Z", "content": "Vaccines and immunisationAustralia has accused the EU of semantics after European Commission said just one shipment of 250,000 AstraZeneca doses has been formally blocked, but Coalition says AZ has n… [+6927 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Is this the oldest map in Europe? Stone slab with markings made 4000 years ago shows part of France - Daily Mail", "description": "Scientists analyzed a Bronze Age stone slab in France that is deemed Europe's oldest map. Etchings made 4,000 years ago land area and rivers located in West Brittany.", "url": "https://www.dailymail.co.uk/sciencetech/article-9442343/Is-oldest-map-Europe-Stone-slab-markings-4-000-years-ago-shows-France.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/06/22/41419666-0-image-a-33_1617742869911.jpg", "publishedAt": "2021-04-06T21:01:18Z", "content": "A Bronze Age stone slab unearthed in France in 1900 has been rediscovered in a new analysis that deems it to be the oldest known map in Europe.\r\nA team of French scientists determined the markings we… [+3173 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "Euro medical exec cites link between AstraZeneca jab, blood clots - INQUIRER.net", "description": "ROME — There is a link between AstraZeneca’s COVID-19 vaccine and very rare blood clots in the brain, but the possible causes are still unknown, a senior official for the European Medicines Agency", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/Thailand-to-start-using-AstraZeneca-vaccine-Tuesday-after-delay-over-safety-620x439.png", "publishedAt": "2021-04-06T20:55:00Z", "content": "ROME There is a link between AstraZenecas COVID-19 vaccine and very rare blood clots in the brain, but the possible causes are still unknown, a senior official for the European Medicines Agency (EMA)… [+3368 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "COVID-19 Update | WHO says AstraZeneca benefits outweigh risks; assessing latest data - Moneycontrol.com", "description": "The WHO is closely studying the latest data alongside European and other regulators, in light of reports of blood clots among people who have been vaccinated.", "url": "https://www.moneycontrol.com/news/coronavirus/covid-19-update-who-says-astrazeneca-benefits-outweigh-risks-assessing-latest-data-6737731.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/SS-AstraZeneca-Vaccine-770x433.jpg", "publishedAt": "2021-04-06T16:51:51Z", "content": "The World Health Organization expects there will be no reason to change its assessment that the benefits of the AstraZeneca vaccine against COVID-19 outweigh any risks, a regulatory official told a n… [+539 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Australia short of 3 million AstraZeneca COVID-19 vaccine doses in blow to vaccination drive - The Star Online", "description": "SYDNEY (Reuters) -     Australia on Tuesday said it had not yet received more than 3 million doses of previously promised AstraZeneca COVID-19 vaccine doses amid export curbs by the European Union, leaving a major hole in its early nationwide inoculation driv…", "url": "https://www.thestar.com.my/news/world/2021/04/06/australia-short-of-3-million-astrazeneca-covid-19-vaccine-doses-in-blow-to-vaccination-drive", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/04/06/1103187.JPG", "publishedAt": "2021-04-06T04:39:00Z", "content": "SYDNEY (Reuters) - Australia on Tuesday said it had not yet received more than 3 million doses of previously promised AstraZeneca COVID-19 vaccine doses amid export curbs by the European Union, leavi… [+2169 chars]"}, {"source": {"id": null, "name": "Autocar.co.nz"}, "author": null, "title": "Clock is ticking on Honda Civic Type R orders - Autocar - NZ Autocar", "description": "The end of an era will come later this year, as Honda’s European division prepares to close its Swindon production plant — simultaneously ending production of the current award-winning FK8-generation Civic Type R.", "url": "https://www.autocar.co.nz/autocar-news-app/clock-is-ticking-on-honda-civic-type-r-orders", "urlToImage": "https://www.autocar.co.nz/_News/Honda-Civic-Type-R-2021/3J9A9932-Edit.jpg", "publishedAt": "2021-04-06T01:27:40Z", "content": "The end of an era will come later this year, as Hondas European division prepares to close its Swindon production plant simultaneously ending production of the current award-winning FK8-generation Ci… [+1661 chars]"}, {"source": {"id": null, "name": "Thedailyguardian.net"}, "author": "Abigail Brewer", "title": "NASA advances a mission to the moon Europa - thedailyguardian.net", "description": "Madrid, April 5. (Europe Press) - Europa Clipper, NASA's next major mission to the outer solar system, You have passed an important milestone by", "url": "https://thedailyguardian.net/nasa-advances-a-mission-to-the-moon-europa/", "urlToImage": null, "publishedAt": "2021-04-05T12:04:38Z", "content": "Madrid, April 5. (Europe Press) – \r\n Europa Clipper, NASA’s next major mission to the outer solar system, You have passed an important milestone by completing a critical design review.\r\n This spacecr… [+4472 chars]"}]}