{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "At a secret airfield in Eastern Europe, a multinational effort to send weapons to Ukraine proceeds at high speed - CNN", "description": "Chairman of the Joint Chiefs of Staff Gen. Mark Milley went last week to an undisclosed airfield near the Ukrainian border that has become a hub for shipping weapons, a senior Defense Department official said, seeing firsthand the multinational effort to get …", "url": "https://www.cnn.com/2022/03/06/politics/mark-milley-ukraine-military-assistance/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220302223207-ukrainian-servicemen-tanks-022522-super-tease.jpg", "publishedAt": "2022-03-07T13:14:00Z", "content": "Washington (CNN)Chairman of the Joint Chiefs of Staff Gen. Mark Milley went last week to an undisclosed airfield near the Ukrainian border that has become a hub for shipping weapons, a senior Defense… [+3806 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Canada, U.K., Netherlands discuss humanitarian coalition for Ukraine - CBC News", "description": "The prime ministers of three leading western democracies met at a Royal Air Force base to discuss what sort of firm humanitarian action can be taken to ease the suffering of the Ukrainian people as Russia's invasion of the eastern European country grinds on.", "url": "https://www.cbc.ca/news/politics/canada-ukraine-britain-netherlands-humanitarian-coalition-1.6375216", "urlToImage": "https://i.cbc.ca/1.6375232.1646653346!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/ukraine-crisis-britain-canada.JPG", "publishedAt": "2022-03-07T12:15:37Z", "content": "British Prime Minister Boris Johnson invoked the Battle of Britain as he opened a bilateral meeting Monday with Prime Minister Justin Trudeau as the two leaders met to discuss the rapidly evolving cr… [+2941 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Russian assault on Ukraine rattles markets, Indian investors lose Rs 29 lakh crore since February - Moneycontrol", "description": "Russia's aggressive fight to invade Ukraine seems to be turning severe not only for Moscow but also for global growth as there is a possibility that the US and allies including European nations are expected to ban Russian oil and natural gas but without hurti…", "url": "https://www.moneycontrol.com/news/business/markets/russian-assault-on-ukraine-rattles-markets-indian-investors-lose-rs-29-lakh-crore-since-february-8202001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2018/01/Bear_Budget_2017_Bull_Budget_20171-770x433.jpg", "publishedAt": "2022-03-07T08:24:43Z", "content": "Bears tightened their grip over Dalal Street on March 7, wiping out more than Rs 29 lakh crore of investors' wealth since the beginning of February.\r\nThe Russian assault on Ukraine seems to be turnin… [+3564 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "David McCowen", "title": "New look for budget favourite - news.com.au", "description": "<p>MG has updated its <a href=\"https://www.news.com.au/technology/motoring/motoring-news/updated-mg-zs-ev-revealed-in-europe/news-story/1d4527068c4a6b08c9cf51f3c8db5ca4\" data-tgev=\"event119\" data-tgev-container=\"bodylink\" data-tgev-order=\"1d4527068c4a6b08c9cf…", "url": "https://www.news.com.au/technology/motoring/motoring-news/new-looks-for-mg-zs-electric-suv/news-story/523d060434d9fbf7ab24b48e81c986fb", "urlToImage": "https://content.api.news/v3/images/bin/64822ea1668257c0ef755da22e4cd119", "publishedAt": "2022-03-07T05:22:03Z", "content": "This cut-price electric SUV will now drive further on a single charge thanks to a bigger battery, but buyers will pay a price for the improvement in range.MG has updated its electric SUV, giving the … [+2605 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "War: US, Europe plan escape routes for Ukrainian President, Zelensky as Russia pushes harder - Daily Post Nigeria", "description": "The United States of America and Europe are weighing up plans for President Volodymyr Zelensky to escape Kyiv and establish the Ukrainian government in exile. According to CNN, the US and European officials are in discussion on how the West would support a go…", "url": "https://dailypost.ng/2022/03/07/war-us-europe-plan-escape-routes-for-ukrainian-president-zelensky-as-russia-pushes-harder/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/02/176264.jpg", "publishedAt": "2022-03-07T05:11:13Z", "content": "The United States of America and Europe are weighing up plans for President Volodymyr Zelensky to escape Kyiv and establish the Ukrainian government in exile.\r\nAccording to CNN, the US and European o… [+1423 chars]"}, {"source": {"id": null, "name": "Kitco NEWS"}, "author": "http://www.facebook.com/kitconews", "title": "Oil price surges to highest since 2008 on delays in Iranian talks - Kitco NEWS", "description": "NEW YORK, March 6 (Reuters) - Oil prices soared to their highest since 2008 due to delays in the potential return of Iranian crude to global markets and as the United States and European allies consider banning imports of Russian oil.", "url": "https://www.kitco.com/news/2022-03-06/Oil-price-surges-to-highest-since-2008-on-delays-in-Iranian-talks.html", "urlToImage": "https://www.kitco.com/news/images/reuters/Reuters_235x147_V3.jpg", "publishedAt": "2022-03-07T02:11:00Z", "content": "NEW YORK, March 6 (Reuters) - Oil prices soared to their highest since 2008 due to delays in the potential return of Iranian crude to global markets and as the United States and European allies consi… [+3907 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Ray Hartley and Greg Mills", "title": "WAR IN EUROPE OP-ED: Cries of pain and anguish — why the ANC is on the wrong side of history over Ukraine - Daily Maverick", "description": "The ANC, having returned to its Russian lodestar, faces a second rude awakening. This time it is not the Berlin Wall falling, so much as the free world erecting a wall of isolation around Russia — a Berlin Wall in reverse, this time insulating the West agains…", "url": "https://www.dailymaverick.co.za/article/2022-03-06-cries-of-pain-and-anguish-why-the-anc-is-on-the-wrong-side-of-history-over-ukraine/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/ED_366873.jpg?w=1280", "publishedAt": "2022-03-06T20:12:33Z", "content": "Thirty-five countries voted to abstain in the recent United Nations vote condemning the Russian invasion of Ukraine. Five predictably voted against: Russia, Syria, Eritrea, Belarus and North Korea. O… [+10879 chars]"}]}