{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Herman Mostert", "title": "Stormers stars Libbok, Mngomezulu earn Springbok call-ups, veteran Vermeulen absent - News24", "description": "Stormers backline stars Manie Libbok and Sacha Mngomezulu earned their first Springbok call-ups after coach Jacques Nienaber named his squad for the year-end tour to Europe.", "url": "https://www.news24.com/sport/rugby/springboks/stormers-stars-libbok-mngomezulu-earn-springbok-call-ups-no-spot-for-vermeulen-20221028", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7518/33911e735ddc4ba59119d2e86b6ad9f8.jpg", "publishedAt": "2022-10-28T06:32:50Z", "content": "Stormers backline stars Manie Libbok and Sacha Mngomezulu earned their first Springbok call-ups on Friday after coach Jacques Nienaber named his squad for the year-end tour to Europe.\r\nLibbok was pic… [+6384 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "Europa League: Man Utd could face Barcelona, Juventus, Atletico in next round - Daily Post Nigeria", "description": "Manchester United could be set to clash with one of Europe's top clubs in the next round of the Europa League. Erik ten Hag's men qualified for the knockout stages of the competition on Thursday, thanks to a 3-0 win over Sheriff Tiraspol. Diogo Dalot, Marcus …", "url": "https://dailypost.ng/2022/10/28/europa-league-man-utd-could-face-barcelona-juventus-atletico-in-next-round/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/02/Man-Utd.jpg", "publishedAt": "2022-10-28T05:26:15Z", "content": "Manchester United could be set to clash with one of Europe’s top clubs in the next round of the Europa League.\r\nErik ten Hag’s men qualified for the knockout stages of the competition on Thursday, th… [+606 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Don't Need Nuclear Strike On Ukraine,\" Says Putin, Tearing Into US - NDTV", "description": "President Vladimir Putin lashed out at the US and Europe over his war in Ukraine, heaped praise on Saudi Arabia and reiterated support for China's claim to Taiwan.", "url": "https://www.ndtv.com/world-news/dont-need-nuclear-strike-on-ukraine-says-putin-tearing-into-us-3468354", "urlToImage": "https://c.ndtvimg.com/2022-10/l4s8ut48_putin-reuters_625x300_19_October_22.jpg", "publishedAt": "2022-10-28T04:21:00Z", "content": "Vladimir Putin lashed out at the US and Europe over his war in Ukraine. (File)\r\nPresident Vladimir Putin lashed out at the US and Europe over his war in Ukraine, heaped praise on Saudi Arabia and rei… [+4329 chars]"}, {"source": {"id": null, "name": "Drive.com.au"}, "author": null, "title": "Porsche and Lamborghini get stay of execution on Europe's petrol car ban - Drive", "description": "Low-volume carmakers will get an extra year to comply with a European ban on engines, while synthetic fuels will become part of the solution.", "url": "https://www.drive.com.au/news/porsche-lamborghini-get-stay-of-execution-on-europe-engine-ban/", "urlToImage": "https://images.drive.com.au/driveau/image/upload/c_fill,h_720,w_1280/q_auto:eco/f_auto/v1/cms/uploads/reka0m3jr7aeo3dcyuqq", "publishedAt": "2022-10-28T02:15:49Z", "content": "Lamborghini and other manufacturers with new-car registrations of less than 10,000 annually will now have until 2036 to comply with the rules, according to a report by Automotive News Europe, while p… [+107 chars]"}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Currie", "title": "Apple exec confirms iPhones will switch to USB-C because 'we have no choice' - The Register", "description": "Sure you have a choice. You could abandon the European market", "url": "https://www.theregister.com/2022/10/27/apple_usbc/", "urlToImage": "https://regmedia.co.uk/2017/09/01/shutterstock_lightning_apple.jpg", "publishedAt": "2022-10-27T15:15:00Z", "content": "Apple exec Greg \"Joz\" Joswiak has confirmed that the company will follow the European Union's requirement for mobile devices to use USB-C by 2024, which was signed into law on Monday.\r\nFor now, the i… [+4983 chars]"}]}