{"articles": [{"author": null, "content": "<ul><li>Facebook needs prior permission from the Information Regulator to cross-process cellphone numbers harvested from South Africans, that regulator has told the platform.</li><li>Users who have a… [+3472 chars]", "description": "South Africa's Information Regulator has also expressed unhappiness about SA users being treated differently to those in the European Union.", "publishedAt": "2021-03-04T03:31:19Z", "source": {"id": null, "name": "Business Insider South Africa"}, "title": "Facebook can't force SA WhatsApp users to sign over cellphone numbers, Info Regulator says - Business Insider South Africa", "url": "https://www.businessinsider.co.za/facebook-need-special-permission-to-use-cellphone-numbers-it-harvests-from-whatsapp-sas-information-regulator-says-2021-3", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10956/3e3378ea06fb4f0aa088fe3918fbce2d.jpg"}, {"author": "AFP", "content": "Washington on Tuesday imposed penalties in a coordinated action with the European Union as US intelligence concluded that Moscow orchestrated the near fatal poisoning of jailed Kremlin critic Navalny… [+1678 chars]", "description": "Washington on Tuesday imposed penalties in a coordinated action with the European Union as US intelligence concluded that Moscow orchestrated the near fatal poisoning of jailed Kremlin critic Navalny in August.", "publishedAt": "2021-03-03T08:53:56Z", "source": {"id": null, "name": "EWN"}, "title": "Russia says US playing 'with fire' by imposing sanctions - Eyewitness News", "url": "https://ewn.co.za/2021/03/03/russia-says-us-playing-with-fire-by-imposing-sanctions", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/b4i0kogu8pzjnjgtuv0r"}, {"author": "Mike Wehner", "content": "<ul><li>NASA’s Mars 2020 mission arrived at the Red Planet two weeks ago, and we’re just now getting our first look at the landing site from above. </li><li>The ExoMars orbiter, which is a joint proj… [+3304 chars]", "description": "NASA’s Mars 2020 mission arrived at the Red Planet two weeks ago, and we’re just now getting our first look at the landing site from above. The ExoMars orbiter, which is a joint project between the European Space Agency and Russia’s Roscosmos, flew over the J…", "publishedAt": "2021-03-02T04:15:46Z", "source": {"id": null, "name": "BGR"}, "title": "Humans are already dumping garbage on Mars - BGR", "url": "https://bgr.com/2021/03/01/perseverance-rover-mars-landing-site/", "urlToImage": "https://bgr.com/wp-content/uploads/2021/03/BGRpic-Recovered.jpg?quality=70&strip=all"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "europe"}