{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "David Chau", "title": "Markets live: ASX slips ahead of China's data on COVID's economic impact, European markets hit nine-month high - ABC News", "description": "The Australian share market has started start its day lower, European stocks have risen to their highest level since April, and China's latest figures are expected to show the economic impact of mass lockdowns.", "url": "https://www.abc.net.au/news/2023-01-17/asx-markets-business-live-news/101861894", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/32ad9f6bb18cedd086f88e3c452834ac?impolicy=wcms_crop_resize&cropH=900&cropW=1600&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2023-01-16T21:35:59Z", "content": "Good morning! I'll be taking you through all the live markets action from ASX open to close, with some interesting bits of economics and company news along the way.\r\nThe local share market is expecte… [+837 chars]"}, {"source": {"id": null, "name": "Radio Free Europe/ Radio Liberty"}, "author": "RFE/RL's Ukrainian Service", "title": "Fresh Attacks In Ukraine As Western Allies Consider Kyiv's Requests For Heavy Weaponry - Radio Free Europe / Radio Liberty", "description": "Ukrainian forces repelled fresh Russian attacks in the east, the Ukrainian military said on January 16, as Western allies debate whether to send aid such as heavy tanks that Kyiv has requested as it seeks to break through Russian lines.", "url": "https://www.rferl.org/a/ukraine-dnipro-russia-strike-western-training/32225076.html", "urlToImage": "https://gdb.rferl.org/05A0ADC9-C035-42D6-ACFF-74E0D11004D8.jpg", "publishedAt": "2023-01-16T21:01:00Z", "content": "Ukrainian forces repelled fresh Russian attacks in the east, the Ukrainian military said on January 16, as Western allies debate whether to send aid such as heavy tanks that Kyiv has requested as it … [+6789 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Scientists from China, overseas obtain valuable data from Tianwen-1 during Sun outage - Global Times", "description": "Scientists from home and abroad have obtained a large amount of data recently by observing the solar influence on signals between China's first Mars probe Tianwen-1 and that of the European Space Agency (ESA) during a month-long Sun outage, which will help re…", "url": "https://www.globaltimes.cn/page/202301/1283897.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-11-09/5467a756-89bf-4373-b8da-082958aa2124_s.jpeg", "publishedAt": "2023-01-16T14:50:00Z", "content": "Illustration of the Tianwen-1 orbiter in the remote sensing orbit Photo: CASC\r\nScientists from home and abroad have obtained a large amount of data recently by observing the solar influence on signal… [+4021 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Amy Sarkar", "title": "Huawei Europe releases HarmonyOS 3 for Watch 3 series - HC Newsroom", "description": "After an initial HarmonyOS 3 rollout, Huawei Europe released this major software update for Watch 3 series owners, and German models are one of the first to grab it. The tech maker is sending this new firmware to upgrade these LTE-enabled smartwatches and the…", "url": "https://www.huaweicentral.com/huawei-europe-releases-harmonyos-3-for-watch-3-series/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2023/01/huawei-watch-3-europe-hmos-1-1000x576.jpg", "publishedAt": "2023-01-16T06:02:03Z", "content": "Today, Huawei announced HarmonyOS 3 beta testing announcement for Nova 5 Pro. Alongside this, the Chinese tech maker is allowing its first foldable phone, Mate X users to participate in the Beta acti… [+1463 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "channel", "title": "Royals gather for funeral of Greece's last king Constantine - News24", "description": "The funeral of Greece's last king, Constantine II, will take place on Monday with a host of European royalty expected to descend on Athens for the service.", "url": "https://www.news24.com/channel/gossip/royal-news/royals-gather-for-funeral-of-greeces-last-king-constantine-20230116", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/616/9be4aa5f179b473591ce4c50eca94d20.jpg", "publishedAt": "2023-01-16T05:14:53Z", "content": "<ul><li>The entire Spanish royal family, Denmark's Queen Margrethe II and Crown Prince Frederik, Monaco's Prince Albert II and Princess Anne of the British royal family will attend the funeral of Gre… [+4208 chars]"}]}