{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "India TV News"}, "author": "Edited by Vishal Upadhyay", "title": "James Webb space telescope finds water vapor in planet-forming zone: Here's what you need to know - India TV News", "description": "The James Webb Space Telescope is an international collaboration led by NASA, in partnership with the European Space Agency (ESA) and the Canadian Space Agency.", "url": "https://www.indiatvnews.com/science/james-webb-telescope-finds-water-vapor-in-planet-forming-zone-2023-07-26-883066", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2023/07/nasa-james-webb-detects-water-1690343056.jpg", "publishedAt": "2023-07-26T03:57:32Z", "content": "The James Webb Space Telescope, a powerful next-generation space observatory, has made a groundbreaking discovery by detecting water vapor in a planetary system located 370 light-years away. The syst… [+2123 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "The Feed", "title": "Atlantic Ocean current may collapse, claims study. What does this mean for climate, weather in US, Europe? - The Economic Times", "description": "Global warming, driven by human activities, is causing the accelerated melting of Greenland ice. The influx of freshwater from melting ice weakens or disrupts the normal sinking of salty water in the AMOC, potentially leading to its collapse, as per a study.", "url": "https://economictimes.indiatimes.com/news/international/us/atlantic-ocean-current-may-collapse-claims-study-what-does-this-mean-for-climate-weather-in-us-europe/articleshow/102089198.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102116142,width-1070,height-580,imgsize-31832,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-25T18:14:00Z", "content": "Human-induced climate change poses a significant risk to the Atlantic Meridional Overturning Circulation (AMOC), according to a recent study. This critical ocean current system, responsible for redis… [+3802 chars]"}]}