{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Sugam Pokharel, Aya Elamroussi and Saskya Vandoorne, CNN", "title": "EU to recommend reinstating Covid-related travel restrictions on US, reports say - CNN", "description": "The European Union is expected to recommend on Monday that member states reinstate Covid-related travel restrictions and halt nonessential travel from the United States and five other countries, a diplomatic source told CNN on Monday..", "url": "https://www.cnn.com/travel/article/eu-travel-restrictions-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210830020830-02-eu-covid-travel-restrictions-super-tease.jpg", "publishedAt": "2021-08-30T06:14:22Z", "content": "(CNN) The European Union is expected to recommend on Monday that member states reinstate Covid-related travel restrictions and halt nonessential travel from the United States and five other countries… [+2394 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Teachers Should Be Prioritised For Covid Jabs: World Health Organisation - NDTV", "description": "Teachers and school staff should be among the groups prioritised for Covid-19 vaccinations so that schools in Europe and Central Asia can stay open, the World Health Organization (WHO) and Unicef said on Monday.", "url": "https://www.ndtv.com/world-news/coronavirus-world-health-organisation-said-that-teachers-should-be-prioritised-for-coronavirus-vaccination-2523404", "urlToImage": "https://c.ndtvimg.com/2021-06/r6e5kmv8_vaccine-generic-650_625x300_25_June_21.jpeg", "publishedAt": "2021-08-30T06:11:37Z", "content": "Coronavirus: Teachers should prioritised for Covid vaccination, World Health Organisation said. (File)\r\nCopenhagen: Teachers and school staff should be among the groups prioritised for Covid-19 vacci… [+1783 chars]"}, {"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Gerard Lye", "title": "Porsche confirms CKD operations in Malaysia from 2022 - first outside of Europe! - paultan.org - Paul Tan's Automotive News", "description": "Breaking news! Porsche has officially announced that it will set up CKD operations in Malaysia, which will be the first outside of Germany. According to the carmaker, the move is aimed at strengthening its presence …", "url": "https://paultan.org/2021/08/30/porsche-confirms-ckd-operations-in-malaysia-from-2022/", "urlToImage": "https://paultan.org/image/2020/08/SDAP-10th-Anniversary-1-1200x700.jpg", "publishedAt": "2021-08-30T04:56:09Z", "content": "Breaking news! Porsche has officially announced that it will set up CKD operations in Malaysia, which will be the first outside of Germany. According to the carmaker, the move is aimed at strengtheni… [+2420 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "https://www.facebook.com/nkooverjee", "title": "Ford Transit Custom Nugget package revealed for camping enthusiasts - Carmag South Africa", "description": "The Ford Transit Custom Nugget package has been detailed by the American manufacturer’s European arm as an appealing offering to camping enthusiasts. Available in two trims, the camper claims to provide luxurious, high-specification interior, exclusive exteri…", "url": "https://www.carmag.co.za/news/new-models/ford-transit-custom-nugget-package/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/08/Ford-Transit-Custom-Nugget-package-revealed-for-camping-enthusiasts-4.jpg", "publishedAt": "2021-08-30T04:00:34Z", "content": "The Ford Transit Custom Nugget package has been detailed by the American manufacturers European arm as an appealing offering to camping enthusiasts. Available in two trims, the camper claims to provi… [+2243 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Ian Curran", "title": "Man-made 'space junk' is already making it more difficult to explore the final frontier - thejournal.ie", "description": "So what are organisations like the European Space Agency doing about it?", "url": "https://www.thejournal.ie/tgip-space-junk-5532574-Aug2021/", "urlToImage": "https://img2.thejournal.ie/article/5532574/river/?height=400&version=5533702", "publishedAt": "2021-08-28T20:00:00Z", "content": "WHEN AMATEUR IRISH astronomer John Flannery first took an interest in the hobby as a child, space was a much cleaner place than it is in 2021.\r\nThanks to human activity, there are now hundreds of tho… [+9879 chars]"}]}