{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Mark Critchley", "title": "Jack Grealish stars in Man City’s chaotic victory over RB Leipzig - The Independent", "description": "Manchester City 6-3 RB Leipzig: Pep Guardiola’s side started their European campaign in style despite Christopher Nkunku scoring a hat-trick", "url": "https://www.independent.co.uk/sport/football/man-city-leipzig-result-goals-champions-league-b1920979.html", "urlToImage": "https://static.independent.co.uk/2021/09/15/21/newFile-9.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-09-15T21:11:52Z", "content": "As their £100m signing announced himself on the rarefied level of the Champions League, Manchester City demonstrated why many expect them to recover from the disappointment of losing last seasons fin… [+4922 chars]"}, {"source": {"id": null, "name": "Clarepeople.com"}, "author": "cpadmin", "title": "ExoMars mission test rover makes its first deep ground drilling – The Clare People - The Clare People", "description": "The European Space Agency (ESA) and the Russian space agency (Roscosmos) continue to work in partnership on the ExoMars mission, which has another launch scheduled for next year. Now, an important ste", "url": "https://www.clarepeople.com/2426-exomars-mission-test-rover-makes-its-first-deep-ground-drilling/", "urlToImage": "https://www.clarepeople.com/wp-content/uploads/2021/09/2426-exomars-mission-test-rover-makes-its-first-deep-ground-drilling-780x470.png", "publishedAt": "2021-09-15T18:12:47Z", "content": "The European Space Agency (ESA) and the Russian space agency (Roscosmos) continue to work in partnership on the ExoMars mission, which has another launch scheduled for next year. Now, an important st… [+2772 chars]"}, {"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Europe's energy crisis queers the pitch horribly for COP26 - Telegraph.co.uk", "description": "We are living through a fossil fuel shock, but make no mistake: net zero is the solution - not the problem", "url": "https://www.telegraph.co.uk/business/2021/09/15/europes-energy-crisis-queers-pitch-horribly-cop26/", "urlToImage": "https://www.telegraph.co.uk/content/dam/business/2021/09/15/TELEMMGLPICT000260581420_trans_NvBQzQNjv4BqzMzojzwVX9SBGhgJ0n-GXxScrtblwDOyX7sgU0kzxHI.jpeg?impolicy=logo-overlay", "publishedAt": "2021-09-15T18:00:00Z", "content": "The protests are getting louder. Polands premier Mateusz Morawiecki says Europes green deal is out of control and has ordered Polish utilities to itemise the exact cost of EU climate policies in hous… [+2368 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "Barcelona's sad new reality: Bayern Munich prove Catalans can no longer compete with Europe's elite - Goal.com", "description": "Paulo Dybala revealed that he is expecting to resume negotiations with Juventus over a new contract after leading the Italian giants to a comfortable Champions League win on Tuesday.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-09-14T21:03:00Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Concentration of microparticles in lakes reflect nearby human activity and land use: Study suggests microparticle pollution in European lakes higher than previously reported - Science Daily", "description": "A new study suggests that microparticle concentrations in lakes are higher than previously reported, and that human activity and surrounding land use may be a strong predictor of microplastics and anthropogenic fiber pollution.", "url": "https://www.sciencedaily.com/releases/2021/09/210914152523.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-09-14T18:00:00Z", "content": "Predicting where anthropogenic debris accumulates in aquatic ecosystems is necessary for its control and environmental remediation, but plastic and fiber pollution in lakes is not well studied. A stu… [+2517 chars]"}]}