{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "independent", "name": "Independent"}, "author": "Rob Merrick", "title": "Russian oligarchs in London to be hit with tough sanctions even if it hurts UK economy, Liz Truss vows - The Independent", "description": "‘We cannot favour short-term economic interests over the long-term survival of freedom and democracy in Europe’", "url": "https://www.independent.co.uk/news/uk/politics/russia-oligarchs-ukraine-liz-truss-b2003624.html", "urlToImage": "https://static.independent.co.uk/2022/01/30/09/urnpublicidap.org8a448a4231894e26952d7f0266d872d4.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-01-31T02:52:37Z", "content": "Russian oligarchs in London will be hit with tough new sanctions to deter Moscow from invading Ukraine, even if it hurts the UK economy, Liz Truss says.\r\nThe foreign secretary rejected claims that th… [+2618 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Russia can choose negotiations or sanctions, Canada's defence minister says in Ukraine - CBC News", "description": "Defence Minister Anita Anand arrived in a snowy Kyiv on Sunday and echoed the warnings of western allies about the looming threat of an invasion by Russia amid an increasingly frosty international deadlock over the crisis in eastern Europe.", "url": "https://www.cbc.ca/news/politics/anand-ukraine-visit-russia-1.6332841", "urlToImage": "https://i.cbc.ca/1.6332856.1643550139!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/anand-ukraine.JPG", "publishedAt": "2022-01-30T18:57:52Z", "content": "Defence Minister Anita Anand arrived in a snowy Kyiv on Sunday and echoed the warnings of western allies about the looming threat of an invasion by Russia amid an increasingly frosty international de… [+5155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Clear Message To Kremlin\": UK Preps Big Troop Deployment In Europe - NDTV", "description": "Britain is poised to offer NATO a \"major\" deployment of troops, weapons, warships and jets in Europe, Prime Minister Boris Johnson announced Saturday, to respond to rising \"Russian hostility\" towards Ukraine.", "url": "https://www.ndtv.com/world-news/uk-to-offer-nato-major-military-deployment-in-europe-boris-johnson-2737586", "urlToImage": "https://c.ndtvimg.com/2022-01/fu954c9k_uk-troops_625x300_30_January_22.jpg", "publishedAt": "2022-01-30T03:50:00Z", "content": "\"This package would send a clear message to the Kremlin,\" Boris Johnson said.\r\nLondon: Britain is preparing to offer NATO a \"major\" deployment of troops, weapons, warships and jets in Europe, Prime M… [+3072 chars]"}, {"source": {"id": null, "name": "TechCabal"}, "author": "Partner", "title": "Is Infinix rolling out a phone with Dimensity 900 chipset and 5G? - TechCabal", "description": "Since 2013, Infinix has been growing in sales in parts of Europe and Asia, increasing patronage on new releases. Infinix released a premium lineup of Zero X series towards the tail end of last year, sporting MediaTek Helio G chipsets. It appears another model…", "url": "https://techcabal.com/2022/01/29/is-infinix-rolling-out-a-phone-with-dimensity-900-chipset-and-5g/", "urlToImage": "https://lh4.googleusercontent.com/ZWtXL4PD1cJdni1MBBQQDZlT-uVV5iDQJ07wdTuYYTgsf7f2uzRs6fRdt6d2gHOAQ3xVB2KgN8M7Z7hmesDHyly9mycIEgGkGS7kU8nxh4KT8jgQ3L2iXCOF3rlfqPCdjM7W_Nai", "publishedAt": "2022-01-29T10:41:51Z", "content": "Since 2013, Infinix has been growing in sales in parts of Europe and Asia, increasing patronage on new releases. Infinix released a premium lineup of Zero X series towards the tail end of last year, … [+1256 chars]"}]}