{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee", "title": "As Ukraine marks two years since Russia’s invasion, Europe is facing difficult questions - CNN", "description": "As the world prepares to mark the second anniversary of Vladimir Putin’s Ukraine invasion this week, Europe must ask itself some confronting questions about the war that unexpectedly erupted on its borders – and how it will approach the next 12 months.", "url": "https://www.cnn.com/2024/02/22/europe/ukraine-russia-eu-anniversary-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/861e58d3-c04b-4734-b977-0dcbd6927e0e.JPG?c=16x9&q=w_800,c_fill", "publishedAt": "2024-02-22T10:43:00Z", "content": "As the world prepares to mark the second anniversary of Vladimir Putins Ukraine invasion this week, Europe must ask itself some searching questions about the war that unexpectedly erupted on its bord… [+6148 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Bus-sized satellite crashes on Earth after falling from space for 13 years - India Today", "description": "The European Remote Sensing satellite ERS-2 was tasked with providing long-term data on Earths land surfaces ocean temperatures ozone layer and polar ice", "url": "https://www.indiatoday.in/science/story/bus-sized-satellite-crashes-on-earth-after-falling-from-space-for-13-years-2505686-2024-02-22", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202402/ers-2-satellite-crash-225158173-16x9_0.jpg?VersionId=3OgyL16_xMHUr.fQTiooeqXSAHqKSdkm", "publishedAt": "2024-02-22T08:54:55Z", "content": "Europe's ERS-2 satellite crashed and burned over the Pacific Ocean completing a nearly 13-year-long journey since its mission ended above the planet. \r\nThe spacecraft completed its atmospheric reentr… [+2006 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pioneering European ERS-2 satellite falls to Earth over Pacific | BBC News - BBC News", "description": "A European satellite that pioneered many of the technologies used to monitor the planet and its climate has fallen to Earth. The two-tonne ERS-2 spacecraft b...", "url": "https://www.youtube.com/watch?v=CFosVtBaBFU", "urlToImage": "https://i.ytimg.com/vi/CFosVtBaBFU/maxresdefault.jpg", "publishedAt": "2024-02-21T22:50:59Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Neanderthals' usage of complex adhesives reveals higher cognitive abilities, scientists discover - Phys.org", "description": "Neanderthals created stone tools held together by a multi-component adhesive, a team of scientists has discovered. Its findings, which are the earliest evidence of a complex adhesive in Europe, suggest these predecessors to modern humans had a higher level of…", "url": "https://phys.org/news/2024-02-neanderthals-usage-complex-adhesives-reveals.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2024/did-neanderthals-use-g-2.jpg", "publishedAt": "2024-02-21T19:00:01Z", "content": "Neanderthals created stone tools held together by a multi-component adhesive, a team of scientists has discovered. Its findings, which are the earliest evidence of a complex adhesive in Europe, sugge… [+4965 chars]"}]}