{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "Russia-Ukraine War: Nigeria Ready to Step in as Alternative Gas Supplier to Europe, Says Sylva - THISDAY Newspapers", "description": "*NEITI: Export of 85% of Nigeria’s solid minerals to China poses economic riskEmmanuel Addeh in Abuja Following the war between Russia and Ukraine, which is threatening the supply of gas to Europea…", "url": "https://www.thisdaylive.com/index.php/2022/03/27/russia-ukraine-war-nigeria-ready-to-step-in-as-alternative-gas-supplier-to-europe-says-sylva/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/dd7e46a4-timipre-sylva.gif", "publishedAt": "2022-03-27T05:59:59Z", "content": "*NEITI: Export of 85% of Nigerias solid minerals to China poses economic riskEmmanuel Addeh in Abuja\r\nFollowing the war between Russia and Ukraine, which is threatening the supply of gas to European … [+9930 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I'll Be Blunt...\": Ukraine MP After Biden Speech In Neighbouring Poland - NDTV", "description": "A Member of Parliament in Ukraine has criticised US President Joe Biden for not doing enough to help the east European nation counter the Russian invasion, in its second month now.", "url": "https://www.ndtv.com/world-news/ill-be-blunt-says-ukraine-mp-inna-sovsun-after-joe-biden-speech-in-neighbouring-poland-2845646", "urlToImage": "https://c.ndtvimg.com/2022-03/g8v37deo_inna-sovsun_625x300_27_March_22.jpg", "publishedAt": "2022-03-27T04:06:26Z", "content": "Ukraine's MP Inna Sovsun said West should do more to help Ukraine\r\nNew Delhi: A Member of Parliament in Ukraine has criticised US President Joe Biden for not doing enough to help the east European na… [+2279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Kyle Feldscher, CNN", "title": "8 takeaways from Biden's trip to Europe - CNN", "description": "President Joe Biden used a last-minute trip to Europe this week to rally the world's democracies and announce more actions against Russia for its invasion of Ukraine, while also causing a geopolitical stir with one of the final lines from his speech in Poland.", "url": "https://www.cnn.com/2022/03/26/politics/biden-europe-trip-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220326134253-11-biden-poland-0326-super-tease.jpg", "publishedAt": "2022-03-26T22:00:00Z", "content": "(CNN)President Joe Biden used a last-minute trip to Europe this week to rally the world's democracies and announce more actions against Russia for its invasion of Ukraine, while also causing a geopol… [+15859 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Xiaomi confirms Redmi Note 11 Pro+ global launch date as specifications and prices leak - Notebookcheck.net", "description": "The Redmi Note 11 Pro+ is finally leaving China, having been released in Xiaomi's home market last year. The Dimensity 920-powered smartphone will debut later this month with a 108 MP camera and 120 W fast charging. European pricing has leaked too, positionin…", "url": "https://www.notebookcheck.net/Xiaomi-confirms-Redmi-Note-11-Pro-global-launch-date-as-specifications-and-prices-leak.609994.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/EDIT_3_4.jpg", "publishedAt": "2022-03-25T12:22:59Z", "content": "Xiaomi has announced plans to release a new Redmi Note handset globally, billed as 'the most powerful Redmi Note' to date. Currently, Xiaomi has only teased that the 'ultimate is coming' on March 29,… [+982 chars]"}]}