{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "LaLiga: We know Barcelona’s situation – Depay speaks on ‘regretting’ move to Camp Nou - Daily Post Nigeria", "description": "Barcelona forward, Memphis Depay, has insisted he has \"no regrets\" over his move to Camp Nou. Depay said he was delighted to join Barcelona despite the club's recent struggles both domestically and in Europe. The Netherlands international has had a mixed star…", "url": "https://dailypost.ng/2021/10/05/laliga-we-know-barcelonas-situation-depay-speaks-on-regretting-move-to-camp-nou/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/07/Memphis-Depay.jpg", "publishedAt": "2021-10-05T18:43:09Z", "content": "Barcelona forward, Memphis Depay, has insisted he has “no regrets” over his move to Camp Nou.\r\nDepay said he was delighted to join Barcelona despite the club’s recent struggles both domestically and … [+731 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Tereza Pultarova", "title": "Watch the BepiColombo spacecraft zoom past Mercury in this new video - Space.com", "description": "The European and Japanese BepiColombo spacecraft made the closest ever measurements of the magnetic field of Mercury above the planet's southern hemisphere as it zoomed past, snapping epic selfies along the way.", "url": "https://www.space.com/bepicolombo-first-mercury-flyby-video", "urlToImage": "https://cdn.mos.cms.futurecdn.net/5qWbUrr3M8G9ce3inXcymE-1200-80.jpg", "publishedAt": "2021-10-05T11:00:06Z", "content": "The European and Japanese BepiColombo spacecraft made the closest ever measurements of the magnetic field of Mercury above the planet's southern hemisphere as it zoomed past, snapping epic selfies al… [+7749 chars]"}, {"source": {"id": null, "name": "UEFA.com"}, "author": "UEFA.com", "title": "UEFA EURO 2024 - UEFA.com", "description": "UEFA.com is the official site of UEFA, the Union of European Football Associations, and the governing body of football in Europe. UEFA works to promote, protect and develop European football across its 55 member associations and organises some of the world’s …", "url": "https://www.uefa.com/euro-2024/", "urlToImage": "https://img.uefa.com/imgml/uefacom/euro2024/rebrand/og-image.png", "publishedAt": "2021-10-05T10:37:36Z", "content": null}, {"source": {"id": null, "name": "AsiaOne"}, "author": null, "title": "EU regulator backs mRNA vaccine booster for people with weak immunity - AsiaOne", "description": "The European Union's drugs regulator said on Monday (Oct 4) people with weakened immune systems should get a third dose of a Covid-19 vaccine from Pfizer-BioNTech or Moderna, but left it to member states to decide if the wider population should have a booster…", "url": "https://www.asiaone.com/world/eu-regulator-backs-mrna-vaccine-booster-people-weak-immunity", "urlToImage": "https://media.asiaone.com/sites/default/files/styles/a1_600x316/public/original_images/Oct2021/european_reuters.jpg?h=0429cc9e&itok=WyHKyYSa", "publishedAt": "2021-10-05T09:02:27Z", "content": "The European Union's drugs regulator said on Monday (Oct 4) people with weakened immune systems should get a third dose of a Covid-19 vaccine from Pfizer-BioNTech or Moderna, but left it to member st… [+3902 chars]"}]}