{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Heaviest element yet detected in an exoplanet atmosphere - Phys.org", "description": "Using the European Southern Observatory's Very Large Telescope (ESO's VLT), astronomers have discovered the heaviest element ever found in an exoplanet atmosphere—barium. They were surprised to discover barium at high altitudes in the atmospheres of the ultra…", "url": "https://phys.org/news/2022-10-heaviest-element-exoplanet-atmosphere.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/heaviest-element-yet-d.jpg", "publishedAt": "2022-10-13T12:33:02Z", "content": "Using the European Southern Observatory's Very Large Telescope (ESO's VLT), astronomers have discovered the heaviest element ever found in an exoplanet atmospherebarium. They were surprised to discov… [+4061 chars]"}, {"source": {"id": null, "name": "CNBCTV18"}, "author": "CNBCTV18.com", "title": "Russia offers to supply gas to Europe via one intact part of Nord Stream 2 pipeline, Germany says 'nice try' - CNBCTV18", "description": "Vladimir Putin said gas could still be supplied via undamaged parts of the Nord Stream 2 pipeline but it was up to the European Union whether or not it wanted the gas. He said its capacity stands at 27 billion cubic meters a year.", "url": "https://www.cnbctv18.com/energy/russia-putin-gas-supply-europe-nord-stream-2-pipeline-germany-reject-14935701.htm", "urlToImage": "https://images.cnbctv18.com/wp-content/uploads/2022/10/Putin213-1000x573.jpeg", "publishedAt": "2022-10-13T07:41:00Z", "content": "Vladimir Putin said gas could still be supplied via undamaged parts of the Nord Stream 2 pipeline but it was up to the European Union whether or not it wanted the gas. He said its capacity stands at … [+30 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Peter Fabricius", "title": "WAR IN EUROPE: SA abstains on a UN General Assembly resolution condemning Russia…again - Daily Maverick", "description": "South Africa abstained from a United Nations General Assembly resolution condemning Russia for its holding of referendums in four occupied Ukrainian provinces last month before annexing them to Russia.", "url": "https://www.dailymaverick.co.za/article/2022-10-13-sa-abstains-on-a-un-general-assembly-resolution-condemning-russia-again/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/10/h_57986947.jpg?w=1280", "publishedAt": "2022-10-13T05:33:21Z", "content": "Wednesdays United Nations General Assembly vote means South Africa has abstained from every UN General Assembly resolution condemning Russia for its invasion of Ukraine, including one in April when R… [+3430 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "NATO's defence ministers confront Ukraine challenges, desire for air defence systems - CBC News", "description": "NATO defence ministers, including Canada's Anita Anand, met Wednesday as the alliance's member countries face the twin challenges of supplying weapons to Ukraine while shoring up European energy independence.", "url": "https://www.cbc.ca/news/world/ukraine-russian-invasion-war-day-231-1.6613453", "urlToImage": "https://i.cbc.ca/1.6613460.1665563281!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/ukraine-crisis-nuclear-plant.JPG", "publishedAt": "2022-10-12T22:16:55Z", "content": "NATO defence ministers, including Canada's Anita Anand, met Wednesday as the alliance's member countries face the twin challenges of supplying weapons to Ukraine while protecting vital European infra… [+7614 chars]"}]}