{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Defective Gene Slows Down Brain Cells: High-Risk Gene for Developing Autism - SciTechDaily", "description": "Scientists at IST Austria discover how a high-risk gene for developing autism spectrum disorder affects brain development. Within the European Union alone, about three million people are affected by an autism spectrum disorder (ASD). Some are only mildly affe…", "url": "https://scitechdaily.com/defective-gene-slows-down-brain-cells-high-risk-gene-for-developing-autism/", "urlToImage": "https://scitechdaily.com/images/Malformations-Cortex-scaled.jpg", "publishedAt": "2021-05-24T09:00:35Z", "content": "When analyzing the brain of the mice whose Cullin 3-Gen has been partially deactivated, the scientists found malformations of the cortex. Credit: © IST Austria\r\nScientists at IST Austria discover how… [+6003 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Cathrine Gonzales", "title": "DOH: No official communication from EU, Saudi on preferred COVID-19 jab brands - INQUIRER.net", "description": "MANILA, Philippines — There is no official communication from Saudi Arabia and countries from the European Union on their supposed preferred brands of vaccines that should be used on inbound", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/04/2021-04-14T063458Z_2_LYNXMPEH3C1HN_RTROPTP_4_HEALTH-CORONAVIRUS-BRITAIN-VACCINES-REACTION-620x413.jpg", "publishedAt": "2021-05-24T08:26:00Z", "content": "This is a combination of file photos of Sinovac Biotech’s Coronovac and the vaccine developed by China-owned pharmaceutical firm Sinopharm.\r\nMANILA, Philippines There is no official communication fro… [+2732 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Raf Casert", "title": "EU calls for probe after plane diverted to arrest journalist - The Associated Press", "description": "BRUSSELS (AP) — Western leaders decried the diversion of a plane to Belarus in order to arrest an opposition journalist as an act of piracy and terrorism. The European Union and others on Monday demanded an investigation into the dramatic forced landing of th…", "url": "https://apnews.com/a9d32d02caea49c880ed1b7a5872e5f7", "urlToImage": "https://storage.googleapis.com/afs-prod/media/e9c9b534f44f4fb3912f54b8837fbade/3000.jpeg", "publishedAt": "2021-05-24T08:11:55Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Stuart Clark", "title": "Spacewatch: total lunar eclipse and largest supermoon of the year - The Guardian", "description": "Although the full supermoon will be easily seen from Europe and Africa, sadly the eclipse will not be", "url": "https://amp.theguardian.com/science/2021/may/24/spacewatch-total-lunar-eclipse-largest-supermoon-year", "urlToImage": null, "publishedAt": "2021-05-24T05:00:00Z", "content": "SpacewatchAlthough the full supermoon will be easily seen from Europe and Africa, sadly the eclipse will not be\r\nThe moon will be full on 26 May. This will coincide with the largest supermoon of the … [+1381 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Belarus forces airliner to land and arrests opponent, sparking US and European outrage - CNA", "description": "MOSCOW: Belarusian authorities scrambled a fighter jet and flagged what turned out to be a false bomb alert to force a Ryanair plane to land on Sunday (May 23) and then detained an opposition-minded journalist who was on board, drawing condemnation from Europ…", "url": "https://www.channelnewsasia.com/news/world/belarus-force-ryanair-plane-flight-land-arrest-journalist-14870500", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14871362/16x9/991/557/9cc81bda12a6caa3ae1e051618046bf/lC/opposition-blogger-and-activist-roman-protasevich-arrives-for-a-court-hearing-in-minsk-3.jpg", "publishedAt": "2021-05-23T23:37:30Z", "content": "MOSCOW: Belarusian authorities scrambled a fighter jet and flagged what turned out to be a false bomb alert to force a Ryanair plane to land on Sunday (May 23) and then detained an opposition-minded … [+2719 chars]"}]}