{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Playmobil sends ESA astronauts on 'Mars Expedition' with new toy set - Space.com", "description": "Two European Space Agency (ESA) astronauts are set to begin exploring Mars after they land on toy store shelves. Playmobil, in cooperation with ESA, is set to release its new Mars Expedition playset.", "url": "https://www.space.com/esa-playmobil-mars-expedition", "urlToImage": "https://cdn.mos.cms.futurecdn.net/cAL2vkgkv7qzhPWGCWdz8F-1200-80.jpg", "publishedAt": "2021-12-14T23:54:01Z", "content": "Two European Space Agency (ESA) astronauts are set to begin exploring Mars after they land on toy store shelves later this week.\r\nPlaymobil, in cooperation with ESA, is set to release its \"Mars Exped… [+3730 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "WHO sees unprecedented Omicron spread; Pfizer says vaccine pill effective - Japan Today", "description": "The World Health Organization Tuesday warned Omicron was spreading at an unprecedented rate and urged countries to act as drug maker Pfizer said its coronavirus pill was effective against the variant. Dutch primary schools will close early as Europe battles a…", "url": "https://japantoday.com/category/world/who-sees-unprecedented-omicron-spread-'probably'-in-most-countries", "urlToImage": null, "publishedAt": "2021-12-14T21:05:00Z", "content": "The World Health Organization Tuesday warned Omicron was spreading at an unprecedented rate and urged countries to act as drug maker Pfizer said its coronavirus pill was effective against the variant… [+4502 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Jonathan Chadwick", "title": "Milky Way: Astronomers capture the deepest and sharpest images to date of our galaxy's black hole - Daily Mail", "description": "Stunning new images released by the European Southern Observatory (ESO), show several stars moving around their orbit of the Milky Way's black hole, called Sagittarius A*.", "url": "https://www.dailymail.co.uk/sciencetech/article-10307961/Milky-Way-Astronomers-capture-deepest-sharpest-images-date-galaxys-black-hole.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/12/14/13/51775191-0-image-a-4_1639490206540.jpg", "publishedAt": "2021-12-14T15:00:46Z", "content": "Astronomers have revealed the 'deepest and sharpest images to date' of the region around our Milky Way galaxy's supermassive black hole.\r\nThe stunning new images, captured at various times earlier th… [+8292 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Alex Alderson", "title": "Xiaomi Watch S1 to launch within the next few months, launches scheduled in Europe and Asia Pacific countries - Notebookcheck.net", "description": "Reportedly, Xiaomi has settled on releasing the Watch S1 before April 2022. The smartwatch does away with Xiaomi's 'Mi' branding and will be available across Europe and Asia Pacific countries.", "url": "https://www.notebookcheck.net/Xiaomi-Watch-S1-to-launch-within-the-next-few-months-launches-scheduled-in-Europe-and-Asia-Pacific-countries.584939.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/Xiaomi_Mi_Watch.jpeg", "publishedAt": "2021-12-13T21:34:25Z", "content": "Last month, @stufflistings and Digital Chat Station revealed that Xiaomi had certified the Watch S, a new brand for the company. Now, 91mobiles and the same leaker state that Xiaomi is preparing to r… [+992 chars]"}]}