{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Sophia Saifi,Rhea Mogul,Lizzy Yee", "title": "Hundreds of Pakistanis dead in Mediterranean migrant boat disaster, official says - CNN", "description": "More than 300 Pakistani nationals have been killed in the sinking of a overcrowded fishing trawler off the coast of Greece, the latest tragedy to expose the refugee crisis confronting the European Union as tens of thousands seek sanctuary from war, persecutio…", "url": "https://www.cnn.com/2023/06/18/asia/pakistan-deaths-migrant-boat-disaster-greece-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230615092817-boat-greece.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-06-19T04:57:15Z", "content": "More than 300 Pakistani nationals have been killed in the sinking of a overcrowded fishing trawler off the coast of Greece, the latest tragedy to expose the refugee crisis confronting the European Un… [+4292 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "ANIKET DIXIT", "title": "Lunar Inflation: European Scientists Set to Launch Moon-Bound Inflatable Radio Telescope - News Track English", "description": "USA: An inflatable radio telescope for the Moon is what European scientists want to send there. The idea was developed following a recent feasibility study by the European Space Agency (ESA). The first few hundred million years after the Big Bang, when the fi…", "url": "https://english.newstracklive.com/news/lunar-inflation-european-scientists-set-to-launch-moonbound-inflatable-radio-telescope-sc71-nu355-ta355-1280881-1.html", "urlToImage": "https://media.newstrack.in/uploads/technology-news/technology-news/Jun/17/big_thumb/Screenshot-2023-06-17-152431_648d82e90a1d1.png", "publishedAt": "2023-06-17T10:11:17Z", "content": "USA: An inflatable radio telescope for the Moon is what European scientists want to send there. The idea was developed following a recent feasibility study by the European Space Agency (ESA). The fir… [+3055 chars]"}]}