{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Supermassive black hole caught hiding in a ring of cosmic dust - Phys.org", "description": "The European Southern Observatory's Very Large Telescope Interferometer (ESO's VLTI) has observed a cloud of cosmic dust at the center of the galaxy Messier 77 that is hiding a supermassive black hole. The findings have confirmed predictions made around 30 ye…", "url": "https://phys.org/news/2022-02-supermassive-black-hole-caught-cosmic.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/supermassive-black-hol.jpg", "publishedAt": "2022-02-16T16:17:37Z", "content": "The European Southern Observatory's Very Large Telescope Interferometer (ESO's VLTI) has observed a cloud of cosmic dust at the center of the galaxy Messier 77 that is hiding a supermassive black hol… [+7038 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Supermassive Black Hole Caught Hiding in an Immense Ring of Cosmic Dust - SciTechDaily", "description": "The European Southern Observatory’s Very Large Telescope Interferometer (ESO’s VLTI) has observed a cloud of cosmic dust at the center of the galaxy Messier 77 that is hiding a supermassive black hole. The findings have confirmed predictions made around 30 ye…", "url": "https://scitechdaily.com/supermassive-black-hole-caught-hiding-in-an-immense-ring-of-cosmic-dust/", "urlToImage": "https://scitechdaily.com/images/Active-Galactic-Nucleus-of-Messier-77.gif", "publishedAt": "2022-02-16T16:00:21Z", "content": "This illustration shows what the core of Messier 77 might look like. As other active galactic nuclei, the central region of Messier 77 is powered by a black hole that is surrounded by a thin accretio… [+12635 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "Buhari Departs Abuja for EU-AU Summit in Belgium - THISDAY Newspapers", "description": "•To discuss security, economic issues with other world leaders Deji Elumoye President Muhammadu Buhari departed Abuja yesterday to join European and other African leaders as well as heads of multil…", "url": "https://www.thisdaylive.com/index.php/2022/02/16/buhari-departs-abuja-for-eu-au-summit-in-belgium/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2018/09/72458c50-buhari-departs-for-london.jpg", "publishedAt": "2022-02-16T03:40:45Z", "content": "To discuss security, economic issues with other world leaders\r\nDeji Elumoye\r\nPresident Muhammadu Buhari departed Abuja yesterday to join European and other African leaders as well as heads of multila… [+1444 chars]"}]}