{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "TheJournal.ie"}, "author": "Hayley Halpin", "title": "EU reaches deal on digital health pass, paving way for summer travel in Europe - thejournal.ie", "description": "The deal will allow for anybody living in the EU’s 27 countries to secure a digital health pass by the end of June.", "url": "https://www.thejournal.ie/eu-covid-travel-certificate-5443377-May2021/", "urlToImage": "https://img2.thejournal.ie/article/5443377/river/?height=400&version=5443380", "publishedAt": "2021-05-20T21:33:00Z", "content": "THE EUROPEAN PARLIAMENT and EU member states have reached a deal paving the way for a Covid-19 certificate that will help open up travel in Europe for the key summer season.\r\nWe have white smoke, twe… [+4611 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Football: England's Champions League race goes down to the wire - CNA", "description": "The battle for the final two Champions League qualification spots goes down to the wire on Sunday with Chelsea, Liverpool and Leicester City all vying for a place in Europe's elite competition.", "url": "https://www.channelnewsasia.com/news/sport/football-england-s-champions-league-race-goes-down-to-the-wire-14851754", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14851748/16x9/991/557/682836c826c7f17e8e98486c52ad8d8c/IT/file-photo--premier-league---burnley-v-liverpool-1.jpg", "publishedAt": "2021-05-20T19:53:06Z", "content": "MANCHESTER, England: The battle for the final two Champions League qualification spots goes down to the wire on Sunday with Chelsea, Liverpool and Leicester City all vying for a place in Europe's eli… [+1777 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Chris Davies", "title": "ESA pushes ahead on Starlink-GPS style hybrid network for the Moon - SlashGear", "description": "An incredible network of lunar satellites, ringing the Moon and powering a telecoms and navigation system there, is another step closer to reality, the European Space Agency has announced today. Th…", "url": "https://www.slashgear.com/esa-pushes-ahead-on-starlink-gps-style-hybrid-network-for-the-moon-20673779/", "urlToImage": "https://cdn.slashgear.com/wp-content/uploads/2021/05/A_constellation_of_satellites_around_the_Moon.jpg", "publishedAt": "2021-05-20T19:46:00Z", "content": "An incredible network of lunar satellites, ringing the Moon and powering a telecoms and navigation system there, is another step closer to reality, the European Space Agency has announced today. The … [+3385 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Scientists in Asia resumed work far quicker than western counterparts, international COVID lockdown - EurekAlert", "description": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international survey suggest.", "url": "https://www.eurekalert.org/pub_releases/2021-05/tfg-sia052021.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-05-20T14:48:55Z", "content": "Researchers in China, Japan, and Singapore were able to resume research much quicker than their counterparts in the US and Europe after the first covid lockdowns, results of a new international surve… [+4043 chars]"}]}