{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": null, "title": "RAF flies first air defence mission over Poland after Russian drone incursion - BBC", "description": "Tensions have risen across Europe after 19 drones entered Polish territory earlier this month.", "url": "https://www.bbc.com/news/articles/c4g7752w1ygo", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/ba90/live/433566b0-963d-11f0-9ed9-693309fd1b9f.jpg", "publishedAt": "2025-09-20T21:00:49Z", "content": "An RAF Typhoon during the first Nato deployment over Poland after 19 drones were detected in Polish airspace last week\r\nBritish fighter jets have conducted a Nato air defence mission over Poland as p… [+1891 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "PAN PYLAS Associated Press, JAMEY KEATEN Associated Press", "title": "Cyberattack disrupts check-in systems at major European airports - ABC News - Breaking News, Latest News and Videos", "description": "A cyberattack targeting check-in and boarding systems has disrupted air traffic at several major European airports", "url": "https://abcnews.go.com/International/wireStory/cyberattack-disrupts-check-systems-major-european-airports-125760897", "urlToImage": "https://i.abcnewsfe.com/a/c25918c5-f51c-401e-a422-0c4f0b11c828/wirestory_29b6d890baf7ac3a22f0f2b2f169b890_16x9.jpg?w=1600", "publishedAt": "2025-09-20T16:30:00Z", "content": "LONDON -- A cyberattack targeting check-in and boarding systems disrupted air traffic and caused delays at several of Europes major airports on Saturday. \r\nWhile the impact on travelers appeared to b… [+4642 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "The Associated Press", "title": "D4vd tour dates removed from websites after the discovery of a girl’s body in Los Angeles - CNN", "description": "The last two remaining dates in singer d4vd’s US tour and multiple stops in his upcoming European tour have been removed from ticketing websites, as authorities continue to investigate the discovery of the decomposed body of a teenage girl in Los Angeles.", "url": "https://www.cnn.com/2025/09/20/entertainment/d4vd-tour-removed-discovery-girls-body", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2210941206.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-09-20T16:10:19Z", "content": "The last two remaining dates in singer d4vds US tour and multiple stops in his upcoming European tour have been removed from ticketing websites, as authorities continue to investigate the discovery o… [+2436 chars]"}]}