{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Standing Tall: Massive Moon Rocket Milestone for Artemis - SciTechDaily", "description": "The rocket that will launch NASA’s Orion spacecraft with the European Service Module to the Moon has been moved to the launchpad in Florida, USA, for its first full test before the Artemis I launch later this year. The Space Launch Systems rocket (SLS), with …", "url": "https://scitechdaily.com/standing-tall-massive-moon-rocket-milestone-for-artemis/", "urlToImage": "https://scitechdaily.com/images/Logos-on-Artemis-I-Moon-Rocket.jpg", "publishedAt": "2022-03-20T19:20:40Z", "content": "The rocket that will launch NASA’s Orion spacecraft to the Moon with the European Service Module on the eve of rollout to the launchpad. The rocket has been moved to the launchpad in Florida, USA, fo… [+4759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "‘Bloc-based division’ in Indo-Pacific as dangerous as NATO’s eastward expansion in Europe: Top Chinese official Le Yucheng - The Indian Express", "description": "“The Ukraine crisis provides a mirror for us to observe the situation in the Asia-Pacific. We cannot but ask, how can we prevent a crisis like this from happening in the Asia-Pacific?” Chinese Vice Foreign Minister Le Yucheng said on Saturday.", "url": "https://indianexpress.com/article/world/indo-pacific-bloc-division-nato-eastward-expansion-le-yucheng-7828593/", "urlToImage": "https://images.indianexpress.com/2022/03/Le-Yucheng-1200.jpg", "publishedAt": "2022-03-20T19:12:31Z", "content": "In a clear reference to groupings like the Quad, a top Chinese foreign ministry official has drawn parallels between the NATO strategy of eastward expansion in Europe and the creation of small blocs … [+3374 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Jennifer Bray", "title": "Ireland in midst of second Omicron wave but no return of restrictions - Varadkar - The Irish Times", "description": "Tánaiste says what is happening across Europe now ‘is a second wave of Omicron’", "url": "https://www.irishtimes.com/news/politics/ireland-in-midst-of-second-omicron-wave-but-no-return-of-restrictions-varadkar-1.4831687", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4831686&origw=1440", "publishedAt": "2022-03-20T18:05:00Z", "content": "Ireland is in the midst of another Covid-19 wave but restrictions will not be reimposed, Tánaiste Leo Varadkar has said. \r\nThe Fine Gael leader also said that an inquiry into the handling of the pand… [+3840 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "MinDA pitches agri logistics projects to European investors - BusinessWorld Online", "description": "LOGISTICS and transport connectivity projects that will strengthen the agriculture sector are among the biggest investment opportunities in the southern Philippines, the Mindanao Development Authority (MiNDA) told European businesses at a forum on Friday.", "url": "https://www.bworldonline.com/minda-pitches-agri-logistics-projects-to-european-investors/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/03/Minda-logo.jpg", "publishedAt": "2022-03-20T16:02:37Z", "content": "By Marifi S. Jara, Mindanao Bureau Chief\r\nLOGISTICS and transport connectivity projects that will strengthen the agriculture sector are among the biggest investment opportunities in the southern Phil… [+3306 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Women less likely to receive lifesaving intervention for cardiogenic shock than men - News-Medical.Net", "description": "Women are less likely to receive lifesaving treatment for cardiogenic shock than men, according to research presented today at ESC Acute CardioVascular Care 2022, a scientific congress of the European Society of Cardiology.", "url": "https://www.news-medical.net/news/20220319/Women-less-likely-to-receive-lifesaving-intervention-for-cardiogenic-shock-than-men.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-03-20T00:23:00Z", "content": "Women are less likely to receive lifesaving treatment for cardiogenic shock than men, according to research presented today at ESC Acute CardioVascular Care 2022, a scientific congress of the Europea… [+4083 chars]"}, {"source": {"id": null, "name": "TODAYonline"}, "author": null, "title": "The Big Read: Stagflation nightmare — will prices keep rising even as a European war puts damper on economy? - TODAY", "description": "SINGAPORE —  About two to three weeks ago, Mr Kevin Soh noticed that milk powder for his two young children had become S$4 more expensive per tin.", "url": "https://www.todayonline.com/big-read/big-read-stagflation-nightmare-will-prices-keep-rising-even-european-war-puts-damper-economy-1849221", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--_f2_SEj4--/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/tdy/image/2022/03/18/20220318_am_br-stagflation.jpg?itok=Xmer5lzP", "publishedAt": "2022-03-19T00:00:00Z", "content": "With the Russia-Ukraine conflict threatening to reshape the international economic landscape, professional investors around the world are growing increasingly worried about the outlook for global gro… [+3812 chars]"}, {"source": {"id": null, "name": "POPSUGAR"}, "author": null, "title": "Here's Who Needs a Fourth COVID Vaccine and When to Get It - msnNOW", "description": "If you've already received two doses of a Moderna or Pfizer COVID vaccine, plus a booster, you may be wondering if you'll need to get a fourth shot - especially in light of the recent news of rising case counts in Europe.", "url": "https://www.popsugar.com/fitness/will-i-need-fourth-covid-vaccine-48747329?utm_source=msn&amp;utm_medium=partner&amp;utm_campaign=feed", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAVfuwf.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=487&y=366", "publishedAt": "2022-03-18T22:06:41Z", "content": "If you've already received two doses of a Moderna or Pfizer COVID vaccine, plus a booster, you may be wondering if you'll need to get a fourth shot - especially in light of the recent news of rising … [+4147 chars]"}]}