{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "KCRA Sacramento"}, "author": "Lysée Mitri", "title": "Rocklin church hands out COVID-19 vaccine exemption letters - KCRA Sacramento", "description": "\"You have the freedom to choose, and nobody should be able to mandate that you have to take a vaccine or you lose your job. That's just not right, here in America.\"", "url": "https://www.kcra.com/article/rocklin-church-covid-vaccine-exemption-letters/37312345", "urlToImage": "https://kubrick.htvapps.com/vidthumb/6f2ec3cd-c33b-46d1-8b08-6323209d4826/6f2ec3cd-c33b-46d1-8b08-6323209d4826_image.jpg?crop=0.755xw:0.756xh;0.0490xw,0&resize=1200:*", "publishedAt": "2021-08-16T01:51:00Z", "content": "ROCKLIN, Calif. — A Rocklin church handed out hundreds of exemption letters Sunday for people who do not want to take the COVID-19 vaccine. This followed recent announcements from several employers i… [+2622 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gillian Brockell", "title": "The fall of Saigon: As Taliban seizes Kabul, the Vietnam War's final days remembered - The Washington Post", "description": "In 1975, Saigon fell to the North Vietnamese faster than expected, leading to chaos and  to the largest helicopter airlift ever attempted to rescue hundreds of Americans and South Vietnamese, who scaled the embassy's walls.", "url": "https://www.washingtonpost.com/history/2021/08/15/saigon-fall-kabul-taliban/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZ54FPH5CEI6XEI4KJF4RNUPC4.jpg&w=1440", "publishedAt": "2021-08-15T21:14:30Z", "content": "Thats what Ford faced on the evening of April 28, 1975, and it is history repeating itself now. After 20 years of U.S. involvement, the Taliban entered the Afghan capital, Kabul, on Sunday morning, a… [+4885 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Mandy Sims", "title": "Boeing Starliner returns to the factory instead of taking off to space - Awani Review", "description": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it's not about to end. The second", "url": "https://www.awanireview.com/boeing-starliner-returns-to-the-factory-instead-of-taking-off-to-space/", "urlToImage": null, "publishedAt": "2021-08-15T18:33:27Z", "content": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it’s not about to end. The second unmanned test flight of its Starliner space cap… [+2719 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "John Whittle", "title": "Ford GT Heritage Edition debuts at Monterey signalling end of production - Carmag South Africa", "description": "A modern interpretation of the original, the Ford GT Heritage Edition pays homage to the 1964 Ford GT prototypes that led to America’s only Le Mans-winning supercar, a Le Mans champion from 1966 to 1969, and again in 2016.", "url": "https://www.carmag.co.za/news/new-models/ford-gt-heritage-edition/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/08/2022FordGT’64HeritageEditionand1964FordGTprototype_02.jpg", "publishedAt": "2021-08-15T09:24:50Z", "content": "A modern interpretation of the original, the Ford GT Heritage Edition pays homage to the 1964 Ford GT prototypes that led to Americas only Le Mans-winning supercar, a Le Mans champion from 1966 to 19… [+2348 chars]"}]}