{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Here comes the sun: Senate agrees on permanent daylight saving time - POLITICO", "description": "It's unclear whether the House will act to end America's fall-back, spring-forward clock-moving. But for the moment, senators basked in their agreement.", "url": "https://www.politico.com/news/2022/03/15/here-comes-the-sun-senate-moves-to-make-daylight-savings-time-permanent-00017451", "urlToImage": "https://static.politico.com/e0/32/169cbb5c469bab409647c12a3036/https-delivery.gettyimages.com/downloads/1231345172", "publishedAt": "2022-03-15T22:12:17Z", "content": "If we can get this passed, we dont have to keep doing this stupidity anymore, Rubio said. Why we would enshrine this in our laws and keep it for so long is beyond me.\r\nAs he made his request, Sen. Ky… [+3384 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Frances Mangosing", "title": "Chinese ship ‘spied on PH-US war games’ - INQUIRER.net", "description": "MANILA, Philippines — A Chinese navy vessel was spying on Filipino-American war games off Palawan province last month, according to senior military officers, and the Department of Foreign", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/06/west-ph-sea-map-06162021-1-620x324.jpg", "publishedAt": "2022-03-15T21:48:00Z", "content": "The presence of a Chinese PLA reconnaisance ship was recorded while Philippine and US Marines were holding Marine Exercise 2022 (MAREX 22) off Palawan. (INQUIRER MAP)\r\nMANILA, Philippines A Chinese n… [+4425 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Adam B. Vary", "title": "‘Ms. Marvel’ Trailer Introduces Marvel Studios’ First Muslim Superhero in Disney Plus Series - Variety", "description": "In 2013, Marvel Comics introduced Kamala Khan, a Pakistani American teenager from New Jersey who idolizes Carol Danvers, aka Captain Marvel. By 2014, Kamala had superhuman abilities, her own solo series and her own superhero moniker — Ms. Marvel — making her …", "url": "https://variety.com/2022/tv/news/ms-marvel-trailer-disney-plus-1235205029/", "urlToImage": "https://variety.com/wp-content/uploads/2022/03/ms-marvel.jpg?w=1024", "publishedAt": "2022-03-15T14:35:03Z", "content": "In 2013, Marvel Comics introduced Kamala Khan, a Pakistani American teenager from New Jersey who idolizes Carol Danvers, aka Captain Marvel. By 2014, Kamala had superhuman abilities, her own solo ser… [+2167 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lisa Steyn", "title": "'We'll defend ourselves', says Anglo as Zambian lead poisoning class action intensifies - News24", "description": "Further expert evidence has been filed with the Johannesburg High Court as communities poisoned by lead in the Kabwe district of Zambia seek to bring a class action against Anglo American.", "url": "https://www.news24.com/fin24/companies/mining/well-defend-ourselves-says-anglo-as-zambian-lead-poisoning-class-action-intensifies-20220315", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3756/f1dd49cc47814122acd604ab92975916.jpg", "publishedAt": "2022-03-15T13:19:41Z", "content": "<ul><li>Human rights lawyers have submitted further expert evidence to support their claims against Anglo American.</li><li>The diversified miner stands accused of causing lead poisoning in the Kabwe… [+7708 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Watch Live: Indian-American astronaut Raja Chari conducting spacewalk to upgrade solar panels on I.S.S - Times Now", "description": "During the 6.5hr long spacewalk, Astronauts Kayla Barron and Raja Chari, who are the part of the crew of Expedition 66, will assemble and install modification kits required for upcoming solar array upgrades.", "url": "https://www.timesnownews.com/technology-science/watch-live-indian-american-astronaut-raja-chari-conducting-spacewalk-to-upgrade-solar-panels-article-90227060", "urlToImage": "https://static.tnn.in/thumb/msid-90227060,imgsize-100,width-1280,height-720,resizemode-75/90227060.jpg", "publishedAt": "2022-03-15T13:17:00Z", "content": "Aishwarya Rai, Abhishek and Aaradhya look happy in red at Tina Ambani's son Anmol Ambani's wedding, see pics"}, {"source": {"id": null, "name": "GamesIndustry.biz"}, "author": "James Batchelor", "title": "New publisher Deepwell focuses on therapeutic games - GamesIndustry.biz", "description": "Firm led by Devolver found Mike Wilson, advisory board includes Lorne Lanning, American McGee, Rami Ismail, Zoe Flower and more", "url": "https://www.gamesindustry.biz/articles/2022-03-15-new-publisher-deepwell-focuses-on-therapeutic-games", "urlToImage": "https://images.gnwcdn.com/2022/articles/2022-03-15-12-18/deepwell.jpg", "publishedAt": "2022-03-15T12:23:07Z", "content": "Share this article\r\nA new developer and publisher has been formed by industry luminaries that will concentrate on the therapeutic power of video games.\r\nDeepWell Digital Therapeutics is the brainchil… [+1610 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Lee Khang Yi", "title": "A first for Malaysia: Bukit Jalil’s Eat and Cook honoured by Asia’s 50 Best Restaurants with the 2022 American Express One To Watch Award - Malay Mail", "description": "KUALA LUMPUR, March 15 — Restaurant Eat and Cook has been selected by the organisers of Asia’s 50 Best Restaurants to receive the much coveted American Express One To Watch Award. A first for a Malaysian restaurant, this award recognises Eat and Cook as a ris…", "url": "https://www.malaymail.com/news/malaysia/2022/03/15/a-first-for-malaysia-bukit-jalils-eat-and-cook-honoured-by-asias-50-best-re/2047590", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-03/eat_and_cook_20220315_3-seo.jpg", "publishedAt": "2022-03-15T10:06:45Z", "content": "Diners at Eat and Cook can experience omakase with local tongues in an island kitchen setting. Picture courtesy of Asias 50 Best Restaurants\r\nKUALA LUMPUR, March 15 Restaurant Eat and Cook has been s… [+3490 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "China says it wants to avoid US sanctions over Russia's war - The Star Online", "description": "BEIJING (Bloomberg): China wants to avoid being impacted by US sanctions over Russia’s war, Foreign Minister Wang Yi said, in one of Beijing’s most explicit statements yet on American penalties that are contributing to a historic market selloff.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/03/15/china-says-it-wants-to-avoid-us-sanctions-over-russia039s-war", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/15/1515134.jpg", "publishedAt": "2022-03-15T05:42:00Z", "content": "BEIJING (Bloomberg): China wants to avoid being impacted by US sanctions over Russias war, Foreign Minister Wang Yi said, in one of Beijings most explicit statements yet on American penalties that ar… [+4270 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Connor Boyd", "title": "Why 10,000 steps a day is NOT holy grail: Study finds 6,000-8,000 cuts risk of early death in HALF - Daily Mail", "description": "American researchers reviewed findings from 15 studies which looked at the effect of daily steps on mortality from all causes for nearly 50,000 people in four continents.", "url": "https://www.dailymail.co.uk/health/article-10603643/Why-10-000-steps-day-NOT-holy-grail-Study-finds-6-000-8-000-cuts-risk-early-death-HALF.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/14/09/55327567-0-image-a-6_1647249432235.jpg", "publishedAt": "2022-03-14T09:17:54Z", "content": "Ten thousand daily steps is not the sweet spot for health, according to a study that suggests just 6,000 is enough.\r\nAmerican researchers have found that getting between 6,000 and 8,000 steps each da… [+4764 chars]"}]}