{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Monkeypox outbreak: Drugmaker SIGA says EU authorities seeking to stockpile its smallpox antiviral - euronews", "description": "Shares in companies that make antiviral drugs to fight smallpox and related viruses have soared as monkeypox cases multiply in Europe and North America.READ ...", "url": "https://www.youtube.com/watch?v=lU9Ab0_XJEg", "urlToImage": "https://i.ytimg.com/vi/lU9Ab0_XJEg/hqdefault.jpg", "publishedAt": "2022-05-20T18:27:45Z", "content": null}, {"source": {"id": null, "name": "Alarabiya.net"}, "author": "Al Arabiya English", "title": "Explainer: What is monkeypox and where is it spreading? - Al Arabiya English", "description": "European and American health authorities have identified a number of monkeypox cases in recent days, mostly in young men. It’s a surprising outbreak of a d", "url": "https://english.alarabiya.net/features/2022/05/20/Explainer-What-is-monkeypox-and-where-is-it-spreading-", "urlToImage": "https://vid.alarabiya.net/images/2022/05/20/6aca765a-9634-48d0-9e95-7a0ec175af2e/6aca765a-9634-48d0-9e95-7a0ec175af2e_16x9_600x338.JPG", "publishedAt": "2022-05-20T12:21:00Z", "content": "European and American health authorities have identified a number of monkeypox cases in recent days, mostly in young men. Its a surprising outbreak of a disease that rarely appears outside Africa.\r\nH… [+4268 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "What Is Monkeypox, Where Is It Spreading? - VOA Learning English", "description": "European and American health officials have identified several cases of monkeypox recently, mostly in young men. The cases reported in Europe and the United States are raising concern because the disease has rarely appeared outside of Africa.", "url": "https://learningenglish.voanews.com/a/what-is-monkeypox-where-is-it-spreading-/6581141.html", "urlToImage": "https://gdb.voanews.com/03190000-0aff-0242-58f1-08da39d26b31_w1200_r1.jpg", "publishedAt": "2022-05-20T12:15:21Z", "content": "European and American health officials have identified several cases of monkeypox recently, mostly in young men.\r\nThe cases reported in Europe and the United States are raising concern because the di… [+4473 chars]"}]}