{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA Taps Axiom Space for First Artemis Moonwalking Spacesuits - Pragativadi", "description": "NASA has selected Axiom Space to deliver a moonwalking system for the Artemis III mission, which will land Americans on the surface of the Moon for the first time in over 50 years. This award – the first one under a competitive spacesuits contract –", "url": "https://pragativadi.com/nasa-taps-axiom-space-for-first-artemis-moonwalking-spacesuits/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2022/09/Untitled-design-49.png", "publishedAt": "2022-09-08T17:27:44Z", "content": "NASA has selected Axiom Space to deliver a moonwalking system for the Artemis III mission, which will land Americans on the surface of the Moon for the first time in over 50 years. This award the fir… [+2837 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "France 24", "title": "Spielberg off to Toronto as film festival hails LGBTQ 'breakthrough year' - FRANCE 24 English", "description": "Steven Spielberg will lead a host of Hollywood A-listers across the border to Toronto this week for North America's biggest film festival, which organizers say will celebrate a breakthrough year for LGBTQ cinema.", "url": "https://www.france24.com/en/live-news/20220908-spielberg-off-to-toronto-as-film-festival-hails-lgbtq-breakthrough-year", "urlToImage": "https://s.france24.com/media/display/fc45d2b8-0eb7-11ed-84e4-005056bfa79e/w:1280/p:16x9/3e7585eed0df44355cc0e64417f42dfaec2b15c4.jpg", "publishedAt": "2022-09-08T02:50:16Z", "content": "Toronto (Canada) (AFP) Steven Spielberg will lead a host of Hollywood A-listers across the border to Toronto this week for North America's biggest film festival, which organizers say will celebrate a… [+3932 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Concerns over emerging, re-emerging infectious diseases | The Guardian Nigeria News - Nigeria and World News — Features - Guardian Nigeria", "description": "•Scientific strategies from recent outbreaks to help prepare for Pathogen X There are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in China, West Nile Virus in America, Marburg virus in Ghana, Ebo…", "url": "https://guardian.ng/features/science/concerns-over-emerging-re-emerging-infectious-diseases/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/09/AMSN.jpg", "publishedAt": "2022-09-08T02:22:00Z", "content": "Scientific strategies from recent outbreaks to help prepare for Pathogen X\r\nThere are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in Ch… [+21425 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published ahead of print in August - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; Atlantic Canada; the New Caledonian arc; the Farallon plate; and the Hikurangi sub…", "url": "https://www.eurekalert.org/news-releases/963881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-06T20:07:38Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; A… [+38402 chars]"}]}