{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "Biden hints at risky policy shift on Taiwan independence - Malay Mail", "description": "WASHINGTON, Sept 20 ― Overshadowed by US President Joe Biden's headline-grabbing vow that American forces would defend Taiwan against a Chinese attack was his hint at...", "url": "https://www.malaymail.com/news/world/2022/09/20/biden-hints-at-risky-policy-shift-on-taiwan-independence/29082", "urlToImage": "https://www.malaymail.com/malaymail/uploads/images/2022/09/20/51530.JPG", "publishedAt": "2022-09-19T23:42:24Z", "content": "WASHINGTON, Sept 20 Overshadowed by US President Joe Biden's headline-grabbing vow that American forces would defend Taiwan against a Chinese attack was his hint at possibly shifting US policy to sup… [+3706 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Elliot Spagat", "title": "US officials: Border crossings soar among Venezuelans - The Associated Press", "description": "SAN DIEGO (AP) — The number of Venezuelans taken into custody at the U.S. border with Mexico soared in August, while fewer migrants from Mexico and some Central American countries were stopped, officials said Monday.", "url": "https://apnews.com/3b99effa20c693515d2ef9047a9c5d95", "urlToImage": "https://storage.googleapis.com/afs-prod/media/a4e4a0a3d2be464dac1d8910b2e0b6c4/3000.jpeg", "publishedAt": "2022-09-19T22:30:00Z", "content": "SAN DIEGO (AP) The number of Venezuelans taken into custody at the U.S. border with Mexico soared in August, while fewer migrants from Mexico and some Central American countries were stopped, officia… [+4377 chars]"}, {"source": {"id": null, "name": "Ajpmonline.org"}, "author": null, "title": "Trends in U.S. Depression Prevalence From 2015 to 2020: The Widening Treatment Gap - American Journal of Preventive Medicine", "description": "Major depression is a common and potentially lethal condition. Early data suggest\nthat the population-level burden of depression has been exacerbated by the COVID-19\npandemic. Prepandemic estimates of depression prevalence are required to quantify\nand compreh…", "url": "https://www.ajpmonline.org/article/S0749-3797(22)00333-6/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/ac144099-3f87-4995-8610-8755b511515c/gr1.jpg", "publishedAt": "2022-09-19T07:21:13Z", "content": "<li>Global, regional, and national incidence, prevalence, and years lived with disability for 354 diseases and injuries for 195 countries and territories, 19902017: a systematic analysis for the Glob… [+6930 chars]"}]}