{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Alexis Keenan", "title": "FTC: Amazon tricked Prime customers and slowed efforts to unsubscribe - Yahoo Finance", "description": "The new lawsuit from the FTC is the latest US crackdown on an American tech giant.", "url": "https://finance.yahoo.com/news/ftc-amazon-tricked-its-prime-customers-and-slowed-their-efforts-to-unsubscribe-190017297.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/SfTjwwoUgUeEFPTFWZErgw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-06/7bd90450-1042-11ee-a5f3-33c8120f335d", "publishedAt": "2023-06-21T19:00:17Z", "content": "The Federal Trade Commission alleged in a new lawsuit against Amazon (AMZN) that the retail giant duped consumers into joining as Prime subscription members and frustrated their attempts to cancel, t… [+4930 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Americans See India in Positive Light, but Few Have Confidence in Modi: Pew Research Survey - The Wire", "description": "For those who have heard of Modi, “the prevailing sentiment is negative: 37% have little or no confidence in his ability to do the right thing regarding world affairs, compared with 21% who are confident in him”, according to the survey.", "url": "https://thewire.in/world/pew-survey-americans-india-modi", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2023/06/21212651/H20230621133777-800x400.jpg", "publishedAt": "2023-06-21T16:10:41Z", "content": "New Delhi:As Prime Minister Narendra Modi makes an official state visit to the United States, Pew Research Center has put out more details of a survey it undertook between March 20 to 26, to gauge Am… [+2167 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "Pia Krishnankutty", "title": "From unusual state dinner with Obama to ‘Howdy, Modi!’ — a look at Modi’s past 7 US visits - ThePrint", "description": "Modi's first visit to US as PM was in 2014 when he issued joint statement with then president Obama & addressed Indian-Americans at Madison Square Garden in New York.", "url": "https://theprint.in/theprint-essential/from-unusual-state-dinner-with-obama-to-howdy-modi-a-look-at-modis-past-7-us-visits/1636367/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2023/06/Modi-arrives-in-US-on-official-state-visit-1.jpg", "publishedAt": "2023-06-21T14:25:07Z", "content": "New Delhi: Prime Minister Narendra Modi arrived in the US Wednesday on what many expect will be a historical visit that may result in a myriad of deals and announcements between the two countries in … [+8680 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Drugs show positive results in fight against Alzheimer's - PBS NewsHour", "description": "After years of work, there is progress in the fight against Alzheimer’s disease, the incurable brain condition that affects more than six million Americans. Several new drugs have shown small but positive results in reducing the cognitive decline associated w…", "url": "https://www.pbs.org/newshour/show/new-drugs-show-small-but-positive-results-in-fight-against-alzheimers", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/06/progress-1024x683.jpg", "publishedAt": "2023-06-20T22:30:26Z", "content": "William Brangham:\r\nEarlier this month, an FDA advisory panel unanimously agreed that the drug known as Leqembi modestly slowed the progression of Alzheimer's. The FDA is expected to give final approv… [+1488 chars]"}]}