{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Pan American Health Organization"}, "author": null, "title": "Epidemiological Update on Monkeypox - Pan American Health Organization", "description": "Between 1 January and 7 July 2022, a total of 7,892 confirmed cases, including three deaths, were reported from 63 Member States in five World Health Organization (WHO) Regions. The 3 fatal cases were reported from Nigeria (1) and the Central African Republic…", "url": "https://www.paho.org/en/documents/epidemiological-update-monkeypox", "urlToImage": null, "publishedAt": "2022-07-10T00:23:30Z", "content": "Between 1 January and 7 July 2022, a total of 7,892 confirmed cases, including three deaths, were reported from 63 Member States in five World Health Organization (WHO) Regions. The 3 fatal cases wer… [+1297 chars]"}, {"source": {"id": null, "name": "RSVP Live"}, "author": "Sarah Magliocco", "title": "Hundreds of passengers impacted as Aer Lingus cancels 11 more flights to Spain, France and America - RSVP Live", "description": "The cancellations include flights to Spain, France and America, and a number of different reasons have been given as airports reach breaking point across Europe", "url": "https://www.rsvplive.ie/news/hundreds-passengers-impacted-aer-lingus-27436386", "urlToImage": "https://i2-prod.rsvplive.ie/news/irish-news/article27355483.ece/ALTERNATES/s1200/0_90487451.jpg", "publishedAt": "2022-07-08T21:49:03Z", "content": "Aer Lingus has cancelled 11 more flights today and tomorrow as airlines and airports across Europe continue to be impacted by disruption caused by a number of contributing factors.\r\nAer Lingus were f… [+3538 chars]"}, {"source": {"id": null, "name": "Superherohype.com"}, "author": "Blair Marnell", "title": "Julius Onah Will Direct Captain America 4 For Marvel Studios - Superherohype.com", "description": "The Cloverfield Paradox helmer Julius Onah has signed on to continue Sam Wilson's story in Marvel's upcoming Captain America sequel.", "url": "https://www.superherohype.com/movies/516439-julius-onah-will-direct-captain-america-4-for-marvel-studios", "urlToImage": "https://cdn1-www.superherohype.com/assets/uploads/2021/04/The-Falcon-and-the-Winter-Soldier-Captain-America-poster-featured.jpg", "publishedAt": "2022-07-08T20:46:48Z", "content": "Julius Onah Will Direct Captain America 4 For Marvel Studios\r\nAfter the events of The Falcon and the Winter Soldier, Sam Wilson (Anthony Mackie) is officially the new Captain America in the MCU. And … [+1828 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Dozens of people line up for monkeypox vaccine in NYC - Daily Mail", "description": "Gay or bisexual men who have multiple sexual partners over two weeks are again being offered the jab in America's monkeypox capital, alongside anyone exposed to the disease.", "url": "https://www.dailymail.co.uk/health/article-10995625/Dozens-people-line-monkeypox-vaccine-NYC.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/07/08/17/60043547-0-image-a-8_1657297342538.jpg", "publishedAt": "2022-07-08T16:24:33Z", "content": "Dozens of people lined up for vaccines against monkeypox in New York City Friday as the city launched its second jabbing drive.\r\nThe queue formed mostly of men snaked around the side of the Chelsea s… [+5239 chars]"}]}