{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lauran Neergaard", "title": "US starts grappling with 'travesty' of untreated hepatitis C - Waco Tribune-Herald", "description": "WASHINGTON (AP) — Too many Americans are missing out on a cure for hepatitis C, and a study underway in a hard-hit corner of Kentucky is exploring a simple way to start changing that. The key: On-the-spot diagnosis to replace today's multiple-step testing.", "url": "https://apnews.com/f5c95582495bc4662c96bc03a1556361", "urlToImage": "https://storage.googleapis.com/afs-prod/media/2abd2e504a594afcbc91302d92077e17/3000.webp", "publishedAt": "2022-12-20T17:35:23Z", "content": "WASHINGTON (AP) Too many Americans are missing out on a cure for hepatitis C, and a study underway in a hard-hit corner of Kentucky is exploring a simple way to start changing that.\r\nThe key: On-the-… [+4924 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Inside the House of Indies: Holiday Event Day 2 - Nintendo Switch - Nintendo of America", "description": "Welcome to Inside the House of Indies: Holiday Event – Day 2! We’ve got another plateful of indie game updates, announcements, and more from our indie partne...", "url": "https://www.youtube.com/watch?v=6qXjO6eQm34", "urlToImage": "https://i.ytimg.com/vi/6qXjO6eQm34/maxresdefault.jpg", "publishedAt": "2022-12-20T17:00:03Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "Polar air and a powerful winter storm put millions under winter alerts this holiday week - CNN", "description": "For millions of Americans across a large swath of the country, the holiday week is beginning with unrelenting below-freezing temperatures made even more miserable by heavy snow expected Tuesday and Wednesday in several central and northwestern states.", "url": "https://www.cnn.com/2022/12/20/weather/christmas-artic-winter-storm-tuesday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221220015845-01-sioux-falls-ice-121322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-12-20T13:40:00Z", "content": "For millions of Americans across a large swath of the country, the holiday week is beginning with unrelenting below-freezing temperatures made even more miserable by heavy snow expected Tuesday and W… [+5122 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gina Wadas", "title": "Under attack: Researchers shed light on how Lyme disease infects body - Phys.org", "description": "An estimated 476,000 Americans are infected each year with Lyme disease, a condition causing a wide range of symptoms that include fever, rash, and joint pain, as well as effects on the central nervous system and heart. Though it's common knowledge that Borre…", "url": "https://phys.org/news/2022-12-lyme-disease-infects-body.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/under-attack-researche.jpg", "publishedAt": "2022-12-19T21:47:30Z", "content": "An estimated 476,000 Americans are infected each year with Lyme disease, a condition causing a wide range of symptoms that include fever, rash, and joint pain, as well as effects on the central nervo… [+3365 chars]"}]}