{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "As.com"}, "author": "Gustavo García", "title": "Guardians - Yankees en vivo MLB Playoffs: Juego 5 de la Serie Divisional en directo - AS USA Latino", "description": "Sigue la previa y el minuto a minuto de Cleveland Guardians vs New York Yankees, juego 5 de la Serie Divisional de la Liga Americana desde el Yankee Stadium", "url": "https://us.as.com/mlb/guardians-yankees-en-vivo-mlb-playoffs-juego-5-de-la-serie-divisional-en-directo-n/", "urlToImage": "https://img.asmedia.epimg.net/resizer/x-Q2iFE7RSrbeLO2DoKafOROsJw=/644x362/cloudfront-eu-central-1.images.arcpublishing.com/diarioas/CR366Q56EZD67PVMA3ZIGG5NBA.jpg", "publishedAt": "2022-10-18T02:38:21Z", "content": "El orden al bat de los Guardians estará conformado por Steven Kwan, Amed Rosario, José Ramírez, Josh Naylor, Óscar González, Andrés Giménez, Gabriel Arias, Austin Hedges y Myles Straw\r\nPor su parte, … [+50 chars]"}, {"source": {"id": null, "name": "KGO-TV"}, "author": null, "title": "Coronavirus: Human organs could age 3-4 years faster after COVID infection, study shows - KGO-TV", "description": "Study conducted from millions of Americans showed that several of their organs aged faster by three to four years, with the majority happening among those who were hospitalized, but also to some who had mild COVID symptoms.", "url": "https://abc7news.com/covid-long-haul-study-aging-faster-after-organs-kidney/12340213/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12340492_101722-kgo-patient-generic-img.jpg?w=1600", "publishedAt": "2022-10-18T02:32:25Z", "content": "SAN FRANCISCO (KGO) -- After over two and a half years of COVID research, scientists are seeing the first data points that prove a dramatic change in human organs after a COVID infection.\r\n\"You can s… [+2532 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Associated Press", "title": "Karim Benzema and Alexia Putellas Win Ballon D'or Awards - Voice of America - VOA News", "description": "Karim Benzema has won the men's Ballon d'Or for the first time after a brilliant season with Real Madrid capped by the Champions League and Spanish league titles", "url": "https://www.voanews.com/a/karim-benzema-and-alexia-putellas-win-ballon-d-or-awards/6794280.html", "urlToImage": "https://gdb.voanews.com/03990000-0aff-0242-d2a6-08dab0b041b7_w1200_r1.jpg", "publishedAt": "2022-10-18T00:50:08Z", "content": "Paris  Karim Benzema won the men's Ballon d'Or for the first time on Monday after a brilliant season with Real Madrid capped by the Champions League and Spanish league titles.\r\nThe 34-year-old Benzem… [+3000 chars]"}, {"source": {"id": null, "name": "Verywellhealth.com"}, "author": "https://www.facebook.com/verywell", "title": "Shingles Facts and Statistics: What You Need to Know - Verywell Health", "description": "About 1 in 3 Americans will develop shingles at some point during their lifetime. Here’s what you should know about this painful condition.", "url": "https://www.verywellhealth.com/facts-about-shingles-5524786", "urlToImage": "https://www.verywellhealth.com/thmb/Gd0zLFMeZcnI1jvGjyyqFZyOfu4=/2309x1299/filters:fill(87E3EF,1)/GettyImages-1027270066-93ab05d67dcb48c991b4449de05fdbbe.jpg", "publishedAt": "2022-10-17T15:31:32Z", "content": "Each year, about 1 million people in the United States develop shingles, a painful condition caused by the reactivation of the virus that causes chickenpox. An estimated 1 in 3 Americans will get shi… [+7325 chars]"}, {"source": {"id": null, "name": "Pandaily.com"}, "author": "Pandaily", "title": "Mathematician Yitang Zhang Claims to Have Proven Riemann Hypothesis Problem - Pandaily", "description": "Yitang Zhang, a Chinese-American mathematician, reportedly disclosed in an online salon organized by the Peking University Alumni Association on October 15 that he has proven the longstanding Landau-Siegel zeros theory.", "url": "https://pandaily.com/mathematician-yitang-zhang-claims-to-have-proven-riemann-hypothesis-problem/", "urlToImage": "https://assets.pandaily.com/uploads/2022/10/rw.jpeg", "publishedAt": "2022-10-17T06:10:46Z", "content": "Yitang Zhang, a Chinese-American mathematician, reportedly disclosed in an online salon organized by the Peking University Alumni Association on October 15 that he has proven the longstanding Landau-… [+3000 chars]"}]}