{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "nbc-news", "name": "NBC News"}, "author": "David K. Li, Jay Blackman", "title": "FAA announces new air traffic control system in hopes of taming busy skies - NBC News", "description": "The FAA will embark on an ambitious three-year plan to modernize America's air traffic control systems and phase out the \"outdated technologies that are unable to meet\" modern demands, officials said Thursday.", "url": "https://www.nbcnews.com/news/us-news/faa-new-air-traffic-control-system-rcna205612", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-05/250505-newark-air-traffic-control-se-1124a-e317cd.jpg", "publishedAt": "2025-05-08T17:41:28Z", "content": "The FAA will embark on an ambitious three-year plan to modernize America's air traffic control systems and phase out the \"outdated technologies that are unable to meet\" modern demands, officials said… [+4186 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Andrew Solender", "title": "House GOP passes \"Gulf of America\" renaming bill - Axios", "description": "It's the first time the House has voted to codify one of the president's executive orders into federal law, though it's unclear if the Senate will take it up.", "url": "https://www.axios.com/2025/05/08/house-passes-gulf-of-america-mexico-bill", "urlToImage": "https://images.axios.com/6shHULEPeHyMUY9jLt2-J2j9WP8=/0x285:5945x3629/1366x768/2025/05/08/1746712792489.jpg", "publishedAt": "2025-05-08T14:53:40Z", "content": "The House voted Thursday to formalize President Trump's executive order to rename the Gulf of Mexico the \"Gulf of America.\"\r\nWhy it matters: It's the first time the House has voted to codify one of t… [+1570 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "T. rex’s ancestors may have walked from Asia to North America - Earth.com", "description": "Researchers trace T. rex origins to Asia and megaraptors to Gondwana. Climate changes and predator extinction fueled their rise as predators.", "url": "https://www.earth.com/news/t-rexs-ancestors-may-have-walked-from-asia-to-north-america/", "urlToImage": "https://cff2.earth.com/uploads/2025/05/08061535/T.-Rex-Asia.jpg", "publishedAt": "2025-05-08T12:18:44Z", "content": "A new study led by UCL researchers has traced the roots of Tyrannosaurus rex back to Asia. Before ruling North America as a colossal predator, T. rex likely crossed a land bridge from Asia more than … [+4834 chars]"}]}