{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "William Harwood", "title": "Three cosmonauts launched to space station as NASA chief touts cooperation with Russia - CBS News", "description": "The launch clears the way for an American astronaut to return to Earth on March 30 aboard another Russian spacecraft.", "url": "https://www.cbsnews.com/news/cosmonauts-launch-to-international-space-station-nasa-chief-touts-us-russia-cooperation/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2022/03/18/5c4439b5-b318-4ec5-ac59-e14096e08860/thumbnail/1200x630/b3d22299e73f1cc64e32ffc7782a39b6/031822-vandehei-cupola.jpg", "publishedAt": "2022-03-18T22:54:00Z", "content": "Three cosmonauts blasted off from the Baikonur Cosmodrome in Kazakhstan Friday, caught up with the International Space Station after a two-orbit rendezvous and moved in for docking at a newly arrived… [+7883 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Disney 'regrets' performance by visiting school drill team - The Associated Press - en Español", "description": "LAKE BUENA VISTA, Fla. (AP) — Officials at Walt Disney World said Friday that a performance by a visiting Texas high school drill team that used American Indian stereotypes, including chants of “scalp them,\" doesn't reflect the Florida resort's values.", "url": "https://apnews.com/99c10ffb45e8248ee65a5a77439e1a61", "urlToImage": "https://storage.googleapis.com/afs-prod/media/e4b529c005d847f594f6040148440f1c/3000.jpeg", "publishedAt": "2022-03-18T21:54:30Z", "content": "LAKE BUENA VISTA, Fla. (AP) Officials at Walt Disney World said Friday that a performance by a visiting Texas high school drill team that used American Indian stereotypes, including chants of scalp t… [+1901 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Xi expected to urge Biden to promote Ukraine peace talks; warn against hurting Chinese interests: State media - The Star Online", "description": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is likely to have a warning or two for the American leader too.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/03/18/xi-expected-to-urge-biden-to-promote-ukraine-peace-talks-warn-against-hurting-chinese-interests-state-media", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/18/1519838.jpg", "publishedAt": "2022-03-18T12:35:00Z", "content": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is li… [+3289 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Gina Kolata", "title": "Shrugs Over Flu Signal Future Attitudes About Covid - The New York Times", "description": "The coronavirus pandemic hasn’t prompted most Americans to take influenza more seriously. Instead, more people are likely to think of Covid the way they think of flu, experts say.", "url": "https://www.nytimes.com/2022/03/18/health/flu-covid.html", "urlToImage": "https://static01.nyt.com/images/2022/03/17/science/00sci-flu1/00sci-flu1-facebookJumbo.jpg", "publishedAt": "2022-03-18T09:02:57Z", "content": "In years like this one, when the flu vaccine was at best minimally effective, many are skeptical about getting the shots, which are widely available. Dr. Monto said there are efforts underway to prod… [+1722 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "NASA's big, new moon rocket begins rollout en route to launch pad tests - RNZ", "description": "America's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant for a final round of tests.<b></b>", "url": "https://www.rnz.co.nz/news/world/463568/nasa-s-big-new-moon-rocket-begins-rollout-en-route-to-launch-pad-tests", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/140242/eight_col_000_326E24H.jpg?1647567662", "publishedAt": "2022-03-18T02:46:53Z", "content": "NASA's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant en route to the launch pad in Florida on Thursday for a final round of tests in the coming… [+4732 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Borrowing gets more expensive for Americans - ABC News", "description": "The Federal Reserve hiked interest rates to curb rising inflation. This means that the cost of taking out loans or mortgages will be higher for Americans.SUB...", "url": "https://www.youtube.com/watch?v=Q0rDtRTCuJY", "urlToImage": "https://i.ytimg.com/vi/Q0rDtRTCuJY/hqdefault.jpg", "publishedAt": "2022-03-17T22:56:22Z", "content": null}]}