{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Gaouette, CNN", "title": "Blinken says Taliban has pledged that Americans with travel documents can leave Afghanistan - CNN", "description": "US Secretary of State Antony Blinken rebutted GOP claims that the Taliban is holding Americans \"hostage\" Tuesday, as uncertainty over the militant group's promises to let Americans leave Afghanistan continued to roil Washington and as the Taliban named member…", "url": "https://www.cnn.com/2021/09/07/politics/blinken-taliban-americans-afghanistan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210907091604-04-doha-us-delegation-0907-super-tease.jpg", "publishedAt": "2021-09-07T17:30:00Z", "content": "(CNN)US Secretary of State Antony Blinken rebutted GOP claims that the Taliban is holding Americans \"hostage\" Tuesday, as uncertainty over the militant group's promises to let Americans leave Afghani… [+5421 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Ryan Gilbey", "title": "Michael K Williams obituary - The Guardian", "description": "American actor best known for playing Omar Little in the TV crime series The Wire", "url": "https://amp.theguardian.com/tv-and-radio/2021/sep/07/michael-k-williams-obituary", "urlToImage": null, "publishedAt": "2021-09-07T17:21:00Z", "content": "US televisionAmerican actor best known for playing Omar Little in the TV crime series The Wire\r\nThe binge-watching revolution began in the late 1990s, when the combined advent of quality US televisio… [+6353 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "El Salvador’s bitcoin debut stumbles on first day - Financial Times", "description": "Digital currency’s price falls during closely watched rollout in Central American country", "url": "https://www.ft.com/content/56f1f053-3ac1-424a-97d6-6bbf9a12fa1d", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fde89095b-0d29-44fe-b7ad-46d14c0b4162.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2021-09-07T16:51:23Z", "content": "El Salvador’s pioneering adoption of bitcoin as legal tender hit snags within hours of the launch on Tuesday after the government had to take its app for storing the volatile digital asset offline an… [+3541 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Kayla Rivas", "title": "Children 6 months and up should get flu shot, delay during severe COVID-19 illness: pediatrics group - Fox News", "description": "Children aged 6 months and older should receive a flu vaccine this fall, the American Academy of Pediatrics advised Tuesday, however kids with moderate-to-severe COVID-19 should delay flu shots until they have recovered.", "url": "https://www.foxnews.com/health/children-flu-shot-covid-19-pediatrics-group", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/istock_000075734267_full.jpg", "publishedAt": "2021-09-07T14:41:39Z", "content": "Children aged 6 months and older should receive a flu vaccine this fall, the American Academy of Pediatrics advised Tuesday, however kids with moderate-to-severe COVID-19 should delay flu shots until… [+1802 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Victorious Taliban Gloat Over Ruins Of CIA's Afghan Base - NDTV", "description": "After America's longest war, Taliban commander Mullah Hasnain contemplates all that is left of what was part of the last CIA base -- demolished buildings, destroyed vehicles and piles of ammunition.", "url": "https://www.ndtv.com/world-news/victorious-taliban-gloat-over-ruins-of-cias-afghan-base-2532828", "urlToImage": "https://c.ndtvimg.com/2021-09/9fl6hvq_cia-afghan-base650_625x300_07_September_21.jpg", "publishedAt": "2021-09-07T14:19:00Z", "content": "The complex was once one of the most secure sites in Afghanistan.\r\nDeh Sabz District: After America's longest war, Taliban commander Mullah Hasnain contemplates all that is left of what was part of t… [+4005 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "Antony Blinken denies Taliban blocking Americans from leaving Mazar-i-Sharif - Times of India", "description": "US News: Reports have emerged over the past few days that 1,000 people, including Americans, had been stuck at Mazar-i-Sharif airport for days awaiting clearan", "url": "https://timesofindia.indiatimes.com/world/us/antony-blinken-denies-taliban-blocking-americans-from-leaving-mazar-i-sharif/articleshow/86004829.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86004891,width-1070,height-580,imgsize-43734,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-09-07T10:13:00Z", "content": "Antony Blinken denies Taliban blocking Americans from leaving Mazar-i-Sharif"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "COVID-19 vaccine division: As more people plan to get vaccinated, others say they will ‘wait & see’ - Study Finds", "description": "Younger adults, African-Americans, those from lower socioeconomic backgrounds, and people living in the southeast are the least likely to get the COVID vaccine.", "url": "https://www.studyfinds.org/covid-vaccine-division/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2020/11/pexels-gustavo-fring-3985170.jpg", "publishedAt": "2021-09-06T18:53:41Z", "content": "BOSTON, Mass. — The coronavirus vaccine has been a polarizing topic almost since the day the public started lining up for shots. In the United States, that debate has already spanned across two presi… [+4395 chars]"}]}