{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "WTHITV.com"}, "author": null, "title": "As federal health officials weigh Covid-19 booster shots, experts are reminding Americans the current vaccines are still highly effective - KIMT 3", "description": "As federal health officials weigh Covid-19 booster shots, experts are reminding Americans the current vaccines are still highly effective", "url": "https://www.wthitv.com/content/national/575242612.html", "urlToImage": "", "publishedAt": "2021-09-04T07:40:00Z", "content": "Health experts are reinforcing the point that full vaccination remains highly effective against severe illness and death caused by Covid-19 as federal regulators consider the possibility of authorizi… [+5993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "As federal health officials weigh Covid-19 booster shots, experts are reminding Americans the current vaccines are still highly effective - CNN", "description": "Health experts are reinforcing the point that full vaccination remains highly effective against severe illness and death caused by Covid-19 as federal regulators consider the possibility of authorizing a third dose in the upcoming weeks.", "url": "https://www.cnn.com/2021/09/04/health/us-coronavirus-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210903221318-pfizer-vaccine-083021-restricted-california-super-tease.jpg", "publishedAt": "2021-09-04T07:29:00Z", "content": "(CNN)Health experts are reinforcing the point that full vaccination remains highly effective against severe illness and death caused by Covid-19 as federal regulators consider the possibility of auth… [+6068 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "‘More data needed’: Top health officials reportedly urge White House to ‘follow science’ & DELAY vaccine booster plans - RT", "description": "Top US health officials have called on the White House to pump the brakes on plans to administer Covid vaccine booster shots to millions of Americans later this month, pointing to insufficient data, according to multiple reports.", "url": "https://www.rt.com/usa/533936-health-officials-delay-booster/", "urlToImage": "https://cdni.rt.com/files/2021.09/article/6132ff6c85f5404ac33be617.JPG", "publishedAt": "2021-09-04T05:15:00Z", "content": "While President Joe Biden’s administration already moved ahead with its booster announcement last month – with Biden stating that all American adults should receive a third dose within eight months o… [+3367 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Charles Creitz", "title": "Hannity rips Biden on Afghanistan: Americans being 'held hostage ... behind enemy lines' - Fox News", "description": "President Biden has failed America – and the American people cannot and will not forget that, as untold hundreds of American citizens remain stranded in Taliban-controlled Afghanistan, Sean Hannity declared Friday in his \"Opening Monologue.\"", "url": "https://www.foxnews.com/media/hannity-monologue-biden-afghanistan-americans-held-hostage", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/06/AP21166471478931.jpg", "publishedAt": "2021-09-04T04:34:17Z", "content": "President Biden has failed America and the American people cannot and will not forget that, as untold hundreds of American citizens remain stranded in Taliban-controlled Afghanistan, Sean Hannity dec… [+3417 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Callum Jones", "title": "Jobs growth in US hit by sharp rise in Delta cases - The Times", "description": "America’s economic recovery stuttered last month, with a sharp slowdown in jobs growth that cast doubt on whether the Federal Reserve will start paring back its", "url": "https://www.thetimes.co.uk/article/jobs-growth-in-us-hit-by-sharp-rise-in-delta-cases-g7clql09p", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F6c76d638-0cb9-11ec-9503-f24d9e0411ae.jpg?crop=8192%2C4608%2C0%2C427&resize=685", "publishedAt": "2021-09-03T23:01:00Z", "content": "Americas economic recovery stuttered last month, with a sharp slowdown in jobs growth that cast doubt on whether the Federal Reserve will start paring back its economic support this year.\r\nOnly 235,0… [+556 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Zeke Miller", "title": "U.S. COVID-19 booster shot plan faces complications, some may miss Sept. 20 - CP24 Toronto's Breaking News", "description": "President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the availability of third doses for those who received the Moderna vaccine, administ…", "url": "https://www.cp24.com/world/u-s-covid-19-booster-shot-plan-faces-complications-some-may-miss-sept-20-1.5573028", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5573030.1630703331!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-03T21:10:04Z", "content": "WASHINGTON (AP) - President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the av… [+4245 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "Solar wave could bring down internet in the world on Monday (6) | Viral | Online Diary - Play Crazy Game", "description": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal mass ejections. According to SpaceWeather.com, a kind of “so…", "url": "https://playcrazygame.com/2021/09/03/solar-wave-could-bring-down-internet-in-the-world-on-monday-6-viral-online-diary/", "urlToImage": "https://cdn.dol.com.br/img/inline/670000/auroraboreal_00670554_0_.jpg?xid=1601192", "publishedAt": "2021-09-03T16:48:51Z", "content": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal … [+3604 chars]"}]}