{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vivek Ramaswamy Reveals How He Gets His Energy After 42 Events In 6 Days - NDTV", "description": "Indian-American leader and Republican presidential candidate Vivek Ramaswamy had participated in 42 campaign stops this week by Saturday, more than any other 2024 candidate, USA TODAY reported.", "url": "https://www.ndtv.com/world-news/vivek-ramaswamy-reveals-how-he-gets-his-energy-after-42-events-in-6-days-4688667", "urlToImage": "https://c.ndtvimg.com/2023-08/njc36av_vivek-ramaswamy-afp_625x300_31_August_23.jpg", "publishedAt": "2023-12-17T01:31:58Z", "content": "Mr Ramaswamy has a net worth of about USD 630 million.\r\nWashington DC: Indian-American leader and Republican presidential candidate Vivek Ramaswamy had participated in 42 campaign stops this week by … [+5278 chars]"}, {"source": {"id": null, "name": "Eonline.com"}, "author": "Corinne Heller", "title": "Sisterhood of the Traveling Pants Stars Have a Full Reunion - E! NEWS", "description": "Blake Lively, Alexis Bledel, Amber Tamblyn and America Ferrera just had their first full public Sisterhood of the Traveling Pants reunion in years.", "url": "https://www.eonline.com/news/1391614/sisterhood-of-the-traveling-pants-stars-have-a-full-cast-reunion-that-will-lift-your-spirits", "urlToImage": "https://akns-images.eonline.com/eol_images/Entire_Site/20231116/rs_1200x1200-231216162827-1200-sisterhood-of-the-traveling-pants-reunion-cjh-instagram-121523.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top", "publishedAt": "2023-12-17T00:57:00Z", "content": "Call us crazy, but it's scientifically impossible for an onscreen sisterhood to be as cute as this one.\r\nSisterhood of the Traveling Pants stars Blake Lively, Amber Tamblyn, Alexis Bledelreunited wit… [+787 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Liza Lester", "title": "North America's first people may have arrived by sea ice highway as early as 24,000 years ago - Phys.org", "description": "One of the hottest debates in archaeology is how and when humans first arrived in North America. Archaeologists have traditionally argued that people walked through an ice-free corridor that briefly opened between ice sheets an estimated 13,000 years ago.", "url": "https://phys.org/news/2023-12-north-america-people-sea-ice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/arctic-sea-ice-1.jpg", "publishedAt": "2023-12-16T11:40:35Z", "content": "One of the hottest debates in archaeology is how and when humans first arrived in North America. Archaeologists have traditionally argued that people walked through an ice-free corridor that briefly … [+4609 chars]"}]}