{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Greg Iacurci", "title": "3.2 million Americans are still long-term unemployed as benefits are set to expire - CNBC", "description": "More than a third of the unemployed have been out of work for at least six months, as federal jobless benefits expire and a national eviction ban was overturned.", "url": "https://www.cnbc.com/2021/09/03/3point2-million-americans-are-long-term-unemployed-as-benefits-will-end.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106825236-1610725139560-gettyimages-1220444551-AFP_1TJ9XN.jpeg?v=1630678301", "publishedAt": "2021-09-03T14:54:19Z", "content": "More than a third of jobless Americans in August were long-term unemployed as benefits for these workers are set to expire.\r\nAbout 3.2 million people or 37.4% of the total unemployed have been out of… [+2889 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Ingrid Fadelli", "title": "The first experimental realization of a dissipative time crystal - Phys.org", "description": "A time crystal is a unique and exotic phase of matter first predicted by the American physicist Frank Wilczek in 2012. Time crystals are temporal analogs of more conventional space crystals, as both are based on structures characterized by repeating patterns.", "url": "https://phys.org/news/2021-09-experimental-dissipative-crystal.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/the-first-experimental-2.jpg", "publishedAt": "2021-09-03T13:30:01Z", "content": "A time crystal is a unique and exotic phase of matter first predicted by the American physicist Frank Wilczek in 2012. Time crystals are temporal analogs of more conventional space crystals, as both … [+5126 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dan Balz, Scott Clement, Emily Guskin", "title": "Post-ABC poll: Biden's job approval falls as Americans disagree with handling of Afghanistan departure - The Washington Post", "description": "The end of the war sharply cut Biden’s job approval rating, but Americans support resettlement here of vetted refugees.", "url": "https://www.washingtonpost.com/politics/post-abc-poll-biden-afghanistan/2021/09/02/5520cd3e-0c16-11ec-9781-07796ffb56fe_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BLAGFUAMMII6ZJW5FFV2P6ZNZY.jpg&w=1440", "publishedAt": "2021-09-03T13:00:00Z", "content": "The Afghanistan withdrawal has contributed to a drop in Bidens overall approval rating, which for the first time in his presidency is net negative. The poll finds 44 percent saying they approve of ho… [+7741 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sesona Ngqakamba", "title": "Don't use ivermectin to treat Covid-19 - Sahpra says its stance is aligned with the US' FDA - News24", "description": "The South African Health Products Regulatory Authority has once again warned the public against the use of ivermectin, saying it remains aligned to America's FDA when it comes to the use of the drug.", "url": "https://www.news24.com/news24/southafrica/news/dont-use-it-sahpra-says-its-stance-on-ivermectin-is-aligned-with-the-us-fda-20210903", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11148/4ee769e04a9e4101837dfd746405aa28.jpg", "publishedAt": "2021-09-03T11:43:15Z", "content": "<ul><li>Sahpra says it remains aligned to America's Food and Drug Administration (FDA) when it comes to the use of ivermectin.</li><li>The authority has warned people to refrain from buying drugs fro… [+2127 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Seun Opejobi", "title": "Nnamdi Kanu: DSS stopped American lawyer from seeing IPOB leader in detention – Counsel - Daily Post Nigeria", "description": "The Department of State Services, DSS, has been accused of preventing Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, from having access to his lawyers. Kanu's lead counsel, Ifeanyi Ejiofor, said DSS prevented him and IPOB's Attorney in the Unit…", "url": "https://dailypost.ng/2021/09/03/nnamdi-kanu-dss-stopped-american-lawyer-from-seeing-ipob-leader-in-detention-counsel/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/12/Nnamdi-Kanu.jpg", "publishedAt": "2021-09-03T08:00:11Z", "content": "The Department of State Services, DSS, has been accused of preventing Nnamdi Kanu, leader of the Indigenous People of Biafra, IPOB, from having access to his lawyers.\r\nKanu’s lead counsel, Ifeanyi Ej… [+1398 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Canadians Andreescu, Shapovalov advance to third round at US Open - Sportsnet.ca", "description": "Canada's Bianca Andreescu has advanced to the third round at the 2021 US Open with a straight-set 6-4, 6-4 win over American Lauren Davis.", "url": "https://www.sportsnet.ca/tennis/article/andreescu-advances-third-round-us-open-win-davis/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2021/09/Bianca-Andreescu-1040x572.jpg", "publishedAt": "2021-09-03T00:47:00Z", "content": "NEW YORK -- Bianca Andreescu is into the third round at the U.S. Open.\r\nThe sixth-seeded Canadian downed American Lauren Davis, 6-4, 6-4 on Thursday, and remains undefeated at the Grand Slam followin… [+1620 chars]"}, {"source": {"id": null, "name": "One America News Network"}, "author": null, "title": "Life insurers shift to pre-pandemic norms after COVID vaccine roll-outs - One America News Network", "description": "By Carolyn Cohn and Noor Zainab Hussain LONDON (Reuters) - The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with underlying health", "url": "https://www.oann.com/life-insurers-shift-to-pre-pandemic-norms-after-covid-vaccine-roll-outs/", "urlToImage": "https://dzm0ugdauank9.cloudfront.net/wp-content/uploads/2021/09/2021-09-02T135113Z_2_LYNXMPEH810OX_RTROPTP_0_HEALTH-CORONAVIRUS-FRANCE_1.jpg", "publishedAt": "2021-09-02T14:32:09Z", "content": "September 3, 2021\r\nBy Carolyn Cohn and Noor Zainab Hussain\r\nLONDON (Reuters) – The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with under… [+4997 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Travis Caldwell", "title": "More than 500000 U.S. children tested positive for COVID-19 in 3 weeks - CTV News", "description": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not yet eligible to receive vaccinations.", "url": "https://www.ctvnews.ca/health/coronavirus/more-than-500-000-u-s-children-tested-positive-for-covid-19-in-3-weeks-1.5570853", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5570872.1630590742!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T13:54:40Z", "content": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not y… [+7020 chars]"}]}