{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Peter Rüegg", "title": "How geology and climate shape biodiversity - Phys.org", "description": "Tropical rainforests are the most biodiverse habitats on Earth. They are home to a huge number of different plants, animals, fungi and other organisms. These forests are primarily spread over three continents, concentrated in the Amazon Basin in South America…", "url": "https://phys.org/news/2021-09-geology-climate-biodiversity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/how-geology-and-climat.jpg", "publishedAt": "2021-09-28T13:25:05Z", "content": "Tropical rainforests are the most biodiverse habitats on Earth. They are home to a huge number of different plants, animals, fungi and other organisms. These forests are primarily spread over three c… [+5457 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "They suffered through Covid-19, and still don’t want the vaccine - The Indian Express", "description": "More than 100 million people in the U.S. have likely been infected with Covid, according to one recent estimate. Many of them have become proponents of natural immunity who are among the roughly 126 million Americans who remain unvaccinated, about 38% of the …", "url": "https://indianexpress.com/article/world/they-suffered-through-covid-19-and-still-dont-want-the-vaccine-7539378/", "urlToImage": "https://images.indianexpress.com/2021/09/vaccine-11.jpg", "publishedAt": "2021-09-28T08:24:55Z", "content": "When Eric Grunor contracted Covid-19 in January, he became so ill that he struggled to get off the couch. One night, he awoke at 3 a.m., winded, barely able to talk and so fatigued he could hardly li… [+7321 chars]"}, {"source": {"id": null, "name": "Sky News Australia"}, "author": "David Wu", "title": "Biden’s vaccine plea as he receives COVID-19 booster shot - Sky News Australia", "description": "US President Joe Biden received a COVID-19 booster shot live on air in hopes of spurring on millions of Americans who have still not received at least one dose of a vaccine.", "url": "https://www.skynews.com.au/world-news/united-states/joe-biden-has-urged-americans-to-get-covid19-vaccine-with-23-per-cent-of-its-population-still-unvaccinated/news-story/87f9a2a7fca4dfb6054d657244245384", "urlToImage": "https://content.api.news/v3/images/bin/445878a6e7888cf59e18897d9d73d24c", "publishedAt": "2021-09-28T01:07:51Z", "content": "US President Joe Biden has warned the \"minority\" of Americans choosing not to get the COVID-19 vaccine are \"causing an awful lot of damage for the rest of country\" as he received a booster shot live … [+2636 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "David Charter", "title": "US explores offer to station troops on Russian bases near Afghanistan - The Times", "description": "America’s top general held talks with his Russian counterpart on an apparent offer by President Putin to allow US military units to use Russian bases in central Asia to combat terrorist threats in Afghanistan.General Mark Milley, chairman of the Joint Chiefs …", "url": "https://www.thetimes.co.uk/article/us-explores-offer-to-station-troops-on-russian-bases-near-afghanistan-8b73m0z5l", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F4c0ca484-1fe9-11ec-a1fd-37d9030e4d65.jpg?crop=1023%2C575%2C0%2C53&resize=1200", "publishedAt": "2021-09-28T00:45:00Z", "content": "Americas top general held talks with his Russian counterpart on an apparent offer by President Putin to allow US military units to use Russian bases in central Asia to combat terrorist threats in Afg… [+552 chars]"}]}