{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Erik Wasson, Steven T. Dennis", "title": "US Shutdown Dealmaking Hits New Roadblocks as Tensions Flare - Bloomberg.com", "description": "Prospects are swiftly fading on Capitol Hill for a deal this week to end the longest government shutdown in US history despite warnings of worsening flight disruptions and mounting concerns about food aid for low-income Americans.", "url": "https://www.bloomberg.com/news/articles/2025-11-06/us-shutdown-dealmaking-hits-new-roadblocks-as-tensions-flare", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ijf1yXYkNSAY/v1/1200x800.jpg", "publishedAt": "2025-11-06T20:51:32Z", "content": "Prospects are swiftly fading on Capitol Hill for a deal this week to end the longest government shutdown in US history despite warnings of worsening flight disruptions and mounting concerns about foo… [+278 chars]"}, {"source": {"id": "fortune", "name": "Fortune"}, "author": "Nick Lichtenberg", "title": "Trump punches new $35 billion hole in national debt with deal for Medicare to cover your Ozempic - Fortune", "description": "America's waistline may shrink, but its national debt will swell.", "url": "https://fortune.com/2025/11/06/trump-ozempic-medicare-medicaid-wegovy-national-debt/", "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/11/GettyImages-2243768425-e1762451483826.jpg?resize=1200,600", "publishedAt": "2025-11-06T18:48:30Z", "content": "President Donald Trump has announced a landmark deal aiming to expand Medicare coverage to include certain weight-loss medications, a move that could dramatically change access to these treatments fo… [+2959 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": "StudyFinds Analysis", "title": "Nearly Two-Thirds Of Young Americans Have Considered Leaving The Country - StudyFinds", "description": "63% of young Americans have considered leaving the U.S. AI anxiety also doubled among students, and half of adults report feeling lonely.", "url": "https://studyfinds.org/young-americans-want-out-of-usa/", "urlToImage": "https://studyfinds.org/wp-content/uploads/2025/11/leavingusa-scaled.jpg", "publishedAt": "2025-11-06T15:48:50Z", "content": "The stress and loneliness of an increasingly divided society has left many Americans wondering if the grass is greener elsewhere. (Credit: Kosoff on Shutterstock)\r\n<ul><li>63% of young adults (ages 1… [+10762 chars]"}, {"source": {"id": null, "name": "San Francisco Chronicle"}, "author": "Aidin Vaziri", "title": "Melatonin for sleep linked to 90% higher risk of heart failure, study finds - San Francisco Chronicle", "description": "A new American Heart Association study finds long-term melatonin use as a sleep aid may raise the risk of heart failure and death among adults with insomnia.", "url": "https://www.sfchronicle.com/health/article/melatonin-heart-failure-study-21139376.php", "urlToImage": "https://s.hdnux.com/photos/01/47/32/33/27109075/5/rawImage.jpg", "publishedAt": "2025-11-05T18:07:21Z", "content": "Over-the-counter sleep aids are displayed for sale in a store. A new American Heart Association study finds long-term melatonin use as a sleep aid may raise the risk of heart failure and death among … [+2785 chars]"}]}