{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed, CNN", "title": "What abortion access looks like in America even before the Supreme Court reconsiders Roe v. Wade - CNN", "description": "The blockbuster clash over Roe v. Wade now in front of the Supreme Court comes after a successful, decades-long guerrilla warfare campaign by the anti-abortion movement to attack access to the procedure around the edges.", "url": "https://www.cnn.com/2021/10/09/politics/abortion-restrictions-roe-v-wade-access-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200304111019-01-abortion-protests-supreme-court-super-tease.jpg", "publishedAt": "2021-10-09T16:01:00Z", "content": "(CNN)The blockbuster clash over Roe v. Wade now in front of the Supreme Court comes after a successful, decades-long guerrilla warfare campaign by the anti-abortion movement to attack access to the p… [+10079 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Julia Musto", "title": "Top 5 richest Americans on Forbes 400 List: Who are they? - Fox Business", "description": "Forbes has released its 40th annual list of the 400 wealthiest people across the world and the majority are Americans.", "url": "https://www.foxbusiness.com/economy/top-5-richest-americans-forbes-400-list-who-are-they", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/05/0/0/Jeff-Bezos-AP.jpg?ve=1&tl=1", "publishedAt": "2021-10-09T15:38:36Z", "content": "Forbes has released its 40th annual list of the 400 wealthiest people in the world, and the majority are Americans. \r\nAccording to the publication, the billionaires' net worths were calculated using … [+4709 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Kathy Gannon", "title": "Taliban say they won't work with U.S. to contain Islamic State - CTV News", "description": "The Taliban on Saturday ruled out cooperation with the U.S. to contain extremist groups in Afghanistan, staking out an uncompromising position on a key issue ahead of the first direct talks between the former foes since America withdrew from the country in Au…", "url": "https://www.ctvnews.ca/world/taliban-say-they-won-t-work-with-u-s-to-contain-isis-1.5617631", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5617634.1633782273!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-10-09T14:30:33Z", "content": "ISLAMABAD -- \r\nThe Taliban on Saturday ruled out cooperation with the United States to contain extremist groups in Afghanistan, staking out an uncompromising position on a key issue ahead of the firs… [+4737 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Kathy Gannon", "title": "Taliban say they won't work with US to contain Islamic State - Associated Press", "description": "ISLAMABAD (AP) — The Taliban on Saturday ruled out cooperation with the United States to contain extremist groups in Afghanistan, staking out an uncompromising position on a key issue ahead of the first direct talks between the former foes since America withd…", "url": "https://apnews.com/article/business-taliban-islamabad-middle-east-islamic-state-group-4d419bb70259f93f7165169889d05ff1", "urlToImage": "https://storage.googleapis.com/afs-prod/media/a8ba550efa0a406e8aebd69e15b109eb/3000.jpeg", "publishedAt": "2021-10-09T14:03:45Z", "content": "ISLAMABAD (AP) The Taliban on Saturday ruled out cooperation with the United States to contain extremist groups in Afghanistan, staking out an uncompromising position on a key issue ahead of the firs… [+4714 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Modernizing Planetary Protection: Less Restrictive “Bioburden” Rules Would Make Mars Missions Simpler - SciTechDaily", "description": "A new report that could make it simpler to send spacecraft to some areas of Mars while still protecting the planet from Earth-based contamination was presented today at a press conference at the 53rd annual meeting of the American Astronomical Society’s Divis…", "url": "https://scitechdaily.com/modernizing-planetary-protection-less-restrictive-bioburden-rules-would-make-mars-missions-simpler/", "urlToImage": "https://scitechdaily.com/images/Mars-Interior-Structure.gif", "publishedAt": "2021-10-09T10:54:53Z", "content": "ByPlanetary Science InstituteOctober 9, 2021\r\nAnimation showing an artist’s rendition of Mars’ interior structure. Credit: NASA/JPL-Caltech\r\nA new report that could make it simpler to send spacecraft… [+5895 chars]"}, {"source": {"id": null, "name": "Californianewstimes.com"}, "author": "fresno", "title": "How to Raise awareness on Breast Cancer - California News Times", "description": "What can you do to raise awareness? 1 in 8 American women are diagnosed with breast cancer in their lifetime. This cool fact reminds us that breast cancer is a disease that affects everyone. Most of u", "url": "https://californianewstimes.com/how-to-raise-awareness-on-breast-cancer/544253/", "urlToImage": "https://www.fresyes.com/wp-content/uploads/2021/10/shutterstock_724076257.jpeg", "publishedAt": "2021-10-01T17:15:49Z", "content": "What can you do to raise awareness?\r\n1 in 8 American women are diagnosed with breast cancer in their lifetime. This cool fact reminds us that breast cancer is a disease that affects everyone. Most of… [+5289 chars]"}]}