{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Andrew Tate: Romanian police widen probe into controversial influencer - BBC", "description": "The British-American influencer is in custody over allegations of human trafficking and rape.", "url": "https://www.bbc.co.uk/news/world-europe-64285341", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/EFD2/production/_128249316_5c3b04f8a957758dc3d36191506e4072e23272dd0_0_4372_29912000x1368.jpg", "publishedAt": "2023-01-16T06:09:42Z", "content": "Romanian police are expanding their investigation into former kickboxing champion Andrew Tate, seizing a fleet of luxury cars from his Bucharest compound over the weekend, and raiding seven more prop… [+6449 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, Kylie Atwood", "title": "American held in Iran launches hunger strike and writes to Biden asking him to do more for detainees - CNN", "description": "An American wrongfully detained in Iran is calling on President Joe Biden to take notice of US detainees there, launching a hunger strike Monday to mark seven years since he was left behind in a prisoner swap that brought other Americans home.", "url": "https://www.cnn.com/2023/01/16/politics/namazi-hunger-strike-iran/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210527195814-06-siamak-namazi-family-photos.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-01-16T05:01:00Z", "content": "An American wrongfully detained in Iran is calling on President Joe Biden to take notice of US detainees there, launching a hunger strike Monday to mark seven years since he was left behind in a pris… [+4179 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Terrifying near-miss between passenger planes at JFK Airport - NBC News", "description": "The pilot of a Delta jet braked moments before colliding with an American Airlines plane. No one was hurt in the incident, but the Delta flight returned to t...", "url": "https://www.youtube.com/watch?v=4gXYGRj9Fm8", "urlToImage": "https://i.ytimg.com/vi/4gXYGRj9Fm8/maxresdefault.jpg", "publishedAt": "2023-01-16T01:00:03Z", "content": null}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Miss USA R'Bonney Gabriel, a Filipino-American, wins Miss Universe competition - Channel NewsAsia", "description": "Gabriel is a former high school volleyball player and graduate of the University of North Texas. A short bio posted on the Miss Universe website said she is also CEO of her own sustainable clothing line.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/miss-universe-2023-winner-miss-usa-rbonney-gabriel-346706", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--BjgD8mWM--/c_crop,h_576,w_1024,x_0,y_27/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2023/01/16/miss_universe_2023_winner_miss_usa.jpg?itok=uFj04X67", "publishedAt": "2023-01-15T23:30:00Z", "content": "In the Q&amp;A at the last stage of the competition for the three finalists, Gabriel was asked how she would work to demonstrate Miss Universe is an empowering and progressive organisation if she wer… [+1257 chars]"}, {"source": {"id": null, "name": "Arabamericannews.com"}, "author": null, "title": "When battling multiple infections, infants and toddlers at higher risk of severe outcomes, study suggests - The Arab American News", "description": "SOUTHFIELD – With COVID, flu and RSV creating what many are calling a tripledemic, new research is shedding light on the effect the different COVID-19 variants have had on the youngest of patients throughout the pandemic and the role co-infections have played…", "url": "https://arabamericannews.com/2023/01/15/when-battling-multiple-infections-infants-and-toddlers-at-higher-risk-of-severe-outcomes-study-suggests/", "urlToImage": "https://arabamericannews.com/wp-content/uploads/2023/01/tripledemic.jpg", "publishedAt": "2023-01-15T21:03:36Z", "content": "SOUTHFIELD With COVID, flu and RSV creating what many are calling a tripledemic, new research is shedding light on the effect the different COVID-19 variants have had on the youngest of patients thro… [+4303 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": null, "title": "Miss USA R'Bonney Gabriel wins Miss Universe Competition - CP24", "description": "R'Bonney Gabriel, a fashion designer, model and sewing instructor from Texas who competition officials said is the first Filipino American to win Miss USA, was crowned Miss Universe on Saturday night.", "url": "https://www.cp24.com/entertainment-news/miss-usa-r-bonney-gabriel-wins-miss-universe-competition-1.6231628", "urlToImage": "https://www.cp24.com/polopoly_fs/1.6231629.1673809878!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2023-01-15T19:11:52Z", "content": "NEW ORLEANS (AP) - R'Bonney Gabriel, a fashion designer, model and sewing instructor from Texas who competition officials said is the first Filipino American to win Miss USA, was crowned Miss Univers… [+2284 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Senior military leader concerned by Canada's absence from American-British-Australian security pact - CBC News", "description": "Vice-Admiral Bob Auchterlonie, one of Canada's most senior military leaders, says he's worried Canada could miss out on key technology sharing opportunities because of its absence from the AUKUS deal.", "url": "https://www.cbc.ca/news/politics/military-officer-aukus-deal-1.6714845", "urlToImage": "https://i.cbc.ca/1.6714850.1673805035!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/cda-indo-pacific-20230115.JPG", "publishedAt": "2023-01-15T18:42:19Z", "content": "There are concerns at the highest levels of the Canadian Armed Forces that this country won't have access to the same cutting-edge military technology as its closest allies because it is not part of … [+4675 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Romania seizes luxury cars, assets worth $5.6 million in Andrew Tate case - ABC News", "description": "Authorities descend on a compound near Bucharest to remove a fleet of luxury cars and other assets belonging to British-American influencer Andrew Tate, who faces charges of human trafficking and rape.", "url": "https://www.abc.net.au/news/2023-01-15/romania-tows-luxury-cars-in-andrew-tate-case/101856912", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/bf1b23b63b133138cd3641f630008abd?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2023-01-15T03:13:01Z", "content": "Romanian authorities have seized a fleet of luxury cars and assets worth about $5.6 million from divisive social media personality Andrew Tate's property in Bucharest.\r\n<ul><li>Andrew Tate was arrest… [+2808 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Candace McDuffie", "title": "Black Folks Are More Likely To Die From Uterine, Prostate And Breast Cancer New Study Shows - Yahoo Life", "description": "According to a new report from American Cancer Society, Black men and women are more likely to die from uterine, breast and prostate cancer than those from...", "url": "https://www.yahoo.com/lifestyle/black-folks-more-likely-die-140000224.html", "urlToImage": "https://media.zenfs.com/en/the_root_754/ac3677f0d72cc69c43fa36713f399247", "publishedAt": "2023-01-14T14:00:00Z", "content": "Photo: Andrey_Popov (Shutterstock)\r\nAccording to a new report from American Cancer Society, Black men and women are more likely to die from uterine, breast and prostate cancer than those from other r… [+1845 chars]"}]}