{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Harvard Crimson"}, "author": null, "title": "Amid Backlash to Antisemitic Post, Harvard Professor Resigns as PSC Faculty Adviser, FSJP Member | News - Harvard Crimson", "description": "Walter Johnson, a professor of History and African and African American Studies, resigned as a faculty adviser to the Harvard Undergraduate Palestine Solidarity Committee and from Faculty and Staff for Justice in Palestine after the groups faced a wave of bac…", "url": "https://www.thecrimson.com/article/2024/2/21/walter-johnson-resigns-psc/", "urlToImage": "https://s3.amazonaws.com/thumbnails.thecrimson.com/photos/2024/02/08/204900_1368437.jpg.2000x1333_q95_crop-smart_upscale.jpg", "publishedAt": "2024-02-21T04:27:13Z", "content": "Walter Johnson, a professor of History and of African and African American Studies, resigned as a faculty adviser to the Harvard Undergraduate Palestine Solidarity Committee and from Harvard Faculty … [+2798 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Mikayla Mace Kelley", "title": "'The future is fungal': New research finds that fungi that live in healthy plants are sensitive to climate change - Phys.org", "description": "Spruce, pine, fir and other trees tower across the frigid swaths of land that span North America, northern Europe and Russia in a great ring around the world. These boreal forests constitute the largest land ecosystem and the northernmost forests on Earth.", "url": "https://phys.org/news/2024-02-future-fungal-fungi-healthy-sensitive.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/the-future-is-fungal-n-1.jpg", "publishedAt": "2024-02-20T22:33:05Z", "content": "Spruce, pine, fir and other trees tower across the frigid swaths of land that span North America, northern Europe and Russia in a great ring around the world. These boreal forests constitute the larg… [+9326 chars]"}, {"source": {"id": "fox-sports", "name": "Fox Sports"}, "author": "Bob Pockrass", "title": "NASCAR Power Rankings: William Byron surges with Daytona 500 win - FOX Sports", "description": "William Byron's Daytona 500 victory shook up this week's rankings. See where your favorite driver landed after the \"Great American Race.\"", "url": "https://www.foxsports.com/stories/nascar/power-rankings-william-byron-surges-with-daytona-500-win", "urlToImage": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/02/1408/814/2024-02-20_NASCAR-Power-Rankings_16x9.jpg?ve=1&tl=1", "publishedAt": "2024-02-20T18:32:49Z", "content": "While Daytona isn't too telling on how a driver will do during the season, William Byron certainly deserves to move to the top spot in these power rankings.\r\nMaybe fourth was too low going into the 2… [+2796 chars]"}]}