{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Fox News Entertainment Newsletter: American Eagle on Sydney Sweeney’s ad, Paulina Porizkova stuns in bikini - Fox News", "description": "The Fox News Entertainment Newsletter brings you the latest Hollywood headlines, celebrity interviews and stories from Los Angeles and beyond.", "url": "https://www.foxnews.com/entertainment/fox-news-entertainment-newsletter-american-eagle-sydney-sweeneys-ad-paulina-porizkova-stuns-bikini", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2025/08/sydney-sweeney-paulina-p.jpg", "publishedAt": "2025-08-02T16:55:19Z", "content": "Welcome to the Fox News Entertainment Newsletter.\r\n TOP 3:\r\n- American Eagle fires back at critics after Sydney Sweeney\r\n campaign sparks online backlash\r\n- Supermodel Paulina Porizkova stuns in biki… [+1106 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aaron Blake", "title": "The Trump administration takes a very Orwellian turn - CNN", "description": "Back in March, President Donald Trump signed an executive order targeted at the Smithsonian Institution that began as follows: “Over the past decade, Americans have witnessed a concerted and widespread effort to rewrite our Nation’s history, replacing objecti…", "url": "https://www.cnn.com/2025/08/02/politics/the-trump-administration-takes-a-very-orwellian-turn", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2227189995.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-08-02T16:22:00Z", "content": "Back in March, President Donald Trump signed an executive order targeted at the Smithsonian Institution that began as follows: Over the past decade, Americans have witnessed a concerted and widesprea… [+5621 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon", "title": "Trump is moving nuclear submarines following remarks by an ex-Russian president. Here are the subs in the American fleet - CNN", "description": "US President Donald Trump said Friday he was ordering two US Navy nuclear submarines to “appropriate regions,” in response to remarks by Dmitry Medvedev, Russia’s former president and current deputy chairman of its Security Council.", "url": "https://www.cnn.com/2025/08/02/us/us-navy-submarine-explainer-intl-hnk-ml", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2014-10-20t120000z-1774717975-tm3eaak0wcj01-rtrmadp-3-usa-arms-nuclear.JPG?c=16x9&q=w_800,c_fill", "publishedAt": "2025-08-02T12:00:00Z", "content": "US President Donald Trump said Friday he was ordering two US Navy nuclear submarines to appropriate regions, in response to remarks by Dmitry Medvedev, Russias former president and current deputy cha… [+3524 chars]"}]}