{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Julian  Mark", "title": "NASA James Webb Space Telescope stirs controversy over name, LGBTQ discrimination - The Washington Post", "description": "At a time when Americans are rethinking who should be represented in monuments and on buildings and street signs, the James Webb Space Telescope emerges as a case study of the fractious process of endowing an object with a name.", "url": "https://www.washingtonpost.com/nation/2021/10/13/nasa-james-webb-telescope-name-controversy/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5ZLAMXGHWMI6VKBFQ4RAATSBKA.jpg&w=1440", "publishedAt": "2021-10-13T13:56:00Z", "content": "But Prescod-Weinstein, who teaches both physics and womens studies at the University of New Hampshire, fears the telescopes Dec. 18 scheduled launch is arriving under a cloud. And not the dazzling ne… [+10133 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Popular theory of Native American origins debunked by genetics and skeletal biology: Latest scientific findings suggest the ancestral Native American population does not originate in Japan, as believed by many archeologists - Science Daily", "description": "A widely accepted theory of Native American origins coming from Japan has been attacked in a new scientific study, which shows that the genetics and skeletal biology 'simply does not match-up.'", "url": "https://www.sciencedaily.com/releases/2021/10/211013081606.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-10-13T13:51:01Z", "content": "A widely accepted theory of Native American origins coming from Japan has been attacked in a new scientific study, which shows that the genetics and skeletal biology \"simply does not match-up.\"The fi… [+5201 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Erika Edwards, Lauren Dunn, Hallie Jackson", "title": "New FDA guidance aims to drastically cut salt in food supply - NBC News", "description": "The FDA is asking is food manufacturers and restaurants to cut salt in foods, with the goal of lowering American's salt intake by 12 percent in the next 2.5 years.", "url": "https://www.nbcnews.com/health/health-news/new-fda-guidance-aims-drastically-cut-salt-food-supply-rcna2844", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2021-10/211013-sauce-production-line-al-0828-50532f.jpg", "publishedAt": "2021-10-13T12:18:23Z", "content": "The Food and Drug Administration is asking food manufacturers and restaurants to cut the salt in their products over the coming 2½ years, hoping to reduce Americans' overall sodium intake by 12 perce… [+5712 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Jenni Smith", "title": "Vaccine reduces transmission in the family, a high-risk environment for covid, says study - Play Crazy Game", "description": "posted on 10/12/2021 20:21 (credit: MARIO TAMA / GETTY IMAGES NORTH AMERICA / Getty Images via AFP) A study carried out at the University of Umeå, Sweden, shows that the increase in vaccinated family members contributes to reducing the transmission of covid-1…", "url": "https://playcrazygame.com/2021/10/13/vaccine-reduces-transmission-in-the-family-a-high-risk-environment-for-covid-says-study/", "urlToImage": "https://midias.correiobraziliense.com.br/_midias/jpg/2021/07/15/675x450/1_testes_covid_-6759736.jpg", "publishedAt": "2021-10-13T01:02:45Z", "content": "posted on 10/12/2021 20:21\r\n(credit: MARIO TAMA / GETTY IMAGES NORTH AMERICA / Getty Images via AFP)\r\nA study carried out at the University of Umeå, Sweden, shows that the increase in vaccinated fami… [+1907 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "This drone robot created by an American lab could be Iron Man's distant cousin - The Star Online", "description": "Researchers at the California Institute of Technology (Caltech) have developed an amazing bipedal robot that can walk as well as fly.", "url": "https://www.thestar.com.my/tech/tech-news/2021/10/13/this-drone-robot-created-by-an-american-lab-could-be-iron-mans-distant-cousin", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/12/1328929.jpg", "publishedAt": "2021-10-13T00:00:00Z", "content": "Researchers at the California Institute of Technology (Caltech) have developed an amazing bipedal robot that can walk as well as fly. It may not look like Iron Man, but its agility is reminiscent of … [+1714 chars]"}, {"source": {"id": null, "name": "The Texas Tribune"}, "author": "Mitchell Ferman", "title": "Texas businesses face conflicting COVID-19 vaccine rules from state, feds - The Texas Tribune", "description": "American Airlines and Southwest Airlines say they will continue requiring employee vaccinations despite Abbott's new order, which has left federal government contractors, nursing homes and other companies caught between conflicting rules from t...", "url": "https://www.texastribune.org/2021/10/12/texas-businesses-vaccine-requirements-greg-abbott/", "urlToImage": "https://thumbnails.texastribune.org/RDRoHfKGglpmHZrefl_Na9Eqxi0=/1200x630/filters:quality(95)/static.texastribune.org/media/files/3d6d518c0cd37d5ce8389eddc5ba4130/HISD%20COVID%20Vaccine%20MYL%20TT%2022.jpeg", "publishedAt": "2021-10-12T21:33:22Z", "content": "Sign up for The Brief, our daily newsletter that keeps readers up to speed on the most essential Texas news.\r\nCompanies doing business in Texas now face new and complicated challenges after Gov. Greg… [+7559 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Sivaa Tangai Raju", "title": "American mother reveals toddler accidentally broadcasted her showering on Instagram Live - Malay Mail", "description": "KUALA LUMPUR, Oct 12 — An embarrassed mother went viral on TikTok after she recounted how her daughter unintentionally broadcast her “live” on Instagram while she was showering. According to the New York Post, the American woman identified as Brianna gave her…", "url": "https://www.malaymail.com/news/life/2021/10/12/american-mother-reveals-toddler-accidentally-broadcasted-her-showering-on-i/2012770", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-10/1210_IMG_20211012_150408-seo.jpg", "publishedAt": "2021-10-12T07:56:58Z", "content": "Mother explained the fallout from her daughter's unintended Instagram Live broadcast while she was showering. Picture via Bri.anna89 TikTok Account\r\nKUALA LUMPUR, Oct 12 An embarrassed mother went vi… [+2002 chars]"}]}