{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Gamereactor.no"}, "author": "Eirik Hyldbakk Furu", "title": "Marvel avslører fase 5 av MCU - Gamereactor Norge", "description": "Black Panther: Wakanda Forever og She-Hulk avslutter fjerde fase. Deretter får vi Secret Invasion, Echo, The Marvels, Blade, Ironheart, Agatha, Thunderbolts, Daredevil og mer fra både Ant-Man Guardians of the Galaxy og Captain America.", "url": "https://www.gamereactor.no/marvel-avslorer-fase-5-av-mcu-1106313/", "urlToImage": "https://www.gamereactor.no/media/52/_3595223b.jpg", "publishedAt": "2022-07-24T01:20:52Z", "content": "Det var aldri noen som helst tvil om at Disney ville ha mye å si om Marvel på San Diego Comic-Con, men få hadde turt å håpe på såpass mye.\r\nFor selskapet bestemte seg for å annonsere at She-Hulk: Att… [+1251 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "eclipse01", "title": "TXT Tops iTunes Charts All Over The World With New iann dior Collab “Valley Of Lies” - soompi", "description": "TXT’s new collaboration with iann dior is making a splash on the international music charts! On July 22, TXT released the new song “Valley of Lies” featuring multi-platinum American artist iann dior. Soon afterwards, the song shot to the top of iTunes in vari…", "url": "https://www.soompi.com/article/1537500wpp/txt-tops-itunes-charts-all-over-the-world-with-new-iann-dior-collab-valley-of-lies", "urlToImage": "https://6.viki.io/image/2731a6b106e5431aa7c327983bb8d0de/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-07-24T00:59:54Z", "content": "TXTs new collaboration with iann dior is making a splash on the international music charts!\r\nOn July 22, TXT released the new song Valley of Lies featuring multi-platinum American artist iann dior. S… [+647 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Fox News", "title": "Polio live oral vaccine: Here's why the US stopped using it years ago - New York Post ", "description": "The new case raises the issue of polio vaccinations — and what Americans should know to protect their health.", "url": "https://nypost.com/2022/07/23/polio-live-oral-vaccine-heres-why-the-us-stopped-using-it-years-ago/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/07/AFGHANISTAN_HEALTH_POLIO_VACCINAT_ION-e1658611818205.jpeg?quality=75&strip=all&w=1024", "publishedAt": "2022-07-24T00:16:00Z", "content": "An unvaccinated Rockland County, N.Y., resident exposed to an individual who received an oral poliovirus vaccine contracted the neurological disease and is now paralyzed, according to Rockland County… [+8096 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "Thousands of Americans ordered to flee homes due to 'explosive' Yosemite wildfire - Sky News", "description": "", "url": "https://news.sky.com/story/thousands-of-americans-ordered-to-flee-homes-due-to-explosive-yosemite-wildfire-12657950", "urlToImage": "https://e3.365dm.com/22/07/1600x900/skynews-yosemite-california_5843886.jpg?20220723221537", "publishedAt": "2022-07-23T21:32:05Z", "content": "Thousands of people have been ordered to flee their homes and businesses near a fast-moving wildfire near Yosemite National Park on Saturday.\r\nThe bush fire which started on Friday afternoon has now … [+2212 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Russian tank attack in eastern Ukraine kills 2 Americans, Canadian and Swede - POLITICO", "description": "U.S. citizens Luke “Skywalker” Lucyszyn and Bryan Young were killed when they were ambushed during a special operation in eastern Ukraine, their commander said.", "url": "https://www.politico.com/news/2022/07/23/americans-killed-russian-tank-attack-00047567", "urlToImage": "https://static.politico.com/03/f9/e46d5daa41e1beb268e88fdbc30e/https-delivery.gettyimages.com/downloads/1239284532", "publishedAt": "2022-07-23T17:37:18Z", "content": "In an attempt to slow Russias advance, the foreign fighters were deployed to the village of Hryhorivka, two miles northwest of the Siversk. There, Miroshnichenko said, they guys were tasked to take t… [+6457 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "Flex Automotive make the ultimate retro-inspired Toyota Land Cruisers - Carmag South Africa", "description": "Japanese SUV retrofitter Flex Automotive, who offers conversions of Toyota Land Cruisers with a nostalgic twist have now branched out into America and intend on promoting a novel culture for enthusiasts on the new continent.", "url": "https://www.carmag.co.za/news/industry-news/flex-automotive-toyota-land-cruisers/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/07/TF-1.jpg", "publishedAt": "2022-07-23T02:59:07Z", "content": "ToyotaLand Cruiser 200Japanese SUV retrofitter Flex Automotive, who offers conversions of Toyota Land Cruisers with a nostalgic twist have now branched out into America and intend on promoting a nove… [+2166 chars]"}, {"source": {"id": null, "name": "WANE"}, "author": "Matt Adams", "title": "Hear a boom? See a bright light overnight? Here’s what happened - WANE", "description": "Some viewers reported hearing a boom. Others remembered seeing a bright light. What was it that some people heard and saw in Indiana and surrounding states overnight? The American Meteor Society, a nonprofit organization dedicated to observing the skies, rece…", "url": "https://www.wane.com/news/indiana/hear-a-boom-see-a-bright-light-overnight-heres-what-happened/", "urlToImage": "https://www.wane.com/wp-content/uploads/sites/21/2022/07/fireball.jpg?w=1280", "publishedAt": "2022-07-22T18:13:06Z", "content": "Some viewers reported hearing a boom. Others remembered seeing a bright light.\r\nWhat was it that some people heard and saw in Indiana and surrounding states overnight?\r\nThe American Meteor Society, a… [+1494 chars]"}, {"source": {"id": null, "name": "Geelong Advertiser"}, "author": "", "title": "Glowing Object Streaks Across Night Sky as Dozens of Fireball Sightings Reported - Geelong Advertiser", "description": "Dozens of residents across several US states reported spotting a possible fireball in the early hours of Friday, July 22, according to the American Meteor Society. Footage captured by Mandy Hensley’s security camera shows a bright object glowing as it streaks…", "url": "https://www.geelongadvertiser.com.au/news/national/glowing-object-streaks-across-night-sky-as-dozens-of-fireball-sightings-reported/video/b187ade23b149f209db39fbfd66fc177", "urlToImage": null, "publishedAt": "2022-07-22T16:00:44Z", "content": "Dozens of residents across several US states reported spotting a possible fireball in the early hours of Friday, July 22, according to the American Meteor Society. Footage captured by Mandy Hensley’s… [+407 chars]"}]}