{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Tucker  Reals, Lilia  Luciano", "title": "Inside the very tense, very wet secret mission to get María Corina Machado out of Venezuela - CBS News", "description": "An American special forces veteran led the operation to get María Corina Machado out of Venezuela: \"The first Nobel Prize winner that we've ever rescued.\"", "url": "https://www.cbsnews.com/news/secret-mission-maria-corina-machado-out-of-venezuela/", "urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/12/11/f51198dc-2b37-4687-bb6c-b49f06816007/thumbnail/1200x630g2/020cdbff685f8c4ba762766df613f77a/gettyimages-2251358990.jpg", "publishedAt": "2025-12-11T15:28:00Z", "content": "It took an American private rescue team 15 to 16 hours to get Venezuelan opposition leader María Corina Machado out of her country and safely on her way to Norway to collect her Nobel Peace Prize, an… [+6793 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Sambit Saha", "title": "Tiiny AI Pocket Lab: Mini PC with 12-core ARM CPU and 80 GB LPDDR5X memory unveiled ahead of CES - Notebookcheck", "description": "Tiiny AI is an American startup that has introduced a brand-new mini PC with one goal - putting large LLMs in user's pockets. The impressively tiny Pocket Lab mini PC packs a 12-core ARM CPU along with an NPU that is capable of up to 160 TOPS of compute power…", "url": "https://www.notebookcheck.net/Tiiny-AI-Pocket-Lab-Mini-PC-with-12-core-ARM-CPU-and-80-GB-LPDDR5X-memory-unveiled-ahead-of-CES.1182794.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/tiiny_ai_pocket_lab_mini_pc_ai_arm_unveiled.jpg", "publishedAt": "2025-12-11T01:05:00Z", "content": "Tiiny Lab is a US-based startup that appears to specialize in hardware designed for personal LLMs. Their latest product marks their foray into the territory of mini PCs, dubbed the Pocket Lab. The ap… [+1251 chars]"}]}