{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": null, "title": "Tyson Fury v Deontay Wilder III: Malik Scott aims to help American regain world heavyweight title - BBC Sport", "description": "From being knocked out by him in 2014, Malik Scott is now helping Deontay Wilder try to regain his WBC world heavyweight title.", "url": "https://www.bbc.co.uk/sport/boxing/58701349", "urlToImage": "https://ichef.bbci.co.uk/live-experience/cps/624/cpsprodpb/2B96/production/_120885111_wilderandscott.jpg", "publishedAt": "2021-10-07T09:21:43Z", "content": "Tyson Fury has never seen this Deontay Willder before - trainer Scott\r\n<table><tr><th>Fury v Wilder III</th></tr>\r\n<tr><td>Venue: T-Mobile Arena, Las Vegas. Date: Saturday, 9 October (approx 04:00 BS… [+5077 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Extinct ground sloth likely ate meat with its veggies - Phys.org", "description": "A new study led by researchers at the American Museum of Natural History suggests that Mylodon—a ground sloth that lived in South America until about 10,000 to 12,000 years ago—was not a strict vegetarian like all of its living relatives. Based on a chemical …", "url": "https://phys.org/news/2021-10-extinct-ground-sloth-ate-meat.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/extinct-ground-sloth-l.jpg", "publishedAt": "2021-10-07T09:00:01Z", "content": "A new study led by researchers at the American Museum of Natural History suggests that Mylodona ground sloth that lived in South America until about 10,000 to 12,000 years agowas not a strict vegetar… [+5306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Covid-19 booster shots have outpaced the US rate of new vaccinations. And the millions still unvaccinated could trigger 'future waves,' expert warns - CNN", "description": "The US is making headway in its battle against Covid-19 -- with infection and hospitalization rates on the decline after a surge fueled by the relentless Delta variant. But with the number of Americans getting booster shots surpassing those who are initiating…", "url": "https://www.cnn.com/2021/10/07/health/us-coronavirus-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211007001507-pfizer-booster-100121-california-super-tease.jpg", "publishedAt": "2021-10-07T08:53:00Z", "content": "(CNN)The US is making headway in its battle against Covid-19 -- with infection and hospitalization rates on the decline after a surge fueled by the relentless Delta variant. But with the number of Am… [+6771 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Health News Roundup: COVID-19 infections dropping throughout the Americas, more vaccine needed, says health agency; WHO backs malaria vaccine rollout for Africa's children in major breakthrough and more - Devdiscourse", "description": "It was the first instance of a regulatory agency pledging to look into misdeeds at Prevent Senior, a major healthcare chain serving tens of thousands of patients in the Sao Paulo area.  Booster shot improves immune response of chemotherapy patients; post-COVI…", "url": "https://www.devdiscourse.com/article/health/1758987-health-news-roundup-covid-19-infections-dropping-throughout-the-americas-more-vaccine-needed-says-health-agency-who-backs", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_09_2021_12_33_54_3812897.jpg?width=920&format=jpeg", "publishedAt": "2021-10-07T05:00:05Z", "content": "Following is a summary of current health news briefs.\r\nCOVID-19 infections dropping throughout the Americas, more vaccine needed, says health agency\r\nThe number of new COVID-19 infections has been dr… [+5047 chars]"}]}