{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, Ariel Edwards-Levy", "title": "CNN Poll: Trump’s approval at 100 days lower than any president in at least seven decades - CNN", "description": "As the 100-day mark of Trump’s presidency approaches, Americans’ views of what he’s done so far have turned deeply negative, a new CNN poll conducted by SSRS finds.", "url": "https://www.cnn.com/2025/04/27/politics/approval-rating-trump-100-days/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2211272596.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-27T12:00:00Z", "content": "Donald Trump won back the Oval Office and took charge of the government amid the strongest poll numbers of his political career, but as the 100-day mark of his presidency approaches, Americans views … [+7473 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Shein Hikes US Prices as Much as 377% Ahead of Tariff Increases - Bloomberg.com", "description": "Fast-fashion giant Shein Group Ltd. raised US prices of its products from dresses to kitchenware ahead of imminent tariffs on small parcels, in an early sign of the potential effect of the trade war on American consumers.", "url": "https://www.bloomberg.com/news/articles/2025-04-27/shein-hikes-us-prices-as-much-as-377-ahead-of-tariff-increases", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iNRq.t0B3qnY/v1/1200x899.jpg", "publishedAt": "2025-04-27T09:01:23Z", "content": "Supply Lines is a daily newsletter that tracks global trade. Sign up here.\r\nFast-fashion giant Shein Group Ltd. raised US prices of its products from dresses to kitchenware ahead of imminent tariffs … [+97 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Srinivas Mazumdaru", "title": "US: ICE deports 3 American children, say lawyers - DW", "description": "Immigration officials in the United States have in recent days deported three children aged 2, 4 and 7 who are US citizens along with their Honduran-born mothers, their lawyers said.", "url": "https://www.dw.com/en/us-ice-deports-3-american-children-say-lawyers/a-72366567", "urlToImage": "https://static.dw.com/image/71983158_6.jpg", "publishedAt": "2025-04-27T04:44:20Z", "content": "US Immigration and Customs Enforcement (ICE) agents have deported three American children aged 2, 4 and 7 along with their undocumented immigrant mothers, their lawyers said on Saturday.\r\nThe deporta… [+2605 chars]"}]}