{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez and Drew Kann, CNN", "title": "New York City was never built to withstand a deluge like the one Ida delivered. It showed. - CNN", "description": "From the heatwaves in the Pacific Northwest to the damage strewn from Louisiana to the Northeast by Ida, the floods are just the latest example of how ill-prepared America is for what climate change has in store.", "url": "https://www.cnn.com/2021/09/05/us/new-york-infrastructure-climate-change/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210903172805-02-ny-storm-aftermath-super-tease.jpg", "publishedAt": "2021-09-05T11:46:00Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brie Stimson", "title": "Taliban is ‘hunting Americans,’ says California mom-to-be left behind in Afghanistan - Fox News", "description": "A pregnant woman named Nasria, a California native, flew to Afghanistan in June to visit family and get married. As of early September, she remained one of the estimated 100 to 200 Americans left behind in the chaotic withdrawal of U.S. forces, according to a…", "url": "https://www.foxnews.com/politics/taliban-hunting-americans-california-afghanistan", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/taliban-thumb.png", "publishedAt": "2021-09-05T06:08:50Z", "content": "A pregnant woman named Nasria, a California native, flew to Afghanistan in June to visit family and get married. As of early September, she remained one of the estimated 100 to 200 Americans left beh… [+3696 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Zeke Miller", "title": "U.S. COVID-19 booster shot plan faces complications, some may miss Sept. 20 - CP24 Toronto's Breaking News", "description": "President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the availability of third doses for those who received the Moderna vaccine, administ…", "url": "https://www.cp24.com/world/u-s-covid-19-booster-shot-plan-faces-complications-some-may-miss-sept-20-1.5573028", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5573030.1630703331!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-03T21:10:04Z", "content": "WASHINGTON (AP) - President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the av… [+4245 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "Solar wave could bring down internet in the world on Monday (6) | Viral | Online Diary - Play Crazy Game", "description": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal mass ejections. According to SpaceWeather.com, a kind of “so…", "url": "https://playcrazygame.com/2021/09/03/solar-wave-could-bring-down-internet-in-the-world-on-monday-6-viral-online-diary/", "urlToImage": "https://cdn.dol.com.br/img/inline/670000/auroraboreal_00670554_0_.jpg?xid=1601192", "publishedAt": "2021-09-03T16:48:51Z", "content": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal … [+3604 chars]"}]}