{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Omicron, return of travel bans dampen oil future, air travel - Guardian Nigeria", "description": "With travel restrictions being reinstated against a number of countries in southern Africa by the United Kingdom, United States of America", "url": "https://guardian.ng/news/omicron-return-of-travel-bans-dampen-oil-future-air-travel/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/11/000_9TH2M2-scaled.jpg", "publishedAt": "2021-11-29T03:54:00Z", "content": "With travel restrictions being reinstated against a number of countries in southern Africa by the United Kingdom, United States of America and Singapore, among others, as well as the European Union (… [+12806 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Kieran Lynch", "title": "Harry Kane makes classy gesture to Tottenham fans travelling from US after Burnley game postponed - Daily Mail", "description": "The Premier League clash at Turf Moor was called off a little under an hour before kick-off due to heavy snow. An American pair detailed their 31 hour trip from Dallas to watch Tottenham play Burnley.", "url": "https://www.dailymail.co.uk/sport/football/article-10252527/Harry-Kane-makes-classy-gesture-Tottenham-fans-travelling-Burnley-game-postponed.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/29/00/51080207-0-image-a-13_1638144845767.jpg", "publishedAt": "2021-11-28T23:58:07Z", "content": "Harry Kane has invited two United States-based Tottenham fans to be his guest at a future game, after they travelled 31 hours to watch the club only for their match with Burnley to be postponed.\r\nThe… [+2550 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Phelim Kine, Gavin Bade", "title": "China blowback looms for Schumer’s Innovation and Competition Act - Politico", "description": "Beijing warns that U.S. tech and competitiveness legislation will “gravely damage America's own interests.”", "url": "https://www.politico.com/news/2021/11/28/china-schumers-innovation-and-competition-act-523414", "urlToImage": "https://static.politico.com/86/0e/3194995c4ed68f0c1cd6b37d0c6c/211128-chuck-schumer-ap773.jpg", "publishedAt": "2021-11-28T23:37:44Z", "content": "Beijing has promised retaliation if the bill makes it through Congress but has not given specifics. China experts say those reprisals may include deliberate disruptions in imported parts supplies for… [+7660 chars]"}]}