{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Alan Rappeport", "title": "U.S. National Debt Tops $30 Trillion as Borrowing Surged Amid Pandemic - The New York Times", "description": "The record red ink, fueled by spending to combat the coronavirus, comes as interest rates are expected to rise, which could add to America’s costs.", "url": "https://www.nytimes.com/2022/02/01/us/politics/national-debt-30-trillion.html", "urlToImage": "https://static01.nyt.com/images/2022/02/01/business/00dc-debt1/00dc-debt1-facebookJumbo.jpg", "publishedAt": "2022-02-01T22:19:06Z", "content": "The Fed has also been keeping long-term interest rates low by buying government-backed debt and holding those securities on its balance sheet. Those purchases are set to wrap up next month, and last … [+2808 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Michael Miller", "title": "Did comet's fiery destruction lead to downfall of ancient Hopewell? - Phys.org", "description": "The rapid decline of the Hopewell culture about 1,500 years ago might be explained by falling debris from a near-Earth comet that created a devastating explosion over North America, laying waste to forests and Native American villages alike.", "url": "https://phys.org/news/2022-02-comet-fiery-destruction-downfall-ancient.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/did-comets-fiery-destr.jpg", "publishedAt": "2022-02-01T21:03:39Z", "content": "The rapid decline of the Hopewell culture about 1,500 years ago might be explained by falling debris from a near-Earth comet that created a devastating explosion over North America, laying waste to f… [+6058 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Perri Blumberg", "title": "These are the best foods for your heart, experts say - Fox News", "description": "For American Heart Month, Fox News Digital is highlighting some foods that are especially good for your heart.", "url": "https://www.foxnews.com/food-drink/best-foods-heart-health-experts", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/09/51fcf42b-iStock-salmon.jpg", "publishedAt": "2022-02-01T14:37:31Z", "content": "February is American Heart Month. Of course, Its a good idea to eat a nutrient-dense diet year-round, but this month, Fox News Digital is highlighting some foods that are especially a boon for your c… [+8673 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Heart attack symptoms in women look different; American Heart Association: part 2 - ABC 7 Chicago", "description": "Heart attack symptoms in women look different; the American Heart Association and Go Red for Women want to spread awareness. READ MORE: https://abc7.ws/3Gd71pq", "url": "https://www.youtube.com/watch?v=1wdXU0UL1f8", "urlToImage": "https://i.ytimg.com/vi/1wdXU0UL1f8/maxresdefault.jpg", "publishedAt": "2022-02-01T03:00:01Z", "content": null}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Matthew Perrone", "title": "US gives full approval to Moderna's COVID-19 vaccine - CP24 Toronto's Breaking News", "description": "U.S. health regulators on Monday granted full approval to Moderna's COVID-19 vaccine, a shot that's already been given to tens of millions of Americans since its emergency authorization over a year ago.", "url": "https://www.cp24.com/world/us-gives-full-approval-to-moderna-s-covid-19-vaccine-1.5762100", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5762102.1643672689!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-01-31T23:45:47Z", "content": "WASHINGTON (AP) - U.S. health regulators on Monday granted full approval to Moderna's COVID-19 vaccine, a shot that's already been given to tens of millions of Americans since its emergency authoriza… [+2748 chars]"}]}