{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Sesona Ngqakamba", "title": "Don't use ivermectin to treat Covid-19 - Sahpra says its stance is aligned with the US' FDA - News24", "description": "The South African Health Products Regulatory Authority has once again warned the public against the use of ivermectin, saying it remains aligned to America's FDA when it comes to the use of the drug.", "url": "https://www.news24.com/news24/southafrica/news/dont-use-it-sahpra-says-its-stance-on-ivermectin-is-aligned-with-the-us-fda-20210903", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11148/4ee769e04a9e4101837dfd746405aa28.jpg", "publishedAt": "2021-09-03T11:43:15Z", "content": "<ul><li>Sahpra says it remains aligned to America's Food and Drug Administration (FDA) when it comes to the use of ivermectin.</li><li>The authority has warned people to refrain from buying drugs fro… [+2127 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "siteadmin", "title": "Lawless Nigeria's Secret Police Prevented Nnamdi Kanu's American Counsel, Others From Seeing Him—IPOB Lawyer - SaharaReporters.com", "description": "They were prevented from seeing the separatist leader despite meeting formal notification and existing procedures on visitation.", "url": "http://saharareporters.com/2021/09/03/lawless-nigeria%E2%80%99s-secret-police-prevented-nnamdi-kanu%E2%80%99s-american-counsel-others-seeing", "urlToImage": null, "publishedAt": "2021-09-03T08:21:02Z", "content": "The court-ordered routine visit of the lawyers representing the leader of the Indigenous People of Biafra (IPOB), Nnamdi Kanu took another dimension as the operatives of the Department of State Servi… [+2723 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "British Islamic State 'Beatle' pleads guilty to torturing and beheading American hostages - ABC News", "description": "London-born Kotey admits he played a leadership role in an Islamic State scheme to torture, hold for ransom and eventually behead American hostages.", "url": "https://www.abc.net.au/news/2021-09-03/islamic-state-beatle-guilty-of-torture-us-hostages/100432678", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/a3838eabbad0a19f5eb314f0743f2879?impolicy=wcms_crop_resize&cropH=456&cropW=810&xPos=0&yPos=155&width=862&height=485", "publishedAt": "2021-09-03T07:35:26Z", "content": "A British-born man who was a member of a team of Islamic State militants in Syria nicknamed \"The Beatles\" has admitted he played a leadership role in a scheme to torture, hold for ransom and eventual… [+3145 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Thomas Barrabi", "title": "ISIS 'Beatles' member pleads guilty, faces life in prison - Fox News", "description": "Alexanda Kotey, a member of the British ISIS terrorist cell known as the “Beatles,” plead guilty in a Virginia federal court on Thursday to various charges related to his role in the kidnapping and eventual murder of four Americans and other foreign nationals…", "url": "https://www.foxnews.com/politics/isis-beatles-member-pleads-guilty-life-prison", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/10/ISIS-beatles.jpg", "publishedAt": "2021-09-03T01:04:37Z", "content": "Alexanda Kotey, a member of the British ISIS terrorist cell known as the \"Beatles,\" pleaded guilty in a Virginia federal court on Thursday to various charges related to his role in the kidnapping and… [+3131 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Canadians Andreescu, Shapovalov advance to third round at US Open - Sportsnet.ca", "description": "Canada's Bianca Andreescu has advanced to the third round at the 2021 US Open with a straight-set 6-4, 6-4 win over American Lauren Davis.", "url": "https://www.sportsnet.ca/tennis/article/andreescu-advances-third-round-us-open-win-davis/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2021/09/Bianca-Andreescu-1040x572.jpg", "publishedAt": "2021-09-03T00:47:00Z", "content": "NEW YORK -- Bianca Andreescu is into the third round at the U.S. Open.\r\nThe sixth-seeded Canadian downed American Lauren Davis, 6-4, 6-4 on Thursday, and remains undefeated at the Grand Slam followin… [+1620 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Sara Boboltz", "title": "3 Major Medical Groups To America: Stop Eating Horse Paste - Yahoo Singapore News", "description": "Ivermectin should not be used for treating or preventing COVID-19, the American Medical Association said alongside two other professional organizations.", "url": "https://sg.news.yahoo.com/3-major-medical-groups-america-213251570.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/i59O4IeL_sS22RYlmoX9pQ--~B/aD02MDA7dz0xMjAwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_huffington_post_584/6d76e43629d218b5709bfa0ab170970d", "publishedAt": "2021-09-02T21:36:19Z", "content": "Three major American medical groups would like everyone to please stop taking ivermectin, a drug often used for deworming livestock, in an attempt to prevent symptoms of COVID-19.\r\nThe American Medic… [+2486 chars]"}, {"source": {"id": null, "name": "Sicklecellanemianews.com"}, "author": "Teresa Carvalho", "title": "Sickle Cell Disease Clinical Trials Network Has Its First Research Sites - Sickle Cell Anemia News", "description": "Several clinical research sites seeking to find new treatments for people with sickle cell disease (SCD) are joining a collaborative network created by the American Society of Hematology Research Collaborative (ASH RC). The initiative, called ASH RC Sickle Ce…", "url": "https://sicklecellanemianews.com/2021/09/02/sickle-cell-disease-clinical-trials-network-first-research-sites/", "urlToImage": "https://sicklecellanemianews.com/wp-content/uploads/2021/08/Handsin.png", "publishedAt": "2021-09-02T15:48:40Z", "content": "Several clinical research sites seeking to find new treatments for people with sickle cell disease (SCD) are joining a collaborative network created by the American Society of Hematology Research Col… [+2629 chars]"}, {"source": {"id": null, "name": "One America News Network"}, "author": null, "title": "Life insurers shift to pre-pandemic norms after COVID vaccine roll-outs - One America News Network", "description": "By Carolyn Cohn and Noor Zainab Hussain LONDON (Reuters) - The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with underlying health", "url": "https://www.oann.com/life-insurers-shift-to-pre-pandemic-norms-after-covid-vaccine-roll-outs/", "urlToImage": "https://dzm0ugdauank9.cloudfront.net/wp-content/uploads/2021/09/2021-09-02T135113Z_2_LYNXMPEH810OX_RTROPTP_0_HEALTH-CORONAVIRUS-FRANCE_1.jpg", "publishedAt": "2021-09-02T14:32:09Z", "content": "September 3, 2021\r\nBy Carolyn Cohn and Noor Zainab Hussain\r\nLONDON (Reuters) – The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with under… [+4997 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "David Shepardson", "title": "GM to cut North American production, citing chip shortage - CTV News", "description": "General Motors will reduce production at most North American assembly plants this month because of the ongoing semiconductor chip shortage.", "url": "https://www.ctvnews.ca/autos/gm-to-cut-north-american-production-citing-chip-shortage-1.5570865", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.3629952.1630591649!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T14:07:55Z", "content": "WASHINGTON -- \r\nGeneral Motors will reduce production at most North American assembly plants this month because of the ongoing semiconductor chip shortage, hitting its profitable truck and sport util… [+1556 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Travis Caldwell", "title": "More than 500000 U.S. children tested positive for COVID-19 in 3 weeks - CTV News", "description": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not yet eligible to receive vaccinations.", "url": "https://www.ctvnews.ca/health/coronavirus/more-than-500-000-u-s-children-tested-positive-for-covid-19-in-3-weeks-1.5570853", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5570872.1630590742!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T13:54:40Z", "content": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not y… [+7020 chars]"}]}