{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Crystal Tse, Dinesh Nair, Thomas Biesheuvel, Thomas Seal", "title": "Anglo American Near Deal to Acquire Teck Resources - Bloomberg.com", "description": "Anglo American Plc is nearing a deal to acquire Canada’s Teck Resources Ltd. in what could be the biggest mining deal in more than a decade — and just over a year since Anglo was subject to a takeover bid itself.", "url": "https://www.bloomberg.com/news/articles/2025-09-08/anglo-american-is-said-to-near-deal-to-acquire-teck-resources", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iVru6gMHTBbA/v0/1200x800.jpg", "publishedAt": "2025-09-08T23:50:31Z", "content": "Anglo American Plc is nearing a deal to acquire Canadas Teck Resources Ltd. in what could be the biggest mining deal in more than a decade and just over a year since Anglo was subject to a takeover b… [+341 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Attorney says detained Korean Hyundai workers had special skills for short-term jobs - PBS", "description": "An immigration attorney says many South Korean workers detained in a U.S. immigration raid at a Hyundai plant in Georgia were brought in for highly specialized work that Americans aren't trained to perform.", "url": "https://www.pbs.org/newshour/nation/attorney-says-detained-korean-hyundai-workers-had-special-skills-for-short-term-jobs", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2025/09/AP25249755386170-1024x683.jpg", "publishedAt": "2025-09-08T22:47:38Z", "content": "SAVANNAH, Ga. (AP) A lawyer for several workers detained at a Hyundai factory in Georgia says many of the South Koreans rounded up in the immigration raid are engineers and equipment installers broug… [+6974 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "'Blood moon' gallery: Stunning snaps from last night's total lunar eclipse - Live Science", "description": "A \"blood moon\" hovered above parts of the globe last night. And while North America missed out, we've rounded up some of the best photographs of September 2025's total lunar eclipse.", "url": "https://www.livescience.com/space/the-moon/blood-moon-gallery-stunning-snaps-from-last-nights-total-lunar-eclipse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9LgdtNG5YGobkphJDuBXgJ.jpg", "publishedAt": "2025-09-08T15:28:18Z", "content": "A lunar eclipse can give the moon a red hue, which is why it's called a \"blood moon.\" Here it is photographed with double exposure above Jiujiang, China. (Image credit: Photo by Shen Junfeng/VCG via … [+3316 chars]"}]}