{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Chris Gardner, Danielle Directo-Meston", "title": "Sydney Sweeney Just Had the Biggest Controversy of Her Career. Now What? - The Hollywood Reporter", "description": "Experts weigh in on where the 27-year-old actress goes after being at the center of the storm involving an American Eagle jeans campaign that had everyone from Donald Trump to Lizzo sharing hot takes.", "url": "http://www.hollywoodreporter.com/lifestyle/lifestyle-news/sydney-sweeney-american-eagle-jeans-campaign-controversy-1236344338/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2025/08/GettyImages-2219527959.jpg?crop=0px%2C75px%2C3656px%2C2046px&resize=1440%2C810", "publishedAt": "2025-08-15T19:01:31Z", "content": "‘Tis the season of Sydney Sweeney. It just now comes with an asterisk.\r\nThe two-time Emmy nominated actress, producer, Ford aficionado and booked-and-busy brand partner is revving up for the busiest … [+9499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "New blood pressure guidelines recommend an earlier start to treatment and skipping alcohol - Yahoo News Singapore", "description": "The next time you get your blood pressure checked, expect your medical provider to be a little more aggressive about high levels. And if you like a glass of wine with dinner or a cocktail on the weekends, brace yourself: New guidelines from the American Heart…", "url": "https://www.cnn.com/2025/08/14/health/blood-pressure-guidelines-wellness", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2190546030.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-08-15T03:25:00Z", "content": "The next time you get your blood pressure checked, expect your medical provider to be a bit more aggressive about high levels. And if you like a glass of wine with dinner or a cocktail on the weekend… [+5817 chars]"}]}