{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/kathleen-magramo\">Kathleen Magramo</a>, Deva Lee, Christian Edwards, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a> and <a href=\"/profiles/tori-powell\">Tori B. Powell</a>, CNN", "title": "Live updates: US launches strikes in Iraq and Syria as Israel-Hamas war rages - CNN", "description": "The US said it struck 85 targets linked to Iran-backed militias in Iraq and Syria on Friday in response to a drone strike in Jordan that killed three American soldiers. Follow for live updates.", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-02-02-24/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/240202161704-02-dle-use-pentagon-building-042123-super-tease.jpg", "publishedAt": "2024-02-03T00:11:00Z", "content": "The retaliation for a drone strike that killed three American soldiers in Jordan last weekend has begun: The US military launched major airstrikes on 85 targets in Iraq and Syria on Friday.\r\nThe Whit… [+2519 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "SEUNG MIN KIM", "title": "Hand over heart, Biden joins grieving families of US troops killed in Jordan as remains arrive home - The Associated Press", "description": "President Joe Biden and first lady Jill Biden joined grieving families at Dover Air Force Base for the dignified transfer of the three American service members killed in a drone attack in Jordan last weekend. During the 15-minute transfer, the president stood…", "url": "https://apnews.com/article/joe-biden-dignified-transfer-jordan-israel-hamas-war-c4b923a6a5178ecd3d3957d7aba7ff6f", "urlToImage": "https://dims.apnews.com/dims4/default/8ea4863/2147483647/strip/true/crop/4176x2349+0+218/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2b%2F1a%2Faaaa929d362784dfbf88e7829a86%2Fb67c3a04cc1c4d05ae3f350e2cdd768d", "publishedAt": "2024-02-02T23:13:00Z", "content": "DOVER AIR FORCE BASE, Del. (AP) Standing solemnly under gray skies, President Joe Biden and first lady Jill Biden joined grieving families at Dover Air Force Base on Friday to witness the return of t… [+7141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "From CNN's Alicia Wallace, Elisabeth Buchwald, Bryan Mena and Nicole Goodkind", "title": "Another shockingly good jobs report shows America's economy is booming - CNN", "description": "The US economy added a whopping 353,000 jobs last month, far more than the 176,500 jobs expected. It's yet another data point that underlines the country's economic strength, even in the face of 11 rate hikes from the Federal Reserve.", "url": "https://www.cnn.com/business/live-news/jobs-report-january-02-02-24/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230428162245-nyse-0426-super-tease.jpg", "publishedAt": "2024-02-02T22:20:00Z", "content": "While the leisure and hospitality industry added a mere 11,000 jobs in January, the critical service sector registered its 36th consecutive month of job gains. Post-pandemic, services businesses have… [+1215 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Tim Cook talks new Apple Vision Pro - Good Morning America", "description": "The CEO of Apple celebrates the long-awaited release of the wearable device and talks how it could change the way we interact with technology.SUBSCRIBE: http...", "url": "https://www.youtube.com/watch?v=Fd5wv3hrd3s", "urlToImage": "https://i.ytimg.com/vi/Fd5wv3hrd3s/maxresdefault.jpg", "publishedAt": "2024-02-02T16:50:00Z", "content": null}]}