{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Ruchi Kaushal", "title": "Pooja Batra on missing from films: ‘I have done lot of American shows, haven’t just been sitting and eating potatoes’ - Hindustan Times", "description": "In an interview with Hindustan Times, Pooja Batra talked about her various American shows and movies which have been keeping her busy for quite some time. She is now making a comeback with the film, Squad. | Bollywood", "url": "https://www.hindustantimes.com/entertainment/bollywood/pooja-batra-on-missing-from-films-i-have-done-lot-of-american-shows-haven-t-just-been-sitting-and-eating-potatoes-101636193417227.html", "urlToImage": "https://images.hindustantimes.com/img/2021/11/06/1600x900/pooja_batra_1636194709265_1636194735333.jpg", "publishedAt": "2021-11-07T01:35:57Z", "content": "Actor Pooja Batra is all set to make a comeback with the OTT release, Squad. The actor, who shot to fame with 1997 film Virasat, plays a Squadron Leader in the film that also marks the debut of actor… [+2393 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Kyle Morris", "title": "Biden appears to mock Americans' intelligence, questions whether 'they'd understand' supply chain issues - Fox News", "description": "President Biden questioned whether Americans would \"understand\" what he was talking about when discussing the ongoing supply chain crises in America.", "url": "https://www.foxnews.com/politics/biden-mock-americans-intelligence-questions-understand-supply-chain-issues", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/11/GettyImages-1236388798-e1636230948593.jpg", "publishedAt": "2021-11-06T20:53:44Z", "content": "President Biden appeared to mock the intelligence of the American people on Saturday when discussing the ongoing supply chain crises in America, questioning whether \"they'd understand\" the topic at h… [+2550 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Costa Rica issues COVID-19 vaccine requirement for children - The Star Online", "description": "SAN JOSE (Reuters) -     Costa Rican children aged five and up must get COVID-19 vaccinations, according to a new health ministry mandate, making the Central American country one of the first to adopt such a requirement for kids.", "url": "https://www.thestar.com.my/news/world/2021/11/07/costa-rica-issues-covid-19-vaccine-requirement-for-children", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/11/07/1358893.jpg", "publishedAt": "2021-11-06T19:13:00Z", "content": "SAN JOSE (Reuters) - Costa Rican children aged five and up must get COVID-19 vaccinations, according to a new health ministry mandate, making the Central American country one of the first to adopt su… [+940 chars]"}, {"source": {"id": null, "name": "Study Finds"}, "author": null, "title": "COVID vaccines: Half of unvaccinated Americans say NOTHING will change their minds - Study Finds", "description": "18 percent think COVID vaccinations are more dangerous than the virus itself.", "url": "https://www.studyfinds.org/covid-unvaccinated-americans/", "urlToImage": "https://www.studyfinds.org/wp-content/uploads/2020/07/AdobeStock_331786956-scaled.jpeg", "publishedAt": "2021-11-05T16:24:23Z", "content": "BARCELONA, Spain — Vaccine hesitancy is turning into a complete vaccine stalemate for many Americans. According to a new survey, half of U.S. adults who are still unwilling to get the coronavirus vac… [+2062 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BMPlus", "title": "Groups sue Tennessee over law against trans school athletes | BMPlus - Business Mirror", "description": "NASHVILLE, Tennessee — Two civil rights groups filed a federal court challenge Thursday against a Tennessee law that bars transgender athletes from playing public high school or middle school sports aligned with their gender identity. The American Civil Liber…", "url": "https://businessmirror.com.ph/2021/11/05/groups-sue-tennessee-over-law-against-trans-school-athletes/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/11/BusinessMirror-BM-lettermark.jpg", "publishedAt": "2021-11-05T11:02:00Z", "content": "NASHVILLE, Tennessee Two civil rights groups filed a federal court challenge Thursday against a Tennessee law that bars transgender athletes from playing public high school or middle school sports al… [+3488 chars]"}]}