{"articles": [{"author": "Science X staff", "content": "Whether parents prefer a conformance-oriented or independence-oriented supplemental education program for their children depends on political ideology, according to a study of more than 8,500 America… [+3882 chars]", "description": "Whether parents prefer a conformance-oriented or independence-oriented supplemental education program for their children depends on political ideology, according to a study of more than 8,500 American parents by a research team from Rice University and the Un…", "publishedAt": "2021-03-30T20:20:42Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Kumon or Montessori? It may depend on your politics, according to new study of 8,500 parents - Phys.org", "url": "https://phys.org/news/2021-03-kumon-montessori-politics-parents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/education.jpg"}, {"author": "Rachel Treisman", "content": "Cameron Hunt and his father, Calvin Hunt, hold signs of support on Tuesday outside the West 43rd Street apartment building in Manhattan where a man physically and verbally attacked a 65-year-old Asia… [+6220 chars]", "description": "Video of the assault, as well as the seeming inaction of apartment staff standing nearby, has drawn fury in and beyond New York. State and city authorities are investigating the attack.", "publishedAt": "2021-03-30T17:40:00Z", "source": {"id": null, "name": "NPR"}, "title": "Asian American Woman, 65, Attacked In Manhattan In Racist Assault - NPR", "url": "https://www.npr.org/2021/03/30/982745950/attack-on-asian-woman-in-manhattan-as-bystanders-watched-to-be-probed-as-hate-cr", "urlToImage": "https://media.npr.org/assets/img/2021/03/30/gettyimages-1309958809_wide-d7a43d5ce2c60a3714eb39374cf076f83c4687a4.jpg?s=1400"}, {"author": "Jackie Salo", "content": "CDC director Dr. Rochelle Walensky said in a new interview that she warned and terrified Americans of “impending doom” amid an uptick in COVID-19 cases because she “just can’t face another surge.”\r\n“… [+2142 chars]", "description": "CDC director Dr. Rochelle Walensky said in a new interview that she warned — and terrified — Americans of “impending doom” amid an uptick in COVID-19 cases because she “just can&#…", "publishedAt": "2021-03-30T17:23:00Z", "source": {"id": null, "name": "New York Post"}, "title": "CDC Director Rochelle Walensky says she 'can't face another' COVID surge - New York Post ", "url": "https://nypost.com/2021/03/30/cdc-director-rochelle-walensky-cant-face-another-covid-surge/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/03/covid-surge.jpg?quality=90&strip=all&w=1200"}, {"author": "Web  Desk", "content": "Following news of Prince Harry securing two jobs, it is thought that he is looking to keep up with his wife Meghan Markle.\r\nThe Duke of Sussex has been recruited as the Chief Impact Officer at Silico… [+953 chars]", "description": "Meghan Markle is more easily employable because of her American identity while Prince Harry is stirring up confusion", "publishedAt": "2021-03-30T14:44:00Z", "source": {"id": null, "name": "The News International"}, "title": "Prince Harry trying to be relevant in America after getting two jobs - The News International", "url": "https://www.thenews.com.pk/latest/812216-prince-harry-trying-to-be-relevant-in-america-after-getting-two-jobs", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2021-03-30/l_812216_074454_updates.jpg"}, {"author": "Reuters Staff", "content": "FILE PHOTO: A healthcare worker draws a dose from a vial during a coronavirus disease (COVID-19) community vaccination event, as the vaccination rate in West Virginia ranks among highest in world, in… [+1358 chars]", "description": "The percentage of U.S. Black adults who say they have either received a vaccine shot for COVID-19 or want one as soon as possible rose to 55% in March from 41% in February, a survey by the Kaiser Family Foundation (KFF) showed.", "publishedAt": "2021-03-30T09:11:00Z", "source": {"id": "reuters", "name": "Reuters"}, "title": "COVID-19 vaccine hesitancy among Black Americans drops: poll - Reuters", "url": "https://www.reuters.com/article/us-health-coronavirus-vaccine-hesitancy-idUSKBN2BM0WY", "urlToImage": "https://static.reuters.com/resources/r/?m=02&d=20210330&t=2&i=1556722840&r=LYNXMPEH2T0EI&w=800"}, {"author": "AFP", "content": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May duri… [+4774 chars]", "description": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May during an arrest on a minor charge.", "publishedAt": "2021-03-30T05:33:16Z", "source": {"id": null, "name": "EWN"}, "title": "Jury in George Floyd murder trial shown harrowing video of his death - Eyewitness News", "url": "https://ewn.co.za/2021/03/30/jury-in-george-floyd-murder-trial-shown-harrowing-video-of-his-death", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/yng9tpllm5leq4xsq2o7"}, {"author": "Kurt Lozano", "content": "(Photo: Thunder Predator)\r\nThe Group Stage of the ONE Esports Dota 2 Singapore Major started on Monday (29 March), with South American underdogs Thunder Predator coming out of nowhere to finish the f… [+6253 chars]", "description": "As the second-placed team of the traditionally weaker South American regional league, they were expected to struggle against the representatives from other...", "publishedAt": "2021-03-29T13:57:36Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Singapore Major Day 3 recap: Thunder Predator shred the opposition - Yahoo Singapore News", "url": "https://sg.news.yahoo.com/singapore-major-day-3-recap-thunder-predator-go-undefeated-135736808.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/dd1d8660-9082-11eb-abc3-c2abad2e01cd"}], "message": "Successful api call", "number_of_news": 7, "status": 200, "topic": "america"}