{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Glory Days: In Michigan, Nostalgia For A Romanticized Past Outstrips The Reality of An Economic Rebirth - POLITICO", "description": "Jobs are back, wages are up, but for a cross-section of America’s political bellwether state, distrust and dissatisfaction still reign supreme.", "url": "https://www.politico.com/news/2022/08/28/michigan-voters-distrust-democrats-00053769", "urlToImage": "https://static.politico.com/94/dd/9ab23d4644158a87a530e2b0deee/a1.Bade.MichiganEconomy-Lead.png", "publishedAt": "2022-08-28T11:00:00Z", "content": "Amid the economic upheaval, these workers said they found security in their union work, which they credited with pushing up pay for workers across the economy even if they were still struggling to me… [+5300 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": "Neil", "title": "AmCham not confident of FTA with PHL this year - BusinessWorld Online", "description": "A FREE trade agreement (FTA) between the Philippines and the US is unlikely before the midterm elections for the US Congress in November, the American Chamber of Commerce of the Philippines (AmCham) said.", "url": "https://www.bworldonline.com/economy/2022/08/28/471005/amcham-not-confident-of-fta-with-phl-this-year/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2022/08/AmCham-Logo.jpg", "publishedAt": "2022-08-28T10:21:16Z", "content": "A FREE trade agreement (FTA) between the Philippines and the US is unlikely before the midterm elections for the US Congress in November, the American Chamber of Commerce of the Philippines (AmCham) … [+3086 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Niall O'Connor", "title": "Irish Air Corps experts travel to US to share their helicopter experiences with American pilots - TheJournal.ie", "description": "The Irish Air Corps experts travelled to Wyoming in the US to advise the US 20th Air Force on the adoption of the Grey Wolf helicopter.", "url": "https://www.thejournal.ie/irish-air-corps-us-air-force-visit-grey-wolf-5850550-Aug2022/", "urlToImage": "https://img2.thejournal.ie/article/5850550/river/?height=400&version=5850740", "publishedAt": "2022-08-28T07:02:00Z", "content": "IRISH AIR CORPS personnel who work on the helicopter fleet have travelled to the US to help US Air Force crews adjust to a new aircraft. \r\nThe trip at the start of August saw three Air Corps experts … [+6479 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Paul Farrell", "title": "NASA prepares to launch Artemis 1 as it prepares to return Americans to the surface of the Moon - Daily Mail", "description": "The first Moon rocket launched by NASA since 1973 is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast.", "url": "https://www.dailymail.co.uk/news/article-11152277/NASA-prepares-launch-Artemis-1-prepares-return-Americans-surface-Moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/27/20/61788699-0-image-a-7_1661627868782.jpg", "publishedAt": "2022-08-27T19:43:39Z", "content": "The first Moon rocket launched by NASA in five decades is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast. \r\nNASA is preparing the launch of the unmanned S… [+7163 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Play A Key Role In Countering China: US Navy Chief - NDTV", "description": "US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in the future, playing a key role in countering China.", "url": "https://www.ndtv.com/india-news/india-to-play-a-key-role-in-countering-china-us-navy-chief-3291871", "urlToImage": "https://i.ndtvimg.com/i/2018-04/india-china-flags_650x400_61523324939.jpg", "publishedAt": "2022-08-27T13:46:39Z", "content": "India presents China with a two-front problem, said the US Navy Chief (Representational)\r\nTokyo: US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in … [+3390 chars]"}, {"source": {"id": null, "name": "Dominicantoday.com"}, "author": "Merit Designs Consulting Group, 2006-2020", "title": "“Vaccinated mosquitoes” used to combat dengue fever - Dominican Today", "description": "<p>This experiment was unveiled at yesterday’s commemoration of International Dengue Day. The Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addition to measures such as the elimination of mosquito breedi…", "url": "https://dominicantoday.com/dr/local/2022/08/27/vaccinated-mosquitoes-used-to-combat-dengue-fever/", "urlToImage": "https://dominicantoday.com/wp-content/uploads/2022/08/14_El-Mundo_27_1p01.jpg", "publishedAt": "2022-08-27T10:11:00Z", "content": "This experiment was unveiled at yesterday’s commemoration of International Dengue Day.\r\nThe Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addit… [+2024 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Karyn Maughan and Jan Gerber", "title": "Public Protector paid 'fugitive from justice' Ngobeni R87k for articles bashing Mkhwebane foes - News24", "description": "Paul Ngobeni was disbarred in several states in the US and, after being charged with several counts of larceny, forgery and practising while not an attorney in 2007, he went on the run from American law enforcement agencies.", "url": "https://www.news24.com/news24/southafrica/politics/parliament/public-protector-paid-fugitive-from-justice-ngobeni-r87k-for-articles-bashing-mkhwebane-foes-20220827", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3752/8caecffd900f407b9d16cbe797d204ce.jpeg", "publishedAt": "2022-08-27T04:00:14Z", "content": "\"Fugitive from justice\" Paul Ngobeni was credited for suggesting Public Protector Busisiwe Mkhwebane sue the government for \"insufficient funding\", while he collected massive pay cheques from her off… [+468 chars]"}]}