{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "LOLITA C. BALDOR. AAMER MADHANI, ZEKE MILLER", "title": "Enemy drone that killed US troops in Jordan was mistaken for a US drone, preliminary report suggests - The Associated Press", "description": "An enemy drone that killed three American troops and wounded dozens of others in Jordan may have been confused with an American drone returning to the U.S. installation. That's according to two U.S. officials who were not authorized to comment and insisted on…", "url": "https://apnews.com/article/jordan-drone-attack-attack-confusion-f175962e058b9b6f668303faf248d8e6", "urlToImage": "https://dims.apnews.com/dims4/default/ca1c029/2147483647/strip/true/crop/3358x1889+0+175/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F5c%2F17%2F12e496ee8ebbb6951f00ab652742%2F5415d5fe44b64516914ee5ffcc5adaf9", "publishedAt": "2024-01-30T15:37:00Z", "content": "WASHINGTON (AP) U.S. forces may have mistaken an enemy drone for an American one and let it pass unchallenged into a desert base in Jordan where it killed three U.S. troops and wounded dozens more, o… [+7597 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Rodolfo Bonnin", "title": "Future doctors often unprepared to work with suicidal patients - The Washington Post", "description": "In 2021, someone died by suicide every 11 minutes in the United States, which equates to nearly 50,000 Americans every year.", "url": "https://www.washingtonpost.com/health/2024/01/30/suicide-doctor-training/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V7JNT4SHD5FZRVVDO2674QICSE.jpg&w=1440", "publishedAt": "2024-01-30T13:39:06Z", "content": "Suicide is a societal epidemic and a staggering public health crisis. In 2021, someone died by suicide every 11 minutes in the United States, according to the Centers for Disease Control and Preventi… [+5907 chars]"}, {"source": {"id": null, "name": "BusinessLine"}, "author": "Arushi Mishra", "title": "Lupin announces introduction of Digital Therapeutics Certificate for cardiologists - BusinessLine", "description": "Lupin Ltd and the American College of Cardiology introduce Digital Therapeutics Certificate for Cardiologists, promoting digital solutions in Cardiology.", "url": "https://www.thehindubusinessline.com/markets/lupin-announces-introduction-of-digital-therapeutics-certificate-for-cardiologists/article67792202.ece", "urlToImage": "https://bl-i.thgim.com/public/incoming/uvb2yo/article67792293.ece/alternates/LANDSCAPE_1200/image%20-%202024-01-30T151929.577.jpg", "publishedAt": "2024-01-30T10:08:22Z", "content": "Lupin Ltds Digital Health, Indias evidence-based cardiology Digital Therapeutics (DTx) platform, and the American College of Cardiology (ACC), the global scientific leader in the practice of Cardiolo… [+1203 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Simonetta Di Pippo", "title": "Humans are going back to the moon to stay, but when that will be is becoming less clear - Phys.org", "description": "A 2019 Time magazine cover portrayed four astronauts running towards the moon. Pictured alongside the headline \"The Next Space Race,\" one of the astronauts carried an American flag, one carried a Chinese flag and the other two belonged to space companies owne…", "url": "https://phys.org/news/2024-01-humans-moon-stay.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2024/humans-are-going-back.jpg", "publishedAt": "2024-01-29T17:03:03Z", "content": "A 2019 Time magazine cover portrayed four astronauts running towards the moon. Pictured alongside the headline \"The Next Space Race,\" one of the astronauts carried an American flag, one carried a Chi… [+5098 chars]"}]}