{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "China poses increasing threat in military space race, top U.S. general says - Reuters", "description": "Rapid advancements in China’s military capabilities pose increasing risks to American supremacy in outer space, the head of the United States military’s space wing said on Monday.", "url": "https://www.reuters.com/world/us/china-poses-increasing-threat-military-space-race-top-us-general-says-2022-11-28/", "urlToImage": "https://www.reuters.com/resizer/XvzojsUhMo0bLvibHFyMSi8j3q8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/55LXFK5GQFKSBMFPSW6DOJ35YY.jpg", "publishedAt": "2022-11-28T03:09:00Z", "content": "SYDNEY, Nov 28 (Reuters) - Rapid advancements in Chinas military capabilities pose increasing risks to American supremacy in outer space, the head of the United States militarys space wing said on Mo… [+1974 chars]"}, {"source": {"id": null, "name": "Raw Story"}, "author": "Sarah K. Burris", "title": "Fox commentator melts down over vaccinations — saying she's going to be sent to a concentration 'camp' - msnNOW", "description": "Fox contributor Lisa Booth ranted on Sunday that the United States isn't all that much better than China when it comes to taking away the freedoms of Americans who refuse to be vaccinated. Chinese citizens have been protesting as people continue to be quarant…", "url": "https://www.rawstory.com/vaccine-fox-contributor-camp/", "urlToImage": "https://www.rawstory.com/media-library/fox-contributor-lisa-booth.png?id=32216042&width=1200&height=600&coordinates=0%2C0%2C0%2C50", "publishedAt": "2022-11-27T23:52:47Z", "content": "Fox contributor Lisa Booth ranted on Sunday that the United States isn't all that much better than China when it comes to taking away the freedoms of Americans who refuse to be vaccinated. \r\nChinese … [+2599 chars]"}, {"source": {"id": null, "name": "Asia Times"}, "author": "David P. Goldman", "title": "US tech war shows signs of crumbling - Asia Times", "description": "NEW YORK – What if they had a tech war and nobody came? This updated version of a meme from the 1960s Vietnam War protests may well apply to America’s most drastic trade restrictions against …", "url": "http://asiatimes.com/2022/11/us-tech-war-shows-signs-of-crumbling/", "urlToImage": "https://i0.wp.com/asiatimes.com/wp-content/uploads/2022/11/ASML-.jpeg?fit=1200%2C675&ssl=1", "publishedAt": "2022-11-27T10:37:39Z", "content": "NEW YORK What if they had a tech war and nobody came? This updated version of a meme from the 1960s Vietnam War protests may well apply to Americas most drastic trade restrictions against a rival sin… [+6651 chars]"}]}