{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Can acupuncture reduce headaches? - EurekAlert", "description": "Acupuncture may reduce headaches for people who have chronic tension-type headaches, according to a study published in the June 22, 2022, online issue of Neurology®, the medical journal of the American Academy of Neurology.", "url": "https://www.eurekalert.org/news-releases/956284", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-06-23T00:32:48Z", "content": "EMBARGOED FOR RELEASE UNTIL 4 P.M. ET, WEDNESDAY, JUNE 22, 2022\r\nMINNEAPOLIS – Acupuncture may reduce headaches for people who have chronic tension-type headaches, according to a study published in t… [+4411 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Laura Ramirez-Feldman", "title": "Children under 5 are now eligible for the COVID-19 vaccine. Here's what parents should know. - Yahoo News Canada", "description": "COVID-19 vaccines for the youngest Americans are finally here. On Saturday, CDC Director Rochelle Walensky signed off on the shots for children between the...", "url": "https://ca.news.yahoo.com/children-under-5-are-now-eligible-for-the-covid-19-vaccine-heres-what-parents-should-know-234517984.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/2v3yVCny4CMgzwNFfsamug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03OTQ-/https://s.yimg.com/os/creatr-uploaded-images/2022-06/befaa800-f27b-11ec-97fe-cae9b9650464", "publishedAt": "2022-06-22T23:46:35Z", "content": "COVID-19 vaccines for the youngest Americans are finally here. On Saturday, Centers for Disease Control and Prevention Director Rochelle Walensky signed off on the shots for children between the ages… [+7967 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Alistair MacDonald, Bojan Pancevski and Drew Hinshaw", "title": "Russia Hits Grain Terminals in Latest Attack on Ukraine’s Food Infrastructure - The Wall Street Journal", "description": "Russian forces targeted at least two large North American-owned grain terminals in the port of Mykolaiv, as part of what Kyiv and Western governments say is a campaign to degrade Ukraine’s ability to export food.", "url": "https://www.wsj.com/articles/russian-refinery-set-ablaze-by-drone-crash-11655896950", "urlToImage": "https://images.wsj.net/im-568760/social", "publishedAt": "2022-06-22T17:48:00Z", "content": "<ul><li>Attack on grain terminals deals another blow to Ukraines beleaguered food-export capabilities.</li><li>Crash of a drone allegedly controlled by Kyiv sparks fire at a large Russian refinery.</… [+694 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Lebanese dance crew Mayyas get Golden Buzzer on 'America's Got Talent' - Arab News", "description": "DUBAI: Lebanese dance group Mayyas on Tuesday got the Golden Buzzer from Colombian actress and judge Sofia Vergara in season 17 of “America’s Got Talent.” Mayyas — that according to the crew translates in Arabic to mean, the proud walk of a lioness — stepped …", "url": "https://www.arabnews.com/node/2108491", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2022/06/22/3298241-1569722525.png", "publishedAt": "2022-06-22T10:05:21Z", "content": "LONDON: Palestinian novelist Gharib Asqalani died at the age of 74 in Gaza on Tuesday.\r\nDuring a lengthy literary career, Asqalani published nine novels, six short story collections, three collection… [+1945 chars]"}]}