{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Anant Ambani-Radhika Merchant pre-wedding festivities: Who’s-who of the business world to descend in... - Moneycontrol", "description": "Blackstone chairman Stephen Schwarzman, Disney CEO Bob Iger, Morgan Stanley CEO Ted Pick, Bank of America chairman Brian Thomas Moynihan, Adnoc CEO Sultan Ahmed Al Jaber, EL Rothschild chair Lynn Forester de Rothschild, and Adobe CEO Shantanu Narayen, are amo…", "url": "https://www.moneycontrol.com/news/business/anant-ambani-radhika-merchant-pre-wedding-festivities-the-whos-who-of-the-business-world-to-descend-in-jamnagar-12330551.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/01/4-anant-ambani-radhika-merchant-engagement-jan-19-770x433.jpg", "publishedAt": "2024-02-23T06:42:37Z", "content": "The pre-wedding celebrations of Anant Ambani in Jamnagar in early March are anticipated to be attended by a host of international business luminaries, including Microsoft founder Bill Gates, Meta CEO… [+2108 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Indian-origin student Akul Dhawan froze to death after US nightclub denied him entry - Moneycontrol", "description": "Indian-American student Akul Dhawan froze to death near the Illinois nightclub that denied him entry last month, officials have said. Dhawan, 18, died of hypothermia following 'acute alcohol intoxication'.", "url": "https://www.moneycontrol.com/news/trends/indian-origin-student-akul-dhawan-froze-to-death-after-us-nightclub-denied-him-entry-12336571.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/02/MixCollage-23-Feb-2024-10-48-AM-5529-770x433.jpg", "publishedAt": "2024-02-23T05:23:52Z", "content": "An Indian-American student froze to death near the US nightclub that denied him entry last month, officials have said. Akul Dhawan was a student at the University of Illinois Urbana-Champaign. He was… [+1623 chars]"}]}