{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Fox Business"}, "author": "Dom Calicchio", "title": "DC Comics removing ‘the American way’ from Superman slogan: report - Fox Business", "description": "For decades, the iconic comic-book character Superman has stood for “truth, justice and the American way.” But apparently those days are over.", "url": "https://www.foxbusiness.com/entertainment/dc-comics-american-way-superman-comics", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/10/0/0/Supppppppp.jpg?ve=1&tl=1", "publishedAt": "2021-10-17T07:48:53Z", "content": "For decades, the iconic comic-book character Superman has stood for \"truth, justice and the American way.\" But apparently those days are over.\r\nDC Comics, the longtime publisher of Superman comics, n… [+1373 chars]"}, {"source": {"id": null, "name": "Americanthinker.com"}, "author": null, "title": "The Unvaccinated Are Looking Smarter Every Week - American Thinker", "description": "There is a massive propaganda push against those choosing not to vaccinate against COVID-19 with the experimental mRNA vaccines. Mainstream media, the big tech corporations, and our government have combined efforts to reward compliance and to shame a...", "url": "https://www.americanthinker.com/articles/2021/10/the_unvaccinated_are_looking_smarter_every_week.html", "urlToImage": "https://www.americanthinker.com/images/bucket/2021-10/233124.jpg", "publishedAt": "2021-10-16T07:09:09Z", "content": "There is a massive propaganda push against those choosing not to vaccinate against COVID-19 with the experimental mRNA vaccines. Mainstream media, the big tech corporations, and our government have c… [+7614 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Florina Spînu", "title": "Connectivity in Space: the Moon Will Soon Have Its Own Internet - autoevolution", "description": "America is going back to the Moon, and this time it plans to stay. As part of the Artemis program, NASA will put the first woman and the first person of color on the lunar surface and establish a long-term presence beyond Earth's low orbit. But once the astro…", "url": "https://www.autoevolution.com/news/connectivity-in-space-the-moon-will-soon-have-its-own-internet-171863.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/connectivity-in-space-the-moon-will-get-its-own-internet-171863_1.jpg", "publishedAt": "2021-10-16T06:29:00Z", "content": "It's been almost five decades since astronauts last set foot on the Moon as part of the Apollo program. Since then, the robotic exploration of space has seen incredible technical development and scie… [+3209 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "International Space Station accidentally rotates 57 degrees mid-orbit while hosting director & actress filming milestone movie - RT", "description": "An error by Russian cosmonauts on the International Space Station during engine testing accidentally rotated the satellite 57 degrees, causing American astronauts on board to sound a distress signal, it was revealed on Friday.", "url": "https://www.rt.com/russia/537625-iss-accidentally-rotate-orbit/", "urlToImage": "https://cdni.rt.com/files/2021.10/article/6169add520302753332a679d.jpg", "publishedAt": "2021-10-15T18:31:00Z", "content": "The ISS is currently hosting director Klim Shipenko and actress Yulia Peresild, who have made a short trip to the satellite to create 'The Challenge,' the first feature film to be recorded in space. … [+1200 chars]"}]}