{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "JOSHUA GOODMAN Associated Press, ERIC TUCKER Associated Press", "title": "Former US ambassador arrested in Florida, accused of serving as an agent of Cuba, AP source says - ABC News", "description": "The Associated Press has learned that a former American diplomat who served as U.S. ambassador to Bolivia has been arrested in a long-running FBI counterintelligence investigation and is accused of secretly serving as an agent of the Cuban government", "url": "https://abcnews.go.com/US/wireStory/former-us-ambassador-arrested-florida-accused-serving-agent-105345994", "urlToImage": "https://i.abcnewsfe.com/a/d9fceb9e-c1f3-4709-8eb5-85e5a3165bd8/wirestory_af9d80a4f268099364dff249dd74b3ec_16x9.jpg?w=992", "publishedAt": "2023-12-04T00:33:45Z", "content": "MIAMI -- A former American diplomat who served as U.S. ambassador to Bolivia has been arrested in a long-running FBI counterintelligence investigation, accused of secretly serving as an agent of Cuba… [+3917 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Bradford Betz", "title": "Muslim leaders in swing states vow not to back Biden in 2024 over handling of Israel-Hamas war - Fox News", "description": "A growing backlash among Muslim and Arab Americans against Biden over his handling of the Israel-Hamas war. Muslim leaders in swing states have vowed not to back his re-election.", "url": "https://www.foxnews.com/politics/muslim-leaders-swing-states-vow-not-back-biden-handling-israel-hamas-war", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/12/Palestinian-March.jpg", "publishedAt": "2023-12-03T22:21:00Z", "content": "President Bidens campaign for re-election in 2024 is facing growing pressure from Muslim Americans who have vowed not to back him over his handling of the Israel-Hamas war. \r\nOn Saturday, Muslim lead… [+3243 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Shouvik Das", "title": "India’s developing tech certifications presenting business opportunities: Dell | Mint - Mint", "description": "The American hardware and services company also expects the first wave of gen AI enterprise projects to reach maturity levels next year", "url": "https://www.livemint.com/companies/news/indias-developing-tech-certifications-presenting-business-opportunities-dell-11701626493286.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/12/03/1600x900/John_Roese__Dell_1701626684254_1701626704492.jpg", "publishedAt": "2023-12-03T18:07:02Z", "content": "New technology certifications and standards that are being developed in India are opening up fresh business opportunities for Dell Inc., Peter Marrs, the American hardware and services companys presi… [+4111 chars]"}]}