{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Research highlights importance of good sleep for prevention of Alzheimer’s - Verve Times", "description": "Alzheimer's disease, a severe and lethal form of dementia, affects over 5 million Americans per year,1 approximately 200,000 of which are under the age of 65. By 2050, prevalence is expected to jump to 16 million, and in the next 20 years it is proje", "url": "https://vervetimes.com/research-highlights-importance-of-good-sleep-for-prevention-of-alzheimers/", "urlToImage": "https://media.mercola.com/ImageServer/Public/2022/March/FB/nih-conflicts-of-interest-fb.jpg", "publishedAt": "2022-03-14T16:41:09Z", "content": "Alzheimer’s disease, a severe and lethal form of dementia, affects over 5 million Americans per year,1 approximately 200,000 of which are under the age of 65. By 2050, prevalence is expected to jump … [+26200 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Megan Gallen", "title": "Journalist in Ukraine recalls scene of attack that killed American filmmaker: 'Nothing is safe here' - Fox News", "description": "Photographer Paul Ronzheimer joins \"Fox & Friends First\" to discuss the attack in Irpin that left American filmmaker Brent Renaud dead.", "url": "https://www.foxnews.com/media/journalist-ukraine-attack-killed-american-filmmaker", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Brent-Renaud.png", "publishedAt": "2022-03-14T14:53:04Z", "content": "A photographer in Ukraine who was at the scene where an American filmmaker was reportedly shot and killed by Russian forces in Irpin spoke out Monday after witnessing the rescue of his colleague.\r\nBI… [+2502 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Russia-Ukraine war: American journalist Brent Renaud killed - Daily Post Nigeria", "description": "The Russia-Ukraine war has claimed the life of an award-winning American journalist Brent Renaud. Renaud, 50, was shot dead Sunday near Kyiv, Regional Police Chief Andriy Nebytov confirmed. \"US citizen Brent Renaud paid with his life for trying to highlight t…", "url": "https://dailypost.ng/2022/03/14/russia-ukraine-war-american-journalist-brent-renaud-killed/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/Brent-Renaud-.jpeg", "publishedAt": "2022-03-14T11:57:33Z", "content": "The Russia-Ukraine war has claimed the life of an award-winning American journalist Brent Renaud.\r\nRenaud, 50, was shot dead Sunday near Kyiv, Regional Police Chief Andriy Nebytov confirmed.\r\n“US cit… [+1158 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "American journalist shot and killed by Russian soldiers, says Ukraine - Times of India", "description": "Ukraine has claimed that an American journalist Brent Renaud was shot dead by Russian invaders in Ukraine. Brent Renaud was fatally shot in the neck when Russian forces opened fire on a car in Irpin outside the capital of Kyiv. The town has been the site of i…", "url": "https://timesofindia.indiatimes.com/videos/toi-original/american-journalist-shot-and-killed-by-russian-soldiers-says-ukraine/videoshow/90197366.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-90197366,imgsize-53408.cms", "publishedAt": "2022-03-14T07:05:24Z", "content": "Mar 14, 2022, 01:01PM ISTSource: TOI.inUkraine has claimed that an American journalist Brent Renaud was shot dead by Russian invaders in Ukraine. Brent Renaud was fatally shot in the neck when Russia… [+204 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": null, "title": "This is the kind of oil that can wake up a precursor to diabetes - Revyuh", "description": "Millions of Americans are at heightened risk of developing type 2 diabetes. As CDC estimates, diabetes affects 37.3 million Americans, or around one out", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/this-is-the-kind-of-oil-that-can-wake-up-a-precursor-to-diabetes/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/03/This-is-the-kind-of-oil-that-can-wake-up-a-precursor-to-diabetes.jpg", "publishedAt": "2022-03-13T05:30:08Z", "content": "Millions of Americans are at heightened risk of developing type 2 diabetes. As CDC estimates, diabetes affects 37.3 million Americans, or around one out of every ten people in the United States. \r\nWh… [+2147 chars]"}]}