{"articles": [{"author": "Web  Desk", "content": "Following news of Prince Harry securing two jobs, it is thought that he is looking to keep up with his wife Meghan Markle.\r\nThe Duke of Sussex has been recruited as the Chief Impact Officer at Silico… [+953 chars]", "description": "Meghan Markle is more easily employable because of her American identity while Prince Harry is stirring up confusion", "publishedAt": "2021-03-30T14:44:00Z", "source": {"id": null, "name": "The News International"}, "title": "Prince Harry trying to be relevant in America after getting two jobs - The News International", "url": "https://www.thenews.com.pk/latest/812216-prince-harry-trying-to-be-relevant-in-america-after-getting-two-jobs", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2021-03-30/l_812216_074454_updates.jpg"}, {"author": "ABC News", "content": "An Asian-American woman has been attacked on the streets of New York City by a man who repeatedly kicked her in front of witnesses who seemingly stood by, according to surveillance footage.\r\n<ul><li>… [+3038 chars]", "description": "In the 33rd recorded attack on an Asian victim in the city this year, a 65-year-old woman is kicked and stomped on by a stranger in front of a Manhattan building.", "publishedAt": "2021-03-30T14:01:06Z", "source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "title": "Asian-American woman severely assaulted on New York street as US hate crimes continue to rise - ABC News", "url": "https://www.abc.net.au/news/2021-03-31/asian-american-woman-assaulted-on-new-york-city-street/100039808", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e8fcf51fdd89046d21747ef7621f2330?impolicy=wcms_crop_resize&cropH=350&cropW=622&xPos=701&yPos=46&width=862&height=485"}, {"author": null, "content": "ISLAMABAD - Unknown gunmen have shot dead three female anti-polio workers in Afghanistan, one of the two countries in the world along with its neighbor Pakistan, where the crippling childrens disease… [+4338 chars]", "description": "Unknown gunmen have shot dead three female anti-polio workers in Afghanistan, one of the two countries in the world along with its neighbor Pakistan, where the crippling children’s disease remains endemic. \n \nTuesday’s violence came on the second day of a fiv…", "publishedAt": "2021-03-30T12:37:13Z", "source": {"id": null, "name": "VOA News"}, "title": "3 Female Polio Vaccinators Killed in Afghanistan - Voice of America", "url": "https://www.voanews.com/south-central-asia/3-female-polio-vaccinators-killed-afghanistan", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/2021-03/2020-07-20T093105Z_1617904455_RC2XWH98ZL5F_RTRMADP_3_HEALTH-CORONAVIRUS-PAKISTAN-POLIO.JPG"}, {"author": "AFP", "content": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May duri… [+4774 chars]", "description": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May during an arrest on a minor charge.", "publishedAt": "2021-03-30T05:33:16Z", "source": {"id": null, "name": "EWN"}, "title": "Jury in George Floyd murder trial shown harrowing video of his death - Eyewitness News", "url": "https://ewn.co.za/2021/03/30/jury-in-george-floyd-murder-trial-shown-harrowing-video-of-his-death", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/yng9tpllm5leq4xsq2o7"}, {"author": "Michelle R. Smith And Terry Tang", "content": "More than a dozen states will open vaccine eligibility to all adults this week in a major expansion of COVID-19 shots for tens of millions of Americans amid a worrisome increase in virus cases and co… [+7178 chars]", "description": "More than a dozen states will open vaccine eligibility to all adults this week in a major expansion of COVID-19 shots for tens of millions of Americans amid a worrisome increase in virus cases and concerns about balancing supply and demand for the vaccines.", "publishedAt": "2021-03-30T00:32:00Z", "source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "title": "More than a dozen U.S. states to open vaccines to all adults - CP24 Toronto's Breaking News", "url": "https://www.cp24.com/world/more-than-a-dozen-u-s-states-to-open-vaccines-to-all-adults-1.5367424", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5367431.1617064319!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg"}, {"author": "None", "content": "SANTA FE, N.M. The Indian Health Service is shifting its vaccine distribution system to target individual hospitals and clinics with high demand for shots and tapering off supplies to vaccination hub… [+13245 chars]", "description": "SANTA FE, N.M. — The Indian Health Service is shifting its vaccine distribution system to target individual hospitals and clinics with high demand for shots and tapering off supplies to vaccination hubs where most eligible patients have received doses.", "publishedAt": "2021-03-30T00:04:37Z", "source": {"id": null, "name": "Columbiabasinherald.com"}, "title": "The Latest: Feds shift focus of Native American vaccinations - Columbia Basin Herald", "url": "https://columbiabasinherald.com/news/2021/mar/29/the-latest-feds-shift-focus-of-native-2/", "urlToImage": "https://hagadone.media.clients.ellingtoncms.com/static-3/columbiabasinherald/images/default-social.jpg"}, {"author": "Kurt Lozano", "content": "(Photo: Thunder Predator)\r\nThe Group Stage of the ONE Esports Dota 2 Singapore Major started on Monday (29 March), with South American underdogs Thunder Predator coming out of nowhere to finish the f… [+6253 chars]", "description": "As the second-placed team of the traditionally weaker South American regional league, they were expected to struggle against the representatives from other...", "publishedAt": "2021-03-29T13:57:36Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Singapore Major Day 3 recap: Thunder Predator shred the opposition - Yahoo Singapore News", "url": "https://sg.news.yahoo.com/singapore-major-day-3-recap-thunder-predator-go-undefeated-135736808.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/dd1d8660-9082-11eb-abc3-c2abad2e01cd"}], "message": "Successful api call", "number_of_news": 7, "status": 200, "topic": "america"}