{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News Staff", "title": "Sen. Blackburn slams Pelosi for 'unseemly' advice to US athletes at Beijing Olympics - Fox News", "description": "Senator Marsha Blackburn called out Nancy Pelosi and the Biden administration for their hypocrisy in how they are treating the 2022 Beijing Olympics and allowing American media to broadcast the games while China is committing human rights violations.", "url": "https://www.foxnews.com/media/nancy-pelosi-us-athletes-silent-beijing-olympics-blackburn", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b623ac65-cffb-43b0-be4c-b4d0be0bb4b4/d5359618-7a5d-45df-b279-6e35db7b1a3a/1280x720/match/image.jpg", "publishedAt": "2022-02-04T19:22:11Z", "content": "Sen. Marsha Blackburn, R-Tenn., criticized House Speaker Nancy Pelosi for telling U.S. Olympic athletes to remain silent on China's humans rights violations while in Beijing. On \"That Faulkner Focus\"… [+1308 chars]"}, {"source": {"id": null, "name": "Getindianews.com"}, "author": null, "title": "Is Mike Johnson Dating Cheslie Kryst? Girlfriend Name & Suicide Post On Twitter - Get India News", "description": "Is Mike Johnson Dating Cheslie Kryst? Girlfriend Name & Suicide Post On Twitter: Mike Johnson is an American famous television personality who is also a veteran", "url": "https://getindianews.com/is-mike-johnson-dating-cheslie-kryst-girlfriend-name-suicide-post-on-twitter/", "urlToImage": "https://getindianews.com/wp-content/uploads/2022/02/Mike-Johnson.jpg", "publishedAt": "2022-02-04T14:25:52Z", "content": "Is Mike Johnson Dating Cheslie Kryst? Girlfriend Name &amp; Suicide Post On Twitter: Mike Johnson is an American famous television personality who is also a veteran of the United States Air Force but… [+2210 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Megan Megan", "title": "The top-rated job in America? You might not have have heard of it - CBS News", "description": "Jobs in tech, health care and HR dominate the list of this year's best jobs, according to a Glassdoor ranking.", "url": "https://www.cbsnews.com/news/best-jobs-technology-health-care-salary-satisfaction/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2022/02/03/aacd951a-d76d-4170-be95-dfca9d39ac60/thumbnail/1200x630/3a5a275e934d143ca1da3e46d3532867/gettyimages-1314040235.jpg", "publishedAt": "2022-02-04T13:08:37Z", "content": "Information technology skills will serve job seekers well this year, a new ranking of the most desirable jobs in America found.\r\nThe top job? Enterprise architect, according to Glassdoor. Not surpris… [+3439 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Firm On Ties Despite India Abstaining From UN Vote On Ukraine-Russia - NDTV", "description": "America has a relationship with India that stands on its own merit, the Joe Biden administration said today. US also said that the ties with India have not been impacted by the ongoing tension with Russia.", "url": "https://www.ndtv.com/india-news/us-stand-on-ties-as-india-stays-away-from-russia-ukraine-vote-2748345", "urlToImage": "https://c.ndtvimg.com/2021-07/7arkdhhk_ned-price_625x300_02_July_21.jpg", "publishedAt": "2022-02-04T04:40:00Z", "content": "State Department spokesperson Ned Price made the remarks during his daily press conference\r\nNew Delhi: America has a relationship with India that stands on its own merit, the Joe Biden administration… [+1981 chars]"}, {"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Mia Galuppo", "title": "Fantasia Barrino to Star in ‘The Color Purple’ Movie Musical - Hollywood Reporter", "description": "Singer-songwriter Fantasia Barrino will make her feature film debut in The Color Purple movie musical. Barrino, who grew to fame on the third season of American Idol, is in final negotiations to play Celie, a role that she played on stage on Broadway in 2007 …", "url": "https://www.hollywoodreporter.com/movies/movie-news/fantasia-barrino-the-color-purple-movie-musical-1235042026/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2021/11/GettyImages-1040671388.jpg?w=1024", "publishedAt": "2022-02-04T02:38:36Z", "content": "Singer-songwriter Fantasia Barrino will make her feature film debut in The Color Purple movie musical.\r\nBarrino, who grew to fame on the third season of American Idol, is in final negotiations to pla… [+1969 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Vladimir Isachenkov", "title": "Putin heads to China to bolster ties amid Ukraine tensions - CP24 Toronto's Breaking News", "description": "American and European officials may be staying away from the Beijing Winter Olympics because of human rights concerns, but Russian President Vladimir Putin will be on hand even as tensions soar over his buildup of troops along his country's border with Ukrain…", "url": "https://www.cp24.com/world/putin-heads-to-china-to-bolster-ties-amid-ukraine-tensions-1.5766334", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5766339.1643906096!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-03T16:36:25Z", "content": "MOSCOW (AP) - American and European officials may be staying away from the Beijing Winter Olympics because of human rights concerns, but Russian President Vladimir Putin will be on hand even as tensi… [+6360 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Ghaith Alsayed, Lolita C. Baldor, Bassem Mroue and Zeke Miller, Associated Press", "title": "Islamic State leader killed as US attacks Syria hideout - KSL.com", "description": "The leader of the violent Islamic State group died in a U.S. military raid Thursday, blowing himself up along with members of his family as American special operations forces assaulted his hideout in northwestern Syria, President Joe Biden said.", "url": "https://www.ksl.com/article/50340665/islamic-state-leader-killed-as-us-attacks-syria-hideout", "urlToImage": "https://img.ksl.com/slc/2862/286240/28624023.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-02-03T15:35:00Z", "content": "Estimated read time: 7-8 minutes\r\nATMEH, Syria The leader of the violent Islamic State group died in a U.S. military raid Thursday, blowing himself up along with members of his family as American spe… [+8921 chars]"}]}