{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "David Smith", "title": "‘I am seeking justice’: Tulsa massacre survivor, 107, testifies to US Congress - The Guardian", "description": "Viola Fletcher is the oldest survivor of the racist attack on the city’s ‘Black Wall Street’ in 1921 that left up to 300 African Americans dead", "url": "https://amp.theguardian.com/us-news/2021/may/19/viola-fletcher-tulsa-race-massacre-congress-oldest-survivor", "urlToImage": null, "publishedAt": "2021-05-19T18:18:00Z", "content": "'I still smell smoke and see fire': Tulsa massacre survivor, 107, testifies to US Congress video\r\nUS newsViola Fletcher is the oldest survivor of the racist attack on the citys Black Wall Street in 1… [+5079 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jeanette Settembre", "title": "European Union to ease travel restrictions for vaccinated Americans - Fox News", "description": "The European Union on Wednesday agreed on a proposal to relax COVID-19 travel restrictions on travelers visiting from outside its 27 countries", "url": "https://www.foxnews.com/travel/european-union-ease-travel-restrictions-vaccinated-americans", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/GettyImages-1231950320.jpg", "publishedAt": "2021-05-19T14:14:41Z", "content": "Vaccinated Americans will soon be able to travel to Europe with ease.\r\nThe European Union on Wednesday agreed on a proposal to relax COVID-19 travel restrictions for travelers visiting from outside i… [+1411 chars]"}, {"source": {"id": null, "name": "Scroll.in"}, "author": "Scroll Staff", "title": "Amid Covid crisis, Modi’s popularity rating drops to a new low for first time in 7 years: Report - Scroll.in", "description": "This was based on data from two surveys – one by Indian agency CVoter and another by American agency Morning Consult.", "url": "https://scroll.in/latest/995269/amid-covid-crisis-modis-popularity-rating-drops-to-a-new-low-for-first-time-in-7-years-report", "urlToImage": "https://d1u4oo4rb13yy8.cloudfront.net/book/oiodzgceyp-1533490488.jpg", "publishedAt": "2021-05-19T10:56:00Z", "content": "Prime Minister Narendra Modis popularity ratings fell to a new low amid the coronavirus pandemic, according to surveys by an Indian and an American agency, reported Reuters.\r\nThe prime minister assum… [+2573 chars]"}]}