{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Laura Carrione", "title": "Fox Nation honors military personnel with new content, free membership for Memorial Day - Fox News", "description": "The 'Grateful Nation' promotion honors those who've fought for our country with a free Fox Nation membership to anyone who's served in the United States military. Sign up today to watch new content inspired by America's heroes.", "url": "https://www.foxnews.com/media/fox-nation-honors-military-personnel-with-new-content-free-membership-for-memorial-day", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Crown-Hill-Cementery.jpg", "publishedAt": "2021-05-31T12:18:22Z", "content": "This Memorial Day, Fox Nation treats subscribers to fresh, new, exclusive content inspired by America's heroes and an even sweeter surprise for them: a one-year free membership to the streaming servi… [+4328 chars]"}, {"source": {"id": null, "name": "The Sun Daily"}, "author": null, "title": "Argentina no longer hosting Copa America: CONMEBOL - The Sun Daily", "description": "ASUNCION: The South American Football Confederation (CONMEBOL) said on Sunday that Argentina would no longer host the Copa America, throwing the troub...", "url": "https://www.thesundaily.my/home/argentina-no-longer-hosting-copa-america-conmebol-XN7917257", "urlToImage": "https://www.thesundaily.my/binrepository/480x320/0c35/480d250/none/11808/LTOF/copa-america_1689226_20210531160940.jpg", "publishedAt": "2021-05-31T08:15:00Z", "content": "ASUNCION: The South American Football Confederation (CONMEBOL) said on Sunday that Argentina would no longer host the Copa America, throwing the troubled tournament into doubt just 13 days before it … [+1483 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Jonathan Landrum Jr.", "title": "Tulsa massacre documentaries offer deep dive into tragedy - CTV News", "description": "Several documentary filmmakers -- some backed by NBA superstars -- are shedding light on the historically ignored Tulsa Race Massacre of 1921, one of the most horrific tragedies in American history.", "url": "https://www.ctvnews.ca/entertainment/tulsa-massacre-documentaries-offer-deep-dive-into-tragedy-1.5448635", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5448637.1622377461!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-05-30T12:26:00Z", "content": "LOS ANGELES -- \r\nSeveral documentary filmmakers -- some backed by NBA superstars -- are shedding light on the historically ignored Tulsa Race Massacre of 1921, one of the most horrific tragedies in A… [+5087 chars]"}, {"source": {"id": null, "name": "Digital Camera World"}, "author": "Jamie Carter", "title": "How to photograph solar eclipse from North America and Europe this June - Digital Camera World", "description": "A rare ‘ring of fire’ sunrise eclipse will be visible in America this June while Europeans will see a bite taken out of the Sun", "url": "https://www.digitalcameraworld.com/uk/tutorials/how-to-photograph-solar-eclipse-from-north-america-and-europe-this-june", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zFk5QfghTggQghgxiHrcHW-1200-80.jpg", "publishedAt": "2021-05-30T11:39:44Z", "content": "The northern hemisphere is about to get a solar eclipse. A rare celestial event where a New Moon slips precisely between the Earth and the Sun, what happens on 10 June, 2021 will look drastically dif… [+8447 chars]"}]}