{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sam Metz", "title": "Arizona levee breached, hiker missing after floods hit West - The Associated Press", "description": "A levee was breached Monday in a small town near the Arizona-New Mexico state line, forcing the evacuations of 60 people after a weekend of flash floods across the American Southwest that also swept away one woman who is still missing in Utah’s Zion National …", "url": "https://apnews.com/article/floods-travel-arizona-united-states-dallas-0a3bf7355a9f3726d20efe8560800af3", "urlToImage": "https://storage.googleapis.com/afs-prod/media/4d196909280840cfa2c8587b6205cab2/3000.jpeg", "publishedAt": "2022-08-23T00:59:33Z", "content": "A levee was breached Monday in a small town near the Arizona-New Mexico state line, forcing the evacuations of 60 people after a weekend of flash floods across the American Southwest that also swept … [+4980 chars]"}, {"source": {"id": null, "name": "Scienceboard.net"}, "author": "Greg Slabodkin, ScienceBoard Editor in Chief", "title": "Lupus pill moves to clinical trial in humans after success in mice - The Science Board", "description": "Scientists at this week’s fall meeting of the American Chemical Society report they have begun phase II clinical trials of an oral pill containing a compound that in mice, not only prevented lupus-like symptoms, but also reversed signs of organ damage caused …", "url": "https://www.scienceboard.net/index.aspx?sec=log&itemID=4629", "urlToImage": "https://www.scienceboard.net/user/images/content_images/sup_drug/2022_08_22_19_52_2296_pills_bottle_social.jpg", "publishedAt": "2022-08-22T19:29:50Z", "content": "Lupus, an autoimmune disease that attacks organs and can be fatal, has no cure. While current treatments are designed to limit damage and ameliorate symptoms, many of these therapies aren't very effe… [+3223 chars]"}, {"source": {"id": null, "name": "American Medical Association"}, "author": null, "title": "Adult vaccines, routine immunizations & more with L.J Tan, PhD, MS - American Medical Association", "description": "The AMA is leading the fight against the COVID-19 pandemic. See video updates on how the AMA is fighting COVID-19 by discussing adult immunizations.", "url": "https://www.ama-assn.org/delivering-care/public-health/adult-vaccines-routine-immunizations-more-lj-tan-phd-ms", "urlToImage": "https://www.ama-assn.org/sites/ama-assn.org/files/2019-01/2018-11-19-GENERICSOCIAL.jpg", "publishedAt": "2022-08-22T14:26:15Z", "content": "Watch the AMA's COVID-19 Update, with insights from AMA leaders and experts about the pandemic.\r\nIn todays COVID-19 Update, L.J Tan, PhD, MS, chief policy and partnerships officer at Immunize.org (fo… [+22823 chars]"}]}