{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "Kinling Lo", "title": "'Striking' that Putin admits Xi's concerns about Russia's war in Ukraine: US State Department - The Star Online", "description": "Russian President Vladimir Putin’s acknowledgement of Chinese counterpart Xi Jinping’s “concerns” about the war in Ukraine was “striking”, the US State Department said, reiterating American concerns about the two countries’ deepening relationship.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/09/17/striking-that-putin-admits-xis-concerns-about-russias-war-in-ukraine-us-state-department", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/09/17/1741091.jpg", "publishedAt": "2022-09-17T05:20:00Z", "content": "Russian President Vladimir Putins acknowledgement of Chinese counterpart Xi Jinpings concerns about the war in Ukraine was striking, the US State Department said, reiterating American concerns about … [+4099 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Craig McCulloch", "title": "Canadian Researchers Developing Oral Insulin - Voice of America - VOA News", "description": "New Oral Insulin Could Eliminate Daily Injections", "url": "https://www.voanews.com/a/canadian-researchers-developing-oral-insulin/6751075.html", "urlToImage": "https://gdb.voanews.com/09bb0000-0a00-0242-ab87-08da9838c1b7_cx0_cy3_cw0_w1200_r1.png", "publishedAt": "2022-09-16T22:52:40Z", "content": "Vancouver  Research to develop a pill form of insulin is showing promise at the University of British Columbia in western Canada. The goal is to eliminate the need for diabetics to inject themselves … [+2743 chars]"}, {"source": {"id": null, "name": "Notebookcheck.net"}, "author": "Enrico Frahn", "title": "EVGA leaves the GPU market amid conflict with Nvidia and won't release any RTX 4000 graphics card - Notebookcheck.net", "description": "The American GPU maker refers to disrespectful behavior from Nvidia's side as the reason for its decision to abandon the graphics card market entirely just weeks before the highly anticipated reveal and eventual release of the GeForce RTX 4000 series.", "url": "https://www.notebookcheck.net/EVGA-leaves-the-GPU-market-amid-conflict-with-Nvidia-and-won-t-release-any-RTX-4000-graphics-card.652925.0.html", "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/Nvidia_RTX_4000_EVGA_GPU.jpg", "publishedAt": "2022-09-16T21:32:10Z", "content": "After several painful years of inflated desktop GPU prices, gamers around the world are anxiously awaiting the official reveal and subsequent release of Nvidia's next-gen GeForce RTX 4000 series of g… [+1814 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "TSN.ca Staff", "title": "CanMNT announces roster for Sept. friendlies - TSN", "description": "Canada announced its 27-man roster for a pair of friendlies in Europe later this month as the team gears up for November's World Cup. John Herdman's side meets World Cup hosts Qatar in Austria on Sept. 23 before travelling to Slovakia to take on South America…", "url": "https://www.tsn.ca/canada-canmnt-roster-uruguay-qatar-world-cup-2022-1.1849685", "urlToImage": "https://www.tsn.ca/polopoly_fs/1.1715171!/fileimage/httpImage/image.jpg_gen/derivatives/landscape_620/alphonso-davies.jpg", "publishedAt": "2022-09-16T16:36:21Z", "content": "Canada announced its 27-man roster for a pair of friendlies in Europe later this month as the team gears up for November's World Cup.\r\nJohn Herdman's side meets World Cup hosts Qatar in Austria on Se… [+1862 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Michael Wayland", "title": "Why Ford is keeping its Mustang gas-powered as part of its electric vehicle push - CNBC", "description": "Ford CEO Jim Farley believes keeping the iconic American brand gas-powered makes good business sense for the automaker for the foreseeable future.", "url": "https://www.cnbc.com/2022/09/16/ford-ceo-jim-farley-reveals-why-2024-mustang-is-staying-gas-powered.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107119357-1663270938756-Mustang_farley.PNG?v=1663326001&w=1920&h=1080", "publishedAt": "2022-09-16T11:00:01Z", "content": "Ford Chair Bill Ford and President and CEO Jim Farley converse in front of newly revealed Mustang Dark Horse at The Stampede in downtown Detroit on Sept. 14, 2022.\r\nDETROIT Ford Motor CEO Jim Farley … [+4937 chars]"}]}