{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Readout of President Biden’s Call with Prime Minister Trudeau of Canada - The White House", "description": "Earlier today, President Biden spoke with Prime Minister Trudeau on the unidentified, unmanned object in North American air space. The object was closely", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/02/11/readout-of-president-bidens-call-with-prime-minister-trudeau-of-canada-2/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2023-02-11T23:45:34Z", "content": "Earlier today, President Biden spoke with Prime Minister Trudeau on the unidentified, unmanned object in North American air space. The object was closely tracked and monitored by North American Aeros… [+846 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "US jet shoots down new mystery 'object' over Canada - CNA", "description": "OTTAWA: A US fighter jet acting on the orders of Canadian Prime Minister Justin Trudeau shot down an unidentified object over Canada on Saturday (Feb 11) -  in a joint operation by the North American neighbours and the second such take-down in their skies sin…", "url": "https://www.channelnewsasia.com/world/unidentified-object-shot-down-over-canada-prime-minister-trudeau-3272311", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--WsNremmv--/fl_relative,g_south_east,l_one-cms:core:watermark:reuters,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/2023-02-12t012723z_2_lynxmpej1a09x_rtroptp_3_canada-politics-health.jpg?itok=xAKHOimZ", "publishedAt": "2023-02-11T23:25:00Z", "content": "Saturday's operation came after the United States said on Wednesday that suspected Chinese spy balloons like the one it shot down were part of a \"fleet\" that has spanned five continents, as NATO join… [+1302 chars]"}, {"source": {"id": null, "name": "PerthNow"}, "author": "AP", "title": "US fighter jet shoots down object flying over Canada - PerthNow", "description": "A fighter jet has shot down an unidentified object over Canada, the second such shootdown in as many days, as North America appears on heightened alert following a week-long Chinese spying balloon saga that drew the global spotlight.", "url": "https://www.perthnow.com.au/politics/defence/us-warplane-shoots-down-object-over-northern-canada-c-9729981", "urlToImage": "https://images.perthnow.com.au/publication/C-9729981/9cb840f614d8eb772ad16c896bce6fed43d1e21d-16x9-x0y0w1280h720.jpg?imwidth=1200", "publishedAt": "2023-02-11T22:23:00Z", "content": "A US F-22 fighter jet has shot down an unidentified object over Canada, the second such shootdown in as many days, as North America appears on heightened alert following a week-long Chinese spying ba… [+2488 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez, Mark Morales", "title": "'A recipe for disaster.' Deadly encounter in Memphis comes at a critical time in American policing - CNN", "description": "Police departments across the country are struggling to recruit qualified officers and fill shifts, luring candidates with signing bonuses worth thousands of dollars, and at times curtailing standards and training in a desperate bid to strengthen patrols amid…", "url": "https://www.cnn.com/2023/02/11/us/tyre-nichols-memphis-police-law-enforcement/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230129002245-02-tyre-nichols-protests-012923.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-11T19:00:00Z", "content": "Since the night Tyre Nichols was kicked, pepper-sprayed, punched and struck with a baton by Memphis police officers, six cops have been fired and five of them charged with murder. Seven others face i… [+10648 chars]"}, {"source": {"id": null, "name": "Common Dreams"}, "author": "https://www.facebook.com/32109457015", "title": "What Do Trump's Racism, Expensive Eggs, and a Bird Flu Pandemic Have in Common? - Common Dreams", "description": "Trump’s no longer president, but he and his racism could still be responsible for millions more American deaths from a new pandemic disease. How and why? I’ll explain in just a moment, but first let’s look at the disease itself.", "url": "https://www.commondreams.org/opinion/trump-egg-prices-bird-flu", "urlToImage": "https://www.commondreams.org/media-library/a-hen.jpg?id=33010308&width=1200&height=600&coordinates=0%2C85%2C0%2C86", "publishedAt": "2023-02-10T18:19:00Z", "content": "Trumps no longer president, but he and his racism could still be responsible for millions more American deaths from a new pandemic disease. How and why? Ill explain in just a moment, but first lets l… [+16011 chars]"}]}