{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Opti Burner Keto Gummies Review - Do OptiBurner Keto Weight Loss Gummies Work or Scam? - The Tribune India", "description": "Research shows that approximately 40 percent of the American population is overweight, and many others are at risk for obesity due to unhealthy lifestyles. Numerous physicians concur that the decline in daily physical activity may be attributable to new eatin…", "url": "https://www.tribuneindia.com/news/brand-connect/opti-burner-keto-gummies-review-do-optiburner-keto-weight-loss-gummies-work-or-scam-469477", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_1447693640.jpg", "publishedAt": "2023-01-11T10:13:00Z", "content": "Research shows that approximately 40 percent of the American population is overweight, and many others are at risk for obesity due to unhealthy lifestyles. Numerous physicians concur that the decline… [+7087 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Sarah Rumpf", "title": "American Gas Association fires back on potential gas stove ban: 'Not substantiated by sound science' - Fox Business", "description": "The American Gas Association pushed back against a potential gas ban calling the removal of the appliance \"reckless\" and \"not substantiated by sound science.\"", "url": "https://www.foxbusiness.com/politics/american-gas-association-fires-back-potential-gas-stove-ban", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/01/0/0/GettyImages-1243649447.jpg?ve=1&tl=1", "publishedAt": "2023-01-11T02:39:38Z", "content": "The American Gas Association (AGA) is clapping back after news that U.S. federal regulators may ban gas stoves over their potential risks to human health stating the removal of the appliance is \"reck… [+3401 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Sean Boynton", "title": "Canadian Nexus centres to reopen in spring along with U.S. interviews at airports - National | Globalnews.ca - Global News", "description": "The deal, reached on the sidelines of the North American Leaders' Summit in Mexico City, is intended to further reduce the backlog of applicants for the trusted-traveller program.", "url": "https://globalnews.ca/news/9400541/canada-us-nexus-three-amigos-trudeau/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/12/20221201121256-6388eb8431bce7fdfe6b910cjpeg-1-e1673400816303.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2023-01-11T01:31:34Z", "content": "Canada and the United States said Tuesday they expect Canadian Nexus enrolment centres to reopen in the spring alongside a new program allowing U.S.-led interviews to be conducted at Canadian airport… [+4820 chars]"}, {"source": {"id": null, "name": "Fftimes.com"}, "author": "fftimes", "title": "New guidance: Use drugs, surgery early for obesity in kids - Fort Frances Times", "description": "Disclaimer: This article reflects American guidelines. It does not necessarily reflect Canadian guidelines. Seek a doctor’s advice for your health matters. Children struggling with obesity should be evaluated and treated early and aggressively, including with…", "url": "https://fftimes.com/news/world/new-guidance-use-drugs-surgery-early-for-obesity-in-kids/", "urlToImage": "https://fftimes.com/wp-content/uploads/2021/01/Health-stethscope.jpg", "publishedAt": "2023-01-10T19:15:06Z", "content": "Disclaimer: This article reflects American guidelines. It does not necessarily reflect Canadian guidelines. Seek a doctor’s advice for your health matters.\r\nChildren struggling with obesity should be… [+5525 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Experts Recommend Drugs, Surgery for Teen Obesity in New Guidelines - Gizmodo", "description": "The American Academy of Pediatrics' guidelines are the first to emphasize proactive measures for treating childhood obesity, which has risen in recent years.", "url": "https://gizmodo.com/pediatric-obesity-treatment-guidelines-surgery-1849970109", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8f8ef648777f6a6d579e1b6142c26dc3.jpg", "publishedAt": "2023-01-10T17:37:00Z", "content": "For the first time ever, experts with the American Academy of Pediatrics are recommending proactive medical intervention against childhood obesity. The organizations new guidelines will no longer ask… [+3842 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Brazil's Bolsonaro is in Florida. What does the U.S. do now? - CBC News", "description": "The White House said on Monday it had yet to receive any requests from the Brazilian government regarding Jair Bolsonaro's status, but the former president's presence on American soil since Dec. 30 could raise complex issues, especially since Sunday's riots a…", "url": "https://www.cbc.ca/news/world/us-brazil-bolsonaro-1.6708776", "urlToImage": "https://i.cbc.ca/1.6708877.1673362442!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brazil-bolsonaro-navy.jpg", "publishedAt": "2023-01-10T15:34:29Z", "content": "Far-right former Brazilian president Jair Bolsonaro flew to Florida two days before his term ended, having challenged the results of the Oct. 30 run-off election that he narrowly lost to leftist riva… [+5682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Thomas Sumner", "title": "Doomed pair of supermassive black holes the closest to collision ever seen - Phys.org", "description": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on January 9 at an American Astronomical Society meeting in Seattl…", "url": "https://phys.org/news/2023-01-doomed-pair-supermassive-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/doomed-pair-of-superma.jpg", "publishedAt": "2023-01-10T09:46:22Z", "content": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on Jan… [+5256 chars]"}, {"source": {"id": null, "name": "National Post"}, "author": "Catherine Lévesque", "title": "Justin Trudeau might find himself fighting for attention at 'Three Amigos' summit amid border issues - National Post", "description": "Migration crisis and the importation of illegal drugs likely to be Biden's top priority at North American leaders summit", "url": "https://nationalpost.com/news/politics/justin-trudeau-might-find-himself-fighting-for-attention-at-the-three-amigos-summit-amid-border-issues", "urlToImage": "https://smartcdn.gprod.postmedia.digital/nationalpost/wp-content/uploads/2023/01/Trudeaus-Mexico-2.jpg", "publishedAt": "2023-01-09T21:50:43Z", "content": "Migration crisis and the importation of illegal drugs likely to be Biden's top priority at North American leaders summit \r\nMexican President Andres Manuel Lopez Obrador and First Lady Beatriz Gutierr… [+7154 chars]"}, {"source": {"id": null, "name": "Lupus.org"}, "author": null, "title": "Vitamin D Status a Common Health Concern for People with Lupus, Though Not Linked to Disease Activity - Lupus Foundation of America", "description": "Research shows that while taking vitamin D supplements can be a great way to increase blood levels of vitamin D, it may not improve lupus disease activity.", "url": "https://www.lupus.org/news/vitamin-d-status-a-common-health-concern-for-people-with-lupus-though-not-linked-to-disease", "urlToImage": "https://www.lupus.org/sites/default/files/styles/og_image/public/media/images/disease-ILR.JPG", "publishedAt": "2023-01-09T14:17:08Z", "content": "Nicknamed the sunshine vitamin, vitamin D can be made by the body when skin is exposed to ultraviolet (UV) radiation from the sun. However, many people with lupus need to avoid the sun due to photose… [+1583 chars]"}]}