{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Seattle Times"}, "author": "David Gutman", "title": "WA attorney general suing Trump administration over birthright citizenship - The Seattle Times", "description": "Birthright citizenship — the idea that every person born in the U.S. is an American citizen — is spelled out in the 14th Amendment of the Constitution.", "url": "https://www.seattletimes.com/seattle-news/politics/wa-ag-nick-brown-suing-trump-administration-over-birthright-citizenship/", "urlToImage": "https://images.seattletimes.com/wp-content/uploads/2025/01/01212025_WA-AG_tzr_115644.jpg?d=1200x630", "publishedAt": "2025-01-22T02:20:46Z", "content": "Washington, led by new Attorney General Nick Brown, has sued President Donald Trump and his administration over their order to end birthright citizenship.\r\nTrump, on his first day in office, issued a… [+6316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David Goldman", "title": "Trump threatens China: More tariffs are coming on Feb. 1 - CNN", "description": "President Donald Trump on Tuesday warned that even more tariffs could be coming as soon as next week: This time China was his target, as Trump threatened to unleash a wave of higher taxes on imports from America’s second-biggest trading partner.", "url": "https://www.cnn.com/2025/01/21/economy/tariffs-china-trump-february-first/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1240555194.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-01-22T00:11:00Z", "content": "President Donald Trump on Tuesday warned that even more tariffs could be coming as soon as next week: This time China was his target, as Trump threatened to unleash a wave of higher taxes on imports … [+3817 chars]"}, {"source": {"id": null, "name": "Dhs.gov"}, "author": null, "title": "Statement from a DHS Spokesperson on Directives Expanding Law Enforcement and Ending the Abuse of Humanitarian Parole - Homeland Security", "description": "Acting Department of Homeland Security Secretary Benjamine Huffman issued two directives essential to ending the invasion of the US southern border and empower law enforcement to protect Americans.", "url": "https://www.dhs.gov/news/2025/01/21/statement-dhs-spokesperson-directives-expanding-law-enforcement-and-ending-abuse", "urlToImage": "https://www.dhs.gov/sites/default/files/2024-02/24_0206_opa_og-image-dhs.jpg", "publishedAt": "2025-01-21T20:24:23Z", "content": "WASHINGTON Yesterday, Acting Department of Homeland Security Secretary Benjamine Huffman issued two directives essential to ending the invasion of the US southern border and empower law enforcement t… [+1256 chars]"}]}