{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Matt Damon and Ben Affleck talk about new film, 'The Last Duel' l GMA - Good Morning America", "description": "The two friends are back together on the big screen for a drama set in medieval France.LEARN MORE:Jennifer Lopez and Ben Affleck shine on 'The Last Duel' red...", "url": "https://www.youtube.com/watch?v=sbIGT3899MY", "urlToImage": "https://i.ytimg.com/vi/sbIGT3899MY/maxresdefault.jpg", "publishedAt": "2021-10-13T14:52:19Z", "content": null}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Popular theory of Native American origins debunked by genetics and skeletal biology: Latest scientific findings suggest the ancestral Native American population does not originate in Japan, as believed by many archeologists - Science Daily", "description": "A widely accepted theory of Native American origins coming from Japan has been attacked in a new scientific study, which shows that the genetics and skeletal biology 'simply does not match-up.'", "url": "https://www.sciencedaily.com/releases/2021/10/211013081606.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-10-13T13:51:01Z", "content": "A widely accepted theory of Native American origins coming from Japan has been attacked in a new scientific study, which shows that the genetics and skeletal biology \"simply does not match-up.\"The fi… [+5201 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "This drone robot created by an American lab could be Iron Man's distant cousin - The Star Online", "description": "Researchers at the California Institute of Technology (Caltech) have developed an amazing bipedal robot that can walk as well as fly.", "url": "https://www.thestar.com.my/tech/tech-news/2021/10/13/this-drone-robot-created-by-an-american-lab-could-be-iron-mans-distant-cousin", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/10/12/1328929.jpg", "publishedAt": "2021-10-13T00:00:00Z", "content": "Researchers at the California Institute of Technology (Caltech) have developed an amazing bipedal robot that can walk as well as fly. It may not look like Iron Man, but its agility is reminiscent of … [+1714 chars]"}]}