{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Mastodon Killed in Bloody Battle 13200 Years Ago – Reveals Extinct Animal's Annual Migration - SciTechDaily", "description": "Mastodons are relatives of elephants belonging to the genus Mammut that inhabited North and Central America before they went extinct about 10,000 to 11,000 years ago. Typical adults stood between 8 and 10 feet (2.5-3 m) tall at the shoulder and weighed around…", "url": "https://scitechdaily.com/mastodon-killed-in-bloody-battle-13200-years-ago-reveals-extinct-animals-annual-migration/", "urlToImage": "https://scitechdaily.com/images/Daniel-Fisher-With-Buesching-Mastodon-scaled.jpg", "publishedAt": "2022-06-14T05:38:08Z", "content": "University of Michigan paleontologist Daniel Fisher with a mounted skeleton of the Buesching mastodon, based on casts of individual bones produced in fiberglass, on public display at the University o… [+11173 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Amanda Coletta", "title": "Trudeau tests positive for coronavirus days after meeting Biden - The Washington Post", "description": "Canada's prime minister met with the president, House Speaker Nancy Pelosi and the leaders of several countries last week at the Summit of the Americas in Los Angeles.", "url": "https://www.washingtonpost.com/world/2022/06/13/canada-trudeau-covid-biden-summit-americas/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SR7MGCHIFQI6ZJBCCG53SHNTBM.jpg&w=1440", "publishedAt": "2022-06-13T20:44:00Z", "content": "Placeholder while article actions load\r\nTORONTO Prime Minister Justin Trudeau said Monday that he had tested positive for the coronavirus for a second time, days after meeting with President Biden an… [+1954 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "More data needed on stroke treatment and outcomes by sex, gender - EurekAlert", "description": "A new American Heart Association scientific statement highlights the need for more data and research about sex differences in the use and response to mechanical clot removal for acute ischemic stroke and suggests a clear differentiation between sex and gender…", "url": "https://www.eurekalert.org/news-releases/955765", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-06-13T15:54:54Z", "content": "Embargoed until 4 a.m. CT/5 a.m. ET Monday, June 13, 2022\r\nDALLAS, June 13, 2022 – A new American Heart Association scientific statement highlights the need for more data and research about sex diffe… [+6522 chars]"}]}