{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Birders flock to B.C. Interior for chance to spot rare avian visitor that has flown far off course - CBC.ca", "description": "A fieldfare, which is primarily found in Europe and Western Asia and traditionally migrates south to Africa, has mysteriously turned up in Kelowna, B.C., and is causing a flutter among North American birdwatchers.", "url": "https://www.cbc.ca/news/canada/british-columbia/fieldfare-sighting-kelowna-1.6715850", "urlToImage": "https://i.cbc.ca/1.6716049.1673915086!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/fieldfare.jpeg", "publishedAt": "2023-01-17T13:00:00Z", "content": "Avid birder Chris Charlesworth estimates it took him 60 seconds to vacate his house after he got the phone call last Tuesday.\r\nThe voice on the other end of the line was his friend and fellow birdwat… [+2666 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Indian-American Harmeet Dhillon says she is being attacked by fellow Republicans because of her Sikh faith - The Tribune India", "description": "Harmeet Dhillon, a prominent Indian-American attorney who is running for Republican National Committee (RNC) chairwoman, has alleged that she is facing bigoted attacks from her fellow party leaders because of her Sikh faith and asserted that she would not giv…", "url": "https://www.tribuneindia.com/news/diaspora/indian-american-harmeet-dhillon-says-she-is-being-attacked-by-fellow-republicans-because-of-her-sikh-faith-471193", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2023/1/2023_1$largeimg_80957906.jpg", "publishedAt": "2023-01-17T09:50:00Z", "content": "PTI\r\nWashington, January 17\r\nHarmeet Dhillon, a prominent Indian-American attorney who is running for Republican National Committee (RNC) chairwoman, has alleged that she is facing bigoted attacks fr… [+2483 chars]"}]}