{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Christina Applegate shares struggle living with MS l GMA - Good Morning America", "description": "The actress was diagnosed with multiple sclerosis in 2021 and spoke to The New York Times about what it took for her to finish the Netflix series “Dead to Me...", "url": "https://www.youtube.com/watch?v=vLPS32HEVno", "urlToImage": "https://i.ytimg.com/vi/vLPS32HEVno/maxresdefault.jpg", "publishedAt": "2022-11-02T15:05:06Z", "content": null}, {"source": {"id": null, "name": "Forbes"}, "author": "Mike Ozanian", "title": "Dan Snyder Hires Bank Of America To Sell Washington Commanders - Forbes", "description": "Neither the Commanders or Bank of America, which has handled such notable team sales as the purchase of the Los Angeles Clippers by Steve Ballmer, would comment.", "url": "https://www.forbes.com/sites/mikeozanian/2022/11/02/dan-snyder-hires-bank-of-america-to-sell-washington-commanders/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/636280348751015e2908fd10/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-11-02T14:40:08Z", "content": "Whoever buys the Commanders gets the talented Terry McLaurin, No. 17. (Photo by Mitchell Layton/Getty Images)\r\nGetty Images\r\nDan Snyder has retained BofA Securities to sell the Washington Commanders,… [+1567 chars]"}, {"source": {"id": null, "name": "Provideocoalition.com"}, "author": null, "title": "Fujifilm Announces the X-T5, Set for Release in Late November by Kenny McMillan - ProVideo Coalition - ProVideo Coalition", "description": "FUJIFILM North America Corporation is pleased to announce the introduction of the FUJIFILM X-T5 digital camera (X-T5), the latest addition to Fujifilm’s innovative line of X Series, X-T mirrorless digital cameras. Fujifilm brings its fifth-generation imaging …", "url": "https://www.provideocoalition.com/fujifilm-announces-the-x-t5-set-for-release-in-late-november/", "urlToImage": "https://www.provideocoalition.com/wp-content/uploads/16782337_MAIN00_Image_X-T5_front_CMOS_silver-800x800.jpg", "publishedAt": "2022-11-02T14:00:11Z", "content": "FUJIFILM North America Corporation is pleased to announce the introduction of the FUJIFILM X-T5 digital camera (X-T5), the latest addition to Fujifilms innovative line of X Series, X-T mirrorless dig… [+5805 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Q.ai - Powering a Personal Wealth Movement", "title": "With The SpaceX Falcon Heavy Launch A Success, Can You Invest In Elon Musk’s Mission To Mars? - Forbes", "description": "SpaceX recently completed a further venture capital raise, valuing the company at $127 billion. That's more than Goldman Sachs and American Express.", "url": "https://www.forbes.com/sites/qai/2022/11/02/with-the-spacex-falcon-heavy-launch-a-success-can-you-invest-in-elon-musks-mission-to-mars/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/63624b584e9a2d4ccdde53f7/0x0.jpg?format=jpg&width=1200", "publishedAt": "2022-11-02T12:00:17Z", "content": "Key Takeaways\r\n<ul><li>SpaceX completed a successful launch of the most powerful rocket in the world, the Falcon Heavy.</li><li>Its just the latest successful launch for the rocket, which is expected… [+8852 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published online ah - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; lithologic controls on microfracturing from legacy underground nuclear explosions;…", "url": "https://www.eurekalert.org/news-releases/969932", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-02T06:31:59Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; l… [+26899 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "Beaver Blood Moon lunar eclipse: The ultimate guide - Space.com", "description": "A reddish moon will be visible on Nov. 8 for 85 minutes from North America, parts of South America, Asia, Australia and New Zealand.", "url": "https://www.space.com/blood-moon-lunar-eclipse-november-2022-guide", "urlToImage": "https://cdn.mos.cms.futurecdn.net/rJSiHXuecQPsMCqxmhFke3-1200-80.jpg", "publishedAt": "2022-11-01T10:00:01Z", "content": "The second total lunar eclipse\r\n of 2022 will turn the moon a reddish-copper color for 85 minutes on Nov. 8, 2022, though what you'll see during this safe naked-eye event will depend on your location… [+14410 chars]"}]}