{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Hanna, Pamela Kirkland and Alta Spells, CNN", "title": "Two of the men convicted of killing Ahmaud Arbery used racist slurs in messages, a witness testifies at their federal hate crime trial - CNN", "description": "Texts and social media messages from two of the White men convicted of murdering Ahmaud Arbery included racist insults about African Americans, an FBI intelligence analyst testified Wednesday in their federal hate crime trial in Georgia.", "url": "https://www.cnn.com/2022/02/16/us/ahmaud-arbery-hate-crime-trial-wednesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220216141355-travis-mcmichael-william-bryan-split-super-tease.jpg", "publishedAt": "2022-02-17T04:27:00Z", "content": "(CNN)Texts and social media messages from two of the White men convicted of murdering Ahmaud Arbery included racist insults about African Americans, an FBI intelligence analyst testified Wednesday in… [+10010 chars]"}, {"source": {"id": null, "name": "ComicBook.com"}, "author": "Tanner Dedmon", "title": "League of Legends: Wild Rift Bringing Back Voice Chat - ComicBook.com", "description": "League of Legends: Wild Rift's voice chat feature is making a return in the next update, Riot Games announced this week. Patch 3.0 will bring about the return of the voice chat option which will be limited to a test in the America for now before coming to oth…", "url": "https://comicbook.com/gaming/news/league-of-legends-wild-rift-voice-chat/", "urlToImage": "https://sportshub.cbsistatic.com/i/2021/03/18/6986113c-aa7f-481d-b108-23b734eedc03/league-of-legends-draven-1221724.jpg?width=1200", "publishedAt": "2022-02-16T20:00:00Z", "content": "League of Legends: Wild Rift's voice chat feature is making a return in the next update, Riot Games announced this week. Patch 3.0 will bring about the return of the voice chat option which will be l… [+2110 chars]"}, {"source": {"id": null, "name": "Barrick.com"}, "author": null, "title": "Barrick Delivers on Guidance, Opens New Exploration Frontiers - Barrick Gold Corporation", "description": "Driven by strong performances from its Africa & Middle East and Latin America regions, Barrick’s production in 2021 was in line with guidance for the third successive year. The Company also more than replaced its gold reserves net of depletion at a better gra…", "url": "https://www.barrick.com/English/news/news-details/2022/q4-2021-results/default.aspx", "urlToImage": "https://s25.q4cdn.com/322814910/files/images/news/2022/01_q4-21_results.jpg", "publishedAt": "2022-02-16T11:15:04Z", "content": "Full Year and Fourth Quarter 2021 ResultsAll amounts expressed in U.S. dollars\r\nToronto Driven by strong performances from its Africa &amp; Middle East and Latin America regions, Barricks production … [+153753 chars]"}]}