{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Updated policy regarding electronic nicotine delivery systems - Medical Xpress", "description": "The American Society of Clinical Oncology (ASCO) and the American Association for Cancer Research (AACR) have issued an updated policy, regarding the use of electronic nicotine delivery systems (ENDS). Roy S. Herbst, MD, Ph.D., is corresponding author on the …", "url": "https://medicalxpress.com/news/2022-10-policy-electronic-nicotine-delivery.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/american-society-of-cl.jpg", "publishedAt": "2022-10-26T19:40:04Z", "content": "The American Society of Clinical Oncology (ASCO) and the American Association for Cancer Research (AACR) have issued an updated policy, regarding the use of electronic nicotine delivery systems (ENDS… [+4200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business, Vanessa Yurkevich", "title": "Threat of rail strike rises as members of another union reject proposed labor deal - CNN", "description": "Rank and file members of another railroad union have rejected a tentative labor deal, a move that further raises the odds that America's freight railroad workers will go on strike sometime next month.", "url": "https://www.cnn.com/2022/10/26/business/railroad-strike-threat/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221026120621-restricted-us-railroad-strikes-threat.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-26T19:15:00Z", "content": "Rank and file members of another railroad union have rejected a tentative labor deal, a move that further raises the odds that Americas freight railroad workers will go on strike sometime next month.… [+6659 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Jiovanni Lieggi", "title": "NASA scientists working on ground missions in preparation to put American boots back on the moon - Fox Business", "description": "In preparation for future Artemis space mission's, NASA is training in northern Arizona using a prototype, pressurized moon rover that will be used on the moon and eventually Mars.", "url": "https://www.foxbusiness.com/technology/nasa-scientists-working-ground-missions-preparation-put-american-boots-back-moon", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2022/10/0/0/ROVER2.jpg?ve=1&tl=1", "publishedAt": "2022-10-26T05:06:17Z", "content": "FLAGSTAFF, Ariz. – NASA plans to launch the rocket ship Artemis I into space in just less than a month. It’s part of the plan to get Americans back on the moon and to explore more of space. It would … [+2633 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "American singer Kelis shares video showing 2 women in Singapore touching her hair without permission - Channel NewsAsia", "description": "The Milkshake singer was sitting at a coffee shop when two women standing behind her started touching her braids and exclaiming about its length and whether it was real.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/kelis-video-women-singapore-touching-braids-hair-336996", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--ZkmCW7WX--/c_crop,h_864,w_1536,x_0,y_22/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/10/26/kelis_video_of_women_touching_her_hair.jpg?itok=3LTIjdU6", "publishedAt": "2022-10-26T04:27:24Z", "content": "It appeared that Kelis was initially trying to approach the interaction with good humour, even turning around to touch one of the womens hair in response, but the singer mostly looked bemused and res… [+1582 chars]"}]}