{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Brianna Morris-Grant", "title": "US warplane shoots down unidentified object flying over northern Canada on Prime Minister Justin Trudeau's orders - ABC News", "description": "The object is the third known to have violated North American airspace in the past two weeks, with Canada's defence minister saying it posed a \"reasonable threat\" to civilian flight.", "url": "https://www.abc.net.au/news/2023-02-12/canada-airspace-unidentified-object-shot-down/101962786", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/643a754a4362fef947454553f4c4a3f0?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2023-02-11T22:31:11Z", "content": "A \"small, cylindrical object\" shot down by a US warplane while flying over northern Canada posed a \"reasonable threat\", according to Canada's defence minister.\r\n<ul><li>The object is the third known … [+2392 chars]"}, {"source": {"id": null, "name": "Viewfromthewing.com"}, "author": "Gary Leff", "title": "Report: Southwest Airlines CEO Flew American Back To Dallas After Pilots Walked Out On Him At Rally - View from the Wing", "description": "On Wednesday Southwest Airlines held an employee rally in Baltimore and pilots, in the midst of a contract negotiation with the airline, walked out on CEO Bob Jordan, reminiscent of United Airlines pilots turning their back on their own CEO in December.  Jord…", "url": "https://viewfromthewing.com/report-southwest-airlines-ceo-flew-american-back-to-dallas-after-pilots-walked-out-on-him-at-rally/", "urlToImage": "https://viewfromthewing.com/wp-content/uploads/2023/02/bob-jordan.jpg", "publishedAt": "2023-02-11T21:04:12Z", "content": "On Wednesday Southwest Airlines held an employee rally in Baltimore and pilots, in the midst of a contract negotiation with the airline, walked out on CEO Bob Jordan, reminiscent of United Airlines p… [+2166 chars]"}, {"source": {"id": null, "name": "Common Dreams"}, "author": "https://www.facebook.com/32109457015", "title": "What Do Trump's Racism, Expensive Eggs, and a Bird Flu Pandemic Have in Common? - Common Dreams", "description": "Trump’s no longer president, but he and his racism could still be responsible for millions more American deaths from a new pandemic disease. How and why? I’ll explain in just a moment, but first let’s look at the disease itself.", "url": "https://www.commondreams.org/opinion/trump-egg-prices-bird-flu", "urlToImage": "https://www.commondreams.org/media-library/a-hen.jpg?id=33010308&width=1200&height=600&coordinates=0%2C85%2C0%2C86", "publishedAt": "2023-02-10T18:19:00Z", "content": "Trumps no longer president, but he and his racism could still be responsible for millions more American deaths from a new pandemic disease. How and why? Ill explain in just a moment, but first lets l… [+16011 chars]"}]}