{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-verge", "name": "The Verge"}, "author": "Allison Johnson", "title": "The Asus Zenfone 12 Ultra is skipping the US - The Verge", "description": "The Asus Zenfone 12 Ultra is a re-worked ROG Phone 9 Pro with a Snapdragon 8 Elite chipset and a big 6.78-inch screen. This year, it’s skipping North America.", "url": "https://www.theverge.com/news/605968/asus-zenfone-12-ultra-price-specs", "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/02/zenfone_1_lg.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200", "publishedAt": "2025-02-06T06:30:00Z", "content": "The re-worked ROG phone wont land in North America this year.\r\nThe re-worked ROG phone wont land in North America this year.\r\nThe Zenfone 12 Ultra officially launches today, but unlike previous gener… [+2231 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Laura Italiano", "title": "Judge weighs interim ban on Elon Musk's DOGE accessing the financial data of millions of Americans - Business Insider", "description": "Elon Musk has no access to the Treasury's tax and Social Security data, a government lawyer said. A DC judge is mulling keeping it that way for now.", "url": "https://www.businessinsider.com/judge-weighs-ban-musk-doge-accessing-americans-fiscal-data-2025-2", "urlToImage": "https://i.insider.com/67a3e5cceb4be2fff9a3af70?width=1024&format=jpeg", "publishedAt": "2025-02-05T23:56:00Z", "content": "A federal judge said Wednesday that she might immediately block the Treasury Department from directly sharing the personal financial data of millions of Americans with Elon Musk's Department of Gover… [+4163 chars]"}, {"source": {"id": null, "name": "Justice.gov"}, "author": null, "title": "3 men believed to be part of South American Theft Group indicted for federal crimes related to burglary of NFL player’s Cincinnati home - Department of Justice", "description": "CINCINNATI – A federal grand jury in Cincinnati has charged defendants believed to be operating as part of a South American Theft Group with transporting stolen goods interstate and falsifying records in a federal investigation. The three men allegedly commit…", "url": "https://www.justice.gov/usao-sdoh/pr/3-men-believed-be-part-south-american-theft-group-indicted-federal-crimes-related", "urlToImage": "https://www.justice.gov/sites/all/modules/features/doj_sharing/images/doj-seal-fb.jpg", "publishedAt": "2025-02-05T21:06:04Z", "content": "CINCINNATI A federal grand jury in Cincinnati has charged defendants believed to be operating as part of a South American Theft Group with transporting stolen goods interstate and falsifying records … [+4376 chars]"}, {"source": {"id": null, "name": "Scientific American"}, "author": "Jack Tamisiea", "title": "Bonobos Can Tell When a Human Doesn’t Know Something - Scientific American", "description": "An experiment shows that bonobos can understand when a human lacks knowledge and point them in the right direction", "url": "https://www.scientificamerican.com/article/bonobos-can-tell-when-a-human-doesnt-know-something/", "urlToImage": "https://static.scientificamerican.com/dam/m/5143ec34ba2d6e3b/original/female-bonobo.jpg?m=1738610578.458&w=1200", "publishedAt": "2025-02-03T20:00:00Z", "content": "A few captive bonobos recently faced a seemingly simple task: locate a tasty snack hidden under one of three cups. Because bonobos are brainiacs, pinpointing the cup with the treat should have been n… [+4822 chars]"}]}