{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Global News"}, "author": "Mike Blanchfield", "title": "Business leaders wary of remaining restrictions ahead of Canada-U.S. land border reopening - Global News", "description": "They argue that the continued testing requirement is too cumbersome for Canadian business travellers wanting a quick visit to an American destination.", "url": "https://globalnews.ca/news/8355120/canada-us-border-testing-rule/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/02/GettyImages-1207638595-e1613794517238.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-11-06T11:48:33Z", "content": "Monday’s reopening of the Canada-U.S. land border is sparking a mixed reaction among Canadian business leaders: They’re excited that people and not just goods will be crossing the border again but ar… [+5978 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Movement to keep fossil fuels in the ground gaining momentum in Canada and abroad - CBC.ca", "description": "Quebec joined the Beyond Oil and Gas Alliance this week — becoming the first North American member of a new group being launched at the United Nations climate conference that wants to phase out the production of oil and gas.", "url": "https://www.cbc.ca/news/science/fossil-fuels-cop26-extraction-1.6238403", "urlToImage": "https://i.cbc.ca/1.6238475.1636133425!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pictures-of-the-week-photo-gallery.jpg", "publishedAt": "2021-11-06T08:00:00Z", "content": "Our planet is changing. So is our journalism. This story is part of a CBC News initiative entitled Our Changing Planet to show and explain the effects of climate change and what is being done about i… [+8209 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BMPlus", "title": "Groups sue Tennessee over law against trans school athletes | BMPlus - Business Mirror", "description": "NASHVILLE, Tennessee — Two civil rights groups filed a federal court challenge Thursday against a Tennessee law that bars transgender athletes from playing public high school or middle school sports aligned with their gender identity. The American Civil Liber…", "url": "https://businessmirror.com.ph/2021/11/05/groups-sue-tennessee-over-law-against-trans-school-athletes/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/11/BusinessMirror-BM-lettermark.jpg", "publishedAt": "2021-11-05T11:02:00Z", "content": "NASHVILLE, Tennessee Two civil rights groups filed a federal court challenge Thursday against a Tennessee law that bars transgender athletes from playing public high school or middle school sports al… [+3488 chars]"}]}