{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mary Clare Jalonick", "title": "At the center of shutdown fight, health care is one of the most intractable issues in Congress - AP News", "description": "Democrats believe health care is an issue that resonates with a majority of Americans as they demand an extension of subsidies in exchange for their votes to reopen the shuttered U.S. government. But it is also one of the most intractable issues in Congress a…", "url": "https://apnews.com/article/shutdown-health-care-subsidies-obamacare-congress-10b2ae9648bc5252fc2bd485ddc83493", "urlToImage": "https://dims.apnews.com/dims4/default/77acd32/2147483647/strip/true/crop/5705x3209+0+297/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fee%2Fea%2Ff816191a85cb1a7c8b801b9d1215%2Faac66c3cc4d345c995922490c65fd912", "publishedAt": "2025-10-07T13:19:00Z", "content": "WASHINGTON (AP) Democrats believe health care is an issue that resonates with a majority of Americans as they demand an extension of subsidies for their votes to reopen the shuttered U.S. government.… [+5554 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby", "title": "Most Americans are still guaranteed to get Covid-19 vaccines at no cost — for now - CNN", "description": "Most Americans with health insurance should not have to pay out of pocket for Covid-19 vaccines, even after the US Centers for Disease Control and Prevention added an extra hurdle to getting the shot. But some people could face new costs.", "url": "https://www.cnn.com/2025/10/07/health/covid-19-vaccine-free-health-insurance", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2025-10-02t215612z-783140658-rc2s3ha6pfsx-rtrmadp-3-usa-vaccines.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-10-07T11:39:34Z", "content": "Most Americans with health insurance should not have to pay out of pocket for Covid-19 vaccines, even after the US Centers for Disease Control and Prevention added an extra hurdle to getting the shot… [+5856 chars]"}]}