{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Hubble Confirms Megacomet Bound for Inner Solar System Is Largest Ever Seen - Scientific American", "description": "The icy nucleus stretches about 80 miles (129 kilometers) across.", "url": "https://www.space.com/hubble-space-telescope-largest-comet-nucleus-bernardinelli-berstein", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Vqng8xKKGPdCbUfhFHW9SM-1200-80.jpg", "publishedAt": "2022-04-14T13:00:04Z", "content": "These images from the Hubble Space Telescope show the comet C/2014 UN271 (Bernardinelli-Berstein), the biggest comet ever seen, NASA says. (Image credit: NASA, ESA, Man-To Hui (Macau University of Sc… [+5315 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moderate Geomagnetic Storm To Hit Earth Today, Says NASA - NDTV", "description": "American space agency National Aeronautics and Space Administration (NASA) has said that a geomagnetic storm, triggered by a high-intensity Coronal Mass Ejection (CME) on the Sun, is expected to hit the Earth on Thursday.", "url": "https://www.ndtv.com/world-news/moderate-geomagnetic-storm-to-hit-earth-today-says-nasa-2887437", "urlToImage": "https://c.ndtvimg.com/2022-04/8j1bqo9_geomagnetic-650_625x300_14_April_22.jpg", "publishedAt": "2022-04-14T07:18:01Z", "content": "A geomagnetic storm is expected to hit the Earth on Thursday.\r\nAmerican space agency National Aeronautics and Space Administration (NASA) has said that a geomagnetic storm, triggered by a high-intens… [+2264 chars]"}, {"source": {"id": null, "name": "American Council on Science and Health"}, "author": null, "title": "The Clinical Trial That Should (But Probably Won't) Close the Book on Ivermectin - American Council on Science and Health", "description": "The controversy surrounding ivermectin as a therapy for COVID has been longstanding and fierce. A recent paper in NEJM may or may not settle the ongoing debate. But the paper is full of data. Here is a condensed look at the key numbers.", "url": "https://www.acsh.org/news/2022/04/13/clinical-trial-should-probably-wont-close-book-ivermectin-16244", "urlToImage": "https://www.acsh.org/sites/default/files/images/Screen%20Shot%202022-04-13%20at%2011.00.46%20AM.png", "publishedAt": "2022-04-13T15:04:53Z", "content": "About a week ago, news outlets reported that a large randomized controlled trial showed that ivermectin had no impact on COVID. At that time, only scant data on which the conclusions were based were … [+6315 chars]"}]}