{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "US Congresswoman Writes to Biden Over Covid-19 Situation in India - News18", "description": "Congresswoman Deborah Ross represents North Carolina, where a sizeable amount of Indian-Americans reside and have expressed concern over the health of family members back in India", "url": "https://www.news18.com/news/india/us-congresswoman-writes-to-biden-over-covid-19-situation-in-india-3708116.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/04/1618543558_2021-04-15t172014z_2_lynxmpeh3e18x_rtroptp_4_usa-biden-afghanistan-1.jpg", "publishedAt": "2021-05-05T02:09:27Z", "content": "Expressing concern over a massive surge in COVID-19 cases in India, a Congresswoman has written to US President Joe Biden urging him to accelerate Americas assistance to India in terms of oxygen cyli… [+3517 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Biden's new goal: 70% of Americans vaccinated for COVID-19 by July 4 - CBC.ca", "description": "U.S. President Joe Biden is setting a new vaccination goal to deliver at least one dose to 70 per cent of adult Americans by July 4, the White House said Tuesday, as the administration pushes to make it easier for people to get shots and to bring the country …", "url": "https://www.cbc.ca/news/world/biden-covid-vaccine-goals-1.6013476", "urlToImage": "https://i.cbc.ca/1.6013542.1620154765!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/usa-biden.JPG", "publishedAt": "2021-05-04T19:36:12Z", "content": "U.S. President Joe Biden is setting a new COVID-19 vaccination goal to deliver at least one dose to 70 per cent of adult Americans by July 4, the White House said Tuesday, as the administration pushe… [+4914 chars]"}, {"source": {"id": null, "name": "PR Web"}, "author": null, "title": "CGTN America: China Launches the Core Module of its Space Station - PR Web", "description": "WASHINGTON (PRWEB) May 03, 2021 \n\n FOR IMMEDIATE RELEASE (This material is distributed by MediaLinks TV, LLC on behalf of CCTV. Additional information is available at the Department of Justice, Wash", "url": "https://www.prweb.com/releases/cgtn_america_china_launches_the_core_module_of_its_space_station/prweb17906928.htm", "urlToImage": null, "publishedAt": "2021-05-03T16:01:03Z", "content": "Chinas first space station Tiangong, which means \"heavenly palace\" in Chinese, is scheduled to be completed by the end of 2022.\r\nWASHINGTON (PRWEB)May 03, 2021\r\n FOR IMMEDIATE RELEASE (This material … [+1676 chars]"}]}