{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Apoorva Mandavilli", "title": "COVID delta variant as contagious as chickenpox, vaccine breakthrough cases can still spread virus: US CDC - Firstpost", "description": "Infections in vaccinated Americans also may be as transmissible as those in unvaccinated people, the document said, and lead more often to severe illness.", "url": "https://www.nytimes.com/2021/07/30/health/covid-cdc-delta-masks.html", "urlToImage": "https://static01.nyt.com/images/2021/07/29/multimedia/29virus-delta-2/merlin_191059200_7dedd77d-04cb-474e-8a58-db15ce61146f-facebookJumbo.jpg", "publishedAt": "2021-07-30T07:22:21Z", "content": "But the internal document hints that even that recommendation may not go far enough. Given higher transmissibility and current vaccine coverage, universal masking is essential, the document said.\r\nTh… [+1517 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Alexandra Jaffe, Ricardo Alonso-zaldivar and Jonathan Lemire", "title": "Coronavirus: Biden pushes US federal workers to get vaccinated - CTV News", "description": "U.S. President Joe Biden has announced sweeping new pandemic requirements aimed at boosting vaccination rates for millions of federal workers and contractors as he lamented the 'American tragedy' of rising-yet-preventable deaths among the unvaccinated.", "url": "https://www.ctvnews.ca/health/coronavirus/biden-orders-tough-new-vaccination-rules-for-federal-workers-1.5528309", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5330784.1614722314!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-07-29T20:50:00Z", "content": "WASHINGTON -- \r\nU.S. President Joe Biden has announced sweeping new pandemic requirements aimed at boosting vaccination rates for millions of federal workers and contractors as he lamented the \"Ameri… [+7294 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Zimbabwe: U.S. Surgeon General Says Putting a Mask Back On Will Help, but Vaccinations Will Stonewall the Pandemic - AllAfrica.com", "description": "While people putting their masks back on indoors will help reduce the spread of Covid-19 across the country, getting more Americans vaccinated is still central to ending the pandemic, US Surgeon General Dr. Vivek Murthy said Tuesday.", "url": "https://allafrica.com/stories/202107290785.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-07-29T13:35:30Z", "content": "While people putting their masks back on indoors will help reduce the spread of Covid-19 across the country, getting more Americans vaccinated is still central to ending the pandemic, US Surgeon Gene… [+1817 chars]"}]}