{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "Reuters", "title": "WHO 'Strongly Advises Against' Use of 2 Antibody COVID Treatments - Voice of America - VOA News", "description": "Mounting evidence from lab tests suggests therapies, sotrovimab and casirivimab-imdevimab, have limited clinical activity against latest iterations of virus", "url": "https://www.voanews.com/a/who-strongly-advises-against-use-of-2-antibody-covid-treatments/6749572.html", "urlToImage": "https://gdb.voanews.com/09840000-0aff-0242-e833-08da9774436e_w1200_r1.jpg", "publishedAt": "2022-09-15T23:52:09Z", "content": "London  Two COVID-19 antibody therapies are no longer recommended by the World Health Organization because omicron and the variant's latest offshoots have likely rendered them obsolete.\r\nThe two ther… [+2131 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Discovery of extinct prehistoric reptile that lived among dinosaurs - Science Daily", "description": "Researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists describe the new species Opisthiamimus gregori, which once inhabited Jurassic North America…", "url": "https://www.sciencedaily.com/releases/2022/09/220915123701.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-15T17:08:06Z", "content": "Smithsonian researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists, including the Nati… [+5762 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Yushi Nohara", "title": "Finally! EMUI 12 fetched for more Huawei Y8p users - HC Newsroom", "description": "Huawei already activated the release of the EMUI 12 for Huawei Y8p users and in the meantime company is working to expand its reach to other users including the Middle East & Africa, and Latin America. This latest update for the Huawei Y8p users can be identi…", "url": "https://www.huaweicentral.com/finally-emui-12-fetched-for-more-huawei-y8p-users/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/09/Huawei-Y8p-EMUI-12-1000x576.jpg", "publishedAt": "2022-09-15T16:04:02Z", "content": "Huawei is now expanding the stable EMUI 12 software for more Huawei Y8p/P Smart S consumers in the global market. Alongside bringing new features and functionalities the update comes with new customi… [+1658 chars]"}]}