{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "America's Cup: Team NZ hit back at Mark Dunphy's plans - Stuff.co.nz", "description": "Team members break silence on rich-lister's bid to remove Grant Dalton, describing it as &quot;mind-boggling&quot; and undermining and compromising their Cup defence.", "url": "https://www.stuff.co.nz/sport/americas-cup/126257982/americas-cup-team-nz-hit-back-at-mark-dunphys-plans", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/r/h/u/k/image.related.StuffLandscapeSixteenByNine.1420x800.2365a6.png/1630485478296.jpg", "publishedAt": "2021-09-01T08:37:00Z", "content": "Members of Team New Zealand have hit back at Mark Dunphy, accusing him of compromising their attempts to defend the Americas Cup and describing his call for the head of syndicate boss Grant Dalton as… [+3994 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": "Wenlei Ma", "title": "Unexpected emotional reaction to Marvel film - NEWS.com.au", "description": "<p>Could an Asian-American superhero in a gargantuan Marvel epic actually change hearts and minds? Could it make the world more inclusive?</p>", "url": "https://www.news.com.au/entertainment/movies/new-movies/the-great-hope-of-marvel-movie-shangchi-and-the-legend-of-the-ten-rings/news-story/641651e85657966e8e90b57b89d2499a", "urlToImage": "https://content.api.news/v3/images/bin/b75d9848ba2ab67de41cdf306ca857f1", "publishedAt": "2021-09-01T06:33:22Z", "content": "More than just kapows and booms, Marvels latest superhero movie might have you reaching for the phone.Could an Asian-American superhero in a gargantuan Marvel epic actually change hearts and minds? C… [+6938 chars]"}, {"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "Biden gives a defiant defense of the withdrawal from Afghanistan: 'I was not extending a forever exit' - CNN Philippines", "description": "President Joe Biden on Tuesday offered a vigorous defense of his decision to withdraw US troops from Afghanistan, defending the chaotic withdrawal from Kabul a day after the last American military planes left the country, marking the conclusion of the US' lon…", "url": "http://cnnphilippines.com/world/2021/9/1/Biden-defense-withdrawal-Afghanistan-.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2018/10/10/Joe-Biden_CNNPH.png/jcr:content/Joe-Biden_CNNPH.png", "publishedAt": "2021-09-01T03:15:31Z", "content": "(CNN) President Joe Biden on Tuesday offered a vigorous defense of his decision to withdraw US troops from Afghanistan, defending the chaotic withdrawal from Kabul a day after the last American milit… [+9091 chars]"}, {"source": {"id": null, "name": "Gold Derby"}, "author": "Marcus James Dixon", "title": "‘America’s Got Talent’ finale predictions: 5 acts advancing from semifinals will be Aidan Bryant, Peter Rosalita … - Gold Derby", "description": "All week long, “America’s Got Talent” fans have been making their predictions for which of the semifinalists from Group 1 will be advancing to the finale, and the results are in. The five acts most likely to get the green light during Wednesday’s results show…", "url": "https://www.goldderby.com/article/2021/americas-got-talent-finale-predictions-aidan-bryant-peter-rosalita/", "urlToImage": "https://www.goldderby.com/wp-content/uploads/2021/08/Aidan-Bryant-americas-got-talent.jpg", "publishedAt": "2021-09-01T02:32:00Z", "content": "All week long, “America’s Got Talent” fans have been making their predictions for which of the semifinalists from Group 1 will be advancing to the finale, and the results are in. The five acts most l… [+5391 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "U.S. rail regulator rejects CN's voting trust bid to buy Kansas City Southern - CBC.ca", "description": "American railway regulator the Surface Transportation Board has blocked Canadian National Railway's bid to buy Kansas City Southern in its current form because the deal would include a voting trust that runs afoul of the rules.", "url": "https://www.cbc.ca/news/business/cn-rail-1.6159856", "urlToImage": "https://i.cbc.ca/1.6159883.1630434672!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/kc-southern-earns.jpg", "publishedAt": "2021-08-31T19:26:07Z", "content": "American railway regulator the Surface Transportation Board has blocked Canadian National Railway's bid to buy Kansas City Southern in its current form because the deal would include a voting trust t… [+2165 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Taliban supporters hold mock U.S. funeral as troops leave Afghanistan - The Star Online", "description": "(Reuters) -     Taliban supporters paraded coffins draped with American and NATO flags in the eastern city of Khost on Tuesday, part of celebrations across the country following the withdrawal of the last U.S. troops.", "url": "https://www.thestar.com.my/news/world/2021/09/01/taliban-supporters-hold-mock-us-funeral-as-troops-leave-afghanistan", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/09/01/1276933.jpg", "publishedAt": "2021-08-31T17:53:00Z", "content": "(Reuters) - Taliban supporters paraded coffins draped with American and NATO flags in the eastern city of Khost on Tuesday, part of celebrations across the country following the withdrawal of the las… [+2219 chars]"}]}