{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "The House passes billions in aid for Ukraine and Israel after months of struggle - Moneycontrol", "description": "With overwhelming support, the House approved the Ukraine portion, a $61 billion aid package, in a strong showing of American backing as lawmakers race to deliver a fresh round of US support to the war-torn ally. Some lawmakers cheered, waiving blue-and-yello…", "url": "https://www.moneycontrol.com/news/world/the-house-passes-billions-in-aid-for-ukraine-and-israel-after-months-of-struggle-12684121.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2024/04/The-House.jpg", "publishedAt": "2024-04-21T01:07:04Z", "content": "The House is pushing swiftly through a series of votes in a rare Saturday session to approve USD 95 billion in foreign aid for Ukraine, Israel and other US allies, Democrats and Republicans joining t… [+7149 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maria Kostenko, Andrew Carey, Frederik Pleitgen, Tamar Michaelis, Samantha Waldenberg, Daria Tarasova-Markina", "title": "‘Thank You America!’: Ukraine’s Zelensky and Israel’s Netanyahu hail House passage of $95 billion foreign aid package - CNN", "description": "Foreign leaders say the decision will help defend democracy and Western civilization. Ukrainian troops say it’s a morale booster. On Kyiv’s streets, there’s gratitude – and realism.", "url": "https://www.cnn.com/2024/04/20/world/foreign-aid-bill-ukraine-israel-thank-you-intl-latam/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/20240420-zelensky-netanyahu-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-04-20T23:26:00Z", "content": "Ukrainian President Volodymyr Zelensky and Israeli leader Benjamin Netanyahu have thanked US lawmakers after they voted in favor of new aid packages for their countries worth billions of dollars.\r\nTh… [+8141 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": "John Yang, Kaisha Young", "title": "Why the unionization of Tennessee Volkswagen workers is a big breakthrough for UAW - PBS NewsHour", "description": "Employees at Volkswagen's plant in Chattanooga, Tennessee, have overwhelmingly voted to join the United Auto Workers union. It's the first time workers at a foreign car maker's plant in the American South have unionized, giving UAW a foothold in the least-uni…", "url": "https://www.pbs.org/newshour/show/why-the-unionization-of-tennessee-volkswagen-workers-is-a-big-breakthrough-for-uaw", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2024/04/Labor-1024x683.jpg", "publishedAt": "2024-04-20T21:40:03Z", "content": "Employees at Volkswagens plant in Chattanooga, Tennessee, have overwhelmingly voted to join the United Auto Workers union. Its the first time workers at a foreign car makers plant in the American Sou… [+160 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Lifestyle Desk", "title": "Risk of heart disease rises sharply in women after menopause, study - The Times of India", "description": "According to new data presented at the American College of Cardiology's Annual Scientific Session, a woman's cardiovascular risk can increase dramatic", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/risk-of-heart-disease-rises-sharply-in-women-after-menopause-study/articleshow/109453468.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-109453482,width-1070,height-580,imgsize-1131078,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2024-04-20T10:30:00Z", "content": null}]}