{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Andrew Greene", "title": "Submarine jobs will be sent offshore under nuclear deal with US and UK, defence suppliers say - ABC News", "description": "Local defence suppliers fear a decision to harness American and British technology to build Australian nuclear-powered submarines will see significant amounts of work go offshore.", "url": "https://www.abc.net.au/news/2021-10-01/defence-suppliers-fear-nuclear-submarine-jobs-overseas/100504356", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/b996322dda9af5ee37df398b62e66c28?impolicy=wcms_crop_resize&cropH=1010&cropW=1797&xPos=15&yPos=100&width=862&height=485", "publishedAt": "2021-09-30T19:01:34Z", "content": "Australia's switch to nuclear-powered submarines is prompting a government push for the fleet to be built faster, possibly at the expense of local industry content, to make up for time lost under the… [+4392 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "Charles Maynes", "title": "Russians Reflect On America's Afghanistan Withdrawal Vs. The Soviet Exit - NPR", "description": "Veterans of the Soviet Union's decade-long war in Afghanistan see parallels — and stark contrasts — with the U.S. experience and exit after two decades there.", "url": "https://www.npr.org/2021/09/30/1040536017/afghanistan-withdrawal-russia-soviet-afghan-war-veterans", "urlToImage": "https://media.npr.org/assets/img/2021/09/29/whatsapp-image-2021-09-17-at-18.47.38-edit_wide-09fcb3bf0d1216f669dafb7d33f45a12e915db0a.jpg?s=1400", "publishedAt": "2021-09-30T15:56:00Z", "content": "Over half a million Soviet troops served in Afghanistan between 1979 and 1989. Among the first deployed was Rustam Khodzhayev, seen posing here (front row, first from the left) with his special opera… [+12326 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "New dinosaur species found in Brazil, roamed earth 70 million years ago - Zee News", "description": "In a startling discovery, scientists recently discovered a new dinosaur species in Brazil which most likely roamed the southeast part of America around 70 million years ago. The fossils of the species was unearthed in Brazil by a team of paleontologists.", "url": "https://zeenews.india.com/science/new-dinosaur-species-found-in-brazil-roamed-earth-70-million-years-ago-2398587.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2021/09/30/975365-dinosaur-brazil.jpg", "publishedAt": "2021-09-30T13:47:56Z", "content": "In a startling discovery, scientists recently discovered a new dinosaur species in Brazil which most likely roamed the southeast part of America around 70 million years ago. The fossils of the specie… [+1135 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Richard Lloyd Parry", "title": "Kim Jong-un offers to restore hotline with South Korea as he rebuffs America - The Times", "description": "The United States is “utterly unchanged” in its hostility towards North Korea, the country’s supreme leader, Kim Jong-un, declared in a scathing rebuttal of American diplomatic overtures.", "url": "https://www.thetimes.co.uk/article/kim-jong-un-offers-to-restore-hotline-with-south-korea-as-he-rebuffs-america-wxz5hjw6x", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F6541326c-21c4-11ec-a1fd-37d9030e4d65.jpg?crop=3856%2C2169%2C198%2C244&resize=1200", "publishedAt": "2021-09-30T08:30:00Z", "content": "The United States is utterly unchanged in its hostility towards North Korea, the countrys supreme leader, Kim Jong-un, declared in a scathing rebuttal of American diplomatic overtures.\r\nBut he promis… [+583 chars]"}]}