{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Arab News"}, "author": null, "title": "African scientists baffled by monkeypox cases in Europe, US - Arab News", "description": "LONDON: Scientists who have monitored numerous outbreaks of monkeypox in Africa say they are baffled by the disease’s recent spread in Europe and North America. Cases of the smallpox-related disease have previously been seen only among people with links to ce…", "url": "https://www.arabnews.com/node/2086801", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2022/05/22/3240716-1702655141.jpg", "publishedAt": "2022-05-22T02:19:02Z", "content": "MANILA: Days after clinching a landslide victory in one of the most divisive presidential elections in the history of the Philippines, Ferdinand Marcos now faces the challenge of fulfilling his campa… [+3865 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Reuters", "title": "WHO Expects More Cases of Monkeypox to Emerge Globally - Voice of America - VOA News", "description": "So far it’s been reported in 12 countries that are not endemic for the virus", "url": "https://www.voanews.com/a/who-expects-more-cases-of-monkeypox-to-emerge-globally-/6584111.html", "urlToImage": "https://gdb.voanews.com/03180000-0aff-0242-6110-08da3a974c05_w1200_r1.jpg", "publishedAt": "2022-05-22T00:08:17Z", "content": "LONDON  The World Health Organization said it expects to identify more cases of monkeypox as it expands surveillance in countries where the disease is not typically found.\r\nAs of Saturday, 92 confirm… [+2641 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health Officials Warn Of Surge in Covid Cases - MSNBC", "description": "Federal health officials urge people to continue wearing masks indoors now that a third of Americans live in areas where the risk of transmission is high. Dr...", "url": "https://www.youtube.com/watch?v=v8Xm1_eKPXc", "urlToImage": "https://i.ytimg.com/vi/v8Xm1_eKPXc/maxresdefault.jpg", "publishedAt": "2022-05-21T17:56:43Z", "content": null}, {"source": {"id": null, "name": "IndieWire"}, "author": "Ryan Lattanzio", "title": "‘Men’: Alex Garland Breaks Down That Wild Ending, Scrapped Concept, and How ‘Attack on Titan’ Inspired It - IndieWire", "description": "Garland originally envisioned a sequence along the lines of \"American Werewolf in London,\" but the Japanese cartoon pushed him in a more innovative body-horror direction.", "url": "https://www.indiewire.com/2022/05/men-ending-explained-alex-garland-1234725253/", "urlToImage": "https://www.indiewire.com/wp-content/uploads/2022/05/MCDMENN_EC023.jpg?w=780", "publishedAt": "2022-05-21T14:00:00Z", "content": "[Editor’s note: The following article contains major spoilers for the ending of “Men.”]\r\nAlex Garland knows the one thing audiences will definitely be talking about as they stumble out of his new fil… [+7032 chars]"}]}