{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Siasat Daily"}, "author": "Indo-Asian News Service", "title": "NASA picks Axiom Space to deliver spacesuits for astronauts’ moon walk - The Siasat Daily", "description": "Washington: the US space agency has selected Axiom Space to deliver a moonwalking system for astronauts for the Artemis III mission, which will land Americans on the surface of the Moon for the first time in over 50 years. This award -- the first one under a …", "url": "https://www.siasat.com/nasa-picks-axiom-space-to-deliver-spacesuits-for-astronauts-moon-walk-2408266/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/09/NASAsep8.jpg", "publishedAt": "2022-09-08T13:42:00Z", "content": "Washington: the US space agency has selected Axiom Space to deliver a moonwalking system for astronauts for the Artemis III mission, which will land Americans on the surface of the Moon for the first… [+2469 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Concerns over emerging, re-emerging infectious diseases | The Guardian Nigeria News - Nigeria and World News — Features - Guardian Nigeria", "description": "•Scientific strategies from recent outbreaks to help prepare for Pathogen X There are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in China, West Nile Virus in America, Marburg virus in Ghana, Ebo…", "url": "https://guardian.ng/features/science/concerns-over-emerging-re-emerging-infectious-diseases/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/09/AMSN.jpg", "publishedAt": "2022-09-08T02:22:00Z", "content": "Scientific strategies from recent outbreaks to help prepare for Pathogen X\r\nThere are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in Ch… [+21425 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published ahead of print in August - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; Atlantic Canada; the New Caledonian arc; the Farallon plate; and the Hikurangi sub…", "url": "https://www.eurekalert.org/news-releases/963881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-06T20:07:38Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; A… [+38402 chars]"}]}