{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Experts Recommend Drugs, Surgery for Teen Obesity in New Guidelines - Gizmodo", "description": "The American Academy of Pediatrics' guidelines are the first to emphasize proactive measures for treating childhood obesity, which has risen in recent years.", "url": "https://gizmodo.com/pediatric-obesity-treatment-guidelines-surgery-1849970109", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8f8ef648777f6a6d579e1b6142c26dc3.jpg", "publishedAt": "2023-01-10T17:37:00Z", "content": "For the first time ever, experts with the American Academy of Pediatrics are recommending proactive medical intervention against childhood obesity. The organizations new guidelines will no longer ask… [+3842 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "North American leaders to cooperate on semiconductors - Al Jazeera English", "description": "Ahead of summit, US, Canada and Mexico also pledge new cooperation on migration, climate and drugs, White House says.", "url": "https://www.aljazeera.com/news/2023/1/10/north-am-leaders-to-cooperate-on-semiconductors-white-house", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/01/AP23009837497267.jpg?resize=1920%2C1440", "publishedAt": "2023-01-10T17:22:08Z", "content": "The White House has announced a series of pledges made with Mexico and Canada ahead of the Three Amigos summit, and cooperation on bolstering the supply of semiconductors, a market currently dominate… [+5145 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Brazil's Bolsonaro is in Florida. What does the U.S. do now? - CBC News", "description": "The White House said on Monday it had yet to receive any requests from the Brazilian government regarding Jair Bolsonaro's status, but the former president's presence on American soil since Dec. 30 could raise complex issues, especially since Sunday's riots a…", "url": "https://www.cbc.ca/news/world/us-brazil-bolsonaro-1.6708776", "urlToImage": "https://i.cbc.ca/1.6708877.1673362442!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brazil-bolsonaro-navy.jpg", "publishedAt": "2023-01-10T15:34:29Z", "content": "Far-right former Brazilian president Jair Bolsonaro flew to Florida two days before his term ended, having challenged the results of the Oct. 30 run-off election that he narrowly lost to leftist riva… [+5682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Thomas Sumner", "title": "Doomed pair of supermassive black holes the closest to collision ever seen - Phys.org", "description": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on January 9 at an American Astronomical Society meeting in Seattl…", "url": "https://phys.org/news/2023-01-doomed-pair-supermassive-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/doomed-pair-of-superma.jpg", "publishedAt": "2023-01-10T09:46:22Z", "content": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on Jan… [+5256 chars]"}, {"source": {"id": null, "name": "Lupus.org"}, "author": null, "title": "Vitamin D Status a Common Health Concern for People with Lupus, Though Not Linked to Disease Activity - Lupus Foundation of America", "description": "Research shows that while taking vitamin D supplements can be a great way to increase blood levels of vitamin D, it may not improve lupus disease activity.", "url": "https://www.lupus.org/news/vitamin-d-status-a-common-health-concern-for-people-with-lupus-though-not-linked-to-disease", "urlToImage": "https://www.lupus.org/sites/default/files/styles/og_image/public/media/images/disease-ILR.JPG", "publishedAt": "2023-01-09T14:17:08Z", "content": "Nicknamed the sunshine vitamin, vitamin D can be made by the body when skin is exposed to ultraviolet (UV) radiation from the sun. However, many people with lupus need to avoid the sun due to photose… [+1583 chars]"}]}