{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Thenyindependent.com"}, "author": null, "title": "Pandemic Death Toll Could Hit 1 Million by Spring; Tougher Curbs on Unvaxed Needed - New York Independent", "description": "The COVID-19 pandemic is likely to persist, fueled by nearly 120 million unvaccinated Americans who are allowing the virus to sustain itself and potentially incubate into new, deadlier variants.", "url": "https://www.thenyindependent.com/1699548/un-vaxed-prolonging-pandemic/", "urlToImage": "https://www.thenyindependent.com/wp-content/webpc-passthru.php?src=https://www.thenyindependent.com/wp-content/uploads/2021/03/COVID-19_Nurse.jpg&nocache=1", "publishedAt": "2021-11-23T17:27:52Z", "content": "A surgical nurse preps a patient in New York City during the COVID-19 pandemic. (Photo: US Navy)\r\nThe COVID-19 pandemic is likely to persist, fueled by nearly 120 million unvaccinated Americans who a… [+6758 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Josh Boak", "title": "Fighting gas prices, US to release 50 million barrels of oil - Associated Press", "description": "WASHINGTON (AP) — President Joe Biden on Tuesday ordered a record-setting 50 million barrels of oil released from America's strategic reserve to help bring down energy costs, in coordination with other major energy consuming nations, including India, the Unit…", "url": "https://apnews.com/article/biden-oil-strategic-reserve-gas-prices-a7e0802b299cd627c7ffdeeb0e50bd2c", "urlToImage": "https://storage.googleapis.com/afs-prod/media/5cd23448b7f1461e81b88568a37ca3af/3000.jpeg", "publishedAt": "2021-11-23T16:29:09Z", "content": "WASHINGTON (AP) President Joe Biden on Tuesday ordered a record-setting 50 million barrels of oil released from Americas strategic reserve to help bring down energy costs, in coordination with other … [+7121 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Hitmakers BTS stamp their authority on American Music Awards with artist of the year win - CNA", "description": "The group also picked up the award for favourite pop duo or group, as well as favourite pop song for Butter.", "url": "https://cnalifestyle.channelnewsasia.com/entertainment/bts-artist-year-american-music-awards-winners-288891", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--7RNHQBgO--/c_crop%2Ch_576%2Cw_1024%2Cx_0%2Cy_0/c_fill%2Cg_auto%2Ch_676%2Cw_1200/f_auto%2Cq_auto/v1/mediacorp/cna/image/2021/11/22/bts_at_american_music_awards.jpg?itok=rAnSjAf4", "publishedAt": "2021-11-22T04:47:54Z", "content": "Olivia Rodrigo came into the night with a leading seven nominations but only took home the crown for favourite new artist of the year. \"Writing songs is my favourite thing in the whole world and I am… [+2949 chars]"}]}