{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Evens Sanon and Danica Coto", "title": "2 Haitian Americans detained in slaying of Haiti president - CTV News", "description": "Two men believed to be Haitian Americans - one of them purportedly a former bodyguard at the Canadian Embassy in Port au Prince - have been arrested in connection with the assassination of Haiti's president, a senior Haitian official said Thursday.", "url": "https://www.ctvnews.ca/world/2-haitian-americans-detained-in-slaying-of-haiti-president-1.5501888", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5501898.1625770502!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-07-08T19:00:00Z", "content": "PORT-AU-PRINCE, HAITI -- \r\nTwo men believed to be Haitian Americans - one of them purportedly a former bodyguard at the Canadian Embassy in Port au Prince - have been arrested in connection with the … [+7340 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Paul Wiseman", "title": "US jobless claims tick up to 373,000 from a pandemic low - Associated Press", "description": "WASHINGTON (AP) — The number of Americans filing for unemployment benefits rose slightly last week even while the economy and the job market appear to be rebounding from the coronavirus recession with sustained energy.", "url": "https://apnews.com/article/coronavirus-pandemic-pandemics-health-jobless-claims-fefebd98fa91eaf65a59218426e88ab8", "urlToImage": "https://storage.googleapis.com/afs-prod/media/ba4ebd0a4b4e4c0ab1a003d73c3d6d03/3000.jpeg", "publishedAt": "2021-07-08T17:25:41Z", "content": "WASHINGTON (AP) The number of Americans filing for unemployment benefits rose slightly last week even while the economy and the job market appear to be rebounding from the coronavirus recession with … [+3370 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caitlin O'Kane", "title": "Head of teachers union says critical race theory isn't taught in schools, vows to defend \"honest history\" - CBS News", "description": "Randi Weingarten, head of the American Federation of Teachers, said \"culture warriors\" are \"bullying teachers and trying to stop us from teaching students accurate history.\"", "url": "https://www.cbsnews.com/news/critical-race-theory-teachers-union-honest-history/", "urlToImage": "https://cbsnews3.cbsistatic.com/hub/i/r/2021/07/08/b8c73a57-540f-4f1f-b947-3d1b1f67bb12/thumbnail/1200x630/c4e0b9d9099d8ccac403df7a3524a0f8/screen-shot-2021-07-08-at-11-10-05-am.png", "publishedAt": "2021-07-08T16:07:00Z", "content": "As the debate over how race is taught in schools continues to be a hot-button issue in many school districts, the president of one of America's largest teachers unions is speaking out against efforts… [+4832 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Kevin Breuninger", "title": "Virtually all new Covid deaths and hospitalizations are among unvaccinated people, White House says - CNBC", "description": "President Joe Biden's Covid team has set its sights on those Americans who are still unvaccinated against the coronavirus, amid the delta variant's spread.", "url": "https://www.cnbc.com/2021/07/08/covid-vaccines-nearly-all-deaths-hospitalizations-among-unvaccinated.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106867662-1618335711164-gettyimages-1232288963-AFP_97X672.jpeg?v=1625757327", "publishedAt": "2021-07-08T15:52:47Z", "content": "As more people get vaccinated against Covid-19 in the U.S., a vast majority of hospitalizations and deaths are occurring among people who haven't yet gotten a Covid shot, White House officials said T… [+2754 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Rutz", "title": "HHS Secretary Becerra: 'Absolutely the government's business' to know which Americans haven't been vaccinated - Fox News", "description": "Health and Human Services Secretary Xavier Becerra said Thursday it was “absolutely the government's business” to know which Americans haven't been vaccinated yet against the coronavirus.", "url": "https://www.foxnews.com/media/xavier-becerra-hhs-absolutely-government-business-americans-not-vaccinated", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/03/GettyImages-1231362943.jpg", "publishedAt": "2021-07-08T15:13:24Z", "content": "Health and Human Services Secretary Xavier Becerra said Thursday it was \"absolutely the government's business\" to know which Americans haven't been vaccinated yet against the coronavirus.\r\nResponding… [+2873 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Move over Messi -- Argentina has a new hero - The Star Online", "description": "BRASILIA (Reuters) -     Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout in their Copa America semi-final against Colombia.", "url": "https://www.thestar.com.my/sport/football/2021/07/07/soccer-move-over-messi----argentina-has-a-new-hero", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/07/1211772.jpg", "publishedAt": "2021-07-07T05:47:00Z", "content": "BRASILIA (Reuters) - Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout i… [+1854 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "'Toughest game I ever played' - Bonucci hails Italy heart after Azzurri 'suffer' through win over Spain - Goal.com", "description": "Newly-hired RB Leipzig manager Jesse Marsch says that Caden Clark has both the personality and the playing ability to shine in Germany as he said the American teenager has \"borderline cockiness\" that will help him adjust to the pressures of Europe.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-07-06T23:21:56Z", "content": null}]}