{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Researchers in China Use Radiomics To Predict Heart Attacks - SciTechDaily", "description": "Researchers are using an approach called radiomics to predict future cardiac events like heart attacks, according to a study published today (February 14, 2023) in Radiology, a journal of the Radiological Society of North America (RSNA). Radiomics allows rese…", "url": "https://scitechdaily.com/?p=252015", "urlToImage": "https://scitechdaily.com/images/Heart-Attack-Illustration.jpg", "publishedAt": "2023-02-14T17:05:29Z", "content": "BySciTechDailyFebruary 14, 2023\r\nA study in Radiology, a journal of the Radiological Society of North America, reveals that researchers are utilizing radiomics to predict future heart attacks. Radiom… [+4603 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Chikungunya cases nearly double in 2022 in the Americas, 2023 sees this trend continuing - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological alert published yesterday. In 2022, a total of 271,176 cases of …", "url": "http://outbreaknewstoday.com/chikungunya-cases-nearly-double-in-2022-in-the-americas-2023-sees-this-trend-continuing-21329/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2022/08/26049_lores.jpg", "publishedAt": "2023-02-14T13:07:26Z", "content": "NewsDesk @bactiman63\r\nThe Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological ale… [+1689 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Sign language performer shines at Super Bowl - CTV News", "description": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl. Videos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise her energetic performances Sunday.", "url": "https://www.ctvnews.ca/entertainment/how-asl-performer-justina-miles-stole-the-show-at-super-bowl-lvii-1.6271922", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2023/2/13/justina-miles-at-the-super-bowl-1-6271929-1676320761688.jpg", "publishedAt": "2023-02-13T20:40:07Z", "content": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl.\r\nVideos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise he… [+1975 chars]"}]}