{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Paul Griffin", "title": "What is COVAX-19, the most advanced of Australia's remaining local COVID vaccine candidates? - Medical Xpress", "description": "Australia's current crop of COVID-19 vaccines consists of a shot by American biotechnology company Pfizer, which we import, and the vaccine by British-Swedish multinational AstraZeneca, the bulk of which we manufacture onshore in Melbourne under license.", "url": "https://medicalxpress.com/news/2021-06-covax-advanced-australia-local-covid.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/12-vaccine.jpg", "publishedAt": "2021-06-23T11:50:02Z", "content": "Australia's current crop of COVID-19 vaccines consists of a shot by American biotechnology company Pfizer, which we import, and the vaccine by British-Swedish multinational AstraZeneca, the bulk of w… [+6321 chars]"}, {"source": {"id": null, "name": "ETCanada.com"}, "author": "Becca Longmire", "title": "Simon Cowell Pulls Terrifying Prank On Sofia Vergara On ‘America’s Got Talent’ - ETCanada.com", "description": "Simon Cowell pulled an epic prank on Sofia Vergara on Tuesday's \"America's Got Talent\". The media mogul brought back \"comedy danger act\" Ryan Stock and Amberlynn Walker to trick the newest judge after she made a comment about preferring \"stuff that is dangero…", "url": "https://etcanada.com/news/794452/simon-cowell-pulls-terrifying-prank-on-sofia-vergara-on-americas-got-talent/", "urlToImage": "https://etcanada.com/wp-content/uploads/2021/06/sofia2.jpg?quality=80&strip=all&w=720&h=480&crop=1", "publishedAt": "2021-06-23T11:49:25Z", "content": "By Becca Longmire.\r\n3 hours ago Simon Cowell pulled an epic prank on Sofia Vergara on Tuesday’s “America’s Got Talent”.\r\nThe media mogul brought back “comedy danger act” Ryan Stock and Amberlynn Walk… [+1403 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Barsha Roy", "title": "Who is Jimmie Herrod? All you need to know about the \"Pink Martini\" singer who received a Golden Buzzer on AGT - Sportskeeda", "description": "Portland Singer Jimmie Herrod is the latest contestant to receive a Golden Buzzer on “America’s Got Talent.", "url": "https://www.sportskeeda.com/pop-culture/who-jimmie-herrod-all-need-know-singer-received-golden-buzzer-agt-singing-simon-cowell-s-worst-song", "urlToImage": "https://staticg.sportskeeda.com/editor/2021/06/c4ca0-16244266503577-800.jpg", "publishedAt": "2021-06-23T06:18:39Z", "content": "Portland Singer Jimmie Herrod is the latest contestant to receive a Golden Buzzer on Americas Got Talent. The singer even earned a standing ovation after delivering a mesmerizing rendition of Tomorro… [+4188 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "Highly contagious Delta variant​ could cause next COVID-19 wave: \"This virus will still find you\" - CBS News", "description": "Just 45% of Americans fully vaccinated and only 16 states that have fully vaccinated more than half of their populations,", "url": "https://www.cbsnews.com/news/covid-19-delta-variant-contaigous-next-wave/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2020/12/22/2015f891-9172-4e7f-bb5d-3156d699c4a6/thumbnail/1200x630/fb06e859bbff7af80b37c8c4ad7518a8/gettyimages-1212370347.jpg", "publishedAt": "2021-06-22T23:59:00Z", "content": "Whether it's airports, NBA games, or concerts, crowds are gathering across the nation as Americans start a return to pre-pandemic life.\r\nBut with just 45% of Americans fully vaccinated and only 16 st… [+1923 chars]"}]}