{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New handheld screening device accurately identifies children with amblyopia - News-Medical.net", "description": "A handheld screening device that detects subtle misalignment of the eyes accurately identifies children with amblyopia (lazy eye), according to a study published in the Journal of the American Association for Pediatric Ophthalmology and Strabismus.", "url": "https://www.news-medical.net/news/20210927/New-handheld-screening-device-accurately-identifies-children-with-amblyopia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/A_look_through_glasses_-_GlebJR_M1_1b6d48616be84a5a948188b10cee7752-620x480.jpg", "publishedAt": "2021-09-28T00:24:00Z", "content": "A handheld screening device that detects subtle misalignment of the eyes accurately identifies children with amblyopia (lazy eye), according to a study published in the Journal of the American Associ… [+4749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US President Joe Biden Gets Covid-19 Vaccine Booster Shot - NDTV", "description": "US President Joe Biden received a Covid-19 vaccine booster on Monday and told Americans still resisting the shots that they are damaging the country.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-gets-covid-19-vaccine-booster-shot-2555991", "urlToImage": "https://c.ndtvimg.com/2021-09/u4jlbc3s_joe-biden_625x300_28_September_21.jpg", "publishedAt": "2021-09-28T00:08:50Z", "content": "Joe Biden got his Covid booster shot on Monday.\r\nWashington, United States: US President Joe Biden received a Covid-19 vaccine booster on Monday and told Americans still resisting the shots that they… [+703 chars]"}, {"source": {"id": null, "name": "The New Daily"}, "author": null, "title": "American R&B singer R.Kelly convicted of racketeering and sex trafficking - The New Daily", "description": "R.Kelly has been convicted by a US federal jury in his sex trafficking trial, where prosecutors accused the R&B singer of exploiting his stardom over", "url": "https://thenewdaily.com.au/news/world/2021/09/28/r-kelly-sex-trafficking/", "urlToImage": "https://1v1d1e1lmiki1lgcvx32p49h8fe-wpengine.netdna-ssl.com/wp-content/uploads/2021/09/1632777978-GettyImages-1128873898-960x600.jpg", "publishedAt": "2021-09-27T21:25:53Z", "content": null}, {"source": {"id": null, "name": "Sabcnews.com"}, "author": "Richard Brooks", "title": "Biden gets COVID-19 booster shot as additional doses roll out - SABC News", "description": "US President Joe Biden rolled up his shirt sleeve and received a COVID-19 vaccine booster inoculation on Monday, hoping to provide a powerful example for Americans on the need to get the extra shot even as millions go without their first.", "url": "https://www.sabcnews.com/sabcnews/biden-gets-covid-19-booster-shot-as-additional-doses-roll-out/", "urlToImage": "https://www.sabcnews.com/sabcnews/wp-content/uploads/2021/09/booster-5.jpg", "publishedAt": "2021-09-27T20:33:41Z", "content": "US President Joe Biden rolled up his shirt sleeve and received a COVID-19 vaccine booster inoculation on Monday, hoping to provide a powerful example for Americans on the need to get the extra shot e… [+1955 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Callie Patteson", "title": "Joe Biden annoyed with US press asking off topic questions, Psaki says - New York Post ", "description": "President Biden has been annoyed with the American press asking questions that are not ‘on point’ during recent setups with foreign leaders in the White House.", "url": "https://nypost.com/2021/09/27/joe-biden-annoyed-with-us-press-asking-off-topic-questions/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/09/bidenpress.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-09-27T20:22:00Z", "content": "President Biden has been annoyed with the American press asking questions that are not “on point” during recent setups with foreign leaders in the White House, press secretary Jen Psaki admitted Mond… [+3388 chars]"}, {"source": {"id": "rt", "name": "RT"}, "author": "RT", "title": "Biden gets Covid-19 booster live on air, says US will have a ‘problem’ until 98% of Americans are vaccinated - RT", "description": "US President Joe Biden had his third dose of Pfizer’s Covid-19 vaccine administered live before the White House press corps, insisting the ‘unvaccinated’ were a problem for America and urging everyone to get their shots.", "url": "https://www.rt.com/usa/535976-biden-booster-covid-pfizer/", "urlToImage": "https://cdni.rt.com/files/2021.09/article/615219da2030274e5a65451c.JPG", "publishedAt": "2021-09-27T19:32:00Z", "content": "Biden was injected on Monday at a televised event inside the Eisenhower Executive Office building, telling the reporters he was doing so because the regulators had declared the Pfizer-made boosters “… [+3095 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Jessica Glenza", "title": "Biden receives vaccine ‘booster’ as confusion continues over third dose - The Guardian", "description": "President receives public Covid jab after FDA and CDC carved out fewer categories than he hoped of Americans eligible for third dose", "url": "https://amp.theguardian.com/us-news/2021/sep/27/joe-biden-receives-covid-booster-vaccines", "urlToImage": "https://i.guim.co.uk/img/media/80ad54c5d13067e38efd56ab50c676e7bbc07301/0_16_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0594e024b003763acba57b6c725ff7cf", "publishedAt": "2021-09-27T18:47:00Z", "content": "At the White House on Monday, Joe Biden donned a black surgical mask, rolled his shirt sleeve to his shoulder and received a third dose of the Pfizer Covid-19 vaccine as a booster shot.\r\nThe presiden… [+3641 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Oommen C Kurian", "title": "On Vaccines, It’s Tightrope Walk for India Balancing Quad Promise and Jabs for Own Citizens - News18", "description": "Prime Minister Narendra Modi of India, Prime Minister Yoshihide Suga of Japan, Prime Minister Scott Morrison of Australia, and President Joe Biden of the United States of America met at the White House on September 24 to take forward the conversation that sta…", "url": "https://www.news18.com/news/opinion/on-vaccines-tightrope-walk-for-india-balancing-quad-promise-jabs-for-own-citizens-4251209.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/09/vaccine-india11-1-163127145716x9.jpg", "publishedAt": "2021-09-27T09:31:00Z", "content": "Prime Minister Narendra Modi of India, Prime Minister Yoshihide Suga of Japan, Prime Minister Scott Morrison of Australia, and President Joe Biden of the United States of America met at the White Hou… [+5154 chars]"}]}