{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Xi Jinping's Real Mission Was To Get Me Fired\": Ex Top US Official - NDTV", "description": "In his book titled 'Never Give an Inch: Fighting for the America I Love,' former US Secretary of State Pompeo, 59, writes that he held multiple interactions with the Chinese leader and found him \"dour\" and a \"quintessential Communist apparatchik\".", "url": "https://www.ndtv.com/world-news/mike-pompeo-xi-jinpings-real-mission-was-to-get-me-fired-ex-top-us-official-3735598", "urlToImage": "https://c.ndtvimg.com/2022-11/2c30sfso_chinese-president-xi-jinpingbloomberg-_625x300_28_November_22.jpg", "publishedAt": "2023-01-30T08:12:46Z", "content": "Mike Pompeo recently resleade his book titled 'Never Give an Inch: Fighting for the America I Love'.\r\nWashington: Mike Pompeo has said that among the dozens of world leaders he met as the US Secretar… [+6224 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Phillip van Niekerk", "title": "PUTIN'S LITTLE AMERICAN HELPERS: AD2016, again and again: Arrest of senior FBI official puts focus on Russia's role in ascent of Trump - Daily Maverick", "description": "The full extent of one of Russia’s most successful intelligence operations — helping to elect Donald Trump as President of the US — may never be known, but the blows to the credibility of America’s spy agencies are still coming.", "url": "https://www.dailymaverick.co.za/article/2023-01-29-ad2016-again-and-again-arrest-of-senior-fbi-official-puts-focus-on-russias-role-in-ascent-of-trump/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/Brooks-Trumpfailure-e1531872056827.jpg?w=1280", "publishedAt": "2023-01-29T21:48:15Z", "content": "Last week, Charles McConigal, a former senior FBI official, was arrested and charged in a federal court in Manhattan for being in the pay of the Russian oligarch Oleg Deripaska, a man with deep ties … [+8669 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Stephanie Stacey", "title": "Passengers endured a 13-hour flight to nowhere after their plane to New Zealand was forced to turn back - Business Insider South Africa", "description": "A long-haul Emirates flight turned back mid-flight because of flooding in Auckland. American Airlines passengers also endured a similar situation.", "url": "https://www.businessinsider.co.za/airline-passengers-delay-dubai-emirates-flight-auckland-2023-1", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8179/83ef137e13e441bcba89b797a196e72a.jpg", "publishedAt": "2023-01-28T15:45:00Z", "content": "Passengers spent more than 13 hours flying onboard an Emirates aircraft only to land right back where they'd started. \r\nFlight EK448 departed from Dubai International Airport at around 10:30 on Frida… [+2153 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "Outbreak of avian flu has killed more than 100 million birds and poses a serious threat of becoming a human pandemic - WSWS", "description": "Since October 2021, the spread of the H5N1 highly pathogenic avian flu among birds in North America and Europe has killed more than 140 million poultry and wild birds through disease and culling. The spread of the virus at a mink farm in Spain raises immediat…", "url": "https://www.wsws.org/en/articles/2023/01/28/unuv-j28.html", "urlToImage": "https://www.wsws.org/asset/ec43e59f-7f32-407e-9bd8-613b2101332d?rendition=1600x900", "publishedAt": "2023-01-28T02:30:32Z", "content": "The COVID-19 pandemic, which has killed more than 21 million people, has elevated an existential question into concrete immediacy. Following COVID-19, when will the next pandemic of a highly lethal n… [+9119 chars]"}]}