{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Rob Crilly", "title": "U.S. FINALLY starts evacuating citizens from Sudan: Buses carrying 300 Americans leave Khartoum - Daily Mail", "description": "A convoy carrying about 300 Americans left Khartoum Friday, after Washington came under pressure to explain why thousands of U.S. citizens remained without help.", "url": "https://www.dailymail.co.uk/news/article-12026863/U-S-FINALLY-starts-evacuating-citizens-Sudan-Buses-carrying-300-Americans-leave-Khartoum.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/04/29/03/70370447-0-image-a-22_1682734198383.jpg", "publishedAt": "2023-04-28T21:01:48Z", "content": "Buses carrying about 300 Americans left the war-torn capital of Sudan late Friday, after Washington came under intense pressure to explain why other countries had rescued their nationals but thousand… [+4540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "FBI warrantless searches of Americans' data plummet in 2022, intel report says - CNN", "description": "The number of warrantless FBI searches of Americans' electronic data under a controversial intelligence program that aims to identify foreign threats dropped sharply from millions of searches in 2021 to over 100,000 last year, US intelligence agencies said in…", "url": "https://www.cnn.com/2023/04/28/politics/fbi-americans-data-intelligence-report/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/201014194936-fbi-seal-logo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-28T20:58:00Z", "content": "The number of warrantless FBI searches of Americans electronic data under a controversial intelligence program that aims to identify foreign threats dropped sharply from millions of searches in 2021 … [+2558 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Popular diets may increase risk of heart disease, American Heart Association says - CBS News", "description": "Some popular diet trends, including the keto and paleo diets, may have an adverse effect on heart health, a new statement from the American Heart Association...", "url": "https://www.youtube.com/watch?v=9sype80dh_Q", "urlToImage": "https://i.ytimg.com/vi/9sype80dh_Q/maxresdefault.jpg", "publishedAt": "2023-04-28T20:52:52Z", "content": null}]}