{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Thomas M. Orbos", "title": "Deconstruction for a better Build, Build, Build program - BusinessMirror", "description": "California, the great American state of freeways, made a historic turnaround last week with its decision to ban the sale of gas-fed cars by 2035. This is expected to trigger a domino effect on other US states, as well as other countries and will result in the…", "url": "https://businessmirror.com.ph/2022/08/29/deconstruction-for-a-better-build-build-build-program/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/01/Column-box-Thomas-M.-Orbos-Street-Talk.jpg", "publishedAt": "2022-08-28T18:16:40Z", "content": "California, the great American state of freeways, made a historic turnaround last week with its decision to ban the sale of gas-fed cars by 2035. This is expected to trigger a domino effect on other … [+4165 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Manoj Gupta", "title": "‘Pak, Stop Allowing US Drones to Use Your Airspace’: Taliban Defence Minister Strikes Back over Attacks | E - News18", "description": "At a press conference, Yaqoob said that the country’s radar system was destroyed when the Americans evacuated the country last year", "url": "https://www.news18.com/news/world/pak-stop-allowing-us-drones-to-use-your-airspace-taliban-defence-minister-strikes-back-over-attacks-exclusive-5840719.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/04/mullah-mohammad-yaqoob-taliban-reuters-166169645816x9.jpg", "publishedAt": "2022-08-28T15:26:00Z", "content": "Mullah Yaqoob, Afghanistans interim defence minister and son of the late Taliban founder Mullah Omar, raised serious allegations against Pakistan over the recent drone attacks in his country.\r\nAt a p… [+889 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Two US Navy warships transit through Taiwan Strait - The Star Online", "description": "Two United States warships sailed through the Taiwan Strait on Sunday, the American navy said, the first such transit since China staged unprecedented military drills around the island.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/08/28/two-us-navy-warships-transit-through-taiwan-strait", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/08/28/1715126.jpg", "publishedAt": "2022-08-28T06:23:00Z", "content": "WASHINGTON, Aug 28, 2022 (AFP): Two United States warships sailed through the Taiwan Strait on Sunday, the American navy said, the first such transit since China staged unprecedented military drills … [+2267 chars]"}, {"source": {"id": null, "name": "The Peoples Person"}, "author": "Dan Fitzgerald", "title": "Manchester United need to tap into South American market - The Peoples Person", "description": "With Manchester United close to splashing up to €100million on Brazilian youngster Antony, having already spent big on two other South Americans Lisandro Martinez and Casemiro, both from Champions League teams, a question has to be asked, is it time that Unit…", "url": "https://thepeoplesperson.com/2022/08/27/manchester-united-need-to-tap-into-south-american-market-251884/", "urlToImage": "https://thepeoplesperson.com/wp-content/uploads/2022/07/gabriel-veron-palmeiras-v-defensa-y-justicia-conmebol-recopa-min.jpeg", "publishedAt": "2022-08-27T20:30:03Z", "content": "With Manchester United close to splashing up to 100million on Brazilian youngster Antony, having already spent big on two other South Americans Lisandro Martinez and Casemiro, both from Champions Lea… [+3361 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Perseverance Rover Discovers Rocks Shaped By Water On Mars - NDTV", "description": "American Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet that may have life-related traces.", "url": "https://www.ndtv.com/world-news/nasas-perseverance-rover-discovers-rocks-shaped-by-water-on-mars-3291878", "urlToImage": "https://c.ndtvimg.com/2022-08/uumg5tto_jezero-crater_625x300_27_August_22.jpg", "publishedAt": "2022-08-27T11:22:22Z", "content": "Scientists believe that the Martian surface was once filled with water.\r\nAmerican Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet t… [+2171 chars]"}]}