{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Football.London"}, "author": "Adam Newson", "title": "Chelsea press conference LIVE: Thomas Tuchel on Sterling, Koulibaly, pre-season, Club America - Football.London", "description": "Chelsea play their first game of pre-season tomorrow evening when they take on Mexican giants Club America at Allegiant Stadium in Las Vegas", "url": "https://www.football.london/chelsea-fc/news/chelsea-press-conference-thomas-tuchel-24507105", "urlToImage": "https://i2-prod.football.london/incoming/article24507130.ece/ALTERNATES/s1200/0_GettyImages-1408270819.jpg", "publishedAt": "2022-07-15T23:26:03Z", "content": "Hello and welcome to live coverage of Thomas Tuchel's pre-match press conference ahead of Chelsea's first pre-season friendly of the summer against Club America in Las Vegas. \r\n Tuchel and his player… [+1181 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Burden of diabetes and hyperglycaemia in adults in the Americas, 1990–2019: a systematic analysis for the Global Burden of Disease Study 2019 - The Lancet", "description": "The burden of diabetes in the Americas is large, increasing, heterogeneous, and expanding.\nTo confront the rising burden, population-based interventions aimed to reduce type\n2 diabetes risk and strengthening health systems to provide effective and cost-effici…", "url": "https://www.thelancet.com/journals/landia/article/PIIS2213-8587(22)00186-3/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/1bf38116-8dad-4eb6-a058-c389c3fbe4dd/gr1.jpg", "publishedAt": "2022-07-15T22:38:16Z", "content": "Legetic B, Medici A, Hernández-Avila M, Alleyne GA, Hennis A. Economic Dimensions of Non-Communicable Disease in Latin America and the Caribbean. Disease Control Priorities. Companion Volume, 2016."}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles and Uliana Pavlova, CNN Business", "title": "SpaceX rockets to fly Russian cosmonauts with new NASA deal - CNN International", "description": "American and Russian astronauts will once share space aboard the same spacecraft after NASA and its Russian counterpart, Roscosmos, reached a ride-sharing agreement Friday following months of back-and-forth discussions.", "url": "https://www.cnn.com/2022/07/15/tech/spacex-russia-nasa-ride-share-agreement-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715122136-russian-cosmonauts-oleg-kononenko-sergey-prokopyev-split-super-tease.jpg", "publishedAt": "2022-07-15T17:19:43Z", "content": "New York (CNN Business)American and Russian astronauts will once share space aboard the same spacecraft after NASA and its Russian counterpart, Roscosmos, reached a ride-sharing agreement Friday foll… [+1090 chars]"}, {"source": {"id": null, "name": "Barron's"}, "author": "Angela Palumbo", "title": "Amazon Prime Day Shows Just How Hard Inflation Is Hitting Americans - Barron's", "description": "Household essentials were the top-purchased items during this year's Prime Day, according to data from Numerator.", "url": "https://www.barrons.com/articles/amazon-prime-day-inflation-hitting-americans-51657895277", "urlToImage": "https://images.barrons.com/im-532514/social", "publishedAt": "2022-07-15T14:28:00Z", "content": "Amazon.coms\r\nPrime Day event has officially ended. The top items sold during the sales event show that consumers are in desperate need of a bargain while inflation continues to burn red hot.\r\nPrime D… [+451 chars]"}, {"source": {"id": null, "name": "Dublin Live"}, "author": "Michelle Cullen", "title": "American family slam woman's 'potty-mouth' on Dublin train after sitting in her seat - Dublin Live", "description": "The tourists were awaiting their train to depart when they were approached by a woman whose assigned seat they were sitting in", "url": "https://www.dublinlive.ie/news/american-family-slam-womans-potty-24501702", "urlToImage": "https://i2-prod.dublinlive.ie/article20575055.ece/ALTERNATES/s1200/0_General-Street-Scenes290461607.jpg", "publishedAt": "2022-07-15T13:09:51Z", "content": "A family of six on holiday in Ireland said they almost had their entire trip ruined after an altercation with an Irish woman on a train.\r\nThe tourists were awaiting their train to depart when they we… [+2318 chars]"}]}