{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "Four astronauts return from ISS on SpaceX flight ending 5-month mission - Hindustan Times", "description": "Led by NASA's Nicole Mann, the first Native American woman to fly in space, the astronauts checked out of the station early Saturday morning. Less than 19 hours later, their Dragon capsule was bobbing in the sea as they awaited pickup.", "url": "https://www.hindustantimes.com/science/four-astronauts-return-from-iss-on-spacex-flight-ending-5-month-mission-101678587393556.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/03/12/1600x900/SpaceX-Crew-Return-0_1678587763380_1678587763597_1678587763597.jpg", "publishedAt": "2023-03-12T02:28:30Z", "content": "Four space station astronauts returned to Earth late Saturday after a quick SpaceX flight home. Their capsule splashed down in the Gulf of Mexico just off the Florida coast near Tampa.\r\nThe U.S.-Russ… [+1639 chars]"}, {"source": {"id": null, "name": "MLB.com"}, "author": "Jesse Borek", "title": "Watch LIVE: USA's quest to repeat begins vs. Great Britain on FOX - MLB.com", "description": "PHOENIX -- Two countries at parallel ends of the international baseball spectrum are colliding tonight as the United States, the reigning World Baseball Classic champions, welcomes Great Britain to the American Southwest.", "url": "https://www.mlb.com/news/great-britain-vs-united-states-of-america-in-world-baseball-classic-2023", "urlToImage": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/vhptwfmk4mb9zahvxkif.jpg", "publishedAt": "2023-03-12T01:56:46Z", "content": "PHOENIX -- Two countries at parallel ends of the international baseball spectrum are colliding tonight as the United States, the reigning World Baseball Classic champions, welcomes Great Britain to t… [+4278 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Appoints 2 Indian-American CEOs To US Advisory Committee - NDTV", "description": "US President Joe Biden on Friday (local time) named two Indian-Americans -- Revathi Advaithi, CEO of Flex, and Manish Bapna, CEO of the Natural Resources Defence Council to the Advisory Committee for Trade Policy and Negotiations.", "url": "https://www.ndtv.com/world-news/joe-biden-appoints-2-indian-american-ceos-to-us-advisory-committee-3853316", "urlToImage": "https://c.ndtvimg.com/2023-01/8m15kkug_joe-biden_625x300_27_January_23.jpg", "publishedAt": "2023-03-11T22:11:02Z", "content": "Joe Biden announced a team of who will be a part of the US Advisory Committee. (File)\r\nWashington: US President Joe Biden on Friday (local time) named two Indian-Americans -- Revathi Advaithi, CEO of… [+4289 chars]"}]}