{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez", "title": "Boy Scouts of America announces rebrand to ‘Scouting America’ - CNN", "description": "Boy Scouts of America announced Tuesday that the organization will change its name to ‘Scouting America’ next February, to reflect its commitment to enabling all the youth of America to “experience the benefits of Scouting.”", "url": "https://www.cnn.com/2024/05/07/us/boy-scouts-rebrands-scouting-america-reaj/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap264127335423.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-05-07T16:41:00Z", "content": "Boy Scouts of America announced Tuesday that it will change its name to Scouting America next February, to emphasize its commitment to inclusion.\r\nThe youth organization said the new name is meant to… [+1758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein", "title": "Biden says antisemitism has no place in America in somber speech connecting the Holocaust to Hamas’ attack on Israel - CNN", "description": "President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas’ attack on October 7.", "url": "https://www.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/eeb4ab60-6fb7-4e38-941d-fae3e6b305c9.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-05-07T16:23:00Z", "content": "President Joe Biden on Tuesday issued a call to fight a ferocious surge of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas attack on Israe… [+9184 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Aria Bendix", "title": "Major study of cancer in Black women launches in 20 states - NBC News", "description": "Black women die from cancer at higher rates than other racial or ethnic groups. A large-scale study from the American Cancer Society will investigate why.", "url": "https://www.nbcnews.com/health/cancer/cancer-black-women-study-launches-rcna150880", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240506-mamogram-black-women-cancer-rates-se-1240p-11e5ad.jpg", "publishedAt": "2024-05-07T12:00:41Z", "content": "The risk of dying from cancer has steadily declined in the U.S. over the last few decades, but Black women still have some of the lowest survival rates.\r\nAlthough Black women are less likely to be di… [+3449 chars]"}]}