{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "More Countries Impose COVID Restrictions on Travelers From China - Voice of America", "description": "The surge in COVID cases in China and a lack of information on infections from China have fueled international concerns and prompted many countries to impose...", "url": "https://www.youtube.com/watch?v=TIxW9XLc28A", "urlToImage": "https://i.ytimg.com/vi/TIxW9XLc28A/maxresdefault.jpg", "publishedAt": "2023-01-03T16:12:14Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pic: All Planets In Our Solar System Visible At Same Time From Earth - NDTV", "description": "American space agency NASA recently shared a picture that captures a rare phenomenon: all the planets of our solar system witness from Earth simultaneously.", "url": "https://www.ndtv.com/world-news/pic-all-planets-in-our-solar-system-visible-at-same-time-from-earth-3661215", "urlToImage": "https://c.ndtvimg.com/2023-01/cbp59pf_planet-parade-nasa_625x300_03_January_23.jpg", "publishedAt": "2023-01-03T15:44:45Z", "content": "The photo, posted by NASA, was taken by astronomer and photographer Tunc Tezel.\r\nAmerican space agency NASA recently shared a picture that captures a rare phenomenon: all the planets of our solar sys… [+1680 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Muere empleado de American Airlines al ser succionado por turbina de avión - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/appearance/structured-data", "urlToImage": "https://developers.google.com/static/search/images/home-social-share-lockup.png", "publishedAt": "2023-01-03T11:56:02Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}]}