{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "'Trump is greatest friend Israel has ever had,' Netanyahu says in exclusive interview - The Jerusalem Post", "description": "Israel has no greater friend than America, \"especially under President Trump's leadership,\" he said.", "url": "https://www.jpost.com/israel-news/article-841243", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/648376", "publishedAt": "2025-02-09T01:07:44Z", "content": "Prime Minister Benjamin Netanyahu called US President Donald Trump \"the greatest friend that Israel has ever had in the White House,\" in an exclusive Fox News interview that aired on Saturday night, … [+2428 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "Trump’s assault on public health and the growing threat of an H5N1 bird flu pandemic - WSWS", "description": "Over the past week, a series of developments have reaffirmed the imminent danger of an H5N1 “bird flu” pandemic, for which American and world capitalism are wholly unprepared.", "url": "https://www.wsws.org/en/articles/2025/02/08/ocfq-f08.html", "urlToImage": "https://www.wsws.org/asset/762ea248-774d-4628-99ad-b59183f46e9b?rendition=1600x900", "publishedAt": "2025-02-08T06:02:50Z", "content": "Employees clean parts of the cages and take the last chickens to be slaughtered inside a poultry store, Friday, February 7, 2025, in New York. [AP Photo/Andres Kudacki]\r\nOver the past week, a series … [+8635 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": null, "title": "Evidence That the Right's Assault on Women Is Here | Opinion - Newsweek", "description": "President Donald Trump neutralized a political landmine during the election by emphatically promising he would not sign a national abortion ban, and it's clear now that's not how he will start stifling policies that benefit American women.", "url": "https://www.newsweek.com/evidence-that-rights-assault-women-here-opinion-2026061", "urlToImage": "https://d.newsweek.com/en/full/2581031/fighting-their-rights.jpg", "publishedAt": "2025-02-05T11:22:01Z", "content": "President Donald Trump neutralized a political landmine during the election by emphatically promising he would not sign a national abortion ban, and it's clear now that's not how he will start stifli… [+4964 chars]"}]}