{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/tara-subramaniam\">Tara Subramaniam</a>", "title": "Hamas-Israel truce enters fourth day as aid reaches Gaza: Live updates - CNN", "description": "A third set of hostages was released by Hamas on Sunday, including the first American to be successfully freed, according to US and Israeli officials. Follow for live updates.", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-11-27-23/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/231126125943-gaza-city-damage-1126-super-tease.jpg", "publishedAt": "2023-11-27T05:18:00Z", "content": "As the truce between Hamas and Israel enters its fourth and final day Monday, both parties have discussed the possibility of extending it, a move which has the support of key nations, including the U… [+3069 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Laser Communication Test Gets Data from 16 Million Kilometers Away - VOA Learning English", "description": "NASA says a test involving a laser-based communication method successfully sent data over 16 million kilometers through deep space. The new system is expected to replace radio links long used by the American space agency.", "url": "https://learningenglish.voanews.com/a/nasa-laser-communication-test-gets-data-from-16-million-kilometers-away/7366203.html", "urlToImage": "https://gdb.voanews.com/01000000-c0a8-0242-8988-08dbeba6d103_cx5_cy2_cw94_w1200_r1.jpg", "publishedAt": "2023-11-26T22:05:36Z", "content": "NASA has successfully tested a laser-based communication method that sent data over 16 million kilometers. The American space agency hopes the system will greatly improve data links between Earth and… [+4034 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Russia Launches Largest-Yet Wave of Drone Strikes on Kyiv | VOANews - Voice of America", "description": "Russia launched its largest drone strike to date on Ukraine over the weekend.  Kyiv says it destroyed all but one, but falling debris caused several injuries...", "url": "https://www.youtube.com/watch?v=hCCGtPv4pZ4", "urlToImage": "https://i.ytimg.com/vi/hCCGtPv4pZ4/maxresdefault.jpg", "publishedAt": "2023-11-26T19:20:25Z", "content": null}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Dorgan", "title": "Couple claim eye antibiotic cured dog of mysterious illness sweeping America - Fox News", "description": "A California couple are claiming their canine recovered from a potentially deadly disease after being treated with a lifesaving antibiotic.", "url": "https://www.foxnews.com/lifestyle/couple-claim-eye-antibiotic-cured-dog-mysterious-illness-sweeping-america", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/09/iStock-1285465107.jpg", "publishedAt": "2023-11-26T13:51:00Z", "content": "A cure to a mysterious and potentially deadly respiratory condition that has been spreading in dogs throughout the country may have been found with a California couple who claim their canine is on th… [+3380 chars]"}]}