{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kim Bellware", "title": "Boy Scouts of America changes name to Scouting America in rebrand - The Washington Post", "description": "The change comes as the scouting organization tries to move past years of turmoil, including sexual abuse allegations and a public battle with the Girl Scouts.", "url": "https://www.washingtonpost.com/nation/2024/05/07/boy-scouts-name-change-scouting-america/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H5SX3OXTJII6RGOCZ7FG7T3BBQ.jpg&w=1440", "publishedAt": "2024-05-07T22:38:00Z", "content": "After 114 years of being known as the Boy Scouts of America, the nations largest scouting organization is changing its name to the more inclusive Scouting America.\r\nThe major rebrand, announced Tuesd… [+289 chars]"}, {"source": {"id": null, "name": "GMA"}, "author": "Kelly McCarthy", "title": "New Starbucks summer menu includes Summer-Berry Refreshers with raspberry pearls - Good Morning America", "description": "All the new Starbucks summer menu items from Berry Refreshers to Pineapple Cloud Cake, plus in-app discounts for the loyalty rewards members.", "url": "https://goodmorningamerica.com/food/story/new-starbucks-summer-menu-includes-summer-berry-refreshers-109989022", "urlToImage": "https://s.abcnews.com/images/GMA/starbucks-summer-menu-thg-5-240506_1715088370973_hpMain_16x9_992.jpg", "publishedAt": "2024-05-07T19:41:15Z", "content": "Although the first official day of summer isn't for another 44 days, Starbucks announced its new summer menu on Tuesday to give coffee fans an early taste of the season.\r\nNew summer menu at Starbucks… [+2241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "Largest study of its kind to investigate why Black women are more likely to die from most types of cancer - CNN", "description": "The American Cancer Society said Tuesday that it is seeking participants for what may be the largest national study of its kind, one that aims to solve the mystery of why Black women have the lowest survival rate of any racial or ethnic group in the US for mo…", "url": "https://www.cnn.com/2024/05/07/health/black-women-cancer-rates-study/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2120556951.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-05-07T19:05:00Z", "content": "The American Cancer Society said Tuesday that it is seeking participants for what may be the largest national study of its kind, one that aims to solve the mystery of why Black women have thelowest s… [+2911 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein", "title": "Biden says antisemitism has no place in America in somber speech connecting the Holocaust to Hamas’ attack on Israel - CNN", "description": "President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas’ attack on October 7.", "url": "https://www.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/eeb4ab60-6fb7-4e38-941d-fae3e6b305c9.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-05-07T18:50:00Z", "content": "President Joe Biden on Tuesday issued a call to fight a ferocious surge of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas attack on Israe… [+11736 chars]"}]}