{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ALANNA DURKIN RICHER, MICHAEL KUNZELMAN", "title": "Hundreds of convictions, but a major mystery is still unsolved 3 years after the Jan. 6 Capitol riot - The Associated Press", "description": "Three years after the attack on the U.S. Capitol, Washington’s federal courthouse is flooded with trials, guilty plea hearings and sentencings stemming from the largest criminal investigation in American history. And the hunt for suspects is far from over. Au…", "url": "https://apnews.com/article/capitol-riot-jan-6-criminal-cases-anniversary-bf436efe760751b1356f937e55bedaa5", "urlToImage": "https://dims.apnews.com/dims4/default/35846fb/2147483647/strip/true/crop/5133x2887+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8b%2F75%2F0fa8cc0eb7c25c012c1d310ad58b%2F8f03b88fa3b845e096c5e08441229b06", "publishedAt": "2024-01-05T11:15:00Z", "content": "WASHINGTON (AP) Members of far-right extremist groups. Former police officers. An Olympic gold medalist swimmer. And active duty U.S. Marines. \r\nThey are among the hundreds of people who have been co… [+7003 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Covid update | US brings back mask mandate, China braces for uptick in JN.1 cases as Singapore says wave on decline - The Indian Express", "description": "Amid worries of persisting COVID cases globally, healthcare facilities in several American states have made the use of face masks mandatory on their premises while authorities in Singapore indicated that the current wave of infections in the country seems to …", "url": "https://indianexpress.com/article/world/covid-situation-china-united-states-singapore-latest-9096113/", "urlToImage": "https://images.indianexpress.com/2024/01/covid-19.jpg", "publishedAt": "2024-01-05T08:11:18Z", "content": "Amid worries of persisting COVID cases globally, healthcare facilities in several American states have made the use of face masks mandatory on their premises while authorities in Singapore indicated … [+4127 chars]"}]}