{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "American parents targeted with misleading warnings on Covid-19 vaccination - Malay Mail", "description": "WASHINGTON, Nov 11 — Registered nurse Melody Butler seeks to provide science-based answers to American parents as she urges them to vaccinate their children against Covid-19. But her efforts to do so on social media through Nurses Who Vaccinate — a volunteer …", "url": "https://www.malaymail.com/news/world/2021/11/11/parents-targeted-with-misleading-warnings-on-covid-19-vaccination/2020092", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-11/us_covid_vaccine_children2_11112021-seo.jpg", "publishedAt": "2021-11-11T04:23:09Z", "content": "Pins that will be given to children after they receive their first dose of Pfizer Covid-19 vaccine are seen at the Beaumont Health offices in Southfield, Michigan, November 5, 2021. AFP pic\r\nWASHINGT… [+4506 chars]"}, {"source": {"id": null, "name": "Lmh.org"}, "author": null, "title": "The Importance of Smoking Cessation - LMH Health", "description": "The American Cancer Society states that smoking causes an estimated 480,000 deaths every year, or about 1 in 5 deaths. On top of this, more than 16 million Americans live with a smoking-related disease.", "url": "https://www.lmh.org/news/2021-news/the-importance-of-smoking-cessation/", "urlToImage": null, "publishedAt": "2021-11-10T20:59:56Z", "content": "Dr. Krishna Rangarajan\r\nThe American Cancer Society states that smoking causes an estimated 480,000 deaths every year, or about 1 in 5 deaths. On top of this, more than 16 million Americans live with… [+9127 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Hayden E. Klein", "title": "Dr Robert Gabbay on COVID-19 Vaccinations in the Diabetes Community - AJMC.com Managed Markets Network", "description": "Robert A. Gabbay, MD, PhD, chief scientific and medical officer at the American Diabetes Association, discusses COVID-19 vaccinations among people with diabetes as they have been disproportionally affected by the pandemic.", "url": "https://www.ajmc.com/view/dr-robert-gabbay-on-covid-19-vaccinations-in-the-diabetes-community", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c139208ca7a16650ae788c2e8ece0beb0944dec3-2874x1616.png?fit=crop&auto=format", "publishedAt": "2021-11-10T17:10:35Z", "content": "Efforts to address COVID-19 in the diabetes community are based, in part, on early recognition that these individuals would be disproportionately impacted, said Robert A. Gabbay, MD, PhD, chief scien… [+1257 chars]"}]}