{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Rob Gillies", "title": "Ontario slaps 25% increase on electricity exports to U.S. in response to Trump’s trade war - The Associated Press", "description": "Ontario’s premier, the leader of Canada’s most populous province, is now charging 25% more for electricity shipped to 1.5 million Americans in response to U.S. President Donald Trump’s tariff plan. Ontario provides electricity to Minnesota, New York and Michi…", "url": "https://apnews.com/article/canada-ontario-us-trump-tariffs-electricity-834dc3d9defd314923912f9bd8540e31", "urlToImage": "https://dims.apnews.com/dims4/default/ae323be/2147483647/strip/true/crop/4800x2700+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2F0f%2F4a1ba21edc3ca74158fdbc4ace4d%2F0a89ed4e8b5a48779817f0daa6c84646", "publishedAt": "2025-03-10T15:25:00Z", "content": "TORONTO (AP) Ontarios premier, the leader of Canadas most populous province, announced that effective Monday it is charging 25% more for electricity to 1.5 million Americans in response to U.S. Presi… [+4300 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Jamie Carter", "title": "This month's 'blood moon' eclipse mirrors one Christopher Columbus used to scare indigenous people with in 1504 - Space.com", "description": "On March 13-14, 2025, skywatchers in the Americas will witness a total lunar eclipse that mirrors one Christopher Columbus is said to have used to his advantage over five centuries ago.", "url": "https://www.space.com/march-2025-eclipse-echoes-columbus-eclipse-1504", "urlToImage": "https://cdn.mos.cms.futurecdn.net/sMDRXnPAgKFjhcvPVtdA7X-1200-80.jpg", "publishedAt": "2025-03-10T10:00:00Z", "content": "In 1504, Christopher Columbus, on his fourth trans-Atlantic voyage, was stranded on the shores of Jamaica, with his ships crawling with marine worms and his crew hungry. The Indigenous Arawak people,… [+2836 chars]"}]}