{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Sagar Rangaraju", "title": "Hello Neighbor Diaries is the newest game in the popular IP, now available on Android - GamingonPhone", "description": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-ba", "url": "https://gamingonphone.com/news/hello-neighbor-diaries-popular-ip-available-on-android/", "urlToImage": "https://gamingonphone.com/wp-content/uploads/2022/06/helloneighbour_diaries_android.jpg", "publishedAt": "2022-06-23T17:00:44Z", "content": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-b… [+1936 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BusinessMirror", "title": "A truly safe place - BusinessMirror", "description": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware. Unconnected events? Laylo represents a billion-dollar sector that’s keeping Ame…", "url": "https://businessmirror.com.ph/2022/06/24/a-truly-safe-place/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/10/Column-box-Editorial.jpg", "publishedAt": "2022-06-23T16:01:00Z", "content": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware.\r\nUnconnected events… [+4105 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "Scientists observe longitudinal plasmonic field in nanocavity at subnano-scale - Phys.org", "description": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research published in the Journal of the American Chemical Society.", "url": "https://phys.org/news/2022-06-scientists-longitudinal-plasmonic-field-nanocavity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/scientists-observe-lon.jpg", "publishedAt": "2022-06-22T17:38:48Z", "content": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research publi… [+2636 chars]"}]}