{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, Kayla Tausche, Kevin Liptak", "title": "Biden makes the case for wartime aid to Israel and Ukraine in primetime address - CNN", "description": "President Joe Biden tied the wars in Ukraine and Israel together during a primetime Oval Office address Thursday, making an impassioned appeal to the American people to support two fellow democracies that he says are facing existential threats.", "url": "https://www.cnn.com/2023/10/19/politics/biden-oval-office-speech-israel-ukraine/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231019200453-01-biden-address-1019.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-10-20T01:50:00Z", "content": "President Joe Biden tied the wars in Ukraine and Israel together during a primetime Oval Office address Thursday, making an impassioned appeal to the American people to support two fellow democracies… [+12162 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Red meat associated with risk of developing Type 2 diabetes, study shows - Good Morning America", "description": "A new study shows that eating red meat is strongly associated with a greater risk of developing Type 2 diabetes. ABC News Chief Medical Correspondent Dr. Jen...", "url": "https://www.youtube.com/watch?v=uqbLwgPaBaM", "urlToImage": "https://i.ytimg.com/vi/uqbLwgPaBaM/maxresdefault.jpg", "publishedAt": "2023-10-19T21:14:05Z", "content": null}, {"source": {"id": null, "name": "AZFamily"}, "author": "Associated Press", "title": "Travelers should be on alert for potential violent protests and terror attacks, State Department warns - Arizona's Family", "description": "In a “Worldwide Caution” issued on Thursday, the department advised Americans to “exercise increased caution due to the potential for violence and increased tensions” in all countries.", "url": "https://www.azfamily.com/2023/10/19/travelers-should-be-alert-potential-violent-protests-terror-attacks-state-department-warns/", "urlToImage": "https://gray-kpho-prod.cdn.arcpublishing.com/resizer/erEBNTEZibHoFUd_mtRYO09QQj8=/1200x600/smart/filters:quality(85)/cloudfront-us-east-1.images.arcpublishing.com/gray/CG255WCYZZADDDL6BPFDGV3XXY.jpg", "publishedAt": "2023-10-19T16:40:00Z", "content": "WASHINGTON (AP) - The State Department is warning U.S. citizens of potential for terrorist attacks and violent demonstrations around the world as the Israel-Hamas war intensifies and threats against … [+649 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brittany Kasko", "title": "NASA releases new image of Earth taken from space during annular solar eclipse: See the stunning shot - Fox News", "description": "NASA released a new image of the recent annular solar eclipse where North America can be seen in total darkness. See the moment caught by a space satellite.", "url": "https://www.foxnews.com/lifestyle/nasa-releases-new-image-earth-taken-space-during-annular-solar-eclipse-stunning-shot", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/10/eclipse_annular_epc_2023287_lrg.jpg", "publishedAt": "2023-10-19T15:59:00Z", "content": "A new image from NASA shows a recent moment when millions of Americans stopped to check out the sun using proper precautions to protect their eyes, of course. \r\nAn annular solar eclipse occurred on O… [+2214 chars]"}]}