{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Christopher Rugaber", "title": "US consumer confidence plunges to lowest in 5 years on tariff worries - AP News", "description": "Americans’ confidence in the economy slumped for the fifth straight month to the lowest level since the onset of COIVD-19 as worries about the impact of tariffs take a heavy toll on consumer expectations for future growth. The Conference Board said Tuesday th…", "url": "https://apnews.com/article/economy-confidence-tariffs-f3cb9058971c008127f8dc22c8933296", "urlToImage": "https://dims.apnews.com/dims4/default/f5caeae/2147483647/strip/true/crop/4820x2711+0+251/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb6%2F61%2Fc2a9df93a6e25dfa2b50fa13ee40%2F622c298b6e2f45fd8700e360a605f74f", "publishedAt": "2025-04-29T14:12:00Z", "content": "WASHINGTON (AP) Americans confidence in the economy slumped for the fifth straight month to the lowest level since the onset of the COIVD-19 pandemic as anxiety over the impact of tariffs takes a hea… [+2004 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Katie Camero", "title": "Women who survive cancer are more likely than men to have fatigue and depression - NBC News", "description": "Women who survive cancer are more likely to experience cancer-related fatigue and depression than men, according to new research presented Tuesday at the American Association for Cancer Research’s annual meeting in Chicago.", "url": "https://www.nbcnews.com/health/cancer/women-survive-cancer-are-likely-fatigue-depression-men-rcna203376", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-09/230920-depression-silhouette-stock-ac-610p-2872e0.jpg", "publishedAt": "2025-04-29T13:00:41Z", "content": "Women who survive cancer are more likely to experience cancer-related fatigue and depression than men, according to new research presented Tuesday at the American Association for Cancer Researchs ann… [+6747 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta", "title": "CNN Poll: Frustrated Americans want more checks on Trump, have dim views of Democratic opposition - CNN", "description": "The American public is frustrated, disappointed and increasingly angry at the state of politics 100 days into Donald Trump’s second term in the White House.", "url": "https://www.cnn.com/2025/04/29/politics/poll-frustration-anger-politics/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-2025-02-17t184050z-1250468344-rc2iwca4r0s6-rtrmadp-3-usa-trump-protests.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-29T09:00:00Z", "content": "The American public is frustrated, disappointed and increasingly angry at the state of politics 100 days into Donald Trumps second term in the White House, according to a new CNN poll conducted by SS… [+6707 chars]"}]}