{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": null, "title": "Marcial stops Hart in 4th round after hitting the canvas 3 times - Rappler", "description": "Eumir Marcial gets caught by Isiah Hart with hard counters to the chin, but the Filipino Olympic medalist manages to recover and hurt the taller American with body punches", "url": "https://www.rappler.com/sports/boxing/fight-results-eumir-marcial-isiah-hart-april-9-2022/", "urlToImage": "https://www.rappler.com/tachyon/2022/04/eumir-marcial-april-10-2022.jpeg", "publishedAt": "2022-04-10T06:30:39Z", "content": "MANILA, Philippines Eumir Marcial shook off the shock of hitting the canvas thrice to stop American Isiah Hart in the fourth round of their middleweight bout at the Virgin Hotels Las Vegas on Saturda… [+1831 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Canada's Gushue defeats U.S. in semifinal, will play for gold at men's curling worlds - CBC Sports", "description": "Canada's Brad Gushue will play for gold at the world men's curling championship after an 8-5 semifinal win over American Korey Dropkin on Saturday night.", "url": "https://www.cbc.ca/sports/olympics/winter/curling/gushue-canada-men-curling-world-championship-recap-april-8-1.6414926", "urlToImage": "https://i.cbc.ca/1.6415018.1649567513!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/brad-gushue-05042022.jpg", "publishedAt": "2022-04-10T00:46:00Z", "content": "The two clear favourites have delivered all week at the world men's curling championship. Saturday's semifinals were no different.\r\nCanada's Brad Gushue and Sweden's Niklas Edin posted evening victor… [+2578 chars]"}, {"source": {"id": null, "name": "Autojosh.com"}, "author": "https://facebook.com/autojoshng", "title": "Ford Honors Holman Moody With Special Heritage Edition GT - AutoJosh", "description": "Ford GT has reached the end of its production life but it’s not going away without offering something special (probably limited) in the veil of the Holman Moody Heritage Edition. The American race team based in Charlotte, North Carolina, campaigned three GT40…", "url": "https://autojosh.com/ford-honors-holman-moody-with-special-heritage-edition-gt/", "urlToImage": "https://autojosh.com/wp-content/uploads/2022/04/holman_moody_gt_autojosh.jpg", "publishedAt": "2022-04-09T22:12:20Z", "content": "Ford GT has reached the end of its production life but it’s not going away without offering something special (probably limited) in the veil of the Holman Moody Heritage Edition.\r\nThe American race t… [+1670 chars]"}]}