{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN, Fiona Sinclair Scott, CNN", "title": "Pharrell Williams will be Louis Vuitton's next men's creative director - CNN", "description": "The American musician, record producer and designer Pharrell Williams will succeed the late Virgil Abloh at Louis Vuitton.", "url": "https://www.cnn.com/style/article/louis-vuitton-pharrell-williams-mens-creative-director/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/230214143102-pharrell-williams-file-restricted-020523-super-tease.jpg", "publishedAt": "2023-02-14T19:26:12Z", "content": "American musician, record producer and designer Pharrell Williams will succeed Virgil Abloh as Louis Vuitton's men's creative director, according to a statement issued by the French luxury fashion ho… [+2231 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Dalga D. Surofchy, PharmD, APh, Neil Shieh, PharmD, Iris Tam, PharmD", "title": "Evolving Considerations for Choice of Hepatitis B Vaccine - AJMC.com Managed Markets Network", "description": "The American Journal of Managed Care provides insights into the latest news and research in managed care across multimedia platforms.", "url": "https://www.ajmc.com/view/evolving-considerations-for-choice-of-hepatitis-b-vaccine", "urlToImage": "https://s3.amazonaws.com/mjhlifesciences.com/sitelogos/AJMC_1200x637.png", "publishedAt": "2023-02-14T18:16:07Z", "content": "ABSTRACT\r\nThere is currently no known cure for hepatitis B virus (HBV) infection, and HBV remains a major public health burden in the United States. The US Department of Health and Human Services has… [+47745 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Kanishka Singharia", "title": "2024 US presidential race: 5 things about Indian-American Nikki Haley - Hindustan Times", "description": "Nikki Haley is positioning herself as a changemaker who can reinvigorate a party and country she says have lost their way in recent years. | World News", "url": "https://www.hindustantimes.com/world-news/2024-us-presidential-race-5-things-about-indian-american-nikki-haley-101676387387398.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/02/14/1600x900/USA-ELECTION-HALEY-1_1676395532228_1676395532228_1676395554024_1676395554024.JPG", "publishedAt": "2023-02-14T17:27:05Z", "content": "Indian-American Nikki Haley, a former South Carolina governor, and United Nations ambassador, on Tuesday, declared her candidature for president of the US in 2024. She became the first Republican to … [+1390 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Chikungunya cases nearly double in 2022 in the Americas, 2023 sees this trend continuing - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological alert published yesterday. In 2022, a total of 271,176 cases of …", "url": "http://outbreaknewstoday.com/chikungunya-cases-nearly-double-in-2022-in-the-americas-2023-sees-this-trend-continuing-21329/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2022/08/26049_lores.jpg", "publishedAt": "2023-02-14T13:07:26Z", "content": "NewsDesk @bactiman63\r\nThe Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological ale… [+1689 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Sign language performer shines at Super Bowl - CTV News", "description": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl. Videos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise her energetic performances Sunday.", "url": "https://www.ctvnews.ca/entertainment/how-asl-performer-justina-miles-stole-the-show-at-super-bowl-lvii-1.6271922", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2023/2/13/justina-miles-at-the-super-bowl-1-6271929-1676320761688.jpg", "publishedAt": "2023-02-13T20:40:07Z", "content": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl.\r\nVideos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise he… [+1975 chars]"}]}