{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Joanna Robin", "title": "Donald Trump, the Proud Boys and shocking video: The key moments from the first January 6 committee hearing - ABC News", "description": "Armed with new videos, text messages and emails, the committee investigating the riots at the US Capitol on January 6, 2021, has laid out its evidence for the American public. Here's what we learned.", "url": "https://www.abc.net.au/news/2022-06-10/capitol-riot-january-6-comittee-hearing-key-moments/101137338", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/89c3f8177e32f85af10d1027173327c7?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=521&width=862&height=485", "publishedAt": "2022-06-10T03:28:26Z", "content": "The House committee investigating the January 6 riot at the US Capitol wanted its first public hearing to make a splash.\r\nWith the help of a former television executive, the bipartisan group hoped to… [+8446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden watches as Latin American leaders criticize his decision to exclude some nations from Summit of the Americas - CNN", "description": "President Joe Biden on Thursday watched on as Latin American leaders lambasted his decision to exclude autocratic leaders from the Summit of the Americas in Los Angeles, just moments after the President had delivered remarks underscoring his belief that the f…", "url": "https://www.cnn.com/2022/06/09/politics/biden-summit-of-the-americas-day-two/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608221624-05-summit-of-the-americas-bidens-060822-super-tease.jpg", "publishedAt": "2022-06-10T00:01:00Z", "content": "(CNN)President Joe Biden on Thursday watched on as Latin American leaders lambasted his decision to exclude autocratic leaders from the Summit of the Americas in Los Angeles, just moments after the P… [+6429 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Clark leads Canadian Open after first round as controversy continues in golf world - Sportsnet.ca", "description": "Wyndham Clark held on to his clubhouse lead to finish the first round of the Canadian Open atop the leaderboard. No one in Thursday afternoon's wave came close to the American's bogey-free 7-under 63.", "url": "https://www.sportsnet.ca/golf/article/clark-leads-canadian-open-after-first-round-as-controversy-continues-in-golf-world/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/06/CP158290010-1040x572.jpg", "publishedAt": "2022-06-09T23:35:00Z", "content": "TORONTO -- Warm sunshine pierced the overcast sky during the first round of the RBC Canadian Open, even as the PGA Tour event was overshadowed by other news in the world of golf.\r\nWyndham Clark held … [+3361 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Kenneth Chang", "title": "NASA Plans to Join U.F.O. Research Efforts - The New York Times", "description": "The truth is out there, and now America’s space agency will add its resources to the study of unidentified aerial phenomena.", "url": "https://www.nytimes.com/2022/06/09/science/nasa-ufo-uap.html", "urlToImage": "https://static01.nyt.com/images/2022/06/09/science/09nasa/09nasa-facebookJumbo.jpg", "publishedAt": "2022-06-09T21:48:31Z", "content": "Its for a research program that we can then implement, he said.\r\nWhile many scientists might consider U.F.O. research as not actual science, tackling controversial questions is important, Dr. Zurbuch… [+1467 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Summit of the Americas: Canada, California focus on climate - CTV News", "description": "It's an itinerary worthy of Hollywood: Canada and California are kindred progressive spirits on climate change, Gov. Gavin Newsom said Thursday as he and Prime Minister Justin Trudeau unveiled a new blueprint for working together to stave off the worst conseq…", "url": "https://www.ctvnews.ca/canada/canada-california-to-partner-on-climate-action-and-nature-protection-1.5939445", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/6/9/trudeau--biden-1-5939446-1654764468374.jpg", "publishedAt": "2022-06-09T21:46:04Z", "content": "LOS ANGELES - \r\nCanada and California are kindred progressive spirits on climate change, Gov. Gavin Newsom said Thursday as he and Prime Minister Justin Trudeau unveiled a new blueprint for working t… [+4520 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Crisis in the Oil Market Hasn't Arrived Yet: Blanch - Bloomberg Markets and Finance", "description": "Francisco Blanch, head of global commodities and derivatives research at Bank of America Corp., says oil prices have not peaked yet. He speaks on \"Bloomberg ...", "url": "https://www.youtube.com/watch?v=NP4khc_RT5U", "urlToImage": "https://i.ytimg.com/vi/NP4khc_RT5U/hqdefault.jpg", "publishedAt": "2022-06-09T16:40:48Z", "content": null}]}