{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Rockets fired at Kabul airport as deadline looms for U.S. withdrawal from Afghanistan - CBC.ca", "description": "Rocket fire apparently targeting Kabul's international airport struck a nearby neighbourhood on Monday, the eve of the deadline for American troops to withdraw from the country's longest war after the Taliban takeover of Afghanistan.", "url": "https://www.cbc.ca/news/world/rocket-attack-kabul-1.6157938", "urlToImage": "https://i.cbc.ca/1.6157950.1630305482!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/kabul-rocket-attacks.jpg", "publishedAt": "2021-08-30T08:52:16Z", "content": "Rocket fire apparently targeting Kabul's international airport struck a nearby neighbourhood on Monday, the eve of the deadline for American troops to withdraw from the country's longest war after th… [+4702 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Sealy and Hollie Silverman, CNN", "title": "100,000 more people could die by December, Fauci says. But it is still possible to turn it around - CNN", "description": "With nearly 100,000 Americans hospitalized with Covid-19 and infections surging among the unvaccinated population, it's possible another 100,000 people could die from the virus by December, according to a recent University of Washington model.", "url": "https://www.cnn.com/2021/08/30/health/us-coronavirus-monday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210829233546-01-us-coronavirus-monday-0830-super-tease.jpg", "publishedAt": "2021-08-30T07:59:00Z", "content": "(CNN)With nearly 100,000 Americans hospitalized with Covid-19 and infections surging among the unvaccinated population, it's possible another 100,000 people could die from the virus by December, acco… [+6213 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "GMA News", "title": "Former actress Juliana Palermo is now married! - GMA News Online", "description": "Former actress Juliana Palermo is now married to her American partner Joel Cabtree!", "url": "https://www.gmanetwork.com/news/lifestyle/familyandrelationships/801358/former-actress-juliana-palermo-is-now-married/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/08/juliana_2021_08_29_15_54_55.jpg", "publishedAt": "2021-08-30T06:06:06Z", "content": "Former actress Juliana Palermo is now married to her American partner Joel Crabtree!\r\n Juliana's manager, Vivian Recio, confirmed the news to PEP.ph, saying the ceremony was held last Thursday, just … [+854 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Kathy Gannon", "title": "Rockets fired at Kabul airport amid US withdrawal hit homes - Associated Press", "description": "KABUL, Afghanistan (AP) — Rocket fire apparently targeting Kabul's international airport struck a nearby neighborhood on Monday, the eve of the deadline for American troops to withdraw from the country’s longest war after the Taliban takeover of Afghanistan.", "url": "https://apnews.com/article/business-kabul-b657e37e182c445eb985a585bbde8b5e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/77f64af8b1b64ccf9b333257e972a4d1/3000.jpeg", "publishedAt": "2021-08-30T04:26:34Z", "content": "KABUL, Afghanistan (AP) Rocket fire apparently targeting Kabuls international airport struck a nearby neighborhood on Monday, the eve of the deadline for American troops to withdraw from the countrys… [+6149 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Ben Kesling, Michael M. Phillips", "title": "Trapped in Afghanistan, Rescued by Volunteers: How a Handful of Americans Freed 5,000 Afghans - The Wall Street Journal", "description": "From a lounge at the Willard Hotel in Washington, a group of men and women mobilized a global network to conduct a two-week military-style rescue operation", "url": "https://www.wsj.com/articles/trapped-in-afghanistan-rescued-by-volunteers-how-a-handful-of-americans-freed-5-000-afghans-11630284116", "urlToImage": "https://images.wsj.net/im-393003/social", "publishedAt": "2021-08-30T00:41:00Z", "content": "Zach Van Meter, a private-equity investor from Naples, Fla., phoned the government of Somaliland last week, asking if it would host thousands of Afghan refugees.\r\nHe just called me out of the blue, s… [+1338 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Pens, Pencils, and Debunking Myths: How NASA Takes Notes in Space - SciTechDaily", "description": "The Space Pen has captured the American imagination in more ways than one. It’s appeared repeatedly in pop culture and even worked as a plot device in a \"Seinfeld\" episode titled \"The Pen,\" and in 2021 was inducted into the Space Technology Hall of Fame. It’s…", "url": "https://scitechdaily.com/space-pens-pencils-and-debunking-myths-how-nasa-takes-notes-in-space/", "urlToImage": "https://scitechdaily.com/images/NASA-astronaut-Walter-Cunningham-Writes-With-Fisher-Space-Pen.jpg", "publishedAt": "2021-08-29T19:11:49Z", "content": "ByMike DiCicco and Naomi Seck, NASA SpinoffAugust 29, 2021\r\nNASA astronaut Walter Cunningham writes with a Fisher Space Pen during the flight of Apollo 7, the first crewed Apollo flight and the Space… [+5721 chars]"}, {"source": {"id": null, "name": "Post Magazine"}, "author": null, "title": "Top Chinese and American diplomats discuss Afghanistan amid tense relations - South China Morning Post", "description": "In phone conversation, Foreign Minister Wang Yi says coordination between China and the US over Afghanistan would depend on Washington’s policies towards Beijing in other areas.", "url": "https://www.scmp.com/news/china/diplomacy/article/3146817/top-china-diplomat-wang-yi-tells-us-counterpart-anthony", "urlToImage": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2021/08/30/e08d9086-08f2-11ec-a83e-ec0670db1017_image_hires_070359.jpg?itok=FGb2hQxZ&v=1630278248", "publishedAt": "2021-08-29T18:06:29Z", "content": "Published: 2:06am, 30 Aug, 2021\r\nUpdated: 12:11pm, 30 Aug, 2021"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Coronavirus: What's happening in Canada and around the world Aug. 29 - CBC.ca", "description": "The U.S. government's top infectious disease expert says the country is sticking with its recommendation for Americans to get COVID-19 booster shots eight months after receiving the vaccine but will be open to changes based on evolving data.", "url": "https://www.cbc.ca/news/world/coronavirus-covid19-canada-world-august29-2021-1.6157556", "urlToImage": "https://i.cbc.ca/1.6157625.1630259847!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-booster-shot.jpg", "publishedAt": "2021-08-29T17:17:00Z", "content": "The latest:\r\nThe U.S. government's top infectious disease expert says the country is sticking with its recommendation for Americans to get COVID-19 booster shots eight months after receiving the vacc… [+1994 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Kathy Gannon, Lolita C. Baldor, Tameem Akhgar and Joseph Krauss", "title": "U.S. says drone kills ISIS bombers targeting Kabul airport - CTV News", "description": "A U.S. drone strike blew up a vehicle carrying 'multiple suicide bombers' from Afghanistan's Islamic State affiliate on Sunday before they could attack the ongoing military evacuation at Kabul's international airport, American officials said. An Afghan offici…", "url": "https://www.ctvnews.ca/world/u-s-says-drone-kills-isis-bombers-targeting-kabul-airport-1.5565733", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5565894.1630266242!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-08-29T14:33:00Z", "content": "KABUL, AFGHANISTAN -- \r\nA U.S. drone strike blew up a vehicle carrying \"multiple suicide bombers\" from Afghanistan's Islamic State affiliate on Sunday before they could attack the ongoing military ev… [+7853 chars]"}]}