{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Announces All Adults In US Eligible For Covid Vaccine By April 19 - NDTV", "description": "President Joe Biden announced Tuesday that all adults across America will be eligible for Covid-19 shots within two weeks, while economic powerhouse California set a June 15 target to fully reopen businesses.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-announces-all-adults-in-us-eligible-for-covid-vaccine-by-april-19-2407858", "urlToImage": "https://c.ndtvimg.com/2021-04/7hh5irlg_joe-biden-afp_625x300_07_April_21.jpg", "publishedAt": "2021-04-07T01:56:06Z", "content": "Joe Biden announced that all adults across America will be eligible for Covid-19 shots within two weeks.\r\nWashington, United States: President Joe Biden announced Tuesday that all adults across Ameri… [+5223 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Reuters", "title": "Police, communities across US fight back against anti-Asian hate crimes - Rappler", "description": "A Center for the Study of Hate and Extremism report shows that while hate crimes overall in the US had fallen slightly in 2020, crimes against Asian Americans and Pacific Islanders had jumped by 145%", "url": "https://www.rappler.com/world/us-canada/police-communities-fight-back-against-anti-asian-hate-crimes", "urlToImage": "https://assets2.rappler.com/2021/04/japantown-prepared-march-24-2021-reuters-1617630531724.jpg", "publishedAt": "2021-04-05T13:53:00Z", "content": "The officers walked through the arcade of hair and nail salons, restaurants serving Vietnamese cuisine, and herbal medicine shops on Saturday, April 3, talking to business owners and patrons. They th… [+167 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": null, "title": "Ben Bruce partners with Wesley Snipes for Nollywood-Hollywood films - TheCable Lifestyle - TheCable", "description": "Ben Murray-Bruce, former Nigerian senator, says he has formed a new partnership with Wesley Snipes, an American actor and filmmaker for the", "url": "http://lifestyle.thecable.ng/ben-bruce-partners-with-wesley-snipes-to-produce-nollywood-hollywood-films/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/04/Wesley-Snipes-Ben-Bruce.jpg", "publishedAt": "2021-04-05T12:00:00Z", "content": "Ben Murray-Bruce, former Nigerian senator, says he has sealed a new partnership with Wesley Snipes, American actor and filmmaker, for the production of Hollywood and Nollywood movies.\r\nThe politician… [+1830 chars]"}]}