{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Donald Trump's family launches 'Made in America' T1 smartphone. Here's what it offers - Mint", "description": "Donald Trump’s family launches Trump Mobile, a mobile phone service utilizing existing US carrier networks. The venture raises conflict of interest concerns as Trump retains business interests while in office.", "url": "https://www.livemint.com/news/world/donald-trumps-family-launches-made-in-america-t1-smartphone-heres-what-it-offers-11750128008442.html", "urlToImage": "https://www.livemint.com/lm-img/img/2025/06/17/1600x900/Canada-G7-Summit-22_1750129342584_1750129391160.jpg", "publishedAt": "2025-06-17T03:52:05Z", "content": "US President Donald Trumps family is entering the mobile phone market with a new Trump-branded service called Trump Mobile, which will operate using existing wireless networks and American-made hardw… [+4208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, Ella Nilsen, Manu Raju, Sarah Ferris", "title": "Senate Republicans unveil plan for cuts to Medicaid and taxes in Trump agenda bill - CNN", "description": "The Senate Finance Committee on Monday released its version of the GOP’s package that calls for enacting sweeping cuts to Medicaid and preventing a multi-trillion dollar tax hike on Americans.", "url": "https://www.cnn.com/2025/06/16/politics/medicaid-cuts-senate-tax-bill", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2220451332.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-06-17T01:30:00Z", "content": "The GOP-ledSenate Finance Committee on Monday released itsproposal for President Donald Trumps agenda billthat calls for enacting sweeping cuts to Medicaid and preventing a multi-trillion dollar tax … [+6774 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Gregory Svirnovskiy", "title": "American Bar Association sues Trump administration over executive orders targeting law firms - Politico", "description": "It claims the executive orders pursued by the White House have cast a chill across the legal industry.", "url": "https://www.politico.com/news/2025/06/16/american-bar-association-sues-trump-00409204", "urlToImage": "https://static.politico.com/fd/18/41cd5bd04169a03de0231a8c90f1/https-delivery-gettyimages.com/downloads/2220445402", "publishedAt": "2025-06-16T22:02:57Z", "content": "Throughout his first several months in office, Trump has hammered major law firms, including Paul, Weiss, Rifkind, Wharton &amp; Garrison, with executive orders and memos seeking to freeze their fede… [+2325 chars]"}]}