{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Psychiatryadvisor.com"}, "author": null, "title": "A Year of Standard Care for Treatment Resistant Depression Fails to Improve Symptoms of Suicidality - Psychiatry Advisor", "description": "The Treatment-resistant Depression in America Latina (TRAL) study was conducted at centers in Argentina, Brazil, Colombia, and Mexico between 2017 and 2018.", "url": "https://www.psychiatryadvisor.com/home/topics/suicide-and-self-harm/year-of-soc-therapy-for-trd-had-suboptimal-effects-on-symptoms-of-depression-and-suicidality/", "urlToImage": "https://www.psychiatryadvisor.com/wp-content/uploads/sites/8/2022/02/Depression-Headache_G_1324340507-1.jpg", "publishedAt": "2022-07-20T14:10:00Z", "content": "A year of standard of care (SOC) therapy for treatment resistant depression (TRD) had suboptimal effects on symptoms of depression and suicidality. These findings were published in the the Revista de… [+3083 chars]"}, {"source": {"id": null, "name": "Lupus.org"}, "author": null, "title": "Machine Learning Methods Can Help Predict Lupus Hospitalizations - Lupus Foundation of America", "description": "A new study shows that machine learning can be used to help predict risk of hospitalization in people with lupus.", "url": "https://www.lupus.org/news/machine-learning-methods-can-help-predict-lupus-hospitalizations", "urlToImage": "https://www.lupus.org/sites/default/files/styles/og_image/public/media/images/disease-ILR.JPG", "publishedAt": "2022-07-20T12:00:00Z", "content": "A new study shows that machine learning can be used to help predict risk of hospitalization in people with lupus. Machine learning refers to the process by which a machine or computer can imitate hum… [+1545 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": "ESPN", "title": "2022 MLB All-Star Game - Best moments, takeaways from the American League's victory in Los Angeles - ESPN", "description": "The American League won its ninth straight All-Star game with a 3-2 victory over the National League. Here's the best moments and takeaways from Tuesday's action.", "url": "https://www.espn.com/mlb/story/_/id/34264137/2022-mlb-all-star-game-best-sights-sounds-los-angeles", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0720%2Fr1038408_1296x729_16%2D9.jpg", "publishedAt": "2022-07-20T03:43:42Z", "content": "The 2022 MLB All-Star Game came to Hollywood as Dodger Stadium hosted the biggest and brightest names in baseball.\r\nIt was familiar territory for Los Angeles Dodgers ace Clayton Kershaw, who was just… [+16163 chars]"}]}