{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN Reporter, Crime and Justice", "title": "Two Georgia election workers sue Giuliani and One America News, claiming election lies prompted severe harassment - CNN", "description": "Two Georgia election workers are accusing right-wing TV network One America News and former Trump lawyer and pundit Rudy Giuliani of destroying their reputations and prompting Trump supporters to harass them -- filling their lives with fear -- because of fals…", "url": "https://www.cnn.com/2021/12/23/politics/georgia-election-workers-lawsuit-rudy-giuliani-one-america-news/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223172221-giuliani-sept-2020-super-tease.jpg", "publishedAt": "2021-12-24T01:59:00Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "A peerless prose stylist: American journalist and author Joan Didion dies at 87 - CBC.ca", "description": "The revered American writer, whose provocative social commentary made her a critic of a uniquely turbulent time, has died. Didion's publisher announced the author's death on Dec. 23, 2021.", "url": "https://www.cbc.ca/books/a-peerless-prose-stylist-american-journalist-and-author-joan-didion-dies-at-87-1.6296528", "urlToImage": "https://i.cbc.ca/1.3206968.1440766179!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/joan-didion.jpg", "publishedAt": "2021-12-23T18:37:53Z", "content": "Joan Didion, the revered American author and essayist whose precise social and personal commentary in such classics as The White Album, South and West and The Year of Magical Thinking made her a uniq… [+4047 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Douwe Van Hinsbergen", "title": "The Somalayas are the biggest mountain range you will never see - Phys.org", "description": "Every geography schoolbook has them: maps that look like today's Earth, but not quite, since all continents are merged into a single supercontinent. Those maps were used to explain why dinosaurs in South America and Africa, or North America and Europe looked …", "url": "https://phys.org/news/2021-12-somalayas-biggest-mountain-range.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/the-somalayas-are-the.jpg", "publishedAt": "2021-12-23T14:37:08Z", "content": "Every geography schoolbook has them: maps that look like today's Earth, but not quite, since all continents are merged into a single supercontinent. Those maps were used to explain why dinosaurs in S… [+4906 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes", "title": "Launch of Nasa telescope delayed to Christmas Day - The Straits Times", "description": "KOUROU (French Guiana) • The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weather at the launch site on South America's north-eastern coa…", "url": "https://www.straitstimes.com/world/launch-of-nasa-telescope-delayed-to-christmas-day", "urlToImage": null, "publishedAt": "2021-12-22T21:00:00Z", "content": "KOUROU (French Guiana) The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weath… [+1705 chars]"}]}