{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "India TV News"}, "author": "Edited by India TV Entertainment Desk", "title": "Priyanka Chopra's daughter Malti Marie's pic melts hearts; fans debate if she resembles actress or Nick Jonas - India TV News", "description": "Priyanka Chopra's daughter Malti Marie's pic has gone viral on the Internet. As they got a closer look at the toddler, fans instantly start debating who does she resembles -- the Bollywood star or American pop singer Nick Jonas.", "url": "https://www.indiatvnews.com/entertainment/celebrities/priyanka-chopra-daughter-malti-marie-photo-melts-hearts-fans-debate-she-resembles-actress-or-nick-jonas-2022-11-23-825793", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2022/11/priyanka-chopra-daughter-1-1669166596.jpg", "publishedAt": "2022-11-23T01:31:07Z", "content": "Priyanka Chopra's daughter Malti Marie looks like the Bollywood star or does she resembles her American pop-star father Nick Jonas? Well, fans have been debating ever since the actress shared a close… [+2081 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": null, "title": "Rappler Talk: Kalayaan acting mayor on Kamala Harris' Palawan trip - Rappler", "description": "What does the visit of America’s second most powerful leader mean to residents of Kalayaan?", "url": "https://www.rappler.com/nation/interview-kalayaan-acting-mayor-billy-alindogan-united-states-vice-president-kamala-harris-palawan-visit/", "urlToImage": "https://www.rappler.com/tachyon/2022/11/titlecard.jpg", "publishedAt": "2022-11-23T00:17:44Z", "content": "KALAYAAN, Palawan Acting Mayor Billy Alindogan of the municipality of Kalayaan in Pag-asa Island in the West Philippine Sea sits down with Rappler reporter Sofia Tomacruz to discuss the visit of US V… [+498 chars]"}, {"source": {"id": null, "name": "Columbia.edu"}, "author": "Columbia Climate School", "title": "Iron-Rich Dust From South America Played Role in Last Two Glacial Periods, Says Study - Columbia University", "description": "Dust from the land that gets blown into the ocean appears to influence natural climate swings. A new study looks into where much of that dust came from in the past 260,000 years.", "url": "https://news.climate.columbia.edu/2022/11/22/iron-rich-dust-from-south-america-played-role-in-last-two-glacial-periods-says-study/", "urlToImage": "https://news.climate.columbia.edu/wp-content/uploads/2022/11/PS75_waves-scaled.jpg", "publishedAt": "2022-11-22T18:29:14Z", "content": "Seafloor sediment from the South Pacific Ocean, seen here from the deck of the research vessel Polarstern, has opened a window onto how iron-rich dust blown from South America may have played a role … [+4915 chars]"}]}