{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Joel Huerto", "title": "Republicans explain their vote against Asian American hate crimes legislation - Yahoo News", "description": "The COVID-19 Hate Crimes Act will expedite the review of hate crimes related to the pandemic and expand efforts to make the reporting of hate crimes more...", "url": "https://news.yahoo.com/republicans-explain-their-vote-against-asian-american-hate-crimes-legislation-195014384.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-05/06d5d360-b99e-11eb-bf5e-758e45995d4a", "publishedAt": "2021-05-20T19:50:14Z", "content": "On Tuesday, the House of Representatives joined the Senate in easily passing a bill aimed at addressing the recent rise in attacks on Asian Americans and Pacific Islanders. But unlike in the Senate, … [+10711 chars]"}, {"source": {"id": null, "name": "Business Insider India"}, "author": "Avery Hartmans", "title": "Moderna CEO says some Americans could start getting a COVID-19 booster shot as soon as September - Business Insider India", "description": "Moderna's CEO said some Americans could need a booster shot as soon as September. The third shot would come eight or nine months after the initial vaccine.", "url": "https://www.businessinsider.in/science/health/news/moderna-ceo-says-some-americans-could-start-getting-a-covid-19-booster-shot-as-soon-as-september/articleshow/82803719.cms", "urlToImage": "https://www.businessinsider.in/photo/82803719/moderna-ceo-says-some-americans-could-start-getting-a-covid-19-booster-shot-as-soon-as-september.jpg?imgsize=2685405", "publishedAt": "2021-05-20T15:14:00Z", "content": "Many Americans could start receiving booster shots as soon as this fall.\r\nModerna\r\n CEO Stéphane Bancel said in an email on Wednesday that people who are at highest risk from COVID-19, like healthcar… [+1914 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Vaccine tourism: Is it legal and ethical to fly out for COVID-19 shots? All you need to know - Firstpost", "description": "Ever since vaccines became available, rich Indians with Dubai residences have been flying to the country to get Pfizer shots, South Africans have been flying to Zimbabwe, Canadians and Latin Americans to the US and Europeans to Russia for COVID-19 shots", "url": "https://www.firstpost.com/india/vaccine-tourism-is-it-legal-and-ethical-to-fly-out-for-covid-19-shots-all-you-need-to-know-9636521.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/05/Sinopharm-vaccine_AP_640.jpg", "publishedAt": "2021-05-20T02:57:06Z", "content": "Ever since vaccines became available, rich Indians with Dubai residences have been flying to the country to get Pfizer shots, South Africans have been flying to Zimbabwe, Canadians and Latin American… [+6059 chars]"}]}