{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Kirsten Chuba", "title": "Greta Gerwig on ‘Barbie’ vs. ‘Oppenheimer’ Battle and Margot Robbie’s Already-Iconic Foot: “I Did Always Think of the Arched Foot as a Bat Signal” - Hollywood Reporter", "description": "Stars Margot Robbie, Ryan Gosling, Issa Rae, America Ferrera, Kate McKinnon, Michael Cera and Simu Liu joined Gerwig at the 'Barbie' world premiere in Los Angeles on Sunday.", "url": "https://www.hollywoodreporter.com/movies/movie-news/greta-gerwig-barbie-vs-oppenheimer-margot-robbie-foot-1235531801/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2023/07/gretagerwig.jpg?w=1024", "publishedAt": "2023-07-10T04:28:40Z", "content": "After a worldwide fan event tour, Barbiefinally made its debut at the film’s world premiere in Los Angeles on Sunday, on a pink carpet that had been transformed into a real-life Barbie Land. \r\nGreta … [+4312 chars]"}, {"source": {"id": null, "name": "East Idaho News"}, "author": null, "title": "A solar storm on Thursday is expected to make the northern lights visible in 17 states - East Idaho News", "description": "BOULDER, Colorado (KSL.com) — A solar storm forecast for Thursday is expected to give sky gazers in 17 American states a chance to glimpse the northern lights, the colorful sky show that happens when solar wind hits the atmosphere. Northern lights, also known…", "url": "https://www.eastidahonews.com/2023/07/a-solar-storm-on-thursday-is-expected-to-make-the-northern-lights-visible-in-17-states/", "urlToImage": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2023/07/northern-lights.jpg", "publishedAt": "2023-07-10T01:00:00Z", "content": null}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Why many Americans use unregulated health care sharing plans - PBS NewsHour", "description": "Many Americans have enrolled in an alternative to traditional health insurance called health care sharing plans. But unlike insurance, these plans are unregulated and don’t have to meet minimum health benefits mandated by the Affordable Care Act. Kate Harris …", "url": "https://www.pbs.org/newshour/show/why-many-americans-are-paying-each-others-medical-bills-despite-the-risks", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/07/costsharing-1024x681.jpg", "publishedAt": "2023-07-09T21:40:43Z", "content": "Many Americans have enrolled in an alternative to traditional health insurance called health care sharing plans. But unlike insurance, these plans are unregulated and dont have to meet minimum health… [+191 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "The Associated Press", "title": "Solar storm on Thursday expected to make Northern Lights visible in 17 states - Phys.org", "description": "A solar storm forecast for Thursday is expected to give skygazers in 17 American states a chance to glimpse the Northern Lights, the colorful sky show that happens when solar wind hits the atmosphere.", "url": "https://phys.org/news/2023-07-solar-storm-thursday-northern-visible.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/solar-storm-on-thursda.jpg", "publishedAt": "2023-07-09T11:44:35Z", "content": "An aurora borealis, also known as the northern lights, is seen in the night sky in the early morning hours of Monday, April 24, 2023, near Washtucna, Wash. A solar storm forecast for Thursday, July 1… [+2555 chars]"}]}