{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Mark W. Sanchez", "title": "Team USA youngsters snag win over rival Canada in men's Olympic hockey - New York Post ", "description": "The NHL hockey stars are gone from these Olympics, but the American kids look ready to take advantage. The youngest team in the tournament went toe-to-toe, skate-to-skate with its chief rival, hold…", "url": "https://nypost.com/2022/02/12/team-usa-snags-win-over-rival-canada-in-mens-hockey/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/02/USA.jpg?quality=90&strip=all&w=1024", "publishedAt": "2022-02-12T06:48:00Z", "content": "The hockey stars are gone from the Olympics, but the American kids look ready to take advantage.\r\nThe youngest team in the tournament went toe to toe, skate to skate with its chief rival and held off… [+2737 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Callie Patteson", "title": "CIA collecting Americans' data in ‘bulk’ without oversight, Sens. Ron Wyden and Martin Heinrich say - New York Post ", "description": "The Central Intelligence Agency is collecting information on Americans without supervision from Congress or any other branch of government, two Democratic senators alleged in a newly declassified l…", "url": "https://nypost.com/2022/02/11/cia-collecting-americans-data-in-bulk-sens-ron-wyden-martin-heinrich/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/02/cia-data-collection-comp-1.jpg?quality=90&strip=all&w=1024", "publishedAt": "2022-02-11T18:34:00Z", "content": "The Central Intelligence Agency is collecting information on Americans without supervision from Congress or any other branch of government, two Democratic senators alleged in a newly declassified let… [+5955 chars]"}, {"source": {"id": null, "name": "American Action Forum"}, "author": null, "title": "January Consumer Price Inflation - AAF - American Action Forum", "description": "Already too many words have been written about yesterday’s Bureau of Labor Statistics (BLS) report on the January Consumer Price Index (CPI), but hey, it’s an era of inflation so too much of everything is evidently in order. Here goes. The top-line CPI rose a…", "url": "https://www.americanactionforum.org/daily-dish/january-consumer-price-inflation/", "urlToImage": "https://www.americanactionforum.org/wp-content/uploads/2017/07/DD9.png", "publishedAt": "2022-02-11T11:51:49Z", "content": "Already too many words have been written about yesterdays Bureau of Labor Statistics (BLS) report on the January Consumer Price Index (CPI), but hey, its an era of inflation so too much of everything… [+2444 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": "ESPN", "title": "'He's Ted Lasso' - Man United stars frustrated with Rangnick, Armas training - ESPN", "description": "Man United's sulking stars and a fictional American soccer coach -- ESPN's Insider Notebook has the latest from a turbulent time at Old Trafford.", "url": "https://www.espn.com.sg/football/manchester-united-engman_utd/story/4590418/hes-ted-lasso-man-united-stars-frustrated-with-rangnickarmas-training", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0210%2Fr972488_1296x729_16%2D9.jpg", "publishedAt": "2022-02-11T09:08:16Z", "content": "Manchester United's sulking stars and a fictional American soccer coach -- ESPN's Insider Notebook has the latest from a turbulent time at Old Trafford.\r\nJump to: Barcelona look to sort contract issu… [+8421 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Cherie M. Querol Moreno", "title": "Cardiac arrest survivor warns young Fil-Ams to take care of heart health - INQUIRER.net", "description": "When Jenylyn Carpio declares cardiovascular disease is the number-one killer of women, she is sending a personal message.\r\n\r\nThis year the San Diego-born Filipino American is among 12 “Real", "url": "https://www.inquirer.net", "urlToImage": "https://usa.inquirer.net/files/2022/02/2-9-2022-Jenylyn_Carpio-and-motivator-baby-Linda-Joy.jpg", "publishedAt": "2022-02-11T03:46:00Z", "content": "Jenylyn Carpio has many reasons for becoming a national volunteer for heart health awareness.  AHA\r\nWhen Jenylyn Carpio declares cardiovascular disease is the number-one killer of women, she is sendi… [+6507 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "American citizens in Ukraine should 'leave now': Joe Biden - Hindustan Times", "description": "Remarking that the US is dealing with one of the largest armies in the world (Russia), Biden warned that ‘things could go crazy quickly.’ | World News", "url": "https://www.hindustantimes.com/world-news/american-citizens-in-ukraine-should-leave-now-joe-biden-101644541827238.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/11/1600x900/US-POLITICS-BIDEN-CANCER-MOONSHOT-38_1643845203052_1644541953029.jpg", "publishedAt": "2022-02-11T01:14:34Z", "content": "US President Joe Biden on Thursday urged American citizens to leave Ukraine immediately, and warned about potential major conflict with Moscow should US and Russian troops engage each other on the gr… [+1578 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "France’s Nobel Winner For Co-Discovery Of HIV Virus Dies - Channels Television", "description": "French scientist Luc Montagnier, who won the Nobel prize for medicine for his co-discovery of the HIV virus that causes AIDS, has died aged 89, the mayor of the Paris suburb where he was hospitalised said Thursday. Montagnier died on Tuesday in the American H…", "url": "https://www.channelstv.com/2022/02/10/frances-nobel-winner-for-co-discovery-of-hiv-virus-dies/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2022/02/Luc-Montagnier.jpg", "publishedAt": "2022-02-10T21:13:14Z", "content": "In this file photo taken on February 12, 1997, AIDS co-discoverer professor Luc Montagnier gives a press conference in Paris.  Pierre BOUSSEL / AFP\r\nFrench scientist Luc Montagnier, who won the Nobel… [+3444 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Three recipes to start Heart Month right - Scot Center", "description": "Every February, The National Heart, Lung, and Blood Institute, along with The Heart Truth, a national health education program, celebrate American Heart Mont...", "url": "https://www.youtube.com/watch?v=YY77-V7oiRo", "urlToImage": "https://i.ytimg.com/vi/YY77-V7oiRo/maxresdefault.jpg", "publishedAt": "2022-02-10T17:35:39Z", "content": null}]}