{"articles": [{"author": null, "content": "ISLAMABAD - Unknown gunmen have shot dead three female anti-polio workers in Afghanistan, one of the two countries in the world along with its neighbor Pakistan, where the crippling childrens disease… [+4338 chars]", "description": "Unknown gunmen have shot dead three female anti-polio workers in Afghanistan, one of the two countries in the world along with its neighbor Pakistan, where the crippling children’s disease remains endemic. \n \nTuesday’s violence came on the second day of a fiv…", "publishedAt": "2021-03-30T12:37:13Z", "source": {"id": null, "name": "VOA News"}, "title": "3 Female Polio Vaccinators Killed in Afghanistan - Voice of America", "url": "https://www.voanews.com/south-central-asia/3-female-polio-vaccinators-killed-afghanistan", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/2021-03/2020-07-20T093105Z_1617904455_RC2XWH98ZL5F_RTRMADP_3_HEALTH-CORONAVIRUS-PAKISTAN-POLIO.JPG"}, {"author": "", "content": "Two-thirds of American adults polled approve of the job that President Biden is doing with the coronavirus pandemic. That's nearly twice as high as those who say the same of Biden's job on immigratio… [+3723 chars]", "description": "Two-thirds of Americans approve of how Biden is handling the pandemic, but only a third approves of how he's dealing with immigration. An increasing number also say they will get vaccinated.", "publishedAt": "2021-03-30T09:00:56Z", "source": {"id": null, "name": "NPR"}, "title": "Biden Approval Rating On Coronavirus, Economy, Immigration - NPR", "url": "https://www.npr.org/2021/03/30/982434413/npr-marist-poll-biden-gets-high-marks-on-covid-19-its-not-the-case-on-immigratio", "urlToImage": "https://media.npr.org/assets/img/2021/03/29/gettyimages-1232006759_wide-fa98aa539634e71b609fe1a7512bb27dbeeb8c2d.jpg?s=1400"}, {"author": "Shalini Ojha", "content": "30 Mar 2021: Pfizer, Moderna's coronavirus vaccines effective even after first dose: Study \r\nThe coronavirus vaccines developed by American pharma giant Pfizer, with Germany's BioNTech, and the one m… [+2103 chars]", "description": "The coronavirus vaccines developed by American pharma giant Pfizer, with Germany's BioNTech, and the one manufactured by Moderna, another United States...", "publishedAt": "2021-03-30T05:37:50Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Pfizer, Moderna's coronavirus vaccines effective even after first dose: Study - Yahoo India News", "url": "https://in.news.yahoo.com/pfizer-modernas-coronavirus-vaccines-effective-053750716.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/.q_IxezKOdEyLnZVwy68NA--~B/aD04MTA7dz0xNDQwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/newsbytes_319/12c400f2781335bd0659fe3f2f0d72c5"}, {"author": "AFP", "content": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May duri… [+4774 chars]", "description": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May during an arrest on a minor charge.", "publishedAt": "2021-03-30T05:33:16Z", "source": {"id": null, "name": "EWN"}, "title": "Jury in George Floyd murder trial shown harrowing video of his death - Eyewitness News", "url": "https://ewn.co.za/2021/03/30/jury-in-george-floyd-murder-trial-shown-harrowing-video-of-his-death", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/yng9tpllm5leq4xsq2o7"}, {"author": "Kurt Lozano", "content": "(Photo: Thunder Predator)\r\nThe Group Stage of the ONE Esports Dota 2 Singapore Major started on Monday (29 March), with South American underdogs Thunder Predator coming out of nowhere to finish the f… [+6253 chars]", "description": "As the second-placed team of the traditionally weaker South American regional league, they were expected to struggle against the representatives from other...", "publishedAt": "2021-03-29T13:57:36Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Singapore Major Day 3 recap: Thunder Predator shred the opposition - Yahoo Singapore News", "url": "https://sg.news.yahoo.com/singapore-major-day-3-recap-thunder-predator-go-undefeated-135736808.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/dd1d8660-9082-11eb-abc3-c2abad2e01cd"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "america"}