{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "WYATTE GRANTHAM-PHILIPS", "title": "Cutting in line? American Airlines' new boarding tech might stop you at now over 100 airports - The Associated Press", "description": "Sneaking a little ahead of line to get on that plane faster? American Airlines might stop you. In an apparent effort to reduce the headaches caused airport line cutting, American has rolled out boarding technology that alerts gate agents with an audible sound…", "url": "https://apnews.com/article/american-airlines-gate-lice-boarding-technology-907dfe7a751a0b8f19b8b0f6150c0b7b", "urlToImage": "https://dims.apnews.com/dims4/default/cff2f3a/2147483647/strip/true/crop/3139x1766+0+108/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F37%2Fb7%2F2c92848e73290d132b3073e66525%2F4852123a884048d39bdf6790f8c3ca91", "publishedAt": "2024-11-21T22:57:00Z", "content": "NEW YORK (AP) Sneaking a little ahead of line to get on that plane faster? American Airlines might stop you.\r\nIn an apparent effort to reduce the headaches caused by airport line cutting, American ha… [+4142 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen", "title": "Solving a 40-year mystery, scientists ID chemical found in millions of Americans’ tap water - CNN", "description": "For more than four decades, scientists have noticed a mysterious chemical in the treated drinking water of millions of people in the United States, but no one’s been able to pinpoint exactly what it is – until now.", "url": "https://www.cnn.com/2024/11/21/health/chloronitramide-anion-drinking-water/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230314103750-pfas-orig.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-11-21T20:11:00Z", "content": "For more than four decades, scientists have noticed a mysterious chemical in the treated drinking water of millions of people in the United States, but no ones been able to pinpoint exactly what it i… [+7575 chars]"}]}