{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "Neha LM Tripathi", "title": "5G roll-out in US: Air India cleared to operate Boeing 777 flights to America - Hindustan Times", "description": "On Tuesday, barring flights to Washington, Air India had cancelled all others to the US due to the roll-out of the new wireless technology and its possible impact on the aircraft navigation system | Latest News India", "url": "https://www.hindustantimes.com/india-news/air-india-cleared-to-operate-boeing-777-flights-to-us-101642665629684.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/20/1600x900/2b8b80e0-79c6-11ec-9200-af8cbbcf9206_1642667968396.jpg", "publishedAt": "2022-01-20T08:00:29Z", "content": "NEW DELHI: Air India was on Thursday cleared to operate its Boeing 777 flights to the US two days after it announced it was cancelling most of its direct flights to and from that country as some of t… [+1595 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "His influence was 'everything': Canadians mourn loss of fashion titan André Leon Talley - CBC News", "description": "André Leon Talley, a vibrant presence in the American fashion scene and former editor-at-large of U.S. Vogue, has died at 73. Canadians from the arts and fashion worlds mourn the style icon and reflect on his legacy.", "url": "https://www.cbc.ca/news/entertainment/canadians-reflect-on-andre-leon-talley-1.6320374", "urlToImage": "https://i.cbc.ca/1.6320920.1642632998!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/obit-andre-leon-talley.jpg", "publishedAt": "2022-01-20T00:33:00Z", "content": "When it was announced that former U.S. Vogue editor at large André Leon Talley died at 73 years old on Wednesday, the fashion community in Canada and abroad lamented an enormous loss. \r\nTalley, an in… [+3734 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "'I don't think I overpromised at all,' Biden says after challenges of 1st year in office - CBC News", "description": "U.S. President Joe Biden on Wednesday said he had underestimated the extent of Republican opposition to his programs and acknowledged Americans' frustration at the slow pace of COVID-19 testing, but said the United States was on track to meet considerable cha…", "url": "https://www.cbc.ca/news/world/biden-one-year-anniversary-1.6320803", "urlToImage": "https://i.cbc.ca/1.6320832.1642630017!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/biden.jpg", "publishedAt": "2022-01-19T22:23:00Z", "content": "U.S. President Joe Biden on Wednesday said he had underestimated the extent of Republican opposition to his programs and acknowledged Americans' frustration at the slow pace of COVID-19 testing, but … [+3633 chars]"}]}