{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Your mess can cause distress: Decluttering as self-care - INQUIRER.net", "description": "Your mess can cause distress. Living in a cluttered environment directly contributes to feelings of angst and anxiety. American Council for Exercise (ACE)-certified health coach Stacey Colino and t…", "url": "https://lifestyle.inquirer.net/387100/your-mess-can-cause-distress-decluttering-as-self-care/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2021-08-16T09:53:00Z", "content": "Your mess can cause distress. Living in a cluttered environment directly contributes to feelings of angst and anxiety.\r\nAmerican Council for Exercise (ACE)-certified health coach Stacey Colino and th… [+2067 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Matt Mcnulty", "title": "NIH director Francis Collins calls unvaccinated Americans 'sitting ducks' - Daily Mail", "description": "National Institutes of Health Director Dr Francis Collins issued his warning Sunday as the CDC reported a seven-day rolling average for new cases of 119,523.", "url": "https://www.dailymail.co.uk/news/article-9896115/NIH-director-Francis-Collins-calls-unvaccinated-Americans-sitting-ducks.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/15/23/46709887-0-image-a-24_1629065058389.jpg", "publishedAt": "2021-08-15T23:35:47Z", "content": "National Institutes of Health Director Dr Francis Collins (pictured) referred to unvaccinated Americans as 'sitting ducks' in an interview on Sunday\r\nNational Institutes of Health Director Dr Francis… [+4893 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Mandy Sims", "title": "Boeing Starliner returns to the factory instead of taking off to space - Awani Review", "description": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it's not about to end. The second", "url": "https://www.awanireview.com/boeing-starliner-returns-to-the-factory-instead-of-taking-off-to-space/", "urlToImage": null, "publishedAt": "2021-08-15T18:33:27Z", "content": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it’s not about to end. The second unmanned test flight of its Starliner space cap… [+2719 chars]"}]}