{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Plant-based diet rich in soy reduces troubling menopause symptoms by 84% - News-Medical.Net", "description": "A new study, published by the North American Menopause Society in the journal Menopause, found a plant-based diet rich in soy reduces moderate-to-severe hot flashes by 84%, from nearly five per day to fewer than one per day.", "url": "https://www.news-medical.net/news/20210715/Plant-based-diet-rich-in-soy-reduces-troubling-menopause-symptoms-by-8425.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/9/Diet_2_9b6d2e9b427b4bb2a6581f30c045ead9-620x480.jpg", "publishedAt": "2021-07-15T16:07:00Z", "content": "A new study, published by the North American Menopause Society in the journal Menopause, found a plant-based diet rich in soy reduces moderate-to-severe hot flashes by 84%, from nearly five per day t… [+4742 chars]"}, {"source": {"id": null, "name": "Investor's Business Daily"}, "author": "Investor's Business Daily", "title": "UNH Stock: UnitedHealth Earnings Top With Dow Jones Giant Near Buy Point - Investor's Business Daily", "description": "UnitedHealth earnings fell less than expected despite Americans using more medical care again. UNH stock is near a buy point.", "url": "https://www.investors.com/news/unh-stock-unitedhealth-earnings/", "urlToImage": "https://www.investors.com/wp-content/uploads/2019/10/stock-UnitedHealth-04-shutter.jpg", "publishedAt": "2021-07-15T11:10:00Z", "content": "UnitedHealth Group (UNH) beat second-quarter views and raised guidance as the spreading Delta variant of the coronavirus poses new risks as hospitalizations rise. UNH stock fell but is near a buy poi… [+2526 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "", "title": "The US Surgeon General Is Asking You To Help Fight COVID-19 Misinformation : Shots - Health News - NPR", "description": "The nation's top doctor, Vivek Murthy, says misinformation  will keep sowing mistrust and endangering lives unless all Americans do their part to fight it.", "url": "https://www.npr.org/sections/health-shots/2021/07/15/1016013826/the-u-s-surgeon-general-is-calling-covid-19-misinformation-an-urgent-threat", "urlToImage": "https://media.npr.org/assets/img/2021/07/14/ap16207768747939_wide-ccaa9dd2595e7adbac3d651d4eb675c17e84e225.jpg?s=1400", "publishedAt": "2021-07-15T09:00:00Z", "content": "U.S. Surgeon General Dr. Vivek Murthy, who has helped the U.S. through other crises like the Zika outbreak, is now taking on health misinformation around COVID-19, which he says continues to jeopardi… [+4418 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "ABS-CBN News", "title": "Pinoy Ehrlich Ocampo advances to next round of 'America's Got Talent' after flawless act - ABS-CBN News", "description": "Travelling all the way to the United States was worth it for Filipino circus performer Ehrlich Ocampo after getting four yeses from the judges of “America’s Got Talent” sending him to the next round of the competition.", "url": "https://news.abs-cbn.com/entertainment/07/15/21/pinoy-ehrlich-ocampo-advances-to-next-round-of-americas-got-talent-after-flawless-act", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/entertainment/07/13/agt.jpg", "publishedAt": "2021-07-15T00:07:00Z", "content": "Travelling all the way to the United States was worth it for Filipino circus performer Ehrlich Ocampo after getting four yeses from the judges of “America’s Got Talent,” sending him to the next round… [+1565 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "حملة إنجليزية تجمع توقيعات ضخمة لإعادة نهائي اليورو - Goal.com", "description": "Sixteen nations are vying for the title of best national team in North America, Central America and the Caribbean (CONCACAF). Mexico is the favorite to repeat as champion, with the USA expected to challenge for the trophy that will be awarded Aug. 1 in Las Ve…", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-07-13T17:54:35Z", "content": null}]}