{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Paul Tan's Automotive News"}, "author": "Gerard Lye", "title": "2022 Toyota GR Corolla teased for the US - 268 hp, GR-Four AWD hinted - Paul Tan's Automotive News", "description": "Toyota has said last year that the GR Yaris will not come to the United States. Instead, America will get its own hot hatch that is widely rumoured to be the GR Corolla, and it looks like we finally have confirmation that this is the case. Members of the GR …", "url": "https://paultan.org/2021/11/24/2022-toyota-gr-corolla-teased-for-the-us/", "urlToImage": "https://paultan.org/image/2021/11/2022-Toyota-GR-Corolla-US-teaser-1.jpg", "publishedAt": "2021-11-24T02:07:48Z", "content": "Toyota has said last year that the GR Yaris will not come to the United States. Instead, America will get its own hot hatch that is widely rumoured to be the GR Corolla, and it looks like we finally … [+1578 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health officials discuss COVID safety over the holidays - 23 ABC News | KERO", "description": "Americans across the nation and in Kern County are already hitting the roads or in the air as the holiday season kicks off.  But as COVID cases are on the ri...", "url": "https://www.youtube.com/watch?v=alFJEzfjODo", "urlToImage": "https://i.ytimg.com/vi/alFJEzfjODo/maxresdefault.jpg", "publishedAt": "2021-11-24T01:16:11Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AFP", "title": "Democratic Taiwan in, Communist China out in Biden's virtual summit - Hindustan Times", "description": "China, the United States' principal rival, is not invited, while Taiwan is -- a move that risks angering Beijing. Turkey, which like America is a member of NATO, is also missing from the list of participants. | World News", "url": "https://www.hindustantimes.com/world-news/us-prez-biden-invites-around-110-nations-to-virtual-summit-on-democracy-report-101637715204381.html", "urlToImage": "https://images.hindustantimes.com/img/2021/11/24/1600x900/biden-photo_1637722991776_1637723010453.jpg", "publishedAt": "2021-11-24T00:55:25Z", "content": "President Joe Biden has invited around 110 countries to a virtual summit on democracy in December, including major Western allies but also Iraq, India and Pakistan, according to a list posted on the … [+1239 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Jon Batiste leads Grammy nominations — Justin Bieber, Doja Cat, H.E.R. closely follow - CBC.ca", "description": "American musician and multi-genre performer scored the most nominations with 11, including an album of the year nod for We Are and record of the year with Freedom. Bieber, Doja Cat and H.E.R. each came away with the second-most nominations with eight each.", "url": "https://www.cbc.ca/news/entertainment/jon-batiste-grammy-nominations-bieber-doja-cat-her-1.6258437", "urlToImage": "https://i.cbc.ca/1.6259682.1637692389!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/jon-batiste.jpg", "publishedAt": "2021-11-23T22:32:00Z", "content": "Canadian musical talent was in the spotlight today at the nominations announcement for the 64th Grammy Awards, as some of the country's biggest hitmakers like Justin Bieber and Drake were named, as w… [+6904 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'DWTS' Mirror Ball champions - Good Morning America", "description": "Iman Shumpert and Daniela Karagach discuss their “Dancing With the Stars” win.", "url": "https://www.youtube.com/watch?v=VEKl7yvFYYQ", "urlToImage": "https://i.ytimg.com/vi/VEKl7yvFYYQ/maxresdefault.jpg", "publishedAt": "2021-11-23T22:11:20Z", "content": null}, {"source": {"id": null, "name": "Variety"}, "author": "Mónica Marie Zorrilla", "title": "TV Ratings: 2021 American Music Awards Hold Steady Amid Social Media Flurry - Variety", "description": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged. Sunday night’s awards show, which was hosted by Cardi B, averaged a 1.0/7 rating among adults …", "url": "https://variety.com/2021/tv/news/tv-ratings-2021-american-music-awards-1235118124/", "urlToImage": "https://variety.com/wp-content/uploads/2021/11/161383_SC1_5006.jpg?w=1000", "publishedAt": "2021-11-23T19:28:00Z", "content": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged.\r\nSunday night’s awards show, which… [+2230 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Voluntarios de los Panamericanos Junior, una misión que no tiene fronteras - ElTiempo.com", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/advanced/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-11-23T16:47:54Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}]}