{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "FRANCE 24 English"}, "author": "France 24", "title": "'Visionary' US astrophysicist Eugene Parker dead at 94: NASA - FRANCE 24 English", "description": "Eugene Parker, a pioneering American astrophysicist who developed a mathematical model predicting the stream of charged particles from the Sun known as solar wind, has died aged 94, NASA said on Wednesday.", "url": "https://www.france24.com/en/live-news/20220316-visionary-us-astrophysicist-eugene-parker-dead-at-94-nasa", "urlToImage": "https://s.france24.com/media/display/471c4616-a543-11ec-bd27-005056a97e36/w:1280/p:16x9/a5d474b64e046474f27fda0cad4b39a6212f06ca.jpg", "publishedAt": "2022-03-16T16:08:12Z", "content": "Washington (AFP) Eugene Parker, a pioneering American astrophysicist who developed a mathematical model predicting the stream of charged particles from the Sun known as solar wind, has died aged 94, … [+2551 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Elizabeth Ball", "title": "Climate simulations redefine causes of North American monsoon - Phys.org", "description": "On average, western Mexico and the American Southwest receive half their rainfall for the year between July and September. The deluge is due to the weather pattern known as a monsoon—but according to a new paper by University of California, Berkeley atmospher…", "url": "https://phys.org/news/2022-03-climate-simulations-redefine-north-american.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/climate-simulations-re.jpg", "publishedAt": "2022-03-16T13:46:34Z", "content": "On average, western Mexico and the American Southwest receive half their rainfall for the year between July and September. The deluge is due to the weather pattern known as a monsoonbut according to … [+6444 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Phil Mercer", "title": "Australia Facing 'Unprecedented' Japanese Encephalitis Outbreak - Voice of America - VOA News", "description": "Wet weather and migrating water suspected of spreading mosquito-borne brain disease", "url": "https://www.voanews.com/a/australia-facing-unprecedented-japanese-encephalitis-outbreak/6487573.html", "urlToImage": "https://gdb.voanews.com/029D0DEA-1433-493D-B2DA-6C6F154F07A6_cx0_cy14_cw68_w1200_r1.png", "publishedAt": "2022-03-16T12:04:56Z", "content": "SYDNEY, AUSTRALIA  The deadly mosquito-borne virus, Japanese encephalitis, is sweeping across Australia, where the youngest patient is four months old. Eighteen people have been infected, so far. Two… [+2427 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Astronaut Mark Vande Hei Breaks American Spaceflight Record - SciTechDaily", "description": "Vande Hei made it into record books on Tuesday, March 15, 2022: He broke the record for the most consecutive days in space by an American explorer. Vande Hei arrived at the space station on April 9, 2021, and is expected to return home on March 30, 2022, afte…", "url": "https://scitechdaily.com/nasa-astronaut-mark-vande-hei-breaks-american-spaceflight-record/", "urlToImage": "https://scitechdaily.com/images/Spacewalker-Mark-Vande-Hei-Works-on-Canadarm2-Robotic-Arm-scaled.jpg", "publishedAt": "2022-03-16T09:49:12Z", "content": "Aboard the International Space Station, NASA astronaut Mark Vande Hei squeezes in time to unwind with a book. Vande Hei made it into record books on Tuesday, March 15, 2022, breaking the record for t… [+5648 chars]"}, {"source": {"id": null, "name": "Nintendo Life"}, "author": "Liam Doolan", "title": "Capcom Unveils Monster Hunter Rise: Sunbreak Collector's Edition, Pre-Orders Open \"Soon\" (North America) - Nintendo Life", "description": "Available 30th June", "url": "https://www.nintendolife.com/news/2022/03/capcom-unveils-monster-hunter-rise-sunbreak-collectors-edition-pre-orders-open-soon-north-america", "urlToImage": "https://images.nintendolife.com/70dd2526ebc60/1280x720.jpg", "publishedAt": "2022-03-16T03:00:00Z", "content": "Following its Monster Hunter Rise: Sunbreak digital event yesterday, Capcom revealed a collector's edition would also be released on 30th June - with pre-orders opening \"soon\" in North America via Ga… [+761 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WPTV reporter survives colon cancer, encourages people to get colonoscopies - WPTV News - FL Palm Beaches and Treasure Coast", "description": "The CDC says colon cancer is the third most common cancer and the second most common cause of cancer-related death. The American Cancer Society adds that one...", "url": "https://www.youtube.com/watch?v=lKi15VD9la8", "urlToImage": "https://i.ytimg.com/vi/lKi15VD9la8/hqdefault.jpg", "publishedAt": "2022-03-15T23:23:15Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "Most people don't know these possible signs of early Alzheimer's - CNN", "description": "Most Americans aren't familiar with a type of cognitive loss that can be a precursor to Alzheimer's disease, a new survey found. Here's how to tell the difference between this kind of loss and normal aging, and why seeing a doctor early is important.", "url": "https://www.cnn.com/2022/03/15/health/alzheimers-mild-cognitive-impairment-survey-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220315150738-elderly-man-file-062519-super-tease.jpg", "publishedAt": "2022-03-15T21:21:00Z", "content": "(CNN)If you're not familiar with the term \"mild cognitive impairment,\" you're not the only one. More than 80% of Americans aren't familiar with this condition that affects up to 18% of people ages 60… [+4531 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lisa Steyn", "title": "'We'll defend ourselves', says Anglo as Zambian lead poisoning class action intensifies - News24", "description": "Further expert evidence has been filed with the Johannesburg High Court as communities poisoned by lead in the Kabwe district of Zambia seek to bring a class action against Anglo American.", "url": "https://www.news24.com/fin24/companies/mining/well-defend-ourselves-says-anglo-as-zambian-lead-poisoning-class-action-intensifies-20220315", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3756/f1dd49cc47814122acd604ab92975916.jpg", "publishedAt": "2022-03-15T13:19:41Z", "content": "<ul><li>Human rights lawyers have submitted further expert evidence to support their claims against Anglo American.</li><li>The diversified miner stands accused of causing lead poisoning in the Kabwe… [+7708 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Lee Khang Yi", "title": "A first for Malaysia: Bukit Jalil’s Eat and Cook honoured by Asia’s 50 Best Restaurants with the 2022 American Express One To Watch Award - Malay Mail", "description": "KUALA LUMPUR, March 15 — Restaurant Eat and Cook has been selected by the organisers of Asia’s 50 Best Restaurants to receive the much coveted American Express One To Watch Award. A first for a Malaysian restaurant, this award recognises Eat and Cook as a ris…", "url": "https://www.malaymail.com/news/malaysia/2022/03/15/a-first-for-malaysia-bukit-jalils-eat-and-cook-honoured-by-asias-50-best-re/2047590", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-03/eat_and_cook_20220315_3-seo.jpg", "publishedAt": "2022-03-15T10:06:45Z", "content": "Diners at Eat and Cook can experience omakase with local tongues in an island kitchen setting. Picture courtesy of Asias 50 Best Restaurants\r\nKUALA LUMPUR, March 15 Restaurant Eat and Cook has been s… [+3490 chars]"}]}