{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Heart attack risk increased among people with HIV and hepatitis C as they aged - Medical Xpress", "description": "As people with HIV age, their risk of heart attack increases far more if they also have untreated hepatitis C virus, even if their HIV is treated, according to new research published today in the Journal of the American Heart Association.", "url": "https://medicalxpress.com/news/2022-09-heart-people-hiv-hepatitis-aged.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2014/hepatitisc.png", "publishedAt": "2022-09-21T09:41:05Z", "content": "As people with HIV age, their risk of heart attack increases far more if they also have untreated hepatitis C virus, even if their HIV is treated, according to new research published today in the Jou… [+5229 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "McCarthy reaches for the GOP's brass ring: A unifying agenda - POLITICO", "description": "The House Republican leader is modeling his party blueprint on 1994's Contract With America and aiming for conservative buy-in that isn't a given.", "url": "https://www.politico.com/news/2022/09/21/mccarthy-brass-ring-unifying-agenda-00057886", "urlToImage": "https://static.politico.com/49/7c/a782269e4818a21a11bee73af1a4/https-delivery.gettyimages.com/downloads/1129405487", "publishedAt": "2022-09-21T08:30:00Z", "content": "From the first day I became leader, the whole job was: You got to unite before you can win. Unite the conference. And then, its much better to unite in the minority before you get there, so weve talk… [+6744 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes Auto", "title": "American, Russians to blast off for International Space Station as war rages in Ukraine - The Straits Times", "description": "Frank Rubio will be the first US astronaut to travel on Russian Soyuz rocket since the Ukraine war.\n Read more at straitstimes.com.", "url": "https://www.straitstimes.com/world/united-states/american-russians-to-blast-off-for-international-space-station-as-war-rages-in-ukraine", "urlToImage": "https://static1.straitstimes.com.sg/s3fs-public/styles/large30x20/public/articles/2022/09/21/AK_frr_210922.jpg?VersionId=s6IdkzB_B3f2IDB1UFCssHRnfFKvcKf7", "publishedAt": "2022-09-21T04:28:44Z", "content": "BAIKONUR, KAZAKHSTAN - A US astronaut and two Russian cosmonauts are set to blast off to the International Space Station (ISS) on Wednesday on a Russian-operated flight despite soaring tensions betwe… [+2376 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "© AFP 2022", "title": "American, Russians to blast off for ISS as war rages in Ukraine - Briefly ", "description": "A US astronaut and two Russian cosmonauts are set to blast off to the International Space Station Wednesday on a Russian-operated flight despite soaring tensions between Moscow and Washington over Russia's invasion of Ukraine.", "url": "https://briefly.co.za/world/139466-american-russians-blast-iss-war-rages-ukraine/", "urlToImage": "https://netstorage-briefly.akamaized.net/images/5e3eec67f0a6f38e.jpg", "publishedAt": "2022-09-21T04:10:20Z", "content": "NASA astronaut Frank Rubio (L), and Russian cosmonauts Sergey Prokopyev and Dmitri Petelin, are set to blast off to the International Space Station (ISS).\r\nPhoto: Dmitry LOVETSKY / POOL/AFPSource: AF… [+3575 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Malloy, Maegan Vazquez", "title": "White House says Biden was answering a hypothetical, not announcing a policy change on Taiwan - CNN", "description": "The White House is once again downplaying an assertion by President Joe Biden that American military personnel would defend Taiwan in the event of an invasion by the Chinese military, saying he was answering a hypothetical question that was not a reflection o…", "url": "https://www.cnn.com/2022/09/20/politics/biden-taiwan-60-minutes-response/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220213122425-jake-sullivan-0211.jpg?q=w_800,c_fill", "publishedAt": "2022-09-21T03:59:00Z", "content": "The White House is once again downplaying an assertion by President Joe Biden that American military personnel would defend Taiwan in the event of an invasion by the Chinese military, saying he was a… [+6710 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Judge ties Babe Ruth with 60th home run, Yankees stun Pirates with epic comeback - Sportsnet.ca", "description": "The New York Yankees completed a stunning five-run, ninth-inning rally to beat the Pittsburgh Pirates 9-8 while Aaron Judge moved within one of Roger Maris' American League record.", "url": "https://www.sportsnet.ca/mlb/article/yankees-aaron-judge-ties-babe-ruth-with-60th-home-run-of-season/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/09/New-York-Yankees-Aaron-Judge-1040x572.jpg", "publishedAt": "2022-09-21T02:35:00Z", "content": "NEW YORK (AP) Aaron Judge sent a sinker soaring into the left-field bleachers, another of his no-doubt drives, and circled the bases for the 60th time.\r\nModest throughout a march into history that no… [+4800 chars]"}, {"source": {"id": null, "name": "Olt.ubc.ca"}, "author": null, "title": "AI cell analytics app aims to supercharge biotechnology research - UBC Faculty of Medicine - UBC Faculty of Medicine", "description": "Ranked among the world’s top medical schools with the fifth-largest MD enrollment in North America, the UBC Faculty of Medicine is a leader in both the science and the practice of medicine. Across British Columbia, more than 12,000 faculty and staff are train…", "url": "https://med-fom-faculty.sites.olt.ubc.ca/news/ai-cell-analytics-app-aims-to-supercharge-biotechnology-research/", "urlToImage": "https://med-fom-faculty.sites.olt.ubc.ca/files/2022/09/Snapcyte-1200x600-1.png", "publishedAt": "2022-09-20T23:08:12Z", "content": "Transformative technology developed at the Vancouver Prostate Centre (VPC) is putting cell analytics into the hands of scientists around the globe. The technology an artificial intelligence (AI)-driv… [+3995 chars]"}, {"source": {"id": null, "name": "Evening Standard"}, "author": "Barney Davis", "title": "Brazil President Jair Bolsonaro uses Queen's funeral invite to voice shock at London fuel prices - Evening Standard", "description": "Controversial leader has been accused of ‘transforming the queen’s funeral into a rally’ as he seeks re-election in South America’s biggest country", "url": "https://www.standard.co.uk/news/uk/brazil-jair-bolsonaro-uses-queen-funeral-london-fuel-prices-b1026958.html", "urlToImage": "https://static.standard.co.uk/2022/09/20/18/newFile.jpg?width=1200&width=1200&auto=webp&quality=75", "publishedAt": "2022-09-20T18:07:57Z", "content": "Brazils President Jair Bolsonaro used his invite to the Queens funeral to visit a west London petrol station and baulk at petrol prices - twice that of many Brazilian states.\r\nBolsonaro, who is campa… [+2390 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "America's Sexually Transmitted Disease Problem Is 'Out of Control' - Gizmodo", "description": "At a conference this week, public health experts and health officials sounded an alarm over growing case numbers of syphilis, gonorrhea, and chlamydia.", "url": "https://gizmodo.com/sexually-transmitted-diseases-us-chlamydia-cdc-1849558467", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ff0c68bfd791491f56d2ec44cab2adc6.jpg", "publishedAt": "2022-09-20T17:20:00Z", "content": "Sexually transmitted diseases in the U.S. are at a crisis point. On Monday, prominent public health experts and government officials raised an alarm over the ongoing annual rise in STDs. Preliminary … [+3650 chars]"}]}