{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, Nikki Carvajal, Jeremy Diamond, Paul LeBlanc", "title": "Biden says gun violence has turned America's communities into 'killing fields' - CNN", "description": "President Joe Biden on Monday said gun violence has turned everyday places in America into \"killing fields\" as he marked the passage of the first significant federal gun safety legislation in 30 years.", "url": "https://www.cnn.com/2022/07/11/politics/biden-mass-shooting-survivors-gun-safety-legislation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220710202956-joe-biden-white-house-0708.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-12T01:56:00Z", "content": "President Joe Biden on Monday said gun violence has turned everyday places in America into killing fields as he marked the passage of the first significant federal gun safety legislation in 30 years.… [+4822 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Friends like to be reached out more often than we think: Study - ANI News", "description": "Washington [US], July 11 (ANI): According to research published by the American Psychological Association, people consistently underestimate how much others in their social circle might appreciate an unexpected phone call, text or email just to say hello, and…", "url": "https://www.aninews.in/news/lifestyle/relationships/friends-like-to-be-reached-out-more-often-than-we-think-study20220711235009", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Capasvgredfthbtfrghbrtfdvture2022071118080220220711182000.jpg", "publishedAt": "2022-07-11T18:20:00Z", "content": "Washington [US], July 11 (ANI): According to research published by the American Psychological Association, people consistently underestimate how much others in their social circle might appreciate an… [+3839 chars]"}, {"source": {"id": null, "name": "Leitrimobserver.ie"}, "author": "Reporter", "title": "Adding extra salt to food leads to higher risk of early death, UK-American study finds - Leitrim Live", "description": "People who add extra salt to their food at the table are at higher risk of dying early from any cause, according to a UK-American study. The research, involving more than 500,000 people, found that those who always add salt to their food have a 28% increased …", "url": "https://www.leitrimobserver.ie/news/national-news/857747/adding-extra-salt-to-food-leads-to-higher-risk-of-early-death-uk-american-study-finds.html", "urlToImage": "https://www.leitrimobserver.ie/resizer/1200/700/true/pa/2022_07_09/1657362302418_0.jpg--adding_extra_salt_to_food_leads_to_higher_risk_of_early_death__uk_american_study_finds.jpg?1657362303000", "publishedAt": "2022-07-11T09:45:00Z", "content": "People who add extra salt to their food at the table are at higher risk of dying early from any cause, according to a UK-American study.\r\nThe research, involving more than 500,000 people, found that … [+3506 chars]"}]}