{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Carl Campanile", "title": "Bronx, Brooklyn, Queens experienced dramatic population declines in 2022 as Manhattan rebounded - New York Post ", "description": "Three of Gotham’s five boroughs saw some of the largest population declines in America last fiscal year, with only Manhattan bucking the post-COVID trend, according to US Census data released…", "url": "https://nypost.com/2023/03/30/bronx-brooklyn-queens-lost-more-people-in-fiscal-2022/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/03/ny-population-decline.gif?w=1024", "publishedAt": "2023-03-30T21:20:00Z", "content": "New York City is becoming the shriveled Apple.\r\nThree of Gotham’s five boroughs saw some of the largest population declines in America last fiscal year, with only Manhattan bucking the post-COVID tre… [+7371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Urges Americans In Russia To Leave \"Immediately\" - NDTV", "description": "US State Department Secretary Antony Blinken on Thursday requested the Americans living in Russia to leave the country \"immediately\", after the reporter was arrested in Moscow.", "url": "https://www.ndtv.com/world-news/us-urges-americans-in-russia-to-leave-immediately-3907520", "urlToImage": "https://c.ndtvimg.com/2022-07/vtg5ccag_antony-blinken_625x300_09_July_22.jpg", "publishedAt": "2023-03-30T18:06:16Z", "content": "Antony Blinken requested the Americans living in Russia to leave the country. (File)\r\nWashington: US State Department Secretary Antony Blinken on Thursday requested the Americans living in Russia to … [+4028 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "PTI", "title": "Ajay Banga poised to become World Bank chief unopposed - Deccan Herald", "description": "Indian-American business leader Ajay Banga is poised to become the next President of the World Bank after the nomination period closed and no country proposed an alternate candidate for the prestigious post. In February, President Joe Biden announced that the…", "url": "https://www.deccanherald.com/business/business-news/ajay-banga-poised-to-become-world-bank-chief-unopposed-1205079.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2023/03/30/banga-reutersfile-1205079-1680188956.jpg", "publishedAt": "2023-03-30T15:09:16Z", "content": "Indian-American business leader Ajay Banga is poised to become the next President of the World Bank after the nomination period closed and no country proposed an alternate candidate for the prestigio… [+2787 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'The Silent Disease': Thousands may have kidney disease, but may not know it - KMBC 9", "description": "Doctors say in the more than 37,000 Americans are living with kidney disease and most don’t know it.Subscribe to KMBC on YouTube now for more: http://bit.ly/...", "url": "https://www.youtube.com/watch?v=v82SU1NSRTs", "urlToImage": "https://i.ytimg.com/vi/v82SU1NSRTs/maxresdefault.jpg", "publishedAt": "2023-03-30T00:59:52Z", "content": null}]}