{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Philippine Star"}, "author": "Chris Lefkow", "title": "Supreme Court says Americans have right to carry guns in public - Philstar.com", "description": "The US Supreme Court ruled Thursday that Americans have a fundamental right to carry a handgun in public, a landmark decision with far-reaching implications for states and cities across the country confronting a surge in gun violence.", "url": "https://www.philstar.com/world/2022/06/24/2190609/supreme-court-says-americans-have-right-carry-guns-public", "urlToImage": "https://media.philstar.com/photos/2022/06/24/afp-gays-against-guns_2022-06-24_07-49-16.jpg", "publishedAt": "2022-06-23T23:49:00Z", "content": "WASHINGTON, United States — The US Supreme Court ruled Thursday that Americans have a fundamental right to carry a handgun in public, a landmark decision with far-reaching implications for states and… [+4555 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "Coach dives into pool to rescue American swimmer Anita Alvarez at World Championships - CNN", "description": "American swimmer Anita Alvarez was rescued from the bottom of the pool by her coach at the FINA World Aquatic Championships in Budapest, Hungary, after she lost consciousness.", "url": "https://www.cnn.com/2022/06/23/sport/anita-alvarez-swimmer-coach-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220623103324-01-anita-alvarez-drowning-super-tease.jpg", "publishedAt": "2022-06-23T18:43:00Z", "content": "(CNN)American swimmer Anita Alvarez was rescued from the bottom of the pool by her coach at the FINA World Aquatic Championships in Budapest, Hungary, after she lost consciousness.\r\nCoach Andrea Fuen… [+3144 chars]"}, {"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Sagar Rangaraju", "title": "Hello Neighbor Diaries is the newest game in the popular IP, now available on Android - GamingonPhone", "description": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-ba", "url": "https://gamingonphone.com/news/hello-neighbor-diaries-popular-ip-available-on-android/", "urlToImage": "https://gamingonphone.com/wp-content/uploads/2022/06/helloneighbour_diaries_android.jpg", "publishedAt": "2022-06-23T17:00:44Z", "content": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-b… [+1936 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Cancer survivors grew to 18 million in the US; more than two-thirds aged 65 years or older - Science Daily", "description": "A new report shows more than 18 million Americans (8.3 million males and 9.7 million females) with a history of cancer were living in the United States as of January 1, 2022, with a little over 12 million (67%) aged 65 years or older. The study also found sub…", "url": "https://www.sciencedaily.com/releases/2022/06/220623103751.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-23T16:07:43Z", "content": "A new report led by researchers at the American Cancer Society (ACS) in collaboration with the National Cancer Institute (NCI) shows more than 18 million Americans (8.3 million males and 9.7 million … [+3213 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BusinessMirror", "title": "A truly safe place - BusinessMirror", "description": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware. Unconnected events? Laylo represents a billion-dollar sector that’s keeping Ame…", "url": "https://businessmirror.com.ph/2022/06/24/a-truly-safe-place/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/10/Column-box-Editorial.jpg", "publishedAt": "2022-06-23T16:01:00Z", "content": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware.\r\nUnconnected events… [+4105 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mike Stobbe", "title": "CDC panel recommends US seniors get souped-up flu vaccines - The Associated Press", "description": "NEW YORK (AP) — Americans 65 and older should get newer, souped-up flu vaccines because regular shots don't provide them enough protection, a federal advisory panel said Wednesday. The panel unanimously recommended certain flu vaccines that might offer more o…", "url": "https://apnews.com/article/science-health-flu-centers-for-disease-control-and-prevention-0e908c9586ecaa1846fd1c2ec2be1e7d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/d2772a3c402142e3999b35dbdf6e5540/3000.jpeg", "publishedAt": "2022-06-22T20:40:55Z", "content": "NEW YORK (AP) Americans 65 and older should get newer, souped-up flu vaccines because regular shots dont provide them enough protection, a federal advisory panel said Wednesday.\r\nThe panel unanimousl… [+2161 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "Scientists observe longitudinal plasmonic field in nanocavity at subnano-scale - Phys.org", "description": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research published in the Journal of the American Chemical Society.", "url": "https://phys.org/news/2022-06-scientists-longitudinal-plasmonic-field-nanocavity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/scientists-observe-lon.jpg", "publishedAt": "2022-06-22T17:38:48Z", "content": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research publi… [+2636 chars]"}]}