{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Meghan Markle, Prince Harry demand rises with American networks for Oprah 2.0 - The News International", "description": "Meghan Markle and Prince Harry are reportedly being extended interview offers left and right.The Duke and Duchess of Sussex, who recently returned from UK after celebrating the Queen's Platinum...", "url": "https://www.thenews.com.pk/latest/968785-meghan-markle-prince-harry-demand-increases-in-american-networks-for-oprah-20", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2022-06-24/968785_011006_updates.jpg", "publishedAt": "2022-06-24T08:02:00Z", "content": "Meghan Markle and Prince Harry are reportedly being extended interview offers left and right.\r\nThe Duke and Duchess of Sussex, who recently returned from UK after celebrating the Queen's Platinum Jub… [+1020 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "Tammy Sewell", "title": "No lunar base before 2034 - OI Canadian", "description": "This is what internal documents from the American space agency revealed on Monday by the magazine Ars-Technica. They contain a schedule of launches to the Moon, at a rate that would not even reach the", "url": "https://oicanadian.com/no-lunar-base-before-2034/", "urlToImage": "https://www.pieuvre.ca/wp-content/uploads/2022/06/SLSFusee-e1655941216480.jpg", "publishedAt": "2022-06-24T06:21:31Z", "content": "This is what internal documents from the American space agency revealed on Monday by the magazine Ars-Technica. They contain a schedule of launches to the Moon, at a rate that would not even reach th… [+2556 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "US Senate passes gun safety bill as Supreme Court loosens handgun limits - ABC News", "description": "The US Senate passes the first significant gun control legislation in three decades as the Supreme Court rules Americans have a constitutional right to carry handguns in public for self-defence.", "url": "https://www.abc.net.au/news/2022-06-24/us-senate-passes-gun-safety-bill-supreme-court-loosens-limits/101181200", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/41e0c167ca249b75ce4a1ee81b0f85a0?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=234&width=862&height=485", "publishedAt": "2022-06-24T04:33:31Z", "content": "A bipartisan package of modest gun safety measures passed the US Senate late on Thursday, even as the country's Supreme Court broadly expanded gun rights by ruling Americans have a constitutional rig… [+5882 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers continue a national study to evaluate COVID-19 vaccination safety pre-and post-delivery - News-Medical.Net", "description": "With the SARS-CoV-2 pandemic ongoing, researchers at University of California San Diego School of Medicine, in collaboration with the American Academy of Allergy Asthma and Immunology, will continue a national study to evaluate the safety of COVID-19 vaccinat…", "url": "https://www.news-medical.net/news/20220623/Researchers-continue-a-national-study-to-evaluate-COVID-19-vaccination-safety-pre-and-post-delivery.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2022-06-24T00:34:00Z", "content": "With the SARS-CoV-2 pandemic ongoing, researchers at University of California San Diego School of Medicine, in collaboration with the American Academy of Allergy Asthma and Immunology (AAAAI), will c… [+3174 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Jessica Gresko", "title": "U.S. Supreme Court expands gun rights, with nation divided - CP24 Toronto's Breaking News", "description": "In a major expansion of gun rights after a series of mass shootings, the Supreme Court said Thursday that Americans have a right to carry firearms in public for self-defense, a ruling likely to lead to more people legally armed. The decision came out as Congr…", "url": "https://www.cp24.com/world/u-s-supreme-court-expands-gun-rights-with-nation-divided-1.5960583", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5960588.1656019898!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-06-23T21:32:15Z", "content": "WASHINGTON (AP) - In a major expansion of gun rights after a series of mass shootings, the Supreme Court said Thursday that Americans have a right to carry firearms in public for self-defense, a ruli… [+7040 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Americans Have Right To Carry Guns In Public: US Supreme Court - NDTV", "description": "The US Supreme Court ruled on Thursday that Americans have a fundamental right to carry a handgun in public, a landmark decision with far-reaching implications for states and cities across the country struggling with a surge in gun violence.", "url": "https://www.ndtv.com/world-news/us-supreme-court-says-americans-have-right-to-carry-guns-in-public-3094730", "urlToImage": "https://c.ndtvimg.com/us-supreme-court-reuters_625x300_1530162163588.jpg", "publishedAt": "2022-06-23T18:20:00Z", "content": "The ruling is the first by the court in a major Second Amendment case in over a decade.\r\nWashington, United States: The US Supreme Court ruled on Thursday that Americans have a fundamental right to c… [+4991 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "BusinessMirror", "title": "A truly safe place - BusinessMirror", "description": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware. Unconnected events? Laylo represents a billion-dollar sector that’s keeping Ame…", "url": "https://businessmirror.com.ph/2022/06/24/a-truly-safe-place/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2020/10/Column-box-Editorial.jpg", "publishedAt": "2022-06-23T16:01:00Z", "content": "ON the day that John Albert Laylo, a promising lawyer, died a senseless death in America, President Joe Biden fell off his bicycle at his Rehoboth Beach vacation home in Delaware.\r\nUnconnected events… [+4105 chars]"}]}