{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood, Jennifer Hansler and Nicole Gaouette", "title": "First flight of Afghans who risked lives to help American troops arrive in US - CNN", "description": "The first group of translators and interpreters who helped US soldiers and diplomats in Afghanistan arrived in the US on Friday, even as thousands more wait in Afghanistan in increasing fear of Taliban reprisals.", "url": "https://www.cnn.com/2021/07/30/politics/afghan-siv-arrival/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210726190550-afghan-visa-effort-210625-super-169.jpg", "publishedAt": "2021-07-30T09:04:00Z", "content": "The first group of translators and interpreters who helped US soldiers and diplomats in Afghanistan arrived in the US on Friday, even as thousands more wait in Afghanistan in increasing fear of Talib… [+6714 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Samuel Chamberlain", "title": "Ex-Trump official: 'Matter of time' before unvaccinated contract Delta variant - New York Post ", "description": "Americans who have not been vaccinated against the coronavirus will contract the Delta variant of COVID-19 sooner or later, says former Health and Human Services Assistant Secretary Brett Giroir sa…", "url": "https://nypost.com/2021/07/30/ex-trump-official-brett-giroir-says-delta-variant-spread-imminent-among-unvaccinated/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/07/AP20260640130179-1.jpg?quality=90&strip=all&w=1200", "publishedAt": "2021-07-30T05:59:00Z", "content": "Americans who have not been vaccinated against the coronavirus will contract the Delta variant of COVID-19 sooner or later, former Health and Human Services (HHS) Assistant Secretary Brett Giroir sai… [+3573 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "ETX Daily Up", "title": "The Galileo Project: Searching for the technological clues left by extraterrestrial life - Yahoo Singapore News", "description": "The Galileo Project aims to determine if extraterrestrials exist and if they sometimes visit us. To answer these questions, a team of American researchers...", "url": "https://sg.style.yahoo.com/galileo-project-searching-technological-clues-115856548.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/t7z838r3d4XJNje5DTWviA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMTI1/https://s.yimg.com/uu/api/res/1.2/kdUabovJLoJkTKsJpsIZJQ--~B/aD0xOTI0O3c9MzQyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/afprelaxnews.com/8dc4c9fa652635efdf12814830d911c7", "publishedAt": "2021-07-29T11:58:56Z", "content": "The Galileo Project aims to determine if extraterrestrials exist and if they sometimes visit us. To answer these questions, a team of American researchers will study, with the help of high-resolution… [+2012 chars]"}]}