{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Biden: US will protect Haiti embassy, won't send troops - Associated Press", "description": "WASHINGTON (AP) — President Joe Biden said Thursday that the U.S. will bolster security at its embassy in Haiti following last week's assassination of that country's president, but sending American troops to stabilize the country was “not on the agenda.”", "url": "https://apnews.com/article/joe-biden-government-and-politics-haiti-42975e871627d635ae3e6d7fdac83f1a", "urlToImage": "https://storage.googleapis.com/afs-prod/media/82bd7c2284964127a965775c77707c32/3000.jpeg", "publishedAt": "2021-07-15T23:51:27Z", "content": "WASHINGTON (AP) President Joe Biden said Thursday that the U.S. will bolster security at its embassy in Haiti following last weeks assassination of that countrys president, but sending American troop… [+1783 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Leslie Josephs", "title": "American Airlines cancels flight attendants' voluntary leaves, plans to hire 800 to meet travel demand - CNBC", "description": "American will call flight attendants back from voluntary leave by the end of the year and plans to hire 800 flight attendants to support demand.", "url": "https://www.cnbc.com/2021/07/15/american-airlines-calls-flight-attendants-back-to-work-will-hire-to-meet-demand.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106590593-1593015799413gettyimages-671191812.jpeg?v=1626383617", "publishedAt": "2021-07-15T21:25:40Z", "content": "American Airlines has told the remaining 3,300 flight attendants on voluntary leave to come back by November or December and that it will start recruiting new cabin crew members, according to a note … [+1712 chars]"}, {"source": {"id": null, "name": "Tech Xplore"}, "author": "Eleonore Fournier-Tombs", "title": "Users must now choose between male and female voice options for Siri - Tech Xplore", "description": "As of March 31, 2021, when Apple released the iOS 14.5 beta update to its operating system, Siri no longer defaults to a female voice when using American English. Users must now choose between two male and two female voices when enabling the voice assistant. …", "url": "https://techxplore.com/news/2021-07-users-male-female-voice-options.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/siri.jpg", "publishedAt": "2021-07-15T13:43:52Z", "content": "As of March 31, 2021, when Apple released the iOS 14.5 beta update to its operating system, Siri no longer defaults to a female voice when using American English. Users must now choose between two ma… [+5873 chars]"}]}