{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "Oliveria KOs Chandler to claim UFC lightweight crown - INQUIRER.net", "description": "Brazilian Charles Oliveira mounted a superb comeback to score a second-round knockout victory over American Michael Chandler to win the UFC lightweight title in the main event of UFC 262 in", "url": "https://www.inquirer.net", "urlToImage": "https://sports.inquirer.net/files/2021/05/charles-oliveira-ufc.jpg", "publishedAt": "2021-05-16T09:35:00Z", "content": "Charles Oliveira of Brazil has the belt placed on him by Dana White after defeating Michael Chandler during their Championship Lightweight Bout at the UFC 262 event at Toyota Center on May 15, 2021 i… [+1860 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Gunning for the BMW GS: Harley-Davidson launches Pan America, and its headed for SA - News24", "description": "The BMW GS rules the roost in the big adventure bike market in South Africa and globally, but Harley-Davidson looks to address the issue with its Pan America.", "url": "https://www.news24.com/wheels/bikesquads/gunning-for-the-bmw-gs-harley-davidson-launches-pan-america-and-its-headed-for-sa-20210516-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11164/8950e1fce5da4c118b78aebc2fcbca26.jpg", "publishedAt": "2021-05-16T08:32:59Z", "content": "• Harley-Davidson are entering the go anywhere adventure market with the Pan American.\r\n• Competitive pricing and all the right technology could see it build a following in the adventure bike segment… [+5579 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Thousands rally in North America in solidarity with Palestinians - News24", "description": "Thousands of pro-Palestinian demonstrators rallied in cities across North America on Saturday, calling for an end to Israeli attacks on the Gaza Strip as the worst violence in years flared between the Jewish state and Islamist militants.", "url": "https://www.news24.com/news24/world/news/thousands-rally-in-north-america-in-solidarity-with-palestinians-20210516", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3753/185509e4072f41259ba7c72e1f239eb6.jpg", "publishedAt": "2021-05-16T08:15:44Z", "content": "<ul><li>Pro-Palestinian demonstrators rallied in cities across North America on Saturday, calling for an end to Israeli attacks on the Gaza Strip.</li><li>Activists showing solidarity with Palestinia… [+3845 chars]"}, {"source": {"id": null, "name": "Irish Mirror"}, "author": "Sam Roberts", "title": "Meghan Markle's surprising Ireland links as Duchess of Sussex's hidden past emerges - Irish Mirror", "description": "The American actress was born and raised in Los Angeles, but has links to the Emerald Isle", "url": "https://www.irishmirror.ie/news/irish-news/meghan-markles-surprising-ireland-links-24110289", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article12893511.ece/ALTERNATES/s1200/Royal-visit-to-Dublin-Day-Two.jpg", "publishedAt": "2021-05-16T06:55:06Z", "content": "Meghan Markle's surprising Irish roots include a Dublin wedding and Belfast catholic great-great-great grandparent.\r\nThe American actress was born and raised in Los Angeles, and shot to international… [+2379 chars]"}]}