{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Bipartisan bill banning Russian oil sets up clash with White House - POLITICO", "description": "The White House said it does not “have a strategic interest in reducing the global supply of energy, and that would raise prices at the gas pump for the American people.”", "url": "https://www.politico.com/news/2022/03/03/bill-ban-russia-oil-white-house-00013962", "urlToImage": "https://static.politico.com/55/09/ea6bccb54bfd8a48ec96936c2ebd/https-delivery.gettyimages.com/downloads/1378129836", "publishedAt": "2022-03-03T22:07:55Z", "content": "Manchin knocked the White House for opposing the halt on imports of Russian oil based on fears it would further raise pump prices. Crude oil prices touched their highest level since 2008 early on Thu… [+3035 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Study finds drinking wine with meals was associated with lower risk of type 2 diabetes - Medical Xpress", "description": "An analysis of health data for nearly 312,400 current drinkers suggests consuming alcohol, most notably wine, with meals is associated with a lower risk of developing type 2 diabetes, according to preliminary research to be presented at the American Heart Ass…", "url": "https://medicalxpress.com/news/2022-03-wine-meals-diabetes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/red-wine.jpg", "publishedAt": "2022-03-03T21:18:21Z", "content": "An analysis of health data for nearly 312,400 current drinkers suggests consuming alcohol, most notably wine, with meals is associated with a lower risk of developing type 2 diabetes, according to pr… [+6121 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Joe Davies", "title": "Study finds drinking with meals cuts risk of type 2 diabetes - Daily Mail", "description": "The American study followed more than 300,000 people over 10 years. Previous research has suggested that polyphenols - a compound in the skin of grapes - can reduce blood sugar levels.", "url": "https://www.dailymail.co.uk/health/article-10573815/Study-finds-drinking-meals-cuts-risk-type-2-diabetes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/03/16/54913247-0-image-a-33_1646326038799.jpg", "publishedAt": "2022-03-03T20:00:49Z", "content": "You shouldn't feel guilty for having a glass of wine every night so long as you drink it with dinner, like the French.\r\nA study has found enjoying a glass with your meal, rather than on its own, coul… [+6133 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Jacqui Goddard, Miami", "title": "Artemis: Nasa's return to moon to cost an 'unsustainable' $4.1bn per mission - The Times", "description": "America’s return to the moon will cost more than $4.1 billion per mission, making it unsustainable in the long term, the space agency’s inspector-general has wa", "url": "https://www.thetimes.co.uk/article/artemis-nasas-return-to-moon-to-cost-an-unsustainable-4-1bn-per-mission-jtlcqsxt9", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fbaf3690a-9a37-11ec-8194-a993851c15ba.jpg?crop=4021%2C2262%2C0%2C209&resize=1200", "publishedAt": "2022-03-03T00:01:00Z", "content": "Americas return to the moon will cost more than $4.1 billion per mission, making it unsustainable in the long term, the space agencys inspector-general has warned.\r\nThe total cost of Nasas lunar prog… [+539 chars]"}]}