{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "'A battle for the soul of America': Biden says U.S. democracy under threat on Capitol riot anniversary - CBC News", "description": "President Joe Biden on Thursday accused his predecessor, Donald Trump, of posing a continuing threat to American democracy in a speech on the anniversary of the deadly U.S. Capitol attack by Trump supporters who tried to prevent his 2020 election defeat.", "url": "https://www.cbc.ca/news/world/biden-capitol-attack-speech-1.6305787", "urlToImage": "https://i.cbc.ca/1.6305925.1641482285!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/capitol-riot-anniversary-biden.jpg", "publishedAt": "2022-01-06T16:06:17Z", "content": "U.S. President Joe Biden on Thursday accused his predecessor, Donald Trump, of posing a continuing threat to American democracy in a speech on the anniversary of the deadly U.S. Capitol attack.\r\nSpea… [+4852 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chidanand Rajghatta", "title": "In alarming speech, Biden warns Trump and his supporters are holding a dagger to the throat of America and democracy - Times of India", "description": "US News: The United States remembered Jan 6, 2021 insurrection on its first anniversary with dire warnings from many quarters about the future of the country a", "url": "https://timesofindia.indiatimes.com/world/us/in-alarming-speech-biden-warns-trump-and-his-supporters-are-holding-a-dagger-to-the-throat-of-america-and-democracy/articleshow/88739928.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88739932,width-1070,height-580,imgsize-810291,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-01-06T15:57:00Z", "content": "In alarming speech, Biden warns Trump and his supporters are holding a dagger to the throat of America and democracy\r\n<ul><li>News</li>\r\n<li>World News</li>\r\n<li>US News</li>\r\n<li>In alarming speech,… [+106 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, Clare Foran and Kate Sullivan, CNN", "title": "Biden condemns Trump as a threat to democracy in speech marking one year since January 6 attack - CNN", "description": "President Joe Biden on Thursday marked the first anniversary of the January 6 insurrection by forcefully calling out former President Donald Trump for attempting to undo American democracy, saying such an insurrection must never happen again.", "url": "https://www.cnn.com/2022/01/06/politics/january-6-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220106092029-02-biden-jan-6-speech-super-tease.jpg", "publishedAt": "2022-01-06T15:43:00Z", "content": "(CNN)President Joe Biden on Thursday marked the first anniversary of the January 6 insurrection by forcefully calling out former President Donald Trump for attempting to undo American democracy, sayi… [+9003 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Jane Moore", "title": "'We are in a battle for the soul of America': Joe Biden marks one year since US Capitol riots - TheJournal.ie", "description": "A series of remembrance events are due to take place to mark the event.", "url": "https://www.thejournal.ie/joe-biden-speech-capitol-riots-6-january-5647497-Jan2022/", "urlToImage": "https://img2.thejournal.ie/article/5647497/river/?height=400&version=5647566", "publishedAt": "2022-01-06T14:45:00Z", "content": "PRESIDENT JOE BIDEN has marked the anniversary of the 6 January storming of the US Capitol by Donald Trumps supporters with a dark plea for Americans to defend democracy from a future of violence and… [+6464 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Sabrina Siddiqui", "title": "Biden, in Shift, Prepares Americans to See Covid-19 as Part of Life - The Wall Street Journal", "description": "Before Omicron surge, president said in July the nation was ‘closer than ever to declaring our independence from a deadly virus’", "url": "https://www.wsj.com/articles/biden-in-shift-prepares-americans-to-see-covid-19-as-part-of-life-11641465004", "urlToImage": "https://images.wsj.net/im-462359/social", "publishedAt": "2022-01-06T10:30:00Z", "content": "WASHINGTONAs Covid-19 cases climb across the U.S., President Biden and his administration are preparing Americans to accept the virus as a part of daily life, in a break from a year ago when he took … [+7579 chars]"}]}