{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Saving Ottawa River's endangered eels a slippery subject for conservationists - CBC.ca", "description": "Getting people to sympathize with the slimy, slithering fish can be an upstream battle, but the Ottawa Riverkeeper believes we just need to get to know the American eel.", "url": "https://www.cbc.ca/news/canada/ottawa/how-to-get-people-to-care-about-eels-1.6139156", "urlToImage": "https://i.cbc.ca/1.4082490.1526921177!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/american-eel.JPG", "publishedAt": "2021-08-15T08:00:00Z", "content": "When you think of campaigns to help save endangered species, you might imagine cute baby seals or cuddly pandas pulling on your heart strings.\r\nBut what happens when the animal in question is a slimy… [+2872 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Post Editorial Board", "title": "Inflation keeps growing, but Dems won't stop spending - New York Post ", "description": "President Joe Biden and Democrats keep telling Americans not to worry about inflation, that it’s only temporary. Yet the record price hikes keep getting worse.", "url": "https://nypost.com/2021/08/14/inflation-keeps-growing-but-dems-wont-stop-spending/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/08/dems-inflations-pending.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-08-15T00:11:00Z", "content": "President Joe Biden and Democrats keep telling Americans not to worry about inflation, that its only temporary. Yet the record price hikes keep getting worse.\r\nOn Thursday, the Bureau of Labor Statis… [+2193 chars]"}, {"source": {"id": null, "name": "Thechestnutpost.com"}, "author": null, "title": "Here’s who the CDC says should get booster COVID-19 shots - The Chestnut Post", "description": "Americans at high risk from COVID-19 because of severely weakened immune systems are now allowed to get a third vaccination in hopes of better protection. The Food and Drug Administration Continue Reading", "url": "https://www.thechestnutpost.com/news/heres-who-the-cdc-says-should-get-booster-covid-19-shots/", "urlToImage": null, "publishedAt": "2021-08-13T21:42:42Z", "content": "Americans at high risk from COVID-19 because of severely weakened immune systems are now allowed to get a third vaccination in hopes of better protection. The Food and Drug Administration has ruled t… [+360 chars]"}]}