{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Chris Megerian", "title": "Challenge for Biden to rally Americas around a shared vision - The Associated Press - en Español", "description": "LOS ANGELES (AP) — President Joe Biden tried to present a unifying vision for the Western Hemisphere on Thursday even as the Summit of the Americas has been wracked by divisions and absences that make it hard to bring North and South America together around s…", "url": "https://apnews.com/article/russia-ukraine-biden-government-and-politics-business-6c477ae1abaab57acf9f1f211b429f6a", "urlToImage": "https://storage.googleapis.com/afs-prod/media/284d7eda9e724f9f964c9ba3992c196e/3000.jpeg", "publishedAt": "2022-06-09T19:18:45Z", "content": "LOS ANGELES (AP) President Joe Biden tried to present a unifying vision for the Western Hemisphere on Thursday even as the Summit of the Americas has been wracked by divisions and absences that make … [+5680 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Trudeau to meet with Biden, Google chief on Day 2 of Summit of the Americas - CTV News", "description": "It's an itinerary worthy of Hollywood: the governor of California, the man who runs Google and the president of the United States. Day 2 at the Summit of the Americas is shaping up to be a busy one for Prime Minister Justin Trudeau.", "url": "https://www.ctvnews.ca/canada/trudeau-to-meet-with-biden-google-chief-on-day-2-of-summit-of-the-americas-1.5939445", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/6/9/trudeau--biden-1-5939446-1654764468374.jpg", "publishedAt": "2022-06-09T08:49:18Z", "content": "LOS ANGELES - \r\nIt's an itinerary worthy of Hollywood: the governor of California, the man who runs Google and the president of the United States.\r\nDay 2 at the Summit of the Americas is shaping up t… [+5165 chars]"}, {"source": {"id": null, "name": "Sky News Australia"}, "author": "David Wu", "title": "US actor breaks down after witnessing car plough through Berlin crowds - Sky News Australia", "description": "<p>An American actor has spoken out about the horrific moment a car ploughed through a crowd of people, including schoolchildren, on a busy street in Germany.</p>", "url": "https://www.skynews.com.au/world-news/actor-john-barrowman-reduced-to-tears-after-car-crashed-through-crowds-in-berlin-killing-one-and-injuring-14-students/news-story/7e0e5a5498d32f016f8247774ba4911c", "urlToImage": "https://content.api.news/v3/images/bin/df54b93fcd7c643382abaf63731e3b19", "publishedAt": "2022-06-08T21:50:10Z", "content": "An American actor has told of the moment he witnessed a car mount onto the footpath on a busy shopping strip in Berlin before it ploughed into crowds of people, killing at least one person and injuri… [+3042 chars]"}]}