{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cbs-news", "name": "CBS News"}, "author": null, "title": "U.S. revokes visa for president of Colombia after he urges American soldiers to disobey Trump - CBS News", "description": "The State Department announced it was revoking a visa for Colombia President Gustavo Petro after he participated in a New York protest where he called on American soldiers to disobey President Trump's orders.", "url": "https://www.cbsnews.com/news/u-s-revokes-visa-for-president-of-colombia-gustavo-petro/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/09/27/62f81a36-dca1-4674-b8c3-07fafded3735/thumbnail/1200x630/bfee41c78f308d76967a5c48f5be2d61/ap25266820328000.jpg", "publishedAt": "2025-09-27T16:09:00Z", "content": "Tensions between the United States and Colombia have escalated with the State Department announcing it was revoking a visa for Gustavo Petro, president of the Latin American country, after he partici… [+2847 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mark Sherman, Lindsay Whitehurst", "title": "Trump asks Supreme Court to uphold restrictions he wants to impose on birthright citizenship - AP News", "description": "President Donald Trump’s administration is asking the Supreme Court to uphold his birthright citizenship order declaring that children born to parents who are in the United States illegally or temporarily aren't American citizens. The appeal was provided to T…", "url": "https://apnews.com/article/trump-supreme-court-birthright-citizenship-6d282d34b7aa1e992390499504ad5c7d", "urlToImage": "https://dims.apnews.com/dims4/default/b29597a/2147483647/strip/true/crop/5472x3078+0+285/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa2%2F70%2F4bc1828695be95fb94ca6e8016ca%2Feabacca6e8d34e9e8c9bd5dc81bc3368", "publishedAt": "2025-09-27T13:10:00Z", "content": "WASHINGTON (AP) President Donald Trump s administration is asking the Supreme Court to uphold his birthright citizenship order declaring that children born to parents who are in the United States ill… [+3538 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Katherine Tangalakis-Lippert, Alex Bitter", "title": "Starbucks is closing over 100 North American stores — here are the locations we know so far - Business Insider", "description": "Starbucks on Thursday said it would close 1% of its North American stores, but didn't announce which ones. Business Insider has compiled a list.", "url": "https://www.businessinsider.com/list-of-closing-starbucks-locations-2025-9", "urlToImage": "https://i.insider.com/68d72468cc993f9955cf0e6f?width=1200&format=jpeg", "publishedAt": "2025-09-27T11:24:00Z", "content": "When Starbucks announced on Thursday that it would shutter more than 100 coffeehouse locations across North America, the company didn't publicly specify which stores would close.\r\nSo, Business Inside… [+3063 chars]"}]}