{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Kristen Holmes", "title": "A ‘bizarro world’: How Trump’s words have scrambled America’s gun politics - CNN", "description": "In the wake of a horrific shooting that shocked the nation, President Donald Trump starkly broke with pro-gun groups in off-the-cuff remarks: “Take the guns first, go through due process second,” Trump said during a televised meeting with lawmakers.", "url": "https://www.cnn.com/2026/02/01/politics/gun-politics-trump-second-amendment", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap22148014227135a.JPG?c=16x9&q=w_800,c_fill", "publishedAt": "2026-02-01T11:00:46Z", "content": "In the wake of a horrific shooting that shocked the nation, President Donald Trump starkly broke with pro-gun groups in off-the-cuff remarks: Take the guns first, go through due process second, Trump… [+10362 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Lara Seligman, Shelby Holliday, Michael R. Gordon", "title": "Before Any Strike on Iran, U.S. Needs to Bolster Air Defenses in Mideast - The Wall Street Journal", "description": "The Pentagon is taking steps to better protect Israel, Arab allies and American forces if Iran retaliates", "url": "https://www.wsj.com/world/middle-east/before-any-strike-on-iran-u-s-needs-to-bolster-air-defenses-in-mideast-faca35a9", "urlToImage": "https://images.wsj.net/im-20113009/social", "publishedAt": "2026-02-01T10:30:00Z", "content": "President Trumps promised armada \r\nhas arrived in the Middle East, headed by the USS Abraham Lincoln aircraft carrier battle group, and sophisticated F-35 jets have moved closer to the region. Trump … [+1189 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Evelyn Cheng, Matthew Chin", "title": "How Chinese short-video streaming firms are reshaping Latin America's media landscape - CNBC", "description": "Short-drama apps, many with Chinese origins, are making significant inroads in Latin America as the region becomes more affluent, research shows.", "url": "https://www.cnbc.com/2026/02/01/how-chinas-short-video-streamers-are-reshaping-latin-americas-media.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/108174520-1753106622252-Micro_Dramas_Thumbs_no_text.png?v=1769939462&w=1920&h=1080", "publishedAt": "2026-02-01T09:52:14Z", "content": "Latin America's media landscape is being reshaped by a new suite of entertainment producers, as short drama platforms, often with business ties to China, command an increasingly large share of the re… [+5529 chars]"}]}