{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "NASA breaks record after Hubble discovers farthest individual star ever- Watch - Zee News", "description": "The American space agency, NASA (National Aeronautic Space Agency) with the help of its Hubble telescope has detected the farthest individual star till date, breaking its own previous record.", "url": "https://zeenews.india.com/viral/nasa-breaks-record-after-hubble-discovers-farthest-individual-star-ever-watch-2450098.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/04/02/1027763-nasa-hubble-telescope-earendel-discovery.jpg", "publishedAt": "2022-04-02T11:02:47Z", "content": "New Delhi: The American space agency, NASA (National Aeronautic Space Agency) with the help of its Hubble telescope has detected the farthest individual star till date, breaking its own previous reco… [+1781 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Astronaut to Discuss American Space Record in News Conference - NASA", "description": "NASA astronaut Mark Vande Hei, back on Earth after breaking the record for the longest single spaceflight in history by an American, will participate in a virtual news conference at 10 a.m. EDT Tuesday, April 5, from the agency’s Johnson Space Center in Houst…", "url": "https://www.nasa.gov/press-release/nasa-astronaut-to-discuss-american-space-record-in-news-conference/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/iss065e335291_0.jpg", "publishedAt": "2022-04-01T16:23:29Z", "content": null}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "US added 431000 jobs in March in sign of economic health - Business News - Castanet.net", "description": "America’s employers extended a streak of robust hiring in March, adding 431,000 jobs in a sign of the economy’s resilience in the face of a still-destructive pandemic and the highest inflation in 40 years.", "url": "https://www.castanet.net/news/Business/364700/US-added-431-000-jobs-in-March-in-sign-of-economic-health", "urlToImage": "https://www.castanet.net/content/2022/4/20220329100352-62431d3b0ef01d788fab2a57jpeg_p3585308.jpg", "publishedAt": "2022-04-01T13:41:00Z", "content": "America’s employers extended a streak of robust hiring in March, adding 431,000 jobs in a sign of the economy’s resilience in the face of a still-destructive pandemic and the highest inflation in 40 … [+3910 chars]"}]}