{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "First study in North America uses genetic testing to identify people at risk of heart disease - News-Medical.Net", "description": "Dignity Health in Arizona is launching the first research study in North America in which genetic testing is used to identify men and women at risk of developing heart disease based on the makeup of their DNA.", "url": "https://www.news-medical.net/news/20220221/First-study-in-North-America-uses-genetic-testing-to-identify-people-at-risk-of-heart-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Heart_Disease-620x480.jpg", "publishedAt": "2022-02-21T05:35:00Z", "content": "Dignity Health in Arizona is launching the first research study in North America in which genetic testing is used to identify men and women at risk of developing heart disease based on the makeup of … [+3147 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "US embassy tells Americans: Have an evacuation plan from Russia - News24", "description": "The US embassy in Russia cautioned Americans on Sunday to have evacuation plans, citing the threat of attacks in Moscow and along the Russian border with Ukraine, drawing a rebuke from Russian foreign ministry.", "url": "https://www.news24.com/news24/world/news/us-embassy-tells-americans-have-an-evacuation-plan-from-russia-20220220", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2554/ebc4e73196c54aa08d05d8520dff95c6.jpg", "publishedAt": "2022-02-20T20:23:04Z", "content": "The US embassy in Russia cautioned Americans on Sunday to have evacuation plans, citing the threat of attacks in Moscow and along the Russian border with Ukraine, drawing a rebuke from Russian foreig… [+644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris", "title": "'We're doing everything we can to survive': As the US looks to move on from Covid-19, high-risk and disabled Americans feel forgotten - CNN", "description": "Tasha Nelson's 10-year-old son held back tears when he heard the news. The two were in the car when the announcement came through the radio: Virginia's freshly sworn-in governor had signed an order attempting to ban mask mandates in schools.", "url": "https://www.cnn.com/2022/02/20/us/immunocompromised-high-risk-americans-covid-measures-forgotten/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220219150641-immunocompromised-covid-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-20T17:24:00Z", "content": "Tasha Nelsons 10-year-old son held back tears when he heard the news. The two were in the car when the announcement came through the radio: Virginias freshly sworn-in governor had signed an order att… [+10741 chars]"}]}