{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Statement from President Joe Biden on Passage of the Bipartisan Bill to Keep the Government Open - The White House", "description": "Tonight, bipartisan majorities in the House and Senate voted to keep the government open, preventing an unnecessary crisis that would have inflicted needless pain on millions of hardworking Americans. This bill ensures that active-duty troops will continue to…", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/09/30/statement-from-president-joe-biden-on-passage-of-the-bipartisan-bill-to-keep-the-government-open/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2023-10-01T01:13:25Z", "content": "Tonight, bipartisan majorities in the House and Senate voted to keep the government open, preventing an unnecessary crisis that would have inflicted needless pain on millions of hardworking Americans… [+1073 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "What to know about prostate cancer screening and treatment - PBS NewsHour", "description": "Nearly 300,000 American men are expected to be diagnosed with prostate cancer this year alone, though most of those diagnosed don’t die from it. Ali Rogin speaks with Dr. Charles Ryan, a genitourinary oncologist and head of the Prostate Cancer Foundation, abo…", "url": "https://www.pbs.org/newshour/show/what-to-know-about-screening-diagnosis-and-treatment-for-prostate-cancer", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/09/Prostate-1024x576.jpg", "publishedAt": "2023-09-30T21:35:19Z", "content": "Nearly 300,000 American men are expected to be diagnosed with prostate cancer this year alone, though most of those diagnosed dont die from it. Ali Rogin speaks with Dr. Charles Ryan, a genitourinary… [+150 chars]"}, {"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Katie Wadington", "title": "Government shutdown impacts: air travel to taxes, national security to national parks - The Hill", "description": "How would a government shutdown affect the lives of everyday Americans? Some benefits, like Social Security and those for veterans, go on unimpeded. But other services, such as assistance at the IRS or access to national parks, will come to a halt. Federal em…", "url": "https://thehill.com/homenews/4229923-government-shutdown-impacts/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2022/10/capitol_dome_budget_08122022_AP22269627549381.png?w=1280", "publishedAt": "2023-09-30T12:00:00Z", "content": "Skip to content\r\nHow would a government shutdown affect the lives of everyday Americans? Some benefits, like Social Security and those for veterans, go on unimpeded. But other services, such as assis… [+3804 chars]"}]}