{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Gas prices are spiking. It's time for another look at plug-in hybrids - CNN", "description": "As America shifts towards electric cars, plug-in hybrids are often forgotten. Their potential benefits are lost on many consumers who are either attracted to the high-tech allure of fully electric cars or afraid of the complication of needing to plug in a car.", "url": "https://www.cnn.com/2022/03/08/business/plug-in-hybrids/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220308153837-plug-in-hybrid-toyota-restricted-super-tease.jpg", "publishedAt": "2022-03-08T22:25:00Z", "content": null}, {"source": {"id": null, "name": "Kstp.com"}, "author": null, "title": "Mayo Clinic: COVID-19 heading toward endemic - KSTP", "description": "While COVID-19 is still a pandemic, Americans may start hearing becoming familiar with a new word: endemic.", "url": "https://kstp.com/kstp-news/local-news/mayo-clinic-covid-19-heading-toward-endemic/", "urlToImage": "https://kstp.com/wp-content/uploads/2022/03/COVIDNurseDec312021.jpg", "publishedAt": "2022-03-08T17:04:15Z", "content": "Two years after COVID-19 swept the globe and was declared a pandemic, outbreaks are waning again.\r\nWhile COVID-19 is still a pandemic, Americans may start becoming familiar with a new word: endemic.\r… [+718 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "New species of extinct vampire-squid–like cephalopod is the first of its kind with ten functional arms - Phys.org", "description": "New research led by scientists at the American Museum of Natural History and Yale shows that the oldest ancestors of the group of animals that includes octopuses and vampire squids had not 8 but 10 arms. The study, which describes a new species of vampyropod …", "url": "https://phys.org/news/2022-03-species-extinct-vampire-squidlike-cephalopod-kind.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/new-species-of-extinct.jpg", "publishedAt": "2022-03-08T16:00:05Z", "content": "New research led by scientists at the American Museum of Natural History and Yale shows that the oldest ancestors of the group of animals that includes octopuses and vampire squids had not 8 but 10 a… [+3979 chars]"}]}