{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Didi Tang, Alex Veiga", "title": "BlackRock strikes deal to bring ports on both sides of Panama Canal under American control - The Associated Press", "description": "A Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the ports under American control after President Donald Trump alleg…", "url": "https://apnews.com/article/hong-kong-panama-canal-beijing-hutchison-blackrock-rubio-d02a8439cc63d9e740e5154d4e0c56f6", "urlToImage": "https://dims.apnews.com/dims4/default/a2bf97f/2147483647/strip/true/crop/5210x2931+0+271/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F74%2F57%2F8314afed9072bae78c32874d6f99%2Fa36fc703e7ab4aaea8ea81818f8b4156", "publishedAt": "2025-03-04T18:33:00Z", "content": "A Hong Kong-based conglomerate has agreed to sell its controlling stake in a subsidiary that operates ports near the Panama Canal to a consortium including BlackRock Inc., effectively putting the por… [+3688 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Hugh Son", "title": "CFPB drops lawsuit against JPMorgan Chase, Bank of America and Wells Fargo over Zelle fraud - CNBC", "description": "Since Acting Director Russell Vought has taken over the CFPB, the agency has dropped at least a half dozen cases brought by his predecessor, Rohit Chopra.", "url": "https://www.cnbc.com/2025/03/04/cfpb-drops-jpmorgan-bank-of-america-wells-fargo-lawsuit.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/108100067-17392007392025-02-10t151643z_1234920401_rc2qrcajr0s7_rtrmadp_0_usa-cfpb-vought.jpeg?v=1739200770&w=1920&h=1080", "publishedAt": "2025-03-04T17:26:19Z", "content": "The Consumer Financial Protection Bureau on Tuesday dismissed its lawsuit against the operator of the Zelle payments network and the three U.S. banks that dominate transactions on it.\r\nThe CFPB sued … [+1477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Fritze", "title": "Supreme Court poised to block Mexico from suing American gunmakers over cartel violence - CNN", "description": "As President Donald Trump pressures Mexico to address the flow of migrants and drugs heading north into the United States, the Supreme Court is set to hear arguments Tuesday in a major appeal about one thing that’s crossing the border toward Mexico: guns.", "url": "https://www.cnn.com/2025/03/04/politics/mexico-us-cartel-violence-supreme-court/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/130115165027-mexico-guns-destroyed.jpg?q=x_0,y_202,h_2187,w_3887,c_crop/w_800", "publishedAt": "2025-03-04T17:23:00Z", "content": "A majority of the Supreme Court appeared prepared Tuesday to shut down a lawsuit from the Mexican government alleging American gun manufacturers should be held responsible for cartel violence on the … [+6676 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": null, "title": "Presidential Message on Colorectal Cancer Awareness Month, 2025 - The White House", "description": "During National Colorectal Cancer Awareness Month, the First Lady and I offer our heartfelt prayers to every American battling the horrific disease of", "url": "https://www.whitehouse.gov/briefings-statements/2025/03/presidential-message-on-colorectal-cancer-awareness-month-2025/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2025/01/WH47-Social-Share-Card-Navy-1200x628-1.png", "publishedAt": "2025-03-04T14:43:19Z", "content": "During National Colorectal Cancer Awareness Month, the First Lady and I offer our heartfelt prayers to every American battling the horrific disease of colorectal cancer, as well as their families, fr… [+1959 chars]"}]}