{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Christine Hauser", "title": "Jarrod Ramos Sentenced to Five Life Terms in Capital Gazette Attack - The New York Times", "description": "Jarrod W. Ramos had pleaded guilty to murder charges in one of the deadliest attacks on American journalists. In July, a jury found him criminally responsible for the 2018 shooting in Maryland’s capital.", "url": "https://www.nytimes.com/2021/09/28/us/jarrod-ramos-capital-gazette.html", "urlToImage": "https://static01.nyt.com/images/2021/09/28/world/28xp-gazette/28xp-gazette-facebookJumbo.jpg", "publishedAt": "2021-09-28T15:50:03Z", "content": "Six survivors also testified at the trial, recalling the day that Mr. Ramos walked through their workplace with a 12-gauge shotgun, killing five colleagues: Gerald Fischman, 61, the editorial page ed… [+948 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": null, "title": "US: Ancient footprints re-write humanity's history in the Americas - India.com", "description": "This undated image courtesy of National Park Service and Bournemouth University shows fossilized footprints being in New Mexico.", "url": "https://www.india.com/photos/news/us-ancient-footprints-re-write-humanitys-history-in-the-americas-223669/", "urlToImage": "https://st1.photogallery.ind.sh/wp-content/uploads/indiacom/footprints5-202109-1632835346.jpg", "publishedAt": "2021-09-28T13:33:12Z", "content": "Image credit: AFPUS: National Park Service and Bournemouth University\r\nThe footprints dating back 23,000 years have been discovered in the US, suggesting humans settled North America long before the … [+302 chars]"}, {"source": {"id": null, "name": "Global Times"}, "author": null, "title": "Biden gets COVID-19 vaccine booster shot - Global Times", "description": "US President Joe Biden received a COVID-19 vaccine booster on Monday and told Americans still resisting the shots that they are damaging the country.", "url": "https://www.globaltimes.cn/page/202109/1235394.shtml", "urlToImage": "https://www.globaltimes.cn/Portals/0/attachment/2021/2021-09-21/d4ac000c-31bf-4668-a712-53ecb386b2fb.jpeg", "publishedAt": "2021-09-28T12:59:00Z", "content": "US President Joe Biden delivers remarks about a national security initiative in the East Room of the White House in Washington, DC, on Wednesday. Australian Prime Minister Scott Morrison (left) and B… [+1624 chars]"}]}