{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Russian tank attack in eastern Ukraine kills 2 Americans, Canadian and Swede - POLITICO", "description": "U.S. citizens Luke “Skywalker” Lucyszyn and Bryan Young were killed when they were ambushed during a special operation in eastern Ukraine, their commander said.", "url": "https://www.politico.com/news/2022/07/23/americans-killed-russian-tank-attack-00047567", "urlToImage": "https://static.politico.com/03/f9/e46d5daa41e1beb268e88fdbc30e/https-delivery.gettyimages.com/downloads/1239284532", "publishedAt": "2022-07-23T17:37:18Z", "content": "In an attempt to slow Russias advance, the foreign fighters were deployed to the village of Hryhorivka, two miles northwest of the Siversk. There, Miroshnichenko said, they guys were tasked to take t… [+6457 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Dangerous heat continues for millions of Americans - Fox News", "description": "Severe heat is threatening millions of Americans across the country this weekend and into next week. Storms were expected Saturday over the Midwest and Great Lakes.", "url": "https://www.foxnews.com/us/dangerous-heat-continues-millions-americans", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/07/Heat-5-1.jpg", "publishedAt": "2022-07-23T17:19:07Z", "content": "Oppressive and dangerous heat will continue to threaten millions of Americans across the U.S.\r\nAccording to FOX Weather, 77 million people were under heat alerts to start the weekend.\r\nMid-summer hea… [+2770 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Nicole Winfield", "title": "Pope's Indigenous tour signals a rethink of mission legacy - The Associated Press - en Español", "description": "VATICAN CITY (AP) — Pope Francis’ trip to Canada to apologize for the horrors of church-run Indigenous residential schools marks a radical rethink of the Catholic Church’s missionary legacy, spurred on by the first pope from the Americas and the discovery of …", "url": "https://apnews.com/article/pope-francis-canada-religion-vatican-city-2c2fbd7e29f871c1cdbc5308a0c7ab44", "urlToImage": "https://storage.googleapis.com/afs-prod/media/146b036c2d514fac8349376af9b12d92/3000.jpeg", "publishedAt": "2022-07-23T06:17:15Z", "content": "VATICAN CITY (AP) Pope Francis trip to Canada to apologize for the horrors of church-run Indigenous residential schools marks a radical rethink of the Catholic Churchs missionary legacy, spurred on b… [+7008 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "Flex Automotive make the ultimate retro-inspired Toyota Land Cruisers - Carmag South Africa", "description": "Japanese SUV retrofitter Flex Automotive, who offers conversions of Toyota Land Cruisers with a nostalgic twist have now branched out into America and intend on promoting a novel culture for enthusiasts on the new continent.", "url": "https://www.carmag.co.za/news/industry-news/flex-automotive-toyota-land-cruisers/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/07/TF-1.jpg", "publishedAt": "2022-07-23T02:59:07Z", "content": "ToyotaLand Cruiser 200Japanese SUV retrofitter Flex Automotive, who offers conversions of Toyota Land Cruisers with a nostalgic twist have now branched out into America and intend on promoting a nove… [+2166 chars]"}, {"source": {"id": null, "name": "The Indianapolis Star"}, "author": ", The Indianapolis Star", "title": "Fireball sighting over Indiana confirmed by American Meteor Society - IndyStar", "description": "Over 100 eyewitnesses reported seeing the fireball to the American Meteor Society. It likely lasted between three and five seconds.", "url": "https://www.indystar.com/story/news/local/2022/07/22/fire-ball-meteor-sighting-indiana-astronomy-ams/65380073007/", "urlToImage": "https://www.gannett-cdn.com/presto/2022/07/22/PIND/53bd8dd5-3d01-4c07-b202-31587ca6163b-captured.JPG?auto=webp&crop=1093,615,x0,y0&format=pjpg&width=1200", "publishedAt": "2022-07-22T17:16:11Z", "content": "It's a bird! It's a plane!\r\nIt's actually not, and it's not Superman. It's a fireball.\r\nA fireball passed over Central Indiana as well as several other states around 1:50 a.m. Friday, the American Me… [+2453 chars]"}]}