{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "JOSH BOAK, ZEKE MILLER", "title": "Trump imposes tariffs on Canada, Mexico and China, spurring prospect of inflation and trade war - The Associated Press", "description": "President Donald Trump has signed an order to impose stiff tariffs on imports from Mexico, Canada and China, drawing swift retaliation from the U.S.’s North American neighbors in an emerging trade war. Trump is declaring an economic emergency to put duties of…", "url": "https://apnews.com/article/trump-tariffs-trade-china-mexico-canada-inflation-753a09d56cd318f2eb1d2efe3c43b7d4", "urlToImage": "https://dims.apnews.com/dims4/default/0499847/2147483647/strip/true/crop/5693x3202+0+299/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F99%2Fdc%2F71958bfcb7bbe0e661ff76295985%2Fe7084f207c594f52bd23eb152e93ad59", "publishedAt": "2025-02-02T02:37:00Z", "content": "PALM BEACH, Fla. (AP) President Donald Trump on Saturday signed an order to impose stiff tariffs on imports from Mexico, Canada and China, drawing swift retaliation from the countrys North American n… [+8683 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaanita Iyer, Zoe Sottile", "title": "Pilots tried to pull passenger jet’s nose up within seconds of deadly DC helicopter collision, preliminary NTSB data shows - CNN", "description": "The American Airlines flight involved in the deadly collision with a Black Hawk helicopter over Washington, DC, seemed to increase its pitch just before the impact, preliminary data from a voice data recorder recovered from the plane shows.", "url": "https://www.cnn.com/2025/02/01/us/black-hawk-helicopter-training-plane-crash/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/2025-02-01t011838z-253191052-rc2tkca5g399-rtrmadp-3-usa-crash-washingtondc.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-02T01:31:00Z", "content": "The American Airlines flight involved in the deadly collision with a Black Hawk helicopter over Washington, DC, seemed to increase its pitch just before the impact, preliminary data from a data recor… [+8066 chars]"}]}