{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "What parents should know about sending kids back to school during Omicron - CNN", "description": "Millions of American kids will head back to classrooms in the coming days -- just as the Omicron variant is fueling record new Covid-19 case counts.", "url": "https://www.cnn.com/2021/12/30/health/back-to-school-omicron-covid-19-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211230085533-01-covid-test-student-nyc-1216-super-tease.jpg", "publishedAt": "2021-12-30T23:01:00Z", "content": "(CNN)Millions of American kids will head back to classrooms in the coming days -- just as the Omicron variantis fueling record new Covid-19 case counts.\r\nAnd that has many parents wondering what's sa… [+9704 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Adeel Hassan", "title": "Covid-19, Omicron and Vaccines: Live News Updates - The New York Times", "description": "The announcement offered cautious hope to other countries grappling with the fast-spreading variant. The C.D.C. urged Americans to stay off cruise ships, regardless of vaccination status. More than 1,200 U.S. flights were canceled.", "url": "https://www.nytimes.com/live/2021/12/30/world/omicron-covid-vaccine-tests", "urlToImage": "https://static01.nyt.com/images/2021/12/30/world/live-blog-20211230-promo-2/merlin_187699881_eb604e46-e558-4dec-9cb7-3877f66355d8-facebookJumbo.jpg", "publishedAt": "2021-12-30T22:40:30Z", "content": "Waiting for coronavirus tests in Manhattan on Wednesday. Long lines are forming at testing sites across the country, and record numbers of cases have been recorded this week.Credit...Sarah Blesener f… [+3968 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Kim Bellware", "title": "As omicron fuels surge of new cases, Americans face more travel woes and dashed plans - The Washington Post", "description": "Thousands of frustrated air travelers have been stranded, unable to return home from holiday celebrations.", "url": "https://www.washingtonpost.com/nation/2021/12/30/covid-omicron-variant-live-updates/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XMRTKHTJR4I6ZE4Q5LRED5GIWE.jpg&w=1440", "publishedAt": "2021-12-30T22:10:18Z", "content": "TORONTO Several Canadian provinces Thursday tightened restrictions amid an omicron-fueled increase in coronavirus cases that has overwhelmed testing and tracing systems and pushed the seven-day avera… [+2132 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Maxwell verdict puts fresh pressure on Prince Andrew - Eyewitness News", "description": "The Duke of York, the second son of Elizabeth II and ninth in line to the throne, has long-standing ties to Maxwell, who has been found guilty of recruiting and grooming young girls to be sexually abused by the late American financier Jeffrey Epstein.", "url": "https://ewn.co.za/2021/12/30/maxwell-verdict-puts-fresh-pressure-on-prince-andrew", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/ltea3thqenxcf8hlxjg4", "publishedAt": "2021-12-30T16:24:26Z", "content": "The Duke of York, the second son of Elizabeth II and ninth in line to the throne, has long-standing ties to Maxwell, who has been found guilty of recruiting and grooming young girls to be sexually ab… [+3965 chars]"}]}