{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Unbelievable, Visionary\": US Commerce Secretary Recounts Her Meeting With PM Modi - NDTV", "description": "US Commerce Secretary Gina Raimondo, recounting her recent meeting with Prime Minister Narendra Modi, said that India and America would lead the artificial intelligence revolution.", "url": "https://www.ndtv.com/india-news/unbelievable-visionary-us-commerce-secretary-recounts-her-meeting-with-pm-modi-3952043", "urlToImage": "https://c.ndtvimg.com/2023-04/2hvhuo1s_gina-raimondo_625x300_16_April_23.jpg", "publishedAt": "2023-04-16T04:31:02Z", "content": "New Delhi: US Commerce Secretary Gina Raimondo, recounting her recent meeting with Prime Minister Narendra Modi, said that India and America would lead the artificial intelligence revolution. Ms Raim… [+1571 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Geologists Discover a Critical Kill Mechanism Behind a 350 Million-Year-Old Series of Extinctions - SciTechDaily", "description": "A major oil source in North America reveals insights into one of the planet's most devastating mass extinctions. The Bakken Shale Formation, spanning an area of 200,000 square miles beneath parts of Canada and North Dakota, has been a prolific source of oil a…", "url": "https://scitechdaily.com/geologists-discover-a-critical-kill-mechanism-behind-a-350-million-year-old-series-of-extinctions/", "urlToImage": "https://scitechdaily.com/images/Animak-Skull-Extinction-Desert.jpg", "publishedAt": "2023-04-15T22:25:45Z", "content": "ByUniversity of MarylandApril 15, 2023\r\nThe Bakken Shale Formation has offered a new insight into Earths geological history, revealing a major trigger for several biotic crises during the late Devoni… [+6417 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News Staff", "title": "Hunter Biden’s involvement in Ireland trip is a 'sad part of our American history': Rep. James Comer - Fox News", "description": "Rep. James Comer, R-Ky., discusses the involvement of Hunter Biden in the President's trip to Ireland amid investigations into the family's business dealings.", "url": "https://www.foxnews.com/media/hunter-bidens-involvement-ireland-trip-sad-part-american-history-rep-james-comer", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/03/a42c9e6d-Untitled-1.jpg", "publishedAt": "2023-04-15T17:19:00Z", "content": "Rep. James Comer, R-Ky., joined \"Fox &amp; Friends Weekend\" on Saturday morning and commented on President Biden's trip to Ireland with his son, Hunter playing a role in the visit The House Oversight… [+2260 chars]"}]}