{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Tribuneonlineng.com"}, "author": "Tribune Online", "title": "Excessive consumption of artificial sweeteners increases risk of stroke, heart disease — Study - Tribune Online", "description": "WHILE millions of Americans prefer artificial sweeteners as a healthy alternative to \"the real thing,\" new research has found that these sweet substitutes actually may negatively impact health, especially when consumed in high quantities.The risks of", "url": "https://tribuneonlineng.com/excessive-consumption-of-artificial-sweeteners-increases-risk-of-stroke-heart-disease-study/", "urlToImage": "https://tribuneonlineng.com/wp-content/uploads/2022/10/web-sugar-bags.jpg", "publishedAt": "2022-10-06T06:35:55Z", "content": "WHILE millions of Americans prefer artificial sweeteners as a healthy alternative to “the real thing,” new research has found that these sweet substitutes actually may negatively impact health, espec… [+5398 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Alex Eala qualifies for main draw in Rancho Santa Fe Open | ANC - ANC 24/7", "description": "Rundown: ABS-CBN North America Bureau Correspondent Rommel Conclara brings the latest news making the headlines among the Filipino community there.For more A...", "url": "https://www.youtube.com/watch?v=AxI1HYib4c0", "urlToImage": "https://i.ytimg.com/vi/AxI1HYib4c0/maxresdefault.jpg", "publishedAt": "2022-10-06T02:22:28Z", "content": null}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Wasilat Azeez", "title": "Google to establish cloud region in South Africa — its first in Africa - TheCable", "description": "Google, American multinational tech company, says it plans to establish a new cloud region in South Africa – its first on the continent.", "url": "https://www.thecable.ng/google-to-establish-cloud-region-in-south-africa-its-first-in-africa", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2022/10/Google.jpeg", "publishedAt": "2022-10-05T17:33:00Z", "content": "Google, an American multinational tech company, says it plans to establish a new cloud region in South Africa its first on the continent.\r\nThe company announced this in a statement on Wednesday.\r\nClo… [+1795 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "American, Danish scientists take Nobel Prize in Chemistry for advancing study of molecules - CBC News", "description": "This year's Nobel Prize in Chemistry has been awarded in equal parts to Carolyn R. Bertozzi, Morten Meldal and K. Barry Sharpless for developing a way of \"snapping molecules together.\"", "url": "https://www.cbc.ca/news/science/chemistry-nobel-prize-1.6606554", "urlToImage": "https://i.cbc.ca/1.6606567.1664965330!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1243738723.jpg", "publishedAt": "2022-10-05T11:07:12Z", "content": "Three scientists from the United States and Denmark were jointly awarded this year's Nobel Prize in Chemistry for developing a way of \"snapping molecules together\" that can be used to design better m… [+2909 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Renée Onque", "title": "Most Americans don't plan to get a flu shot this season — lots of them say they'll mask to avoid germs instead - CNBC", "description": "A higher share of Americans plan to mask at least sometimes this flu season to avoid germs than plan to get vaccinated, according to a survey from the NFID.", "url": "https://www.cnbc.com/2022/10/04/fewer-americans-plan-to-get-a-flu-shot-this-season-2022.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106690940-1599222701467-gettyimages-1270517932-a66i4073_2020090361539411.jpeg?v=1664907858&w=1920&h=1080", "publishedAt": "2022-10-04T18:24:18Z", "content": "Only 49% of U.S. adults plan to get their flu shot this flu season, according to a survey conducted by the National Foundation for Infectious Diseases (NFID). Even 1 in 5 of those who are at higher r… [+3003 chars]"}]}