{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry", "title": "‘No Hard Feelings’ shows off Jennifer Lawrence in a raunchy comedy with a deeper core - CNN", "description": "“No Hard Feelings,” kind of part French sex comedy, part “American Pie”-like coming-of-age story, this raunchy vehicle for Jennifer Lawrence also possesses darker and deeper streaks that elevate it above its “Pretty. Awkward.” posters.", "url": "https://www.cnn.com/2023/06/23/entertainment/no-hard-feelings-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230310090939-01-no-hard-feelings-movie.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-06-23T12:51:00Z", "content": "No Hard Feelings is the kind of hard-to-characterize movie that isnt served by a splashy ad campaign, in mostly good ways. Part French sex comedy, part American Pie-like coming-of-age story, this rau… [+3094 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Adani group says unaware of any subpoena to investors amid reports of regulatory scrutiny in US - Moneycontrol", "description": "\"We strongly reject any suggestion that Adani Group and its businesses have not acted as per the regulations,\" the company said, after reports claimed that the US regulators are looking into the representations that Adani made to its American investors follow…", "url": "https://www.moneycontrol.com/news/business/adani-group-says-unaware-of-any-subpoena-to-investors-amid-reports-of-regulatory-scrutiny-in-us-10843581.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2023/06/Adani-Reuters-770x433.jpg", "publishedAt": "2023-06-23T12:04:59Z", "content": "A day after reports claimed that the regulators in the United States have issued subpoena to Adani group investors, the Gautam Adani-led conglomerate issued a denial.\r\n\"We are not aware of any such s… [+2261 chars]"}]}