{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Rappler"}, "author": null, "title": "American firm's buyout of Hanjin shipyard a win for Philippine military – DOF - Rappler", "description": "(1st UPDATE) Finance Secretary Carlos Dominguez III says the deal with Cerberus gives the Philippine Navy an 'ideal harbor' facing the West Philippine Sea", "url": "https://www.rappler.com/business/american-firm-cerberus-buyout-hanjin-shipyard-win-philippine-military-department-finance/", "urlToImage": "https://www.rappler.com/tachyon/2022/04/the-hanjin-heavy-industries-corporations-philippines-facility.jpeg", "publishedAt": "2022-04-25T06:50:00Z", "content": "MANILA, Philippines The acquisition of United States-based private equity firm Cerberus Frontier of the former Hanjin shipyard at the Subic Bay Freeport is a win-win especially for the military and t… [+3524 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Andrew E. Kramer, Natalie Kitroeff", "title": "What Happened on Day 60 of the War in Ukraine - The New York Times", "description": "The U.S. secretaries of state and defense were the highest-level American officials to go to Ukraine. A Ukrainian commander told The Times that the steel plant in Mariupol hasn’t fallen, but that he and others would give up if they could leave the factory saf…", "url": "https://www.nytimes.com/live/2022/04/24/world/ukraine-russia-war-news", "urlToImage": "https://static01.nyt.com/images/2022/04/24/business/24ukraine-blog-promo-10pm/24ukraine-blog-promo-10pm-facebookJumbo.jpg", "publishedAt": "2022-04-25T03:47:00Z", "content": "Smoke hung over the gray streets that day in Kyiv, where protesters had piled tires, furniture and barbed wire to barricade themselves from security forces. Torn blue and yellow Ukrainian flags whipp… [+14486 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ashraf Khalil", "title": "Jon Stewart to receive Mark Twain Prize for American humor - The Associated Press - en Español", "description": "WASHINGTON (AP) — Jon Stewart, accepting the Kennedy Center's Mark Twain Prize for American Humor, warned Sunday night that speculation about the future of comedy amid increased audience cultural sensitivity was ignoring a true and enduring threat: authoritar…", "url": "https://apnews.com/article/bill-cosby-entertainment-arts-and-talk-shows-dave-chappelle-eb2362ca7076700492493462e78ab7ca", "urlToImage": "https://storage.googleapis.com/afs-prod/media/09b28e6d5ec747fc81419fa10ff484bf/3000.jpeg", "publishedAt": "2022-04-25T00:56:15Z", "content": "WASHINGTON (AP) Jon Stewart, accepting the Kennedy Centers Mark Twain Prize for American Humor, warned Sunday night that speculation about the future of comedy amid increased audience cultural sensit… [+4755 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Airline fires back at star’s Twitter complaint - news.com.au", "description": "<p>An American flight company has hit back at Australian rapper Iggy Azalea, who had earlier taken to Twitter to complain about her recent experience with the airline.</p>", "url": "https://www.news.com.au/entertainment/celebrity-life/american-air-staffer-hits-back-at-iggy-azaleas-claim-she-was-left-stranded-at-miami-airport/news-story/50f1e2ac03207ea1c2a32c5b373bdd88", "urlToImage": "https://content.api.news/v3/images/bin/566b004bf665d5f72bb7947d28ea8043", "publishedAt": "2022-04-24T22:21:24Z", "content": "Iggy Azalea brutally called out an American airline company for leaving her and her one-year-old son stranded, but a staffer has since said it was her own fault.An American flight company has hit bac… [+3128 chars]"}]}