{"articles": [{"author": "CNA", "content": "WASHINGTON: US Secretary of State Antony Blinken warned Saturday (Mar 27) that China's tit-for-tat sanctions against two Americans in the growing dispute over Beijing's treatment of Uighurs were \"bas… [+1580 chars]", "description": "WASHINGTON: US Secretary of State Antony Blinken warned Saturday (Mar 27) that China's tit-for-tat sanctions against two Americans in the growing dispute over Beijing's treatment of Uighurs were \"baseless\" and would only shine a harsh spotlight on the \"genoci…", "publishedAt": "2021-03-28T02:29:01Z", "source": {"id": null, "name": "CNA"}, "title": "Washington condemns China's 'baseless sanctions' against US officials over Xinjiang: Blinken - CNA", "url": "https://www.channelnewsasia.com/news/world/washington-condemns-china-sanctions-xinjiang-blinken-14509464", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14495836/16x9/991/557/3ba567145855e86b8a39dd829a0fab32/ja/nato-foreign-affairs-ministers-meeting-5.jpg"}, {"author": "The Star Online", "content": "BEIJING/OTTAWA (Reuters) -Canadian Prime Minister Justin Trudeau on Saturday said China's sanctions against two American religious-rights officials and one Canadian lawmaker were unacceptable and vow… [+2976 chars]", "description": "BEIJING/OTTAWA (Reuters) -Canadian Prime Minister Justin Trudeau on Saturday said China's sanctions against two American religious-rights officials and one Canadian lawmaker were unacceptable and vowed to continue to defend human rights.", "publishedAt": "2021-03-27T20:02:00Z", "source": {"id": null, "name": "The Star Online"}, "title": "Canada's Trudeau calls Chinese sanctions over Xinjiang 'unacceptable' - The Star Online", "url": "https://www.thestar.com.my/news/world/2021/03/28/canada039s-trudeau-calls-chinese-sanctions-over-xinjiang-039unacceptable039", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/03/28/1092811.JPG"}, {"author": null, "content": "Grey DeLisle-Griffin, American actress and singer, has narrated how her marriage to Christopher DeLisle, her first husband, crashed after she mistakenly confessed to cheating on him.\r\nThe songwriter … [+1983 chars]", "description": "Grey DeLisle-Griffin, American actress and singer, has narrated how her first marriage to Christopher DeLisle, her first husband", "publishedAt": "2021-03-27T18:57:14Z", "source": {"id": null, "name": "Thecable.ng"}, "title": "Grey DeLisle-Griffin: I lost my first marriage after I mistakenly confessed to cheating - TheCable Lifestyle - TheCable", "url": "http://lifestyle.thecable.ng/grey-delisle-griffin-i-lost-my-first-marriage-after-i-mistakenly-confessed-to-cheating/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/03/Grey_DeLisle-Griffin.jpg"}, {"author": "Lauren Mascarenhas, CNN", "content": "ATLANTA (CNN) The Pfizer/BioNTech and Moderna COVID-19 vaccines are effective in pregnant and lactating women, who can pass protective antibodies to newborns, according to research published Thursday… [+4022 chars]", "description": "The Pfizer/BioNTech and Moderna Covid-19 vaccines are effective in pregnant and lactating women, who can pass protective antibodies to newborns, according to research published Thursday in the American Journal of Obstetrics and Gynecology.", "publishedAt": "2021-03-27T02:41:13Z", "source": {"id": null, "name": "KSL.com"}, "title": "Study says COVID-19 vaccines provide protection for pregnant and lactating women — and their newborns - KSL.com", "url": "https://www.ksl.com/article/50133652/study-says-covid-19-vaccines-provide-protection-for-pregnant-and-lactating-women--and-their-newborns", "urlToImage": "https://img.ksl.com/slc/2816/281649/28164988.jpg?filter=ksl/responsive_story_lg"}, {"author": "CNN", "content": "The evidence that Americans are gearing up for a return to normal life is growing apparent.\r\nStates are relaxing capacity restrictions for public areas and private gatherings. More school districts a… [+6018 chars]", "description": "The evidence that Americans are gearing up for a return to normal life is growing apparent. States are relaxing capacity restrictions for public areas and private gatherings. More school districts are reopening for in-person learning. Travel is increasing, wi…", "publishedAt": "2021-03-26T10:36:47Z", "source": {"id": null, "name": "ABC17News.com"}, "title": "Dangerous Covid-19 variants could mean all bets are off on the road to normalcy, expert warns - ABC17NEWS - ABC17News.com", "url": "https://abc17news.com/money/2021/03/26/dangerous-covid-19-variants-could-mean-all-bets-are-off-on-the-road-to-normalcy-expert-warns/", "urlToImage": "https://abc17news.b-cdn.net/abc17news.com/2019/10/kmiz-health.png"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "america"}