{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "One in five women likely to forgo additional testing after abnormal mammogram - News-Medical.Net", "description": "One in five women is likely to forgo additional testing after an abnormal finding on a screening mammogram if there is a deductible, according to a new study presented today at the annual meeting of the Radiological Society of North America.", "url": "https://www.news-medical.net/news/20221129/One-in-five-women-likely-to-forgo-additional-testing-after-abnormal-mammogram.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2022-11-29T16:35:00Z", "content": "One in five women is likely to forgo additional testing after an abnormal finding on a screening mammogram if there is a deductible, according to a new study presented today at the annual meeting of … [+4158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Bank of America CEO predicts two years of pain ahead in the housing market - CNN", "description": "The CEO of one of the nation's largest banks is preparing for an economic downturn in 2023. But he's also hopeful that the likely recession will be brief and \"mild.\"", "url": "https://www.cnn.com/2022/11/29/economy/bank-of-america-brian-moynihan/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221129082729-01-brian-moynihan-poppy-harlow-interview-1129-screenshot.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-29T15:00:00Z", "content": "The CEO of one of the nations largest banks is preparing for an economic downturn in 2023. But hes also hopeful that the likely recession will be brief and mild.\r\nBank of America\r\n(BAC) CEO Brian Moy… [+2023 chars]"}, {"source": {"id": null, "name": "WPVI-TV"}, "author": null, "title": "Hospitals in New Jersey brace for more flu, COVID, RSV cases - WPVI-TV", "description": "The American Academy of Pediatrics and Children's Hospital Association have asked for a national emergency declaration because some hospitals are overwhelmed.", "url": "https://6abc.com/rsv-cases-flu-illness-hospitalization-rate-new-jersey-philly-pennsylvania-delaware/12504355/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12504640_112822-wpvi-flu-rsv-concerns-430-CC-vid.jpg?w=1600", "publishedAt": "2022-11-29T00:58:29Z", "content": "CAMDEN, New Jersey (WPVI) -- With Thanksgiving behind us and Christmas approaching, hospitals expect respiratory illnesses to rise.\r\nThe American Academy of Pediatrics and Children's Hospital Associa… [+1974 chars]"}]}