{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Carl Hulse", "title": "Why Republicans Won’t Budge on Guns - The New York Times", "description": "Polls show that the overwhelming majority of Americans support some restrictions on firearms, but G.O.P. lawmakers fear they would pay a steep political price for embracing them.", "url": "https://www.nytimes.com/2022/05/26/us/republicans-gun-control.html", "urlToImage": "https://static01.nyt.com/images/2022/05/26/us/politics/26dc-hulse1/26dc-hulse1-facebookJumbo.jpg", "publishedAt": "2022-05-26T09:00:14Z", "content": "They are disturbed, they are troubled, but they are not willing to change where they are, said Senator Chris Coons, Democrat of Delaware.\r\nWhile they are mainly opposed to gun safety legislation, Rep… [+1184 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Ross Marowits", "title": "North American stock markets rise in response to Fed rate increase outlook - CP24 Toronto's Breaking News", "description": "North American stock markets climbed after minutes from the last Federal Reserve meeting suggested the central bank won't be any more hawkish in aggressively raising interest rates in the months to come.", "url": "https://www.cp24.com/news/north-american-stock-markets-rise-in-response-to-fed-rate-increase-outlook-1.5918432", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5918437.1653514301!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-05-25T21:32:21Z", "content": "North American stock markets climbed after minutes from the last Federal Reserve meeting suggested the central bank won't be any more hawkish in aggressively raising interest rates in the months to c… [+3891 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Nathan Diller", "title": "CDC monkeypox warning urges 'enhanced precautions' for travel - The Washington Post", "description": "The CDC travel alert for monkeypox says public risk is low, but cases have been confirmed in Europe, North America and Australia.", "url": "https://www.washingtonpost.com/travel/2022/05/25/cdc-monkeypox-travel-advisory/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RLEWN2INYBE4JIGKNNDP4BNKYY.jpg&w=1440", "publishedAt": "2022-05-25T20:33:18Z", "content": "Placeholder while article actions load\r\nThe Centers for Disease Control and Prevention has issued a monkeypox alert to travelers after cases were reported in North America, Europe and Australia. The … [+2361 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Luke Andrews", "title": "Thousands more Americans are living with undiagnosed HIV, report shows - Daily Mail", "description": "The annual surveillance report from the Centers for Disease Control and Prevention (CDC) showed about 5,000 fewer cases were diagnosed in 2020 than had been expected based on previous years.", "url": "https://www.dailymail.co.uk/health/article-10854241/Thousands-Americans-living-diagnosed-HIV-report-shows.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/25/19/58279143-0-image-a-41_1653503684361.jpg", "publishedAt": "2022-05-25T20:19:01Z", "content": "Thousands more Americans may be living with undiagnosed HIV than before Covid struck, official figures have suggested, in a warning sign the devastating virus is spreading again in the United States.… [+8702 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "John Ely Senior", "title": "7 healthy habits that can almost HALVE your risk of dementia - Daily Mail", "description": "People who adhere to seven healthy habits could reduce their dementia risk by up to 48 per cent, even for those with a genetic risk, a study of nearly 12,000 Americans claims.", "url": "https://www.dailymail.co.uk/health/article-10854827/Seven-habits-linked-lower-risk-dementia-genetic-risk-study.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/26/09/58305603-0-image-a-4_1653552486526.jpg", "publishedAt": "2022-05-25T20:01:00Z", "content": "Adhering to just seven healthy habits may almost halve your chance of developing dementia, a study suggests.\r\nManaging blood pressure and blood sugar, controlling cholesterol, staying active, eating … [+5593 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Ian Randall", "title": "‘Dragon of death’: South America’s largest pterosaur had a wingspan of nearly 30 feet - Express", "description": "THE LARGEST pterosaur ever discovered in South America - which had a wingspan of nearly 30 feet and has been dubbed the 'dragon of death' - has been unearthed in Argentina.", "url": "https://www.express.co.uk/news/science/1615690/dragon-of-death-thanatosdrakon-amaru-south-america-largest-pterosaur-30-feet-wingspan", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/151/1200x712/1615690_1.jpg", "publishedAt": "2022-05-25T09:57:00Z", "content": null}, {"source": {"id": null, "name": "Thesaxon.org"}, "author": "Teilor Stone", "title": "NASA will send not only Americans to the moon: who else will join the mission - The Saxon", "description": "Amid the Russian invasion of Ukraine, the United States is looking for new allies for space exploration. We are . We are from Ukraine From the first day of the war, Focus never stopped working. Our team considers it its duty to inform the reader about what is…", "url": "https://thesaxon.org/nasa-will-send-not-only-americans-to-the-moon-who-else-will-join-the-mission/2570/", "urlToImage": null, "publishedAt": "2022-05-25T08:27:18Z", "content": "First flight of the new NASA Space Launch System rocket as part of the Artemis-1 uncrewed mission;<ul><li></li><li>The second flight of the same rocket with the Orion spacecraft and the crew on board… [+3240 chars]"}]}