{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Earthworm invasion in Canadian forest linked to insect decline, study suggests - CBC News", "description": "In many parts of northern North America, there have been no earthworms since before the last ice age. Now, with help from humans, invasive earthworms are colonizing new areas. And in areas of a forest with more invasive earthworms, there are fewer insects, a …", "url": "https://www.cbc.ca/news/science/invasive-earthworms-1.6403469", "urlToImage": "https://i.cbc.ca/1.6403480.1648726531!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/earthworms.jpg", "publishedAt": "2022-03-31T13:56:25Z", "content": "In many parts of northern North America, there have been no earthworms since before the last ice age. Now, with help from humans, invasive earthworms are colonizing new areas. And in areas of a fores… [+5731 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "First Nations delegates ask Pope Francis to revoke church doctrine used to justify colonialism - CBC News", "description": "Members of the Assembly of First Nations (AFN) urged Pope Francis on Thursday to revoke centuries-old papal decrees used to justify the seizure of Indigenous land in the Americas by colonial powers.", "url": "https://www.cbc.ca/news/politics/assembly-of-first-nations-meets-pope-francis-vatican-1.6402798", "urlToImage": "https://i.cbc.ca/1.6403497.1648729491!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/afn-delegation-in-rome.jpg", "publishedAt": "2022-03-31T12:25:23Z", "content": "Members of the Assembly of First Nations (AFN) urged Pope Francis on Thursday to revoke centuries-old papal decrees used to justify the seizure of Indigenous land in the Americas by colonial powers.\r… [+3325 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Record-Setting NASA Astronaut and Two Cosmonauts Return From International Space Station - SciTechDaily", "description": "After extending the record for the longest single spaceflight in history by an American to 355 days, NASA astronaut Mark Vande Hei returned to Earth on Wednesday, March 30, 2022, along with Roscosmos cosmonauts Anton Shkaplerov and Pyotr Dubrov. The trio depa…", "url": "https://scitechdaily.com/record-setting-nasa-astronaut-and-two-cosmonauts-return-from-international-space-station/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronaut-Mark-Vande-Hei-After-Landing.jpg", "publishedAt": "2022-03-31T09:36:18Z", "content": "NASA astronaut Mark Vande Hei is seen outside the Soyuz MS-19 spacecraft after he landed with Russian cosmonauts Anton Shkaplerov and Pyotr Dubrov in a remote area near the town of Zhezkazgan, Kazakh… [+3705 chars]"}]}