{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "NASA Artemis 2 moon-bound astronaut rumors name American, Canadian candidates: report - Space.com", "description": "While two names are cited repeatedly as top candidates for Artemis 2, a four-person moon mission, no official confirmation will come until at least late spring.", "url": "https://www.space.com/nasa-artemis-2-moon-crew-selection-rumors", "urlToImage": "https://cdn.mos.cms.futurecdn.net/jForrqNu4MKXwjWGFzUxC-1200-80.jpg", "publishedAt": "2023-01-30T18:33:00Z", "content": "NASA will soon name the astronauts on its first crewed moon mission since 1972.\r\nArtemis 2 is the next flight after the agency's uncrewed Artemis 1 mission, which launched Nov. 16 on the Space Launch… [+4491 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Insurers refuse to cover certain Hyundai, Kia models l GMA - Good Morning America", "description": "ABC News’ Gio Benitez reports on why State Farm and Progressive are reportedly refusing to write policies for some older Hyundai and Kia models, and what you...", "url": "https://www.youtube.com/watch?v=qz-uDZ8ipus", "urlToImage": "https://i.ytimg.com/vi/qz-uDZ8ipus/maxresdefault.jpg", "publishedAt": "2023-01-30T15:38:30Z", "content": null}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Phillip van Niekerk", "title": "PUTIN'S LITTLE AMERICAN HELPERS: AD2016, again and again: Arrest of senior FBI official puts focus on Russia's role in ascent of Trump - Daily Maverick", "description": "The full extent of one of Russia’s most successful intelligence operations — helping to elect Donald Trump as President of the US — may never be known, but the blows to the credibility of America’s spy agencies are still coming.", "url": "https://www.dailymaverick.co.za/article/2023-01-29-ad2016-again-and-again-arrest-of-senior-fbi-official-puts-focus-on-russias-role-in-ascent-of-trump/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/Brooks-Trumpfailure-e1531872056827.jpg?w=1280", "publishedAt": "2023-01-29T21:48:15Z", "content": "Last week, Charles McConigal, a former senior FBI official, was arrested and charged in a federal court in Manhattan for being in the pay of the Russian oligarch Oleg Deripaska, a man with deep ties … [+8669 chars]"}]}