{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ronn Blitzer", "title": "With Taliban surging in Afghanistan as US withdraws, Biden to pitch 'diplomatic solution' - Fox News", "description": "The Taliban continues its resurgence in Afghanistan as American forces withdraw from the country, but the Biden administration believes military action is neither necessary nor the best course of action to improve the situation on the ground.", "url": "https://www.foxnews.com/politics/afghanistan-taliban-surges-us-withdraws-biden-diplomatic-solution", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Afghanistan-US-Troop-Withdrawal-AP.jpg", "publishedAt": "2021-07-08T13:01:53Z", "content": "The Taliban continues its resurgence in Afghanistan as American forces withdraw from the country, but the Biden administration believes military action is neither necessary nor the best course of act… [+3807 chars]"}, {"source": {"id": null, "name": "Latest News in Nigeria & Breaking Naija News 24/7 | LEGIT.NG"}, "author": "Ibitoye Shittu", "title": "Messi Shows Passion for Argentina, Moved to Tears and Can Barely Watch During Penalty Win Over Colombia ▷ Nigeria news - Legit.ng", "description": "Messi's incredible passion for Argentina should never be doubted after a special camera showcased his desire to see his country succeed at the Copa America.", "url": "https://www.legit.ng/1423880-camera-focus-lionel-messi-shows-barcelona-star-is.html", "urlToImage": "https://netstorage-legit.akamaized.net/images/08b32ea83fc80e63.jpg", "publishedAt": "2021-07-07T18:47:01Z", "content": "<ul><li>Argentina have qualified for the final of the 2021 Copa America championship after beating Colombia on penalties in the semis</li><li>Lionel Messi created the assist that helped Martinez to s… [+2646 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Move over Messi -- Argentina has a new hero - The Star Online", "description": "BRASILIA (Reuters) -     Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout in their Copa America semi-final against Colombia.", "url": "https://www.thestar.com.my/sport/football/2021/07/07/soccer-move-over-messi----argentina-has-a-new-hero", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/07/1211772.jpg", "publishedAt": "2021-07-07T05:47:00Z", "content": "BRASILIA (Reuters) - Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout i… [+1854 chars]"}]}