{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Heart.org"}, "author": null, "title": "No difference in heart outcomes found in use of two diuretics to treat blood pressure - American Heart Association", "description": "Research Highlights: In a study comparing the effectiveness of two high blood pressure medications (both diuretics) among elderly veterans, there was no difference in cardiovascular outcomes or non-cancer deaths. There was also no difference in heart ...", "url": "https://newsroom.heart.org/news/no-difference-in-heart-outcomes-found-in-use-of-two-diuretics-to-treat-blood-pressure", "urlToImage": "https://s3.amazonaws.com/cms.ipressroom.com/67/files/20229/635dcf26b3aed31ad9c8a181_Areef+Ishani+M.D./Areef+Ishani+M.D._hero.jpg", "publishedAt": "2022-11-05T14:52:25Z", "content": "Research Highlights:\r\n<ul><li>In a study comparing the effectiveness of two high blood pressure medications (both diuretics) among elderly veterans, there was no difference in cardiovascular outcomes… [+9710 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Toluse Olorunnipa", "title": "In hard-fought midterms, Indian American voters are prized - The Washington Post", "description": "Ahead of hard-fought midterms, Democrats are hoping to capitalize on the optimism felt by Indian Americans, a growing and increasingly vital bloc of voters.", "url": "https://www.washingtonpost.com/politics/2022/11/04/midterms-indian-american-voters/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VZNG4AZP7DREPAXRZFBTEEVI6Y.JPG&w=1440", "publishedAt": "2022-11-04T22:23:00Z", "content": "Comment on this story\r\nAs President Biden rolled up his sleeve to receive his coronavirus booster shot at the White House last week, he was surrounded by leaders from the worlds of medicine, governme… [+10656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "American Jailed For 4 Weeks For Slapping Singapore Airlines Crew Member - NDTV", "description": "An American whose bomb hoax on a commercial flight prompted Singapore to scramble fighter jets was sentenced to four weeks in prison today, after a court found him guilty of causing hurt by slapping a cabin crew member.", "url": "https://www.ndtv.com/world-news/us-national-gets-4-week-jail-for-slapping-singapore-airlines-crew-member-3490658", "urlToImage": "https://i.ndtvimg.com/i/2015-05/singapore-airlines_650x400_81432696416.jpg", "publishedAt": "2022-11-04T12:57:00Z", "content": "The plane had to be escorted to Singapore by fighter jets. (Representational)\r\nSingapore: An American whose bomb hoax on a commercial flight prompted Singapore to scramble fighter jets was sentenced … [+1269 chars]"}]}