{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nouran Salahieh, Dakin Andone", "title": "Communities face major destruction after large tornadoes tear through the South and Midwest, leaving at least 24 dead - CNN", "description": "Devastated communities across the American South and Midwest are digging through debris Sunday after ferocious storms and tornadoes this weekend left at least 24 people dead and leveled neighborhoods, as parts of the Southern Plains brace for the possibility …", "url": "https://www.cnn.com/2023/04/02/us/us-severe-storm-south-midwest-sunday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230402020232-01-tornado-indiana-040123.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-02T13:16:00Z", "content": "Devastated communities across the American South and Midwest are digging through debris Sunday after ferocious storms and tornadoes this weekend left at least 24 people dead and leveled neighborhoods… [+6385 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, Kristin Fisher", "title": "NASA set to unveil the crew of astronauts for moon flyby mission - CNN", "description": "Four astronauts — including three Americans and one Canadian — will be tapped by NASA to complete a generation-defining mission to the moon's orbit, returning humans to deeper into the solar system than has been reached in five decades.", "url": "https://www.cnn.com/2023/04/02/world/artemis-2-nasa-crew-announcement-preview-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221121170940-artemis-flyby-thumbnail.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-02T08:03:00Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nFour astronauts including three Americans and one Cana… [+7247 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": "MSNBC", "title": "Unprecedented: Trump's indictment shakes up American politics - MSNBC", "description": null, "url": "https://news.google.com/rss/articles/CCAiC0lDSTJCSlBRNVFnmAEB?oc=5", "urlToImage": null, "publishedAt": "2023-04-01T19:00:05Z", "content": null}]}