{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hundreds Stuck As US Changes Migrant Rules Overnight - NDTV", "description": "Pandemic-era controls barring migrants from claiming US asylum expire Thursday night amid fears of chaos at the Mexican border, with a tough new policy spelling uncertainty for thousands seeking refuge in America.", "url": "https://www.ndtv.com/world-news/hundreds-stuck-as-us-changes-migrant-rules-overnight-4027238", "urlToImage": "https://c.ndtvimg.com/2021-08/1b5k69b8_us-border-agent_625x300_04_August_21.jpg", "publishedAt": "2023-05-12T01:35:41Z", "content": "The Border Patrol has seen thousands show up each month from Russia, India, China, Brazil and elsewhere.\r\nWashington: Pandemic-era controls barring migrants from claiming US asylum expire Thursday ni… [+4962 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Reis Thebault", "title": "The behind-the-scenes fallout of the Hollywood writers' strike - The Washington Post", "description": "The Writers Guild of America strike has had a profound impact on a constellation of wacky, ultra-niche and utterly ordinary businesses that orbit Hollywood.", "url": "https://www.washingtonpost.com/nation/2023/05/11/hollywood-writers-strike-workers/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VRK6YU2R35FG3Z5EY4LHIL2L2Y_size-normalized.JPG&w=1440", "publishedAt": "2023-05-11T20:22:00Z", "content": "Comment on this story\r\nComment\r\nLOS ANGELES The company that rents mortuary props also offers real autopsies, so the Hollywood writers strike wont faze its owners. But the man who designs exact repli… [+9591 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "REGINA GARCIA CANO and FRANKLIN BRICENO Associated Press", "title": "18 years after Natalee Holloway disappearance, Peru to extradite key suspect to US - ABC News", "description": "Peru’s government will allow the extradition to the United States of the prime suspect in the unsolved 2005 disappearance of American student Natalee Holloway on the Dutch Caribbean Island of Aruba, bringing her family hope there will be justice in the...", "url": "https://abcnews.go.com/International/wireStory/peru-suspect-2005-disappearance-natalee-holloway-temporarily-extradited-99244066", "urlToImage": "https://s.abcnews.com/images/International/wirestory_cf4ee3ad43233ac98ea63f92e4ba59bd_16x9_992.jpg", "publishedAt": "2023-05-11T19:40:37Z", "content": "LIMA, Peru -- The chief suspect in the unsolved 2005 disappearance of American student Natalee Holloway is poised to face charges linked to the young womans vanishing for the first time after the gov… [+6017 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Natalee Holloway's family thought he could lead them to her remains. Now they want him convicted - CNN", "description": "Joran van der Sloot, the prime suspect in the 2005 disappearance of the late American teen Natalee Holloway, will be extradited to the US to face extortion a...", "url": "https://www.youtube.com/watch?v=P06zvHbjD3g", "urlToImage": "https://i.ytimg.com/vi/P06zvHbjD3g/maxresdefault.jpg", "publishedAt": "2023-05-11T16:49:16Z", "content": null}]}