{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Douglas Belkin  and Joseph Pisani", "title": "Uvalde Mourns Victims of Texas School Shooting in Grief and Anger - The Wall Street Journal", "description": "Children clung to their mothers and cried as mourners streamed to a corner near Robb Elementary School to pay their respects to the 21 people killed there this week. President Biden urged Americans to do more to try to curb gun violence.", "url": "https://www.wsj.com/articles/at-weeks-end-uvalde-mourns-11653748380", "urlToImage": "https://images.wsj.net/im-553837/social", "publishedAt": "2022-05-28T22:12:00Z", "content": "UVALDE, TexasA steady stream of mourners, many driving in from other cities while leaving behind other Memorial Day plans, came to Robb Elementary School on Saturday afternoon to pay respects to the … [+278 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Fiona Jackson", "title": "'Most powerful meteor storm in generations could light up skies above North America early next week - Daily Mail", "description": "The most powerful meteor storm 'in generations' could light up skies above North America on Tuesday morning, according to NASA.", "url": "https://www.dailymail.co.uk/sciencetech/article-10861055/Most-powerful-meteor-storm-generations-light-skies-North-America-early-week.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/05/27/15/58365509-0-image-a-43_1653663174623.jpg", "publishedAt": "2022-05-27T16:51:30Z", "content": "The 'most powerful meteor storm in generations' could light up skies above North America next week.\r\nFragments of dying comet SW3 are predicted to be visible from the United States and parts of Canad… [+6197 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Explainer: What will Quebec's new French language law mean for business, hiring? - Reuters.com", "description": "Backers of Quebec's sweeping new law to promote French usage in the Canadian province hail it as the most important measure in nearly half a century to protect the language in mostly English-speaking North America.", "url": "https://www.reuters.com/world/americas/how-quebecs-new-french-language-law-will-impact-business-hiring-2022-05-27/", "urlToImage": "https://www.reuters.com/resizer/5COumsbOZ2nhrrXjjiTKqH5IaaM=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NIC62Y2RXFJLZBNH37B4NIEAUE.jpg", "publishedAt": "2022-05-27T13:17:00Z", "content": "MONTREAL, May 27 (Reuters) - Backers of Quebec's sweeping new law to promote French usage in the Canadian province hail it as the most important measure in nearly half a century to protect the langua… [+3034 chars]"}]}