{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "New Straits Times"}, "author": "AFP", "title": "Natural immunity more potent than vaccines during US Delta wave: Study - New Straits Times", "description": "WASHINGTON: During America's last surge of the coronavirus driven by the Delta variant, people who were unvaccinated but survived Covid were better protected than those who were vaccinated and not previously infected, a new study said Wednesday.", "url": "https://www.nst.com.my/world/world/2022/01/764381/natural-immunity-more-potent-vaccines-during-us-delta-wave-study", "urlToImage": "https://assets.nst.com.my/images/articles/immunity200122_NSTfield_image_socialmedia.var_1642644180.jpg", "publishedAt": "2022-01-20T02:03:04Z", "content": null}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "His influence was 'everything': Canadians mourn loss of fashion titan André Leon Talley - CBC News", "description": "André Leon Talley, a vibrant presence in the American fashion scene and former editor-at-large of U.S. Vogue, has died at 73. Canadians from the arts and fashion worlds mourn the style icon and reflect on his legacy.", "url": "https://www.cbc.ca/news/entertainment/canadians-reflect-on-andre-leon-talley-1.6320374", "urlToImage": "https://i.cbc.ca/1.6320920.1642632998!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/obit-andre-leon-talley.jpg", "publishedAt": "2022-01-20T00:33:00Z", "content": "When it was announced that former U.S. Vogue editor at large André Leon Talley died at 73 years old on Wednesday, the fashion community in Canada and abroad lamented an enormous loss. \r\nTalley, an in… [+3734 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Kyle Morris", "title": "Biden predicts Putin will advance into Ukraine: 'He has to do something' - Fox News", "description": "President Biden said he believes Russia's Vladimir Putin will advance into Ukraine, suggesting that a “minor incursion” could result in an alternate response from America as he warned of economic damage to the European country.", "url": "https://www.foxnews.com/politics/biden-predicts-putin-will-advance-into-ukraine-he-has-to-do-something", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/Putin-Biden-color-correct.jpg", "publishedAt": "2022-01-19T23:47:36Z", "content": "President Biden said Wednesday that he believes Russian President Vladimir Putin will advance into Ukraine, but he also tried to address Russia's main complaint, indicating that Ukraine would not joi… [+3544 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "'I don't think I overpromised at all,' Biden says after challenges of 1st year in office - CBC News", "description": "U.S. President Joe Biden on Wednesday said he had underestimated the extent of Republican opposition to his programs and acknowledged Americans' frustration at the slow pace of COVID-19 testing, but said the United States was on track to meet considerable cha…", "url": "https://www.cbc.ca/news/world/biden-one-year-anniversary-1.6320803", "urlToImage": "https://i.cbc.ca/1.6320832.1642630017!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/biden.jpg", "publishedAt": "2022-01-19T22:23:00Z", "content": "U.S. President Joe Biden on Wednesday said he had underestimated the extent of Republican opposition to his programs and acknowledged Americans' frustration at the slow pace of COVID-19 testing, but … [+3633 chars]"}]}