{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Antoinette Radford, Michelle Shen, Chelsea Bailey, Maureen Chowdhury, Jessie Yeung, Piper Hudspeth Blackburn, Isabelle D’Antonio, Shania Shelton, Aditi Sangal, Elise Hammond, Tori B. Powell", "title": "Election night in America: 2024 presidential election results - CNN", "description": "Vice President Kamala Harris and former President Donald Trump each need at least 270 electoral votes to win the presidency. Follow here for 2024 presidential election updates, results, analysis and more.", "url": "https://www.cnn.com/politics/live-news/2024-election-trump-harris/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/trump-harris-wide-thumb.png?c=16x9&q=w_800,c_fill", "publishedAt": "2024-11-06T00:39:00Z", "content": "Republican vice-presidential nominee JD Vance cast his ballot in-person this morning at his polling place in Cincinnati.\r\nThe senator appeared in good spirits as he arrived at St. Anthony of Padua Ch… [+2420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan", "title": "Trump’s media stock is halted for extremely volatile trading as America goes to the polls - CNN", "description": "Former President Donald Trump’s social media company was temporarily halted – twice – after a sudden and precipitous plunge on Election Day following a massive surge.", "url": "https://www.cnn.com/2024/11/05/investing/trump-stock-election-truth-social/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2182946223.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-11-05T21:10:00Z", "content": "Former President Donald Trumps social media company was temporarily halted twice after a sudden and precipitous plunge on Election Day following a massive surge.\r\nShares of Truth Social owner Trump M… [+3160 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Patrick Wingrove, Bhanvi Satija", "title": "Americans hungry for weight-loss drugs grapple with supply and insurance hurdles - Reuters", "description": "Americans are still eagerly seeking prescriptions for Eli Lilly and Novo Nordisk's weight-loss and diabetes drugs but cannot always fill them because of supply issues and insurance hurdles, according to their doctors.", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/americans-hungry-weight-loss-drugs-grapple-with-supply-insurance-hurdles-2024-11-04/", "urlToImage": "https://www.reuters.com/resizer/v2/A4F33A4MSFOV3KR7RWQFKVINX4.jpg?auth=2f4779ceedaf07108dfa706a0cfd653b3d180cbceb564d276c85d119dfc1d8d6&height=1005&width=1920&quality=80&smart=true", "publishedAt": "2024-11-04T22:02:07Z", "content": null}]}