{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein", "title": "Student loan forgiveness applications now open through beta mode website, Biden administration says - CNN", "description": "The Biden administration has opened the application process for Americans seeking student debt relief in a beta period starting Friday evening, officials told CNN, allowing applicants to begin signing up before the website is formally unveiled later this mont…", "url": "https://www.cnn.com/2022/10/14/politics/student-loan-forgiveness-beta-site/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220824142046-biden-student-loan-announcement-0824.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-15T02:59:00Z", "content": "The Biden administration has opened the application process for Americans seeking student debt relief in a beta period starting Friday evening, officials told CNN, allowing applicants to begin signin… [+4291 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Bruce Haring", "title": "Beck Bows Out Of Arcade Fire North American Tour - Deadline", "description": "Beck has become the latest artist to drop off the Arcade Fire tour. Today, he withdrew as the opening act after appearing in that capacity on the group’s European leg. His decision comes just before the start of Arcade Fire’s North American tour, which begins…", "url": "https://deadline.com/2022/10/beck-bows-out-arcade-fire-north-american-tour-1235145784/", "urlToImage": "https://deadline.com/wp-content/uploads/2022/10/GettyImages-1412161696.jpg?w=1024", "publishedAt": "2022-10-15T00:39:00Z", "content": "Beck has become the latest artist to drop off the Arcade Fire tour. Today, he withdrew as the opening act after appearing in that capacity on the group’s European leg. \r\nHis decision comes just befor… [+556 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "#StudioGhibli opens theme park - CGTN America", "description": "The long-awaited Studio Ghibli theme park is finally here, based on the famed Japanese animation. But don’t expect rollercoasters or large rides. A fanciful ...", "url": "https://www.youtube.com/watch?v=Vsc5SM_KoXU", "urlToImage": "https://i.ytimg.com/vi/Vsc5SM_KoXU/maxresdefault.jpg", "publishedAt": "2022-10-14T23:12:04Z", "content": null}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sophie Mann", "title": "Woman 'sandwiched between two obese people' on American Airlines flight is rebuffed by airline - Daily Mail", "description": "An Australian-American conservative political commentator found herself 'sandwiched' between two supremely overweight passengers on a recent American Airlines flight.", "url": "https://www.dailymail.co.uk/news/article-11317533/Woman-sandwiched-two-obese-people-American-Airlines-flight-rebuffed-airline.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/15/04/63494097-0-image-a-9_1665804645363.jpg", "publishedAt": "2022-10-14T23:03:19Z", "content": "A passenger found herself 'sandwiched' between two supremely overweight passengers on a recent American Airlines flight.\r\nSydney Watson, an Australian-American conservative political commentator, doc… [+4042 chars]"}, {"source": {"id": null, "name": "Recording Academy | Grammys"}, "author": null, "title": "Songbook: How Bruce Springsteen's Portraits Of America Became Sounds Of Hope During Confusing Times - The GRAMMYs", "description": "In this edition of Songbook, GRAMMY.com explores how Bruce Springsteen's empathy for his working-class characters evolved alongside his own commercial success. The Boss is the subject of a new exhibit at the GRAMMY Museum, Bruce Springsteen Live!", "url": "https://www.grammy.com/news/bruce-springsteen-songbook-how-the-boss-gave-hope-to-characters-in-conflict", "urlToImage": "https://i8.amplience.net/i/naras/Songbook_Bruce Springsteen_Hero_1644x925_Logo.jpg?w=821&sm=c", "publishedAt": "2022-10-14T19:10:56Z", "content": "On Aug. 28, 1963, Dr. Martin Luther King Jr. stood on the steps of the Lincoln Memorial in Washington, D.C., and declared in his landmark \"I Have A Dream\" speech, \"Now is the time to lift our nation … [+5844 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Anwaya Mane", "title": "From BTS to BLACKPINK: Complete list of 2022 AMAs nominees in the newly introduced Favorite K-pop Artist category - Sportskeeda", "description": "For the first time, the American Music Awards (AMAs) recognized the growing influence of Korean popular music and created a Favorite K-pop Artist category that boasts some of the greatest names in the", "url": "https://www.sportskeeda.com/pop-culture/news-from-bts-blackpink-complete-list-2022-amas-nominees-newly-introduced-favorite-k-pop-artist-category", "urlToImage": "https://staticc.sportskeeda.com/editor/2022/10/c5ca0-16657378008042-1920.jpg", "publishedAt": "2022-10-14T16:54:52Z", "content": "For the first time, the American Music Awards (AMAs) recognized the growing influence of Korean popular music and created a Favorite K-pop Artist category that boasts some of the greatest names in th… [+3715 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Feinberg", "title": "Trump will now be forced to testify after bombshell Jan 6 hearing lifts lid on Capitol riot links - The Independent", "description": "‘He is required to answer to those millions of Americans who votes he wanted to throw out as part of his scheme to remain in power and whatever is underway to ensure this accountability under law’", "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-january-6-committee-subpoena-b2202429.html", "urlToImage": "https://static.independent.co.uk/2022/10/14/07/newFile.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-14T13:49:09Z", "content": "The House 6 January select committee on Thursday voted to issue a subpoena demanding testimony from the man whose actions have been at the centre of the nine-member panels investigation over the last… [+9365 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "MLim", "title": "SEVENTEEN Announces Additional Dates And Cities For 2022 World Tour “BE THE SUN” - soompi", "description": "SEVENTEEN has confirmed additional dates and cities for their Asian tour! The day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13, SEVENTEEN gave a pleasant surprise to their fans by releasi…", "url": "https://www.soompi.com/article/1549677wpp/seventeen-announces-additional-dates-and-cities-for-2022-world-tour-be-the-sun", "urlToImage": "https://6.viki.io/image/e080978d62e44f089b59633aa53b8eaf/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-10-14T08:37:26Z", "content": "SEVENTEEN has confirmed additional dates and cities for their Asian tour!\r\nThe day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13… [+504 chars]"}]}