{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TOI Contributor", "title": "India@100 could be as rich as America and China, says Mukesh Ambani - Economic Times", "description": "Destiny and Drive are making the 21st centurys favourite nation ready for a great leap forward. India stands at the doorstep of prosperity that is both significant and inclusive, and of delivering all-round human development through the democratic route.", "url": "https://economictimes.indiatimes.com/news/economy/policy/india100-could-be-as-rich-as-us-china-says-mukesh-ambani/articleshow/84700764.cms", "urlToImage": "https://img.etimg.com/thumb/msid-84697152,width-1070,height-580,imgsize-65752,overlay-economictimes/photo.jpg", "publishedAt": "2021-07-24T06:08:00Z", "content": "5 ideas to ensure equitable, sustainable prosperity for allIndia and the world changed dramatically at the beginning of the 1990s. Communist Soviet Union collapsed. The Cold War ended. And India emba… [+8244 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Novel therapeutic agent could be effective for treating cancers with certain gene mutations - News-Medical.Net", "description": "Mount Sinai researchers have developed a therapeutic agent that shows high effectiveness in vitro at disrupting a biological pathway that helps cancer survive, according to a paper published in Cancer Discovery, a journal of the American Association for Cance…", "url": "https://www.news-medical.net/news/20210723/Novel-therapeutic-agent-could-be-effective-for-treating-cancers-with-certain-gene-mutations.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Hospital-620x480.jpg", "publishedAt": "2021-07-24T02:49:00Z", "content": "Mount Sinai researchers have developed a therapeutic agent that shows high effectiveness in vitro at disrupting a biological pathway that helps cancer survive, according to a paper published in Cance… [+1943 chars]"}]}