{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Global study demonstrates some benefits of flu vaccine in people with heart failure - News-Medical.Net", "description": "People with heart failure who received an annual flu shot had lower rates of pneumonia and hospitalization on a year-round basis and a reduction in major cardiovascular events during peak flu season, in a study presented at the American College of Cardiology'…", "url": "https://www.news-medical.net/news/20220403/Global-study-demonstrates-some-benefits-of-flu-vaccine-in-people-with-heart-failure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-04-03T19:40:00Z", "content": "People with heart failure who received an annual flu shot had lower rates of pneumonia and hospitalization on a year-round basis and a reduction in major cardiovascular events during peak flu season,… [+6010 chars]"}, {"source": {"id": null, "name": "Chess.com"}, "author": "Carsten Hansen", "title": "Quick Draw On Sunday, Tiebreaker Next: 2022 FIDE Grand Prix Berlin Leg 3, Final Day 2 - Chess.com", "description": "American GMs Hikaru Nakamura and Wesley So also drew their second game in the final of the third and final leg of the 2022 FIDE Grand Prix. The players quickly repeated moves in a line in the Berlin Ruy Lopez which they have played several times before. The f…", "url": "https://www.chess.com/news/view/2022-fide-grand-prix-berlin-leg-3-final-day-2", "urlToImage": "https://images.chesscomfiles.com/uploads/v1/news/1061715.bda0e017.5000x5000o.5990f5c650f7.jpeg", "publishedAt": "2022-04-03T18:19:00Z", "content": "American GMs Hikaru Nakamura and Wesley So also drew their second game in the final of the third and final leg of the 2022 FIDE Grand Prix. The players quickly repeated moves in a line in the Berlin … [+2082 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "AGENCY", "title": "K-drama queen Gong Hyo-jin confirms she is dating singer Kevin Oh - The Star Online", "description": "South Korean actress Gong and Korean-American singer Oh said they would be tying the knot some time in 2022.", "url": "https://www.thestar.com.my/lifestyle/entertainment/2022/04/03/k-drama-queen-gong-hyo-jin-confirms-she-is-dating-singer-kevin-oh", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/04/03/1537860.jpg", "publishedAt": "2022-04-03T13:45:00Z", "content": "South Korean actress Gong Hyo-jin and Korean-American singer Kevin Oh have confirmed they are dating, although Gong did not say if marriage was on the cards.\r\nThey were reacting to a report by South … [+1179 chars]"}, {"source": {"id": null, "name": "OtakuKart"}, "author": "Shreya Patnaik", "title": "Forrest Gump Filming Locations: All About The Shooting Locations - OtakuKart", "description": "The 1994 American comedy-drama starring Tom Hanks remains iconic to this day. Forrest Gump is one of the most quoted movies of all time. It has the most epic dialogues, including \"Life is like a box of chocolate, you never know what you gonna get\". And we hea…", "url": "https://otakukart.com/forrest-gump-filming-locations-all-about-the-shooting-locations/", "urlToImage": "https://otakukart.com/wp-content/uploads/2022/04/Forrest-Gump-4.jpg", "publishedAt": "2022-04-03T11:07:34Z", "content": "The 1994 American comedy-drama starring Tom Hanks remains iconic to this day. Forrest Gump is one of the most quoted movies of all time. It has the most epic dialogues, including “Life is like a box … [+4322 chars]"}]}