{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Cassie Carpenter, Christine Rendon", "title": "America's Got Talent alum and Tyler Perry collaborator Zuri Craig dies at age 44 - Daily Mail", "description": "His family announced his heartbreaking death in an Instagram post shared Sunday. 'It is with profound sadness that we announce the transition of our beloved son, brother and friend, Zuri Craig.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-11346413/Americas-Got-Talent-alum-Tyler-Perry-collaborator-Zuri-Craig-dies-age-44.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/10/23/22/63771033-0-image-a-179_1666559301869.jpg", "publishedAt": "2022-10-23T21:20:07Z", "content": "America's Got Talent alum Zuri Craig, who acted in several Tyler Perry plays, passed away at age 44 from undisclosed causes on Friday night.\r\n'It is with profound sadness that we announce the transit… [+2522 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "US-PH enforcers tackle cybersecurity issues - The Manila Times", "description": "The US Embassy's Office of International Narcotics and Law Enforcement Affairs (INL) gathered Filipino and American security and justice sector representatives to exchange...", "url": "https://www.manilatimes.net/2022/10/24/expats-diplomats/us-ph-enforcers-tackle-cybersecurity-issues/1863416", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/10/23/119750.jpg", "publishedAt": "2022-10-23T15:04:44Z", "content": "The US Embassy's Office of International Narcotics and Law Enforcement Affairs (INL) gathered Filipino and American security and justice sector representatives to exchange best practices and share kn… [+2664 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Ryan De Villiers", "title": "Stumbling across the Firebird cafe built around a 1981 Pontiac Firebird - Carmag South Africa", "description": "Although Cape Town is dominated by euro cars and the occasional Italian supercar, it’s a breath of fresh air to see a pure-blooded American muscle car. Home to one iconic 80’s American muscle car is the Firebird cafe in Observatory.", "url": "https://www.carmag.co.za/news/firebird-cafe-cafe-1981-firebird/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/10/Firebird-cafe-edit-5.jpg", "publishedAt": "2022-10-23T07:04:41Z", "content": "FordMustangAlthough Cape Town is dominated by euro cars and the occasional Italian supercar, its a breath of fresh air to see a pure-blooded American muscle car. Home to one iconic 80s American muscl… [+1794 chars]"}]}