{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Lasisi Godwin", "title": "NASA plans to use Artemis 1 to send Americans back to the Moon’s surface. - TDPel Media", "description": "The first NASA Moon rocket in fifty years will launch on August 29 from Florida's Kennedy Space Center. NASA is preparing the launch of the unmanned Space", "url": "https://tdpelmedia.com/nasa-plans-to-use-artemis-1-to-send-americans-back-to-the-moons-surface", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/27/20/61788699-0-image-a-7_1661627868782.jpg", "publishedAt": "2022-08-27T20:37:33Z", "content": "The first NASA Moon rocket in fifty years will launch on August 29 from Florida’s Kennedy Space Center.\r\nNASA is preparing the launch of the unmanned Space Launch System rocket and Orion capsule as p… [+6970 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Paul Farrell", "title": "NASA prepares to launch Artemis 1 as it prepares to return Americans to the surface of the Moon - Daily Mail", "description": "The first Moon rocket launched by NASA since 1973 is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast.", "url": "https://www.dailymail.co.uk/news/article-11152277/NASA-prepares-launch-Artemis-1-prepares-return-Americans-surface-Moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/27/20/61788699-0-image-a-7_1661627868782.jpg", "publishedAt": "2022-08-27T19:43:39Z", "content": "The first Moon rocket launched by NASA in five decades is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast. \r\nNASA is preparing the launch of the unmanned S… [+7163 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Rachel Sharp", "title": "Ted Cruz mocked for blasting ‘slacker baristas’ after Biden scraps some student loan debt - The Independent", "description": "Democratic Senator Bernie Sanders posted a video on Twitter educating the Texas senator about some of the Americans – such as nurses – struggling because of crippling student loan debt", "url": "https://www.independent.co.uk/news/world/americas/us-politics/ted-cruz-baristas-student-loan-debt-b2154228.html", "urlToImage": "https://static.independent.co.uk/2022/08/27/01/GettyImages-1242120809.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-08-27T19:08:13Z", "content": "Texas Senator Ted Cruz has been mocked for hitting out at so-called slacker baristas after President Joe Biden cancelled a chunk of student loan debt for millions of borrowers.\r\nThe Republican lawmak… [+3832 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Play A Key Role In Countering China: US Navy Chief - NDTV", "description": "US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in the future, playing a key role in countering China.", "url": "https://www.ndtv.com/india-news/india-to-play-a-key-role-in-countering-china-us-navy-chief-3291871", "urlToImage": "https://i.ndtvimg.com/i/2018-04/india-china-flags_650x400_61523324939.jpg", "publishedAt": "2022-08-27T13:46:39Z", "content": "India presents China with a two-front problem, said the US Navy Chief (Representational)\r\nTokyo: US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in … [+3390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Perseverance Rover Discovers Rocks Shaped By Water On Mars - NDTV", "description": "American Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet that may have life-related traces.", "url": "https://www.ndtv.com/world-news/nasas-perseverance-rover-discovers-rocks-shaped-by-water-on-mars-3291878", "urlToImage": "https://c.ndtvimg.com/2022-08/uumg5tto_jezero-crater_625x300_27_August_22.jpg", "publishedAt": "2022-08-27T11:22:22Z", "content": "Scientists believe that the Martian surface was once filled with water.\r\nAmerican Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet t… [+2171 chars]"}, {"source": {"id": null, "name": "Dominicantoday.com"}, "author": "Merit Designs Consulting Group, 2006-2020", "title": "“Vaccinated mosquitoes” used to combat dengue fever - Dominican Today", "description": "<p>This experiment was unveiled at yesterday’s commemoration of International Dengue Day. The Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addition to measures such as the elimination of mosquito breedi…", "url": "https://dominicantoday.com/dr/local/2022/08/27/vaccinated-mosquitoes-used-to-combat-dengue-fever/", "urlToImage": "https://dominicantoday.com/wp-content/uploads/2022/08/14_El-Mundo_27_1p01.jpg", "publishedAt": "2022-08-27T10:11:00Z", "content": "This experiment was unveiled at yesterday’s commemoration of International Dengue Day.\r\nThe Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addit… [+2024 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Karyn Maughan and Jan Gerber", "title": "Public Protector paid 'fugitive from justice' Ngobeni R87k for articles bashing Mkhwebane foes - News24", "description": "Paul Ngobeni was disbarred in several states in the US and, after being charged with several counts of larceny, forgery and practising while not an attorney in 2007, he went on the run from American law enforcement agencies.", "url": "https://www.news24.com/news24/southafrica/politics/parliament/public-protector-paid-fugitive-from-justice-ngobeni-r87k-for-articles-bashing-mkhwebane-foes-20220827", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3752/8caecffd900f407b9d16cbe797d204ce.jpeg", "publishedAt": "2022-08-27T00:00:55Z", "content": "\"Fugitive from justice\" Paul Ngobeni was credited for suggesting Public Protector Busisiwe Mkhwebane sue the government for \"insufficient funding\", while he collected massive pay cheques from her off… [+468 chars]"}]}