{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Saheli Roy Choudhury", "title": "Kamala Harris says the U.S. is 'singularly focused' on evacuating Americans and Afghan allies - CNBC", "description": "Harris spoke to reporters during a joint press conference with Singapore Prime Minister Lee Hsien Loong following an earlier meeting.", "url": "https://www.cnbc.com/2021/08/23/kamala-harris-lee-hsien-loong-singapore-press-conference.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106931499-1629694088520-gettyimages-1234822952-AFP_9LH964.jpeg?v=1629693981", "publishedAt": "2021-08-23T06:20:32Z", "content": "US Vice President Kamala Harris (L) is welcomed by Singapore's Prime Minister Lee Hsien Loong (R) at the Istana in Singapore, on August 23, 2021.\r\nSINGAPORE The United States' primary focus in Afghan… [+4655 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "Palesa Manaleng", "title": "SA wins men's 4X100m gold in record time at World Athletics U20 Champs - Eyewitness News", "description": "The SA quartet of Mihlali Xhotyeni, Sinesipho Dambile, Letlhogonolo Moleyane and Benjamin Richardson, dominated in the final in 38.51 seconds, shattering the previous global U20 mark of 38.62 which had been set by the USA at the Pan American Championships in …", "url": "https://ewn.co.za/2021/08/23/sa-wins-men-s-4x100m-gold-in-record-time-at-world-athletics-u20-champs", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/xjkcletppypibiginlmo", "publishedAt": "2021-08-23T03:17:45Z", "content": "The SA quartet of Mihlali Xhotyeni, Sinesipho Dambile, Letlhogonolo Moleyane and Benjamin Richardson, dominated in the final in 38.51 seconds, shattering the previous global U20 mark of 38.62 which h… [+3397 chars]"}, {"source": {"id": null, "name": "Autocar.co.nz"}, "author": null, "title": "New Honda Integra to be developed in Japan, won't be electric - NZ Autocar", "description": "With one single image and one line of teaser text, Honda’s American arm Acura recently confirmed the return of the Integra nameplate after a lengthy hiatus; to the fanfare of Japanese car fans around the world.", "url": "https://www.autocar.co.nz/autocar-news-app/new-honda-integra-to-be-developed-in-japan-won-t-be-electric", "urlToImage": "https://www.autocar.co.nz/_News/01-Random/integra5.jpg", "publishedAt": "2021-08-23T02:59:57Z", "content": "With one single image and one line of teaser text, Hondas American arm Acura recently confirmed the return of the Integra nameplate after a lengthy hiatus; to the fanfare of Japanese car fans around … [+1695 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Francesca Washtell", "title": "American buyers 'are looking to swoop' on Sainsbury's, analysts say - Daily Mail", "description": "US buyout group Apollo is thought to be among firms eyeing up Sainsbury's, Britain's second-largest grocer. City analysts believe it would be a natural next target after the sale of Asda last year.", "url": "https://www.dailymail.co.uk/news/article-9917595/American-buyers-looking-swoop-Sainsburys-analysts-say.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/23/01/46978921-0-image-a-4_1629677206605.jpg", "publishedAt": "2021-08-23T00:12:52Z", "content": "Sainsbury's could be next on the shopping list for private equity predators as the £7billion Morrisons deal puts the spotlight on UK supermarkets.\r\nMajor American buyout group Apollo is thought to be… [+3423 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "DANSON CHEONG", "title": "As the US withdraws from Afghanistan, China is left to deal with the fallout - The Straits Times", "description": "Beijing is in the difficult position of having to deal with an unstable Afghanistan that could lead to conflict in its backyard, as well as an America that is no longer encumbered by an intractable war.. Read more at straitstimes.com.", "url": "https://www.straitstimes.com/opinion/as-the-us-withdraws-from-afghanistan-china-is-left-to-deal-with-the-fallout", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/08/23/yu-us-afghan-leave0823.jpg?itok=47_QGXyB", "publishedAt": "2021-08-22T21:00:00Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Don’t Miss: Rare Seasonal “Blue Moon” Rises Tonight - SciTechDaily", "description": "This month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. The name was given to the Moon because the large sturgeon fish of the Great Lakes, and other major …", "url": "https://scitechdaily.com/dont-miss-rare-seasonal-blue-moon-rises-tonight/", "urlToImage": "https://scitechdaily.com/images/Blue-Moon.jpg", "publishedAt": "2021-08-22T18:01:45Z", "content": "ByLance D. Davis, NASAAugust 22, 2021\r\nThis month we’ll get to see a Full Moon on August 22, 2021, known by some early Native American tribes of the northeastern United States, as the Sturgeon Moon. … [+2883 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Lindsey Bahr", "title": "Free Guy holds on to top spot at U.S. box office for second weekend - CP24 Toronto's Breaking News", "description": "Four new films with major stars from Hugh Jackman to Michael Keaton opened in North American movie theaters this weekend and only the one with animated puppies fared well. But it wasn't enough to beat out Ryan Reynolds' action-comedy “Free Guy,” which topped …", "url": "https://www.cp24.com/entertainment-news/free-guy-holds-on-to-top-spot-at-u-s-box-office-for-second-weekend-1.5556856", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5556857.1629648776!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-08-22T16:12:54Z", "content": "Four new films with major stars from Hugh Jackman to Michael Keaton opened in North American movie theaters this weekend and only the one with animated puppies fared well. But it wasn't enough to bea… [+4513 chars]"}, {"source": {"id": null, "name": "Persiadigest.com"}, "author": "Laurence Malcom", "title": "Boeing Starliner returns to the factory instead of taking off to space - Persia Digest", "description": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it's not about to end. The second", "url": "https://persiadigest.com/boeing-starliner-returns-to-the-factory-instead-of-taking-off-to-space/", "urlToImage": null, "publishedAt": "2021-08-21T05:44:04Z", "content": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it’s not about to end. The second unmanned test flight of its Starliner space cap… [+2715 chars]"}]}