{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Entertainment Desk", "title": "Ram Charan makes a splash on Good Morning America. See pics - Hindustan Times", "description": "Telugu star Ram Charan was in New York as a guest on Good Morning America. He has been promoting his film RRR ahead of the Oscars.", "url": "https://www.hindustantimes.com/entertainment/telugu-cinema/ram-charan-makes-a-splash-on-good-morning-america-see-pics-101677133371930.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2023/02/23/1600x900/ram_charan_good_morning_america_1677133367553_1677133367753_1677133367753.jpg", "publishedAt": "2023-02-23T06:37:45Z", "content": "Actor Ram Charan, who is in the US ahead of the Academy Awards 2023, was invited to be part of popular talk show Good Morning America in New York. As Ram Charan arrived for the show, he was mobbed by… [+2041 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jamie McKinnell", "title": "Scott White pleads guilty to 1988 manslaughter of Scott Johnson - ABC News", "description": "After having a murder conviction quashed on appeal, Scott White pleads guilty to manslaughter more than three decades since American mathematician Scott Johnson's body was found at the base of cliffs at a Sydney gay beat.", "url": "https://www.abc.net.au/news/2023-02-23/scott-white-pleads-guilty-manslaughter-scott-johson/102012984", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/54b0c6feaf10446ea57193a841d4cb66?impolicy=wcms_crop_resize&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2023-02-22T23:59:33Z", "content": "The man arrested over the 1988 death of American mathematician Scott Johnson in Sydney has pleaded guilty to manslaughter, after having a murder conviction quashed on appeal and previously maintainin… [+5539 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Elana Gotkine", "title": "Certain genetic variant in Alzheimer's disease linked to African ancestry - Medical Xpress", "description": "For individuals of African ancestry, the APOE ε3 R145C missense variant is associated with an increased risk for Alzheimer disease (AD), according to a study published in the Feb. 21 issue of the Journal of the American Medical Association.", "url": "https://medicalxpress.com/news/2023-02-genetic-variant-alzheimer-disease-linked.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/certain-genetic-varian.jpg", "publishedAt": "2023-02-22T20:10:01Z", "content": "For individuals of African ancestry, the APOE 3 R145C missense variant is associated with an increased risk for Alzheimer disease (AD), according to a study published in the Feb. 21 issue of the Jour… [+2244 chars]"}, {"source": {"id": null, "name": "Electrek"}, "author": "Peter Johnson", "title": "Stellantis says it's ready for North American EV transformation after EU success, starting with Ram - Electrek", "description": "After releasing an unexpectedly strong earnings report Wednesday on the heels of climbing EV momentum, Stellantis says it’s ready to...", "url": "https://electrek.co/2023/02/22/stellantis-says-its-ready-for-north-american-ev-transformation/", "urlToImage": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2023/02/Stellantis-North-American-EV.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1", "publishedAt": "2023-02-22T20:03:00Z", "content": "After releasing an unexpectedly strong earnings report Wednesday on the heels of climbing EV momentum, Stellantis says its ready to do the same in North America, starting with the Ram and Jeep brands… [+2966 chars]"}, {"source": {"id": null, "name": "MINING.com"}, "author": null, "title": "Teck's mining breakup sets the scene for copper takeovers - MINING.COM - MINING.com", "description": "Teck owns four copper mines in South America and Canada that produced 270,000 metric tons last year.", "url": "https://www.mining.com/web/tecks-mining-breakup-sets-the-scene-for-copper-takeovers/", "urlToImage": "https://www.mining.com/wp-content/uploads/2018/12/Operations-Quebrada-BLanca-Hero-1280x500.jpg", "publishedAt": "2023-02-21T21:18:04Z", "content": "The move almost certainly makes Teck Metals a takeover target when big mining companies are on the hunt for copper as demand for the wiring metal accelerates and a global shortfall looms. BHP Group, … [+1851 chars]"}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Mustapha Iderawumi", "title": "RSA Signs Partnership with ATLAS Space Operations Inc for Satellite Ground Infrastructure - Space in Africa", "description": "The Rwanda Space Agency (RSA) and ATLAS Space Operations Inc., a leading American company in satellite communication ground infrastructure, have announced", "url": "https://africanews.space/rsa-signs-partnership-with-atlas-space-operations-inc-for-satellite-ground-infrastructure/", "urlToImage": "https://africanews.space/wp-content/uploads/2023/02/Image-21-02-2023-at-20.52-scaled.jpeg", "publishedAt": "2023-02-21T20:06:40Z", "content": "The Rwanda Space Agency (RSA) and ATLAS Space Operations Inc., a leading American company in satellite communication ground infrastructure, have announced a strategic partnership to utilise a telepor… [+4022 chars]"}]}