{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "MLB.com"}, "author": "Daniel Kramer", "title": "Astros look to close out ALCS at Yankee Stadium - MLB.com", "description": "NEW YORK -- The victory in Game 2 that put the Astros in a 2-0 lead in the American League Championship Series guaranteed Minute Maid Park will see another postseason game this year. In their eyes, however, they hope that’s not until the World Series.\n• ALCS …", "url": "https://www.mlb.com/news/astros-look-to-close-out-alcs-at-yankee-stadium", "urlToImage": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/rlh73fty1bwqh3udoknb.jpg", "publishedAt": "2022-10-22T00:34:58Z", "content": "NEW YORK -- The victory in Game 2 that put the Astros in a 2-0 lead in the American League Championship Series guaranteed Minute Maid Park will see another postseason game this year. In their eyes, h… [+4939 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica", "title": "Stocks soar on hopes that Fed will slow rate hikes - CNN", "description": "A disastrous earnings report from Snap and less than inspiring results from Dow components American Express and Verizon weren't enough to keep the Wall Street bulls at bay Friday. Stocks surged on hopes that the Federal Reserve may soon come to the rescue by …", "url": "https://www.cnn.com/2022/10/21/investing/dow-stock-market-today/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221018154432-nyse-recession.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-21T20:09:00Z", "content": "A disastrous earnings report from Snap and less than inspiring results from Dow components American Express and Verizon werent enough to keep the Wall Street bulls at bay Friday. Stocks surged on hop… [+2596 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Disease has influenced wolf colors across North America - Earth.com", "description": "Disease has influenced wolf colors across North America • Earth.com", "url": "https://www.earth.com/news/disease-has-influenced-wolf-colors-across-north-america/", "urlToImage": "https://cff2.earth.com/uploads/2022/10/21050424/Wolf-scaled.jpg", "publishedAt": "2022-10-21T11:14:31Z", "content": "Scientists have long been puzzled by the fact that, across the North American continent, wolves tend to change their coat color: while in the Arctic Canada and other northern areas wolves tend to be … [+2368 chars]"}, {"source": {"id": null, "name": "Usembassy.gov"}, "author": "U.S. Embassy Manila", "title": "U.S., Philippine Law Enforcement Personnel Meet to Address Cybersecurity Threats - US Embassy in Philippines", "description": "Manila, October 21, 2022—The U.S. Embassy’s Office of International Narcotics and Law Enforcement Affairs (INL) recently gathered Filipino and American security and justice sector representatives to exchange best practices and share knowledge on addressing cy…", "url": "https://ph.usembassy.gov/u-s-philippine-law-enforcement-personnel-meet-to-address-cybersecurity-threats/", "urlToImage": "https://uploads.mwp.mprod.getusinfo.com/uploads/sites/24/2022/10/10-21-2022-PR-U.S.-Philippine-Law-Enforcement-Personnel-Meet-to-Address-Cybersecurity-Threats-resized.png", "publishedAt": "2022-10-21T02:03:42Z", "content": "To mark U.S. National Cybersecurity Awareness Month, Filipino law enforcement personnel meet at a roundtable hosted by INL to exchange knowledge and best practices on responding to cyber threats.\r\nMa… [+2888 chars]"}]}