{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, Natasha Bertrand and Kylie Atwood, CNN", "title": "Biden's national security adviser urges Americans to leave Ukraine within 48 hours, warns a Russian attack could begin with airstrikes - CNN", "description": "US national security adviser Jake Sullivan warned Americans in Ukraine on Friday to leave within one to two days, spelling out what a Russian attack on the country could look like -- and that civilians could die.", "url": "https://www.cnn.com/2022/02/11/politics/ukraine-russia-washington-white-house/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207152929-01-jake-sullivan-1207-super-tease.jpg", "publishedAt": "2022-02-11T20:39:00Z", "content": "(CNN)US national security adviser Jake Sullivan warned Americans in Ukraine on Friday to leave within one to two days, spelling out what a Russian attack on the country could look like -- and that ci… [+7679 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "American truckers distance from Canada protests - POLITICO - POLITICO", "description": "The Canadian truck protests started over vaccine mandates. But the trucking industry in the U.S. is more concerned about things like where to park their rigs.", "url": "https://www.politico.com/news/2022/02/11/what-u-s-truckers-really-want-a-place-to-sleep-00008188", "urlToImage": "https://static.politico.com/76/9e/10ff7e014d1fbf77a36d53e5a37f/https-delivery.gettyimages.com/downloads/1236373132", "publishedAt": "2022-02-11T19:00:00Z", "content": "Protestors block traffic at the Ambassador Bridge, linking Windsor, Ontario and Detroit on Wednesday.\r\n|\r\nNicole Osborne/The Canadian Press via AP\r\nThe U.S. Teamsters union issued a statement Thursda… [+4396 chars]"}, {"source": {"id": null, "name": "Newshub"}, "author": null, "title": "Fears of imminent invasion as Russia amasses more troops on Ukraine border - Newshub", "description": "Americans in Ukraine are being advised to leave.", "url": "https://www.newshub.co.nz/home/world/2022/02/fears-of-imminent-invasion-as-russia-amasses-more-troops-on-ukraine-border.html", "urlToImage": "https://www.newshub.co.nz/home/world/2022/02/fears-of-imminent-invasion-as-russia-amasses-more-troops-on-ukraine-border/_jcr_content/par/image.dynimg.1280.q75.jpg/v1644603532041/GettyImages-1238355204-ukraine-military-1120.jpg", "publishedAt": "2022-02-11T18:18:55Z", "content": "In his starkest warning yet to Americans in Ukraine to get out now, President Joe Biden said he would not send troops to rescue US citizens in the event of a Russian assault.\r\n\"Things could go crazy … [+4907 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Alex Horton, Amy Cheng, Karen DeYoung", "title": "NATO warns of danger in Russia-Ukraine crisis, Biden tells Americans to leave now - The Washington Post", "description": "As diplomacy between Russia and the West remains at an impasse amid major Moscow-led military exercises, President Biden warned that “things could go crazy, quickly.\"", "url": "https://www.washingtonpost.com/world/2022/02/11/ukraine-russia-putin-nato-biden/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HF4Q5HULHMI6ZA4PBT67NHGOHQ.jpg&w=1440", "publishedAt": "2022-02-11T16:36:23Z", "content": "The significant escalation in the U.S. warning came amid reports of new intelligence, and evidence on the ground, over the last several days indicating that Russia is now fully prepared to launch an … [+7693 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "The Associated Press", "title": "Senators claim CIA has secret program that collects American data - CNBC", "description": "While neither the agency nor lawmakers would disclose specifics about the data, the senators alleged the CIA had long hidden details about the program from the public and Congress.", "url": "https://www.cnbc.com/2022/02/11/senators-claim-cia-has-secret-program-that-collects-american-data.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/105886720-1556758152442gettyimages-635268902.jpeg?v=1644596697", "publishedAt": "2022-02-11T16:32:07Z", "content": "The CIA has a secret, undisclosed data repository that includes information collected about Americans, two Democrats on the Senate Intelligence Committee said. While neither the agency nor lawmakers … [+4714 chars]"}, {"source": {"id": null, "name": "American Action Forum"}, "author": null, "title": "January Consumer Price Inflation - AAF - American Action Forum", "description": "Already too many words have been written about yesterday’s Bureau of Labor Statistics (BLS) report on the January Consumer Price Index (CPI), but hey, it’s an era of inflation so too much of everything is evidently in order. Here goes. The top-line CPI rose a…", "url": "https://www.americanactionforum.org/daily-dish/january-consumer-price-inflation/", "urlToImage": "https://www.americanactionforum.org/wp-content/uploads/2017/07/DD9.png", "publishedAt": "2022-02-11T11:51:49Z", "content": "Already too many words have been written about yesterdays Bureau of Labor Statistics (BLS) report on the January Consumer Price Index (CPI), but hey, its an era of inflation so too much of everything… [+2444 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": "ESPN", "title": "'He's Ted Lasso' - Man United stars frustrated with Rangnick, Armas training - ESPN", "description": "Man United's sulking stars and a fictional American soccer coach -- ESPN's Insider Notebook has the latest from a turbulent time at Old Trafford.", "url": "https://www.espn.com.sg/football/manchester-united-engman_utd/story/4590418/hes-ted-lasso-man-united-stars-frustrated-with-rangnickarmas-training", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0210%2Fr972488_1296x729_16%2D9.jpg", "publishedAt": "2022-02-11T09:08:16Z", "content": "Manchester United's sulking stars and a fictional American soccer coach -- ESPN's Insider Notebook has the latest from a turbulent time at Old Trafford.\r\nJump to: Barcelona look to sort contract issu… [+8421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Things Could Go Crazy\": Joe Biden Asks Americans To Leave Ukraine Soon - NDTV", "description": "US President Joe Biden on Thursday urged American citizens to leave Ukraine immediately, and warned about potential major conflict with Moscow should US and Russian troops engage each other on the ground.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-joe-biden-asks-americans-to-leave-ukraine-soon-2761909", "urlToImage": "https://c.ndtvimg.com/2022-02/ijf447dg_joe-biden_625x300_11_February_22.jpg", "publishedAt": "2022-02-11T04:02:00Z", "content": "\"American citizens should leave now,\" Joe Biden said in an interview.\r\nWashington: US President Joe Biden urged Americans Thursday to immediately leave Ukraine, as Russia's live-fire drills and build… [+5198 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "'Things could go crazy quickly' - Biden tells Americans to leave Ukraine amid invasion fears - News24", "description": "US President Joe Biden has urged Americans to immediately leave Ukraine, as Russia's live-fire drills and build-up of troops around the ex-Soviet state deepened fears of an invasion.", "url": "https://www.news24.com/news24/world/news/things-could-go-crazy-quickly-biden-tells-americans-to-leave-ukraine-amid-invasion-fears-20220211", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1006/ac97ba22f1634fce9b3fe2f5533f98ff.jpg", "publishedAt": "2022-02-11T03:30:23Z", "content": "<ul><li>Americans in Ukraine must leave, warned US President Joe Biden.</li><li>He said that the US would not send troops to Ukraine.</li><li>Russia is engaged with live-fire drills in Belarus, and h… [+5933 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "France’s Nobel Winner For Co-Discovery Of HIV Virus Dies - Channels Television", "description": "French scientist Luc Montagnier, who won the Nobel prize for medicine for his co-discovery of the HIV virus that causes AIDS, has died aged 89, the mayor of the Paris suburb where he was hospitalised said Thursday. Montagnier died on Tuesday in the American H…", "url": "https://www.channelstv.com/2022/02/10/frances-nobel-winner-for-co-discovery-of-hiv-virus-dies/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2022/02/Luc-Montagnier.jpg", "publishedAt": "2022-02-10T21:13:14Z", "content": "In this file photo taken on February 12, 1997, AIDS co-discoverer professor Luc Montagnier gives a press conference in Paris.  Pierre BOUSSEL / AFP\r\nFrench scientist Luc Montagnier, who won the Nobel… [+3444 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Ford, Toyota halt production as anti-vaccine protesters block US-Canada border amid warnings of economic damage - ABC News", "description": "Car manufacturers Ford and Toyota halt production in Canada as anti-vaccine mandate protesters block the busiest North American trade route, with politicians warning the convoy could cause significant damage to the economy.", "url": "https://www.abc.net.au/news/2022-02-10/ford-toyota-halt-production-protesters-block-us-canada-border/100820532", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/25eb2798edebd22530ed17627c78ebd3?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=379&width=862&height=485", "publishedAt": "2022-02-10T05:50:29Z", "content": "Car manufacturers Ford and Toyota have halted production as anti-coronavirus mandate protesters blocked US-Canada border crossings that have prompted warnings from Washington and Ottawa of economic d… [+5156 chars]"}]}