{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Strawberry Moon 2022: When Will It Peak And Other Supermoon Dates - NDTV", "description": "American space agency NASA said that this will give people a chance to spot craters and mountains on the lunar surface using a good telescope..", "url": "https://www.ndtv.com/world-news/strawberry-moon-2022-when-will-it-peak-and-other-supermoon-dates-3063476", "urlToImage": "https://c.ndtvimg.com/2021-06/8nlq87k8_strawberry-moon-nasa_625x300_24_June_21.jpg", "publishedAt": "2022-06-14T01:38:00Z", "content": "This will be the first of the three summer supermoons.\r\nThe world is set to witness the June's full moon, known as Strawberry Moon, on June 14 (Tuesday). At 7.51am Eastern Daylight Time (5.22pm IST) … [+2208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "A male mastodon suffered a brutal injury before he died 13,200 years ago - CNN", "description": "A male mastodon died after a nasty fight with a rival about 13,200 years ago in what is now northeast Indiana. His tusks reveal how the 8-ton adult died and where he trekked across North America.", "url": "https://www.cnn.com/2022/06/13/world/mastodon-tusk-migration-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220613123114-01-buesching-mastodon-super-tease.jpg", "publishedAt": "2022-06-13T19:53:00Z", "content": "(CNN)A male mastodon died fighting with a rival during mating season about 13,200 years ago in what is now northeast Indiana. Now, his well-preserved fossil and tusks reveal not only how the 8-ton ad… [+3862 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Firm commits to carbon neutral, invests in solar energy - Guardian Nigeria", "description": "Nigeria’s consumer goods company, British American Tobacco (BAT) Nigeria, has restated its commitment to addressing climate change, environmental management issues, while ensuring robust corporate governance across its operations.", "url": "https://guardian.ng/property/firm-commits-to-carbon-neutral-invests-in-solar-energy/", "urlToImage": "https://guardian.ng/wp-content/uploads/2016/05/solar-energy.jpg", "publishedAt": "2022-06-13T03:43:00Z", "content": "Nigerias consumer goods company, British American Tobacco (BAT) Nigeria, has restated its commitment to addressing climate change, environmental management issues, while ensuring robust corporate gov… [+2433 chars]"}]}