{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Agence France-Presse", "title": "British socialite Ghislaine Maxwell convicted of sex trafficking - INQUIRER.net", "description": "NEW YORK - British socialite Ghislaine Maxwell was found guilty on Wednesday of recruiting and grooming young girls to be sexually abused by the late American financier Jeffrey Epstein.\r\n\r\nMaxwell", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2021/12/000_9VD2MN-620x456.jpg", "publishedAt": "2021-12-29T22:58:00Z", "content": "In this file photo taken on July 02, 2020 acting US Attorney for the Southern District of New York, Audrey Strauss, announces charges against Ghislaine Maxwell during a press conference in New York C… [+3326 chars]"}, {"source": {"id": null, "name": "NPR"}, "author": "NPR", "title": "Top science stories of 2021; Insuring nature against extreme storms : Here & Now - NPR", "description": "This year, scientists learned more about COVID-19 as the virus continued to circulate and mutate. The cicadas emerged from underground, and Perseverance landed on Mars. Laura Helmuth, editor in chief of Scientific American, talks about the year in science. An…", "url": "https://www.npr.org/2021/12/29/1068892912/top-science-stories-of-2021-insuring-nature-against-extreme-storms", "urlToImage": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "publishedAt": "2021-12-29T22:00:22Z", "content": "This year, scientists learned more about COVID-19 as the virus continued to circulate and mutate. The cicadas emerged from underground, and Perseverance landed on Mars. Laura Helmuth, editor in chief… [+449 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "The Canadian Press", "title": "Here’s what to know about CDC’s shorter COVID-19 isolation guidance - Global News", "description": "Health officials in the United States this week cut COVID-19 isolation restrictions for asymptomatic Americans from 10 to five days.", "url": "https://globalnews.ca/news/8478641/cdc-covid-19-isolation-period-explainer/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/12/CP114035741.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-12-29T21:26:54Z", "content": "Health officials in the United States this week cut COVID-19 isolation restrictions for asymptomatic Americans from 10 to five days, leading some Canadians to wonder whether similar recommendations c… [+6415 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "CDC backs corporate demands to force the sick back to work - WSWS", "description": "The Biden administration has made clear that preventing Americans from contracting, and dying from, COVID-19 is no longer a goal of public policy.", "url": "https://www.wsws.org/en/articles/2021/12/29/pers-d29.html", "urlToImage": "https://www.wsws.org/asset/e7e0ab25-4654-4fc6-b6f9-08481e90c0ad?rendition=image1280", "publishedAt": "2021-12-29T06:31:45Z", "content": "On Monday, the US Centers for Disease Control and Prevention (CDC) updated its guidelines for isolation and quarantine times, cutting the recommended isolation period for people infected with COVID-1… [+9339 chars]"}]}