{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Haley Britzky", "title": "Pentagon says it had 'an awareness gap' that led to failure to detect 3 Chinese balloons under Trump - CNN", "description": "The American military had a \"domain awareness gap\" that allowed three other suspected Chinese spy balloons to transit the continental United States undetected under the Trump administration, the Pentagon general responsible for providing air and missile defen…", "url": "https://www.cnn.com/2023/02/06/politics/pentagon-balloon-monday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230206135514-01-suspected-spy-balloon.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-06T21:53:00Z", "content": "The American military had a domain awareness gap that allowed three other suspected Chinese spy balloons to transit the continental United States undetected under the Trump administration, the Pentag… [+6109 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X", "title": "Ideal cardiovascular health can help people live longer: Study - Medical Xpress", "description": "Cardiovascular disease (CVD) is one of the greatest contributors to global deaths. According to the American Heart Association (AHA), ideal cardiovascular health (ICH) is determined by a combination of seven behavioral and medical factors, such as (i) no smok…", "url": "https://medicalxpress.com/news/2023-02-ideal-cardiovascular-health-people-longer.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/ideal-cardiovascular-h-1.jpg", "publishedAt": "2023-02-06T19:14:04Z", "content": "Independent associations of behavioral score and medical score with all-cause (A), cardiovascular disease (B), respiratory disease (C), and cancer mortality (D): pooled results of three prospective c… [+5137 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Balloon sighted over Latin America is from China, Beijing says - Al Jazeera English", "description": "Chinese foreign ministry says balloon spotted over Colombia is of a ‘civilian nature and used for flight tests’.", "url": "https://www.aljazeera.com/news/2023/2/6/balloon-sighted-over-latin-america-is-from-china-beijing-says", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/02/000_338F4KZ.jpg?resize=1920%2C1284", "publishedAt": "2023-02-06T18:13:09Z", "content": "Beijing has confirmed that a balloon spotted flying over Latin America is Chinese, two days after the United States shot down a similar device that American officials described as a spy balloon.\r\nChi… [+5868 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Peter Hartcher", "title": "Balloon goes up on US-Sino relations, but what about Australia’s China mania? - Sydney Morning Herald", "description": "Washington’s relationship with Beijing was fragile even before the Chinese balloon imbroglio, but the global spheres of influence are hardening and pose diabolical questions for America’s allies, particularly Australia.", "url": "https://www.smh.com.au/world/asia/balloon-goes-up-on-us-sino-relations-but-what-about-australia-s-china-mania-20230205-p5ci1v.html", "urlToImage": "https://static.ffx.io/images/$zoom_1.1267%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_opinion_no_age_social_wm/90a4740c12d93ce17ed2cd6200a738d1bc125050", "publishedAt": "2023-02-06T18:00:00Z", "content": "The episode is reminiscent of an incident in the last Cold War, the U2 spy plane crisis of 1960. The Russians shot down a US Air Force U2 surveillance jet over its territory. The event crashed a supe… [+4517 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ben Werschkul", "title": "State of the Union: Biden faces skeptical Americans as he prepares to tout his economic record - Yahoo Finance", "description": "President Biden heads into Tuesday’s State of the Union address facing two seemingly contradictory political realities.", "url": "https://finance.yahoo.com/news/state-of-the-union-biden-faces-skeptical-americans-as-he-prepares-to-tout-his-economic-record-155923036.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/lZht.5MsJznxnQrerzw0Gg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2023-02/31a0a6d0-a62b-11ed-aff5-f30de6efd75a", "publishedAt": "2023-02-06T15:59:23Z", "content": "President Joe Biden heads into Tuesdays State of the Union address facing two seemingly contradictory political realities.\r\nOn the one hand, the president has economic numbers to gloat about, includi… [+5112 chars]"}]}