{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "The Feed", "title": "Geophysicist's book 'The Next Supercontinent' envisions North America and Asia colliding in distant future - The Economic Times", "description": "Ross Mitchell takes readers on a captivating journey through remote and occasionally perilous lands in search of evidence of ancient supercontinents. He explores the fascinating phenomena that will give rise to the next supercontinent and present a compelling…", "url": "https://economictimes.indiatimes.com/news/international/us/geophysicists-book-the-next-supercontinent-envisions-north-america-and-asia-colliding-in-distant-future/articleshow/102056088.cms", "urlToImage": "https://img.etimg.com/thumb/msid-102056124,width-1070,height-580,imgsize-41272,overlay-economictimes/photo.jpg", "publishedAt": "2023-07-23T10:52:00Z", "content": "Geophysicist Ross Mitchell takes readers on an extraordinary journey in \"The Next Supercontinent,\" a captivating book that delves into the distant future when Earth's continents merge into a single l… [+3058 chars]"}, {"source": {"id": null, "name": "CanIndia News"}, "author": "NewsWire", "title": "As global race for moon heats up, India eyes lunar natural resources - CanIndia News", "description": "In 1969, a defining moment in human history occurred when American astronaut Neil Armstrong took his historic steps on the moon, becoming the first person ever to do so. This remarkable achievement not only opened the door of possibilities for other nations t…", "url": "https://www.canindia.com/as-global-race-for-moon-heats-up-india-eyes-lunar-natural-resources-11/", "urlToImage": "https://www.canindia.com/wp-content/uploads/2022/03/imageCireplace.png", "publishedAt": "2023-07-23T09:25:16Z", "content": "In 1969, a defining moment in human history occurred when American astronaut Neil Armstrong took his historic steps on the moon, becoming the first person ever to do so. This remarkable achievement n… [+2910 chars]"}]}