{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paul Best, Peter Hasson", "title": "White House tells governors 'thousands' of objects in the skies aren't aliens, could be used car lot balloons - Fox News", "description": "A White House official told governors in a virtual briefing on Monday that \"there are no UFOs\" and \"this is not an invasion of the aliens\" after three flying objects were shot down over North America.", "url": "https://www.foxnews.com/politics/white-house-tells-governors-thousands-objects-skies-arent-aliens-used-car-lot-balloons", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/04/UFO2.jpg", "publishedAt": "2023-02-15T02:29:00Z", "content": "White House officials were adamant in a virtual briefing with governors on Monday that flying objects recently spotted over North America are not of extraterrestrial origin, according to a recording … [+3273 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Wall Street ends mixed as inflation data supports rate worries - Moneycontrol", "description": "U.S. consumer prices accelerated as Americans continued to be burdened by higher rental housing costs, suggesting that the Fed will maintain its fight against inflation.", "url": "https://www.moneycontrol.com/news/business/markets/wall-street-ends-mixed-as-inflation-data-supports-rate-worries-10085251.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/wall-street-770x433.jpg", "publishedAt": "2023-02-15T00:27:10Z", "content": "Wall Street stocks ended mixed on Tuesday after U.S. consumer price data for January offered little to change expectations about the Federal Reserve's path forward on interest rate hikes.\r\nU.S. consu… [+2951 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Dalga D. Surofchy, PharmD, APh, Neil Shieh, PharmD, Iris Tam, PharmD", "title": "Evolving Considerations for Choice of Hepatitis B Vaccine - AJMC.com Managed Markets Network", "description": "The American Journal of Managed Care provides insights into the latest news and research in managed care across multimedia platforms.", "url": "https://www.ajmc.com/view/evolving-considerations-for-choice-of-hepatitis-b-vaccine", "urlToImage": "https://s3.amazonaws.com/mjhlifesciences.com/sitelogos/AJMC_1200x637.png", "publishedAt": "2023-02-14T18:16:07Z", "content": "ABSTRACT\r\nThere is currently no known cure for hepatitis B virus (HBV) infection, and HBV remains a major public health burden in the United States. The US Department of Health and Human Services has… [+47745 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Epidemiological Alert: Chikungunya increase in the Region of the Americas, 13 February 2023 - World - ReliefWeb", "description": "Situation Report in English on World about Health and Epidemic; published on 13 Feb 2023 by PAHO and WHO", "url": "https://reliefweb.int/report/world/epidemiological-alert-chikungunya-increase-region-americas-13-february-2023", "urlToImage": "https://reliefweb.int/sites/default/files/styles/large/public/previews/18/8d/188dcbba-ab1c-4404-9f99-e4a00f421720.png", "publishedAt": "2023-02-14T06:20:58Z", "content": "In 2022, the number of cases and deaths due to chikungunya in the Region of the Americas were above the numbers reported in previous years. The first weeks of 2023 have seen this trend continuing wit… [+2016 chars]"}]}