{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "financial-times", "name": "Financial Times"}, "author": null, "title": "CDC says most vaccinated Americans do not need to wear masks outdoors - Financial Times", "description": "US public health agency relaxes social-distancing guidelines as more adults get their jabs", "url": "https://www.ft.com/content/59fd0642-5cf0-4739-9d2e-e4bbbb7ea0d6", "urlToImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fddd3be9a-dbaa-4cac-9a80-bfa765bf7b98.jpg?source=next-opengraph&fit=scale-down&width=900", "publishedAt": "2021-04-27T19:24:30Z", "content": "Vaccinated people in the US can go outside without masks in many settings, the Biden administration has said, in a significant step to loosen social-distancing requirements as new cases decline and v… [+3796 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Mike Stobbe", "title": "Vaccinated Americans can now go maskless in these situations, CDC says - Global News", "description": "The change comes as more than half of U.S. adults have gotten at least one dose of coronavirus vaccine, and more than a third have been fully vaccinated.", "url": "https://globalnews.ca/news/7813301/covid-coronavirus-mask-guidelines-outdoors-rollout/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/03/CP120028827-1-e1615923157139.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-04-27T17:12:48Z", "content": "The Centers for Disease Control and Prevention eased its guidelines Tuesday on the wearing of masks outdoors, saying fully vaccinated Americans don’t need to cover their faces anymore unless they are… [+5073 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vaccinated People Don't Need Mask Outside Except In Crowd: US Health Body - NDTV", "description": "Americans vaccinated against the coronavirus no longer need to wear masks outdoors, except at crowded events, US government health authorities said Tuesday.", "url": "https://www.ndtv.com/world-news/vaccinated-people-dont-need-mask-outside-except-in-crowd-us-health-body-2423156", "urlToImage": "https://c.ndtvimg.com/2020-03/o9vr0t1c_us-coronavirus-reuters_625x300_31_March_20.jpg", "publishedAt": "2021-04-27T16:51:06Z", "content": "Masks are still necessary for vaccinated people if they are at concerts, large sporting events.\r\nWashington: Americans vaccinated against the coronavirus no longer need to wear masks outdoors, except… [+1153 chars]"}, {"source": {"id": null, "name": "TalkEsport"}, "author": "https://www.facebook.com/patraaritra/", "title": "Valorant VAL 39 error: Don't Panic, The Servers are down » TalkEsport - TalkEsport", "description": "Valorant players are again reporting that the servers are down and this time, they are facing the code 39 error. Valorant has had a rough history of going down quite often for various regions and this time, American servers are facing this problem. Here is al…", "url": "https://www.talkesport.com/news/valorant-val-39-error-dont-panic-the-servers-are-down-for-maintenance/", "urlToImage": null, "publishedAt": "2021-04-27T16:19:48Z", "content": "Valorant players are again reporting that the servers are down and this time, they are facing the code 39 error. Valorant has had a rough history of going down quite often for various regions and thi… [+1695 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Paulo Papa", "title": "Cadillac debuts 2023 Lyriq EV SUV in the US - Yahoo Singapore News", "description": "Detroit-based automaker Cadillac debuts the 2023 Cadillac Lyriq — its first EV SUV. The American automobile marque said that the 2023 Lyriq will illuminate...", "url": "https://sg.news.yahoo.com/cadillac-debuts-2023-lyriq-ev-000000010.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/jFxqzvvQb4cJJ7AzhPo1Rg--~B/aD01Njg7dz04NTI7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/carmudi.com.ph/bbd54416193fb262a08659c20e7eae78", "publishedAt": "2021-04-27T00:00:00Z", "content": "Detroit-based automaker Cadillac debuts the 2023 Cadillac Lyriq its first EV SUV. The American automobile marque said that the 2023 Lyriq will illuminate the brands future and reset the fundamental n… [+2259 chars]"}, {"source": {"id": null, "name": "WTHR"}, "author": "Erin McHugh", "title": "5 million Americans have missed 2nd COVID-19 vaccine dose, CDC data shows - WTHR", "description": "With the Pfizer and Moderna vaccines, someone isn't considered fully vaccinated until two weeks after their second shot.", "url": "http://www.wthr.com/article/news/health/coronavirus/vaccine/americans-missed-second-covid-19-vaccine-dose/507-225ee2b7-331f-42f9-a464-5e6c97243d65", "urlToImage": "https://media.tegna-media.com/assets/CCT/images/776c6e0a-01b3-45f7-9813-8a37e786b1b0/776c6e0a-01b3-45f7-9813-8a37e786b1b0_1140x641.jpg", "publishedAt": "2021-04-26T19:16:00Z", "content": "WASHINGTON While the vast majority of Americans are following thru on both rounds of COVID-19 vaccinations, more than 5 million Americans have failed to follow thru on getting a second dose, accordin… [+3082 chars]"}, {"source": {"id": null, "name": "UNTV News"}, "author": null, "title": "Moderna applies for emergency use authorization for COVID-19 vaccine - UNTV News - UNTV News", "description": "American drugmaker Moderna Inc. filed an application for emergency use authorization (EUA) for the coronavirus disease (COVID-19) vaccine on Monday (April 26), Vaccine czar Carlito Galvez Jr. announced.", "url": "https://www.untvweb.com/news/moderna-applies-for-emergency-use-authorization-for-covid-19-vaccine/", "urlToImage": "https://www.untvweb.com/news/wp-content/uploads/2021/04/Moderna-applies-for-web.jpg", "publishedAt": "2021-04-26T12:51:07Z", "content": "MANILA, Philippines Philippine Ambassador to India Ramon Bagatsing Jr. on Tuesday (April 27) announced that some eight million doses of COVID-19 vaccine from Indias Bharat Biotech are expected to arr… [+1448 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Jake Coyle", "title": "''Nomadland' wins best picture at a distanced Oscars - CTV News", "description": "Chloe Zhao's 'Nomadland,' a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao became the first woman of colour to win best director and a historically dive…", "url": "https://www.ctvnews.ca/entertainment/nomadland-wins-best-picture-at-a-distanced-oscars-1.5401418", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5337907.1615206924!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-04-26T03:14:00Z", "content": "Chloe Zhao's \"Nomadland,\" a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao became the first … [+8327 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Jake Coyle", "title": "'Nomadland' wins best picture at a social distanced Oscars - CP24 Toronto's Breaking News", "description": "Chloe Zhao's “Nomadland,” a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao also became just the second woman to win best director, and the first woman o…", "url": "https://www.cp24.com/entertainment-news/nomadland-wins-best-picture-at-a-social-distanced-oscars-1.5401411", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5402046.1619408570!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-04-26T03:11:00Z", "content": "Chloe Zhao's Nomadland, a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao also became just th… [+9245 chars]"}]}