{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CinemaBlend"}, "author": "Laura Hurley", "title": "America's Got Talent Wild Card Jordan Conley Breaks Down His Disney-Filled Comedy Set, Plus The '90s Character Who Didn't Make The Cut - CinemaBlend", "description": "AGT's Jordan Conley broke down all those Disney references in his wild card return!", "url": "https://www.cinemablend.com/television/americas-got-talent-wild-card-jordan-conley-breaks-down-his-disney-filled-comedy-set-plus-the-90s-character-who-didnt-make-the-cut", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9utFuNWkLJyni2TKQXpkKG-1200-80.jpg", "publishedAt": "2022-09-07T05:06:59Z", "content": "Warning: spoilers ahead for Week 5 of America’s Got Talent Season 17 qualifiers.\r\nThe final round of qualifiers performances are officially over for Season 17 of America's Got Talent, as the fifth we… [+4589 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published ahead of print in August - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; Atlantic Canada; the New Caledonian arc; the Farallon plate; and the Hikurangi sub…", "url": "https://www.eurekalert.org/news-releases/963881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-06T20:07:38Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; A… [+38402 chars]"}, {"source": {"id": null, "name": "Sportsbrief.com"}, "author": "Babajide Orevba", "title": "Super Falcons of Nigeria Target First Ever Victory Against USA in 2nd Friendly in Washington ▷ SportsBrief.com - Sports Brief", "description": "Super Falcons continue to prepare for the FIFA Women's World Cup and after losing 4-0 to the USA in a friendly, they are set for a rematch with the Americans.", "url": "https://sportsbrief.com/football/super-falcons/23333-super-falcons-nigeria-target-victory-usa-2nd-friendly-washington/", "urlToImage": "https://netstorage-sportsbrief.akamaized.net/images/f20f572147b5725b.jpg", "publishedAt": "2022-09-06T09:02:26Z", "content": "<ul><li>Super Falcons of Nigerian will file out against their United States counterpart in a second friendly match</li><li>Nigeria lost 4-0 to the USA in Washington over the weekend, but coach Randy … [+2376 chars]"}, {"source": {"id": null, "name": "The Africa Report"}, "author": "Damien Glez", "title": "Zimbabwe: Africa’s oldest dinosaur might have been… American - The Africa Report", "description": "Scientists have just announced the discovery of the skeleton of the oldest dinosaur in Africa, in the Zimbabwean district of Mbire. The remains seem to confirm the theory of continental drift.", "url": "https://www.theafricareport.com/238642/zimbabwe-africas-oldest-dinosaur-might-have-been-american/", "urlToImage": "https://www.theafricareport.com/media/2022/09/Plus_vieux_dinosaure_africain_zimbabwe_E-scaled-e1662449051103.jpg", "publishedAt": "2022-09-06T07:28:35Z", "content": "It is about a metre high, weighs 30kg, has a long tail and a rather small head. The animal, whose skeleton has just been discovered in Zimbabwe by an international team of palaeontologists, could be … [+2879 chars]"}]}