{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Ronald Blum", "title": "Pulisic goal advances US in World Cup with 1-0 win over Iran - The Associated Press - en Español", "description": "DOHA, Qatar (AP) — Christian Pulisic kicked the ball, scored the goal and then crashed into the goalkeeper, a collision that sent the American star to the hospital and the United States into the second round of the World Cup.", "url": "https://apnews.com/article/2022-world-cup-us-defeats-iran-2d107119cad02a10681ca23bebeafb53", "urlToImage": "https://storage.googleapis.com/afs-prod/media/05ea08f8ba7a4c78befb1a9b3a49f74f/3000.jpeg", "publishedAt": "2022-11-29T23:06:51Z", "content": "DOHA, Qatar (AP) Christian Pulisic kicked the ball, scored the goal and then crashed into the goalkeeper, a collision that sent the American star to the hospital and the United States into the second… [+4518 chars]"}, {"source": {"id": null, "name": "Theepochtimes.com"}, "author": null, "title": "The Looming Tripledemic—Is It RSV, Flu or COVID? - The Epoch Times", "description": "Americans are set to face a triple threat of infectious diseases as the cold weather season advances. According ...", "url": "https://www.theepochtimes.com/health/the-looming-tripledemic-is-it-rsv-flu-or-covid_4893394.html", "urlToImage": "https://img.theepochtimes.com/assets/uploads/2022/01/18/shutterstock_581422114-1200x800.jpg", "publishedAt": "2022-11-29T21:28:46Z", "content": "Americans are set to face a triple threat of infectious diseases as the cold weather season advances.\r\nAccording to experts, rates of respiratory syncytial virus (RSV), influenza, and COVID-19 are al… [+7045 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "One in five women likely to forgo additional testing after abnormal mammogram - News-Medical.Net", "description": "One in five women is likely to forgo additional testing after an abnormal finding on a screening mammogram if there is a deductible, according to a new study presented today at the annual meeting of the Radiological Society of North America.", "url": "https://www.news-medical.net/news/20221129/One-in-five-women-likely-to-forgo-additional-testing-after-abnormal-mammogram.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/91618146-620x480.jpg", "publishedAt": "2022-11-29T16:35:00Z", "content": "One in five women is likely to forgo additional testing after an abnormal finding on a screening mammogram if there is a deductible, according to a new study presented today at the annual meeting of … [+4158 chars]"}]}