{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Fox Business"}, "author": "Kyle Morris", "title": "Energy groups target Biden administration over unwillingness to expand domestic oil production - Fox Business", "description": "Two prominent American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer testimony before the Senate next week.", "url": "https://www.foxbusiness.com/politics/energy-groups-target-biden-administration-over-unwillingness-to-expand-domestic-oil-production", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/10/0/0/joe-biden-oil-field-1-AP-istock.jpg?ve=1&tl=1", "publishedAt": "2022-04-03T01:25:31Z", "content": "Two American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer test… [+4111 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Limiting sodium intake results in improved quality of life for patients with heart failure - News-Medical.Net", "description": "Nutrition counseling and strictly limiting salt intake for one year in patients with heart failure resulted in improved quality of life and a slowing in the progression of the disease, but a study presented at the American College of Cardiology's (ACC) 71st A…", "url": "https://www.news-medical.net/news/20220402/Limiting-sodium-intake-results-in-improved-quality-of-life-for-patients-with-heart-failure.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/Anatomy_of_Human_Heart.-Liya_Graphics_5ac9d64765b747899bc4a9ef77468432-620x480.jpg", "publishedAt": "2022-04-02T23:58:00Z", "content": "Nutrition counseling and strictly limiting salt intake for one year in patients with heart failure resulted in improved quality of life and a slowing in the progression of the disease, but a study pr… [+6513 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Grimes in shock after NXT North American Title win: NXT Stand & Deliver 2022 (WWE Network Exclusive) - WWE", "description": "An emotional Cameron Grimes is still in shock after winning his first championship. Catch WWE action on Peacock, WWE Network, FOX, USA Network, Sony India an...", "url": "https://www.youtube.com/watch?v=WWCyV1MkV3w", "urlToImage": "https://i.ytimg.com/vi/WWCyV1MkV3w/maxresdefault.jpg", "publishedAt": "2022-04-02T19:31:46Z", "content": null}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Astronaut to Discuss American Space Record in News Conference - NASA", "description": "NASA astronaut Mark Vande Hei, back on Earth after breaking the record for the longest single spaceflight in history by an American, will participate in a virtual news conference at 10 a.m. EDT Tuesday, April 5, from the agency’s Johnson Space Center in Houst…", "url": "https://www.nasa.gov/press-release/nasa-astronaut-to-discuss-american-space-record-in-news-conference/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/iss065e335291_0.jpg", "publishedAt": "2022-04-01T16:23:29Z", "content": null}, {"source": {"id": null, "name": "American Medical Association"}, "author": null, "title": "How we will know when COVID-19 has become endemic - American Medical Association", "description": "Infectious diseases physician Stephen Parodi, MD, distinguishes between pandemics and endemics and points to signs that show where COVID-19 is moving.", "url": "https://www.ama-assn.org/delivering-care/public-health/how-we-will-know-when-covid-19-has-become-endemic", "urlToImage": "https://www.ama-assn.org/sites/ama-assn.org/files/styles/image_ratio_16_9/public/2022-03/2022-03-16-C19_PARODEMIC-Index_1170x780.jpg?itok=VdoLGkSr", "publishedAt": "2022-04-01T12:00:00Z", "content": "The World Health Organization declared the COVID-19 outbreak a pandemic on March 11, 2020. Now,  more than two years later, society is at a crossroads, according to AMA member Stephen Parodi, MD.\r\nTh… [+3492 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "John Eric Mendoza", "title": "CPP urges voters to push presidential bets to halt Balikatan exercises - INQUIRER.net", "description": "MANILA, Philippines — The Communist Party of the Philippines (CPP) on Friday urged Filipino voters to push their presidential bets to halt joint military exercises between Filipino and American", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/04/272292-620x459.jpeg", "publishedAt": "2022-04-01T11:26:00Z", "content": "BIGGEST SO FAR This years Balikatan (shoulder-to-shoulder) war games, the biggest joint military training between Filipino and American soldiers, returns to Crow Valley gunnery range (Colonel Ernesto… [+2147 chars]"}]}