{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Cheryl Hines condemns husband Robert F. Kennedy Jr.'s anti-vaccine comments, which invoked Anne Frank - CNN", "description": "Hines said her husband's reference to Anne Frank, which he later apologized for, was \"reprehensible.\" Kennedy made his original comments at an anti-vaccine mandate rally, suggesting Frank had it better than present-day Americans because she could \"hide.\"", "url": "https://www.cnn.com/2022/01/25/entertainment/cheryl-hines-robert-f-kennedy-jr-anne-frank-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220125140830-robert-f-kennedy-jr-cheryl-hines-file-2018-super-tease.jpg", "publishedAt": "2022-01-25T22:25:00Z", "content": "(CNN)\"Curb Your Enthusiasm\" actress Cheryl Hines has condemned her husband Robert F. Kennedy Jr.'s comments about Anne Frank, who was murdered by Nazis as a teenager, which he made during a rally aga… [+2835 chars]"}, {"source": {"id": null, "name": "KATU"}, "author": "Evan Schreiber", "title": "OHSU reveals 'super immunity' paths for vaccinated, infected Americans - KATU", "description": "A new study is revealing the road to \"super immunity\" has multiple paths as researchers are comparing the antibody response from both COVID-19 vaccination and natural infection. Researchers atOregon Health & Science University (OHSU) studied people who were f…", "url": "https://katu.com/news/coronavirus/ohsu-reveals-super-immunity-paths-for-vaccinated-infected-americans", "urlToImage": "https://katu.com/resources/media/b559a58d-917c-4f4b-b409-5ffe78696516-large16x9_sourceOHSUplasmasample012522.jpg?1643139459260", "publishedAt": "2022-01-25T20:13:31Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Ukraine urges calm, saying Russian invasion not imminent - The Indian Express", "description": "The State Department has ordered the families of all American personnel at the US Embassy in Kyiv to leave the country, and it said that nonessential embassy staff could leave.", "url": "https://indianexpress.com/article/world/ukraine-urges-calm-russian-invasion-not-imminent-7741294/", "urlToImage": "https://images.indianexpress.com/2022/01/Ukraine-1.jpg", "publishedAt": "2022-01-25T17:01:46Z", "content": "Ukraine’s leaders sought to reassure the nation that a feared invasion from neighbouring Russia was not imminent, even as they acknowledged the threat is real and prepared to accept a shipment of Ame… [+3671 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Inside the Factory Making N95 Masks for the Public - Inside Edition", "description": "Two years after COVID-19 first reached America, N-95 masks are finally being made available to the public for free, courtesy of the government. At Bona Fide ...", "url": "https://www.youtube.com/watch?v=sWRF1DqU8kk", "urlToImage": "https://i.ytimg.com/vi/sWRF1DqU8kk/maxresdefault.jpg", "publishedAt": "2022-01-25T16:42:02Z", "content": null}]}