{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Marianne Stein", "title": "Study explores what food sector needs to know about how to reduce sodium - Medical Xpress", "description": "Sodium is an essential micronutrient, but the amount we need is small. Three slices of bread or one teaspoon of table salt will do it, and chances are your daily sodium intake is far greater. More than 90% of Americans consume too much sodium, which can lead …", "url": "https://medicalxpress.com/news/2022-04-explores-food-sector-sodium.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/salt.jpg", "publishedAt": "2022-04-15T17:01:43Z", "content": "Sodium is an essential micronutrient, but the amount we need is small. Three slices of bread or one teaspoon of table salt will do it, and chances are your daily sodium intake is far greater. More th… [+5693 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "If harmed, India will not spare anyone, says Rajnath Singh in a strong message to China - The Indian Express", "description": "Singh, in his address to the Indian-American community in San Francisco, also sent a subtle message to the US that New Delhi does not believe in a diplomacy of “zero-sum game” and its relationship with one country cannot be at the expense of the other.", "url": "https://indianexpress.com/article/india/harmed-india-not-spare-anyone-rajnath-singh-message-china-7870897/", "urlToImage": "https://images.indianexpress.com/2022/04/FQHBJ4uaIAAba7g.jpg", "publishedAt": "2022-04-15T15:40:44Z", "content": "In a strong message to China, Defence Minister Rajnath Singh has said that if harmed, India will not spare anyone, as he asserted that India under Prime Minister Narendra Modi has emerged as a powerf… [+5067 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": null, "title": "'India celebrated my ouster': Imran Khan repeats 'foreign conspiracy' charge - Hindustan Times", "description": "Former Pakistan PM and PTI chairman Imran Khan claimed last night that India celebrated his ouster and repeated the foreign conspiracy charge. Addressing thousands of his supporters in Peshawar, Imran Khan not only lashed America and new Pakistan govt, but al…", "url": "https://www.hindustantimes.com/videos/news/india-celebrated-my-ouster-imran-khan-repeats-foreign-conspiracy-charge-101649913668865.html", "urlToImage": "https://images.hindustantimes.com/img/2022/04/14/1600x900/HT_Normal_Thumbnail_-_AUG__2021_-_2022-04-14T104724.936_1649913693114_1649913698085.jpg", "publishedAt": "2022-04-14T05:22:48Z", "content": null}]}