{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Free Press Journal"}, "author": "IANS", "title": "NASA astronaut reaches Earth after spending record 355 days in space - Free Press Journal", "description": "Mark Vande Hei, who spent 355 days in low-Earth orbit- the longest continuous stay in space by an American - has safely returned to Earth along with two cosmonauts aboard a Russian spacecraft.", "url": "https://www.freepressjournal.in/science/nasa-astronaut-reaches-earth-after-spending-record-355-days-in-space", "urlToImage": "https://gumlet.assettype.com/freepressjournal/2022-03/eaf45247-9c11-4e67-98c5-598e2e5c82fb/planet_gcc14ec6cc_1920.jpg?rect=0%2C0%2C3900%2C2048&w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-03-31T15:55:08Z", "content": "Washington: Mark Vande Hei, who spent 355 days in low-Earth orbit- the longest continuous stay in space by an American - has safely returned to Earth along with two cosmonauts aboard a Russian spacec… [+2517 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "CBC", "title": "Earthworm invasion in Canadian forest linked to insect decline, study suggests - Yahoo News Canada", "description": "In many parts of northern North America, there have been no earthworms since before the last ice age. Now, with help from humans, invasive earthworms are...", "url": "https://ca.news.yahoo.com/earthworm-invasion-canadian-forest-linked-132212324.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/DkE2fUR8ofSP5WBX05m9eQ--~B/aD04ODU7dz0xMTgwO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/cbc.ca/2e69585aa77ceeec947b52c4e8058002", "publishedAt": "2022-03-31T13:22:12Z", "content": "Until recently, earthworms didn't exist in northern forests. Now they're invading underground, and having an impact on insects above the ground, a new study suggests. (V. Gutekunst - image credit)\r\nI… [+5917 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "First Nations delegates ask Pope Francis to revoke church doctrine used to justify colonialism - CBC News", "description": "Members of the Assembly of First Nations (AFN) urged Pope Francis on Thursday to revoke centuries-old papal decrees used to justify the seizure of Indigenous land in the Americas by colonial powers.", "url": "https://www.cbc.ca/news/politics/assembly-of-first-nations-meets-pope-francis-vatican-1.6402798", "urlToImage": "https://i.cbc.ca/1.6403497.1648729491!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/afn-delegation-in-rome.jpg", "publishedAt": "2022-03-31T12:25:23Z", "content": "Members of the Assembly of First Nations (AFN) urged Pope Francis on Thursday to revoke centuries-old papal decrees used to justify the seizure of Indigenous land in the Americas by colonial powers.\r… [+3325 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Record-Setting NASA Astronaut and Two Cosmonauts Return From International Space Station - SciTechDaily", "description": "After extending the record for the longest single spaceflight in history by an American to 355 days, NASA astronaut Mark Vande Hei returned to Earth on Wednesday, March 30, 2022, along with Roscosmos cosmonauts Anton Shkaplerov and Pyotr Dubrov. The trio depa…", "url": "https://scitechdaily.com/record-setting-nasa-astronaut-and-two-cosmonauts-return-from-international-space-station/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronaut-Mark-Vande-Hei-After-Landing.jpg", "publishedAt": "2022-03-31T09:36:18Z", "content": "NASA astronaut Mark Vande Hei is seen outside the Soyuz MS-19 spacecraft after he landed with Russian cosmonauts Anton Shkaplerov and Pyotr Dubrov in a remote area near the town of Zhezkazgan, Kazakh… [+3705 chars]"}, {"source": {"id": null, "name": "Martha Stewart"}, "author": "Nashia Baker", "title": "Eating Two Servings of Avocado Each Week Could Decrease Your Risk of Having a Heart Attack - Martha Stewart", "description": "According to a new study published in the <em>Journal of the American Heart Association</em>, consuming just one avocado weekly may be a simple and effective preventative care strategy.", "url": "https://www.marthastewart.com/8247784/eating-two-servings-avocado-could-help-prevent-heart-attack-study-march-2022", "urlToImage": "https://imagesvc.meredithcorp.io/v3/mm/image?q=60&c=sc&poi=%5B586%2C992%5D&w=1248&h=624&url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F34%2F2019%2F03%2F12164556%2Fbd105774avocados7_1.jpg", "publishedAt": "2022-03-30T15:53:15Z", "content": "Avocados are delicious just about any time of day (for breakfast, lunch, and yes, even in ice cream). As you've heard, they pack plenty of healthy fats and nutrients and now, according to a new study… [+2134 chars]"}]}