{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Depp, Heard roasted on American TV - news.com.au", "description": "<p>American TV show <i>Saturday Night Live </i>opened up by lampooning the explosive allegations made in the ongoing Johnny Depp and Amber Heard defamation trial, focusing primarily on the claims that Heard defecated on her and Depp&rsquo;s bed.</p>", "url": "https://www.news.com.au/entertainment/tv/snl-skewers-johnny-depp-amber-heard-trial-as-host-selena-gomez-looks-for-love/news-story/386fd51d552b116bcc31e80f6b4e56c2", "urlToImage": "https://content.api.news/v3/images/bin/7316fa6d080a00e79a4547d6ef947e23", "publishedAt": "2022-05-15T17:29:11Z", "content": "The iconic Saturday Night Live took aim at Johnny Depp and Amber Heard on the weekend as the pairs defamation trial is set to resume.American TV show Saturday Night Live opened up by lampooning the e… [+2357 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Columbus Mavhunga", "title": "Religious Beliefs, Terrain Hampering Measles Immunization Program in Zimbabwe - Voice of America - VOA News", "description": "The government says it hopes to conduct immunizations for measles throughout Zimbabwe in the coming weeks to contain the disease", "url": "https://www.voanews.com/a/religious-beliefs-terrain-hampering-measles-immunization-program-in-zimbabwe/6574199.html", "urlToImage": "https://gdb.voanews.com/031a0000-0aff-0242-014e-08da36890935_w1200_r1.jpeg", "publishedAt": "2022-05-15T15:51:41Z", "content": "MUTASA, ZIMBABWE  Zimbabwes government says religious beliefs, topography and school closures are hampering efforts to contain a measles outbreak which has claimed at least 20 lives and infected hund… [+2143 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Rebecca Rubin", "title": "Box Office: ‘Doctor Strange 2’ Rules Again as ‘Firestarter’ Flames Out - Variety", "description": "“Doctor Strange in the Multiverse of Madness” is again the No. 1 movie at the domestic box office. In its second weekend of release, the latest installment in Disney’s Marvel Cinematic Universe has collected $61 million from 4,534 North American theaters. Tic…", "url": "https://variety.com/2022/film/box-office/box-office-doctor-strange-2-wins-weekend-firestarter-bombs-1235267407/", "urlToImage": "https://variety.com/wp-content/uploads/2022/05/KTA4640_comp_v194.1090.jpg?w=1024", "publishedAt": "2022-05-15T15:12:00Z", "content": "“Doctor Strange in the Multiverse of Madness” is again the No. 1 movie at the domestic box office.\r\nIn its second weekend of release, the latest installment in Disney’s Marvel Cinematic Universe has … [+7151 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Google gets more multilingual, but will it get the nuance? - Japan Today", "description": "About 10 million people speak Quechua, but trying to automatically translate emails and text messages into the most widely spoken Indigenous language family in the Americas was long all but impossible. That changed on Wednesday, when Google added Quechua and …", "url": "https://japantoday.com/category/tech/google-gets-more-multilingual-but-will-it-get-the-nuance", "urlToImage": null, "publishedAt": "2022-05-13T22:00:00Z", "content": "About 10 million people speak Quechua, but trying to automatically translate emails and text messages into the most widely spoken Indigenous language family in the Americas was long all but impossibl… [+6538 chars]"}]}