{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Phil Helsel, Chloe Melas", "title": "Hollywood writers can return to work after union and studios reach agreement to end strike - NBC News", "description": "The Writers Guild of America strike that has disrupted programming and other operations for Hollywood media companies will come to an end Wednesday, after both sides agreed to a tentative deal, the union said.", "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/writers-guild-studios-agree-deal-strike-end-rcna117528", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-08/230808-wga-strike-mjf-1623-668825.jpg", "publishedAt": "2023-09-27T12:17:00Z", "content": "The deal also includes increases in minimum weekly pay rates and minimum numbers of writers, according to a summary of the \"memorandum of agreement\" on the writers guild website.\r\nActors are also on … [+1737 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "Only about 1 in 4 American adults definitely wants the updated Covid-19 vaccine, new survey finds - CNN", "description": "When it comes to getting the updated Covid-19 vaccines this year, only about 1 in 4 American adults say they definitely plan to get the shot, according to new survey findings from the nonprofit health policy group KFF. Roughly another quarter of adults say th…", "url": "https://www.cnn.com/2023/09/27/health/covid-vaccine-kff-survey/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230926190353-covid-vaccine-stock-092623.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-09-27T09:00:00Z", "content": "When it comes to the updated Covid-19 vaccines, only about 1 in 4 American adults says they definitely plan to get the shot, according to a new survey from the nonprofit health policy group KFF. Roug… [+3852 chars]"}]}