{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Parul Sehgal", "title": "Joan Didion Chronicled American Disorder With Her Own Unmistakable Style - The New York Times", "description": "The generation-defining essayist and novelist was preoccupied with mythos — and gifted at fashioning her own.", "url": "https://www.nytimes.com/2021/12/23/books/death-of-joan-didion.html", "urlToImage": "https://static01.nyt.com/images/2021/12/23/books/23Didion-appraisal/23Didion-appraisal-facebookJumbo.jpg", "publishedAt": "2021-12-24T05:33:00Z", "content": "But can anyone lampoon her style without relying on it? To condemn the Didion narrative and all that a sentimental attachment to her obscures her mockery of early feminist organizing, for example is … [+3399 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, CNN Reporter, Crime and Justice", "title": "Two Georgia election workers sue Giuliani and One America News, claiming election lies prompted severe harassment - CNN", "description": "Two Georgia election workers are accusing right-wing TV network One America News and former Trump lawyer and pundit Rudy Giuliani of destroying their reputations and prompting Trump supporters to harass them -- filling their lives with fear -- because of fals…", "url": "https://www.cnn.com/2021/12/23/politics/georgia-election-workers-lawsuit-rudy-giuliani-one-america-news/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223172221-giuliani-sept-2020-super-tease.jpg", "publishedAt": "2021-12-24T01:59:00Z", "content": null}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Douwe Van Hinsbergen", "title": "The Somalayas are the biggest mountain range you will never see - Phys.org", "description": "Every geography schoolbook has them: maps that look like today's Earth, but not quite, since all continents are merged into a single supercontinent. Those maps were used to explain why dinosaurs in South America and Africa, or North America and Europe looked …", "url": "https://phys.org/news/2021-12-somalayas-biggest-mountain-range.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/the-somalayas-are-the.jpg", "publishedAt": "2021-12-23T14:37:08Z", "content": "Every geography schoolbook has them: maps that look like today's Earth, but not quite, since all continents are merged into a single supercontinent. Those maps were used to explain why dinosaurs in S… [+4906 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes", "title": "Launch of Nasa telescope delayed to Christmas Day - The Straits Times", "description": "KOUROU (French Guiana) • The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weather at the launch site on South America's north-eastern coa…", "url": "https://www.straitstimes.com/world/launch-of-nasa-telescope-delayed-to-christmas-day", "urlToImage": null, "publishedAt": "2021-12-22T21:00:00Z", "content": "KOUROU (French Guiana) The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weath… [+1705 chars]"}]}