{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "UnionBank bags Citi's Philippine consumer banking business in ₱55-B deal - CNN Philippines", "description": "‘UnionBank was selected by Citi following an extensive and competitive auction process,’ says the American bank giant, stressing there will be no change in their service to customers during the transition to the agreement’s closing.", "url": "http://www.cnnphilippines.com/business/2021/12/23/UnionBank-acquisition-Citi-PH-consumer-banking-business.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/12/23/UnionBank-Citi_CNNPH.jpg/jcr:content/UnionBank-Citi_CNNPH.jpg", "publishedAt": "2021-12-23T04:30:15Z", "content": "Metro Manila (CNN Philippines, December 23) UnionBank of the Philippines is absorbing Citigroups consumer banking business in the country in an agreement worth 55 billion, both firms announced Thursd… [+2998 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Niraj Chokshi", "title": "Why Christmas Gifts Are Arriving on Time This Year - The New York Times", "description": "Fears that a disrupted supply chain could wreak havoc on the logistics industry over the holiday turned out to be wrong as many Americans ordered early and shopped in stores.", "url": "https://www.nytimes.com/2021/12/22/business/christmas-gifts-delivery-supply-chain.html", "urlToImage": "https://static01.nyt.com/images/2021/12/23/business/00holiday-logistics01/00holiday-logistics01-facebookJumbo.jpg", "publishedAt": "2021-12-23T00:51:00Z", "content": "The carriers have done their part. Consumers have done their part, said Satish Jindel, president of ShipMatrix. When they work together, you get good results.\r\nThats not to say the supply chain turmo… [+1331 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes", "title": "Launch of Nasa telescope delayed to Christmas Day - The Straits Times", "description": "KOUROU (French Guiana) • The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weather at the launch site on South America's north-eastern coa…", "url": "https://www.straitstimes.com/world/launch-of-nasa-telescope-delayed-to-christmas-day", "urlToImage": null, "publishedAt": "2021-12-22T21:00:00Z", "content": "KOUROU (French Guiana) The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weath… [+1705 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Sylvia Looi", "title": "Taiwanese Mandopop star Wang Leehom to lose one third of his wealth to ex-wife as part of divorce settlement - Malay Mail", "description": "KUALA LUMPUR, Dec 22 ― Taiwanese-American singer Wang Leehom is set to lose over one-third of his wealth to his ex-wife following his announcement that he will hand over a mansion to her. Coupled with the alimony she will receive from the Mandopop heartthrob,…", "url": "https://www.malaymail.com/news/showbiz/2021/12/22/taiwanese-mandopop-star-wang-leehom-to-lose-one-third-of-his-wealth-to-ex-w/2030280", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-12/wang_lee_hom_221221-seo.png", "publishedAt": "2021-12-22T06:04:26Z", "content": "Taiwanese-American singer Wang Leehom will lose one third of his wealth to his ex-wife as part of a divorce settlement. Picture via Facebook/Wang Leehom\r\nKUALA LUMPUR, Dec 22 Taiwanese-American singe… [+1683 chars]"}]}