{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Smaller bodies, longer wings, earlier migrations: Untangling the multiple impacts of climate warming - EurekAlert", "description": "When a University of Michigan-led research team reported last year that North American migratory birds have been getting smaller over the past four decades and that their wings have gotten a bit longer, the scientists wondered if they were seeing the fingerpr…", "url": "https://www.eurekalert.org/pub_releases/2021-06/uom-sbl061621.php", "urlToImage": "https://www.eurekalert.org/socialshare/EurekAlert-bluebg_Twitter_1200x675.jpg", "publishedAt": "2021-06-21T04:02:12Z", "content": "When a University of Michigan-led research team reported last year that North American migratory birds have been getting smaller over the past four decades and that their wings have gotten a bit long… [+7480 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Mark Lungariello", "title": "American Airlines cancels hundreds of flights over staffing shortage - New York Post ", "description": "American Airlines canceled more than 300 flights Saturday and Sunday, many because they couldn’t staff crews for the planes.", "url": "https://nypost.com/2021/06/20/american-airlines-cancels-hundreds-of-flights-over-staffing-shortage/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/06/american-airlines.jpg?quality=90&strip=all&w=1200", "publishedAt": "2021-06-21T03:05:00Z", "content": "American Airlines canceled more than 300 flights Saturday and Sunday, many because they couldnt staff crews for the planes, CNBC reported.\r\nBad weather in the south and other factors led the airline … [+2223 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Eric Morath, Greg Ip", "title": "Tight Labor Market Returns the Upper Hand to American Workers - The Wall Street Journal", "description": "Employers competing for low-wage workers are offering signing bonuses and other perks", "url": "https://www.wsj.com/articles/tight-labor-market-returns-the-upper-hand-to-american-workers-11624210501", "urlToImage": "https://images.wsj.net/im-356737/social", "publishedAt": "2021-06-20T17:35:00Z", "content": "Low-wage workers found something unexpected in the economys recovery from the pandemic: leverage. Ballooning job openings in fields requiring minimal educationincluding in restaurants, transportation… [+13329 chars]"}, {"source": {"id": null, "name": "Boxoffice Pro"}, "author": null, "title": "WEEKEND BOX OFFICE: The Hitman's Wife's Bodyguard Opens at No. 1 w/ $11.68M Ahead of A Quiet Place Part II ($9.4M); Godzilla vs. Kong Crosses $100M - Boxoffice - Boxoffice Pro", "description": "Following the disappointing debuts of both In the Heights and Peter Rabbit 2: The Runaway last weekend, the North American box office remained rather subdued this frame with the release of The Hitman’s Wife’s Bodyguard, which narrowly secured the No. 1 spot a…", "url": "https://www.boxofficepro.com/weekend-box-office-the-hitmans-wifes-bodyguard-a-quiet-place-part-2/", "urlToImage": "https://www.boxofficepro.com/wp-content/uploads/2021/06/Weekend-box-office-6-20-21-social.jpg", "publishedAt": "2021-06-20T16:08:19Z", "content": "Following the disappointing debuts of both In the Heights and Peter Rabbit 2: The Runaway last weekend, the North American box office remained rather subdued this frame with the release of The Hitman… [+8403 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "U.S. lawmaker wants Biden to take 'unilateral action' on reopening border with Canada - CTV News", "description": "An American congressman says he has proposed to the White House to unilaterally reopen the border to Canadians as Ottawa announced another month extension of the restrictions that prohibit non-essential travel.", "url": "https://www.ctvnews.ca/politics/u-s-lawmaker-wants-biden-to-take-unilateral-action-on-reopening-border-with-canada-1.5476832", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5476894.1624054591!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-06-20T11:00:00Z", "content": "OTTAWA -- \r\nAn American congressman says he has proposed to the White House to unilaterally reopen the border to Canadians as Ottawa announced another month extension of the restrictions that prohibi… [+3628 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "Super Eagles stars turn up for Olayinka and Shehu's weddings - Goal.com", "description": "The 10 South American countries participating in the 2021 Copa America will be split up into two groups of five. The top four in each group will advance to the single-elimination knockout stage, which kicks off with the quarterfinals.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-06-19T22:36:58Z", "content": ""}]}