{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Defiant Trump Pleads Not Guilty In New York Court In Hush Money Case - NDTV", "description": "Donald Trump on Tuesday pleaded not guilty to 34 felony counts inside a packed New York courtroom ahead of a trial that could begin as soon as January, as he became the first American president to be arrested on criminal charges.", "url": "https://www.ndtv.com/world-news/defiant-trump-pleads-not-guilty-in-new-york-court-in-hush-money-case-3921104", "urlToImage": "https://c.ndtvimg.com/2023-04/uue7q7u_trump_625x300_05_April_23.jpg", "publishedAt": "2023-04-04T20:35:53Z", "content": "\"Not guilty,\" Drump Trump said in a clear voice inside the courtroom.\r\nNew York: Donald Trump on Tuesday pleaded not guilty to 34 felony counts inside a packed New York courtroom ahead of a trial tha… [+5234 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Health expert talks impact of living with chronic cough - KOIN 6", "description": "Pulmonologist Dr. Meilan Han and Bev Stewart – National Senior Director of Lung Diseases at the American Lung Association -- joined Everyday Northwest to tal...", "url": "https://www.youtube.com/watch?v=PiHfgTX0XjI", "urlToImage": "https://i.ytimg.com/vi/PiHfgTX0XjI/maxresdefault.jpg", "publishedAt": "2023-04-04T18:34:20Z", "content": null}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "Steve Gorman (Reuters)", "title": "NASA names woman, black astronauts for new mission - The Jakarta Post", "description": "The United States space agency NASA on Monday named the first woman and the first African American ever assigned as astronauts to a lunar mission, introducing them as part of the four-member team chosen to fly on what would be the first crewed voyage around t…", "url": "https://www.thejakartapost.com/paper/2023/04/05/nasa-names-woman-black-astronauts-for-new-mission.html", "urlToImage": "", "publishedAt": "2023-04-04T18:07:40Z", "content": "The United States space agency NASA on Monday named the first woman and the first African American ever assigned as astronauts to a lunar mission, introducing them as part of the four-member team cho… [+599 chars]"}]}