{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "A single mistake could explain the Mexico kidnappings - BBC", "description": "A theory that the kidnapping of four Americans was a case of mistaken identity gains strength.", "url": "https://www.bbc.com/news/world-latin-america-64825204", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/53B4/production/_128882412_p0f7bd35.jpg", "publishedAt": "2023-03-08T20:00:31Z", "content": "Media caption, Video shows the moment four Americans were kidnapped in Mexico\r\nFour Americans were kidnapped by armed men last week soon after crossing into the Mexican border city of Matamoros. Two … [+3060 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Kate Dore, CFP®", "title": "Biden calls for tax on the wealthy to extend Medicare funding - CNBC", "description": "President Joe Biden this week called for higher taxes on wealthy Americans to boost Medicare as part of his 2024 budget. Here's what to know about the plan.", "url": "https://www.cnbc.com/2023/03/08/what-to-know-about-proposed-biden-tax-on-the-wealthy-to-fund-medicare.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107201160-1677616922992-gettyimages-1247562996-AFP_33AA2EM.jpeg?v=1678302122&w=1920&h=1080", "publishedAt": "2023-03-08T19:02:02Z", "content": "President Joe Biden this week called for higher taxes on wealthy Americans to boost Medicare as part of his 2024 budget, aiming to help fund the program for at least 25 years.\r\nThe plan would increas… [+1213 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell, Elizabeth Wolfe, Rosa Flores, Andy Rose", "title": "2 American survivors of deadly Mexico kidnapping are being treated in US hospital as bodies of 2 killed are examined - CNN", "description": "Two of the Americans who were kidnapped at gunpoint in a Mexican border city on Friday have returned to the US and are being treated at a hospital, while the remains of the two Americans who were killed are expected to be repatriated back to the US soon.", "url": "https://www.cnn.com/2023/03/08/americas/mexico-matamoros-americans-kidnapped-wednesday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230308092143-mcgee-williams-woodard-brown-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-08T18:44:00Z", "content": "Two of the Americans who were kidnapped at gunpoint in a Mexican border city on Friday have returned to the US and are being treated at a hospital, while the remains of the two Americans who were kil… [+8680 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Major North American oil source yields clues to one of Earth's deadliest mass extinctions - Phys.org", "description": "The Bakken Shale Formation—a 200,000-square-mile shale deposit below parts of Canada and North Dakota—has supplied billions of barrels of oil and natural gas to North America for 70 years. A new discovery reveals that the rocks also open a uniquely informativ…", "url": "https://phys.org/news/2023-03-major-north-american-oil-source.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2023/major-north-american-o.jpg", "publishedAt": "2023-03-08T17:45:07Z", "content": "The Bakken Shale Formationa 200,000-square-mile shale deposit below parts of Canada and North Dakotahas supplied billions of barrels of oil and natural gas to North America for 70 years. A new discov… [+5840 chars]"}]}