{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Blood Donor Study Estimates Over 80% of American Adults Now Have Coronavirus Antibodies - Gizmodo", "description": "The research suggests that four in five Americans over age 16 have antibodies, with most getting them from vaccination.", "url": "https://gizmodo.com/blood-donor-study-estimates-over-80-of-american-adults-1847613622", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/55ad4f154a056b6f1e4a9cf0545703f2.jpg", "publishedAt": "2021-09-03T17:08:00Z", "content": "New research indicates that over 80% of American adults now have antibodies to the coronavirus, earned either through infection or vaccination. The study, based on data collected from blood donors, e… [+3769 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Three New Species of Hand-Standing Spotted Skunks Discovered - SciTechDaily", "description": "Redesignating an endangered subspecies as a separate species could help it get protected. Picture a skunk. You’re probably thinking of a stocky animal, around the size of a housecat, black with white stripes, like Pepé Le Pew. That describes North America’s m…", "url": "https://scitechdaily.com/three-new-species-of-hand-standing-spotted-skunks-discovered/", "urlToImage": "https://scitechdaily.com/images/Spotted-Skunk-Signature-Handstand.jpg", "publishedAt": "2021-09-03T16:44:51Z", "content": "ByField MuseumSeptember 3, 2021\r\nA spotted skunk doing its signature handstand. Credit: (c) Jerry W. Dragoo\r\nRedesignating an endangered subspecies as a separate species could help it get protected.\r… [+7527 chars]"}, {"source": {"id": "financial-times", "name": "Financial Times"}, "author": "Mamta Badkar", "title": "Corporate America declines to comment on Texas abortion ban - Financial Times", "description": "News, analysis and comment from the Financial Times, the worldʼs leading global business publication", "url": "https://www.ft.com/content/7bd0442f-6069-4364-a4dd-1a91c1d34f82", "urlToImage": null, "publishedAt": "2021-09-03T04:00:19Z", "content": "Keep abreast of significant corporate, financial and political developments around the world.\r\nStay informed and spot emerging risks and opportunities with independent global reporting, expert\r\ncomme… [+32 chars]"}, {"source": {"id": null, "name": "One America News Network"}, "author": null, "title": "Life insurers shift to pre-pandemic norms after COVID vaccine roll-outs - One America News Network", "description": "By Carolyn Cohn and Noor Zainab Hussain LONDON (Reuters) - The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with underlying health", "url": "https://www.oann.com/life-insurers-shift-to-pre-pandemic-norms-after-covid-vaccine-roll-outs/", "urlToImage": "https://dzm0ugdauank9.cloudfront.net/wp-content/uploads/2021/09/2021-09-02T135113Z_2_LYNXMPEH810OX_RTROPTP_0_HEALTH-CORONAVIRUS-FRANCE_1.jpg", "publishedAt": "2021-09-02T14:32:09Z", "content": "September 3, 2021\r\nBy Carolyn Cohn and Noor Zainab Hussain\r\nLONDON (Reuters) – The roll-out of COVID-19 vaccinations is making life insurers more enthusiastic about offering cover to those with under… [+4997 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Travis Caldwell", "title": "More than 500000 U.S. children tested positive for COVID-19 in 3 weeks - CTV News", "description": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not yet eligible to receive vaccinations.", "url": "https://www.ctvnews.ca/health/coronavirus/more-than-500-000-u-s-children-tested-positive-for-covid-19-in-3-weeks-1.5570853", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5570872.1630590742!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T13:54:40Z", "content": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not y… [+7020 chars]"}]}