{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Lee Brown", "title": "UK mass shooter was a virgin 'incel' who warned he was 'a Terminator' - New York Post ", "description": "Jake Davison — the crazed killer who gunned down five people, including a young girl — said he was an American-born, virgin “incel” — and compared himself to “Th…", "url": "https://nypost.com/2021/08/13/uk-mass-shooter-who-killed-5-warned-he-was-a-terminator/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/08/plymouth.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-08-13T13:48:00Z", "content": "The crazed killer who gunned down five people, including a young girl, in the UK’s deadliest mass shooting in more than a decade said he was an American-born, virgin “incel” — and compared himself to… [+3191 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lucas Tomlinson", "title": "Taliban insurgents take Kandahar, Herat as US plans to evacuate Americans from embassy in Kabul - Fox News", "description": "Taliban insurgents in Afghanistan on Friday seized Kandahar and Herat—the country’s second and third largest cities, hours after Fox News confirmed that the U.S. military will help evacuate Americans from the embassy in Kabul.", "url": "https://www.foxnews.com/world/taliban-takes-kandahar", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/08/Kandahar-thumb.jpg", "publishedAt": "2021-08-13T10:01:42Z", "content": "Taliban insurgents in Afghanistan on Friday seized Kandahar and Heratthe countrys second and third largest cities, hours after Fox News confirmed that the U.S. military will help evacuate Americans f… [+1850 chars]"}, {"source": {"id": null, "name": "Rappler"}, "author": "Rappler.com", "title": "LOOK: Filipina doctor has Barbie doll made after her - Rappler", "description": "Audrey Sue Cruz is the first Filipina-American doctor to have a Barbie doll made in her likeness", "url": "https://www.rappler.com/life-and-style/arts-culture/filipina-american-doctor-audrey-cruz-barbie-doll-august-2021", "urlToImage": "https://assets2.rappler.com/2021/08/Screen-Shot-2021-08-13-at-3.51.00-PM-1628841208370.png", "publishedAt": "2021-08-13T08:08:00Z", "content": "\"Im SO incredibly honored. Heres to breaking barriers, speaking truths, and empowering the next generation,\" Cruz, 31, wrote in an August 4 Instagram post, holding up the first Barbie doll made in he… [+10 chars]"}, {"source": {"id": null, "name": "THE WEEK"}, "author": "PTI", "title": "Expect more children with coronavirus: Dr Fauci - THE WEEK", "description": "Dr. Anthony Fauci says Americans can expect to see more children infected with the coronavirus as the highly transmissible delta variant extends its hold across the country. Quantitatively, you will see more children in the hospital, the government's top infe…", "url": "https://www.theweek.in/news/health/2021/08/13/expect-more-children-with-coronavirus--dr-fauci-.html", "urlToImage": "https://www.theweek.in/content/dam/week/news/health/images/2020/8/11/kids-appe.jpg", "publishedAt": "2021-08-13T06:49:00Z", "content": "Dr. Anthony Fauci says Americans can expect to see more children infected with the coronavirus as the highly transmissible delta variant extends its hold across the country.\r\nQuantitatively, you will… [+794 chars]"}, {"source": {"id": null, "name": "Nation.lk"}, "author": null, "title": "A FIFTH of Americans believe in COVID-19 vaccination misinformation including that it alters DNA - nation.lk - The Nation Newspaper", "description": "A Harvard University study finds that one out of every five Americans believes at least one piece of vaccine misinformation. Lies about vaccines have become rampant on social media over the past months.", "url": "https://www.nation.lk/online/a-fifth-of-americans-believe-in-covid-19-vaccination-misinformation-including-that-it-alters-dna-110267.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/08/12/20/46613877-0-image-a-49_1628798182784.jpg", "publishedAt": "2021-08-12T21:04:18Z", "content": "One-fifth of Americans believe at least one common piece of misinformation about the COVID-19 vaccines, a new study finds.\r\nResearchers from Harvard University found that many adults in the U.S., vac… [+5287 chars]"}]}