{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "JON GAMBRELL", "title": "US Navy fires warning shots in new tense encounter with Iran - Yahoo News", "description": "An American warship fired warning shots when vessels of Iran's paramilitary Revolutionary Guard came too close to a patrol in the Persian Gulf, the U.S. Navy...", "url": "https://news.yahoo.com/us-navy-fires-warning-shots-031006623.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/0VKN2v5MIzUzb.KiRjKl2w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTIwMDA7aD0xMzMz/https://s.yimg.com/uu/api/res/1.2/BIFWlqkOJf8owx488f3xPw--~B/aD00NDgwO3c9NjcyMDthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/ap.org/2db8561c03df4786a09dfaec041ef12b", "publishedAt": "2021-04-28T03:13:57Z", "content": "DUBAI, United Arab Emirates (AP) An American warship fired warning shots when vessels of Iran's paramilitary Revolutionary Guard came too close to a patrol in the Persian Gulf, the U.S. Navy said Wed… [+3239 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Don Tagala, ABS-CBN News", "title": "Biden picks Fil-Am Gina Ortiz Jones as Air Force undersecretary - ABS-CBN News", "description": "US President Joe Biden on Tuesday nominated Filipino-American Gina Ortiz Jones as undersecretary of the US Air Force.", "url": "https://news.abs-cbn.com/overseas/04/28/21/biden-picks-fil-am-gina-ortiz-jones-as-air-force-undersecretary", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/overseas/04/28/20210428-gina-ortiz-jones.jpg", "publishedAt": "2021-04-28T01:25:00Z", "content": "MANILA - US President Joe Biden on Tuesday nominated Filipino-American Gina Ortiz Jones as undersecretary of the US Air Force.\r\nIf confirmed, Jones will be the first woman of color and a Filipino-Ame… [+1246 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ariel Zilber, Keith Griffith, Agencies", "title": "American warships fire warning shots at Iranian gunboats in Persian Gulf on Monday - Daily Mail", "description": "A US military ship fired warning shots after three vessels from Iran's Islamic Revolutionary Guard Corps Navy came close to it and another American patrol boat in the Gulf, US military said on Tuesday.", "url": "https://www.dailymail.co.uk/news/article-9518263/U-S-Navy-ship-fires-warning-shots-close-encounter-Iranian-vessels.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/27/22/42295998-0-image-a-12_1619560487178.jpg", "publishedAt": "2021-04-27T20:18:39Z", "content": "A US military ship fired warning shots after three vessels from Iran's Islamic Revolutionary Guard Corps Navy (IRGCN) came close to it and another American patrol boat in the Gulf, the United States … [+3747 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Mike Stobbe", "title": "Vaccinated Americans can now go outside without a mask, CDC says - Sydney Morning Herald", "description": "The new guidance represents another carefully calibrated step on the road back to normal from the coronavirus outbreak that has killed more than 570,000 people in US.", "url": "https://www.smh.com.au/world/north-america/vaccinated-americans-can-now-go-outside-without-a-mask-cdc-says-20210428-p57myd.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.7041829454492382%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_626%2C$y_132/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/cf0fc3f424c6c41de3fad4359015708d8406595f", "publishedAt": "2021-04-27T17:51:37Z", "content": "The CDC says that fully vaccinated or not, people do not have to wear masks outdoors when they walk, bike or run alone or with members of their household. They can also go maskless in small outdoor g… [+1828 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Mike Stobbe", "title": "Vaccinated Americans can now go maskless in these situations, CDC says - Global News", "description": "The change comes as more than half of U.S. adults have gotten at least one dose of coronavirus vaccine, and more than a third have been fully vaccinated.", "url": "https://globalnews.ca/news/7813301/covid-coronavirus-mask-guidelines-outdoors-rollout/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2021/03/CP120028827-1-e1615923157139.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2021-04-27T17:12:48Z", "content": "The Centers for Disease Control and Prevention eased its guidelines Tuesday on the wearing of masks outdoors, saying fully vaccinated Americans don’t need to cover their faces anymore unless they are… [+5073 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Got 10 minutes? That's all you need for this high-intensity workout - Medical Xpress", "description": "High-intensity cycling in very short bursts can lead to performance and health benefits in just 10 minutes a day, according to a new study to be presented virtually this week at the American Physiological Society's (APS) annual meeting at Experimental Biology…", "url": "https://medicalxpress.com/news/2021-04-minutes-high-intensity-workout.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/homeworkout.jpg", "publishedAt": "2021-04-27T14:19:05Z", "content": "High-intensity cycling in very short bursts can lead to performance and health benefits in just 10 minutes a day, according to a new study to be presented virtually this week at the American Physiolo… [+1716 chars]"}, {"source": {"id": null, "name": "ecns"}, "author": null, "title": "Millions of Americans are missing second dose of COVID-19 vaccine: US media - ecns", "description": "More than 5 million Americans, or nearly 8 percent of those who received a first jab of their COVID-19 vaccine, have missed their scheduled second dose, U.S. media reported.", "url": "http://www.ecns.cn/news/2021-04-27/detail-ihakufzf0697760.shtml", "urlToImage": "", "publishedAt": "2021-04-27T08:37:13Z", "content": "Special: Battle Against Novel CoronavirusMore than 5 million Americans, or nearly 8 percent of those who received a first jab of their COVID-19 vaccine, have missed their scheduled second dose, U.S. … [+1060 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Sutirtho Patranobis", "title": "China censors Chloe Zhao’s historic Oscar win - Hindustan Times", "description": "Zhao on Sunday night became the second woman ever to win the coveted award at the Oscars, as her film Nomadland -- about marginalised Americans roaming the West -- bagged best picture and its lead, Frances McDormand, won best actress.", "url": "https://www.hindustantimes.com/world-news/china-censors-chloe-zhao-s-historic-oscar-win-101619488572931.html", "urlToImage": "https://images.hindustantimes.com/img/2021/04/27/1600x900/2021-04-26T124629Z_773639088_RC2O3N9CREAD_RTRMADP_3_AWARDS-OSCARS_1619488611136_1619488649415.JPG", "publishedAt": "2021-04-27T01:59:06Z", "content": "Beijing-born Chloe Zhao on Monday became the first woman of colour to win the Oscar for best director, but the country of her birth censored the news of her victory as leading Chinese state-run media… [+2555 chars]"}, {"source": {"id": null, "name": "CBS17.com"}, "author": "Brian Entin", "title": "CDC: More than 5M have skipped second dose of coronavirus vaccine - CBS17.com", "description": "More than 5 million Americans have skipped out on their second dose of the COVID-19 vaccine, according to The Centers for Disease Control and Prevention.", "url": "https://www.cbs17.com/community/health/coronavirus/cdc-more-than-5m-have-skipped-second-dose-of-coronavirus-vaccine/", "urlToImage": "https://www.cbs17.com/wp-content/uploads/sites/29/2021/04/GettyImages-1231208110.jpg?w=1280", "publishedAt": "2021-04-26T22:14:54Z", "content": "MIAMI (NewsNation Now) More than 5 million Americans have skipped out on their second dose of the COVID-19 vaccine, according to The Centers for Disease Control and Prevention. \r\nI was one of those p… [+981 chars]"}]}