{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "Thomas M. Orbos", "title": "Deconstruction for a better Build, Build, Build program - BusinessMirror", "description": "California, the great American state of freeways, made a historic turnaround last week with its decision to ban the sale of gas-fed cars by 2035. This is expected to trigger a domino effect on other US states, as well as other countries and will result in the…", "url": "https://businessmirror.com.ph/2022/08/29/deconstruction-for-a-better-build-build-build-program/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/01/Column-box-Thomas-M.-Orbos-Street-Talk.jpg", "publishedAt": "2022-08-28T18:16:40Z", "content": "California, the great American state of freeways, made a historic turnaround last week with its decision to ban the sale of gas-fed cars by 2035. This is expected to trigger a domino effect on other … [+4165 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Lee", "title": "Colorado secretary of state claims Americans could 'lose right to vote within months' if GOP wins election - Fox News", "description": "Colorado Secretary of State Jena Griswold warned that the GOP will attack the right to vote if Republicans emerge with election victories in November's midterm elections.", "url": "https://www.foxnews.com/us/colorado-secretary-state-claims-americans-could-lose-right-vote-months-gop-wins-election", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/08/Griswold.jpg", "publishedAt": "2022-08-28T17:15:43Z", "content": "Colorado Secretary of State Jena Griswold claimed Republicans plan to attack Americans' right to vote if they are able to win this year's midterm elections.\r\n\"What we can expect from the extreme Repu… [+2196 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Play A Key Role In Countering China: US Navy Chief - NDTV", "description": "US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in the future, playing a key role in countering China.", "url": "https://www.ndtv.com/india-news/india-to-play-a-key-role-in-countering-china-us-navy-chief-3291871", "urlToImage": "https://i.ndtvimg.com/i/2018-04/india-china-flags_650x400_61523324939.jpg", "publishedAt": "2022-08-27T13:46:39Z", "content": "India presents China with a two-front problem, said the US Navy Chief (Representational)\r\nTokyo: US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in … [+3390 chars]"}, {"source": {"id": null, "name": "Dominicantoday.com"}, "author": "Merit Designs Consulting Group, 2006-2020", "title": "“Vaccinated mosquitoes” used to combat dengue fever - Dominican Today", "description": "<p>This experiment was unveiled at yesterday’s commemoration of International Dengue Day. The Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addition to measures such as the elimination of mosquito breedi…", "url": "https://dominicantoday.com/dr/local/2022/08/27/vaccinated-mosquitoes-used-to-combat-dengue-fever/", "urlToImage": "https://dominicantoday.com/wp-content/uploads/2022/08/14_El-Mundo_27_1p01.jpg", "publishedAt": "2022-08-27T10:11:00Z", "content": "This experiment was unveiled at yesterday’s commemoration of International Dengue Day.\r\nThe Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addit… [+2024 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Karyn Maughan and Jan Gerber", "title": "Public Protector paid 'fugitive from justice' Ngobeni R87k for articles bashing Mkhwebane foes - News24", "description": "Paul Ngobeni was disbarred in several states in the US and, after being charged with several counts of larceny, forgery and practising while not an attorney in 2007, he went on the run from American law enforcement agencies.", "url": "https://www.news24.com/news24/southafrica/politics/parliament/public-protector-paid-fugitive-from-justice-ngobeni-r87k-for-articles-bashing-mkhwebane-foes-20220827", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3752/8caecffd900f407b9d16cbe797d204ce.jpeg", "publishedAt": "2022-08-27T04:00:14Z", "content": "\"Fugitive from justice\" Paul Ngobeni was credited for suggesting Public Protector Busisiwe Mkhwebane sue the government for \"insufficient funding\", while he collected massive pay cheques from her off… [+468 chars]"}]}