{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Deadline"}, "author": "Ted Johnson", "title": "Meryl Streep, Jennifer Lopez And Julia Roberts Among Celebrities Appearing At Oprah Winfrey-Hosted Kamala Harris ‘Unite For America’ Event - Deadline", "description": "Winfrey hosted an event for Kamala Harris that was set up in a talk show format.", "url": "http://deadline.com/2024/09/kamala-harris-oprah-winfrey-election-event-1236095021/", "urlToImage": "https://deadline.com/wp-content/uploads/2024/09/Oprah-Kamala-Harris.jpg?w=1024", "publishedAt": "2024-09-20T00:22:00Z", "content": "Oprah Winfrey returned to the talk show format for an in-person and virtual event for Kamala Harris, interspersing emotion and uplift with infomercial appeals to organize for the vice president’s can… [+6038 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Nathaniel Weixel", "title": "Report: Cancer deaths have dropped, but alcohol is factor in new cases - The Hill", "description": "Scientific advances helped avert 4.1 million deaths from cancer in the 30 years between 1991 and 2021 according to a new report, but the disease continues to be a public health challenge.  The report, released Wednesday by the American Association for Cancer …", "url": "https://thehill.com/policy/healthcare/4889293-cancer-death-rate-decline-report/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/01/Cancer_012324_Illustratation_AdobeStock.png?w=1280", "publishedAt": "2024-09-19T20:18:00Z", "content": "Skip to content\r\nScientific advances helped avert 4.1 million deaths from cancer in the 30 years between 1991 and 2021 according to a new report, but the disease continues to be a public health chall… [+2354 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Timothy Nerozzi", "title": "Navy prepares for China conflict with newly announced strategy - Fox News", "description": "The United States Navy released its \"Navigation Plan for America’s Warfighting Navy\" on Thursday, outlining how the U.S. will meet the growing threat of Chinese military aggression against Taiwan by 2027.", "url": "https://www.foxnews.com/us/navy-prepares-china-conflict-newly-announced-strategy", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/09/GettyImages-2161031711-scaled-e1726766938601.jpg", "publishedAt": "2024-09-19T18:26:00Z", "content": "The United States Navy has released documents outlining its goals for meeting the growing threat of Chinese military power in the coming years.\r\nThe Navigation Plan for Americas Warfighting Navy, pub… [+3106 chars]"}]}