{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NEWS10 ABC"}, "author": "Stephanie Rivas", "title": "Women’s Health: National Kidney Month - NEWS10 ABC", "description": "March is National Kidney Month. Both men and women can be diagnosed with Chronic Kidney Disease. According to the CDC, over 15 percent of all American adults are estimated to have it. However, women do face different challenges when it comes to kidney issues.", "url": "https://www.news10.com/news/womens-health-national-kidney-month/", "urlToImage": "https://www.news10.com/wp-content/uploads/sites/64/2022/03/Screen-Shot-2022-03-31-at-9.26.30-AM.png?w=1280", "publishedAt": "2022-03-31T13:52:49Z", "content": "ALBANY, N.Y. (NEWS10) March is National Kidney Month. Both men and women can be diagnosed with chronic kidney disease, which may be more prevalent than most realize. According to the CDC, over 15 per… [+1596 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Fadel Allassan", "title": "US to issue gender-neutral \"X\" passports - Axios", "description": "It's a milestone for Americans who identify as nonbinary and gender-nonconforming.", "url": "https://www.axios.com/us-gender-neutral-x-passports-a5374c37-5bbe-4696-8df5-54e351086ce4.html", "urlToImage": "https://images.axios.com/KoWqRr8ysblxSoAmZ_QtIZdeqgA=/0x108:3000x1795/1366x768/2022/03/31/1648693812276.jpg", "publishedAt": "2022-03-31T10:28:53Z", "content": "U.S. citizens will be able select \"X\" as their gender on their U.S. passport applications from April 11, the White House announced Thursday as part of a rollout of new policies to coincide with Trans… [+1587 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Record-Setting NASA Astronaut and Two Cosmonauts Return From International Space Station - SciTechDaily", "description": "After extending the record for the longest single spaceflight in history by an American to 355 days, NASA astronaut Mark Vande Hei returned to Earth on Wednesday, March 30, 2022, along with Roscosmos cosmonauts Anton Shkaplerov and Pyotr Dubrov. The trio depa…", "url": "https://scitechdaily.com/record-setting-nasa-astronaut-and-two-cosmonauts-return-from-international-space-station/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronaut-Mark-Vande-Hei-After-Landing.jpg", "publishedAt": "2022-03-31T09:36:18Z", "content": "NASA astronaut Mark Vande Hei is seen outside the Soyuz MS-19 spacecraft after he landed with Russian cosmonauts Anton Shkaplerov and Pyotr Dubrov in a remote area near the town of Zhezkazgan, Kazakh… [+3705 chars]"}, {"source": {"id": null, "name": "Daily Sabah"}, "author": "Deutsche Presse-Agentur - dpa", "title": "Jeff Koons to send sculptures to moon as part of NFT launch | Daily Sabah - Daily Sabah", "description": "American pop artist Jeff Koons will exhibit his sculptures on a more exotic space now: The moon. The artist aims to send his work to the moon where it will...", "url": "https://www.dailysabah.com/arts/events/jeff-koons-to-send-sculptures-to-moon-as-part-of-nft-launch", "urlToImage": "https://idsb.tmgrup.com.tr/ly/uploads/images/2022/03/31/thumbs/800x531/195032.jpg", "publishedAt": "2022-03-31T06:33:00Z", "content": "American pop artist Jeff Koons will exhibit his sculptures on a more exotic space now: The moon. The artist aims to send his work to the moon where it will be sold as non-fungible tokens (NFTs).\r\nAs … [+1177 chars]"}]}