{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Tyson Fury v Deontay Wilder III live - Brit defends his WBC world heavyweight title - Stuff.co.nz", "description": "The unbeaten Brit defends his WBC world heavyweight title against the hard-punching American in a high-stakes trilogy fight in Las Vegas.", "url": "https://www.stuff.co.nz/sport/combat-sports/300422398/tyson-fury-v-deontay-wilder-iii-live--brit-defends-his-wbc-world-heavyweight-title", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/p/z/5/g/image.related.StuffLandscapeSixteenByNine.1420x800.4yv3em.png/1633829503135.jpg", "publishedAt": "2021-10-10T01:30:00Z", "content": "Tyson Fury defends his WBC heavyweight title against Deontay Wilder at the T-Mobile Arena in Las Vegas.\r\nTyson Fury dominated Deontay Wilder in their rematch last year, stopping the hard-hitting Amer… [+25 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "New York Times", "title": "‘Starting a fire’: America and China enter dangerous territory over Taiwan - Economic Times", "description": "After holding out against unification demands from Chinas communist rulers for more than 70 years, Taiwan is now at the heart of the deepening discord between China and the U.S. The islands fate has the potential to reshape the regional order and even to igni…", "url": "https://economictimes.indiatimes.com/news/defence/starting-a-fire-america-and-china-enter-dangerous-territory-over-taiwan/articleshow/86897790.cms", "urlToImage": "https://img.etimg.com/thumb/msid-86897934,width-1070,height-580,imgsize-23350,overlay-etdefence/photo.jpg", "publishedAt": "2021-10-09T17:44:00Z", "content": "The 25 Chinese fighter jets, bombers and other warplanes flew in menacing formations off the southern end of Taiwan, a show of military might on Chinas National Day, Oct. 1. The incursions, dozens up… [+14029 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Basit Aijaz", "title": "Indian-American Astronaut Raja Chari All Set For First Spaceflight, To Command NASA SpaceX Crew-3 Mission - India Times", "description": "Raja Chari, an Indian-born astronaut, will be leading the SpaceX-NASA collaborative Crew-3 mission that is preparing to take four astronauts to the International Space Station (ISS) later this month.\"NASA's SpaceX Crew-3 mission will carry NASA astronauts Raj…", "url": "https://www.indiatimes.com/trending/human-interest/raja-chari-to-lead-nasa-spacex-crew-3-mission-551269.html", "urlToImage": "https://im.indiatimes.in/content/2021/Oct/raja-chari-1200-1607610076_616134f7394a3.jpg", "publishedAt": "2021-10-09T07:15:42Z", "content": "Raja Chari, an Indian-born astronaut, will be leading the SpaceX-NASA collaborative Crew-3 mission that is preparing to take four astronauts to the International Space Station (ISS) later this month.… [+1306 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA News", "title": "WHO Announces First Clinical Definition of ‘Long COVID’ - Voice of America", "description": "Definition will help establish standards of care for those suffering from COVID-19 symptoms that linger", "url": "https://www.voanews.com/a/who-announces-first-clinical-definition-of-long-covid-/6263379.html", "urlToImage": "https://gdb.voanews.com/307100C0-460F-4DCC-A420-34A41904730A_w1200_r1.jpg", "publishedAt": "2021-10-08T20:11:57Z", "content": "The World Health Organization announced Friday that it had established and released the first standardized, clinical definition of what is commonly known as long COVID, to help boost treatment for su… [+3014 chars]"}, {"source": {"id": null, "name": "Californianewstimes.com"}, "author": "fresno", "title": "How to Raise awareness on Breast Cancer - California News Times", "description": "What can you do to raise awareness? 1 in 8 American women are diagnosed with breast cancer in their lifetime. This cool fact reminds us that breast cancer is a disease that affects everyone. Most of u", "url": "https://californianewstimes.com/how-to-raise-awareness-on-breast-cancer/544253/", "urlToImage": "https://www.fresyes.com/wp-content/uploads/2021/10/shutterstock_724076257.jpeg", "publishedAt": "2021-10-01T17:15:49Z", "content": "What can you do to raise awareness?\r\n1 in 8 American women are diagnosed with breast cancer in their lifetime. This cool fact reminds us that breast cancer is a disease that affects everyone. Most of… [+5289 chars]"}]}