{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Homero De la Fuente", "title": "Reigning NCAA champion Rose Zhang becomes 1st LPGA golfer to win tournament in pro debut since 1951 - CNN", "description": "Twenty-year-old golf phenom Rose Zhang etched her name in the history books yet again on Sunday, edging Jennifer Kupcho in a sudden death playoff at the Mizuho Americas Open to become the first player to win an LPGA tournament in her professional debut in 72 …", "url": "https://www.cnn.com/2023/06/05/sport/ncaa-rose-zhang-lpga-tournament/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230605131450-02-ncaa-rose-zhang-lpga-tournament.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-06-05T07:15:00Z", "content": "Twenty-year-old golf phenom Rose Zhang etched her name in the history books yet again on Sunday, edging Jennifer Kupcho in a sudden death playoff at the Mizuho Americas Open to become the first playe… [+3074 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "David Rising", "title": "US releases video showing close-call in Taiwan Strait with Chinese destroyer - The Associated Press", "description": "BANGKOK (AP) — The United States military released video Monday of what it called an “unsafe” Chinese maneuver in the Taiwan Strait on the weekend, in which a Chinese navy ship cut sharply across the path of an American destroyer, forcing the U.S.", "url": "https://apnews.com/article/us-china-taiwan-strait-489a45bb6df134fa09443d285b3f8669", "urlToImage": "https://storage.googleapis.com/afs-prod/media/c5c2eb573dff49a688c81c9fe4adc103/3000.webp", "publishedAt": "2023-06-05T06:00:55Z", "content": "BANGKOK (AP) The United States military released video Monday of what it called an unsafe Chinese maneuver in the Taiwan Strait on the weekend, in which a Chinese navy ship cut sharply across the pat… [+2729 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Steven F. Hayward", "title": "This Pride Month, it's the Revolt of the 'Normies' as Americans reject extremism - New York Post ", "description": "For American institutions that have indulged this extremism, perhaps we should say that Pride Month goeth before the fall.", "url": "https://nypost.com/2023/06/04/this-pride-month-its-the-revolt-of-the-normies-as-americans-reject-extremism/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2023/06/newspress-collage-27343910-1685929390684.jpg?quality=75&strip=all&1685915033&w=1024", "publishedAt": "2023-06-05T01:52:00Z", "content": "If you are old enough, cast your mind back to the 1984 Democratic National Convention held in San Francisco. \r\nThis writer covered it as a young reporter, taking in the flamboyant gay-pride parade on… [+5420 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Gene Maddaus", "title": "WGA, SAG-AFTRA Say DGA Deal Won’t Change Their Contract Goals - Variety", "description": "The Writers Guild of America and SAG-AFTRA congratulated the Directors Guild of America on reaching an agreement with the studios on Sunday, but both groups stressed that the deal does not change t…", "url": "https://variety.com/2023/biz/news/wga-sag-aftra-dga-deal-wont-change-goals-1235632618/", "urlToImage": "https://variety.com/wp-content/uploads/2020/07/losangelesvenues232481.jpg?w=1000&h=563&crop=1", "publishedAt": "2023-06-05T00:25:00Z", "content": "The Writers Guild of America and SAG-AFTRA congratulated the Directors Guild of America on reaching an agreement with the studios on Sunday, but both groups stressed that the deal does not change the… [+2003 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "16 migrants flown from Texas to California in chartered private jet - KTLA 5", "description": "An investigation is underway after 16 South American migrants were flown from Texas to Sacramento on a private plane.(June 4, 2023)Get Los Angeles breaking n...", "url": "https://www.youtube.com/watch?v=_AtJcruHlqQ", "urlToImage": "https://i.ytimg.com/vi/_AtJcruHlqQ/maxresdefault.jpg", "publishedAt": "2023-06-04T17:09:35Z", "content": null}]}