{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Jon Batiste leads Grammy nominations — Justin Bieber, Doja Cat, H.E.R. closely follow - CBC.ca", "description": "American musician and multi-genre performer scored the most nominations with 11, including an album of the year nod for We Are and record of the year with Freedom. Bieber, Doja Cat and H.E.R. each came away with the second-most nominations with eight each.", "url": "https://www.cbc.ca/news/entertainment/jon-batiste-grammy-nominations-bieber-doja-cat-her-1.6258437", "urlToImage": "https://i.cbc.ca/1.6259682.1637692389!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/jon-batiste.jpg", "publishedAt": "2021-11-23T22:32:00Z", "content": "Canadian musical talent was in the spotlight today at the nominations announcement for the 64th Grammy Awards, as some of the country's biggest hitmakers like Justin Bieber and Drake were named, as w… [+6904 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Mónica Marie Zorrilla", "title": "TV Ratings: 2021 American Music Awards Hold Steady Amid Social Media Flurry - Variety", "description": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged. Sunday night’s awards show, which was hosted by Cardi B, averaged a 1.0/7 rating among adults …", "url": "https://variety.com/2021/tv/news/tv-ratings-2021-american-music-awards-1235118124/", "urlToImage": "https://variety.com/wp-content/uploads/2021/11/161383_SC1_5006.jpg?w=1000", "publishedAt": "2021-11-23T19:28:00Z", "content": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged.\r\nSunday night’s awards show, which… [+2230 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Former Nintendo Exec Reggie Fils-Aimé Hosts Xbox Event For Microsoft - Kotaku Australia", "description": "Right from the get go, former Nintendo of America president Reggie Fils-Aimé addresses the elephant in the room: “I’m sure...", "url": "https://www.kotaku.com.au/2021/11/former-nintendo-exec-reggie-fils-aim-hosts-xbox-event-for-microsoft/", "urlToImage": "https://imgix.kotaku.com.au/content/uploads/sites/3/2021/11/23/1e248f865e3677d0b78559ef20fa157c.jpg?ar=16%3A9&auto=format&fit=crop&q=80&w=1200&nr=20", "publishedAt": "2021-11-23T11:00:00Z", "content": "Right from the get go, former Nintendo of America president Reggie Fils-Aimé addresses the elephant in the room: Im sure at this point youre wondering, what is the former president and chief operatin… [+2056 chars]"}]}