{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Limited postpartum follow-up may miss high blood pressure in 1 in 10 new moms - Medical Xpress", "description": "In an analysis of more than 2,400 women, about 1 in 10 without a history of blood pressure issues were diagnosed with high blood pressure in the year after childbirth, according to a research article published today in Hypertension, an American Heart Associat…", "url": "https://medicalxpress.com/news/2022-11-limited-postpartum-follow-up-high-blood.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-highbloodpre.jpg", "publishedAt": "2022-11-15T10:00:02Z", "content": "In an analysis of more than 2,400 women, about 1 in 10 without a history of blood pressure issues were diagnosed with high blood pressure in the year after childbirth, according to a research article… [+6796 chars]"}, {"source": {"id": "financial-post", "name": "Financial Post"}, "author": "Joe Mcdonald, The Associated Press", "title": "Asian stocks mixed after Wall St falls, China retail slows - Financial Post", "description": "BEIJING (AP) — Global stocks gained Tuesday after Wall Street gave back some of last week’s huge gains, the American and Chinese presidents met and China’s…", "url": "https://financialpost.com/pmn/business-pmn/asian-stocks-mixed-after-wall-st-falls-china-retail-slows", "urlToImage": null, "publishedAt": "2022-11-15T08:49:09Z", "content": "Author of the article:\r\nArticle content\r\nBEIJING (AP) Global stocks gained Tuesday after Wall Street gave back some of last weeks huge gains, the American and Chinese presidents met and Chinas consum… [+4699 chars]"}, {"source": {"id": null, "name": "Pan American Health Organization"}, "author": null, "title": "Management of Severe Monkeypox in Brazil and Colombia. - Pan American Health Organization", "description": "Between 6-10% of reported MPX cases will require hospital admission. Most common reasons for admission are pain management (usually related to proctitis or tonsillitis), inability to swallow, urine retention, encephalitis or complications including bacterial …", "url": "https://www.paho.org/en/events/management-severe-monkeypox-brazil-and-colombia", "urlToImage": "https://www.paho.org/sites/default/files/styles/max_650x650/public/2022-11/23.jpg?itok=2mYr38sq", "publishedAt": "2022-11-14T20:32:12Z", "content": "Between 6-10% of reported MPX cases will require hospital admission. Most common reasons for admission are pain management (usually related to proctitis or tonsillitis), inability to swallow, urine r… [+1253 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "\"Black Panther: Wakanda Forever\" crushes the box office on release - Africanews English", "description": "\"Black Panther: Wakanda Forever,\" the sequel to the Afro-futuristic Marvel film that bombed in 2018, has largely dominated the North American box office in its first weekend in theatres, according to figures Sunday from trade firm Exhibitor Relations.", "url": "http://www.africanews.com/2022/11/14/black-panther-wakanda-forever-crushes-the-box-office-on-release/", "urlToImage": "https://static.euronews.com/articles/stories/07/19/28/20/1024x538_cmsv2_2f17061d-3dda-590d-a574-ad7ec5995d89-7192820.jpg", "publishedAt": "2022-11-14T10:35:29Z", "content": "\"Black Panther: Wakanda Forever,\" the sequel to the Afro-futuristic Marvel film that bombed in 2018, has largely dominated the North American box office in its first weekend in theatres, according to… [+1785 chars]"}]}