{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler", "title": "First US government-organized convoy evacuates private American citizens from Sudan conflict - CNN", "description": "The first US-led effort to evacuate private American citizens from the conflict in Sudan was completed Saturday, with a convoy organized by the US government reaching Port Sudan after a long journey from Khartoum.", "url": "https://www.cnn.com/2023/04/29/politics/american-citizens-sudan-convoy-evacuation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230429115656-01-sudan-clashes-0428.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-29T17:19:00Z", "content": "The first US-led effort to evacuate private American citizens from the conflict in Sudan was completed Saturday, with a convoy organized by the US government reaching Port Sudan after a long journey … [+4855 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Michael Wayland", "title": "Why GM is killing the Chevy Bolt — America's cheapest EV — amid record sales - CNBC", "description": "To reach stated EV goals, GM needs the production capacity, profits and market positioning of its next-generation EVs. It doesn't believe it needs the Bolt.", "url": "https://www.cnbc.com/2023/04/29/why-gm-is-killing-the-chevy-bolt-ev-amid-record-sales.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107046644-1649882743073-bolt_IMG_1304.jpg?v=1682774422&w=1920&h=1080", "publishedAt": "2023-04-29T13:20:22Z", "content": "A Chevrolet Bolt EUV on display at the New York Auto Show, April 13, 2022.\r\nDETROIT After years of lackluster performance and a fire-provoked recall, the all-electric Chevrolet Bolt EV was finally ga… [+7035 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Popular diets may increase risk of heart disease, American Heart Association says - CBS News", "description": "Some popular diet trends, including the keto and paleo diets, may have an adverse effect on heart health, a new statement from the American Heart Association...", "url": "https://www.youtube.com/watch?v=9sype80dh_Q", "urlToImage": "https://i.ytimg.com/vi/9sype80dh_Q/maxresdefault.jpg", "publishedAt": "2023-04-28T20:52:52Z", "content": null}]}