{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "29 Days on the Edge: The Road To Launch and Beyond for NASA’s James Webb Space Telescope - SciTechDaily", "description": "Now that NASA’s James Webb Space Telescope has safely arrived at its launch site in French Guiana, on the northeastern coast of South America, technical teams have begun making progress on the final checklist of preparations before liftoff later this year. Th…", "url": "https://scitechdaily.com/29-days-on-the-edge-the-road-to-launch-and-beyond-for-nasas-james-webb-space-telescope/", "urlToImage": "https://scitechdaily.com/images/NASAs-James-Webb-Space-Telescope.gif", "publishedAt": "2021-11-04T03:23:49Z", "content": "ByThaddeus Cesari, NASAs Goddard Space Flight CenterNovember 3, 2021\r\nNASA’s James Webb Space Telescope. Credit: NASA’s Goddard Space Flight Center Conceptual Image Lab\r\nNow that NASA\r\nEstablished in… [+9349 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Aditya Sharma", "title": "Strong Solar Flare Could Trigger Auroras on Earth – In Time for Diwali in India - The Wire Science", "description": "A strong solar flare erupted earlier this week that could affect GPS and communication satellites in the coming days, and also cause auroras in Europe and North America.", "url": "https://science.thewire.in/the-sciences/strong-solar-flare-could-trigger-auroras-on-earth-in-time-for-diwali-in-india/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2021/09/20081751/20141220_171.131blend-scaled.jpg", "publishedAt": "2021-11-04T02:35:04Z", "content": "Representative image: The Sun emitting a significant solar flare in December 2014. Image: NASA Solar Dynamics Observatory\r\nA strong solar flare erupted earlier this week that could affect GPS and com… [+1923 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "What the pandemic taught us about American preparedness - PBS NewsHour", "description": "COVID-19 has claimed the lives of over 5 million people globally and nearly 750,000 Americans. While questions about its origins still exist, the world has l...", "url": "https://www.youtube.com/watch?v=nKw-H_F7cGA", "urlToImage": "https://i.ytimg.com/vi/nKw-H_F7cGA/maxresdefault.jpg", "publishedAt": "2021-11-03T22:52:16Z", "content": null}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Tim Cohen", "title": "Anglo American appoints Duncan Wanblad as new CEO and, mirabile, he is South African - Daily Maverick", "description": "Anglo American has appointed insider Duncan Wanblad as its new CEO. He becomes the first South African to run the company that’s been ingrained in South Africa’s history for 15 years.", "url": "https://www.dailymaverick.co.za/article/2021-11-03-anglo-american-appoints-duncan-wanblad-as-new-ceo-and-mirabile-he-is-south-african/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/11/BM-Tim-AngloCEO-option-1.jpg", "publishedAt": "2021-11-03T19:30:05Z", "content": "Duncan Wanblad takes over as Anglo American CEO from Australian Mark Cutifani, who has run Anglo for just under a decade, rescuing the London-listed company from a near-death experience and turning i… [+3289 chars]"}]}