{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Tennis World USA"}, "author": "Lorenzo Ciotti", "title": "US Open: Rafael Nadal's gesture left the crowd speechless - Tennis World USA", "description": "Nadal, in the third set with the American at 5-3 in, gave up in the middle of a game to play a point that was practically lost, turning his back to court and opponent and going to his towel, leaving the crowd speechless", "url": "https://www.tennisworldusa.org/tennis/news/Rafael_Nadal/120124/us-open-rafael-nadal-s-gesture-left-the-crowd-speechless/", "urlToImage": "https://www.tennisworldusa.org/imgb/122160/us-open-rafael-nadal-s-gesture-left-the-crowd-speechless.webp", "publishedAt": "2022-09-09T00:30:00Z", "content": "Rafael Nadal was eliminated in the fourth round of the US Open 2022 by a great performance by young US star Frances Tiafoe, winner in 4 sets. However, a detail of the match has not escaped the camera… [+2173 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Stretch Drive: Blue Jays in control of playoff destiny with four weeks to go - Sportsnet.ca", "description": "A series win over the Baltimore Orioles this week gave the Toronto Blue Jays some much-needed breathing room in the American League playoff race. Canada's lone Major League Baseball team is in control of its own destiny with four weeks left in the regular sea…", "url": "https://www.sportsnet.ca/mlb/article/stretch-drive-blue-jays-in-control-of-playoff-destiny-with-four-weeks-to-go/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/09/Toronto-Blue-Jays-players-celebrate-1040x572.jpg", "publishedAt": "2022-09-08T18:07:00Z", "content": "A series win over the Baltimore Orioles this week gave the Toronto Blue Jays some much-needed breathing room in the American League playoff race.\r\nCanada's lone Major League Baseball team is in contr… [+4197 chars]"}, {"source": {"id": null, "name": "Latest News in Nigeria & Breaking Naija News 24/7 | LEGIT.NG"}, "author": "Oke-Hortons Nosa", "title": "“Music Is the Weapon”: Nigerian Singer Joeboy Gets a Grammys Recognition Gong - Legit.ng", "description": "Fast-rising Nigerian musician Joeboy gets recognition from Grammys for his collaborative work with the American music group Major Lazer on their 2021 album.", "url": "https://www.legit.ng/entertainment/music/1490698-music-weapon-nigerian-singer-joeboy-a-grammy-recognition-gong/", "urlToImage": "https://netstorage-legit.akamaized.net/images/3884f6dacefe4a1f.jpg", "publishedAt": "2022-09-08T06:58:37Z", "content": "<ul><li>Fast-rising Nigerian singer Joeboy celebrates a huge feat as he gets a recognition plaque from the Grammys for his collaboration work on the album Music is the weapon by Major Lazer</li><li>T… [+2224 chars]"}]}