{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Variety"}, "author": "William Earl", "title": "Naomi Judd’s Cause of Death Was a Self-Inflicted Firearm Wound, Daughter Ashley Reveals in New Interview - Yahoo News Canada", "description": "Naomi Judd, the country music icon who died on April 30 at the age of 75, died of a self-inflicted firearm wound, her daughter, Ashley Judd, disclosed on Thursday morning. Ashley Judd made an appearance on “Good Morning America” to speak with Diane Sawyer abo…", "url": "https://variety.com/2022/music/news/naomi-judd-cause-of-death-gunshot-firearm-1235264891/", "urlToImage": "https://variety.com/wp-content/uploads/2022/05/naomi-ashley-judd.jpg?w=999", "publishedAt": "2022-05-12T11:43:11Z", "content": "Naomi Judd, the country music icon who died on April 30 at the age of 75, died of a self-inflicted firearm wound, her daughter, Ashley Judd, disclosed on Thursday morning.\r\nAshley Judd made an appear… [+2947 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Annual inflation in US higher than expected in April, Aussie dollar dropped | Finance Report - ABC News (Australia)", "description": "Share markets and the Australian dollar all fell today after American inflation came in higher than expected. Subscribe: http://ab.co/1svxLVE  Read more here...", "url": "https://www.youtube.com/watch?v=tS4bwpAAoiY", "urlToImage": "https://i.ytimg.com/vi/tS4bwpAAoiY/maxresdefault.jpg", "publishedAt": "2022-05-12T09:30:08Z", "content": null}, {"source": {"id": null, "name": "KABC-TV"}, "author": "Brian Lada, AccuWeather meteorologist and staff writer", "title": "Total 'blood moon' eclipse to rise over US this weekend - KABC-TV", "description": "Just as the sun sets over North America on Sunday evening, the sun, Earth and moon will begin to align to create the \"blood moon\" total lunar eclipse.", "url": "https://abc7.com/lunar-eclipse-2022-super-flower-blood-moon-sunday-this-weekend/11838463/", "urlToImage": "https://cdn.abcotvs.com/dip/images/11838470_051122-cc-accuwix-eclipse-vid-img.jpg?w=1600", "publishedAt": "2022-05-11T21:22:57Z", "content": "The moon will plunge into darkness this weekend to create a celestial spectacle that has not been seen in the sky over the entire contiguous United States since the turn of the decade.Just as the sun… [+4198 chars]"}]}