{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová", "title": "Accident or sabotage? American and European officials disagree as key undersea cables are cut - CNN", "description": "Investigators are trying to crack the mystery of how two undersea internet cables in the Baltic Sea were cut within hours of each other, with European officials saying they believe the disruption was an act of sabotage and US officials suggesting it was likel…", "url": "https://www.cnn.com/2024/11/20/world/accident-or-sabotage-undersea-cables-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2184796994.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-11-21T00:56:00Z", "content": "Investigators are trying to crack the mystery of how two undersea internet cables in the Baltic Sea were cut within hours of each other, with European officials saying they believe the disruption was… [+5103 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Ben Leonard", "title": "Dr. Oz getting high marks from Senate moderates — maybe even Fetterman - POLITICO", "description": "As CMS administrator, Oz would have latitude over health coverage for the more than 160 million Americans in Medicare, Medicaid and other health programs", "url": "https://www.politico.com/news/2024/11/20/dr-oz-senate-reaction-fetterman-00190662", "urlToImage": "https://static.politico.com/0b/8e/5be166844f138427596fc9978a6e/trump-transition-46359.jpg", "publishedAt": "2024-11-20T18:31:14Z", "content": "In naming Oz as his pick, Trump said Oz will work closely with Robert F. Kennedy Jr. to take on the illness industrial complex, and all the horrible chronic diseases left in its wake. Oz skeptics, ho… [+3675 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tara Suter", "title": "Most say they probably won’t get updated COVID vaccine: Survey - The Hill", "description": "Most Americans in a new poll said they probably won’t get an updated COVID-19 vaccine. The Pew Research Center survey found 60 percent said they are “probably not” going to “get an updated vaccine.” Just less than 25 percent said they “probably” will get a bo…", "url": "https://thehill.com/policy/healthcare/5000039-most-wont-get-updated-covid-booster-survey/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/11/AP22323032313519-e1732122822719.jpg?w=1280", "publishedAt": "2024-11-20T17:15:00Z", "content": null}]}