{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Lauren Aratani", "title": "Extreme heat warnings in effect in 28 states across US - The Guardian", "description": "100 million Americans are enduring searing temperatures as Biden declines to announce a climate emergency", "url": "https://amp.theguardian.com/environment/2022/jul/21/extreme-heat-warnings-advisories-28-states", "urlToImage": null, "publishedAt": "2022-07-21T17:09:00Z", "content": "Climate crisis100 million Americans are enduring searing temperatures as Biden declines to announce a climate emergency\r\nThu 21 Jul 2022 16.53 BST\r\nThe National Weather Service has warned that extrem… [+3556 chars]"}, {"source": {"id": null, "name": "The Ringer"}, "author": "Zach Kram", "title": "The 10 Biggest Story Lines in MLB’s Second Half - The Ringer", "description": "Can the Yankees challenge the single-season wins record? Will Juan Soto actually be traded? And are the Mariners set to snap the longest playoff drought in all of North American sports?", "url": "https://www.theringer.com/mlb/2022/7/21/23272672/second-half-story-lines-yankees-juan-soto-trade-deadline-playoffs", "urlToImage": "https://cdn.vox-cdn.com/thumbor/QWQCDsBaDWuU4duz2y9P1Ssiqeg=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23890815/MLBSecondHalfStorylines_Getty_Ringer.jpeg", "publishedAt": "2022-07-21T14:46:19Z", "content": "After an All-Star break festooned with nostalgia, home runs, and bullpen dominance, the MLB schedule restarts Thursday, with some 70 games remaining for each team. So before the second half begins, l… [+15167 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Americans recognize the climate is changing. But they disagree on why — and what to do about it - CBC News", "description": "As images of melting runways, buckling railway tracks and raging wildfires consumed the world's attention this week, Americans remained deadlocked on how to slow the climate change that scientists say is driving much of the extreme weather we're seeing.", "url": "https://www.cbc.ca/news/world/climate-biden-polarization-1.6527112", "urlToImage": "https://i.cbc.ca/1.6527183.1658367949!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/usa-weather.jpeg", "publishedAt": "2022-07-21T08:00:00Z", "content": "As images of melting runways, buckling railway tracks and raging wildfires consumed the world's attention this week, Americans remained deadlocked on how to slow the climate change that scientists sa… [+9460 chars]"}, {"source": {"id": null, "name": "Psychiatryadvisor.com"}, "author": null, "title": "A Year of Standard Care for Treatment Resistant Depression Fails to Improve Symptoms of Suicidality - Psychiatry Advisor", "description": "The Treatment-resistant Depression in America Latina (TRAL) study was conducted at centers in Argentina, Brazil, Colombia, and Mexico between 2017 and 2018.", "url": "https://www.psychiatryadvisor.com/home/topics/suicide-and-self-harm/year-of-soc-therapy-for-trd-had-suboptimal-effects-on-symptoms-of-depression-and-suicidality/", "urlToImage": "https://www.psychiatryadvisor.com/wp-content/uploads/sites/8/2022/02/Depression-Headache_G_1324340507-1.jpg", "publishedAt": "2022-07-20T14:10:00Z", "content": "A year of standard of care (SOC) therapy for treatment resistant depression (TRD) had suboptimal effects on symptoms of depression and suicidality. These findings were published in the the Revista de… [+3083 chars]"}]}