{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "collectSPACE.com"}, "author": null, "title": "First Artemis spacesuits to be worn on the moon will not return to Earth - collectSPACE.com", "description": "The history-making spacesuits worn by the first woman and next American astronaut to walk on the moon will be abandoned on a SpaceX lunar lander rather than be returned to Earth for their reuse or museum display, Axiom Space confirmed at the suits' reveal.", "url": "http://www.collectspace.com/news/news-031523a-axiom-space-axemu-artemis-3-spacesuits-fate.html", "urlToImage": "http://www.collectspace.com/images/news-031523e-fb.jpg", "publishedAt": "2023-03-15T21:06:02Z", "content": "March 15, 2023\r\n — The history-making spacesuits worn by the first woman and next American astronaut to walk on the moon will be abandoned on a SpaceX lunar lander rather than be returned to Earth fo… [+4350 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "1st Native American woman astronaut wants the world to 'share in that joy' after SpaceX Crew-5 flight - Space.com", "description": "Shortly after coming home from the International Space Station, NASA's Nicole Mann talked about how she is trying to bring others into the field by sharing her journey.", "url": "https://www.space.com/spacex-crew-5-native-american-woman-astronaut-nasa", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Kan7b7MyTRaKYxdBB4ugCj-1200-80.jpg", "publishedAt": "2023-03-15T20:30:14Z", "content": "Nicole Mann was always easy to find in space, thanks to Velcro technology.\r\nThe commander of SpaceX Crew-5 had a \"hair situation\" on the orbiting complex, she shared during a livestreamed press confe… [+6948 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Will Work To Retrieve Wreckage Of US Drone: Official - NDTV", "description": "Moscow will work to retrieve the wreckage of an American drone that crashed over the Black Sea after Washington said it collided with a Russian fighter jet, a top official said Wednesday.", "url": "https://www.ndtv.com/world-news/russia-will-work-to-retrieve-wreckage-of-us-drone-official-3864618", "urlToImage": "https://c.ndtvimg.com/2023-03/qpukfkfg_mq9-reaper-1200_650x400_14_March_23.jpg", "publishedAt": "2023-03-15T17:37:12Z", "content": "Russia denies its Su-27 plane clipped the propeller of an unmanned Reaper drone\r\nMoscow: Moscow will work to retrieve the wreckage of an American drone that crashed over the Black Sea after Washingto… [+1112 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "JENNIFER PELTZ", "title": "Beloved and debated, French bulldog becomes top US dog breed - Yahoo News", "description": "For the first time in three decades, the U.S. has a new favorite dog breed, according to the American Kennel Club.  Adorable in some eyes, deplorable in...", "url": "https://news.yahoo.com/beloved-debated-french-bulldog-becomes-123413083.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/ldPW3nWfN.rtBu2m4dli2Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap.org/7d8c9a42f73269135bb6ac816dcc2e41", "publishedAt": "2023-03-15T12:34:13Z", "content": "NEW YORK (AP) For the first time in three decades, the U.S. has a new favorite dog breed, according to the American Kennel Club.\r\nAdorable in some eyes, deplorable in others, the sturdy, push-faced, … [+5582 chars]"}]}