{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Daily Beast"}, "author": "Marlow Stern", "title": "John Oliver Drags GOP COVID Clowns Ron DeSantis and Madison Cawthorn - The Daily Beast", "description": "The ‘Last Week Tonight’ host took aim at the two grandstanding Republican politicians for offering foolish arguments against COVID mask mandates and endangering Americans.", "url": "https://www.thedailybeast.com/john-oliver-drags-gop-covid-clowns-ron-desantis-and-madison-cawthorn", "urlToImage": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1688,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1629084721/Screen_Shot_2021-08-15_at_11.27.01_PM_d8xire", "publishedAt": "2021-08-16T03:55:57Z", "content": "The Delta variant is spreading wildly around the country, particularly among the unvaccinated, with the U.S. averaging around 100,000 new infections a day, John Oliver explained Sunday night. And ala… [+2132 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gillian Brockell", "title": "The fall of Saigon: As Taliban seizes Kabul, the Vietnam War's final days remembered - The Washington Post", "description": "In 1975, Saigon fell to the North Vietnamese faster than expected, leading to chaos and  to the largest helicopter airlift ever attempted to rescue hundreds of Americans and South Vietnamese, who scaled the embassy's walls.", "url": "https://www.washingtonpost.com/history/2021/08/15/saigon-fall-kabul-taliban/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZ54FPH5CEI6XEI4KJF4RNUPC4.jpg&w=1440", "publishedAt": "2021-08-15T21:14:30Z", "content": "Thats what Ford faced on the evening of April 28, 1975, and it is history repeating itself now. After 20 years of U.S. involvement, the Taliban entered the Afghan capital, Kabul, on Sunday morning, a… [+4885 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Mandy Sims", "title": "Boeing Starliner returns to the factory instead of taking off to space - Awani Review", "description": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it's not about to end. The second", "url": "https://www.awanireview.com/boeing-starliner-returns-to-the-factory-instead-of-taking-off-to-space/", "urlToImage": null, "publishedAt": "2021-08-15T18:33:27Z", "content": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it’s not about to end. The second unmanned test flight of its Starliner space cap… [+2719 chars]"}]}