{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "fortune", "name": "Fortune"}, "author": "Craig Barrett", "title": "Exclusive: Former Intel CEO Craig Barrett outlines plan to save Intel and America’s advanced chip manufacturing - Fortune", "description": "Intel needs a cash infusion of roughly $40 billion to remain at the leading edge of chip manufacturing, according to former CEO Craig Barrett. The U.S. government is unlikely to be the main savior—instead cash rich chip customers like Nvidia, Apple, and Googl…", "url": "https://fortune.com/2025/08/10/exclusive-former-intel-ceo-craig-barrett-outlines-plan-to-save-intel-and-americas-advanced-chip-manufacturing/", "urlToImage": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-82467671-e1754865517111.jpg?resize=1200,600", "publishedAt": "2025-08-10T23:06:00Z", "content": "1.  Yes, the USA NEEDS INTEL, as Intel is the only U.S.  company capable of providing state of the art logic manufacturing.2.  Neither Samsung or TSMC plan to bring their state of the art manufacturi… [+3141 chars]"}, {"source": {"id": null, "name": "LADbible"}, "author": "Ella Scott", "title": "Everything we know about Chikungunya virus as China locks down patients after it spread to other countries - LADbible", "description": "The Chikungunya virus has spread to parts of Europe, Asia, Africa and the Americas after thousands of cases were reported in a Chinese province.", "url": "https://www.ladbible.com/news/world-news/chikungunya-virus-symptoms-transmission-china-976133-20250810", "urlToImage": "https://images.ladbible.com/ogimage/v3/assets/bltcd74acc1d0a99f3a/bltc82bb46a51bb0158/6898700f3266ed126fa68844/Screenshot_2025-08-10_at_09.40.51.png", "publishedAt": "2025-08-10T10:38:40Z", "content": "Chikungunya virus (CHIKV) is spreading like wildfire across Chinese cities, with health organisations reporting people in Europe, Africa, the Americas and other parts of Asia also coming down with th… [+4467 chars]"}]}