{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "CHRIS MEGERIAN, JOEY CAPPELLETTI, MICHELLE L. PRICE", "title": "Harris and Trump seek Arab American votes in Michigan in effort to shore up battleground states - The Associated Press", "description": "Kamala Harris and Donald Trump are both seeking support from Arab American voters as they campaign in Michigan, trying to lock down support in a battleground state that could decide the presidential race. Trump was expected to visit a new campaign office Frid…", "url": "https://apnews.com/article/kamala-harris-donald-trump-michigan-6b034753290276bfa96d7caf8f7639bf", "urlToImage": "https://dims.apnews.com/dims4/default/6d54c51/2147483647/strip/true/crop/3716x2090+0+197/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1c%2F73%2Fe03ebbac0e3f43c9cf5dcd482260%2F5d39147dc99346e38b1420ce8d1eb9b3", "publishedAt": "2024-10-18T21:18:00Z", "content": "GRAND RAPIDS, Mich. (AP) Kamala Harris and Donald Trump both sought support from Arab American voters Friday as they campaigned in Michigan, trying to lock down support in a battleground state that c… [+6444 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Erika Tulfo", "title": "CVS names new CEO in the wake of layoffs and poor stock performance - CNN", "description": "America’s largest drug store chain named a new chief executive officer on Friday, with longtime CVS Health executive David Joyner replacing Karen Lynch.", "url": "https://www.cnn.com/2024/10/18/business/cvs-names-new-ceo/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24292394415729-copy.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-10-18T18:37:00Z", "content": "Americas largest drug store chain named a new chief executive officer on Friday, with longtime CVS Health executive David Joyner replacing Karen Lynch.\r\nCVS also withdrew its 2024 profit forecast and… [+2620 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Ozempic Could Be Lifesaving for Thousands of Americans a Year, Study Finds - Gizmodo", "description": "New research estimates that expanded access to Ozempic and similar drugs could lead to 42,000 deaths prevented annually.", "url": "https://gizmodo.com/ozempic-could-be-lifesaving-for-thousands-of-americans-a-year-study-finds-2000513535", "urlToImage": "https://gizmodo.com/app/uploads/2024/10/Ozempic-injection.jpg", "publishedAt": "2024-10-18T16:50:52Z", "content": "The benefits of Ozempic and similar medications could be profound on a population level. New research has estimated that expanding access to these newer weight loss and diabetes drugs could save thou… [+4979 chars]"}]}