{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Native American shell ring villages may have been occupied then abandoned because of climate change: Analysis of mollusk shells reveals environmental changes in U.S. coastal communities around 4000 years ago - Science Daily", "description": "Mollusk shells at 4,000-year-old Native American shell ring villages indicate that environmental change may have driven the formation and abandonment of these coastal communities, according to a new study.", "url": "https://www.sciencedaily.com/releases/2022/03/220302150404.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-03-02T21:14:45Z", "content": "Mollusk shells at 4,000-year-old Native American shell ring villages indicate that environmental change may have driven the formation and abandonment of these coastal communities, according to a stud… [+3123 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Stan Grant", "title": "Biden's State of the Union address offered a plan — but will it be enough with democracy on the line? - ABC News", "description": "Joe Biden walked into the State of the Union speech with the voices of presidents past in his ears. And with polls showing more Americans think Biden is doing a bad job than good, some of those past presidents will be hard acts to follow, writes Stan Grant.", "url": "https://www.abc.net.au/news/2022-03-03/joe-biden-state-of-the-union-needs-more-than-strong-words/100876290", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/67156e826774845b0fa91183a8f003d4?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485", "publishedAt": "2022-03-02T18:15:00Z", "content": "Joe Biden walked into the State of the Union speech with the voices of presidents past in his ears.\r\nSome of them are hard acts to follow.\r\nThink Abraham Lincoln, who appealed to the best of America … [+6431 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Adam Chapman", "title": "'Strong evidence': The popular drink shown to increase the risk of bowel cancer - warning - Express", "description": "CANCER remains a scourge worldwide, despite ongoing efforts to eradicate it. Progress in understanding what drives it is afoot, however. According to the American Institute for Cancer Research, a popular drink can increase your risk of bowel cancer and the ev…", "url": "https://www.express.co.uk/life-style/health/1574590/cancer-symptoms-alcohol-bowel-cancer-risk", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1574590.jpg", "publishedAt": "2022-03-02T17:35:00Z", "content": "Cancer kills a colossal number of people each year - the deadly disease accounted for nearly 10 million deaths in 2020. Despite its lethality, efforts to understand what drives it are underway. A num… [+1361 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "NASA launches satellite aimed at improving wildfire and flood forecasting - Times of India", "description": "America's newest weather satellite blasted off Tuesday to improve wildfire and flood forecasting across the western half of the country. It's the replacement for a satellite launched exactly four years ago, which ended up with a cooling line blockage that hin…", "url": "https://timesofindia.indiatimes.com/videos/international/nasa-launches-satellite-aimed-at-improving-wildfire-and-flood-forecasting/videoshow/89943676.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/msid-89943676,imgsize-16966.cms", "publishedAt": "2022-03-02T08:58:28Z", "content": "Mar 02, 2022, 02:28PM ISTSource: APAmerica's newest weather satellite blasted off Tuesday to improve wildfire and flood forecasting across the western half of the country. It's the replacement for a … [+394 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "‘Painful’ game show segment goes viral - news.com.au", "description": "<p>A painful clip showing contestants struggling to guess a common phrase on American game show Wheel of Fortune has left viewers stunned after going viral online.</p>", "url": "https://www.news.com.au/entertainment/tv/fans-in-disbelief-as-painful-game-show-segment-goes-viral/news-story/9e66a773bf818ab66e6a83e00110e393", "urlToImage": "https://content.api.news/v3/images/bin/ebbcf0934dfe6eeba79109ded84e55ae", "publishedAt": "2022-03-02T06:15:45Z", "content": "As if it wasnt bad enough just playing out on TV, footage of these contestants has now gone viral. Would you have guessed the phrase correctly?A painful clip showing contestants struggling to guess a… [+2734 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "Apple, Ford, other big US brands join corporate wave shunning Russia - CNA", "description": "Some of America's best-known companies including Apple, Google, Ford, Harley-Davidson and ExxonMobil rebuked and rejected Russia for its invasion of Ukraine, under steady pressure from investors and consumers decrying the violence.\r\n\r\nApple Inc late on Tuesda…", "url": "https://www.channelnewsasia.com/business/apple-ford-other-big-us-brands-join-corporate-wave-shunning-russia-2530661", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--34cPaWsf--/fl_relative%2Cg_south_east%2Cl_one-cms:core:watermark:reuters%2Cw_0.1/f_auto%2Cq_auto/c_fill%2Cg_auto%2Ch_676%2Cw_1200/v1/one-cms/core/2022-03-02t001834z_1_lynxmpei2100d_rtroptp_3_netherlands-apple-antitrust.jpg?itok=kXuxHQV6", "publishedAt": "2022-03-02T00:18:00Z", "content": "Some of America's best-known companies including Apple, Google, Ford, Harley-Davidson and ExxonMobil rebuked and rejected Russia for its invasion of Ukraine, under steady pressure from investors and … [+3334 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": null, "title": "Sam Elliott slams Kiwi director Jane Campion over Power of the Dog: 'Piece of s***' - New Zealand Herald", "description": "'What the f*** does this woman from New Zealand know about the American West?'", "url": "https://www.nzherald.co.nz/entertainment/sam-elliott-slams-kiwi-director-jane-campion-over-power-of-the-dog-piece-of-s/U2T4U2VQCF57IEFQR2CWLDU7PM/", "urlToImage": "https://www.nzherald.co.nz/resizer/lZ699dn51WG9WundlBjmw-NOe84=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/KN4T7MJYPFT5ZES5HOSPZY25WU.jpg", "publishedAt": "2022-03-01T20:24:42Z", "content": "Watch: The Power of the Dog trailer. Video / NetflixActor Sam Elliott is known as a veteran of Western films - and he had something to say about Kiwi director Jane Campion's take on the genre set in … [+2003 chars]"}]}