{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delta Variant \"Greatest Threat\" To US' Covid Efforts: Dr Anthony Fauci - NDTV", "description": "The highly contagious Delta variant of the coronavirus is the \"greatest threat\" to America's attempt to eradicate the Covid pandemic, the country's leading infectious disease expert and White House Chief Medical Advisor Dr Anthony Fauci has warned.", "url": "https://www.ndtv.com/world-news/delta-variant-greatest-threat-to-us-covid-efforts-dr-anthony-fauci-2476435", "urlToImage": "https://c.ndtvimg.com/2021-06/cqeq9u2o_anthony-fauci_625x300_11_June_21.jpg", "publishedAt": "2021-06-30T18:21:41Z", "content": "Delta variant now makes up over 20% of all new cases in the US, Dr Fauci said (File)\r\nWashington: The highly contagious Delta variant of the coronavirus is the \"greatest threat\" to America's attempt … [+5104 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Tanaya Macheel", "title": "American Express partners with fintech firms to help customers find mortgages - CNBC", "description": "American Express has two new fintech partners it's marketing for mortgage-seeking customers.", "url": "https://www.cnbc.com/2021/06/30/american-express-is-sending-customers-to-fintech-partners-for-mortgages.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106884929-1621373963761-gettyimages-1317976298-b91i346370843.jpeg?v=1621374077", "publishedAt": "2021-06-30T15:43:42Z", "content": "American Express has two new fintech partnerships it's marketing for customers interested in home loans.\r\nIt's the latest perk for cardholders and another example of financial institutions partnering… [+1924 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Tracy Wright", "title": "Heidi Klum flashes her underwear onstage as she models a sexy pink dress on America's Got Talent - Daily Mail", "description": "The 48-year-old AGT judge showed off peeks of her black bra and underwear as she helped 'Sniptease' artist Melodie Blaize create a custom piece on stage during the talent show.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-9741415/Heidi-Klum-flashes-underwear-onstage-models-sexy-pink-dress-Americas-Got-Talent.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/06/30/14/44867375-0-image-a-10_1625060859693.jpg", "publishedAt": "2021-06-30T13:49:10Z", "content": "She's a world famous supermodel with decades of experience on the runway.\r\nAnd Heidi Klum flashed her incredible figure as she helped a contestant turn a simple pink T-shirt into a sexy shift on Tues… [+11314 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Damian McNamara", "title": "Unvaccinated More Likely to Die From COVID-19 - Medscape", "description": "Investigators looked at federal data for deaths from COVID-19 in May 2021 and determined how many were among unvaccinated Americans.", "url": "https://www.medscape.com/viewarticle/953957", "urlToImage": "https://img.medscape.com/thumbnail_library/gty_210628_anti_vax_vaccine_protest_800x450.jpg", "publishedAt": "2021-06-29T19:26:02Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nIf you, a friend, or a loved one remain unvaccinated against COVID-19 at this point for whatever … [+5825 chars]"}]}