{"articles": [{"author": "Cynthia Littleton", "content": "“Borat Subsequent Moviefilm” and “Promising Young Woman” took top narrative film honors Sunday at the  Writers Guild of America Awards.\r\nKal Penn hosted the virtual presentation that cemented “Borat”… [+17830 chars]", "description": "The Writers Guild of America will hand out its top film and TV honors on Sunday at the guild’s 73rd annual awards ceremony, which begins at 4 p.m. PT. This year’s virtual presentation is hosted by multi-hyphenate Kal Penn. Apple TV comedy “Ted Lasso” took the…", "publishedAt": "2021-03-21T23:14:17Z", "source": {"id": null, "name": "Variety"}, "title": "Writers Guild Awards 2021 Winners (Updating Live) - Variety", "url": "https://variety.com/2021/film/news/wga-awards-winners-2021-writers-guild-1234935361/", "urlToImage": "https://variety.com/wp-content/uploads/2021/03/WGA-Logo.jpg?w=1000"}, {"author": "Veronica Stracqualursi, CNN", "content": "(CNN)Sen. Roy Blunt, a member of GOP leadership, argued on Sunday that Americans don't need \"alternative versions\" of what occurred the day of the US Capitol insurrection, pushing back on Republican … [+2437 chars]", "description": "Sen. Roy Blunt, a member of GOP leadership, argued on Sunday that Americans don't need \"alternative versions\" of what occurred the day of the US Capitol insurrection, pushing back on Republican Sen. Ron Johnson's comments that mischaracterize the riot and its…", "publishedAt": "2021-03-21T17:50:33Z", "source": {"id": "cnn", "name": "CNN"}, "title": "Top Senate Republican says Americans don't need 'alternative versions' of January 6 Capitol attack - CNN", "url": "https://www.cnn.com/2021/03/21/politics/roy-blunt-january-6-capitol-insurrection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321121248-roy-blunt-210308-super-tease.jpg"}, {"author": "David Goldman, CNN Business", "content": null, "description": "Two of North America's largest railroad companies announced a merger Sunday that would connect freight customers to Canada, the United States and Mexico on a single network for the first time in history.", "publishedAt": "2021-03-21T17:14:00Z", "source": {"id": "cnn", "name": "CNN"}, "title": "Railroad megamerger would create the first Mexico-US-Canada freight rail network - CNN", "url": "https://www.cnn.com/2021/03/21/investing/canadian-pacific-kansas-city-southern-merger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321113521-canadian-pacific-train-file-super-tease.jpg"}, {"author": null, "content": "PEORIA, ILLINOIS - Bradley University student Zach Bachmann didnt grow up thinking hed be an astronaut.\r\nIm short, blind and asthmatic, so I cant really be an astronaut if I wished to, he said.\r\nBut … [+3776 chars]", "description": "Bradley University student Zach Bachmann didn’t grow up thinking he’d be an astronaut.\n\n“I’m short, blind and asthmatic, so I can’t really be an astronaut if I wished to,” he said.\n\nBut a lifelong interest in video games and computers is putting him at the ce…", "publishedAt": "2021-03-21T07:15:25Z", "source": {"id": null, "name": "VOA News"}, "title": "NASA Turns to College Students to Design New Suit Technology - Voice of America", "url": "https://www.voanews.com/science-health/nasa-turns-college-students-design-new-suit-technology", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/kaltura-video-thumbs/1_0/1_02gatgdj.jpg"}, {"author": "Al Jazeera", "content": "Brazil is in talks with the United States to import excess COVID-19 vaccines, the Brazilian foreign ministry said on Saturday, as the South American nation struggles to stem rising coronavirus infect… [+4638 chars]", "description": "South American country is struggling to contain a nationwide surge in coronavirus infections and deaths.", "publishedAt": "2021-03-20T19:45:02Z", "source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "title": "Brazil in talks with US to import extra COVID vaccines - Al Jazeera English", "url": "https://www.aljazeera.com/news/2021/3/20/brazil-in-talks-with-us-to-import-extra-covid-vaccines", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/03/2021-03-20T142954Z_1413685138_RC22FM9PD85B_RTRMADP_3_HEALTH-CORONAVIRUS-BRAZIL.jpg?resize=1200%2C630"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "america"}