{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Ben Kesling, Michael M. Phillips", "title": "Trapped in Afghanistan, Rescued by Volunteers: How a Handful of Americans Freed 5,000 Afghans - The Wall Street Journal", "description": "From a lounge at the Willard Hotel in Washington, a group of men and women mobilized a global network to conduct a two-week military-style rescue operation", "url": "https://www.wsj.com/articles/trapped-in-afghanistan-rescued-by-volunteers-how-a-handful-of-americans-freed-5-000-afghans-11630284116", "urlToImage": "https://images.wsj.net/im-393003/social", "publishedAt": "2021-08-30T00:41:00Z", "content": "Zach Van Meter, a private-equity investor from Naples, Fla., phoned the government of Somaliland last week, asking if it would host thousands of Afghan refugees.\r\nHe just called me out of the blue, s… [+1338 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sean Sullivan, Dan Lamothe, Kareem Fahim, Haq Nawaz Khan", "title": "Biden meets with families of service members killed in Kabul as U.S. races to exit Afghanistan - The Washington Post", "description": "Some family members of the 13 Americans killed in last week’s suicide bombing have expressed anger at the president for his handling of the withdrawal.", "url": "https://www.washingtonpost.com/politics/biden-meets-with-families-of-service-members-killed-in-kabul-as-us-races-to-exit-afghanistan/2021/08/29/c185ed78-08ca-11ec-aea1-42a8138f132a_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5674JRQJFAI6ZLVBIKUBHDYTFI.jpg&w=1440", "publishedAt": "2021-08-30T00:33:45Z", "content": "Biden flew to an Air Force base here to receive the fallen service members, whose remains were returned to the United States on Sunday morning. He first met privately with their family members, inclu… [+10829 chars]"}, {"source": {"id": null, "name": "Minneapolis Star Tribune"}, "author": "KATHY GANNON, LOLITA C. BALDOR, TAMEEM AKHGAR, JOSEPH KRAUSS, Associated Press", "title": "US says drone kills IS bombers targeting Kabul airport - Minneapolis Star Tribune", "description": "A U.S. drone strike blew up a vehicle carrying \"multiple suicide bombers\" from Afghanistan&#39;s Islamic State affiliate on Sunday before they could attack the ongoing military evacuation at Kabul&#39;s international airport, American officials said. An Afgha…", "url": "https://www.startribune.com/us-says-drone-kills-is-bombers-targeting-kabul-airport/600091980/", "urlToImage": "https://chorus.stimg.co/22813007/1afgh082921.jpg?h=630&w=1200&fit=crop&bg=999&crop=faces", "publishedAt": "2021-08-29T23:37:30Z", "content": "KABUL, Afghanistan A U.S. drone strike blew up a vehicle carrying \"multiple suicide bombers\" from Afghanistan's Islamic State affiliate on Sunday before they could attack the ongoing military evacuat… [+7845 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Pens, Pencils, and Debunking Myths: How NASA Takes Notes in Space - SciTechDaily", "description": "The Space Pen has captured the American imagination in more ways than one. It’s appeared repeatedly in pop culture and even worked as a plot device in a \"Seinfeld\" episode titled \"The Pen,\" and in 2021 was inducted into the Space Technology Hall of Fame. It’s…", "url": "https://scitechdaily.com/space-pens-pencils-and-debunking-myths-how-nasa-takes-notes-in-space/", "urlToImage": "https://scitechdaily.com/images/NASA-astronaut-Walter-Cunningham-Writes-With-Fisher-Space-Pen.jpg", "publishedAt": "2021-08-29T19:11:49Z", "content": "ByMike DiCicco and Naomi Seck, NASA SpinoffAugust 29, 2021\r\nNASA astronaut Walter Cunningham writes with a Fisher Space Pen during the flight of Apollo 7, the first crewed Apollo flight and the Space… [+5721 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Aubree Eliza Weaver", "title": "McConnell: ‘Why we went’ to Afghanistan has been lost - POLITICO", "description": "He said maintaining American forces in Afghanistan had kept the lid on terrorism.", "url": "https://www.politico.com/news/2021/08/29/mcconnell-afghanistan-reason-lost-507197", "urlToImage": "https://static.politico.com/ce/c9/c38db5444018af566780cb70f637/210829-mcconnell-ap-773.jpg", "publishedAt": "2021-08-29T17:59:12Z", "content": "The United States invaded Afghanistan weeks after the Sept. 11 attacks in 2001, toppling the Taliban regime. American forces in 2001 were also in pursuit of Osama bin Laden, the architect of the 9/11… [+1384 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Coronavirus: What's happening in Canada and around the world Sunday - CBC.ca", "description": "The U.S. government's top infectious disease expert says the country is sticking with its recommendation for Americans to get COVID-19 booster shots eight months after receiving the vaccine but will be open to changes based on evolving data.", "url": "https://www.cbc.ca/news/world/coronavirus-covid19-canada-world-august29-2021-1.6157556", "urlToImage": "https://i.cbc.ca/1.6157625.1630259847!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/covid-booster-shot.jpg", "publishedAt": "2021-08-29T17:17:00Z", "content": "The latest:\r\nThe U.S. government's top infectious disease expert says the country is sticking with its recommendation for Americans to get COVID-19 booster shots eight months after receiving the vacc… [+1994 chars]"}]}