{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientists decipher comprehensive deer tick genome - News-Medical.Net", "description": "A University of Maryland-led team of scientists has deciphered the first comprehensive, continuous genome for a parasite responsible for transmitting Lyme disease and other serious infections to hundreds of thousands of Americans yearly.", "url": "https://www.news-medical.net/news/20230119/Scientists-decipher-comprehensive-deer-tick-genome.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/5/Female_veterinary_doctor_using_stethoscope_for_cute_kitten_-_Image_-_Maria_Sbytova_A1_87d2b43d99c4479d9866e299f000d075-620x480.jpg", "publishedAt": "2023-01-19T18:15:00Z", "content": "A University of Maryland-led team of scientists has deciphered the first comprehensive, continuous genome for a parasite responsible for transmitting Lyme disease and other serious infections to hund… [+4872 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New research project aims to investigate the effect of late life learning on cognition and aging - News-Medical.Net", "description": "The National Health Institute has awarded Columbia University Mailman School of Public Health and The American University of Beirut Faculty of Health Sciences and Medicine a five-year grant for the Late Life Learning (LLL), Cognition and Aging (3LC) study.", "url": "https://www.news-medical.net/news/20230119/New-research-project-aims-to-investigate-the-effect-of-late-life-learning-on-cognition-and-aging.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2018/7/shutterstock_1028141632_649cad8889c647fc8d0bd83bf7503e08-620x480.jpg", "publishedAt": "2023-01-19T14:03:00Z", "content": "The National Health Institute (NIH) has awarded Columbia University Mailman School of Public Health and The American University of Beirut (AUB) Faculty of Health Sciences and Medicine a five-year gra… [+2259 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Shaw", "title": "Biden admin launches pilot program to allow Americans to sponsor refugees directly - Fox News", "description": "The Biden administration on Thursday formally announced an ambitious pilot program to allow groups of Americans to sponsor refugees if they meet certain criteria.", "url": "https://www.foxnews.com/politics/biden-admin-launch-pilot-program-allow-americans-sponsor-refugees-directly", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/03/Joe-Biden-Ukrainian-Refugees.jpg", "publishedAt": "2023-01-19T03:12:00Z", "content": "The Biden administration on Thursday announced a new pilot program to allow groups of Americans to sponsor refugees directly, a move the State Department described as \"the boldest innovation in refug… [+4823 chars]"}]}