{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Brett Samuels", "title": "Harris slams ‘nonsense’ at MSG Trump rally: ‘That’s why people are exhausted with him’ - The Hill", "description": "Vice President Harris on Monday said former President Trump’s rally a night earlier at Madison Square Garden in New York City, which was marked by racist and sexist comments from multiple speakers who took the stage, underscored why many Americans are “exhaus…", "url": "https://thehill.com/homenews/campaign/4957046-harris-trump-rally-msg-puerto-rico-kill-tony-hinchcliffe/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/10/AP24299679340689-e1729882917282.jpg?w=1280", "publishedAt": "2024-10-28T17:06:00Z", "content": "Skip to content\r\nVice President Harris on Monday said former President Trump’s rally a night earlier at Madison Square Garden in New York City, which was marked by racist and sexist comments from mul… [+2062 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": "Ali Rogin, Andrew Corkery", "title": "Scientists search for ways to battle deadly fungus devastating North America's bats - PBS NewsHour", "description": "The association between bats and Halloween dates back thousands of years, based on the superstition that the flying mammals are omens of death. But for nearly two decades, North American bats have been facing a deadly threat themselves: a fungal disease calle…", "url": "https://www.pbs.org/newshour/show/scientists-search-for-ways-to-battle-deadly-fungus-devastating-north-americas-bats", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2024/10/combating-1024x662.jpg", "publishedAt": "2024-10-27T21:30:17Z", "content": "By Ali Rogin\r\n Ali Rogin\r\nAli Rogin is a correspondent for the PBS News Hour and PBS News Weekend, reporting on a number of topics including foreign affairs, health care and arts and culture. She rec… [+455 chars]"}]}