{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Backs Extending Gaza Ceasefire After Hamas Frees More Hostages - NDTV", "description": "Hamas released a third group of hostages including a four-year-old American girl Sunday, in exchange for Palestinian prisoners on day three of a truce which a source close to the Hamas said they were willing to prolong.", "url": "https://www.ndtv.com/world-news/hamas-may-seek-extension-of-4-day-truce-with-israel-report-4608769", "urlToImage": "https://c.ndtvimg.com/2023-11/ha52vcfo_palestinian-prisoners-released_625x300_27_November_23.jpeg?ver-20231128.06", "publishedAt": "2023-11-27T04:05:00Z", "content": "A source close to Hamas said the group was willing to prolong the pause.\r\nHamas released a third group of hostages including a four-year-old American girl Sunday, in exchange for Palestinian prisoner… [+6188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chris Lau, <a href=\"/profiles/ivana-kottasova\">Ivana Kottasová</a>, Sophie Tanno, Antoinette Radford and <a href=\"/profiles/maureen-chowdhury\">Maureen Chowdhury</a>, CNN", "title": "Hamas releases third group of hostages during truce with Israel: Live updates - CNN", "description": "A third set of hostages was released by Hamas on Sunday, including the first American to be successfully freed, according to Israeli and US officials. Follow for live updates.", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-11-26-23/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/231124164803-rba-israel-01-super-tease.jpg", "publishedAt": "2023-11-27T03:25:00Z", "content": "Another 17 hostages held in Gaza have been released on Sunday, the third such handover during a four-day truce between Israel and Hamas.\r\nThe group was made up of Israelis, dual Israeli citizens and … [+3121 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA Laser Communication Test Gets Data from 16 Million Kilometers Away - VOA Learning English", "description": "NASA says a test involving a laser-based communication method successfully sent data over 16 million kilometers through deep space. The new system is expected to replace radio links long used by the American space agency.", "url": "https://learningenglish.voanews.com/a/nasa-laser-communication-test-gets-data-from-16-million-kilometers-away/7366203.html", "urlToImage": "https://gdb.voanews.com/01000000-c0a8-0242-8988-08dbeba6d103_cx5_cy2_cw94_w1200_r1.jpg", "publishedAt": "2023-11-26T22:05:36Z", "content": "NASA has successfully tested a laser-based communication method that sent data over 16 million kilometers. The American space agency hopes the system will greatly improve data links between Earth and… [+4034 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Dorgan", "title": "Couple claim eye antibiotic cured dog of mysterious illness sweeping America - Fox News", "description": "A California couple are claiming their canine recovered from a potentially deadly disease after being treated with a lifesaving antibiotic.", "url": "https://www.foxnews.com/lifestyle/couple-claim-eye-antibiotic-cured-dog-mysterious-illness-sweeping-america", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/09/iStock-1285465107.jpg", "publishedAt": "2023-11-26T13:51:00Z", "content": "A cure to a mysterious and potentially deadly respiratory condition that has been spreading in dogs throughout the country may have been found with a California couple who claim their canine is on th… [+3380 chars]"}]}