{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": "Ari Hawkins", "title": "Trump threatens BRICS nations with 100 percent tariff - POLITICO", "description": "Trump also said in his post that the countries \"can go find another 'sucker!' There is no chance that the BRICS will replace the U.S. Dollar in International Trade, and any Country that tries should wave goodbye to America.\"", "url": "https://www.politico.com/news/2024/11/30/trump-brics-tariff-trade-00192042", "urlToImage": "https://static.politico.com/8c/9e/15399f5c491792224bc85fc78804/https-delivery-gettyimages.com/downloads/2186662154", "publishedAt": "2024-12-01T02:58:03Z", "content": "Officials from the BRICS countries have discussed moving away from the U.S. dollar in recent years. The concept gained steam in 2022 when the U.S. imposed massive economic sanctions on Russia over it… [+1016 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ERIC TUCKER, ALAN SUDERMAN", "title": "Trump taps Kash Patel for FBI director, an ally who would aid in his effort to upend law enforcement - The Associated Press", "description": "President-elect Donald Trump says he will nominate Kash Patel to serve as FBI director, turning to a fierce ally to upend America’s premier law enforcement agency and rid the government of perceived “conspirators.” Trump made the announcement on Truth Social …", "url": "https://apnews.com/article/trump-fbi-patel-wray-879dc7629905946cc242e90f6ab98739", "urlToImage": "https://dims.apnews.com/dims4/default/7e3a26f/2147483647/strip/true/crop/6995x3935+0+364/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F75%2Ff3%2F45eed95d25bb4da1b5956f51e5e6%2F5f9d9c0e8c40499ba4bf75d11bb17a12", "publishedAt": "2024-12-01T02:18:00Z", "content": "WASHINGTON (AP) President-elect Donald Trump says he will nominate Kash Patel to serve as FBI director, turning to a fierce ally to upend Americas premier law enforcement agency and rid the governmen… [+8792 chars]"}]}