{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar", "title": "Emergency alerts, desks barricading doors, shoes abandoned in the grass: How the FSU mass shooting upended the campus - CNN", "description": "A perfect, sun-drenched Florida spring day suddenly descended into horror when a gunman began hunting down victims near Florida State University’s student union building, marking the next chapter in America’s grim epidemic of gun violence.", "url": "https://www.cnn.com/2025/04/18/us/student-voices-fsu-shooting-gun-violence/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/usatsi-25952154.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-04-18T05:35:00Z", "content": "It was an ordinary afternoon for Jayden DOnofrio, who was spending time with a friend at their apartment complex when they received a text that made their blood run cold.\r\nAn active shooter was on ca… [+6052 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Josh Funk", "title": "The US has a single rare earths mine. Chinese export limits are energizing a push for more - AP News", "description": "America’s only rare earths mine has fielded calls from anxious companies since China responded to President Donald Trump's tariffs by limiting exports of seven heavy metals. The mine in California can’t meet the U.S. demand for rare earths, which is why Trump…", "url": "https://apnews.com/article/rare-earths-trump-tariffs-china-trade-war-effd6a7ec64b5830df9d3c76ab9b607a", "urlToImage": "https://dims.apnews.com/dims4/default/5ee06ef/2147483647/strip/true/crop/5272x2966+0+275/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2F06%2F0ca95233108bf8560254a322c875%2F18d541af657345d08a2e763c09d31a52", "publishedAt": "2025-04-18T04:22:00Z", "content": "OMAHA, Neb. (AP) Americas only rare earths mine heard from anxious companies soon after China responded to President Donald Trumps tariffs this month by limiting exports of those minerals used for mi… [+7495 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lea Skene", "title": "Federal judge in Baltimore temporarily limits DOGE access to Social Security data - AP News", "description": "A federal judge has imposed new restrictions on the Department of Government Efficiency’s access to Social Security systems that hold personal data on millions of Americans. U.S. District Judge Ellen Hollander issued a preliminary injunction Thursday in the c…", "url": "https://apnews.com/article/doge-social-security-data-access-42f4a7639169bd70c9541901bad7e0fe", "urlToImage": "https://dims.apnews.com/dims4/default/e0d4fb5/2147483647/strip/true/crop/5644x3175+0+294/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ff4%2Fd2%2F5bd9440a939c93c606480dd22cb4%2F02994df5e0ce46bfb6f60b1084585d29", "publishedAt": "2025-04-18T03:06:00Z", "content": "BALTIMORE (AP) A federal judge on Thursday imposed new restrictions on billionaire Elon Musks Department of Government Efficiency, limiting its access to Social Security systems that hold personal da… [+5722 chars]"}]}