{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YourErie"}, "author": "Brian Entin", "title": "CDC: More than 5M have skipped second dose of coronavirus vaccine - YourErie", "description": "More than 5 million Americans have skipped out on their second dose of the COVID-19 vaccine, according to The Centers for Disease Control and Prevention.", "url": "https://www.yourerie.com/health/coronavirus/your-local-vaccine-hq/cdc-more-than-5m-have-skipped-second-dose-of-coronavirus-vaccine/", "urlToImage": "https://www.yourerie.com/wp-content/uploads/sites/27/2021/04/GettyImages-1231208110.jpg?w=1280", "publishedAt": "2021-04-26T22:13:46Z", "content": "MIAMI (NewsNation Now) More than 5 million Americans have skipped out on their second dose of the COVID-19 vaccine, according to The Centers for Disease Control and Prevention. \r\nI was one of those p… [+981 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": null, "title": "WHO Pushes Routine Vaccinations Amid COVID Downturn - Voice of America", "description": "Thirty-seven percent of surveyed countries are still experiencing disruptions in vaccinating children against deadly diseases like measles compared to 2020 levels, according to a press release from the World Health Organization (WHO), UNICEF and Gavi, the Vac…", "url": "https://www.voanews.com/covid-19-pandemic/who-pushes-routine-vaccinations-amid-covid-downturn", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/ap-images/2021/04/c83f9a85410b0c6438eec725d754d231.jpg", "publishedAt": "2021-04-26T18:45:33Z", "content": "Thirty-seven percent of surveyed countries are still experiencing disruptions in vaccinating children against deadly diseases like measles compared to 2020 levels, according to a press release from t… [+1565 chars]"}, {"source": {"id": null, "name": "Vanguard"}, "author": "Emmanuel Okogba", "title": "Pantamism, Talibanism, Americanism and extremism: Ingredients cooking terrorism - Vanguard", "description": "By Owei Lakemfa NIGERIA’s  Minister of Communications and Digital Economy, Dr. Isa Ali Ibrahim, also known as Pantami, is busy fighting off those who accuse him of holding extreme Islamic views. He seemed particularly frightened by claims that the United Stat…", "url": "https://www.vanguardngr.com/2021/04/pantamism-talibanism-americanism-and-extremism-ingredients-cooking-terrorism/", "urlToImage": "https://i1.wp.com/www.vanguardngr.com/wp-content/uploads/2020/07/OWEI1-2.gif?fit=1000%2C411&ssl=1", "publishedAt": "2021-04-26T09:22:46Z", "content": "By Owei Lakemfa\r\nNIGERIAs  Minister of Communications and Digital Economy, Dr. Isa Ali Ibrahim, also known as Pantami, is busy fighting off those who accuse him of holding extreme Islamic views. He s… [+6609 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Jake Coyle", "title": "Chloe Zhao makes Oscar history, winning best director - CTV News", "description": "Chloe Zhao's 'Nomadland,' a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao became the first woman of colour to win best director and a historically dive…", "url": "https://www.ctvnews.ca/entertainment/nomadland-wins-best-picture-at-a-distanced-oscars-1.5401418", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5337907.1615206924!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-04-25T11:23:00Z", "content": "Chloe Zhao's \"Nomadland,\" a wistful portrait of itinerant lives on open roads across the American West, won best picture Sunday at the 93rd Academy Awards, where the China-born Zhao became the first … [+8327 chars]"}]}