{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Efficacy and safety of the CVnCoV SARS-CoV-2 mRNA vaccine candidate in ten countries in Europe and Latin America (HERALD): a randomised, observer-blinded, placebo-controlled, phase 2b/3 trial - The Lancet", "description": "CVnCoV was efficacious in the prevention of COVID-19 of any severity and had an acceptable\nsafety profile. Taking into account the changing environment, including the emergence\nof SARS-CoV-2 variants, and timelines for further development, the decision has be…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00677-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a10b0d67-6de1-4ee7-be6e-33794a3d1268/gr1.jpg", "publishedAt": "2021-11-23T23:31:01Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2021 Elsevier In… [+157 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Jon Batiste leads Grammy nominations — Justin Bieber, Doja Cat, H.E.R. closely follow - CBC.ca", "description": "American musician and multi-genre performer scored the most nominations with 11, including an album of the year nod for We Are and record of the year with Freedom. Bieber, Doja Cat and H.E.R. each came away with the second-most nominations with eight each.", "url": "https://www.cbc.ca/news/entertainment/jon-batiste-grammy-nominations-bieber-doja-cat-her-1.6258437", "urlToImage": "https://i.cbc.ca/1.6259682.1637692389!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/jon-batiste.jpg", "publishedAt": "2021-11-23T22:32:00Z", "content": "Canadian musical talent was in the spotlight today at the nominations announcement for the 64th Grammy Awards, as some of the country's biggest hitmakers like Justin Bieber and Drake were named, as w… [+6904 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'DWTS' Mirror Ball champions - Good Morning America", "description": "Iman Shumpert and Daniela Karagach discuss their “Dancing With the Stars” win.", "url": "https://www.youtube.com/watch?v=VEKl7yvFYYQ", "urlToImage": "https://i.ytimg.com/vi/VEKl7yvFYYQ/maxresdefault.jpg", "publishedAt": "2021-11-23T22:11:20Z", "content": null}, {"source": {"id": null, "name": "Variety"}, "author": "Mónica Marie Zorrilla", "title": "TV Ratings: 2021 American Music Awards Hold Steady Amid Social Media Flurry - Variety", "description": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged. Sunday night’s awards show, which was hosted by Cardi B, averaged a 1.0/7 rating among adults …", "url": "https://variety.com/2021/tv/news/tv-ratings-2021-american-music-awards-1235118124/", "urlToImage": "https://variety.com/wp-content/uploads/2021/11/161383_SC1_5006.jpg?w=1000", "publishedAt": "2021-11-23T19:28:00Z", "content": "In a tough climate for televised awards shows, the 2021 American Music Awards managed to hold steady with last year’s ratings even as social media around it surged.\r\nSunday night’s awards show, which… [+2230 chars]"}, {"source": {"id": null, "name": "Thenyindependent.com"}, "author": null, "title": "Pandemic Death Toll Could Hit 1 Million by Spring; Tougher Curbs on Unvaxed Needed - New York Independent", "description": "The COVID-19 pandemic is likely to persist, fueled by nearly 120 million unvaccinated Americans who are allowing the virus to sustain itself and potentially incubate into new, deadlier variants.", "url": "https://www.thenyindependent.com/1699548/un-vaxed-prolonging-pandemic/", "urlToImage": "https://www.thenyindependent.com/wp-content/webpc-passthru.php?src=https://www.thenyindependent.com/wp-content/uploads/2021/03/COVID-19_Nurse.jpg&nocache=1", "publishedAt": "2021-11-23T17:27:52Z", "content": "A surgical nurse preps a patient in New York City during the COVID-19 pandemic. (Photo: US Navy)\r\nThe COVID-19 pandemic is likely to persist, fueled by nearly 120 million unvaccinated Americans who a… [+6753 chars]"}]}