{"articles": [{"author": "Web Desk", "content": "Prince Harry is thought to be wanting to be relevant in American after news broke of him securing two jobs. \r\nThe Duke of Sussex has been recruited as the Chief Impact Officer at Silicon Valley-based… [+941 chars]", "description": "Meghan Markle is more easily employable because of her American identity while Prince Harry is stirring up confusion", "publishedAt": "2021-03-30T13:57:00Z", "source": {"id": null, "name": "Www.geo.tv"}, "title": "Prince Harry secured two jobs to keep up with Meghan Markle - Geo News", "url": "https://www.geo.tv/latest/342383-prince-harry-secured-two-jobs-to-keep-up-with-meghan-markle", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2021-03-30/342383_065732_updates.jpg"}, {"author": "Bob Yirka", "content": "A team of researchers from Universidade de São Paulo, Universidade Federal do Rio Grande do Sul and Universitat Pompeu Fabra, has found evidence of a genetic Australasian influence in more parts of S… [+3062 chars]", "description": "A team of researchers from Universidade de São Paulo, Universidade Federal do Rio Grande do Sul and Universitat Pompeu Fabra, has found evidence of a genetic Australasian influence in more parts of South America than just the Amazon. In their paper published …", "publishedAt": "2021-03-30T13:44:48Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Australasian genetic influence spread wider in South America than previously thought - Phys.org", "url": "https://phys.org/news/2021-03-australasian-genetic-wider-south-america.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/2-southamerica.jpg"}, {"author": "Caroline Linton", "content": "President Biden announced Monday that 90% of all American adults will be eligible for the COVID-19 vaccine by April 19, about two weeks before May 1, the date he had previously set as the goal. But M… [+2214 chars]", "description": "Mr. Biden also warned Americans \"don't let up now,\" and called on governors who have lifted mask mandates to reinstate them.", "publishedAt": "2021-03-30T10:53:23Z", "source": {"id": "cbs-news", "name": "CBS News"}, "title": "Biden says 90% of all U.S. adults will be eligible for COVID-19 vaccine by April 19 - CBS News", "url": "https://www.cbsnews.com/news/covid-vaccine-eligibility-90-percent-april-19/", "urlToImage": "https://cbsnews1.cbsistatic.com/hub/i/r/2021/03/29/66c46e59-3287-41df-828d-28cc9b4a645c/thumbnail/1200x630/9cc52ecc0245962acd6f88adbd99f818/gettyimages-1232006735.jpg"}, {"author": "AFP", "content": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May duri… [+4774 chars]", "description": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May during an arrest on a minor charge.", "publishedAt": "2021-03-30T05:33:16Z", "source": {"id": null, "name": "EWN"}, "title": "Jury in George Floyd murder trial shown harrowing video of his death - Eyewitness News", "url": "https://ewn.co.za/2021/03/30/jury-in-george-floyd-murder-trial-shown-harrowing-video-of-his-death", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/yng9tpllm5leq4xsq2o7"}, {"author": "Kurt Lozano", "content": "(Photo: Thunder Predator)\r\nThe Group Stage of the ONE Esports Dota 2 Singapore Major started on Monday (29 March), with South American underdogs Thunder Predator coming out of nowhere to finish the f… [+6253 chars]", "description": "As the second-placed team of the traditionally weaker South American regional league, they were expected to struggle against the representatives from other...", "publishedAt": "2021-03-29T13:57:36Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Singapore Major Day 3 recap: Thunder Predator shred the opposition - Yahoo Singapore News", "url": "https://sg.news.yahoo.com/singapore-major-day-3-recap-thunder-predator-go-undefeated-135736808.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/dd1d8660-9082-11eb-abc3-c2abad2e01cd"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "america"}