{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "US left Bagram Air Base in dead of night, didn't tell new Afghan commander - Fox News", "description": "The U.S. left Afghanistan's Bagram Airfield after nearly 20 years by shutting off the electricity and slipping away in the night without notifying the base's new Afghan commander, who discovered the Americans' departure more than two hours after they left, Af…", "url": "https://www.foxnews.com/politics/us-left-afghan-airfield-at-night-didnt-tell-new-commander", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/07/Bagram.png", "publishedAt": "2021-07-05T22:42:08Z", "content": "BAGRAM, Afghanistan The U.S. left Afghanistan's Bagram Airfield after nearly 20 years by shutting off the electricity and slipping away in the night without notifying the base's new Afghan commander,… [+6073 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Catherine Triomphe, Agence France-Presse", "title": "The American South: A weak link in US the COVID-19 vaccination campaign - ABS-CBN News", "description": "With a sizable Black minority traditionally mistrustful of vaccines and with many conservative rural whites convinced that the vaccine is more dangerous than Covid-19 itself, Southern US states like Alabama have some of the country's lowest vaccination rates,…", "url": "https://news.abs-cbn.com/spotlight/07/05/21/the-american-south-a-weak-link-in-us-the-covid-19-vaccination-campaign", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2020/afp/11/22/vaccine.jpg", "publishedAt": "2021-07-05T10:30:00Z", "content": "With a sizable Black minority traditionally mistrustful of vaccines and with many conservative rural whites convinced that the vaccine is more dangerous than Covid-19 itself, Southern US states like … [+5306 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Antony Sguazzin", "title": "Anglo American knew of lead danger at Zambian mine, doctor says - News24", "description": "A doctor said Anglo American was aware of the danger lead poisoning posed to employees and commissioned a study into its impact in a community close to a Zambian mine where he worked.", "url": "https://www.news24.com/fin24/companies/mining/anglo-american-knew-of-lead-danger-at-zambian-mine-doctor-says-20210705", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7508/4f8031e4189044b7a7a48d9baa9ef708.jpg", "publishedAt": "2021-07-05T09:11:23Z", "content": "<ul><li>A doctor said Anglo American was aware of the danger lead poisoning posed to employees at a Zambian mine. </li><li>A hearing to consider Anglo's request for an extension so that it can file i… [+4328 chars]"}]}