{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "Sisters aged 9 and 4 crashed a car they stole because they wanted to 'swim with dolphins' - Business Insider South Africa", "description": "The parents of two American girls were horrified and shocked to learn their kids had sneaked out of the family home in West Jordan in Utah in the middle of the night.", "url": "https://www.insider.com/girls-9-4-steal-family-car-swim-with-dolphins-california-2021-6", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9986/77425773617b4c6d97f01dcca2b96777.jpg", "publishedAt": "2021-06-05T17:33:47Z", "content": "Two young American girls stole their parents' car so that they could drive from Utah to California, a distance of over 1,000 kilometres, to go to the beach and \"swim with dolphins,\" authorities said.… [+2937 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "LOOK: Marvel comics introduces a Fil-Am hero inspired by Captain America - Manila Bulletin", "description": "Meet Ari Agbayani, a Fil-Am college student, the newest hero of 'The United States Of Captain American' comic series \nAri Agbayani designed by Jodi Nishijima; and on 'The United States Of Captain American #4' variant cover by Peach Momoko (Photos from Marvel)…", "url": "https://mb.com.ph/2021/06/05/look-marvel-comics-introduces-a-fil-am-hero-inspired-by-captain-america/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/06/9624.jpeg", "publishedAt": "2021-06-05T09:32:00Z", "content": "Filipino Marvel comic fans will surely be delighted by the upcoming fourth installment of “The United States Of Captain American” series as, this time, a new hero will grace its pagesand she’s half P… [+2276 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "When you have been fully vaccinated... ― Hafiz Hassan - Malay Mail", "description": "JUNE 4 ― There have been a number of references to the American Centers for Disease Control and Prevention (CDC) in recent days. Foremost is the reference by the Academy of Medicine of Malaysia (AMM) which criticised the practice of public sanitation which wa…", "url": "https://www.malaymail.com/news/what-you-think/2021/06/04/when-you-have-been-fully-vaccinated-hafiz-hassan/1979503", "urlToImage": "https://www.malaymail.com/graphics/meta/og-image.png", "publishedAt": "2021-06-04T02:07:50Z", "content": "JUNE 4 There have been a number of references to the American Centers for Disease Control and Prevention (CDC) in recent days.\r\nForemost is the reference by the Academy of Medicine of Malaysia (AMM) … [+2805 chars]"}]}