{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Ryan Gajewski", "title": "Hawk Tuah Girl’s New Manager Reveals What’s Next for Her: “There Are Endless Opportunities” - Hollywood Reporter", "description": "Haliey Welch's rep Jonnie Forster tells The Hollywood Reporter about turning down gigs (sorry, 'American Idol' and OnlyFans!), those lucrative merch sales and why a reality TV series might show her doing one thing she had never tried pre-fame.", "url": "http://www.hollywoodreporter.com/business/business-news/hawk-tuah-girl-haliey-welch-manager-interview-1235947027/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2024/07/0U9A2440.jpg?w=1296&h=730&crop=1", "publishedAt": "2024-07-13T22:09:05Z", "content": "A viral TikTok of Haliey Welch, aka “Hawk Tuah Girl,” making a sexy joke while partying in Nashville has become the gift that keeps on giving — and not just for Welch herself.\r\nAs anyone with access … [+10702 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Melissa Rudy", "title": "Half of cancer deaths could have been prevented through lifestyle changes, says American Cancer Society report - Fox News", "description": "As many as 40% of cancer cases — and up to half of cancer-related deaths — could have been prevented, according to a new study from the American Cancer Society. Doctors shared thoughts.", "url": "https://www.foxnews.com/health/half-cancer-deaths-could-have-been-prevented-through-lifestyle-changes-says-american-cancer-society-report", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/07/healthy-habit-split.jpg", "publishedAt": "2024-07-13T13:38:00Z", "content": "Join Fox News for access to this content\r\nPlus special access to select articles and other premium content with your account - free of charge.\r\nBy entering your email and pushing continue, you are ag… [+7157 chars]"}]}