{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak and Kate Sullivan, CNN", "title": "Biden calls for 3-month suspension of gas tax but faces long odds of getting Congress on board - CNN", "description": "President Joe Biden on Wednesday called on Congress to suspend federal gasoline and diesel taxes until the end of September, framing the move as necessary to provide relief to American consumers but itself not enough to resolve the problem of surging energy p…", "url": "https://www.cnn.com/2022/06/22/politics/gas-tax-suspension-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220622144115-03-joe-biden-gas-prices-062222-super-tease.jpg", "publishedAt": "2022-06-22T18:20:00Z", "content": "Washington (CNN)President Joe Biden on Wednesday called on Congress to suspend federal gasoline and diesel taxes until the end of September, framing the move as necessary to provide relief to America… [+7623 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": "Jenni Mortimer", "title": "American country music star Luke Combs reveals All Blacks dream - New Zealand Herald", "description": "Luke Combs was one try from rugby glory, but he traded it all for Crocs and a microphone.", "url": "https://www.nzherald.co.nz/entertainment/american-country-music-star-luke-combs-reveals-all-blacks-dream/M4WDQHE6MDPBH6QUV2BTZQNVIE/", "urlToImage": "https://www.nzherald.co.nz/resizer/vpn7JhyMFUOFe5UhZdCAWc7TotQ=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VQCKPZUSAURCHW324ZRYPFF7WU.jpg", "publishedAt": "2022-06-22T17:00:00Z", "content": "Luke Combs' new album reflects a time of change for the country artist. Photo / Getty Images America's biggest country music star Luke Combs hadn't picked up a guitar until he was of legal drinking a… [+3775 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Lebanese dance crew Mayyas get Golden Buzzer on 'America's Got Talent' - Arab News", "description": "DUBAI: Lebanese dance group Mayyas on Tuesday got the Golden Buzzer from Colombian actress and judge Sofia Vergara in season 17 of “America’s Got Talent.” Mayyas — that according to the crew translates in Arabic to mean, the proud walk of a lioness — stepped …", "url": "https://www.arabnews.com/node/2108491", "urlToImage": "https://www.arabnews.com/sites/default/files/main-image/2022/06/22/3298241-1569722525.png", "publishedAt": "2022-06-22T10:05:21Z", "content": "LONDON: Palestinian novelist Gharib Asqalani died at the age of 74 in Gaza on Tuesday.\r\nDuring a lengthy literary career, Asqalani published nine novels, six short story collections, three collection… [+1945 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Peter Dockrill", "title": "Americans Are Wasting Billions Every Year on Useless Supplements, Scientists Warn - ScienceAlert", "description": "For years scientists have been saying there's not much evidence to recommend vitamin supplements for most people, with a growing body of research suggesting most of the pills are useless and don't necessarily make us any healthier.", "url": "https://www.sciencealert.com/americans-are-wasting-billions-every-year-on-useless-supplements-scientists-warn", "urlToImage": "https://www.sciencealert.com/images/2022-06/processed/BluePillsInWhiteBottle_1024.jpg", "publishedAt": "2022-06-22T06:01:30Z", "content": "For years scientists have been saying there's not much evidence to recommend vitamin supplements for most people, with a growing body of research suggesting most of the pills are useless and don't ne… [+4696 chars]"}]}