{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Discovery of extinct prehistoric reptile that lived among dinosaurs - Science Daily", "description": "Researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists describe the new species Opisthiamimus gregori, which once inhabited Jurassic North America…", "url": "https://www.sciencedaily.com/releases/2022/09/220915123701.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-15T17:08:06Z", "content": "Smithsonian researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists, including the Nati… [+5762 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deblina Chakraborty", "title": "Polio is back. How concerned should Americans be? - CNN", "description": "An August report from the US Centers for Disease Control and Prevention said that \"even a single case of paralytic polio represents a public health emergency in the United States.\" CNN Medical Analyst Dr. Leana Wen explains why.", "url": "https://www.cnn.com/2022/09/15/health/polio-paralysis-vaccine-health-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220914213846-04-polio-vaccination-virus-new-york-health-wellness.jpg?q=w_800,c_fill", "publishedAt": "2022-09-15T17:02:00Z", "content": "New Yorks governor has declared a state of emergency after health officials detected poliovirus in the wastewater of five counties evidence the disease is circulating. The declaration also follows a … [+7614 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Yushi Nohara", "title": "Finally! EMUI 12 fetched for more Huawei Y8p users - HC Newsroom", "description": "Huawei already activated the release of the EMUI 12 for Huawei Y8p users and in the meantime company is working to expand its reach to other users including the Middle East & Africa, and Latin America. This latest update for the Huawei Y8p users can be identi…", "url": "https://www.huaweicentral.com/finally-emui-12-fetched-for-more-huawei-y8p-users/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/09/Huawei-Y8p-EMUI-12-1000x576.jpg", "publishedAt": "2022-09-15T16:04:02Z", "content": "Huawei is now expanding the stable EMUI 12 software for more Huawei Y8p/P Smart S consumers in the global market. Alongside bringing new features and functionalities the update comes with new customi… [+1658 chars]"}]}