{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "General Electric to be broken up into 3 distinct companies - CBC.ca", "description": "General Electric, the storied American manufacturer that struggled under its own weight after growing to become a sprawling conglomerate, will divide itself into three public companies focused on aviation, healthcare and energy.", "url": "https://www.cbc.ca/news/business/ge-split-1.6242707", "urlToImage": "https://i.cbc.ca/1.3610986.1464803130!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ge-logo.jpg", "publishedAt": "2021-11-09T18:09:12Z", "content": "General Electric, the storied American manufacturer that struggled under its own weight after growing to become a sprawling conglomerate, will divide itself into three public companies focused on avi… [+3674 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "General Electric announces plan to split into three separate companies - The Guardian", "description": "GE, 129 years old and once America’s most valuable corporation, says new companies will focus on energy, healthcare and aviation", "url": "https://amp.theguardian.com/business/2021/nov/09/general-electric-business-healthcare-energy-aviation", "urlToImage": null, "publishedAt": "2021-11-09T16:55:00Z", "content": "General ElectricGE, 129 years old and once Americas most valuable corporation, says new companies will focus on energy, healthcare and aviation\r\nGeneral Electric said on Tuesday it would split into t… [+2935 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Ya está disponible la boletería para los Juegos Panamericanos Junior - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/advanced/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2021-11-09T14:45:22Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "See which cheeses are healthier, according to experts - Play Crazy Game", "description": "It seems impossible not to love cheese, a food of indisputable popularity. In the US alone, Americans consumed more than 38 kilograms of cheese per capita in 2020 alone, according to data from the US Department of Agriculture.Now, if eating cheese is healthy,…", "url": "https://playcrazygame.com/2021/11/09/see-which-cheeses-are-healthier-according-to-experts/", "urlToImage": "https://www.cnnbrasil.com.br/wp-content/uploads/sites/12/2021/06/25858_728937943376796E.jpg?w=1200", "publishedAt": "2021-11-08T19:06:44Z", "content": "It seems impossible not to love cheese, a food of indisputable popularity. In the US alone, Americans consumed more than 38 kilograms of cheese per capita in 2020 alone, according to data from the US… [+6231 chars]"}]}