{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": null, "title": "Shein Hikes US Prices as Much as 377% Ahead of Tariff Increases - Bloomberg.com", "description": "Fast-fashion giant Shein Group Ltd. raised US prices of its products from dresses to kitchenware ahead of imminent tariffs on small parcels, in an early sign of the potential effect of the trade war on American consumers.", "url": "https://www.bloomberg.com/news/articles/2025-04-27/shein-hikes-us-prices-as-much-as-377-ahead-of-tariff-increases", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iNRq.t0B3qnY/v1/1200x899.jpg", "publishedAt": "2025-04-27T09:01:23Z", "content": "Supply Lines is a daily newsletter that tracks global trade. Sign up here.\r\nFast-fashion giant Shein Group Ltd. raised US prices of its products from dresses to kitchenware ahead of imminent tariffs … [+97 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Dan Balz, Scott Clement, Emily Guskin", "title": "Trump approval sinks as Americans criticize his major policies, poll finds - The Washington Post", "description": "President Donald Trump’s 100 days poll finds a lower approval rating, growing opposition to his agenda and opposition to many of his major initiatives.", "url": "https://www.washingtonpost.com/politics/2025/04/27/trump-poll-approval-rating-100-days/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5Q5ZZPSBTYHN4XLGNUC7MNZ2QA.JPG&w=1440", "publishedAt": "2025-04-27T08:30:44Z", "content": "As he nears the end of his first 100 days in office, President Donald Trump is facing growing opposition to his ambitious and controversial agenda, with his approval rating in decline, majority oppos… [+10283 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Srinivas Mazumdaru", "title": "US: ICE deports 3 American children, say lawyers - DW", "description": "Immigration officials in the United States have in recent days deported three children aged 2, 4 and 7 who are US citizens along with their Honduran-born mothers, their lawyers said.", "url": "https://www.dw.com/en/us-ice-deports-3-american-children-say-lawyers/a-72366567", "urlToImage": "https://static.dw.com/image/71983158_6.jpg", "publishedAt": "2025-04-27T04:44:20Z", "content": "US Immigration and Customs Enforcement (ICE) agents have deported three American children aged 2, 4 and 7 along with their undocumented immigrant mothers, their lawyers said on Saturday.\r\nThe deporta… [+2605 chars]"}]}