{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "Study: NASA Space Strike Might Have Reshaped an Asteroid - VOA Learning English", "description": "A new study suggests that an asteroid strike by an American spacecraft changed the shape of Dimorphos. Researchers used computer models to recreate the crash. They said the asteroid likely turned into a weak “rubble pile.”", "url": "https://learningenglish.voanews.com/a/study-nasa-space-strike-might-have-reshaped-an-asteroid/7509401.html", "urlToImage": "https://gdb.voanews.com/C27B36A6-BC02-4175-9B42-68C44C0D9969_cx6_cy3_cw93_w1200_r1.jpg", "publishedAt": "2024-03-03T22:05:00Z", "content": "A new study suggests that an asteroid strike by an American spacecraft likely changed the shape of the targeted object.\r\nNASA crashed the DART spacecraft into the asteroid Dimorphos in 2022. The aste… [+3897 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Your Definitive Guide to the 2024 Great North American Solar Eclipse - Gizmodo", "description": "Everything you need to know ahead of the historic total solar eclipse on April 8.", "url": "https://gizmodo.com/great-north-american-solar-eclipse-2024-watch-guide-1851290096", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/fcbf0c6a60392b5a75d40de46398036b.jpg", "publishedAt": "2024-03-03T14:20:00Z", "content": "Millions of people across North America will soon have the opportunity to witness a rare and special astronomical eventa total solar eclipseduring which the Moon will completely obscure the Sun along… [+9873 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cannabis and Heart Health: A Troubling Connection Uncovered - SciTechDaily", "description": "More frequent use of cannabis was associated with higher odds of adverse cardiovascular outcomes, finds a new study in the Journal of the American Heart Association. Research Highlights: An analysis of survey data for 430,000 adults in the U.S. found that usi…", "url": "https://scitechdaily.com/cannabis-and-heart-health-a-troubling-connection-uncovered/", "urlToImage": "https://scitechdaily.com/images/Cannabis-Doctor.jpg", "publishedAt": "2024-03-03T03:47:05Z", "content": "Cannabis use is associated with higher risks of heart attack and stroke, a study of 430,000 adults indicates, stressing the need for awareness of its cardiovascular effects. Credit: SciTechDaily.com\r… [+8375 chars]"}]}