{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ronny Reyes", "title": "US Rep says he has proof that Biden lied Kabul airport evacuation - Daily Mail", "description": "U.S. Rep. Markwayne Mullin, 44, said he has secret recordings of Americans failing to get to the airport in time for the final evacuation. He blamed Biden for the failings of the evacuation.", "url": "https://www.dailymail.co.uk/news/article-9958165/US-Rep-says-evidence-proves-Biden-lied-citizens-having-access-Kabul-airport.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/09/04/20/47509241-0-image-a-39_1630782649313.jpg", "publishedAt": "2021-09-04T19:57:50Z", "content": "A U.S. Representative from Oklahoma who made two unauthorized trips to try and enter Afghanistan to aid in the evacuation effort said he has proof that President Joe Biden lied about Americans and vi… [+4839 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "'Players will explode' - Busquets warns against burnout amid proposal to hold World Cup every two years - Goal India", "description": "Lionel Messi's Argentina and Neymar's Brazil are leading South American qualifying for the 2022 FIFA World Cup in Qatar. The top four qualify directly and the fifth-place team will qualify for a playoff.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-09-04T16:43:00Z", "content": ""}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Zeke Miller", "title": "U.S. COVID-19 booster shot plan faces complications, some may miss Sept. 20 - CP24 Toronto's Breaking News", "description": "President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the availability of third doses for those who received the Moderna vaccine, administ…", "url": "https://www.cp24.com/world/u-s-covid-19-booster-shot-plan-faces-complications-some-may-miss-sept-20-1.5573028", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5573030.1630703331!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-03T21:10:04Z", "content": "WASHINGTON (AP) - President Joe Biden's plans to start delivery of booster shots by Sept. 20 for most Americans who received the COVID-19 vaccines are facing new complications that could delay the av… [+4245 chars]"}, {"source": {"id": null, "name": "Playcrazygame.com"}, "author": "Abhishek Pratap", "title": "Solar wave could bring down internet in the world on Monday (6) | Viral | Online Diary - Play Crazy Game", "description": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal mass ejections. According to SpaceWeather.com, a kind of “so…", "url": "https://playcrazygame.com/2021/09/03/solar-wave-could-bring-down-internet-in-the-world-on-monday-6-viral-online-diary/", "urlToImage": "https://cdn.dol.com.br/img/inline/670000/auroraboreal_00670554_0_.jpg?xid=1601192", "publishedAt": "2021-09-03T16:48:51Z", "content": "The sun is agitated and this can pose serious problems for internet services around the world, especially in North America, where the cables that transmit digital signals are more exposed to coronal … [+3604 chars]"}]}