{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Taliban take Kabul, President Ashraf Ghani flees, America absconds - The Indian Express", "description": "This is the first time since their ouster 20 years ago in the wake of the 9/11 strikes that Taliban fighters have entered the city — they first seized the Capital in 1996. Late at night, fighters in pickups and SUVs did victory rounds in the heart of Kabul.", "url": "https://indianexpress.com/article/world/afghanistan-crisis-taliban-take-kabul-president-ashraf-ghani-flees-america-absconds-7455382/", "urlToImage": "https://images.indianexpress.com/2014/03/AP21227745550845.jpg", "publishedAt": "2021-08-15T23:31:12Z", "content": "Kabul, the ultimate prize in every Afghanistan war, fell to the Taliban Sunday, completing their takeover of the country in a lighting offensive that saw provinces and warlords give up without a figh… [+2155 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Zeke Miller, Jonathan Lemire and Josh Boak", "title": "Biden team surprised by rapid Taliban gains in Afghanistan - CTV News", "description": "U.S. President Joe Biden and other top U.S. officials were stunned on Sunday by the pace of the Taliban's nearly complete takeover of Afghanistan, as the planned withdrawal of American forces urgently became a mission to ensure a safe evacuation.", "url": "https://www.ctvnews.ca/world/biden-team-surprised-by-rapid-taliban-gains-in-afghanistan-1.5548240", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5548247.1629067532!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-08-15T22:48:34Z", "content": "WASHINGTON -- \r\nU.S. President Joe Biden and other top U.S. officials were stunned on Sunday by the pace of the Taliban's nearly complete takeover of Afghanistan, as the planned withdrawal of America… [+8179 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Gillian Brockell", "title": "The fall of Saigon: As Taliban seizes Kabul, the Vietnam War's final days remembered - The Washington Post", "description": "In 1975, Saigon fell to the North Vietnamese faster than expected, leading to chaos and  to the largest helicopter airlift ever attempted to rescue hundreds of Americans and South Vietnamese, who scaled the embassy's walls.", "url": "https://www.washingtonpost.com/history/2021/08/15/saigon-fall-kabul-taliban/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BZ54FPH5CEI6XEI4KJF4RNUPC4.jpg&w=1440", "publishedAt": "2021-08-15T21:14:30Z", "content": "Thats what Ford faced on the evening of April 28, 1975, and it is history repeating itself now. After 20 years of U.S. involvement, the Taliban entered the Afghan capital, Kabul, on Sunday morning, a… [+4885 chars]"}, {"source": {"id": null, "name": "Awanireview.com"}, "author": "Mandy Sims", "title": "Boeing Starliner returns to the factory instead of taking off to space - Awani Review", "description": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it's not about to end. The second", "url": "https://www.awanireview.com/boeing-starliner-returns-to-the-factory-instead-of-taking-off-to-space/", "urlToImage": null, "publishedAt": "2021-08-15T18:33:27Z", "content": "The end of the Boeing game? In the industrial-led space race, the American is anyway dangerously behind schedule, and it’s not about to end. The second unmanned test flight of its Starliner space cap… [+2719 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "Afghan forces surrender Bagram air base to Taliban - Economic Times", "description": "Bagram district chief Darwaish Raufi said Sunday that the surrender handed the one-time American base over to the insurgents.", "url": "https://economictimes.indiatimes.com/news/defence/afghan-forces-surrender-bagram-air-base-to-taliban/articleshow/85347683.cms", "urlToImage": "https://img.etimg.com/thumb/msid-85347889,width-1070,height-580,imgsize-189489,overlay-etdefence/photo.jpg", "publishedAt": "2021-08-15T11:06:00Z", "content": "An Afghan official says forces at Bagram air base, home to a prison housing 5,000 inmates, have surrendered to the Taliban.\r\nBagram district chief Darwaish Raufi said Sunday that the surrender handed… [+7580 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "John Whittle", "title": "Ford GT Heritage Edition debuts at Monterey signalling end of production - Carmag South Africa", "description": "A modern interpretation of the original, the Ford GT Heritage Edition pays homage to the 1964 Ford GT prototypes that led to America’s only Le Mans-winning supercar, a Le Mans champion from 1966 to 1969, and again in 2016.", "url": "https://www.carmag.co.za/news/new-models/ford-gt-heritage-edition/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/08/2022FordGT’64HeritageEditionand1964FordGTprototype_02.jpg", "publishedAt": "2021-08-15T09:24:50Z", "content": "A modern interpretation of the original, the Ford GT Heritage Edition pays homage to the 1964 Ford GT prototypes that led to Americas only Le Mans-winning supercar, a Le Mans champion from 1966 to 19… [+2348 chars]"}]}