{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Jessica Gresko", "title": "Supreme Court expands gun rights, with nation divided - The Associated Press", "description": "WASHINGTON (AP) — In a major expansion of gun rights, the Supreme Court said Thursday that Americans have a right to carry firearms in public for self-defense, a ruling likely to lead to more people legally armed in cities and beyond.", "url": "https://apnews.com/article/supreme-court-guns-decision-58d01ef8bd48e816d5f8761ffa84e3e8", "urlToImage": "https://storage.googleapis.com/afs-prod/media/31efe32cad8542abbb14fc6b0b778100/3000.jpeg", "publishedAt": "2022-06-23T17:47:11Z", "content": "WASHINGTON (AP) In a major expansion of gun rights, the Supreme Court said Thursday that Americans have a right to carry firearms in public for self-defense, a ruling likely to lead to more people le… [+5346 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Zhang Nannan", "title": "Scientists observe longitudinal plasmonic field in nanocavity at subnano-scale - Phys.org", "description": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research published in the Journal of the American Chemical Society.", "url": "https://phys.org/news/2022-06-scientists-longitudinal-plasmonic-field-nanocavity.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/scientists-observe-lon.jpg", "publishedAt": "2022-06-22T17:38:48Z", "content": "A group of scientists working on surface-enhanced Raman spectroscopy (SERS) has made a nanoruler to provide insight into the longitudinal plasmonic fields in nanocavities, according to research publi… [+2636 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": "Jenni Mortimer", "title": "American country music star Luke Combs reveals All Blacks dream - New Zealand Herald", "description": "Luke Combs was one try from rugby glory, but he traded it all for Crocs and a microphone.", "url": "https://www.nzherald.co.nz/entertainment/american-country-music-star-luke-combs-reveals-all-blacks-dream/M4WDQHE6MDPBH6QUV2BTZQNVIE/", "urlToImage": "https://www.nzherald.co.nz/resizer/vpn7JhyMFUOFe5UhZdCAWc7TotQ=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/VQCKPZUSAURCHW324ZRYPFF7WU.jpg", "publishedAt": "2022-06-22T17:00:00Z", "content": "Luke Combs' new album reflects a time of change for the country artist. Photo / Getty Images America's biggest country music star Luke Combs hadn't picked up a guitar until he was of legal drinking a… [+3775 chars]"}]}