{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Janie Boschma, Daniel Wolfe, Meghna Maharishi, Priya Krishnakumar, Christopher Hickey and David Wright, CNN", "title": "Census release shows America is more diverse and more multiracial than ever - CNN", "description": "Non-Hispanic White Americans continue to be the most prevalent group in every state, except for in California, Hawaii and New Mexico, as well as in the District of Columbia and Puerto Rico.", "url": "https://www.cnn.com/2021/08/12/politics/us-census-2020-data/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210812094012-hponly20210812-census-release-map-super-tease.png", "publishedAt": "2021-08-12T20:02:00Z", "content": "By Janie Boschma, Daniel Wolfe, Meghna Maharishi, Priya Krishnakumar, Christopher Hickey and David Wright, CNN\r\nUpdated 4:02 PM ET, Thu August 12, 2021\r\n (CNN)America is more diverse and more multira… [+3519 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Derek Hawkins, Laurie McGinley, Lena H. Sun", "title": "Americans are sneaking extra coronavirus shots as officials weigh who should get them - The Washington Post", "description": "The trend reflects broad public confusion about the protection offered by the vaccines at a critical time in the nation’s pandemic response, with the hyper-transmissible delta variant causing infections and hospitalizations to soar.", "url": "https://www.washingtonpost.com/health/2021/08/12/covid-booster-vaccine-shots/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://d1i4t8bqe7zgj6.cloudfront.net/07-08-2021/t_8ec4cb88731845dd91260cdc94077c7d_name_1___1920x1080___30p_00_02_10_28_Still024.jpg&w=1440", "publishedAt": "2021-08-12T16:48:00Z", "content": "Then came a drumbeat of reports showing the Johnson &amp; Johnson shots might not offer the same level of immunity as other vaccines. Worried she might develop a breakthrough infection or worse, face… [+11122 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Spencer Kimball", "title": "U.S. deploying 3,000 troops to help evacuate Afghan embassy staff as Taliban advances - CNBC", "description": "The U.S. embassy warned its ability to assist Americans is \"extremely limited even within Kabul\" due to deteriorating security and reduced staffing.", "url": "https://www.cnbc.com/2021/08/12/afghanistan-us-urges-citizens-to-leave-immediately-as-taliban-nears-kabul.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106925933-16287678462021-08-11t155251z_1403747223_rc233p91mvlu_rtrmadp_0_afghanistan-conflict-farah.jpeg?v=1628767883", "publishedAt": "2021-08-12T15:51:42Z", "content": "The U.S. is deploying 3,000 troops to Afghanistan in order to facilitate the drawdown of the U.S. Embassy in Kabul to a \"core diplomatic presence,\" as Taliban militants rapidly advance toward the Afg… [+4729 chars]"}]}