{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Chris Lau, <a href=\"/profiles/ivana-kottasova\">Ivana Kottasová</a> and Sophie Tanno, CNN", "title": "Israel receives new list of hostages set for release during truce: Live updates - CNN", "description": "A third set of hostages is due to be released by Hamas on Sunday, with an American citizen expected to be on the list, according to an Israeli official. Follow for live updates.", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-11-26-23/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/231124164803-rba-israel-01-super-tease.jpg", "publishedAt": "2023-11-26T14:10:00Z", "content": "The Biden administration has reason to believe one of the Americans held hostage will be released Sunday, a top US official said Sunday.\r\nWe're dealing with Hamas. We are in a don't trust, but verify… [+1529 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Dorgan", "title": "Couple claim eye antibiotic cured dog of mysterious illness sweeping America - Fox News", "description": "A California couple are claiming their canine recovered from a potentially deadly disease after being treated with a lifesaving antibiotic.", "url": "https://www.foxnews.com/lifestyle/couple-claim-eye-antibiotic-cured-dog-mysterious-illness-sweeping-america", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/09/iStock-1285465107.jpg", "publishedAt": "2023-11-26T13:51:00Z", "content": "A cure to a mysterious and potentially deadly respiratory condition that has been spreading in dogs throughout the country may have been found with a California couple who claim their canine is on th… [+3380 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Lauren Sforza", "title": "Multiple states under winter weather alerts due to post-Thanksgiving storm - The Hill", "description": "Multiple states are under winter weather alerts across the country on Sunday as millions of Americans prepare for one of the busiest travel days of the year. The National Weather Service (NWS) forecasted that “moderate to heavy snowfall” will continue to impa…", "url": "https://thehill.com/homenews/state-watch/4327521-multiple-states-under-winter-weather-alerts-due-to-post-thanksgiving-storm/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/11/AP23330017819936.jpg?w=1280", "publishedAt": "2023-11-26T12:44:00Z", "content": "Skip to content\r\nMultiple states are under winter weather alerts across the country on Sunday as millions of Americans prepare for one of the busiest travel days of the year.\r\nThe National Weather Se… [+1670 chars]"}]}