{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA Seeking Help on Artemis Lunar Terrain Vehicle Solutions - SciTechDaily", "description": "NASA is asking American companies for additional input on approaches and solutions for a vehicle to transport Artemis astronauts around the lunar South Pole later this decade. The lunar terrain vehicle (LTV), an unenclosed rover that astronauts can drive on t…", "url": "https://scitechdaily.com/nasa-seeking-help-on-artemis-lunar-terrain-vehicle-solutions/", "urlToImage": "https://scitechdaily.com/images/Lunar-Terrain-Vehicle-scaled.jpg", "publishedAt": "2021-09-02T19:17:00Z", "content": "ByNASASeptember 2, 2021\r\nCredit: NASA\r\nNASA\r\nEstablished in 1958, the National Aeronautics and Space Administration (NASA) is an independent agency of the United States Federal Government that succee… [+4046 chars]"}, {"source": {"id": "the-verge", "name": "The Verge"}, "author": "Andrew J. Hawkins", "title": "GM temporarily shuts down North American factories because of chip shortage - The Verge", "description": "GM is temporarily shutting down nine of its North American factories as the auto industry continues to feel the effects of the global semiconductor chip shortage. Many of the company’s most profitable vehicles, including trucks and SUVs, are affected.", "url": "https://www.theverge.com/2021/9/2/22654357/gm-factory-shutdown-chip-shortage-truck-suv", "urlToImage": "https://cdn.vox-cdn.com/thumbor/vF7OaAMww0OUDM_Z2tIi1cCXEYI=/0x605:6000x3746/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22792077/1332379627.jpg", "publishedAt": "2021-09-02T18:22:15Z", "content": "The situation remains complex and very fluid\r\nPhoto by Mario Tama/Getty Images\r\nGeneral Motors, parent company of Chevrolet, GMC, Cadillac, and Buick, said it was temporarily halting production at si… [+2431 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Chip shortage forces GM to extend factory closures - CBC.ca", "description": "General Motors Co. will reduce production at most North American assembly plants this month because of the ongoing semiconductor chip shortage, hitting its profitable truck and sport utility vehicles, it said on Thursday.", "url": "https://www.cbc.ca/news/business/gm-canada-plants-cami-1.6162574", "urlToImage": "https://i.cbc.ca/1.4727356.1630509259!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/trade-dispute-auto-prices.jpg", "publishedAt": "2021-09-02T17:15:46Z", "content": "General Motors Co. will reduce production at most North American assembly plants this month because of the ongoing semiconductor chip shortage, hitting its profitable truck and sport utility vehicles… [+1602 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Travis Caldwell", "title": "More than 500000 U.S. children tested positive for COVID-19 in 3 weeks - CTV News", "description": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not yet eligible to receive vaccinations.", "url": "https://www.ctvnews.ca/health/coronavirus/more-than-500-000-u-s-children-tested-positive-for-covid-19-in-3-weeks-1.5570853", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5570872.1630590742!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T13:54:40Z", "content": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not y… [+7020 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Anne Grace Savitha", "title": "Japanese dad sends heartwarming note to American paralympian Sam Grewe after being inspired by his courage - Malay Mail", "description": "PETALING JAYA, Sept 2 — A Japanese man’s heartwarming note to American paralympic high jumper Sam Grewe has gone viral on Twitter. Grewe posted a picture of the message with captions, “A local Japanese man just handed me this note shortly after I arrived at t…", "url": "https://www.malaymail.com/news/life/2021/09/02/japanese-dad-sends-heartwarming-note-to-american-paralympian-sam-grewe-afte/2002382", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2021/2021-09/0209_LeadImage_SamGrewe-seo.jpg", "publishedAt": "2021-09-02T04:30:38Z", "content": "Grewe's post on the note he received has gone viral with many saying that it was a sweet note sent to the athlete. Picture via TwitterandInstagram/SamGrewe\r\nPETALING JAYA, Sept 2 A Japanese mans hear… [+1444 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "James Mackenzie and Alasdair Pal", "title": "Taliban says it has resistance fighters surrounded, calls for peace - Sydney Morning Herald", "description": "The United States is looking at all possible options and routes to continue helping Americans and legal permanent residents leave Afghanistan.", "url": "https://www.smh.com.au/world/asia/taliban-says-it-has-resistance-fighters-surrounded-calls-for-peace-20210902-p58o1s.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.2149%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/17126b30fc8e9833cb0e6525b59a1e0d37cc6b0a", "publishedAt": "2021-09-01T20:10:17Z", "content": "But we are still trying to ensure that there is no war and that the issue in Panjshir is resolved calmly and peacefully, Motaqi said.\r\nThe remarks came after at least seven Taliban fighters were kill… [+2223 chars]"}]}