{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's SpaceX Crew-4 Mission – What You Need To Know - SciTechDaily", "description": "NASA and SpaceX once again are gearing up to launch astronauts on an American rocket and spacecraft to the International Space Station as part of NASA’s Commercial Crew Program. NASA’s SpaceX Crew-4 is the fourth crew rotation mission that will carry an inter…", "url": "https://scitechdaily.com/nasas-spacex-crew-4-mission-what-you-need-to-know/", "urlToImage": "https://scitechdaily.com/images/NASA-SpaceX-Crew-4-Astronauts-scaled.jpg", "publishedAt": "2022-04-03T08:59:39Z", "content": "NASA’s SpaceX Crew-4 astronauts participate in a training session at SpaceX headquarters in Hawthorne, CA. From left to right: NASA astronaut and SpaceX Crew-4 mission specialist Jessica Watkins; NAS… [+9081 chars]"}, {"source": {"id": null, "name": "GameSpot"}, "author": "Chris E. Hayner", "title": "Cody Rhodes Debuts At WWE Wrestlemania After Leaving AEW - GameSpot", "description": "At long last, \"The American Nightmare\" has returned to WWE.", "url": "https://www.gamespot.com/articles/cody-rhodes-debuts-at-wwe-wrestlemania-after-leaving-aew/1100-6502129/", "urlToImage": "https://www.gamespot.com/a/uploads/screen_kubrick/1578/15789737/3959896-cody.jpeg", "publishedAt": "2022-04-03T03:01:28Z", "content": "One of the biggest questions in all of professional wrestling has been answered. After leaving AEW in February, Cody Rhodes has returned to the ring--and to a company he once called home. The specula… [+1153 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Kyle Morris", "title": "Energy groups target Biden administration over unwillingness to expand domestic oil production - Fox Business", "description": "Two prominent American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer testimony before the Senate next week.", "url": "https://www.foxbusiness.com/politics/energy-groups-target-biden-administration-over-unwillingness-to-expand-domestic-oil-production", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/10/0/0/joe-biden-oil-field-1-AP-istock.jpg?ve=1&tl=1", "publishedAt": "2022-04-03T01:25:31Z", "content": "Two American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer test… [+4111 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Martin Boulton", "title": "Grammys in pre-emptive damage control ahead of this year’s awards - Sydney Morning Herald", "description": "Australian artist The Kid Laroi could steal the spotlight from American hopeful Olivia Rodrigo at the Grammy Awards.", "url": "https://www.smh.com.au/culture/music/grammys-in-pre-emptive-damage-control-ahead-of-this-year-s-awards-20220401-p5aa3m.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.9371%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/88fd4d42072b3495f81a093d10c19f849a104103", "publishedAt": "2022-04-02T18:00:00Z", "content": "A week after The Slap that overshadowed Hollywoods Oscars celebrations, the entertainment world will turn its attention toward the 64th Grammy Awards at MGM Grand Arena in Las Vegas.\r\nNominated in fi… [+2014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "New heart failure guidelines add another type of meds to treatment recommendations - CNN", "description": "The American College of Cardiology, the American Heart Association and the Heart Failure Society of America released new guidelines Friday that add a fourth class of medication to the recommended treatment plan for people who have a condition called heart fai…", "url": "https://www.cnn.com/2022/04/01/health/new-heart-failure-guidelines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220214134335-heart-disease-super-tease.jpg", "publishedAt": "2022-04-01T18:53:00Z", "content": "(CNN)The American College of Cardiology, the American Heart Association and the Heart Failure Society of America released new guidelines Friday that add a fourth class of medication to the recommende… [+4991 chars]"}, {"source": {"id": null, "name": "NASA"}, "author": null, "title": "NASA Astronaut to Discuss American Space Record in News Conference - NASA", "description": "NASA astronaut Mark Vande Hei, back on Earth after breaking the record for the longest single spaceflight in history by an American, will participate in a virtual news conference at 10 a.m. EDT Tuesday, April 5, from the agency’s Johnson Space Center in Houst…", "url": "https://www.nasa.gov/press-release/nasa-astronaut-to-discuss-american-space-record-in-news-conference/", "urlToImage": "http://www.nasa.gov/sites/default/files/thumbnails/image/iss065e335291_0.jpg", "publishedAt": "2022-04-01T16:23:29Z", "content": null}]}