{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": "Quint Forgey", "title": "HHS chief claims his vaccine comments are being taken 'wildly out of context' - POLITICO", "description": "Republicans balked after Secretary Xavier Becerra said it was \"absolutely the government's business\" to know which Americans have been vaccinated.", "url": "https://www.politico.com/news/2021/07/08/hhs-chief-federal-government-vaccinations-498789", "urlToImage": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1155968404/d13ba164-fb35-44cc-b2c9-44a48060f707/c039c8a6-7ed1-47f0-9cfc-2fcbf3c14c5a/1280x720/match/image.jpg", "publishedAt": "2021-07-08T17:01:04Z", "content": "Becerra's remarks earlier Thursday came in response to Republican criticism President Joe Biden has received this week for his administrations latest push to persuade vaccine-hesitant Americans to ge… [+3653 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Kevin Breuninger", "title": "Virtually all new Covid deaths and hospitalizations are among unvaccinated people, White House says - CNBC", "description": "President Joe Biden's Covid team has set its sights on those Americans who are still unvaccinated against the coronavirus, amid the delta variant's spread.", "url": "https://www.cnbc.com/2021/07/08/covid-vaccines-nearly-all-deaths-hospitalizations-among-unvaccinated.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106867662-1618335711164-gettyimages-1232288963-AFP_97X672.jpeg?v=1625757327", "publishedAt": "2021-07-08T15:52:47Z", "content": "As more people get vaccinated against Covid-19 in the U.S., a vast majority of hospitalizations and deaths are occurring among people who haven't yet gotten a Covid shot, White House officials said T… [+2754 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "IANS", "title": "US Covid cases rise as Delta variant dominates, President Biden calls for ramping up vaccination - India TV News", "description": "Biden set a goal in May of having 70 per cent of American adults receive at least one Covid-19 shot by the Fourth of July. But just 18 states and Washington, DC surpassed that goal by the date, according to a Forbes report.", "url": "https://www.indiatvnews.com/news/world/delta-strain-becomes-dominant-variant-us-coronavirus-pandemic-latest-news-international-updates-717644", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2021/07/us-covid-cases-1625716988.jpeg", "publishedAt": "2021-07-08T04:33:11Z", "content": "The highly transmissible Delta strain has overtaken the Alpha variant to become the dominant variant in the US, according to new estimates from the US Centers for Disease Control and Prevention (CDC)… [+1766 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Move over Messi -- Argentina has a new hero - The Star Online", "description": "BRASILIA (Reuters) -     Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout in their Copa America semi-final against Colombia.", "url": "https://www.thestar.com.my/sport/football/2021/07/07/soccer-move-over-messi----argentina-has-a-new-hero", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/07/1211772.jpg", "publishedAt": "2021-07-07T05:47:00Z", "content": "BRASILIA (Reuters) - Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout i… [+1854 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "'Toughest game I ever played' - Bonucci hails Italy heart after Azzurri 'suffer' through win over Spain - Goal.com", "description": "Newly-hired RB Leipzig manager Jesse Marsch says that Caden Clark has both the personality and the playing ability to shine in Germany as he said the American teenager has \"borderline cockiness\" that will help him adjust to the pressures of Europe.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-07-06T23:21:56Z", "content": null}]}