{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Sylvie Corbet, Jeffrey Schaeffer", "title": "D-Day veteran Charles Shay, who saved lives on Omaha Beach, dies at 101 in France - AP News", "description": "Decorated Native American veteran Charles Shay has died at age 101 in France. Shay was a 19-year-old U.S. Army medic when he landed on Omaha Beach on D-Day and helped save lives. Shay's longtime friend and carer Marie-Pascale Legrand said that Shay died at hi…", "url": "https://apnews.com/article/charles-shay-dies-d-day-native-american-aab17ffceda65c5c3050eca29d7e4168", "urlToImage": "https://dims.apnews.com/dims4/default/e3433a9/2147483647/strip/true/crop/5806x3266+0+303/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F22%2Fe0%2F2b8007a064a1dd2df430e5a402f4%2F7bf9114485fc4a49bc2abfd4171276b0", "publishedAt": "2025-12-03T17:57:00Z", "content": "PARIS (AP) Charles Shay, a decorated Native American veteran who was a 19-year-old U.S. Army medic when he landed on Omaha Beach on D-Day and helped save lives, died on Wednesday. He was 101.\r\nShay d… [+4238 chars]"}, {"source": {"id": null, "name": "Dhs.gov"}, "author": null, "title": "DHS Launches Operation Catahoula Crunch in New Orleans Targeting Criminal Illegal Aliens Released From Jail and Back into American Communities - Homeland Security (.gov)", "description": "DHS launched a federal law enforcement operation with Operation Catahoula Crunch in New Orleans, Louisiana, targeting criminal illegal aliens roaming free thanks to sanctuary policies that force local authorities to ignore ICE arrest detainers.", "url": "https://www.dhs.gov/news/2025/12/03/dhs-launches-operation-catahoula-crunch-new-orleans-targeting-criminal-illegal", "urlToImage": "https://www.dhs.gov/sites/default/files/2024-02/24_0206_opa_og-image-dhs.jpg", "publishedAt": "2025-12-03T12:25:41Z", "content": "Sanctuary jurisdictions refuse to honor ICE detainers and release criminal illegal aliens who continue committing crimes against innocent Americans\r\nWASHINGTON The Department of Homeland Security (DH… [+2959 chars]"}]}