{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Fox Business"}, "author": "Kyle Morris", "title": "Energy groups target Biden administration over unwillingness to expand domestic oil production - Fox Business", "description": "Two prominent American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer testimony before the Senate next week.", "url": "https://www.foxbusiness.com/politics/energy-groups-target-biden-administration-over-unwillingness-to-expand-domestic-oil-production", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/10/0/0/joe-biden-oil-field-1-AP-istock.jpg?ve=1&tl=1", "publishedAt": "2022-04-03T01:25:31Z", "content": "Two American energy groups are targeting the Biden administration over its dismissal of domestic oil and gas production, one with a five figure ad purchase and another whose president will offer test… [+4111 chars]"}, {"source": {"id": null, "name": "Chess.com"}, "author": "Carsten Hansen", "title": "Draw In Game 1: 2022 FIDE Grand Prix Berlin Leg 3, Final Day 1 - Chess.com", "description": "With clear victories in Friday's tiebreakers, American GMs Hikaru Nakamura and Wesley So were set to meet in the final of the third leg of the 2022 FIDE Grand Prix series. The first game of the final, with So playing the white pieces, saw the combatants play …", "url": "https://www.chess.com/news/view/2022-fide-grand-prix-berlin-leg-3-final-day-1", "urlToImage": "https://images.chesscomfiles.com/uploads/v1/news/1061345.77442ac2.5000x5000o.7cf37ad30e43.jpeg", "publishedAt": "2022-04-02T19:52:00Z", "content": "With clear victories in Friday's tiebreakers, American GMs Hikaru Nakamura and Wesley So were set to meet in the final of the third leg of the 2022 FIDE Grand Prix series.  \r\nThe first game of the fi… [+2370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tasnim Ahmed, CNN", "title": "New heart failure guidelines add another type of meds to treatment recommendations - CNN", "description": "The American College of Cardiology, the American Heart Association and the Heart Failure Society of America released new guidelines Friday that add a fourth class of medication to the recommended treatment plan for people who have a condition called heart fai…", "url": "https://www.cnn.com/2022/04/01/health/new-heart-failure-guidelines/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220214134335-heart-disease-super-tease.jpg", "publishedAt": "2022-04-01T18:53:00Z", "content": "(CNN)The American College of Cardiology, the American Heart Association and the Heart Failure Society of America released new guidelines Friday that add a fourth class of medication to the recommende… [+4991 chars]"}, {"source": {"id": null, "name": "American Medical Association"}, "author": null, "title": "How we will know when COVID-19 has become endemic - American Medical Association", "description": "Infectious diseases physician Stephen Parodi, MD, distinguishes between pandemics and endemics and points to signs that show where COVID-19 is moving.", "url": "https://www.ama-assn.org/delivering-care/public-health/how-we-will-know-when-covid-19-has-become-endemic", "urlToImage": "https://www.ama-assn.org/sites/ama-assn.org/files/styles/image_ratio_16_9/public/2022-03/2022-03-16-C19_PARODEMIC-Index_1170x780.jpg?itok=VdoLGkSr", "publishedAt": "2022-04-01T12:00:00Z", "content": "The World Health Organization declared the COVID-19 outbreak a pandemic on March 11, 2020. Now,  more than two years later, society is at a crossroads, according to AMA member Stephen Parodi, MD.\r\nTh… [+3492 chars]"}]}