{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Juneteenth: What is the newest US holiday and how is it celebrated? - BBC News", "description": "The commemoration of the last enslaved black American being freed is now an official US holiday.", "url": "https://www.bbc.co.uk/news/world-us-canada-57515192", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/0DBD/production/_118971530_gettyimages-1233510260.jpg", "publishedAt": "2021-06-17T20:15:15Z", "content": "media captionJuneteenth is a celebration of the freedom, culture and empowerment of African-Americans.\r\nThe Juneteenth National Independence Day Act, which establishes a holiday that commemorates the… [+4887 chars]"}, {"source": {"id": null, "name": "WCTV"}, "author": "MICHELLE R. SMITH", "title": "Vaccine effort turns into slog as infectious variant spreads - WCTV", "description": "As case numbers decline and states reopen, the potential final stage in the U.S. campaign to vanquish COVID-19 is turning into a slog, with a worrisome variant gaining a bigger foothold and lotteries and other prizes failing to persuade many Americans to get …", "url": "https://www.wctv.tv/2021/06/16/vaccine-effort-turns-into-slog-infectious-variant-spreads/", "urlToImage": "https://gray-wctv-prod.cdn.arcpublishing.com/resizer/iVqmIzF8BXbfpQemrrrnrEhHLJQ=/980x0/smart/cloudfront-us-east-1.images.arcpublishing.com/gray/GITDCU2BWVBLFB7E6HK6T26SJI.jpg", "publishedAt": "2021-06-16T19:57:00Z", "content": "(AP) - As cases tumble and states reopen, the potential final stage in the U.S. campaign to vanquish COVID-19 is turning into a slog, with a worrisome variant gaining a bigger foothold and lotteries … [+4943 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Reuters", "title": "Botswana unearths world’s third largest diamond - Daily Maverick", "description": "GABORONE, June 16 (Reuters) - A 1,098 carat diamond believed to be the third largest gem-quality stone ever to be mined, has been discovered in Botswana, according to a joint venture between Anglo American's De Beers and the government.", "url": "https://www.dailymaverick.co.za/article/2021-06-16-botswana-unearths-worlds-third-largest-diamond/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/BM-Ed-DiamondSales-option-2.jpg", "publishedAt": "2021-06-16T19:06:59Z", "content": "The stone was presented to President Mokgweetsi Masisi on Wednesday by Debswana Diamond Company’s acting managing director Lynette Armstrong. It is the third largest in the world, behind the 3,106 ca… [+1259 chars]"}]}