{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "WBKB-TV"}, "author": "Carter Landis", "title": "Heart Healthy Tips for Heart Month – WBKB 11 - WBKB-TV", "description": "February is Heart Month, and heart disease is the number one killer of Americans, more...", "url": "https://www.wbkb11.com/heart-healthy-tips-for-heart-month", "urlToImage": "https://www.wbkb11.com/wp-content/uploads/2023/02/kuyftgfyt.jpg", "publishedAt": "2023-02-14T23:15:56Z", "content": "February is Heart Month, and heart disease is the number one killer of Americans, more than cancer or any other disease. Heart disease is a more complicated situation, as it is nearly untreatable.\r\n“… [+1370 chars]"}, {"source": {"id": null, "name": "Www.tsn.ca"}, "author": "The Canadian Press", "title": "CWNT frustrated, disheartened by ongoing labour dispute with Canada Soccer - TSN", "description": "Captain Christine Sinclair says the ongoing labour dispute with Canada Soccer has left her and other team representatives \"exhausted and deflated\" as they prepare to face the top-ranked Americans in the opening game of the SheBelieves Cup on Thursday.", "url": "https://www.tsn.ca/soccer/canadian-women-frustrated-disheartened-by-ongoing-labour-dispute-with-canada-soccer-1.1919331", "urlToImage": "https://www.tsn.ca/content/dam/tsn/en/home/images/2022/11/10/canadian-women-look-to-extend-four-game-win-streak-in-two-match--1-1876242-1668110142888.jpeg", "publishedAt": "2023-02-14T21:48:27Z", "content": "Captain Christine Sinclair says the ongoing labour dispute with Canada Soccer has left her and other team representatives \"exhausted and deflated\" as they prepare to face the top-ranked Americans in … [+5776 chars]"}, {"source": {"id": null, "name": "Ajmc.com"}, "author": "Dalga D. Surofchy, PharmD, APh, Neil Shieh, PharmD, Iris Tam, PharmD", "title": "Evolving Considerations for Choice of Hepatitis B Vaccine - AJMC.com Managed Markets Network", "description": "The American Journal of Managed Care provides insights into the latest news and research in managed care across multimedia platforms.", "url": "https://www.ajmc.com/view/evolving-considerations-for-choice-of-hepatitis-b-vaccine", "urlToImage": "https://s3.amazonaws.com/mjhlifesciences.com/sitelogos/AJMC_1200x637.png", "publishedAt": "2023-02-14T18:16:07Z", "content": "ABSTRACT\r\nThere is currently no known cure for hepatitis B virus (HBV) infection, and HBV remains a major public health burden in the United States. The US Department of Health and Human Services has… [+47745 chars]"}, {"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "Chikungunya cases nearly double in 2022 in the Americas, 2023 sees this trend continuing - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 The Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological alert published yesterday. In 2022, a total of 271,176 cases of …", "url": "http://outbreaknewstoday.com/chikungunya-cases-nearly-double-in-2022-in-the-americas-2023-sees-this-trend-continuing-21329/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2022/08/26049_lores.jpg", "publishedAt": "2023-02-14T13:07:26Z", "content": "NewsDesk @bactiman63\r\nThe Pan American Health Organization (PAHO) reported a 98 percent increase in chikungunya cases in 2022 in the Region of the Americas in 2022, according to a epidemiological ale… [+1689 chars]"}]}