{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, Sam Fossum", "title": "Biden says objects shot down over North America last week appear to not be part of China's spy balloon operation - CNN", "description": "President Joe Biden on Thursday said that the United States has no indication that the three objects shot down in North American air space are tied to China's spy balloon program and are likely from private entities.", "url": "https://www.cnn.com/2023/02/16/politics/president-biden-downed-objects/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230216142131-04-biden-0216.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-17T01:14:00Z", "content": "President Joe Biden on Thursday said that the United States has no indication that the three objects shot down in North American air space are tied to Chinas spy balloon program and are likely from p… [+5269 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian-American Neal Mohan To Take Over YouTube As CEO Steps Down - NDTV", "description": "YouTube Chief Executive Officer Susan Wojcicki will be stepping down after nine years at the helm of the world's largest online video platform, she said in a blog post today.", "url": "https://www.ndtv.com/world-news/youtube-ceo-susan-wojcicki-steps-down-3789418", "urlToImage": "https://c.ndtvimg.com/2023-02/ftgob8cg_neal-mohan-twitter-_625x300_16_February_23.jpg", "publishedAt": "2023-02-17T00:54:00Z", "content": "Before Google, Ms Wojcicki worked at Intel Corp and Bain &amp; Company.\r\nYouTube Chief Executive Officer Susan Wojcicki will be stepping down after nine years at the helm of the world's largest onlin… [+654 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Objects shot out of North American skies likely not used for spying, Biden says - CBC.ca", "description": "U.S. President Joe Biden said on Thursday that three unidentified objects shot down by U.S. fighter jets did not appear to have been used for spying on the United States and were likely tied to benign purposes. But he plans to speaks with China's Xi Jinping a…", "url": "https://www.cbc.ca/news/world/biden-balloons-spying-objects-1.6750829", "urlToImage": "https://i.cbc.ca/1.6748606.1676581202!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/230207-n-xi307-1034.jpg", "publishedAt": "2023-02-16T23:56:42Z", "content": "U.S. President Joe Biden said on Thursday he expects to speak with China's President Xi Jinping about what the United States says was a Chinese spy balloon that a U.S. fighter jet shot down early thi… [+5761 chars]"}, {"source": {"id": null, "name": "The News International"}, "author": "Web Desk", "title": "Meghan Markle wont attend King Charles Coronation - The News International", "description": "Prince Harry and Meghan Markle have lost their American support after their vile attack on the Royal Family, a royal biographer has claimed. Angela Levin, who wrote biographies on the Duke of...", "url": "https://www.thenews.com.pk/latest/1041334-prince-harry-meghan-markle-wont-attend-king-charles-coronation", "urlToImage": "https://www.thenews.com.pk/assets/uploads/updates/2023-02-17/1041334_010057_updates.jpg", "publishedAt": "2023-02-16T19:49:28Z", "content": "Prince Harry and Meghan Markle have lost their American support after their \"vile\" attack on the Royal Family, a royal biographer has claimed. \r\nAngela Levin, who wrote biographies on the Duke of Sus… [+817 chars]"}]}