{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "U.S. fighter jets intercept two Russian bombers near Alaska - CTV News", "description": "A pair of U.S. Air Force F-16 fighter jets intercepted two long-range Russian bombers near Alaska on Monday. According to NORAD, the Russian aircraft 'did not enter American or Canadian sovereign airspace' after being intercepted.", "url": "https://www.ctvnews.ca/world/u-s-fighter-jets-intercept-two-russian-bombers-near-alaska-1.6114589", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/10/18/russian-tu-95-strategic-bombers-1-6114591-1666125416172.jpg", "publishedAt": "2022-10-18T21:10:49Z", "content": "A pair of U.S. Air Force fighter jets intercepted two long-range Russian bombers near Alaska on Monday.\r\nAccording to an Oct. 18 press release from NORAD, the joint Canada-U.S. defence group, the Ame… [+3093 chars]"}, {"source": {"id": null, "name": "Kemifilani.ng"}, "author": "Gift Adene", "title": "\"Beyoncé could have breast cancer\" Nigerians cry out as Mathew Knowles is diagnosed of \"BRCA2 mutated breast cancer\" - Kemi Filani News", "description": "Beyonce's father, Mathew Knowles has undergone a breast cancer surgery. Mathew Knowles is an American record executive, entrepreneur, and university", "url": "https://www.kemifilani.ng/entertainment/beyonce-could-have-breast-cancer-nigerians-cry-out-as-mathew-knowles-is-diagnosed-of-brca2-mutated-breast-cancer", "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2022/10/beyonce-nigerians-cry-1300x843.png", "publishedAt": "2022-10-18T19:10:32Z", "content": "Beyonce’s father, Mathew Knowles has undergone a breast cancer surgery.\r\nMathew Knowles is an American record executive, entrepreneur, and university instructor. His role as Destiny’s Child’s manager… [+3257 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's New Science Research To Space Station Could Make Human Life Easier - NDTV", "description": "American space agency NASA is planning to launch the next resupply services mission to the International Space Station (ISS) next month.", "url": "https://www.ndtv.com/world-news/nasas-new-science-research-to-space-station-could-make-human-life-easier-3443771", "urlToImage": "https://c.ndtvimg.com/2022-07/ng9r0t5o_international-space-station-reuters_625x300_28_July_22.jpg", "publishedAt": "2022-10-18T18:44:59Z", "content": "Cygnus spacecraft is scheduled for liftoff on November 6. (File)\r\nAmerican space agency NASA is planning to launch the next resupply services mission to the International Space Station (ISS) next mon… [+3279 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Lawmakers Sound Alarm After Chinese Firm Buys American Farmland Near Air Force Base - NDTV", "description": "The purchase of farmland in North Dakota by a Chinese company is raising concerns among American politicians regarding national security.", "url": "https://www.ndtv.com/world-news/us-lawmakers-sound-alarm-after-chinese-firm-buys-american-farmland-near-air-force-base-3443693", "urlToImage": "https://c.ndtvimg.com/2019-10/cp42tq6_us-air-force-f15e-facebook_625x300_17_October_19.jpg", "publishedAt": "2022-10-18T18:00:44Z", "content": "Lawmakers and experts voice concerns over the possibility of espionage or sabotage.\r\nThe purchase of American farmland by a Chinese agricultural company, Fufeng Group, close to a US Air Force base ha… [+1692 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Buzz Staff", "title": "NASA Just Detected the Most Powerful Gamma-ray Bursts Close to Earth - News18", "description": "Gamma-ray-bursts (GRB) were unintentionally found by American military satellites in the 1960s. Their creation most likely took place when a massive star exploded towards the end of their lives and turned into a black hole.", "url": "https://www.news18.com/news/buzz/nasa-just-detected-the-most-powerful-gamma-ray-bursts-close-to-earth-6188815.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/10/gamma-rays-166607875216x9.png", "publishedAt": "2022-10-18T07:48:14Z", "content": "The National Aeronautics and Space Administration or NASA reported that an unusual, luminous and prolonged radiation pulse passed across the Earth on October 9. The radiation blast was caused by a ga… [+2270 chars]"}]}