{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "More transmissible and deadly Delta variant surges in UK, threatens Europe and America - WSWS", "description": "Public Health England analysis shows that the Delta variant is twice as likely to hospitalise people as the Alpha variant.", "url": "https://www.wsws.org/en/articles/2021/06/12/coeu-j01.html", "urlToImage": "https://www.wsws.org/asset/a4e69263-20e4-40e7-8661-fb4e52b5fd59?rendition=image1280", "publishedAt": "2021-06-12T00:01:14Z", "content": "The Delta variant of COVID-19 is exploding in the UK, in a surge which will soon overtake the rest of Europe.\r\nFigures released yesterday by Public Health England (PHE) have torn apart the government… [+7960 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Anne Gearan, Ashley Parker", "title": "G-7 leaders try to signal that page has turned on Trump era - Washington Post", "description": "Rich democracies meeting in Britain sought to send a message Friday that they were back in business after a surge in vaccinations and the exit of a disruptive American president.", "url": "https://www.washingtonpost.com/politics/biden-g7-leaders-england/2021/06/11/adb19d62-cac0-11eb-a11b-6c6191ccd599_story.html", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/42LNP2GK5MI6XANRGR4WY44TV4.jpg&w=1440", "publishedAt": "2021-06-11T20:37:00Z", "content": "It was less clear whether the worlds wealthy democracies can return to normal in more substantive ways with the sort of cooperation that was once routine but unraveled in the Trump era given that pop… [+9626 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Gloria Oladipo", "title": "CDC to discuss rare potential heart inflammation linked to mRNA vaccines - The Guardian", "description": "226 cases of myocarditis or pericarditis reported as authorities continue to recommend vaccines for all eligible Americans", "url": "https://amp.theguardian.com/us-news/2021/jun/11/cdc-covid-vaccines-mrna-heart-inflammation-reports", "urlToImage": null, "publishedAt": "2021-06-11T16:51:00Z", "content": "US news226 cases of myocarditis or pericarditis reported as authorities continue to recommend vaccines for all eligible Americans\r\nFri 11 Jun 2021 17.11 BST\r\nAn advisory committee with the Centers fo… [+2717 chars]"}, {"source": {"id": null, "name": "Mb.com.ph"}, "author": null, "title": "AGT golden buzzer’s Nightbirde, on toxic relationships and letting go - Manila Bulletin", "description": "\"Cancer isn't killing you, you're killing yourself.\"\n\n\n\nAfter watching Nightbirde's (real name Jane Marczewski) beautiful performance on America's Got Talent, and finding out that she went to the auditions alone, many wondered where her family was at that tim…", "url": "https://mb.com.ph/2021/06/11/agt-golden-buzzers-nightbirde-on-toxic-relationships-and-letting-go/", "urlToImage": "https://mb.com.ph/wp-content/uploads/2021/06/Nightbirde-cover-photo-facebook-scaled.jpg", "publishedAt": "2021-06-11T15:39:12Z", "content": "“Cancer isn’t killing you, you’re killing yourself.”\r\nAfter watching Nightbirde’s (real name Jane Marczewski) beautiful performance on America’s Got Talent, and finding out that she went to the audit… [+3980 chars]"}]}