{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, MJ Lee, Betsy Klein, Phil Mattingly", "title": "Biden sends a stark warning about political violence ahead of midterms: 'We can't take democracy for granted any longer' - CNN", "description": "President Joe Biden on Wednesday delivered a stark warning to Americans that the future of the nation's democracy could rest on next week's midterm elections, an urgent appeal coming six days before final ballots are cast in a contest the president framed in …", "url": "https://www.cnn.com/2022/11/02/politics/biden-speech-democracy-dc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221102191326-joe-biden-union-station-110222.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-11-03T09:38:00Z", "content": "President Joe Biden on Wednesday delivered a stark warning to Americans that the future of the nations democracy could rest on next weeks midterm elections, an urgent appeal coming six days before fi… [+5386 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "'Unpredecented, unlawful, un-American': Biden warns democracy at risk as midterms loom - Sky News", "description": "", "url": "https://news.sky.com/story/democracy-under-threat-because-donald-trump-refuses-to-accept-result-of-2020-election-joe-biden-warns-12736905", "urlToImage": "https://e3.365dm.com/22/11/1600x900/skynews-joe-biden-donald-trump_5952654.jpg?20221103031543", "publishedAt": "2022-11-03T03:33:45Z", "content": "Analysis: Biden's intervention is high risk - and controversial\r\nThis was no normal pre-election speech, and be in no doubt, an intervention like this is extremely controversial. \r\nBy saying that onl… [+2103 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Biden implores Americans to save democracy from 'chaos' of election-denying lies and violence - CBC News", "description": "After weeks of reassuring talk about America's economy and inflation, U.S. President Joe Biden turned Wednesday night to a darker, more urgent message, warning ahead of the midterm elections that democracy itself is under threat from former president Donald T…", "url": "https://www.cbc.ca/news/world/biden-midterms-speech-democracy-1.6638779", "urlToImage": "https://i.cbc.ca/1.6638797.1667432494!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/usa-biden-democracy.JPG", "publishedAt": "2022-11-03T01:10:00Z", "content": "Warning that democracy itself is in peril, U.S. President Joe Biden called on Americans Wednesday night to use their ballots in next week's midterm elections to stand up against lies, violence and da… [+6004 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published online ah - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; lithologic controls on microfracturing from legacy underground nuclear explosions;…", "url": "https://www.eurekalert.org/news-releases/969932", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-11-02T06:31:59Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; l… [+26899 chars]"}]}