{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Bill Birtles", "title": "Guam, America's forgotten speck of an island in the Pacific, is the new front line against China - ABC News", "description": "As China flexes its air strength at Taiwan and builds navy capacity at unprecedented speed, the United States is bolstering defences on its most important military outpost in the western Pacific: the tropical island of Guam.", "url": "https://www.abc.net.au/news/2022-09-18/guam-is-the-new-front-line-against-china/101407620", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/abe92d7f006a3c66b52de9269c9a9d0a?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=347&width=862&height=485", "publishedAt": "2022-09-17T18:49:47Z", "content": "On a postcard-perfect tropical island in the western Pacific, the United States is bolstering defences at one of its most important military outposts as concern grows over rising tensions between Chi… [+10331 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Gabriel Pogrund", "title": "No 10 chief of staff in FBI inquiry over 'election bribe' in Puerto Rico - The Times", "description": "Liz Truss’s most senior adviser has been interviewed by FBI agents about an alleged criminal plot to bribe an American politician and influence a US election. M", "url": "https://www.thetimes.co.uk/article/no-10-chief-of-staff-in-fbi-inquiry-over-election-bribe-in-puerto-rico-rrlrtzkjk", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Fsundaytimes%2Fprod%2Fweb%2Fbin%2Fc8cd3904-3675-11ed-9709-e13153ef454b.jpg?crop=3397%2C1911%2C52%2C46&resize=1200", "publishedAt": "2022-09-17T17:00:00Z", "content": "Liz Trusss most senior adviser has been interviewed by FBI agents about an alleged criminal plot to bribe an American politician and influence a US election. Mark Fullbrook is the Downing Street chie… [+583 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "Kinling Lo", "title": "'Striking' that Putin admits Xi's concerns about Russia's war in Ukraine: US State Department - The Star Online", "description": "Russian President Vladimir Putin’s acknowledgement of Chinese counterpart Xi Jinping’s “concerns” about the war in Ukraine was “striking”, the US State Department said, reiterating American concerns about the two countries’ deepening relationship.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/09/17/striking-that-putin-admits-xis-concerns-about-russias-war-in-ukraine-us-state-department", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/09/17/1741091.jpg", "publishedAt": "2022-09-17T05:20:00Z", "content": "Russian President Vladimir Putins acknowledgement of Chinese counterpart Xi Jinpings concerns about the war in Ukraine was striking, the US State Department said, reiterating American concerns about … [+4099 chars]"}]}