{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "David Goldman", "title": "Harvard faculty appeal to the university’s board to address its growing number of crises - CNN", "description": "Some key members of Harvard’s faculty and the university’s top governing body held an extraordinary meeting last week to address the unprecedented problems at one of America’s most prestigious institutions of higher learning.", "url": "https://www.cnn.com/2023/12/25/business/harvard-faculty-corporation-scandals/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1854702834.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-12-25T21:01:13Z", "content": "Some key members of Harvards faculty and the universitys top governing body held an extraordinary meeting last week to address the unprecedented problems at one of Americas most prestigious instituti… [+5810 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "ANGELA CHARLTON, CHRISTOPHE ENA", "title": "Indian travelers held in French airport over human trafficking investigation - The Associated Press", "description": "Authorities in France say about 300 Indian citizens heading to Central America are sequestered in a French airport for a third day because of an investigation into suspected human trafficking. Prosecutors say two people were detained and others are still bein…", "url": "https://apnews.com/article/france-indians-human-trafficking-plane-grounded-9cb85e74512bed93e87b22b2be9062e5", "urlToImage": "https://dims.apnews.com/dims4/default/f345019/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdf%2Fb9%2F094bdce17952eb9bc7467a4fcc63%2F10df2f4f381a44029d7d9964b1252245", "publishedAt": "2023-12-23T18:08:00Z", "content": "VATRY, France (AP) About 300 Indian citizens heading to Central America were sequestered in a French airport for a third day Saturday after a dramatic police operation prompted by a tip that those ab… [+5716 chars]"}]}