{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Ken Belson", "title": "The Washington Football Team Has Rebranded as the Commanders - The New York Times", "description": "After a two-year search, the team announced a new name and mascot to replace the generic moniker it adopted to replace the longtime name, which was considered a racial slur of Native Americans.", "url": "https://www.nytimes.com/2022/02/02/sports/washington-football-team-commanders.html", "urlToImage": "https://static01.nyt.com/images/2022/02/02/multimedia/02washington-name/02washington-name-facebookJumbo.jpg", "publishedAt": "2022-02-02T14:08:48Z", "content": "Color is a powerful measure of loyalty and indicator of a brand, OHara said. The teams colors are unique, and its who they are, he said.\r\nHe said the name Commanders dovetails with the significant mi… [+1665 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Existence of Earth Trojan Asteroid Confirmed – Could Become “Ideal Bases” for Advanced Exploration of the Solar System - SciTechDaily", "description": "Data from NSF’s NOIRLab Show Earth Trojan Asteroid Is the Largest Found The SOAR Telescope, part of NOIRLab’s Cerro Tololo Inter-American Observatory, has helped astronomers refine the size and orbit of the largest known Earth Trojan companion. By scanning th…", "url": "https://scitechdaily.com/existence-of-earth-trojan-asteroid-confirmed-could-become-ideal-bases-for-advanced-exploration-of-the-solar-system/", "urlToImage": "https://scitechdaily.com/images/Trojan-Asteroid-2020-XL5-scaled.jpg", "publishedAt": "2022-02-02T09:45:14Z", "content": "Using the 4.1-meter SOAR (Southern Astrophysical Research) Telescope on Cerro Pachón in Chile, astronomers have confirmed that an asteroid discovered in 2020 by the Pan-STARRS1 survey, called 2020 XL… [+10341 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "AGENCY", "title": "Host Whoopi Goldberg suspended by American TV network for Holocaust comments - The Star Online", "description": "Despite an apology from the host of 'The View' talk show, ABC News President Kim Godwin said she had decided it was not enough.", "url": "https://www.thestar.com.my/lifestyle/entertainment/2022/02/02/actress-host-whoopi-goldberg-suspended-by-american-tv-network-for-holocaust-comments", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/02/02/1466312.jpg", "publishedAt": "2022-02-02T09:00:00Z", "content": "US actress Whoopi Goldberg on Tuesday (Feb 1) was suspended from the American talk show she hosts for two weeks after saying that the Nazi genocide of six million Jews \"was not about race\".\r\nDespite … [+1779 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Lauran Neergaard And Matthew Perrone", "title": "Pfizer asks FDA to allow COVID-19 vaccine for kids under 5 - CP24 Toronto's Breaking News", "description": "Pfizer on Tuesday asked the U.S. to authorize extra-low doses of its COVID-19 vaccine for children under 5, potentially opening the way for the very youngest Americans to start receiving shots as early as March.", "url": "https://www.cp24.com/world/pfizer-asks-fda-to-allow-covid-19-vaccine-for-kids-under-5-1.5762596", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5635018.1634941957!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-01T21:48:31Z", "content": "WASHINGTON (AP) - Pfizer on Tuesday asked the U.S. to authorize extra-low doses of its COVID-19 vaccine for children under 5, potentially opening the way for the very youngest Americans to start rece… [+3540 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Perri Blumberg", "title": "These are the best foods for your heart, experts say - Fox News", "description": "For American Heart Month, Fox News Digital is highlighting some foods that are especially good for your heart.", "url": "https://www.foxnews.com/food-drink/best-foods-heart-health-experts", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/09/51fcf42b-iStock-salmon.jpg", "publishedAt": "2022-02-01T14:37:31Z", "content": "February is American Heart Month. Of course, Its a good idea to eat a nutrient-dense diet year-round, but this month, Fox News Digital is highlighting some foods that are especially a boon for your c… [+8673 chars]"}]}