{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "US sends arms; White House lit up in Israeli colors; Biden: Not some distant tragedy - The Times of Israel", "description": "US death toll rises to 11 in Hamas attacks; this is 'personal for so many American families,' president says, references 9/11 and 'millennia of persecution' of Jews", "url": "https://www.timesofisrael.com/us-begins-delivering-munitions-to-israel-white-house-lit-in-blue-and-white-colors/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2023/10/AP23283033380799-1024x640.jpg", "publishedAt": "2023-10-10T07:18:45Z", "content": "WASHINGTON (AP) The US has already begun delivering critically needed munitions and military equipment to Israel, the White House said Monday, as the Pentagon reviews its inventories to see what else… [+10073 chars]"}, {"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "WGA members overwhelmingly ratify new deal with Hollywood studios, officially ending strike - KABC-TV", "description": "Members of the Writers Guild of America overwhelmingly ratified a new labor contract with Hollywood studios, closing the book on a strike that helped bring film and TV production to a halt.", "url": "https://abc7.com/wga-vote-contract-writers-strike/13883927/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13884422_100923-kabc-4pm-wga-strike-vid.jpg?w=1600", "publishedAt": "2023-10-10T00:00:00Z", "content": "LOS ANGELES (KABC) -- Members of the Writers Guild of America overwhelmingly ratified a new labor contract with Hollywood studios, the union announced Monday, closing the book on a strike that helped… [+1408 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Americans are trying to help family escape Israel following Gaza \"complete siege\" order - CBS News", "description": "Israel says it has claimed complete control of the southern part of the country and has imposed a total blockade of Gaza. CBS News reporter Haley Ott reports...", "url": "https://www.youtube.com/watch?v=7l7g-vp35mc", "urlToImage": "https://i.ytimg.com/vi/7l7g-vp35mc/maxresdefault.jpg", "publishedAt": "2023-10-09T18:13:33Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tracing Footprints: Humans Got to America 7,000 Years Earlier Than Thought - SciTechDaily", "description": "New research, supported by advanced dating techniques, suggests that humans settled in the Americas around 23,000 years ago, challenging earlier beliefs of a 14,000-year timeline. When and how humans first settled in the Americas is a subject of considerable …", "url": "https://scitechdaily.com/tracing-footprints-humans-got-to-america-7000-years-earlier-than-thought/", "urlToImage": "https://scitechdaily.com/images/White-Sands-National-Park-Fossilized-Footprints.jpg", "publishedAt": "2023-10-09T10:33:03Z", "content": "The footprints come from a group of people of different ages. Credit: National Park Service\r\nNew research, supported by advanced dating techniques, suggests that humans settled in the Americas around… [+6325 chars]"}]}