{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Friends reveal how early they predicted Ketanji Brown Jackson would serve on the Supreme Court - CBS Mornings", "description": "When Judge Ketanji Brown Jackson faces confirmation hearings to serve as the first African-American woman on the U.S. Supreme Court, she will have the suppor...", "url": "https://www.youtube.com/watch?v=C0oHxp8H6Ho", "urlToImage": "https://i.ytimg.com/vi/C0oHxp8H6Ho/maxresdefault.jpg", "publishedAt": "2022-03-18T13:31:27Z", "content": null}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Xi expected to urge Biden to promote Ukraine peace talks; warn against hurting Chinese interests: State media - The Star Online", "description": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is likely to have a warning or two for the American leader too.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/03/18/xi-expected-to-urge-biden-to-promote-ukraine-peace-talks-warn-against-hurting-chinese-interests-state-media", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/18/1519838.jpg", "publishedAt": "2022-03-18T12:35:00Z", "content": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is li… [+3289 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Gina Kolata", "title": "Shrugs Over Flu Signal Future Attitudes About Covid - The New York Times", "description": "The coronavirus pandemic hasn’t prompted most Americans to take influenza more seriously. Instead, more people are likely to think of Covid the way they think of flu, experts say.", "url": "https://www.nytimes.com/2022/03/18/health/flu-covid.html", "urlToImage": "https://static01.nyt.com/images/2022/03/17/science/00sci-flu1/00sci-flu1-facebookJumbo.jpg", "publishedAt": "2022-03-18T09:02:57Z", "content": "In years like this one, when the flu vaccine was at best minimally effective, many are skeptical about getting the shots, which are widely available. Dr. Monto said there are efforts underway to prod… [+1722 chars]"}, {"source": {"id": null, "name": "BellaNaija"}, "author": "BellaNaija.com", "title": "New Music: Oxlade – Want You - BellaNaija", "description": "Oxlade has returned with a new single titled “Want You” after an international deal with American label Epic Records, a subsidiary of Sony Music Entertainment. TMXO produced the song. Listen to the track below: Stream and download “Want You” here.", "url": "https://www.bellanaija.com/2022/03/new-music-oxlade-want-you/", "urlToImage": "https://www.bellanaija.com/wp-content/uploads/2022/03/Oxlade-scaled-1-720x600.jpeg", "publishedAt": "2022-03-18T08:29:18Z", "content": "Oxlade has returned with a new single titled “Want You” after an international deal with American label Epic Records, a subsidiary of Sony Music Entertainment.\r\nTMXO produced the song.\r\nListen to the… [+50 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "NASA's big, new moon rocket begins rollout en route to launch pad tests - RNZ", "description": "America's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant for a final round of tests.<b></b>", "url": "https://www.rnz.co.nz/news/world/463568/nasa-s-big-new-moon-rocket-begins-rollout-en-route-to-launch-pad-tests", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/140242/eight_col_000_326E24H.jpg?1647567662", "publishedAt": "2022-03-18T02:46:53Z", "content": "NASA's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant en route to the launch pad in Florida on Thursday for a final round of tests in the coming… [+4732 chars]"}]}