{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "NASA sees our space future as both government and privately run - The Register", "description": "Top official spells out simply why America is going back to the Moon", "url": "https://www.theregister.com/2022/09/04/nasa_spacex/", "urlToImage": "https://regmedia.co.uk/2022/08/26/nasa.jpg", "publishedAt": "2022-09-04T11:06:00Z", "content": "Interview \"There is no SpaceX without NASA,\" Thomas Zurbuchen, an associate administrator at the US space agency's Science Mission Directorate, told The Register this week as a Falcon 9 lurked in the… [+3649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Lobosco, Tami Luhby", "title": "'I am more than grateful:' Millions of Americans over 50 may benefit from Biden's student loan forgiveness plan - CNN", "description": "There are nearly 9 million federal student loan borrowers who are over the age of 50. They account for nearly 20% of the roughly 43 million federal student loan borrowers.", "url": "https://www.cnn.com/2022/09/04/politics/older-borrowers-biden-student-loan-debt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220902145132-01-older-borrowers-student-loan-debt.jpg?q=w_800,c_fill", "publishedAt": "2022-09-04T10:06:00Z", "content": "If it werent for her student loan debt, Lark Abelson would already be retired.\r\nThe 63-year-old took out $5,000 in loans more than 20 years ago to get an associate degree in computer technology from … [+6756 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Donald Trump calls Joe Biden 'an enemy of the state' after president's condemnation of MAGA extremism - ABC News", "description": "The former president slams Joe Biden for the FBI raid on his Mar-a-Lago residence and describes his successor's comments last week as the \"most vicious, hateful and divisive speech ever delivered by an American president\".", "url": "https://www.abc.net.au/news/2022-09-04/trump-calls-biden-enemy-of-the-state/101404672", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/db75f2a5528993fc271d997ef6ab5b3d?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=103&width=862&height=485", "publishedAt": "2022-09-04T09:28:36Z", "content": "Donald Trump has branded Joe Biden an \"enemy of the state\" as he hit back at the US president's assertion that the former leader and his supporters are undermining American democracy.\r\nKey points:\r\n<… [+5846 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Daniel Politi", "title": "Chile votes on proposed constitution with big changes - The Associated Press", "description": "SANTIAGO, Chile (AP) — Chileans are voting in a plebiscite Sunday on whether to adopt a far-reaching new constitution that would fundamentally change the South American country. The proposed charter is intended to replace a constitution imposed by a military …", "url": "https://apnews.com/article/caribbean-south-america-chile-constitutions-ffd6779b3f7f0c62579e6b0ec86affa6", "urlToImage": "https://storage.googleapis.com/afs-prod/media/147748c2d1c54bcd88382b5745979fe9/3000.jpeg", "publishedAt": "2022-09-04T05:08:48Z", "content": "SANTIAGO, Chile (AP) Chileans are voting in a plebiscite Sunday on whether to adopt a far-reaching new constitution that would fundamentally change the South American country.\r\nThe proposed charter i… [+4615 chars]"}, {"source": {"id": null, "name": "The Durango Herald"}, "author": "Jim Mimiaga", "title": "Durango and Fort Lewis College museums repatriate remains, burial objects to Hopi Tribe - The Durango Herald", "description": "The Fort Lewis College Center of Southwest Studies and the La Plata County Historical Society have conducted repatriation projects to return Native American funerary objects and human remains to the H...", "url": "https://www.durangoherald.com/articles/durango-and-fort-lewis-college-museums-repatriate-remains-burial-objects-to-hopi-tribe/", "urlToImage": "https://imengine.public.prod.dur.navigacloud.com/?uuid=5DDDDBAB-3CE2-4AA3-AC8C-401451B9F404&function=fit&type=preview", "publishedAt": "2022-09-02T23:43:46Z", "content": "Native American remains and funerary objects were removed from sites in Durango and Dove Creek in 1930s\r\nThe Fort Lewis College Center of Southwest Studies and the La Plata County Historical Society … [+10119 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "IGP joins World-UN police chiefs at US summit - Punch Newspapers", "description": "The Inspector-General of Police, Usman Baba, has joined his counterparts across the globe at the third United Nations Chiefs of Police Summit in the United States of America. The event, which is the third of its kind, is a global platform that brings together…", "url": "https://punchng.com/igp-joins-world-un-police-chiefs-at-us-summit/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/08/06211450/IGP-Baba-Usman.jpg", "publishedAt": "2022-09-02T15:59:01Z", "content": "The Inspector-General of Police, Usman Baba, has joined his counterparts across the globe at the third United Nations Chiefs of Police Summit in the United States of America. The event, which is the … [+1939 chars]"}]}