{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Researchers develop simple blood test to quickly diagnose sarcoidosis - ETHealthWorld", "description": "The technique, which uses a simple blood test, may allow for the selective use of more intrusive diagnostic tests that are commonly employed to identify the disease. The results were reported in the American Journal of Respiratory and Critical Care Medicine.", "url": "https://health.economictimes.indiatimes.com/news/industry/researchers-develop-simple-blood-test-to-quickly-diagnose-sarcoidosis/108101792", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-108101792,imgsize-55658,width-1200,height=765,overlay-ethealth/industry/researchers-develop-simple-blood-test-to-quickly-diagnose-sarcoidosis.jpg", "publishedAt": "2024-02-29T08:49:35Z", "content": "Los Angeles: A study has created a tool for rapidly and inexpensively diagnosing sarcoidosis, a chronic inflammatory disease characterised by the formation of tiny lumps known as granulomas in the lu… [+2543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson, Priscilla Alvarez, MJ Lee", "title": "Biden and Trump’s dueling border visits will encapsulate a building election clash - CNN", "description": "Two presidents will visit the southern US border Thursday, highlighting the centrality of migrant surges to November’s election in a spectacle that will explain why America’s polarized politics has for decades failed to fix a broken immigration system.", "url": "https://www.cnn.com/2024/02/29/politics/border-visits-biden-trump/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1922777390.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-02-29T06:07:00Z", "content": "Two presidents will visit the southern US border Thursday, highlighting the centrality of migrant surges to Novembers election in a spectacle that will explain why Americas polarized politics has for… [+10445 chars]"}]}