{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Apple might finally bring always-on display feature on upcoming iPhone 14 Pro, Pro Max smartphones - Deccan Herald", "description": "American tech giant Apple’s upcoming iPhone 14 Pro and Pro Max smartphone might finally get the always-on display feature.  According to The Verge, a report states that Apple could introduce the feature with iOS 16, allowing the iPhone to display a limited am…", "url": "https://www.deccanherald.com/video/business/technology/apple-might-finally-bring-always-on-display-feature-on-upcoming-iphone-14-pro-pro-max-smartphones-1113983.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/article_images/2022/05/31/may31v8-1113983-1653977953.jpg", "publishedAt": "2022-05-31T06:19:13Z", "content": "American tech giant Apples upcoming iPhone 14 Pro and Pro Max smartphone might finally get the always-on display feature. \r\nAccording to The Verge, a report states that Apple could introduce the feat… [+1204 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "Jane Patterson", "title": "Jacinda Ardern prepares to meet US President amid logistical challenges - RNZ", "description": "The prime minister is preparing to meet the American President Joe Biden at the White House in less than 24 hours, although no big announcements are expected.", "url": "https://www.rnz.co.nz/news/political/468203/jacinda-ardern-prepares-to-meet-us-president-amid-logistical-challenges", "urlToImage": "https://rnz-ressh.cloudinary.com/image/upload/s--nDSPFgU_--/c_scale,f_auto,q_auto,w_1050/4LR3YEI_000_32B89LZ_jpg", "publishedAt": "2022-05-30T22:56:52Z", "content": "The prime minister is preparing to meet the American President Joe Biden at the White House in less than 24 hours, but don't expect any flashy announcements.\r\nJacinda Ardern has talked to the US Pres… [+4368 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Spectacular New Tau Herculids Meteor Shower May Light Up the Skies Over North America - SciTechDaily", "description": "Astronomers are excited about the possibility of a new meteor shower on May 30-31, the tau Herculid shower, forecast to peak on the night of May 30 and early morning of May 31. Back in 1930, German observers Arnold Schwassmann and Arno Arthur Wachmann discove…", "url": "https://scitechdaily.com/spectacular-new-tau-herculids-meteor-shower-may-light-up-the-skies-over-north-america/", "urlToImage": "https://scitechdaily.com/images/Broken-Comet-73P-Schwassman-Wachmann-3.jpg", "publishedAt": "2022-05-30T04:36:11Z", "content": "This infrared image from NASAs Spitzer Space Telescope shows the broken Comet 73P/Schwassman-Wachmann 3 skimming along a trail of debris left during its multiple trips around the sun. The flame-like … [+2568 chars]"}]}