{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Anders Hagstrom", "title": "More Americans are opposed to Joe Biden running for president in 2024 than Trump, poll finds - Fox News", "description": "Americans are opposed to both President Joe Biden and former President Donald Trump running for re-election in 2024, but more say they are opposed to a Biden candidacy.", "url": "https://www.foxnews.com/politics/more-americans-opposed-joe-biden-running-president-than-trump-poll-finds", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/09/thumb-trump-biden.jpg", "publishedAt": "2022-07-12T12:17:19Z", "content": "More Americans say they are opposed to President Joe Biden running again in 2024 than are opposed to former President Donald Trump doing the same, according to a Tuesday poll from Politico and Mornin… [+1671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Livia Borghese and Sana Noor Haq, CNN", "title": "US tourist survives fall into Mount Vesuvius after reaching for phone - CNN", "description": "An American tourist fell into the crater of Mount Vesuvius in an attempt to retrieve his mobile phone at the weekend, Italian police told CNN on Monday.", "url": "https://www.cnn.com/travel/article/mount-vesuvius-tourist-fall-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220712100720-mount-vesuvius-super-tease.jpg", "publishedAt": "2022-07-12T11:15:52Z", "content": "(CNN) An American tourist fell into the crater of Mount Vesuvius in an attempt to retrieve his mobile phone at the weekend, Italian police told CNN on Monday.\r\nThe 23-year-old man from Baltimore was … [+1486 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Adaptation of diabetes prevention program for Chinese Americans – a qualitative study - BMC Public Health - BMC Public Health", "description": "Background Studies have demonstrated that a culturally and linguistically tailored Diabetes Prevention Program (DPP) can be effective in reducing diabetes risk in Chinese Americans. The purpose of this study was to explore the cultural and linguistic acceptab…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-13733-5", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-07-11T07:00:00Z", "content": null}]}