{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Jess Bravin", "title": "Supreme Court Rules Biden Can End Trump-Era 'Remain in Mexico' Policy - The Wall Street Journal", "description": "The high court ruled the Biden administration could cancel the program, which required authorities either to jail asylum applicants from Central America or deny them U.S. entry until their cases are resolved.", "url": "https://www.wsj.com/articles/supreme-court-rules-biden-can-end-remain-in-mexico-policy-11656598778", "urlToImage": "https://images.wsj.net/im-557650/social", "publishedAt": "2022-06-30T17:40:00Z", "content": "WASHINGTONThe Supreme Court ruled 5-4 that the Biden administration could cancel the Trump-era Remain in Mexico program, which required authorities either to jail asylum applicants from Central Ameri… [+299 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "AGENCY", "title": "Amber Heard is supposedly the 3rd most beautiful woman in the world - The Star Online", "description": "The American actress apparently has one of the most beautiful faces in the world, but it is Hadid who supposedly comes closest to perfection.", "url": "https://www.thestar.com.my/lifestyle/entertainment/2022/06/30/amber-heard-is-supposedly-the-3rd-most-beautiful-woman-in-the-world-behind-bella-hadid-and-beyonce", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/06/30/1642570.jpg", "publishedAt": "2022-06-30T12:10:00Z", "content": "Stop everything! If you thought beauty was subjective, then you're wrong! According to certain (some might say outdated) scientific standards dating back to Antiquity, it's possible to calculate the … [+3352 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "American Heart Association: Sleep Duration Is Essential Component for Heart and Brain Health - SciTechDaily", "description": "American Heart Association adds sleep to cardiovascular health checklist. The American Heart Association has updated its checklist to measure cardiovascular health. It is now called Life’s Essential 8™ and adds healthy sleep as essential for optimal cardiovas…", "url": "https://scitechdaily.com/american-heart-association-sleep-duration-is-essential-component-for-heart-and-brain-health/", "urlToImage": "https://scitechdaily.com/images/Happy-Sleep-Concept.jpg", "publishedAt": "2022-06-30T03:03:39Z", "content": "ByAmerican Heart AssociationJune 29, 2022\r\nAmerican Heart Association has added healthy sleep as essential for optimal cardiovascular health.\r\nAmerican Heart Association adds sleep to cardiovascular … [+14536 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "John Ely Senior", "title": "Getting enough sleep is now officially a marker of good heart health - Daily Mail", "description": "The American Heart Association has added a good night's sleep to its list of 'essential' tips to keep hearts healthy, with experts saying adults should aim for a solid 7-to-9 hours a night.", "url": "https://www.dailymail.co.uk/health/article-10965969/Getting-sleep-officially-marker-good-heart-health.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/06/29/18/59679613-0-image-a-18_1656522732614.jpg", "publishedAt": "2022-06-29T17:33:28Z", "content": "It's long been said that getting a good night's sleep will help you live longer and now it's officially been signed off as a key marker of good health.\r\nA leading panel of cardiologists have added sl… [+4021 chars]"}]}