{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Gaps in space law are fueling a Wild West attitude - Arab News", "description": "The late President John Kennedy challenged America to lead in space. He said: “We choose to go to the moon in this decade and do the other things, not because they are easy, but because they are hard.” Space is hard. Last week, we learned how hard it can be w…", "url": "https://www.arabnews.com/node/2441041", "urlToImage": "https://www.arabnews.com/sites/default/files/authors/3791251-dramalmudallali.png", "publishedAt": "2024-01-13T18:21:38Z", "content": "https://arab.news/zuyfu\r\nThe late President John Kennedy challenged America to lead in space. He said: We choose to go to the moon in this decade and do the other things, not because they are easy, b… [+10135 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Chris Lau, <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, Hafsa Khalil and <a href=\"/profiles/tori-powell\">Tori B. Powell</a>, CNN", "title": "Live updates: US strikes on Houthis, Israel-Hamas war, Gaza crisis - CNN", "description": "American warship USS Carney fired Tomahawk missiles in a strike on a Houthi radar site in Yemen early Saturday local time, US Central Command says. Follow for live updates.", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-01-13-24/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/240112144659-01-isr-palestinian-conflict-psychology-super-tease.jpg", "publishedAt": "2024-01-13T16:24:00Z", "content": "The US has carried out further strikes against Houthi targets in Yemen, but who are the group?\r\nThe Houthi movement, also known as Ansarallah (Supporters of God), emerged in the 1990s, when its leade… [+1801 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "JOSH BOAK", "title": "Slowing inflation suggests that Biden's policies are helping, but American voters are still hurting - Yahoo Finance", "description": "President Joe Biden can make an increasingly strong case that he's helped fix inflation — if only he can get voters to believe him.  Figures issued this past...", "url": "https://finance.yahoo.com/news/slowing-inflation-suggests-bidens-policies-161508720.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/6wQJU4zsjD64ML9hBUt.nw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/ap_finance_articles_694/a7f8452c5a1bb0cf472247091ad1b093", "publishedAt": "2024-01-13T16:15:08Z", "content": "WASHINGTON (AP) President Joe Biden can make an increasingly strong case that he's helped fix inflation if only he can get voters to believe him.\r\nFigures issued this past week reflected a historic l… [+7495 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Fossil Discovery Sheds Light on Tyrannosaurus Rex's Earliest Known Relative - SciTechDaily", "description": "Restudy of fossils collected in New Mexico digs up key clues about T. rex’s origins in North America. A new study published in Scientific Reports reshapes our understanding of how the most famous dinosaur to ever walk the earth – Tyrannosaurus rex – first arr…", "url": "https://scitechdaily.com/new-fossil-discovery-sheds-light-on-tyrannosaurus-rexs-earliest-known-relative/", "urlToImage": "https://scitechdaily.com/images/Tyrannosaurus-mcraeensis-Reconstruction.jpg", "publishedAt": "2024-01-13T09:05:05Z", "content": "Reconstruction of Tyrannosaurus mcraeensis. Credit: Sergei Krasinski, edited\r\nRestudy of fossils collected in New Mexico digs up key clues about T. rex’s origins in North America.\r\nA new study publis… [+5736 chars]"}]}