{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Fox Business"}, "author": "Sarah Rumpf", "title": "American Gas Association fires back on potential gas stove ban: 'Not substantiated by sound science' - Fox Business", "description": "The American Gas Association pushed back against a potential gas ban calling the removal of the appliance \"reckless\" and \"not substantiated by sound science.\"", "url": "https://www.foxbusiness.com/politics/american-gas-association-fires-back-potential-gas-stove-ban", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2023/01/0/0/GettyImages-1243649447.jpg?ve=1&tl=1", "publishedAt": "2023-01-11T02:39:38Z", "content": "The American Gas Association (AGA) is clapping back after news that U.S. federal regulators may ban gas stoves over their potential risks to human health stating the removal of the appliance is \"reck… [+3401 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": null, "title": "Deported During Farmers’ Protest, Why Has Modi Government Honoured American Sikh Now? - The Wire", "description": "Darshan Singh Dhaliwal was deported from the Delhi airport in 2021 for organising a langar at the farmers' protest. He has now been recognised with the Pravasi Bharatiya Samman award, the highest honour for NRIs and PIOs.", "url": "https://thewire.in/government/darshan-singh-dhaliwal-award-modi-government", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2023/01/11010252/406a00e8-ac2a-4830-87a4-4bfaf7b92e14-800x400.jpg", "publishedAt": "2023-01-11T02:30:47Z", "content": "Jalandhar (Punjab): The Union government has given the Pravasi Bharatiya Samman award to US-based businessman Darshan Singh Dhaliwal, who was deported from the Delhi airport in October 2021 for organ… [+7883 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Farrah Tomazin, Matthew Knott", "title": "‘AUKUS can lift all boats’: US politicians rally behind pact in letter to Biden - Sydney Morning Herald", "description": "A bipartisan group of US politicians has written to Joe Biden to insist American shipyards can supply Australia with nuclear-powered submarines.", "url": "https://www.smh.com.au/politics/federal/aukus-can-lift-all-boats-us-politicians-rally-behind-pact-in-letter-to-biden-20230111-p5cbqb.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.4813636363636363%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/eb606eea6ccfa806abecc4528672ab03dc6861e9", "publishedAt": "2023-01-10T23:03:08Z", "content": "For folks who say, Oh, you know, the industrial base is backed up. Says who? Courtney said. If you have a plan and if you have the resources, history tells us this capacity is capable of increasing.\r… [+3052 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Experts Recommend Drugs, Surgery for Teen Obesity in New Guidelines - Gizmodo", "description": "The American Academy of Pediatrics' guidelines are the first to emphasize proactive measures for treating childhood obesity, which has risen in recent years.", "url": "https://gizmodo.com/pediatric-obesity-treatment-guidelines-surgery-1849970109", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/8f8ef648777f6a6d579e1b6142c26dc3.jpg", "publishedAt": "2023-01-10T17:37:00Z", "content": "For the first time ever, experts with the American Academy of Pediatrics are recommending proactive medical intervention against childhood obesity. The organizations new guidelines will no longer ask… [+3842 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Brazil's Bolsonaro is in Florida. What does the U.S. do now? - CBC News", "description": "The White House said on Monday it had yet to receive any requests from the Brazilian government regarding Jair Bolsonaro's status, but the former president's presence on American soil since Dec. 30 could raise complex issues, especially since Sunday's riots a…", "url": "https://www.cbc.ca/news/world/us-brazil-bolsonaro-1.6708776", "urlToImage": "https://i.cbc.ca/1.6708877.1673362442!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brazil-bolsonaro-navy.jpg", "publishedAt": "2023-01-10T15:34:29Z", "content": "Far-right former Brazilian president Jair Bolsonaro flew to Florida two days before his term ended, having challenged the results of the Oct. 30 run-off election that he narrowly lost to leftist riva… [+5682 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Thomas Sumner", "title": "Doomed pair of supermassive black holes the closest to collision ever seen - Phys.org", "description": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on January 9 at an American Astronomical Society meeting in Seattl…", "url": "https://phys.org/news/2023-01-doomed-pair-supermassive-black-holes.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/doomed-pair-of-superma.jpg", "publishedAt": "2023-01-10T09:46:22Z", "content": "Astronomers have spotted two ghostly Goliaths en route to a cataclysmic meeting. The newfound pair of supermassive black holes are the closest to colliding ever seen, the astronomers announced on Jan… [+5256 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Experts call on leaders for unified vision at North American Leaders' Summit - CBC News", "description": "Prime Minister Justin Trudeau kicked off three days of North American Leaders' Summit events Monday with a gathering of diplomats, government officials and private-sector emissaries from across the continent.", "url": "https://www.cbc.ca/news/politics/north-american-leaders-summit-economy-1.6708551", "urlToImage": "https://i.cbc.ca/1.6708555.1673310462!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/us-cda-three-amigos-20230109.JPG", "publishedAt": "2023-01-10T01:44:00Z", "content": "From the frosty throes of a Canadian winter, the land of conquistadors and Frida Kahlo can seem a million miles away.\r\nBut that's not the way North American diplomats, trade experts and business lead… [+7171 chars]"}, {"source": {"id": null, "name": "Lupus.org"}, "author": null, "title": "Vitamin D Status a Common Health Concern for People with Lupus, Though Not Linked to Disease Activity - Lupus Foundation of America", "description": "Research shows that while taking vitamin D supplements can be a great way to increase blood levels of vitamin D, it may not improve lupus disease activity.", "url": "https://www.lupus.org/news/vitamin-d-status-a-common-health-concern-for-people-with-lupus-though-not-linked-to-disease", "urlToImage": "https://www.lupus.org/sites/default/files/styles/og_image/public/media/images/disease-ILR.JPG", "publishedAt": "2023-01-09T14:17:08Z", "content": "Nicknamed the sunshine vitamin, vitamin D can be made by the body when skin is exposed to ultraviolet (UV) radiation from the sun. However, many people with lupus need to avoid the sun due to photose… [+1583 chars]"}]}