{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Suzanne Kapner", "title": "Tiffany’s New French Owner Brings a Makeover—and a Culture Clash - The Wall Street Journal", "description": "LVMH aims to heighten the jeweler’s allure to elites abroad while preserving what makes it popular in America", "url": "https://www.wsj.com/articles/tiffanys-new-french-owner-brings-a-makeoverand-a-culture-clash-11640264191", "urlToImage": "https://images.wsj.net/im-457134/social", "publishedAt": "2021-12-23T12:56:00Z", "content": "The French takeover of Tiffany &amp; Co. started with insults, lawsuits and accusations of mismanagement. Then things got really uncomfortable.\r\nSoon after LVMH Moët Hennessy Louis Vuitton SE closed … [+255 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Roni Caryn Rabin, Emily Anthes", "title": "Covid News: Scientists Warn Omicron Will Surge and Say Biden’s Plan Is Insufficient - The New York Times", "description": "President Biden plans to provide hundreds of millions of tests free to Americans. Israel will administer a fourth round of boosters.", "url": "https://www.nytimes.com/live/2021/12/21/world/omicron-covid-vaccine-tests", "urlToImage": "https://static01.nyt.com/images/2021/12/21/multimedia/21virus-briefing-promo-9pm/merlin_199394412_881ffea1-3da0-421b-8d89-9478048e93cd-facebookJumbo.jpg", "publishedAt": "2021-12-23T10:37:52Z", "content": "The downtown in Den Bosch, the Netherlands, on Tuesday, a few days after the government ordered all nonessential shops shuttered.Credit...Piroschka Van De Wouw/Reuters\r\nBusinesses in many parts of Eu… [+5284 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "https://www.facebook.com/nkooverjee", "title": "Toyota Supra Limited Carbon Edition gets unique body panels - Carmag South Africa", "description": "In order to celebrate the iconic sportscar’s influence on the aftermarket segment, the Toyota Supra Limited Carbon Edition has been put together. Exclusive to the North American market, this special model will be limited to just 600 units.", "url": "https://www.carmag.co.za/news/new-models/toyota-supra-limited-carbon-edition-gets-unique-body-panels/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/12/2022-GR-Supra-2.0_002-scaled-1.jpg", "publishedAt": "2021-12-23T08:18:14Z", "content": "In order to celebrate the iconic sportscars influence on the aftermarket segment, the Toyota Supra Limited Carbon Edition has been put together. Exclusive to the North American market, this special m… [+990 chars]"}, {"source": {"id": null, "name": "The Straits Times"}, "author": "Hermes", "title": "Launch of Nasa telescope delayed to Christmas Day - The Straits Times", "description": "KOUROU (French Guiana) • The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weather at the launch site on South America's north-eastern coa…", "url": "https://www.straitstimes.com/world/launch-of-nasa-telescope-delayed-to-christmas-day", "urlToImage": null, "publishedAt": "2021-12-22T21:00:00Z", "content": "KOUROU (French Guiana) The lift-off of Nasa's James Webb Space Telescope, designed to peer farther than ever into the universe, has been delayed until Christmas Day at the earliest, due to poor weath… [+1705 chars]"}]}