{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Discovery of extinct prehistoric reptile that lived among dinosaurs - Science Daily", "description": "Researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists describe the new species Opisthiamimus gregori, which once inhabited Jurassic North America…", "url": "https://www.sciencedaily.com/releases/2022/09/220915123701.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-15T17:08:06Z", "content": "Smithsonian researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists, including the Nati… [+5762 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Survey highlights increase in the public's knowledge about monkeypox - News-Medical.Net", "description": "The public's knowledge about monkeypox has increased rapidly in recent weeks though misconceptions and uncertainty persist, and over a quarter of Americans say they are not likely to get vaccinated against monkeypox if they're exposed to it, according to a ne…", "url": "https://www.news-medical.net/news/20220915/Survey-highlights-increase-in-the-publics-knowledge-about-monkeypox.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/tags/TagImage-795-4470700085221076071.jpg-620x480.jpg", "publishedAt": "2022-09-15T17:04:00Z", "content": "The public's knowledge about monkeypox has increased rapidly in recent weeks though misconceptions and uncertainty persist, and over a quarter of Americans say they are not likely to get vaccinated a… [+9744 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deblina Chakraborty", "title": "Polio is back. How concerned should Americans be? - CNN", "description": "An August report from the US Centers for Disease Control and Prevention said that \"even a single case of paralytic polio represents a public health emergency in the United States.\" CNN Medical Analyst Dr. Leana Wen explains why.", "url": "https://www.cnn.com/2022/09/15/health/polio-paralysis-vaccine-health-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220914213846-04-polio-vaccination-virus-new-york-health-wellness.jpg?q=w_800,c_fill", "publishedAt": "2022-09-15T17:02:00Z", "content": "New Yorks governor has declared a state of emergency after health officials detected poliovirus in the wastewater of five counties evidence the disease is circulating. The declaration also follows a … [+7614 chars]"}, {"source": {"id": null, "name": "Huaweicentral.com"}, "author": "Yushi Nohara", "title": "Finally! EMUI 12 fetched for more Huawei Y8p users - HC Newsroom", "description": "Huawei already activated the release of the EMUI 12 for Huawei Y8p users and in the meantime company is working to expand its reach to other users including the Middle East & Africa, and Latin America. This latest update for the Huawei Y8p users can be identi…", "url": "https://www.huaweicentral.com/finally-emui-12-fetched-for-more-huawei-y8p-users/", "urlToImage": "https://www.huaweicentral.com/wp-content/uploads/2022/09/Huawei-Y8p-EMUI-12-1000x576.jpg", "publishedAt": "2022-09-15T16:04:02Z", "content": "Huawei is now expanding the stable EMUI 12 software for more Huawei Y8p/P Smart S consumers in the global market. Alongside bringing new features and functionalities the update comes with new customi… [+1658 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "العلماء يستزرعون أجنّة الفئران دون استخدام بويضات أو حيوانات منويّة - Scientific American", "description": "Two research teams grew synthetic embryos using stem cells for long enough to see some organs develop.", "url": "https://www.nature.com/articles/d41586-022-02334-2", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-02334-2/d41586-022-02334-2_23403238.jpg", "publishedAt": "2022-09-15T10:26:06Z", "content": "Natural and synthetic mouse embryos grown by developmental biologist Magdalena Zernicka-Goetzs research group.Credit: Gianluca Amadei, Charlotte Handford\r\nThe recipe for mammalian life is simple: tak… [+6882 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Medical videos on YouTube often provide incomplete information - EurekAlert", "description": "Implantable cardioverter defibrillator (ICD) information on YouTube is of low and highly-variable quality, according to research presented at the American College of Cardiology (ACC) Quality Summit 2022.", "url": "https://www.eurekalert.org/news-releases/964161", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-14T17:11:59Z", "content": "Implantable cardioverter defibrillator (ICD) information on YouTube is of low and highly-variable quality, according to research presented at the American College of Cardiology (ACC) Quality Summit 2… [+5625 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": "Mark Ogden, James Olley", "title": "Premier League North vs. South all-star XI: Erling Haaland vs. Harry Kane, but Cristiano Ronaldo misses out - ESPN", "description": "American sports have all-star games, but based on current form, which players would be involved if the Premier League split into North vs. South?", "url": "https://www.espn.com.sg/football/english-premier-league/story/4745933/premier-league-north-vs-south-all-star-xi-erling-haaland-vs-harry-kanebut-cristiano-ronaldo-misses-out", "urlToImage": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0527%2Fr1018099_1296x729_16%2D9.jpg", "publishedAt": "2022-09-14T08:42:39Z", "content": "This week, new Chelsea co-owner Todd Boehly made a bold, and some would say misguided, proposal for the Premier League to introduce an all-star game of North vs. South, similar to those featured in a… [+8452 chars]"}]}