{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Straits Times"}, "author": "hermesauto", "title": "China's Covid-19 vaccine push falters as nations switch to mRNA shots - The Straits Times", "description": "BEIJING (BLOOMBERG) - In the early days of the Covid-19 vaccine rollout, Chinese shots saved countless lives. They kick-started inoculation programmes across Asia, Latin America and the Middle East, while richer countries hoarded scarce mRNA shots from Pfizer…", "url": "https://www.straitstimes.com/asia/east-asia/chinas-covid-19-vaccine-push-falters-as-nations-switch-to-mrna-shots", "urlToImage": "https://static.straitstimes.com.sg/s3fs-public/styles/x_large/public/articles/2021/09/30/ak_chvax_300921.jpg?itok=b0uevGVI", "publishedAt": "2021-09-29T22:33:49Z", "content": "BEIJING (BLOOMBERG) - In the early days of the Covid-19 vaccine rollout, Chinese shots saved countless lives. They kick-started inoculation programmes across Asia, Latin America and the Middle East, … [+7871 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Jane Arraf", "title": "Talk of Iraq Recognizing Israel Prompts Threats of Arrest or Death - The New York Times", "description": "A conference promoting normalization, organized by a little-known American group, prompted a furor, pointing to the volatility and danger in Iraqi politics.", "url": "https://www.nytimes.com/2021/09/29/world/middleeast/iraq-recognizing-israel.html", "urlToImage": "https://static01.nyt.com/images/2021/09/28/world/xxiraq-conference/xxiraq-conference-facebookJumbo.jpg", "publishedAt": "2021-09-29T21:53:01Z", "content": "As news of the conference spread, the Iraqi government and authorities in overwhelmingly Sunni Anbar Province issued arrest warrants for at least six Iraqis they said were involved in the conference,… [+1733 chars]"}, {"source": {"id": null, "name": "Wjct.org"}, "author": "Yuki Noguchi", "title": "Obesity Rates Rise During Pandemic, Fueled By Stress, Job Loss, Sedentary Lifestyle - WJCT NEWS", "description": "It is official: The pandemic&#039;s effect on America&#039;s waistline has been rough.  New data from the Centers for Disease Control and Prevention showed", "url": "https://news.wjct.org/post/obesity-rates-rise-during-pandemic-fueled-stress-job-loss-sedentary-lifestyle", "urlToImage": "https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202109/1041540595.jpg", "publishedAt": "2021-09-29T17:09:51Z", "content": "It is official: The pandemic's effect on America's waistline has been rough. \r\nNew data from the Centers for Disease Control and Prevention showed 16 states now have obesity rates of 35% or higher. T… [+5739 chars]"}]}