{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Chess.com"}, "author": "Carsten Hansen", "title": "So Wins Final: 2022 FIDE Grand Prix Berlin Leg 3, Final Tiebreaks - Chess.com", "description": "With draws in both of the two classical games, American GMs Hikaru Nakamura and Wesley So were set to decide who would win the third and final leg of the 2022 FIDE Grand Prix in a rapid-play tiebreaker. After an intense draw in the first rapid game, So showed…", "url": "https://www.chess.com/news/view/2022-fide-grand-prix-berlin-leg-3-final-tiebreaks", "urlToImage": "https://images.chesscomfiles.com/uploads/v1/news/1062015.1c3cd632.5000x5000o.76527206ed6b.png", "publishedAt": "2022-04-04T19:57:00Z", "content": "With draws in both of the two classical games, American GMs Hikaru Nakamura and Wesley So were set to decide who would win the third and final leg of the 2022 FIDE Grand Prix in a rapid-play tiebreak… [+3515 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "North Carolina outlasting Duke was a masterclass in American Sports, talks Lakers – Colin | THE HERD - The Herd with Colin Cowherd", "description": "Despite going into the Final Four as the projected favorites, the Duke Blue Devils fell to the North Carolina Tar Heels, 81-77. North Carolina advances to fa...", "url": "https://www.youtube.com/watch?v=_DM_pNP6bs4", "urlToImage": "https://i.ytimg.com/vi/_DM_pNP6bs4/hqdefault.jpg", "publishedAt": "2022-04-04T18:20:07Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Says He Is Not \"Anti-Indian\" Or \"Anti-American\" - NDTV", "description": "Claiming that he was not \"anti-Indian or anti-American\" or against any country, Pakistan Prime Minister Imran Khan on Monday said he wanted good relations with all nations based on mutual respect.", "url": "https://www.ndtv.com/world-news/imran-khan-says-he-is-not-anti-indian-or-anti-american-2862841", "urlToImage": "https://c.ndtvimg.com/2022-03/561vnm4o_pak-pm-imran-khan-afp-650_625x300_30_March_22.jpg", "publishedAt": "2022-04-04T17:35:36Z", "content": "\"I am not against any country. I am not anti-Indian or anti-American,\" Imran Khan said (File)\r\nIslamabad: Claiming that he was not \"anti-Indian or anti-American\" or against any country, Pakistan Prim… [+2613 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Dailymail.com", "title": "American Idol: Hollywood Week continues with a new Duets Challenge - Daily Mail", "description": "Lionel Richie was brought to tears when a former Miss America contestant helped bring one of the show's shyest contestants out of her shell on Sunday night's American Idol Hollywood Duets episode.", "url": "https://www.dailymail.co.uk/tvshowbiz/article-10683213/American-Idol-Hollywood-Week-continues-new-Duets-Challenge.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/04/04/08/56190489-0-image-a-194_1649056154088.jpg", "publishedAt": "2022-04-04T07:35:59Z", "content": "Lionel Richie was brought to tears when a former Miss America contestant helped bring one of the show's shyest contestants out of her shell on Sunday night's American Idol Hollywood Duets episode on … [+33638 chars]"}]}