{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "MLB.com"}, "author": "Bryan Hoch", "title": "Will Aaron Judge re-sign with Yankees in free agency? - MLB.com", "description": "NEW YORK -- It came down to Aaron Judge once again, a situation that the Yankees have steered into all summer long. Assuming the familiar, imposing stance that cracked an American League-record 62 home runs during the regular season, the game’s most recogniza…", "url": "https://www.mlb.com/news/aaron-judge-future-with-yankees-free-agency", "urlToImage": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/otqafmc2kys9povjvdah.jpg", "publishedAt": "2022-10-24T15:25:44Z", "content": "NEW YORK -- It came down to Aaron Judge once again, a situation that the Yankees have steered into all summer long. Assuming the familiar, imposing stance that cracked an American League-record 62 ho… [+5211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte", "title": "1 in 10 Americans over 65 have dementia, study finds - CNN", "description": "Rates of dementia and mild cognitive decline rise every five years after 65, a new study found. African Americans were more likely to have dementia, and Hispanics were more likely to suffer from mild cognitive impairment.", "url": "https://www.cnn.com/2022/10/24/health/dementia-cognitive-decline-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/221021141210-elderly-person-holding-hands-with-younger-person-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-10-24T15:13:00Z", "content": "One in 10 Americans over 65 had dementia, while 22% experienced mild cognitive impairment, the earliest stage of the slow slide into senility, according to a new study conducted between 2016 and 2017… [+7123 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Auger-Aliassime wins European Open final for back-to-back ATP Tour titles - CBC Sports", "description": "Canada's Felix Auger-Aliassime won his second consecutive ATP tennis final after beating American Sebastian Korda 6-3, 6-4 in Sunday's final of the ATP 250 European Open in Antwerp, Belgium.", "url": "https://www.cbc.ca/sports/tennis/felix-auger-aliassime-european-open-final-victory-1.6626693", "urlToImage": "https://i.cbc.ca/1.6626695.1666551996!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1244153283.jpg", "publishedAt": "2022-10-23T19:07:32Z", "content": "Canada's Felix Auger-Aliassime has been on quite a roll of late.\r\nThe Montreal native defeated Sebastian Korda of the United States 6-3, 6-4 to claim his second consecutive ATP Tour title win at the … [+2112 chars]"}]}