{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Auger-Aliassime wins European Open final for back-to-back ATP Tour titles - CBC Sports", "description": "Canada's Felix Auger-Aliassime won his second consecutive ATP tennis final after beating American Sebastian Korda 6-3, 6-4 in Sunday's final of the ATP 250 European Open in Antwerp, Belgium.", "url": "https://www.cbc.ca/sports/tennis/felix-auger-aliassime-european-open-final-victory-1.6626693", "urlToImage": "https://i.cbc.ca/1.6626695.1666551996!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1244153283.jpg", "publishedAt": "2022-10-23T19:07:32Z", "content": "Canada's Felix Auger-Aliassime has been on quite a roll of late.\r\nThe Montreal native defeated Sebastian Korda of the United States 6-3, 6-4 to claim his second consecutive ATP Tour title win at the … [+2112 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "U.S. teen makes history at figure skating competition - CTV News", "description": "American teenager Ilia Malinin landed the second ever quadruple axel in competition on Saturday without so much as a wobble. Competing at Skate America, the 17-year-old's historic free skate secured him the gold medal in his senior Grand Prix debut as he beca…", "url": "https://www.ctvnews.ca/sports/the-american-teenage-figure-skating-phenomenon-making-history-1.6121320", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/10/23/figure-skater-ilia-malinin-1-6121323-1666540467839.jpg", "publishedAt": "2022-10-23T15:56:02Z", "content": "American teenager Ilia Malinin landed the second ever quadruple axel in competition on Saturday without so much as a wobble.\r\nCompeting at Skate America, the 17-year-old's historic free skate secured… [+1779 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": null, "title": "US-PH enforcers tackle cybersecurity issues - The Manila Times", "description": "The US Embassy's Office of International Narcotics and Law Enforcement Affairs (INL) gathered Filipino and American security and justice sector representatives to exchange...", "url": "https://www.manilatimes.net/2022/10/24/expats-diplomats/us-ph-enforcers-tackle-cybersecurity-issues/1863416", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/10/23/119750.jpg", "publishedAt": "2022-10-23T15:04:44Z", "content": "The US Embassy's Office of International Narcotics and Law Enforcement Affairs (INL) gathered Filipino and American security and justice sector representatives to exchange best practices and share kn… [+2664 chars]"}, {"source": {"id": null, "name": "Racingnews365.com"}, "author": "RacingNews365 Staff", "title": "Revised starting grid for the 2022 F1 United States GP after multiple penalties - Racingnews365.com", "description": "Here is the full starting grid for the 2022 F1 United States Grand Prix, which will be held at the Circuit of the Americas on Sunday.", "url": "https://racingnews365.com/revised-starting-grid-for-the-2022-f1-united-states-gp-after-multiple-penalties", "urlToImage": "https://s3-eu-west-1.amazonaws.com/racingnews-v2-prod/_1200x630_crop_center-center_82_none/XPB_1178946_HiRes.jpg?v=1666514561", "publishedAt": "2022-10-23T12:25:00Z", "content": "Carlos Sainz will start from pole position for the third time in 2022 at the United States Grand Prix.\r\nThe Spaniard beat Ferrari teammate Charles Leclerc by 0.065 seconds to secure P1, while Max Ver… [+628 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Ryan De Villiers", "title": "Stumbling across the Firebird cafe built around a 1981 Pontiac Firebird - Carmag South Africa", "description": "Although Cape Town is dominated by euro cars and the occasional Italian supercar, it’s a breath of fresh air to see a pure-blooded American muscle car. Home to one iconic 80’s American muscle car is the Firebird cafe in Observatory.", "url": "https://www.carmag.co.za/news/firebird-cafe-cafe-1981-firebird/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/10/Firebird-cafe-edit-5.jpg", "publishedAt": "2022-10-23T07:04:41Z", "content": "FordMustangAlthough Cape Town is dominated by euro cars and the occasional Italian supercar, its a breath of fresh air to see a pure-blooded American muscle car. Home to one iconic 80s American muscl… [+1794 chars]"}]}