{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "[Removed]"}, "author": null, "title": "[Removed]", "description": "[Removed]", "url": "https://removed.com", "urlToImage": null, "publishedAt": "1970-01-01T00:00:00Z", "content": "[Removed]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Lauren del Valle, Kara Scannell, Nicki Brown, Brynn Gingras", "title": "Takeaways from the Trump hush money trial: Ex-publisher details tabloid tactics - CNN", "description": "Former American Media Inc. chairman David Pecker took jurors in Donald Trump’s hush money case inside how he paid for Karen McDougal’s story to keep her quiet about her alleged affair with Trump – and how his decision not to pay for Stormy Daniels’ story led …", "url": "https://www.cnn.com/2024/04/25/politics/takeaways-trump-hush-money-trial-day-7/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/c-ap24116393604227.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-04-26T03:50:00Z", "content": "Former American Media Inc. chairman David Pecker took jurors in Donald Trumps hush money case inside how he paid for Karen McDougals story to keep her quiet about her alleged affair with Trump and ho… [+8631 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Thomas Biesheuvel", "title": "Anglo American’s Stumbles Have Made It Prey for BHP - Bloomberg", "description": "When former boss Mark Cutifani left Anglo American Plc in mid-April 2022, things had rarely looked better for the century-old miner. Metals prices soared as the world emerged from lockdowns, the company had recently posted its best-ever annual profit and the …", "url": "https://www.bloomberg.com/news/articles/2024-04-25/anglo-s-stumbles-have-made-it-prey-for-mining-s-biggest-predator", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ihutozxraE8U/v2/1200x798.jpg", "publishedAt": "2024-04-26T02:14:00Z", "content": "When former boss Mark Cutifani left Anglo American Plc in mid-April 2022, things had rarely looked better for the century-old miner. Metals prices soared as the world emerged from lockdowns, the comp… [+351 chars]"}]}