{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Robert Z. Pearlman", "title": "Russia's only active launch pad for cosmonauts damaged by Soyuz crew launch to International Space Station - Space", "description": "Two cosmonauts and an American astronaut arrived at the International Space Station safely, but damage caused by their launch may delay future Russian crew and cargo flights to the orbiting complex.", "url": "https://www.space.com/space-exploration/international-space-station/russias-only-launch-pad-for-cosmonauts-damaged-by-soyuz-crew-launch-to-international-space-station", "urlToImage": "https://cdn.mos.cms.futurecdn.net/AUR48sVNY8X6hRDGageg8A-1920-80.jpg", "publishedAt": "2025-11-28T17:38:47Z", "content": "Russia's successful launch of three new crew members to the International Space Station on Thursday (Nov. 27), resulted in damage to country's only active launch pad for crewed spaceflights to the or… [+2467 chars]"}, {"source": {"id": null, "name": "Salon"}, "author": "Nicole Karlis", "title": "RFK is in charge of flu season — and trouble may be ahead - Salon.com", "description": "Viral mutations are driving a surge in illness. Can Americans trust the Trump admin for guidance?", "url": "https://www.salon.com/2025/11/28/rfk-is-in-charge-of-flu-season-and-trouble-may-be-ahead/", "urlToImage": "https://www.salon.com/app/uploads/2025/11/GettyImages-2196805094.jpg", "publishedAt": "2025-11-28T17:00:53Z", "content": "Flu season is here and it’s already shaping up to be a pretty intense one. Illness is predicted to spread faster, infect more people and put higher-risk groups at greater chance of being seriously il… [+5892 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "Get Ready for a Puke-Filled Winter: Norovirus Is Back With a Vengeance - Gizmodo", "description": "CDC data indicates that norovirus is back on the warpath and getting plenty of Americans sick.", "url": "https://gizmodo.com/get-ready-for-a-puke-filled-winter-norovirus-is-back-with-a-vengeance-2000692066", "urlToImage": "https://gizmodo.com/app/uploads/2025/11/toilet-1200x675.jpg", "publishedAt": "2025-11-28T17:00:07Z", "content": "The winter is often synonymous with cold and flu season. Unfortunately, those germs aren’t the only ones spreading widely around this time of year. So gird your stomachs and stay on the lookout for t… [+2967 chars]"}]}