{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Ankita Sen", "title": "Mass Twitter layoffs put H-1B visa holders in an immigration limbo - Economic Times", "description": "According to a National Foundation for American Policy analysis of US Citizenship and Immigration Services (USCIS) data, there are about 625 to 670 Twitter employees in H-1B status, or about 8% of the companys 7,500 employees. Out of the 50% manpower cut anno…", "url": "https://economictimes.indiatimes.com/nri/migrate/mass-twitter-layoffs-put-h-1b-visa-holders-in-an-immigration-limbo/articleshow/95319316.cms", "urlToImage": "https://img.etimg.com/thumb/msid-95319424,width-1070,height-580,imgsize-1553647,overlay-economictimes/photo.jpg", "publishedAt": "2022-11-05T10:38:00Z", "content": "Elon Musk's massive firing spree across Twitter has put some employees on a 60-day deadline, and their immigration status under threat.\r\nTwitter employees working on American work visas, like the H-1… [+4092 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Toluse Olorunnipa", "title": "In hard-fought midterms, Indian American voters are prized - The Washington Post", "description": "Ahead of hard-fought midterms, Democrats are hoping to capitalize on the optimism felt by Indian Americans, a growing and increasingly vital bloc of voters.", "url": "https://www.washingtonpost.com/politics/2022/11/04/midterms-indian-american-voters/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VZNG4AZP7DREPAXRZFBTEEVI6Y.JPG&w=1440", "publishedAt": "2022-11-04T22:23:00Z", "content": "Comment on this story\r\nAs President Biden rolled up his sleeve to receive his coronavirus booster shot at the White House last week, he was surrounded by leaders from the worlds of medicine, governme… [+10656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "American Jailed For 4 Weeks For Slapping Singapore Airlines Crew Member - NDTV", "description": "An American whose bomb hoax on a commercial flight prompted Singapore to scramble fighter jets was sentenced to four weeks in prison today, after a court found him guilty of causing hurt by slapping a cabin crew member.", "url": "https://www.ndtv.com/world-news/us-national-gets-4-week-jail-for-slapping-singapore-airlines-crew-member-3490658", "urlToImage": "https://i.ndtvimg.com/i/2015-05/singapore-airlines_650x400_81432696416.jpg", "publishedAt": "2022-11-04T12:57:00Z", "content": "The plane had to be escorted to Singapore by fighter jets. (Representational)\r\nSingapore: An American whose bomb hoax on a commercial flight prompted Singapore to scramble fighter jets was sentenced … [+1269 chars]"}]}