{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "E-Commerce in Africa Projected to Grow 56% by 2025 - Voice of America", "description": "Retailers taking advantage of the trend despite hurdles in delivery, online payments Originally published at - https://www.voanews.com/a/e-commerce-in-africa...", "url": "https://www.youtube.com/watch?v=aq888ljO25c", "urlToImage": "https://i.ytimg.com/vi/aq888ljO25c/hqdefault.jpg", "publishedAt": "2022-07-21T14:33:17Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Dangerously high temperatures will last through the weekend with millions of Americans set to experience triple-digit heat - CNN", "description": "More than 85% of Americans are bracing for temperatures above 90 degrees Fahrenheit through the weekend, with millions in the south-central US expected to experience readings in the triple digits.", "url": "https://www.cnn.com/2022/07/21/weather/us-extreme-heat-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720234345-01-us-extreme-heat-thursday-super-tease.jpg", "publishedAt": "2022-07-21T13:07:00Z", "content": "(CNN)More than 85% of Americans are bracing for temperatures above 90 degrees Fahrenheit through the weekend, with millions in the south-central US expected to experience readings in the triple digit… [+6468 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Leslie Josephs", "title": "American Airlines forecasts third-quarter profit but scales back growth after flight disruptions - CNBC", "description": "American's CEO said the carrier would limit its expansion this year.", "url": "https://www.cnbc.com/2022/07/21/american-airlines-aal-2q-22-earnings.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107005670-16430678942022-01-24t234332z_458926658_rc2x5s9qq58m_rtrmadp_0_usa-tranportation-biden.jpeg?v=1643067962&w=1920&h=1080", "publishedAt": "2022-07-21T11:02:55Z", "content": "American Airlines posted its first quarterly profit since the pandemic started without government aid but joined competitors in scaling back growth plans after a host of disruptions this year. The ca… [+2177 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Americans recognize the climate is changing. But they disagree on why — and what to do about it - CBC News", "description": "As images of melting runways, buckling railway tracks and raging wildfires consumed the world's attention this week, Americans remained deadlocked on how to slow the climate change that scientists say is driving much of the extreme weather we're seeing.", "url": "https://www.cbc.ca/news/world/climate-biden-polarization-1.6527112", "urlToImage": "https://i.cbc.ca/1.6527183.1658367949!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/usa-weather.jpeg", "publishedAt": "2022-07-21T08:00:00Z", "content": "As images of melting runways, buckling railway tracks and raging wildfires consumed the world's attention this week, Americans remained deadlocked on how to slow the climate change that scientists sa… [+9460 chars]"}, {"source": {"id": null, "name": "Psychiatryadvisor.com"}, "author": null, "title": "A Year of Standard Care for Treatment Resistant Depression Fails to Improve Symptoms of Suicidality - Psychiatry Advisor", "description": "The Treatment-resistant Depression in America Latina (TRAL) study was conducted at centers in Argentina, Brazil, Colombia, and Mexico between 2017 and 2018.", "url": "https://www.psychiatryadvisor.com/home/topics/suicide-and-self-harm/year-of-soc-therapy-for-trd-had-suboptimal-effects-on-symptoms-of-depression-and-suicidality/", "urlToImage": "https://www.psychiatryadvisor.com/wp-content/uploads/sites/8/2022/02/Depression-Headache_G_1324340507-1.jpg", "publishedAt": "2022-07-20T14:10:00Z", "content": "A year of standard of care (SOC) therapy for treatment resistant depression (TRD) had suboptimal effects on symptoms of depression and suicidality. These findings were published in the the Revista de… [+3083 chars]"}]}