{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Sharjah24.ae"}, "author": "Sharjah 24", "title": "Lebanese rejoice after Mayyas win 'America's Got Talent' - Sharjah24", "description": "Sharjah24 – AFP: Lebanese celebrated the local dance troupe Mayyas on Thursday after it won the \"America's Got Talent\" TV contest, stoking joy and pride in a country battered by years of political and economic turmoil.", "url": "https://www.sharjah24.ae/en/Articles/2022/09/16/Lebanese-rejoice-after-Mayyas-win-Americas-Got-Talent", "urlToImage": "https://www.sharjah24.ae/en/Articles/2022/09/16/Lebanese-rejoice-after-Mayyas-win-Americas-Got-Talent/-/media/Sharjah24/Articles/2022/Septemper-2022/16/mayyas.jpg?20220916130008", "publishedAt": "2022-09-16T07:48:20Z", "content": "Many fans, across age groups and religious lines in the crisis-tested country and its large diaspora, tearfully cheered the all-women group for what judges and viewers hailed as a hypnotic and mesmer… [+602 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Discovery of extinct prehistoric reptile that lived among dinosaurs - Science Daily", "description": "Researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists describe the new species Opisthiamimus gregori, which once inhabited Jurassic North America…", "url": "https://www.sciencedaily.com/releases/2022/09/220915123701.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-09-15T17:08:06Z", "content": "Smithsonian researchers have discovered a new extinct species of lizard-like reptile that belongs to the same ancient lineage as New Zealand's living tuatara. A team of scientists, including the Nati… [+5762 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Katie McQue", "title": "Hundreds of Filipino workers stranded at remote American military base amid wage dispute - The Washington Post", "description": "Their employer, KBR, denies Philippine charges that it’s keeping them from leaving the remote American military base on Diego Garcia.", "url": "https://www.washingtonpost.com/world/2022/09/14/filipino-workers-kbr-diego-garcia/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/S3QMC7BSX4I63IGWIFJJTP7L2U.jpg&w=1440", "publishedAt": "2022-09-14T12:00:00Z", "content": "Hundreds of Filipino workers are marooned at a U.S. military base on an island in the Indian Ocean because of a dispute between their employer, a major American contractor, and the Philippine governm… [+7981 chars]"}]}