{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Intermittent fasting protects kidneys of obese mice - Medical Xpress", "description": "New research in a mouse model of diet-induced obesity finds that time-restricted feeding improves markers of kidney and vascular health. The research will be presented this week at the American Physiological Society (APS) and American Society for Nephrology C…", "url": "https://medicalxpress.com/news/2022-06-intermittent-fasting-kidneys-obese-mice.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/food-clock-1.jpg", "publishedAt": "2022-06-27T14:05:03Z", "content": "New research in a mouse model of diet-induced obesity finds that time-restricted feeding improves markers of kidney and vascular health. The research will be presented this week at the American Physi… [+1622 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Lisa Schlein", "title": "WHO: Monkeypox is Not a Global Health Emergency - Voice of America - VOA News", "description": "Since early May, more than 3,200 confirmed cases of monkeypox have been reported in more than 50 countries outside Africa", "url": "https://www.voanews.com/a/who-monkeypox-is-not-a-global-health-emergency/6634592.html", "urlToImage": "https://gdb.voanews.com/10060000-0aff-0242-902e-08da5831ba7f_w1200_r1.jpg", "publishedAt": "2022-06-27T12:07:12Z", "content": "GENEVA  A World Health Organization independent committee of experts says the spread of monkeypox in a number of countries around the world is worrisome but does not constitute what the WHO calls a P… [+2559 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Luke Goodsell", "title": "Baz Luhrmann and Austin Butler on Elvis and honouring the 'original superhero' while exposing the dark heart of the American dream - ABC News", "description": "The Australian director sat down with ABC Arts to talk about shooting through COVID and balancing iconography with humanity in bringing this quintessentially Luhrmann take on Elvis’s 42 years to life.", "url": "https://www.abc.net.au/news/2022-06-27/elvis-movie-baz-luhrmann-and-austin-butler-interview/101167066", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/4b3cb70506d3a0077fcb1251f6c2509c?impolicy=wcms_crop_resize&cropH=1713&cropW=3046&xPos=979&yPos=731&width=862&height=485", "publishedAt": "2022-06-26T19:25:11Z", "content": "Elvis: he's everywhere and nowhere, a mononym as familiar as Coke and a cipher as abstract as the clichés he came to (dis)embody. Both the King of Rock 'n' Roll and a costume party punchline, the man… [+10917 chars]"}]}