{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen, CNN Senior Medical Correspondent", "title": "Caught in a 'pickle,' millions of Americans might not have had an adequate response to the Covid-19 vaccine - CNN ", "description": "Tens of millions of Americans are taking immunosuppressive drugs that might weaken the effect of the Covid-19 vaccine, and they find themselves in uncharted territory, scared that their vaccinations might not have worked.", "url": "https://www.cnn.com/2021/06/04/health/covid-19-vaccine-immunosuppressants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512100735-johnson-johnson-covid-19-vaccine-super-tease.jpeg", "publishedAt": "2021-06-05T00:01:00Z", "content": "(CNN)It was a beautiful March afternoon, and as June Tatelman walked her dog in her Boston neighborhood, she was flying high. \r\nTatelman had recently received her second dose of Pfizer's Covid-19 vac… [+9564 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Marisa Schultz", "title": "Rep. Kevin Brady lays into May jobs report, says Biden's policies holding America back - Fox Business", "description": "Texas Rep. Kevin Brady Friday blasted the May jobs report for \"falling-well short of expectations\" and blamed President Biden's policies for an economic outlook that \"mirrors the stagnant 1970s.\"", "url": "https://www.foxbusiness.com/politics/kevin-brady-may-jobs-report", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/06/0/0/6576e935-Biden-3.jpg?ve=1&tl=1", "publishedAt": "2021-06-04T21:58:50Z", "content": "Rep. Kevin Brady, R-Texas, on Friday blasted the May jobs report for \"falling-well short of expectations\" and blamed President Joe Biden's policies for an economic outlook that \"mirrors the stagnant … [+3005 chars]"}, {"source": {"id": "marca", "name": "Marca"}, "author": "MARCA", "title": "Brazil consider Copa America boycott, Argentina and Uruguay supportive - MARCA.com", "description": "The 2021 Copa America has been surrounded by a great deal of controversy in recent weeks. The tournament had been due to be played in Colombia and...", "url": "https://www.marca.com/en/football/copa-america/2021/06/04/60ba888c268e3e68538b460e.html", "urlToImage": "https://phantom-marca.unidadeditorial.es/eba199c5fcea08eadd90521e9ef8b0e9/f/jpg/assets/multimedia/imagenes/2021/06/04/16228215043938.jpg", "publishedAt": "2021-06-04T20:30:49Z", "content": "The 2021 Copa America has been surrounded by a great deal of controversy in recent weeks. The tournament had been due to be played in Colombia and Argentina, but has since been switched to use Brazil… [+1229 chars]"}, {"source": {"id": null, "name": "Businessmirror.com.ph"}, "author": "The Associated Press", "title": "Biden says US to swiftly boost global vax sharing | The Associated Press - Business Mirror", "description": "WASHINGTON—President Joe Biden announced Thursday the US will swiftly donate an initial allotment of 25 million doses of surplus vaccine overseas through the United Nations-backed Covax program, promising infusions for South and Central America, Asia, Africa …", "url": "https://businessmirror.com.ph/2021/06/04/biden-says-us-to-swiftly-boost-global-vax-sharing/", "urlToImage": "https://businessmirror.com.ph/wp-content/uploads/2021/06/world02-060521.jpg", "publishedAt": "2021-06-04T15:18:47Z", "content": "WASHINGTONPresident Joe Biden announced Thursday the US will swiftly donate an initial allotment of 25 million doses of surplus vaccine overseas through the United Nations-backed Covax program, promi… [+5831 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Malay Mail", "title": "When you have been fully vaccinated ― Hafiz Hassan - Malay Mail", "description": "JUNE 4 ― There have been a number of references to the American Centers for Disease Control and Prevention (CDC) in recent days. Foremost is the reference by the Academy of Medicine of Malaysia (AMM) which criticised the practice of public sanitation which wa…", "url": "https://www.malaymail.com/news/what-you-think/2021/06/04/when-you-have-been-fully-vaccinated-hafiz-hassan/1979503", "urlToImage": "https://www.malaymail.com/graphics/meta/og-image.png", "publishedAt": "2021-06-04T02:07:21Z", "content": "JUNE 4 There have been a number of references to the American Centers for Disease Control and Prevention (CDC) in recent days.\r\nForemost is the reference by the Academy of Medicine of Malaysia (AMM) … [+2684 chars]"}]}