{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "Karl Quinn", "title": "Azealia Banks’ promoters hit back at controversial star over ‘scam’ slur - Sydney Morning Herald", "description": "The Australian promoters of a trouble-plagued tour by the controversial American hip-hop artist are not taking her attacks lying down.", "url": "https://www.smh.com.au/culture/music/azealia-banks-promoters-hit-back-at-controversial-star-over-scam-slur-20221220-p5c7wd.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.3531%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_16/t_crop_custom/q_86%2Cf_auto/t_smh_no_label_no_age_social_wm/89099fda1245ac42810b400e986e9b9a1e68399d", "publishedAt": "2022-12-20T09:29:57Z", "content": "That attack prompted separate rebuttals from the promoters.\r\nPoint Productions issued a statement in which it said it was aware of recent disparaging comments by Ms Banks about us, and about her expe… [+2713 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "FIFA refuses to make Argentina no.1 in rankings despite winning 2022 World Cup - Daily Post Nigeria", "description": "Argentina will not become the number one team in the FIFA rankings this month, despite winning the 2022 World Cup. Instead, the world football governing body will rate Brazil ahead of their South American rivals. Brazil have held the top position since Februa…", "url": "https://dailypost.ng/2022/12/20/fifa-refuses-to-make-argentina-no-1-in-rankings-despite-winning-2022-world-cup/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/12/Argentina.jpg", "publishedAt": "2022-12-20T08:48:24Z", "content": "Argentina will not become the number one team in the FIFA rankings this month, despite winning the 2022 World Cup.\r\nInstead, the world football governing body will rate Brazil ahead of their South Am… [+938 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Gina Wadas", "title": "Under attack: Researchers shed light on how Lyme disease infects body - Phys.org", "description": "An estimated 476,000 Americans are infected each year with Lyme disease, a condition causing a wide range of symptoms that include fever, rash, and joint pain, as well as effects on the central nervous system and heart. Though it's common knowledge that Borre…", "url": "https://phys.org/news/2022-12-lyme-disease-infects-body.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/under-attack-researche.jpg", "publishedAt": "2022-12-19T21:47:30Z", "content": "An estimated 476,000 Americans are infected each year with Lyme disease, a condition causing a wide range of symptoms that include fever, rash, and joint pain, as well as effects on the central nervo… [+3365 chars]"}]}