{"articles": [{"author": "Web Desk", "content": "Prince Harry had revealed in his explosive tell-all with Oprah Winfrey that his father Prince Charles had financially cut his family off in the aftermath of their royal exit. \r\nHowever, the Duke of S… [+772 chars]", "description": "Prince Harry said that his father Prince Charles cut him off financially following his move to America with Meghan Markle and Archie", "publishedAt": "2021-03-14T13:11:00Z", "source": {"id": null, "name": "Www.geo.tv"}, "title": "Bank statements prove Prince Charles supported hypocrite Prince Harry - Geo News", "url": "https://www.geo.tv/latest/339682-bank-statements-prove-prince-charles-supported-hypocrite-prince-harry", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2021-03-14/339682_061114_updates.jpg"}, {"author": null, "content": "Team New Zealand wont be too disappointed at losing a race day due to light wind conditions.\r\n Sundays two races were called off as the wind failed to get above the consistent 6.5 knots required to s… [+4110 chars]", "description": "OPINION: Luna Rossa denied a chance to utilise their light-air liking and that will suit the defenders just fine as better breeze looms.", "publishedAt": "2021-03-14T07:18:00Z", "source": {"id": null, "name": "Stuff.co.nz"}, "title": "America's Cup: Why abandoned race day won't worry Team NZ - Stuff.co.nz", "url": "https://www.stuff.co.nz/sport/americas-cup/124537704/americas-cup-why-abandoned-race-day-wont-worry-team-nz", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/r/g/a/2/image.related.StuffLandscapeSixteenByNine.1420x800.2259wo.png/1615706290883.jpg"}, {"author": "Mihnea Radu", "content": "To be fair, you can get these vehicles with sedan bodies. We're talking about the 4-door A35 and S3, as well as the M235i. But they're relative newcomers to this segment, whereas the Golf R traces it… [+1392 chars]", "description": "America doesn't get all these hot hatchbacks, but it will have the new Golf 8 R for the 2022 model year. And we thought it would be interesting to see how fast it is compared to rivals such as the Audi S3 Sportback, the BMW M135i, and the Mercedes-AMG A35.", "publishedAt": "2021-03-13T20:05:00Z", "source": {"id": null, "name": "autoevolution"}, "title": "2022 VW Golf R Crushes Audi, BMW and AMG Hot Hatches in Drag Race - autoevolution", "url": "https://www.autoevolution.com/news/2022-vw-golf-r-crushes-audi-bmw-and-amg-hot-hatches-in-drag-race-157603.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/2022-vw-golf-r-crushes-audi-bmw-and-amg-hot-hatches-in-drag-race-157603-7.jpg"}, {"author": "RTÉ News", "content": "The White House is holding onto some doses of AstraZeneca Covid-19 vaccine so they can be given to Americans quickly if authorised by the US health regulator, a top administration official has said.\r… [+10539 chars]", "description": "The White House is holding onto some doses of AstraZeneca Covid-19 vaccine so they can be given to Americans quickly if authorised by the US health regulator, a top administration official has said.", "publishedAt": "2021-03-12T20:48:45Z", "source": {"id": "rte", "name": "RTE"}, "title": "US holding on to AstraZeneca doses in hopes of approval - RTE.ie", "url": "https://www.rte.ie/news/coronavirus/2021/0312/1203515-coronavirus-global/", "urlToImage": "https://img.rasset.ie/001625e5-1600.jpg"}], "message": "Successful api call", "number_of_news": 4, "status": 200, "topic": "america"}