{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Draws Criticism From Closest Allies Over Supreme Court's Abortion Ruling - NDTV", "description": "The US Supreme Court's historic end to nationwide abortion rights on Friday drew unusual criticism from some of America's closest allies and bucks a global trend to more liberal reproductive rights.", "url": "https://www.ndtv.com/world-news/us-draws-criticism-from-closest-allies-over-supreme-courts-abortion-ruling-3098767", "urlToImage": "https://c.ndtvimg.com/2022-06/dr19ilj_abortion-rally-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T02:31:38Z", "content": "The Supreme Court said that the decision \"will save millions of innocent, unborn lives.\"\r\nWashington: The US Supreme Court's historic end to nationwide abortion rights on Friday drew unusual criticis… [+4117 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Abigail Higgins", "title": "Abortion advocates fear access to birth control could be curtailed - The Washington Post", "description": "The Supreme Court’s decision to overturn the right to abortion is stoking fears among some Americans that curbing access to contraceptives could be next.", "url": "https://www.washingtonpost.com/nation/2022/06/24/birth-control-access-supreme-court-abortion-ruling/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Y36SBS4U4RGZPMLPDLVILWNXDY.jpg&w=1440", "publishedAt": "2022-06-24T23:05:00Z", "content": "Placeholder while article actions load\r\nThe Supreme Courts decision to overturn the fundamental right to abortion is stoking fears among some Americans that curbing access to contraceptives could be … [+8162 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Findings suggest Al Jazeera journalist Shireen Abu Akleh killed by Israeli forces, says UN human rights office - ABC News", "description": "Information reviewed by the UN human rights office suggests Israeli security forces fired the shots that killed Palestinian-American reporter Shireen Abu Akleh in May, not indiscriminate firing from Palestinians, a spokesperson says.", "url": "https://www.abc.net.au/news/2022-06-25/findings-suggest-al-jazeera-journalist-killed-by-israeli-forces/101183006", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/df08c27971025be3a7d074db6baf698b?impolicy=wcms_crop_resize&cropH=2268&cropW=4032&xPos=0&yPos=455&width=862&height=485", "publishedAt": "2022-06-24T19:15:58Z", "content": "Information reviewed by the UN human rights office suggests Israeli security forces fired the shots that killed Palestinian-American reporter Shireen Abu Akleh in May, not indiscriminate firing from … [+4079 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Lucy Thackray", "title": "'I was shocked' – Irishman barred from entering US 'because he was born in Iraq' - Independent.ie", "description": "An Irishman has described the moment he was barred from boarding a flight to the US by American border officials, who he alleges said it was &ldquo;because he was born in Iraq&rdquo;.", "url": "https://www.independent.co.uk/travel/news-and-advice/irish-iraq-passenger-barred-us-b2107578.html", "urlToImage": "https://www.independent.ie/irish-news/news/ebe25/41787643.ece/AUTOCROP/w1240h700/Abood.jpg", "publishedAt": "2022-06-24T17:09:00Z", "content": "An Irishman has described the moment he was barred from boarding a flight to the US by American border officials, who he alleges said it was because he was born in Iraq.\r\nHurler Abood Al Jumaili, who… [+3272 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": null, "title": "'Like a superhero': US swimmer who fainted in pool finds peace, beauty in images of rescue - CNA", "description": "BUDAPEST: American artistic swimmer Anita Alvarez said she was \"shocked\" when she saw the \"beautiful\" AFP photographs showing her sinking unconscious to the bottom of the pool and being rescu", "url": "https://www.channelnewsasia.com/sport/us-swimmer-fainted-bottom-pool-anita-alvarez-photos-rescue-coach-2768631", "urlToImage": "https://onecms-res.cloudinary.com/image/upload/s--l0hao5Iv--/c_crop,h_430,w_765,x_3,y_81/fl_relative,g_south_east,l_one-cms:core:watermark:afp_watermark,w_0.1/f_auto,q_auto/c_fill,g_auto,h_676,w_1200/v1/one-cms/core/b0b2b80f14d5ec22125f91b4a40f07d78d6109de.jpg?itok=a1CRuoC9", "publishedAt": "2022-06-24T09:41:33Z", "content": "When she saw Alvarez sinking and lifeguards standing watching, coach Andrea Fuentes, dressed in shorts and a T-shirt, dived to the bottom of the pool and dragged Alvarez to the surface.\r\n\"It was a bi… [+1120 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Modeling historical biomass could be key to buffering climate change: Forests of American Midwest mapped to monitor carbon storage over millennia - Science Daily", "description": "A new study paints a vivid image of how forests developed over centuries and contribute to Earth's carbon balance -- a crucial component to maintaining a steady global climate. The study reconstructed the natural pace and pattern of carbon storage in forests …", "url": "https://www.sciencedaily.com/releases/2022/06/220623140539.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-06-23T18:00:00Z", "content": "When plants breathe in carbon from the atmosphere and store it in their leaves, branches, trunks and roots, they help the Earth maintain a carbon balance -- a crucial component to a steady climate.Wh… [+5506 chars]"}, {"source": {"id": null, "name": "Gamingonphone.com"}, "author": "Sagar Rangaraju", "title": "Hello Neighbor Diaries is the newest game in the popular IP, now available on Android - GamingonPhone", "description": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-ba", "url": "https://gamingonphone.com/news/hello-neighbor-diaries-popular-ip-available-on-android/", "urlToImage": "https://gamingonphone.com/wp-content/uploads/2022/06/helloneighbour_diaries_android.jpg", "publishedAt": "2022-06-23T17:00:44Z", "content": "Indie games have always managed to catch the attention of gamers for a long time. These small, yet very interesting games have become the go-to games for some people in the community. Now, American-b… [+1936 chars]"}]}