{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "CDC finds nearly 1 in 3 US youth have prediabetes, but experts question scant data - AP News", "description": "A new federal estimate shows that nearly 1 in 3 U.S. adolescents had prediabetes in 2023, far higher than a previous estimate of 1 in 5. The finding is spurring concerns about the health of America's children and also the way Trump administration officials ar…", "url": "https://apnews.com/article/prediabetes-cdc-adolescents-data-cf752de21856b2886450621d85d93370", "urlToImage": "https://dims.apnews.com/dims4/default/fb599dc/2147483647/strip/true/crop/5498x3093+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F28%2Ff0%2Fcb07a721494c487e8d6179fba93b%2Fe0895f6af9e345729547049627e3b9f7", "publishedAt": "2025-07-11T11:57:00Z", "content": "A new federal estimate shows a rise in prediabetes among American adolescents, a finding that is spurring concerns about the health of U.S. children and the way Trump administration health officials … [+5096 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, George Ramsay, Matias Grez", "title": "American Amanda Anisimova and Polish star Iga Świątek to face off in Wimbledon final on Saturday - CNN", "description": "The Wimbledon women’s semifinals are upon us as Amanda Anisimova upset Aryna Sabalenka to make her first grand slam final. Belinda Bencic will now play Iga Świątek for the other spot. Follow all the live updates on CNN Sports.", "url": "https://www.cnn.com/sport/live-news/wimbledon-semifinals-womens-spt", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/20250710-wimb.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-07-10T22:23:00Z", "content": "Despite her defeat to Amanda Anisimova, Aryna Sabalenka was in a slightly jovial mood during her post-match press conference.\r\nShe joked with reporters that she wouldnt make any headlines this time, … [+1232 chars]"}]}