{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "nbc-news", "name": "NBC News"}, "author": "The Associated Press", "title": "Pope Leo XIV closes 2025 Holy Year with critique of consumerism and xenophobia - NBC News", "description": "Pope Leo XIV on Tuesday closed out the Vatican’s 2025 Holy Year by denouncing today’s consumerist and anti-foreigner sentiment, capping a Jubilee that saw some 33 million pilgrims flock to Rome and a historic transition to the first American pontiff", "url": "https://www.nbcnews.com/world/pope-leo-xiv/pope-leo-xiv-closes-2025-holy-year-critique-consumerism-xenophobia-rcna252520", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-01/260106-pope-leo-rs-0050ec.jpg", "publishedAt": "2026-01-06T13:06:34Z", "content": "Pope Leo XIV on Tuesday closed out the Vaticans 2025 Holy Year by denouncing todays consumerist and anti-foreigner sentiment, capping a Jubilee that saw some 33 million pilgrims flock to Rome and a h… [+4262 chars]"}, {"source": {"id": null, "name": "House.gov"}, "author": null, "title": "Committee Releases Conferenced CJS, E&W, and Interior Bills - House Committee on Appropriations (.gov)", "description": "Washington, D.C. – Continuing its work to advance regular order and deliver results for the American people, the House Appropriations Committee today released the Commerce, Justice, Science; Energy and Water Development; and Interior and Environment Appropria…", "url": "http://appropriations.house.gov/news/press-releases/committee-releases-conferenced-cjs-ew-and-interior-bills", "urlToImage": "https://appropriations.house.gov/sites/evo-subsites/republicans-appropriations.house.gov/files/evo-media-image/preview-graphic.png", "publishedAt": "2026-01-05T15:12:48Z", "content": "Washington, D.C. Continuing its work to advance regular order and deliver results for the American people, the House Appropriations Committee today released the Commerce, Justice, Science; Energy and… [+3164 chars]"}]}