{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Flush With Cash, Saudi Prince Snubs Biden And Sends A Message - NDTV", "description": "President Joe Biden sounded deeply frustrated. Inflation was heading toward a 30-year high and Americans, rich and poor, could see the price of gasoline going up almost daily. Politically, oil was toxic for the White House.", "url": "https://www.ndtv.com/world-news/flush-with-cash-saudi-prince-snubs-biden-and-sends-a-message-2623074", "urlToImage": "https://c.ndtvimg.com/2021-11/hcqcmhlo_saudi-crown-prince-bloomberg_625x300_24_November_21.jpg", "publishedAt": "2021-11-24T11:49:17Z", "content": "The Saudi resurgence is linked to the world's thirst for fossil fuels.\r\nPresident Joe Biden sounded deeply frustrated. Inflation was heading toward a 30-year high and Americans, rich and poor, could … [+13038 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Indian rupee slips 12 paise to 74.54 against US dollar in early trade - Moneycontrol.com", "description": "At the interbank foreign exchange, the rupee opened on a weak note at 74.53, then lost further ground and touched 74.54 against the American dollar in initial deals, registering a decline of 12 paise from the last close.", "url": "https://www.moneycontrol.com/news/business/markets/indian-rupee-slips-12-paise-to-74-54-against-us-dollar-in-early-trade-7755341.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/08/rupee_dollar-770x433.jpg", "publishedAt": "2021-11-24T05:14:26Z", "content": "The Indian rupee depreciated by 12 paise to 74.54 against the US dollar in opening trade on Wednesday, tracking stronger American currency in the overseas market.\r\nAt the interbank foreign exchange, … [+1377 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Efficacy and safety of the CVnCoV SARS-CoV-2 mRNA vaccine candidate in ten countries in Europe and Latin America (HERALD): a randomised, observer-blinded, placebo-controlled, phase 2b/3 trial - The Lancet", "description": "CVnCoV was efficacious in the prevention of COVID-19 of any severity and had an acceptable\nsafety profile. Taking into account the changing environment, including the emergence\nof SARS-CoV-2 variants, and timelines for further development, the decision has be…", "url": "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00677-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/a10b0d67-6de1-4ee7-be6e-33794a3d1268/gr1.jpg", "publishedAt": "2021-11-23T23:31:01Z", "content": "We use cookies to help provide and enhance our service and tailor content and ads. To update your cookie settings, please visit the Cookie Preference Center for this site.Copyright © 2021 Elsevier In… [+157 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Jon Batiste leads Grammy nominations — Justin Bieber, Doja Cat, H.E.R. closely follow - CBC.ca", "description": "American musician and multi-genre performer scored the most nominations with 11, including an album of the year nod for We Are and record of the year with Freedom. Bieber, Doja Cat and H.E.R. each came away with the second-most nominations with eight each.", "url": "https://www.cbc.ca/news/entertainment/jon-batiste-grammy-nominations-bieber-doja-cat-her-1.6258437", "urlToImage": "https://i.cbc.ca/1.6259682.1637692389!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/jon-batiste.jpg", "publishedAt": "2021-11-23T22:32:00Z", "content": "Canadian musical talent was in the spotlight today at the nominations announcement for the 64th Grammy Awards, as some of the country's biggest hitmakers like Justin Bieber and Drake were named, as w… [+6904 chars]"}]}