{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "North America vulnerable to Russian and Chinese hypersonic weapons: NORAD commander - CTV News", "description": "North America has few options to defend against Russian and Chinese hypersonic weapons, which can manoeuvre while travelling more than five times the speed of sound. Potentially capable of carrying nuclear warheads, the U.S. is still trying to develop a simil…", "url": "https://www.ctvnews.ca/canada/north-america-vulnerable-to-russian-and-chinese-hypersonic-weapons-norad-commander-1.5825995", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5826006.1647652080!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-03-19T01:14:00Z", "content": "North America has few options to defend against Russian and Chinese hypersonic weapons, which can manoeuvre while travelling more than five times the speed of sound. Potentially capable of carrying n… [+8431 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Kyle Morris", "title": "Fauci warns Americans could face more lockdowns amid spread of new COVID-19 variant - Fox News", "description": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, warned Americans this week that they could soon face additional COVID-19 lockdown measures should a new strain of the virus cause case numbers to increase.", "url": "https://www.foxnews.com/politics/fauci-warns-americans-could-face-more-lockdowns-amid-spread-of-new-covid-19-variant", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/12/Fauci-Point.jpg", "publishedAt": "2022-03-19T00:48:15Z", "content": "Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, warned Americans this week that they could soon face additional COVID-19 lockdown measures should a new strai… [+3472 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Tucker Reals", "title": "James Hill identified as 2nd American killed by \"Putin's senseless war\" - CBS News", "description": "The sister of the Minnesota native killed amid Russian shelling in the city of Chernihiv tells CBS News he \"did not feel that the world would let this happen.\"", "url": "https://www.cbsnews.com/news/james-hill-us-citizen-killed-ukraine/", "urlToImage": "https://cbsnews2.cbsistatic.com/hub/i/r/2022/03/18/187279b7-ff26-4900-8a19-4dbc9e58fa92/thumbnail/1200x630/a8ea32f1ac9d806235bed764d34d21e8/james-hill-ukraine-kdka.jpg", "publishedAt": "2022-03-18T23:03:00Z", "content": "Russian forces have been blamed for the death of a second U.S. citizen in Ukraine. After the war broke out, Minnesota native James Hill remained in the besieged northeastern Ukrainian city of Chernih… [+4197 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Xi expected to urge Biden to promote Ukraine peace talks; warn against hurting Chinese interests: State media - The Star Online", "description": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is likely to have a warning or two for the American leader too.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/03/18/xi-expected-to-urge-biden-to-promote-ukraine-peace-talks-warn-against-hurting-chinese-interests-state-media", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/03/18/1519838.jpg", "publishedAt": "2022-03-18T12:35:00Z", "content": "BEIJING (The Straits Times/Asia News Network): US President Joe Biden will warn his Chinese counterpart Xi Jinping that Beijing's support of Russia's war in Ukraine will come with costs, but Xi is li… [+3289 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "NASA's big, new moon rocket begins rollout en route to launch pad tests - RNZ", "description": "America's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant for a final round of tests.<b></b>", "url": "https://www.rnz.co.nz/news/world/463568/nasa-s-big-new-moon-rocket-begins-rollout-en-route-to-launch-pad-tests", "urlToImage": "https://www.rnz.co.nz/assets/news_crops/140242/eight_col_000_326E24H.jpg?1647567662", "publishedAt": "2022-03-18T02:46:53Z", "content": "NASA's next-generation moon rocket began a highly anticipated, slow-motion journey out of its assembly plant en route to the launch pad in Florida on Thursday for a final round of tests in the coming… [+4732 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Borrowing gets more expensive for Americans - ABC News", "description": "The Federal Reserve hiked interest rates to curb rising inflation. This means that the cost of taking out loans or mortgages will be higher for Americans.SUB...", "url": "https://www.youtube.com/watch?v=Q0rDtRTCuJY", "urlToImage": "https://i.ytimg.com/vi/Q0rDtRTCuJY/hqdefault.jpg", "publishedAt": "2022-03-17T22:56:22Z", "content": null}]}