{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Katie Wadington", "title": "Government shutdown impacts: air travel to taxes, national security to national parks - The Hill", "description": "How would a government shutdown affect the lives of everyday Americans? Some benefits, like Social Security and those for veterans, go on unimpeded. But other services, such as assistance at the IRS or access to national parks, will come to a halt. Federal em…", "url": "https://thehill.com/homenews/4229923-government-shutdown-impacts/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2022/10/capitol_dome_budget_08122022_AP22269627549381.png?w=1280", "publishedAt": "2023-09-30T12:00:00Z", "content": "Skip to content\r\nHow would a government shutdown affect the lives of everyday Americans? Some benefits, like Social Security and those for veterans, go on unimpeded. But other services, such as assis… [+3804 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "AP", "title": "President Joe Biden says US shutdown isn't his fault. Will Americans agree? | Mint - Mint", "description": "The White House is aiming to shift blame for a potential government shutdown onto House Republicans as the deadline approaches. President Joe Biden and his advisers are hoping that the rest of the country will see the GOP as responsible for the funding packag…", "url": "https://www.livemint.com/news/world/president-joe-biden-says-us-shutdown-isnt-his-fault-will-americans-agree-11696048190787.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/09/30/1600x900/Biden-Shutdown-Politics-0_1696048588335_1696048646539.jpg", "publishedAt": "2023-09-30T04:41:11Z", "content": "Staring down a likely government shutdown, the White House wants to make sure any blame falls at the other end of Pennsylvania Avenue specifically on House Republicans. After all, it's House Republic… [+6842 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "United Auto Workers strike expands against Ford and GM - NBC News", "description": "More United Auto Workers are walking off the job as the union expands its strike against two of America’s big three car manufacturers. NBC News’ Jesse Kirsch...", "url": "https://www.youtube.com/watch?v=17g0u08vLic", "urlToImage": "https://i.ytimg.com/vi/17g0u08vLic/maxresdefault.jpg", "publishedAt": "2023-09-30T00:30:00Z", "content": null}]}