{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Shares Largest-Ever Image Of Andromeda Galaxy, Internet Calls It \"Extraordinarily Beautiful\" - NDTV", "description": "American space agency NASA on Sunday shared the \"largest-ever\" image assembled of the Andromeda galaxy by the Hubble Space Telescope. The picture was captured seven years ago and it is the sharpest large composite image ever taken of the galaxy.", "url": "https://www.ndtv.com/world-news/nasa-shares-largest-ever-image-of-andromeda-galaxy-internet-calls-it-extraordinarily-beautiful-3214258", "urlToImage": "https://c.ndtvimg.com/2022-08/rijp3gl8_andromeda-galaxy_625x300_01_August_22.jpg", "publishedAt": "2022-08-02T02:40:00Z", "content": "Image shows the 48,000-light-year-long stretch of the Andromeda galaxy.\r\nAmerican space agency NASA on Sunday shared the \"largest-ever\" image assembled of the Andromeda galaxy by the Hubble Space Tel… [+1904 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "U.S. drone strike kills al-Qaeda leader Ayman al-Zawahri, sources say - CBC News", "description": "A U.S. drone strike in Afghanistan this weekend killed Ayman al-Zawahri, who took over as al-Qaeda leader after Osama bin Laden's death in a U.S. raid in 2011, President Joe Biden confirmed Monday, 11 months after American troops left the country following a …", "url": "https://www.cbc.ca/news/world/biden-ayman-al-zawahri-drone-strike-1.6538222", "urlToImage": "https://i.cbc.ca/1.6538299.1659398592!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/biden-afghanistan.jpg", "publishedAt": "2022-08-01T23:20:45Z", "content": "A U.S. drone strike in Afghanistan this weekend killed Ayman al-Zawahri, who took over as al-Qaeda leader after Osama bin Laden's death in an airstrike in 2011, President Joe Biden confirmed Monday, … [+5021 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Logan Plant", "title": "Sega Genesis Mini 2 North American Release Will Be a Tenth of the Original - IGN - IGN", "description": "If you want a Sega Genesis Mini 2, you'll strangely have to turn to Amazon Japan, as western customers will have to import Sega's next mini console.", "url": "https://www.ign.com/articles/sega-genesis-mini-2-north-american-release-will-be-a-tenth-of-the-original", "urlToImage": "https://assets-prd.ignimgs.com/2022/08/01/segacd-1654266796927-1659388306914.jpg?width=1280", "publishedAt": "2022-08-01T21:55:45Z", "content": "If you want a Sega Genesis Mini 2, you'll have to turn to Amazon Japan, as western customers will have to import Sega's next mini console. \r\nAccording to a report from Polygon, Sega is only selling t… [+1597 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd and Maegan Vazquez, CNN", "title": "White House warns China against escalations over Pelosi's potential trip to Taiwan - CNN", "description": "Biden administration officials are warning China not to take escalatory actions amid House Speaker Nancy Pelosi's prospective trip to Taiwan, emphasizing that the potential visit would not mark a shift in American foreign policy.", "url": "https://www.cnn.com/2022/08/01/politics/biden-administration-pelosi-china-taiwan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729114922-03-pelosi-visit-taiwan-super-tease.jpg", "publishedAt": "2022-08-01T21:14:00Z", "content": "(CNN)Biden administration officials are warning China not to take escalatory actions amid House Speaker Nancy Pelosi's prospective trip to Taiwan, emphasizing that the potential visit would not mark … [+3639 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Stacy Liberatore", "title": "Humans settled in North America 17,000 years EARLIER than previously believed, study finds - Daily Mail", "description": "The bones were found with slaughter marks and fractures that were made by humans 37,000 years ago. Scientists extracted collagen from the bones, allowing them to date the settlement.", "url": "https://www.dailymail.co.uk/sciencetech/article-11070001/Humans-settled-North-America-17-000-years-EARLIER-previously-believed-study-finds.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/01/19/60951645-0-image-a-26_1659377576586.jpg", "publishedAt": "2022-08-01T18:26:17Z", "content": "Bones of an adult mammoth and her calf have been uncovered at a 37,000-year-old butchering site in New Mexico, which suggest humans settled in North America 17,000 years than previously believed.\r\nA … [+4617 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID Variants with Dr. Javier Guzman - CGTN America", "description": "Globally, one of the biggest challenges to curbing the spread of COVID is making sure there's equal access to vaccines, said Dr. Javier Guzman, the director ...", "url": "https://www.youtube.com/watch?v=pCwJ7MQZAGA", "urlToImage": "https://i.ytimg.com/vi/pCwJ7MQZAGA/maxresdefault.jpg", "publishedAt": "2022-07-30T22:00:09Z", "content": null}]}