{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Health News Roundup: COVID-19 infections dropping throughout the Americas, more vaccine needed, says health agency; WHO backs malaria vaccine rollout for Africa's children in major breakthrough and more - Devdiscourse", "description": "It was the first instance of a regulatory agency pledging to look into misdeeds at Prevent Senior, a major healthcare chain serving tens of thousands of patients in the Sao Paulo area.  Booster shot improves immune response of chemotherapy patients; post-COVI…", "url": "https://www.devdiscourse.com/article/health/1758987-health-news-roundup-covid-19-infections-dropping-throughout-the-americas-more-vaccine-needed-says-health-agency-who-backs", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/30_09_2021_12_33_54_3812897.jpg?width=920&format=jpeg", "publishedAt": "2021-10-07T05:00:05Z", "content": "Following is a summary of current health news briefs.\r\nCOVID-19 infections dropping throughout the Americas, more vaccine needed, says health agency\r\nThe number of new COVID-19 infections has been dr… [+5047 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Mike Stobbe", "title": "More than 120,000 US kids had caregivers die during pandemic - Associated Press", "description": "NEW YORK (AP) — The number of U.S. children orphaned during the COVID-19 pandemic may be larger than previously estimated, and the toll has been far greater among Black and Hispanic Americans, a new study suggests.", "url": "https://apnews.com/article/coronavirus-pandemic-science-pandemics-covid-19-pandemic-race-and-ethnicity-72ab35ef81250e5007f5674d7e0af73d", "urlToImage": "https://storage.googleapis.com/afs-prod/media/bbd5a15bb4b34cc2a726a0f36a0a2cc7/3000.jpeg", "publishedAt": "2021-10-07T04:19:51Z", "content": "NEW YORK (AP) The number of U.S. children orphaned during the COVID-19 pandemic may be larger than previously estimated, and the toll has been far greater among Black and Hispanic Americans, a new st… [+3600 chars]"}]}