{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Ideal cardiovascular health can help people live longer, finds Chinese Medical Journal study - EurekAlert", "description": "The American Heart Association defines ideal cardiovascular health (ICH) based on seven behavioral and clinical factors. However, its association with mortality in Asians is unclear. Pooling data from almost 200,000 individuals, a recent study examined the re…", "url": "https://www.eurekalert.org/news-releases/978793", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/42c32f9b-5843-4af9-ac3b-feffb4924ee8/Rendition/thumbnail/Content/Public", "publishedAt": "2023-02-07T02:00:04Z", "content": "image: The article described 3 studies done in China and shows that maintaining cardiovascular health could result in lower mortalityview more \r\nCredit: Chinese Medical Journal\r\nCardiovascular diseas… [+4365 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Mansur Shaheen", "title": "Taking vitamin D supplements could drag 17million Americans and Brits back from brink of diabetes - Daily Mail", "description": "In a meta-analysis of 17 studies, Tufts University researchers found that pre-diabetics could reduce their likelihood of developing the potentially-crippling condition by 15 percent.", "url": "https://www.dailymail.co.uk/health/article-11719037/Taking-vitamin-D-supplements-drag-17million-Americans-Brits-brink-diabetes.html", "urlToImage": "https://i.dailymail.co.uk/1s/2023/02/06/21/67390067-0-image-a-3_1675717228250.jpg", "publishedAt": "2023-02-06T20:56:53Z", "content": "A vitamin D supplement every day can help keep diabetes away, a study suggests.\r\nIn a meta-analysis of 17 studies, Tufts University researchers found that pre-diabetics could reduce their likelihood … [+4859 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Balloon sighted over Latin America is from China, Beijing says - Al Jazeera English", "description": "Chinese foreign ministry says balloon spotted over Colombia is of a ‘civilian nature and used for flight tests’.", "url": "https://www.aljazeera.com/news/2023/2/6/balloon-sighted-over-latin-america-is-from-china-beijing-says", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2023/02/000_338F4KZ.jpg?resize=1920%2C1284", "publishedAt": "2023-02-06T18:13:09Z", "content": "Beijing has confirmed that a balloon spotted flying over Latin America is Chinese, two days after the United States shot down a similar device that American officials described as a spy balloon.\r\nChi… [+5868 chars]"}, {"source": {"id": null, "name": "Fronterasdesk.org"}, "author": null, "title": "The World Health Organization decided to rename monkeypox. Here's why - Fronteras: The Changing America Desk", "description": "As the world began to catch its breath from the COVID-19 pandemic, an outbreak of monkeypox swept the globe — and headlines — in 2022. While health care providers battled the virus itself, another battle over its name arose.By the end of the year, the World H…", "url": "https://fronterasdesk.org/content/1837786/world-health-organization-decided-rename-monkeypox-heres-why", "urlToImage": "https://media.kjzz.org/s3fs-public/mpox-define-20220205.jpg", "publishedAt": "2023-02-06T11:59:04Z", "content": "As the world began to catch its breath from the COVID-19 pandemic, an outbreak of monkeypox swept the globe and headlines in 2022. While health care providers battled the virus itself, another battle… [+4292 chars]"}]}