{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Shoots Down Suspected Chinese Spy Balloon Off Carolina Coast - NDTV", "description": "The US today shot down a Chinese balloon off the country's east coast, American media reported, hours after President Joe Biden vowed to \"take care\" of the suspected spy device.", "url": "https://www.ndtv.com/world-news/us-shoots-down-suspected-chinese-spy-balloon-off-carolina-coast-reports-3754078", "urlToImage": "https://c.ndtvimg.com/2023-02/v6lsioag_chinese-spy-balloon-over-us_625x300_03_February_23.jpg", "publishedAt": "2023-02-04T20:26:00Z", "content": "New Delhi: The United States today shot down a suspected Chinese spy balloon off the country's east coast, the Pentagon said. Earlier this week, US had claimed that the balloon was spying on sensitiv… [+1390 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brittany Kasko", "title": "5 simple ways to help prevent heart disease this year - Fox News", "description": "Heart disease is the leading cause of death among Americans. Here are some simple, easy health tips for how to help prevent heart disease and reduce the risks in 2023.", "url": "https://www.foxnews.com/lifestyle/5-simple-ways-help-prevent-heart-disease-year", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/01/heart-split3.jpg", "publishedAt": "2023-02-03T17:29:00Z", "content": "Heart disease is the leading cause of death among Americans, according to the CDC. \r\nMany Americans as February gets underway are still looking to incorporate healthier practices into their daily rou… [+4961 chars]"}, {"source": {"id": null, "name": "Patientcareonline.com"}, "author": "Sydney Jennings", "title": "Long COVID in the US: By the Numbers - Patient Care Online", "description": "How many Americans report having long COVID symptoms? Which demographics is long COVID more prevalent in? A new analysis sheds light.", "url": "https://www.patientcareonline.com/view/long-covid-in-the-us-by-the-numbers", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/patientcare/489a9ce1fd6d062c0e93bd9883679775410c3633-1248x720.jpg?fit=crop&auto=format", "publishedAt": "2023-02-03T16:28:41Z", "content": "Reports of previously healthy individuals experiencing lingering symptoms from an infection with SARS-CoV-2 started shortly after the beginning of the COVID-19 pandemic. Post-COVID conditions, or lon… [+1176 chars]"}]}