{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris", "title": "'We're doing everything we can to survive': As the US looks to move on from Covid-19, high-risk and disabled Americans feel forgotten - CNN", "description": "Tasha Nelson's 10-year-old son held back tears when he heard the news. The two were in the car when the announcement came through the radio: Virginia's freshly sworn-in governor had signed an order attempting to ban mask mandates in schools.", "url": "https://www.cnn.com/2022/02/20/us/immunocompromised-high-risk-americans-covid-measures-forgotten/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220219150641-immunocompromised-covid-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-02-20T17:24:00Z", "content": "Tasha Nelsons 10-year-old son held back tears when he heard the news. The two were in the car when the announcement came through the radio: Virginias freshly sworn-in governor had signed an order att… [+10741 chars]"}, {"source": {"id": null, "name": "Centralia Chronicle"}, "author": "Amanda Zhou / The Seattle Times", "title": "Plant Fossils Found in San Juan Islands Like 'Finding a Penguin in North America' - Centralia Chronicle", "description": "Fossilized plants discovered in the San Juan Islands have some paleobotanists scratching their heads.  The mystery centers on two fossilized winged fruits discovered by fossil hunters on Sucia  &hellip;", "url": "https://www.chronline.com/stories/plant-fossils-found-in-san-juan-islands-like-finding-a-penguin-in-north-america,284823", "urlToImage": "https://cdn5.creativecirclemedia.com/lafromboise/original/20220218-193324-Screen%20Shot%202022-02-18%20at%207.32.53%20PM.jpg", "publishedAt": "2022-02-19T03:34:51Z", "content": "Fossilized plants discovered in the San Juan Islands have some paleobotanists scratching their heads.\r\nThe mystery centers on two fossilized winged fruits discovered by fossil hunters on Sucia Island… [+2202 chars]"}]}