{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "STAT"}, "author": "Tara Bannow", "title": "Major health insurer group says members will continue to cover vaccines, a step that may ease anxiety over access - statnews.com", "description": "Amid concern about Americans’ access to vaccines, a major health insurance association said member plans will continue to cover all shots recommended by the ACIP.", "url": "https://www.statnews.com/2025/09/17/ahip-vaccine-insurance-acip-coverage/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2025/09/Vaccine_BandAid-1024x576.jpg", "publishedAt": "2025-09-17T13:52:45Z", "content": "Amid growing concern about Americans access to vaccines, the countrys biggest health insurance association said its member plans will continue to cover all shots recommended by a federal advisory com… [+3532 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Hillel Italie", "title": "Robert Redford remembered for his deep legacy in environmental activism and Native American advocacy - AP News", "description": "Robert Redford, who died Tuesday at 89, was known for his deep commitment to activism, especially for Native American rights and the environment. In the 1970s, while starring in films like “The Sting,” he became involved in the environmental movement. He succ…", "url": "https://apnews.com/article/robert-redford-activism-463aa0494ead81081cba6caefffb9047", "urlToImage": "https://dims.apnews.com/dims4/default/8cda4ad/2147483647/strip/true/crop/2962x1666+0+154/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F85%2Ff5%2Ff8df2a360ced41955d1d5f7a4a4d%2F56b09784698c49389b8161ed86cd5202", "publishedAt": "2025-09-17T05:34:00Z", "content": "NEW YORK (AP) Lorie Lee Sekayumptewa, a former administrator with the Navajo Nation Film Office, remembers seeing Robert Redford at traditional cultural dances at the Hopi village of Hotevilla in New… [+5136 chars]"}]}