{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Najim Rahim, Mike Ives", "title": "Attack in Afghanistan Kills 10 Workers From Mine-Clearing Charity - The New York Times", "description": "The government blamed the Taliban for the attack on the British-American charity, the HALO Trust. The militant group denied any responsibility.", "url": "https://www.nytimes.com/2021/06/09/world/asia/afghanistan-land-mines-halo-trust.html", "urlToImage": "https://static01.nyt.com/images/2021/06/09/world/09xp-afghanistan/09xp-afghanistan-facebookJumbo.jpg", "publishedAt": "2021-06-09T05:51:45Z", "content": "Washingtons peace envoy to Afghanistan, Zalmay Khalilzad, finished a four-day visit to Kabul on Tuesday. Mr. Khalilzad is an Afghan-born American diplomat who led negotiations ahead of the Trump admi… [+1830 chars]"}, {"source": {"id": null, "name": "TODAY"}, "author": "Samantha Kubota", "title": "‘AGT’ judges floored by cancer patient’s gold buzzer performance — watch the video - Today.com", "description": "Talented singer Nightbirde got her big break on Tuesday when “America’s Got Talent” judge Simon Cowell pushed the coveted golden buzzer for her performance, sending her through to the next round.", "url": "https://www.today.com/popculture/agt-judges-floored-cancer-patient-s-gold-buzzer-performance-watch-t221381", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_social_share_1200x630_center,f_auto,q_auto:best/newscms/2021_23/1729638/cancer-patient-agt-today-main-210608.jpg", "publishedAt": "2021-06-09T03:09:00Z", "content": "A talented singer got her big break on Tuesday when Americas Got Talent judge Simon Cowell pushed the coveted golden buzzer for her performance, sending her through to the next round.\r\nBut it wasnt j… [+1927 chars]"}, {"source": {"id": null, "name": "TVLine"}, "author": "Andy Swift", "title": "'AGT' Auditions Recap: Watch Nightbirde Win Golden Buzzer [VIDEO] - TVLine", "description": "RELATED STORIES America's Got Talent Premiere: Who Got the First Golden Buzzer of Season 16? New Amsterdam Stars, EP Talk Finale's Big 'Sharpwin' [Spoiler] and Max's Surprising Voicemail -- Watch Video America’s Got Talent saved its best audition for last on …", "url": "https://tvline.com/2021/06/08/agt-auditions-recap-nightbirde-golden-buzzer-video/", "urlToImage": "https://tvline.com/wp-content/uploads/2021/06/agt-recap-week-2.jpg?w=620", "publishedAt": "2021-06-09T02:00:00Z", "content": "America’s Got Talent saved its best audition for last on Tuesday with a Golden Buzzer recipient who managed to accomplish the impossible — forcing Simon Cowell to display genuine emotion.\r\nThe two-ho… [+2840 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US State Offers Free Marijuana To Encourage Covid Vaccination - NDTV", "description": "US' Washington is offering \"joints for jabs,\" in the latest innovative bid to get more Americans vaccinated against Covid-19 as inoculation rates continue to slow.", "url": "https://www.ndtv.com/world-news/us-washington-state-offers-free-marijuana-to-encourage-covid-vaccination-2459499", "urlToImage": "https://c.ndtvimg.com/2021-06/gdk2ncug_us-vaccination-center-650_625x300_09_June_21.jpeg", "publishedAt": "2021-06-08T20:20:36Z", "content": "\"Joints for jabs\" are being offered in US' Washington state. (Representational)\r\nLos Angeles, United States: The US state of Washington is offering \"joints for jabs,\" in the latest innovative bid to … [+1648 chars]"}]}