{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Pens, Pencils, and Debunking Myths: How NASA Takes Notes in Space - SciTechDaily", "description": "The Space Pen has captured the American imagination in more ways than one. It’s appeared repeatedly in pop culture and even worked as a plot device in a \"Seinfeld\" episode titled \"The Pen,\" and in 2021 was inducted into the Space Technology Hall of Fame. It’s…", "url": "https://scitechdaily.com/space-pens-pencils-and-debunking-myths-how-nasa-takes-notes-in-space/", "urlToImage": "https://scitechdaily.com/images/NASA-astronaut-Walter-Cunningham-Writes-With-Fisher-Space-Pen.jpg", "publishedAt": "2021-08-29T19:11:49Z", "content": "ByMike DiCicco and Naomi Seck, NASA SpinoffAugust 29, 2021\r\nNASA astronaut Walter Cunningham writes with a Fisher Space Pen during the flight of Apollo 7, the first crewed Apollo flight and the Space… [+5721 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Kathy Gannon, Lolita C. Baldor, Tameem Akhgar and Jon Gambrell", "title": "U.S. says drone kills ISIS bombers targeting Kabul airport - CTV News", "description": "A U.S. drone strike blew up a vehicle carrying 'multiple suicide bombers' from Afghanistan's Islamic State affiliate on Sunday before they could attack the ongoing military evacuation at Kabul's international airport, American officials said. An Afghan offici…", "url": "https://www.ctvnews.ca/world/u-s-says-drone-kills-isis-bombers-targeting-kabul-airport-1.5565733", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5565894.1630266242!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-08-29T14:33:00Z", "content": "KABUL, AFGHANISTAN -- \r\nA U.S. drone strike blew up a vehicle carrying \"multiple suicide bombers\" from Afghanistan's Islamic State affiliate on Sunday before they could attack the ongoing military ev… [+7138 chars]"}, {"source": {"id": null, "name": "Japan Today"}, "author": null, "title": "Pregnant or worried about infertility? Get vaccinated against COVID-19 - Japan Today", "description": "As the Delta variant of SARS-CoV-2 surges across the U.S., almost 1 in 5 Americans continue to resist getting shots that are widely available, safe and effective – particularly for preventing the most severe outcomes of the virus. While people have many diffe…", "url": "https://japantoday.com/category/features/health/pregnant-or-worried-about-infertility-get-vaccinated-against-covid-19", "urlToImage": null, "publishedAt": "2021-08-28T21:06:53Z", "content": "As the Delta variant of SARS-CoV-2 surges across the U.S., almost 1 in 5 Americans continue to resist getting shots that are widely available, safe and effective particularly for preventing the most … [+6797 chars]"}, {"source": {"id": null, "name": "The Sportsrush"}, "author": "Amulya Shekhar", "title": "\"Cristiano Ronaldo returning to Manchester United is like Michael Jordan returning to Chicago Bulls\": Michael... - The Sportsrush", "description": "Michael Wilbon might be an American, but even he understands the gravity of Cristiano Ronaldo returning to Manchester United. Cristiano is the prodigal son whom Sir Alex Ferguson let go from Old Trafford to Madrid, against his wishes. We've been hearing rumor…", "url": "https://thesportsrush.com/nba-news-cristiano-ronaldo-returning-to-manchester-united-is-like-michael-jordan-returning-to-chicago-bulls-michael-wilbon-can-barely-contain-his-excitement-over-5-time-ballon-dor-winners-mov/", "urlToImage": "https://cdn-wp.thesportsrush.com/2021/08/1876ada8-untitled-design-34.jpg", "publishedAt": "2021-08-28T19:00:51Z", "content": "Michael Wilbon might be an American, but even he understands the gravity of Cristiano Ronaldo returning to Manchester United.\r\nCristiano is the prodigal son whom Sir Alex Ferguson let go from Old Tra… [+1859 chars]"}]}