{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Richard Luscombe", "title": "DeSantis criticized for sending migrants to Martha’s Vineyard: ‘It’s un-American’ - The Guardian US", "description": "Democrats outraged at the ‘reckless’ and ‘soulless’ actions and question the legality of what some called a political stunt", "url": "https://amp.theguardian.com/us-news/2022/sep/16/migrants-marthas-vineyard-desantis-biden-democrats-criticism", "urlToImage": null, "publishedAt": "2022-09-16T17:52:00Z", "content": "US immigrationDemocrats outraged at the reckless and soulless actions and question the legality of what some called a political stunt\r\nJoe Biden has accused Ron DeSantis of playing politics with peop… [+7069 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Michaela Zee", "title": "‘Monster’ Trailer: Evan Peters Embodies Jeffrey Dahmer in Ryan Murphy’s Latest Netflix Series - Variety", "description": "Popular on Variety Netflix has released the official trailer of Ryan Murphy’s true crime series “Dahmer – Monster: The Jeffrey Dahmer Story,” starring “American Horror Story” alum Evan Peters in the titular role. The 10-episode limited series follows the stor…", "url": "https://variety.com/2022/tv/news/monster-trailer-evan-peters-jeffrey-dahmer-ryan-murphy-1235351394/", "urlToImage": "https://variety.com/wp-content/uploads/2022/09/Monster-Evan-Peters-Jeffrey-Dahmer.jpg?w=1000", "publishedAt": "2022-09-16T14:01:00Z", "content": "Netflix has released the official trailer of Ryan Murphy’s true crime series “Dahmer – Monster: The Jeffrey Dahmer Story,” starring “American Horror Story” alum Evan Peters in the titular role. \r\nThe… [+1514 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": null, "title": "Nigerian Government Confers Citizenship On 286 Americans, Britons, Lebanese, Others, Demands Loyalty - SaharaReporters.com", "description": "The Nigerian government has conferred Nigerian citizenship rights on 286 persons from the United States of America, Britain, Lebanon, Egypt, Syria, Italy and Palestine. Out of the 286 foreign nationals presented with certificates of Nigerian Citizenship on Th…", "url": "https://saharareporters.com/2022/09/15/nigerian-government-confers-citizenship-286-americans-britons-lebanese-others-demands", "urlToImage": null, "publishedAt": "2022-09-15T20:14:51Z", "content": "The Nigerian government has conferred Nigerian citizenship rights on 286 persons from the United States of America, Britain, Lebanon, Egypt, Syria, Italy and Palestine.Out of the 286 foreign national… [+2796 chars]"}]}