{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Indian tectonic plate is breaking into two. It's happening beneath Tibet - India Today", "description": "This revelation was presented at the American Geophysical Union conference in San Francisco and offers a fresh perspective on the colossal Himalayan mountain range's formation.", "url": "https://www.indiatoday.in/science/story/indian-tectonic-plate-is-breaking-into-two-its-happening-beneath-tibet-2489741-2024-01-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202401/himalayas-1710374-16x9_0.jpg?VersionId=yC0owe0Ubq5Ywu7ZjOO2n_k3P491GFzD", "publishedAt": "2024-01-17T06:10:53Z", "content": "In a new discovery that could reshape our understanding of the forces shaping the Earth's highest mountains, researchers have unveiled new seismic data indicating that the Indian tectonic plate is sp… [+2578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Vivek Ramaswamy Dropped Out Of US Presidential Race And Endorsed Trump - NDTV", "description": "Indian-American Republican entrepreneur Vivek Ramaswamy on Tuesday announced he would be pulling out of the 2024 presidential race and will endorse former president Donald Trump, who registered a landslide victory in the Iowa caucus.", "url": "https://www.ndtv.com/world-news/explained-why-vivek-ramaswamy-quit-2024-us-presidential-race-4877438", "urlToImage": "https://c.ndtvimg.com/2023-12/7t9l89g_vivek-ramaswamy-afp_625x300_20_December_23.jpeg", "publishedAt": "2024-01-17T02:34:34Z", "content": "The 38-year-old, who has never held elective office, was self-funding his campaign.\r\nIndian-American Republican entrepreneur Vivek Ramaswamy on Tuesday announced he would be pulling out of the 2024 p… [+2195 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Indian-American Preesha Chakraborty named world's brightest by Johns Hopkins Centre | Mint - Mint", "description": "Preesha Chakraborty, a nine-year-old Indian-American schoolgirl, has been named one of the world's brightest students by the Johns Hopkins Centre for Talented Youth.", "url": "https://www.livemint.com/news/trends/indianamerican-preesha-chakraborty-named-worlds-brightest-by-johns-hopkins-centre-11705366343366.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/01/16/1600x900/PTI01-15-2024-000209B-0_1705366856466_1705366917665.jpg", "publishedAt": "2024-01-16T01:09:28Z", "content": "Preesha Chakraborty, a nine-year-old Indian-American schoolgirl, has been named in the \"worlds brightest\" students list by the Johns Hopkins Centre for Talented Youth, based on the results of above-g… [+3166 chars]"}]}