{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cash-Strapped Pakistan Urges US To Restore Military Financing, Sales - NDTV", "description": "Cash-strapped Pakistan urged the United States to restore military financing and sales, which was earlier suspended by Former America President Donald Trump, according to Dawn.", "url": "https://www.ndtv.com/world-news/cash-strapped-pakistan-urges-us-to-restore-military-financing-sales-3989707", "urlToImage": "https://i.ndtvimg.com/i/2016-06/pakistan-us-flag-reuters-650_650x400_81465912707.jpg", "publishedAt": "2023-04-29T00:35:06Z", "content": "Pakistan's military financing was suspended by Former America President Donald Trump.\r\nWashington: Cash-strapped Pakistan urged the United States to restore military financing and sales, which was ea… [+2353 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Liz Friden, Adam Sabes", "title": "US government begins land evacuation of American civilians in Sudan: Official - Fox News", "description": "The United States government has begun a land-based evacuation of American civilians who are in Sudan amid a growing civil conflict in the country.", "url": "https://www.foxnews.com/world/u-s-government-begins-land-evacuation-of-american-civilians-sudan-official", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/AP23116813450233.jpg", "publishedAt": "2023-04-28T21:33:00Z", "content": "The United States government has begun a land evacuation of American civilians who are in Sudan amid a growing civil conflict.\r\nA U.S. official told Fox News that there's an ongoing effort to bus a l… [+629 chars]"}, {"source": {"id": null, "name": "Koimoi"}, "author": "IANS", "title": "Ponniyin Selvan 2: Chiyaan Vikram, Karthi Express Disappointment On Absence Of India’s Indigenous Empires In School Textbooks, Former Says, “At That Time, America Wasn’t Even Discovered…” - Koimoi", "description": "Actress Aishwarya Lekshmi and actor Vikram and Karthi, whose period film 'Ponniyin Selvan: 2' released in theatres on Friday, feel that a certain", "url": "https://www.koimoi.com/?p=983032", "urlToImage": "https://static-koimoi.akamaized.net/wp-content/new-galleries/2023/04/ps2-actors-feel-school-level-history-has-been-unfair-to-indigenous-empires-01.jpg", "publishedAt": "2023-04-28T18:57:00Z", "content": "Ponniyin Selvan 2: Chiyaan Vikram, Karthi Express Disappointment On Absence Of India’s Indigenous Empires In School Textbooks ( Photo Credit IANS )\r\nActress Aishwarya Lekshmi and actor Chiyaan Vikram… [+1953 chars]"}]}