{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MATTHEW LEE, JUSTIN SPIKE, BARRY HATTON", "title": "Top Russian and American officials will hold talks on ending the Ukraine war without Kyiv - The Associated Press", "description": "The Kremlin says senior American and Russian officials will hold talks on improving their ties and negotiating an end to the war in Ukraine. It would be the most significant meeting between the sides since Moscow’s full-scale invasion of its neighbor nearly t…", "url": "https://apnews.com/article/russia-ukraine-war-us-saudi-talks-0c7f21c2125c97fd0a1f6459eebeb65b", "urlToImage": "https://dims.apnews.com/dims4/default/582ff4d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa8%2Fca%2F6ba3d2c960ef29ab904800e7ebe7%2F9ed4b9f8d51d4d528b559bf8687ad6dc", "publishedAt": "2025-02-17T16:15:00Z", "content": "RIYADH, Saudi Arabia (AP) Senior American and Russian officials, including the countries top diplomats, will hold talks on improving their ties and negotiating an end to the war in Ukraine, officials… [+7237 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ramishah Maruf", "title": "What’s open and closed on Presidents Day - CNN", "description": "Many Americans enjoy a day off on the third Monday of February every year. That’s because it’s Presidents Day, officially named Washington’s Birthday in honor of America’s first president, George Washington (his actual birthday is February 22).", "url": "https://www.cnn.com/2025/02/17/business/presidents-day-open-closed/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-1244106399.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-17T15:44:00Z", "content": "Many Americans enjoy a day off on the third Monday of February every year. Thats because its Presidents Day, officially named Washingtons Birthday in honor of Americas first president, George Washing… [+1110 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": "Oriana Pawlyk", "title": "Musk’s SpaceX team visiting key FAA command center — despite past frictions - POLITICO", "description": "Transportation Secretary Sean Duffy said he hopes \"the brightest minds in America\" will help improve the nation's air traffic system.", "url": "https://www.politico.com/news/2025/02/17/elon-musk-spacex-faa-visit-00204577", "urlToImage": "https://static.politico.com/68/2c/b8864a5e460bb13d32d49114899f/aptopix-election-2024-trump-09224.jpg", "publishedAt": "2025-02-17T11:05:28Z", "content": "The Warrenton, Virginia, facility is considered a nerve center\r\n for the FAA, dictating plans for air traffic, space launches and monitoring for weather, among other crucial roles. Mondays visit come… [+1539 chars]"}]}