{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sarah Fortinsky", "title": "France summons US Ambassador Kushner over allegations concerning antisemitism - The Hill", "description": "France will summon U.S. Ambassador Charles Kushner to its foreign ministry on Monday after the American diplomat levied sharp allegations against his host country over its “lack of sufficient action” in response to the rise of antisemitism. The French Ministr…", "url": "https://thehill.com/policy/international/5468292-kushner-alleges-french-antisemitism/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/11/AP24335672034690-1-e1732993594521.jpg?w=1280", "publishedAt": "2025-08-25T01:40:00Z", "content": "Skip to content\r\nFrance will summon U.S. Ambassador Charles Kushner to its foreign ministry on Monday after the American diplomat levied sharp allegations against his host country over its “lack of s… [+3020 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": null, "title": "Flesh-eating screwworm parasite detected in person in US for first time - Sky News", "description": "The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year.", "url": "https://news.sky.com/story/flesh-eating-screwworm-parasite-detected-in-person-in-us-for-first-time-13418013", "urlToImage": "https://e3.365dm.com/25/08/1600x900/skynews-screw-worm_7000663.jpg?20250825001602", "publishedAt": "2025-08-25T00:07:22Z", "content": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time.\r\nThe parasitic flies eat cattle and other warm-blooded animals alive, with an outb… [+2718 chars]"}, {"source": {"id": null, "name": "Futurism"}, "author": "Noor Al-Sibai", "title": "RFK Jr. Cancels Promising Work on Cancer Vaccine - Futurism", "description": "Robert F. Kennedy, Jr. is abandoning a massive American asset by canceling research into mRNA vaccines, which will soon cover cancer.", "url": "https://futurism.com/neoscope/rfk-jr-cancels-cancer-vaccine-mrna", "urlToImage": "https://wordpress-assets.futurism.com/2025/08/rfk-jr-cancels-cancer-vaccine-mrna.jpg", "publishedAt": "2025-08-24T18:15:26Z", "content": "About 10 weeks before his assassination in 1968, Robert F. Kennedy  better known as Bobby, and the father of our current health secretary, Robert F. Kennedy, Jr. delivered a rousing address at Vander… [+3983 chars]"}]}