{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Richard Engel, Marc Smith, Yuliya Talmazan", "title": "Taliban parade new weapons seized from Afghan military as U.S. withdraws - NBC News", "description": "As American forces withdraw from Afghanistan, the Taliban's unrelenting march may be gathering pace with district after district falling to the militants.", "url": "https://www.nbcnews.com/news/world/taliban-parade-new-weapons-seized-afghan-military-u-s-withdraws-n1273081", "urlToImage": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/newscms/2021_25/3486404/210624-taliban-mb-afghanistan-mb-2048.jpg", "publishedAt": "2021-07-06T10:10:00Z", "content": "KABUL, Afghanistan The Taliban have showed off containers full of weapons and military hardware seized from the Afghan military as American forces withdraw from the country and the militants march ac… [+5600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe, CNN", "title": "These parts of the US could become 'breeding grounds' for potentially more Covid-19 variants, expert says - CNN ", "description": "Out of the Covid-19 pandemic, two Americans are emerging: One protected by vaccines and the other still vulnerable to infection -- and experts say progress made across the entire US is being threatened by low-vaccinated regions.", "url": "https://www.cnn.com/2021/07/06/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210706005916-us-coronavirus-tuesday-0706-super-tease.jpg", "publishedAt": "2021-07-06T07:04:00Z", "content": "(CNN)Out of the Covid-19 pandemic, two Americans are emerging: One protected by vaccines and the other still vulnerable to infection -- and experts say progress made across the entire US is being thr… [+6055 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Ramin Setoodeh", "title": "Cannes Launches With COVID Confusion and ‘Disgusting’ Saliva Tests That Require Festival-Goers to Spit in a Tube - Variety", "description": "On Monday afternoon, Olivia Wilson had arrived from her home in Tennessee to the Cannes Film Festival, where she’ll be working as an intern at the American Pavilion. But before she got to enjoy the flashiest film festival in the world, she had to spit over an…", "url": "https://variety.com/2021/film/news/cannes-covid-saliva-tests-1235011802/", "urlToImage": "https://variety.com/wp-content/uploads/2021/07/cannes.jpg?w=1000", "publishedAt": "2021-07-05T18:35:00Z", "content": "On Monday afternoon, Olivia Wilson had arrived from her home in Tennessee to the Cannes Film Festival, where she’ll be working as an intern at the American Pavilion. But before she got to enjoy the f… [+4243 chars]"}]}