{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "One line that changed J-Law’s worldview - news.com.au", "description": "<p>Actress Jennifer Lawrence has revealed the one line from the TV show 30 Rock that made her gravitate towards the Democrats, one of America&rsquo;s two major political parties.</p>", "url": "https://www.news.com.au/entertainment/jennifer-lawrence-says-one-30-rock-line-changed-her-political-views/news-story/88ec86990213915a8c96029c2b064f01", "urlToImage": "https://content.api.news/v3/images/bin/9983cd8b49afd1800ef88f1d903e5dc9", "publishedAt": "2022-09-07T15:06:37Z", "content": "Actress Jennifer Lawrence has revealed the one line from the TV show 30 Rock that made her gravitate towards the Democrats, one of America’s two major political parties.\r\nThe Oscar-winning actress, 3… [+1668 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Elizabeth Holmes asks for new trial based on new 'evidence' - Good Morning America", "description": "Eight months after being found guilty of fraud, the convicted felon is seeking a new trial or court hearing based on what she says is \"newly discovered evide...", "url": "https://www.youtube.com/watch?v=qNpuWXJ_QsU", "urlToImage": "https://i.ytimg.com/vi/qNpuWXJ_QsU/hqdefault.jpg", "publishedAt": "2022-09-07T14:28:03Z", "content": null}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Winck, Madison Hoff", "title": "Fed's 'growth recession' defined: How it could ease inflation, hurt job seekers - Business Insider", "description": "The Fed chair acknowledged its approach to fighting inflation would \"bring some pain\" to Americans. But the alternative would be far worse.", "url": "https://www.businessinsider.com/growth-recession-outlook-federal-reserve-inflation-unemployment-hiring-jobs-workers-2022-9", "urlToImage": "https://i.insider.com/6078682174da0300181e1e53?width=1200&format=jpeg", "publishedAt": "2022-09-07T10:55:30Z", "content": "In an ideal world, the Federal Reserve has already vanquished pandemic-era inflation while keeping unemployment at historic lows and avoiding a recession.\r\nHopes for such an outcome are all but entir… [+5341 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Chris McGreal", "title": "US senator rejects Israeli army report on killing of Palestinian American reporter - The Guardian US", "description": "Chris Van Hollen calls for independent US inquiry, saying IDF claim Shireen Abu Aqleh died amid gun battle unsupported by evidence", "url": "https://amp.theguardian.com/us-news/2022/sep/07/shireen-abu-aqleh-us-senator-rejects-israeli-army-report", "urlToImage": null, "publishedAt": "2022-09-07T05:00:00Z", "content": "US politicsChris Van Hollen calls for independent US inquiry, saying IDF claim Shireen Abu Aqleh died amid gun battle unsupported by evidence\r\nA US senator has dismissed an Israeli army report that c… [+5468 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian-American Vedant Patel Gets New Role In US State Department Office - NDTV", "description": "Vedant Patel, the Principal Deputy Spokesperson for the US Department of State, has created history by becoming the first Indian-American to hold the daily State Department news conference.", "url": "https://www.ndtv.com/world-news/indian-american-vedant-patel-gets-new-role-in-us-state-department-office-3322385", "urlToImage": "https://c.ndtvimg.com/2022-04/k21tk70k_vedant-patel-white-house-assistant-press-secretary_625x300_08_April_22.jpg", "publishedAt": "2022-09-07T02:11:56Z", "content": "Vedant Patel previously served as an Assistant Press Secretary and Spokesperson for President Biden.\r\nWashington: Vedant Patel, the Principal Deputy Spokesperson for the US Department of State, has c… [+2528 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published ahead of print in August - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; Atlantic Canada; the New Caledonian arc; the Farallon plate; and the Hikurangi sub…", "url": "https://www.eurekalert.org/news-releases/963881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-06T20:07:38Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; A… [+38402 chars]"}, {"source": {"id": null, "name": "The Africa Report"}, "author": "Damien Glez", "title": "Zimbabwe: Africa’s oldest dinosaur might have been… American - The Africa Report", "description": "Scientists have just announced the discovery of the skeleton of the oldest dinosaur in Africa, in the Zimbabwean district of Mbire. The remains seem to confirm the theory of continental drift.", "url": "https://www.theafricareport.com/238642/zimbabwe-africas-oldest-dinosaur-might-have-been-american/", "urlToImage": "https://www.theafricareport.com/media/2022/09/Plus_vieux_dinosaure_africain_zimbabwe_E-scaled-e1662449051103.jpg", "publishedAt": "2022-09-06T07:28:35Z", "content": "It is about a metre high, weighs 30kg, has a long tail and a rather small head. The animal, whose skeleton has just been discovered in Zimbabwe by an international team of palaeontologists, could be … [+2879 chars]"}]}