{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Robb Report"}, "author": "Bryan Hood", "title": "From a ’70 Lamborghini Miura to a 64′ Shelby Cobra: The Late Neil Peart’s Car Collection Is Heading to Auction - Robb Report", "description": "The vehicles represent some of the most sought-after Italian, British and American cars of the last 60 years.", "url": "https://robbreport.com/motors/cars/neil-peart-silver-surfers-collection-auction-1234621662/", "urlToImage": "https://robbreport.com/wp-content/uploads/2021/06/peart01.jpg?w=1000", "publishedAt": "2021-06-28T22:00:46Z", "content": "Few drummers rank higher in the rock pantheon than the late Neil Peart, but music wasn’t his only passion. The Rush member, who died last year following a three-year battle with brain cancer, was als… [+2543 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Tom Tapp", "title": "Reimagined ‘Harry Potter and the Cursed Child’ To Premiere On Broadway In November - Deadline", "description": "A new version of Harry Potter and the Cursed Child is returning to North American stages as a one-show experience. The world premiere theatrical event will take place November 16 at Broadway’s Lyric Theatre in New York. The show will debut at the Curran in Sa…", "url": "https://deadline.com/2021/06/harry-potter-and-the-cursed-child-new-broadway-1234782941/", "urlToImage": "https://deadline.com/wp-content/uploads/2021/06/cursed-child-potter-broadway.jpeg?w=1024", "publishedAt": "2021-06-28T20:44:00Z", "content": "A new version of Harry Potter and the Cursed Child is returning to North American stages as a one-show experience.\r\nThe world premiere theatrical event will take place November 16 at Broadway’s Lyric… [+4430 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "DNA data and modelling reveal potential spread of invasive species - Science Daily", "description": "Scientists have found that a marine invasive species - a sea squirt that lives on rocky shores - could spread along 3,500 kilometers of South American coastline if climate change or human activities alter sea conditions.", "url": "https://www.sciencedaily.com/releases/2021/06/210628144827.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-06-28T19:38:55Z", "content": "Scientists at the University of Southampton have found that a marine invasive species -- a sea squirt that lives on rocky shores -- could spread along 3,500 kilometres of South American coastline if … [+2615 chars]"}, {"source": {"id": null, "name": "Tribtown.com"}, "author": "Lori McDonald", "title": "Dairy farming requires passion - Seymour Tribune", "description": "June is National Dairy Month, which started out as a milk promotion in 1937 and now serves as a reminder of the health benefits that dairy products provide. According to the American Dairy Association Indiana website, Indiana is home to more than 700 dairy fa…", "url": "http://www.tribtown.com/2021/06/28/1630125/", "urlToImage": "https://d1bdhkmqqz901h.cloudfront.net/1200x630/smart/http://www.tribtown.com/wp-content/files/sites/10/2021/06/70e8fa771002b4c4be5d6143485f1627-1.jpg", "publishedAt": "2021-06-28T13:32:12Z", "content": "June is National Dairy Month, which started out as a milk promotion in 1937 and now serves as a reminder of the health benefits that dairy products provide.\r\nAccording to the American Dairy Associati… [+7892 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Thomas Biesheuvel", "title": "Billionaire boss Ivan Glasenberg makes one last coal deal in final days at Glencore - News24", "description": "Glencore has agreed to buy stakes owned by BHP Group and Anglo American Plc in the Cerrejon thermal coal mine, giving the world’s biggest shipper of the fuel complete control of the asset.", "url": "https://www.news24.com/fin24/companies/mining/billionaire-boss-ivan-glasenberg-makes-one-last-coal-deal-in-final-days-at-glencore-20210628", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8928/4423d2f56d334da1a1a54b663de0ce7c.jpg", "publishedAt": "2021-06-28T07:20:13Z", "content": "Glencore’s billionaire boss Ivan Glasenberg has made one final deal in his last week at the company, buying out two rivals in a giant Colombian coal mine.\r\nGlencore has agreed to buy stakes owned by … [+3213 chars]"}]}