{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": null, "title": "NASA Again Scraps Launch of Artemis 1 - Voice of America - VOA News", "description": "NASA's moon mission suffers another setback, this time delaying a test launch for at least a few weeks. Plus, a look back at the first color images of Mars, and we wish a very happy birthday to a TV space pioneer. VOA's Arash Arabasadi brings us The Week in S…", "url": "https://www.voanews.com/a/nasa-again-scraps-launch-of-artemis-1-/6736980.html", "urlToImage": "https://gdb.voanews.com/09d40000-0a00-0242-59fb-08da91d0d8ee_tv_w1200_r1.jpg", "publishedAt": "2022-09-08T19:59:04Z", "content": null}, {"source": {"id": null, "name": "Pragativadi.com"}, "author": "Pragativadi News Service", "title": "NASA Taps Axiom Space for First Artemis Moonwalking Spacesuits - Pragativadi", "description": "NASA has selected Axiom Space to deliver a moonwalking system for the Artemis III mission, which will land Americans on the surface of the Moon for the first time in over 50 years. This award – the first one under a competitive spacesuits contract –", "url": "https://pragativadi.com/nasa-taps-axiom-space-for-first-artemis-moonwalking-spacesuits/", "urlToImage": "https://pragativadi.com/wp-content/uploads/2022/09/Untitled-design-49.png", "publishedAt": "2022-09-08T17:27:44Z", "content": "NASA has selected Axiom Space to deliver a moonwalking system for the Artemis III mission, which will land Americans on the surface of the Moon for the first time in over 50 years. This award the fir… [+2837 chars]"}, {"source": {"id": null, "name": "Latest News in Nigeria & Breaking Naija News 24/7 | LEGIT.NG"}, "author": "Oke-Hortons Nosa", "title": "“Music Is the Weapon”: Nigerian Singer Joeboy Gets a Grammys Recognition Gong - Legit.ng", "description": "Fast-rising Nigerian musician Joeboy gets recognition from Grammys for his collaborative work with the American music group Major Lazer on their 2021 album.", "url": "https://www.legit.ng/entertainment/music/1490698-music-weapon-nigerian-singer-joeboy-a-grammy-recognition-gong/", "urlToImage": "https://netstorage-legit.akamaized.net/images/3884f6dacefe4a1f.jpg", "publishedAt": "2022-09-08T06:58:37Z", "content": "<ul><li>Fast-rising Nigerian singer Joeboy celebrates a huge feat as he gets a recognition plaque from the Grammys for his collaboration work on the album Music is the weapon by Major Lazer</li><li>T… [+2224 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Concerns over emerging, re-emerging infectious diseases | The Guardian Nigeria News - Nigeria and World News — Features - Guardian Nigeria", "description": "•Scientific strategies from recent outbreaks to help prepare for Pathogen X There are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in China, West Nile Virus in America, Marburg virus in Ghana, Ebo…", "url": "https://guardian.ng/features/science/concerns-over-emerging-re-emerging-infectious-diseases/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/09/AMSN.jpg", "publishedAt": "2022-09-08T02:22:00Z", "content": "Scientific strategies from recent outbreaks to help prepare for Pathogen X\r\nThere are concerns over rising cases of emerging and re-emerging viral/infectious diseases such as Langya Henipavirus in Ch… [+21425 chars]"}]}