{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "Press Trust of India", "title": "Vivek Ramaswamy calls his differences with Donald Trump 'very small' - India Today", "description": "Vivek Ramaswamy, the Republican contender for the 2024 US Presidential elections, said there were \"small differences\" between him and Donald Trump but both of them are focused on being ‘America-first’.", "url": "https://www.indiatoday.in/world/story/vivek-ramaswamy-says-his-differences-with-donald-trump-very-small-2430155-2023-09-02", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/media_bank/202309/vivek-ramaswam-312657-16x9.jpg?VersionId=m7fqI_zuLjWlmbmyGuFI4btdiw_7b5IA", "publishedAt": "2023-09-02T12:22:32Z", "content": "Indian-American Vivek Ramaswamy has acknowledged that there were some \"very small\" differences between him and former US president Donald Trump but they were \"deeply aligned\" on policy issues, 90-plu… [+2007 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sens. Tim Kaine (D-Va.) and Todd Young (R-Ind.), and former Sen. Jim Inhofe (R-Okla.), opinion contributors", "title": "After the pandemic ends, long COVID still needs congressional attention - The Hill", "description": "After the formal end of the COVID-19 public health emergency in May, attention in Congress has largely been focused on priorities other than the pandemic. Thankfully, many Americans have been able to return to their pre-pandemic daily routines.  But for some,…", "url": "https://thehill.com/opinion/congress-blog/4181662-after-the-pandemic-ends-long-covid-still-needs-congressional-attention/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2023/05/64704d4d0ab771.45882448.jpeg?w=1280", "publishedAt": "2023-08-31T20:30:00Z", "content": "Skip to content\r\nAfter the formal end of the COVID-19 public health emergency in May, attention in Congress has largely been focused on priorities other than the pandemic. Thankfully, many Americans … [+4331 chars]"}]}