{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Adam Goldman", "title": "Member of ISIS ‘Beatles’ Cell Pleads Guilty in Hostage Cases - The New York Times", "description": "Alexanda Kotey admitted that he played a key part in American prisoners’ kidnapping, detention and hostage negotiations. Some of the hostages were beheaded.", "url": "https://www.nytimes.com/2021/09/02/us/politics/isis-beatles-alexanda-kotey.html", "urlToImage": "https://static01.nyt.com/images/2021/09/02/us/02dc-beatle/02dc-beatle-facebookJumbo.jpg", "publishedAt": "2021-09-03T02:03:04Z", "content": "The Trump administration engaged in a lengthy debate over what to do with the two men, weighing options like turning them over to the Iraqis or taking them to the wartime prison at Guantánamo Bay, Cu… [+1479 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Hindustantimes", "title": "Joe Biden's approval rating at all-time low after Afghanistan withdrawal, poll shows - Hindustan Times", "description": "The poll revealed, however, that not all Americans think responsibility for the Afghanistan situation rests solely on Biden. Around 36 per cent ranked George W Bush as being the most responsible, followed by Joe Biden at 21 per cent, Barack Obama at 15 per ce…", "url": "https://www.hindustantimes.com/world-news/joe-biden-s-approval-rating-at-all-time-low-after-afghanistan-withdrawal-poll-shows-101630628681033.html", "urlToImage": "https://images.hindustantimes.com/img/2021/09/03/1600x900/BIDEN-IDA-0_1630630376739_1630630403133.jpg", "publishedAt": "2021-09-03T00:57:13Z", "content": "Joe Biden's approval rating as president of the United States is at an all-time low after the chaotic withdrawal of American troops from Afghanistan amid a lightning-fast Taliban offensive last month… [+3157 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Reports: Japan princess to reject wedding payout, move to US - The Star Online", "description": "TOKYO: The course of true love never did run smooth, but after public controversy and a wedding delay, Japan’s Princess Mako (pic) is reportedly set to tie the knot and move to America.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2021/09/03/reports-japan-princess-to-reject-wedding-payout-move-to-us", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/09/03/1279650.jpg", "publishedAt": "2021-09-03T00:35:17Z", "content": "TOKYO: The course of true love never did run smooth, but after public controversy and a wedding delay, Japans Princess Mako (pic) is reportedly set to tie the knot and move to America.\r\nThe daughter … [+2494 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Betsy Ladyzhets", "title": "CDC study estimates over 80% of Americans are now protected from COVID-19 - Daily Mail", "description": "About 83% of the U.S. population ages 16 and up has some degree of protection against COVID-19 from vaccination or past infection, the CDC estimates based on a survey of antibody levels.", "url": "https://www.dailymail.co.uk/health/article-9952555/CDC-study-estimates-80-Americans-protected-COVID-19.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/09/02/21/47443573-0-image-a-76_1630616015616.jpg", "publishedAt": "2021-09-02T21:03:27Z", "content": "About 83 percent of the U.S. population ages 16 and up has some degree of immunity to the coronavirus from vaccination or prior infection, a new Centers for Disease Control and Prevention (CDC) study… [+6498 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Travis Caldwell", "title": "More than 500000 U.S. children tested positive for COVID-19 in 3 weeks - CTV News", "description": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not yet eligible to receive vaccinations.", "url": "https://www.ctvnews.ca/health/coronavirus/more-than-500-000-u-s-children-tested-positive-for-covid-19-in-3-weeks-1.5570853", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5570872.1630590742!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-09-02T13:54:40Z", "content": "The dramatic rise in COVID-19 cases and hospitalizations due to the more transmissible Delta variant is significantly impacting all age groups, particularly Americans ages 11 or younger who are not y… [+7020 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News Desk", "title": "Taliban Govt in Afghanistan: Mullah Yaqoob and Haqqani Factions Fight for Key Posts - News18", "description": "As the United States completed its military retreat from Afghanistan on August 31 after the 20-year-long American deployment in the war-torn country, some of the Taliban's top leaders in Kabul have initiated talks on setting up a new government in Afghanistan.", "url": "https://www.news18.com/news/world/taliban-govt-in-afghanistan-mullah-yaqoob-and-haqqani-factions-fight-for-key-posts-4153094.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/08/taliban-12-162971627916x9.jpg", "publishedAt": "2021-09-01T12:05:00Z", "content": "As the United States completed its military retreat from Afghanistan on August 31 after the 20-year-long American deployment in the war-torn country, some of the Taliban’s top leaders in Kabul have i… [+6776 chars]"}]}