{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Louis Theroux", "title": "‘They had their own cameras trained on me’ – Louis Theroux on his showdowns with US extremists - The Guardian", "description": "In his new show Forbidden America, the presenter meets white nationalists, trigger-happy rappers and other inflammatory figures. Here, he argues that, rather than no-platforming them, we need to hear what they say", "url": "https://amp.theguardian.com/tv-and-radio/2022/feb/10/louis-theroux-showdowns-us-extremists-forbidden-america-white-nationalists-no-platforming", "urlToImage": null, "publishedAt": "2022-02-10T06:00:00Z", "content": "Louis TherouxIn his new show Forbidden America, the presenter meets white nationalists, trigger-happy rappers and other inflammatory figures. Here, he argues that, rather than no-platforming them, we… [+13336 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Ford, Toyota halt production as anti-vaccine protesters block US-Canada border amid warnings of economic damage - ABC News", "description": "Car manufacturers Ford and Toyota halt production in Canada as anti-vaccine mandate protesters block the busiest North American trade route, with politicians warning the convoy could cause significant damage to the economy.", "url": "https://www.abc.net.au/news/2022-02-10/ford-toyota-halt-production-protesters-block-us-canada-border/100820532", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/25eb2798edebd22530ed17627c78ebd3?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=379&width=862&height=485", "publishedAt": "2022-02-10T05:50:29Z", "content": "Car manufacturers Ford and Toyota have halted production as anti-coronavirus mandate protesters blocked US-Canada border crossings that have prompted warnings from Washington and Ottawa of economic d… [+5148 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Juliet Macur", "title": "Nathan Chen Wins Gold in Men's Figure Skating: Live Updates - The New York Times", "description": "The American star finally claimed a prize that eluded him in 2018, validating his status as the world’s best male figure skater.", "url": "https://www.nytimes.com/live/2022/02/09/sports/figure-skating-olympics", "urlToImage": "https://static01.nyt.com/images/2022/02/10/sports/olympics/figure-skating-beijing-olympics-1513/figure-skating-beijing-olympics-1513-articleLarge.jpg", "publishedAt": "2022-02-10T04:54:00Z", "content": "More than two days after the team figure skating event ended with Russia winning, Olympics officials still have not handed out the medals as they investigate a legal issue that has generated question… [+3421 chars]"}, {"source": {"id": null, "name": "ESPN"}, "author": "Alyssa Roenigk", "title": "American Chloe Kim, 21, secures history with consecutive Olympic golds in snowboard halfpipe event - ESPN", "description": "Chloe Kim, 21, the lone American to make Thursday's final, became the first woman to win two Olympic snowboard gold medals in the halfpipe, taking the event with a first-run score of 94, nearly four points higher than the rest of the field.", "url": "https://www.espn.com/olympics/story/_/id/33256461/american-chloe-kim-21-secures-history-consecutive-olympic-golds-snowboard-halfpipe-event", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0210%2Fr972436_1296x729_16%2D9.jpg", "publishedAt": "2022-02-10T03:24:25Z", "content": "Chloe Kim is the first woman to win two Olympic snowboard gold medals in the halfpipe. The lone American to make Thursday's final, Kim, 21, won the event with her first-run score of 94, which was nea… [+5695 chars]"}, {"source": {"id": null, "name": "Global News"}, "author": "Saba Aziz", "title": "‘Snowball effect’: Canada’s trucker convoy sparks anti-mandate protests globally - Global News", "description": "Copycat protests inspired by the so-called “Freedom Convoy” in Ottawa have so far been held in Australia, New Zealand and France, with an American version in the works.", "url": "https://globalnews.ca/news/8608477/freedom-convoy-worldwide-covid-protests/", "urlToImage": "https://globalnews.ca/wp-content/uploads/2022/02/GettyImages-1238318998-e1644458550719.jpg?quality=85&strip=all&w=720&h=379&crop=1", "publishedAt": "2022-02-10T02:44:14Z", "content": "The so-called Freedom Convoy protest movement against COVID-19 vaccine mandates that has paralyzed the Canadian capital and spilled over to key Canada-U.S. border crossings has gained global momentum… [+4817 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Max Walden", "title": "Chinese visitors unlikely to return to Australia in large numbers despite border reopening - ABC News", "description": "Chinese tourists used to spend three times as much as Americans in Australia, but several factors mean they are unlikely to come back in significant numbers any time soon.", "url": "https://www.abc.net.au/news/2022-02-10/chinese-tourists-unlikely-to-return-in-large-numbers-australia/100813148", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e79bc12804a9f1e8af00720030caeb99?impolicy=wcms_crop_resize&cropH=2810&cropW=4996&xPos=0&yPos=0&width=862&height=485", "publishedAt": "2022-02-10T00:47:46Z", "content": "Melody Meng's parents in China have been vaccinated with two shots of the widely-used Sinopharm vaccine, but they still won't be allowed to enter Australia after border restrictions ease on February … [+8696 chars]"}]}