{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Juror in Johnny Depp-Amber Heard trial speaks out for 1st time about verdict l GMA - Good Morning America", "description": "A member of the jury in the Depp-Heard defamation case told ABC News exclusively that \"a lot of Amber's story didn't add up\" and \"the majority of the jury fe...", "url": "https://www.youtube.com/watch?v=PCnFykaEtxY", "urlToImage": "https://i.ytimg.com/vi/PCnFykaEtxY/hqdefault.jpg", "publishedAt": "2022-06-16T15:03:02Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Abbott plant halts production of baby formula - Good Morning America", "description": "The Michigan facility, which was offline for roughly four months over quality control and contamination concerns, has been hit by heavy rain, thunderstorms, ...", "url": "https://www.youtube.com/watch?v=2DJG7lVa5Xg", "urlToImage": "https://i.ytimg.com/vi/2DJG7lVa5Xg/hqdefault.jpg", "publishedAt": "2022-06-16T14:30:38Z", "content": null}, {"source": {"id": null, "name": "Volleyballworld.com"}, "author": null, "title": "Canada using last year's lessons to do better in 2022 | volleyballworld.com - Volleyball World", "description": "The North Americans aim to improve on their 2021 campaign and are headed in the right direction", "url": "https://en.volleyballworld.com/volleyball/competitions/vnl-2022/news/canada-using-last-year-s-lessons-to-do-better-in-2022", "urlToImage": "https://images.volleyballworld.com/image/private/t_q-best/fivb-prd/adn4t1ileu2tk00wvfsu.jpg", "publishedAt": "2022-06-16T14:23:01Z", "content": "After our debut at last years VNL, I think we proved, not only to ourselves but to everyone else, that we belong in the competition and playing against the best teams in the world, Cross told Volleyb… [+290 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Jim Robbins, Thomas Fuller, Christine Chung", "title": "Yellowstone Flooding Is a Sign of What’s to Come for National Parks - The New York Times", "description": "Record rainfall and mudslides forced closures just as tourism season ramped up. Virtually none of America’s national parks are untouched by extreme weather and climate change.", "url": "https://www.nytimes.com/2022/06/15/us/yellowstone-national-park-floods.html", "urlToImage": "https://static01.nyt.com/images/2022/06/15/us/15national-parks-1/15national-parks-1-facebookJumbo.jpg", "publishedAt": "2022-06-16T13:11:00Z", "content": "Millions of tourists are drawn each year to the wilderness and active geysers in Yellowstone, which sprawls across more than two million acres in the northwest corner of Wyoming and into Montana and … [+1554 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Mitch Smith", "title": "Decades After Vincent Chin’s Death, Recent Attacks Haunt Asian Americans - The New York Times", "description": "Vincent Chin, a Chinese immigrant, was beaten to death after being pursued by two white Detroit autoworkers in 1982. On the 40th anniversary of his death, many hear frightening echoes.", "url": "https://www.nytimes.com/2022/06/16/us/vincent-chin-anti-asian-attack-detroit.html", "urlToImage": "https://static01.nyt.com/images/2022/06/16/us/16vincent-chin-04/merlin_208000935_54bf35c2-9594-48c4-9b03-046f3ea46eec-facebookJumbo.jpg", "publishedAt": "2022-06-16T09:00:35Z", "content": "Mr. Chin, who was 27, worked as a draftsman and part-time waiter and was about to get married. On the night he was killed, he had gone with friends to a strip club for his bachelor party. He got into… [+1492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez", "title": "American, Canadian and Mexican 2026 World Cup host cities set to be announced - CNN", "description": "Cities that have applied to host matches at the 2026 men's World Cup, the first edition to feature 48 teams and the first to be staged in three countries, will find out on Thursday whether their bids have been successful.", "url": "https://www.cnn.com/2022/06/16/football/host-cities-2026-fifa-world-cup/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211121141525-copa-del-mundo-2022-deportes-cnn.jpg?q=x_3,y_145,h_1572,w_2794,c_crop/w_800", "publishedAt": "2022-06-16T07:19:00Z", "content": "Cities that have applied to host matches at the 2026 mens World Cup, the first edition to feature 48 teams and the first to be staged in three countries, will find out on Thursday whether their bids … [+1950 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "Uorfi Javed gets a thumbs up from global fashion designer Harris Reed who has worked with Emma Watson, Harry Styles - Times of India", "description": "Urfi Javed who is often criticised for her bizarre style sense seems to be finally getting her due. British-American fashion designer Harris Reed was recently impressed with one of Urfi’s outfits and even talked about it on his Instagram account. Apparently, …", "url": "https://timesofindia.indiatimes.com/videos/tv/hindi/uorfi-javed-gets-a-thumbs-up-from-global-fashion-designer-harris-reed-who-has-worked-with-emma-watson-harry-styles/videoshow/92243367.cms", "urlToImage": "https://timesofindia.indiatimes.com/photo/92243367/size-62086/92243367.jpg", "publishedAt": "2022-06-16T03:28:32Z", "content": "Urfi Javed who is often criticised for her bizarre style sense seems to be finally getting her due. British-American fashion designer Harris Reed\r\n was recently impressed with one of Urfis outfits an… [+417 chars]"}]}