{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe, Karol Suarez, David Williams, Jose Lesh, Amanda Jackson", "title": "4 Americans missing in Mexico identified by family members as a South Carolina mother and her friends who were traveling for a medical procedure - CNN", "description": "The four Americans who authorities say were kidnapped in Mexico on Friday were a tight-knit group of friends traveling from South Carolina so one of them -- a mother of six -- could undergo a medical procedure across the border, two family members told CNN.", "url": "https://www.cnn.com/2023/03/07/americas/mexico-matamoros-us-citizens-kidnapping-tuesday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230306164803-03-missing-americans-in-mexico.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-07T14:24:00Z", "content": "The four Americans who authorities say were kidnapped in Mexico on Friday were a tight-knit group of friends traveling from South Carolina so one of them a mother of six could undergo a medical proce… [+6267 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "FACT SHEET: The President’s Budget: Extending Medicare Solvency by 25 Years or More, Strengthening Medicare, and Lowering Health Care Costs - The White House", "description": "The President’s FY 2024 Budget will lay out President Biden’s plan to invest in America, lower costs for families, protect and strengthen Social Security and Medicare, and reduce the deficit. Millions of Americans have been working their whole lives, paying i…", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/03/07/fact-sheet-the-presidents-budget-extending-medicare-solvency-by-25-years-or-more-strengthening-medicare-and-lowering-health-care-costs/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2023-03-07T10:30:00Z", "content": "The Presidents FY 2024 Budget will lay out President Bidens plan to invest in America, lower costs for families, protect and strengthen Social Security and Medicare, and reduce the deficit.\r\nMillions… [+3947 chars]"}, {"source": {"id": null, "name": "WJXT News4JAX"}, "author": "Marilyn Parker", "title": "Family physician calls rise in diabetes, obesity in young adults concerning after new study released - WJXT News4JAX ", "description": "Diabetes and obesity are on the rise among young adults in the U.S., according to new data from the American Medical Association.", "url": "https://www.news4jax.com/health/2023/03/06/family-physician-calls-rise-in-diabetes-obesity-in-younger-people-concerning-after-new-study-released/", "urlToImage": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/arc-cf/03-06-2023/t_01f18e44f6ed4d39ad3aa94540db69db_name_image.jpg?_a=ATCqVhC0", "publishedAt": "2023-03-06T21:46:10Z", "content": "JACKSONVILLE, Fla. Diabetes and obesity are on the rise among young adults in the U.S., according to new data from the American Medical Association.\r\nDuring the timeframe of a study released Sunday b… [+2314 chars]"}]}