{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Kemifilani.ng"}, "author": "Harry Onye", "title": "Michael Bolwaire age, height, wiki, net worth, family and latest updates - Kemi Filani News", "description": "Michael Bolwaire age, height, wiki, net worth, family and latest updates. Michael Bolwaire is a model, dancer, and actor from the United States of America. Michael Bolwaire is also known as Bolo the Entertainer. Similarly, he rose to notoriety on the reality …", "url": "https://www.kemifilani.ng/breaking-news/michael-bolwaire-age-height-wiki-net-worth-family-and-latest-updates/", "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2022/09/Michael-Bolwaire.jpg", "publishedAt": "2022-09-01T04:37:28Z", "content": "Michael Bolwaire age, height, wiki, net worth, family and latest updates.\r\nMichael Bolwaire is a model, dancer, and actor from the United States of America. Michael Bolwaire is also known as Bolo the… [+5302 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Osinbajo to meet Harris for Nigeria’s energy plan - Punch Newspapers", "description": "Vice President Yemi Osinbajo, on Wednesday, departed Abuja for the United States of America to seek global partnerships and support for Nigeria’s recently launched Energy Transition Plan.", "url": "https://punchng.com/osinbajo-to-meet-harris-for-nigerias-energy-plan/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/04/25211338/Prof-Yemi-Osinbajo-.jpg", "publishedAt": "2022-09-01T02:04:16Z", "content": "Vice President Yemi Osinbajo, on Wednesday, departed Abuja for the United States of America to seek global partnerships and support for Nigerias recently launched Energy Transition Plan.\r\nAccording t… [+1017 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "'Triangle of Sadness' actor, model Charlbi Dean dead at 32 - CBC News", "description": "Charlbi Dean, the South African actor and model who had a breakout role in Triangle of Sadness, has died at age 32. The prize-winning film's North American premiere is set to take place at this year's Toronto International Film Festival.", "url": "https://www.cbc.ca/news/entertainment/charlbi-dean-dead-1.6567787", "urlToImage": "https://i.cbc.ca/1.6567810.1661952725!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/filmfestival-cannes-triangle-of-sadness.JPG", "publishedAt": "2022-08-31T14:54:35Z", "content": "Charlbi Dean, the South African actor and model who had a breakout role in Triangle of Sadness, which won this year's top prize at the Cannes Film Festival, has died at age 32.\r\nDean died Monday at a… [+1424 chars]"}]}