{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Jackie Salo", "title": "Fauci says it's now up to Americans to assess their own COVID-19 risk - New York Post ", "description": "Dr. Anthony Fauci insisted it’s now up to Americans to make their own medical risk assessments regarding COVID-19.", "url": "https://nypost.com/2022/04/10/fauci-says-its-now-up-to-americans-to-assess-their-own-covid-19-risk/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2022/04/fauci-comp.jpg?quality=75&strip=all&w=1024", "publishedAt": "2022-04-10T19:22:00Z", "content": "Dr. Anthony Fauci on Sunday appeared to throw in the towel on more government restrictions over COVID-19 — insisting its now up to Americans to make their own medical risk assessments. \r\nThis is not … [+2047 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi, Biden's Virtual Meet Tomorrow, Will Review Bilateral Cooperation - NDTV", "description": "The Leaders' virtual interaction will precede the fourth India-US 2+2 Ministerial Dialogue which will be led by Raksha Mantri Shri Rajnath Singh and Minister of External Affairs Dr S Jaishankar and their American counterparts.", "url": "https://www.ndtv.com/india-news/pm-modi-bidens-virtual-meet-tomorrow-review-bilateral-cooperation-2875909", "urlToImage": "https://c.ndtvimg.com/2021-09/dtsrogc8_pm-modi-biden-hug-650_650x400_24_September_21.jpg", "publishedAt": "2022-04-10T14:40:00Z", "content": "New Delhi: Amid hectic diplomatic activity with growing pressure from the West on India's oil deals with Russia, Prime Minister Narendra Modi will virtually meet with US President Joe Biden on Monday… [+4325 chars]"}, {"source": {"id": null, "name": "Autojosh.com"}, "author": "https://facebook.com/autojoshng", "title": "Ford Honors Holman Moody With Special Heritage Edition GT - AutoJosh", "description": "Ford GT has reached the end of its production life but it’s not going away without offering something special (probably limited) in the veil of the Holman Moody Heritage Edition. The American race team based in Charlotte, North Carolina, campaigned three GT40…", "url": "https://autojosh.com/ford-honors-holman-moody-with-special-heritage-edition-gt/", "urlToImage": "https://autojosh.com/wp-content/uploads/2022/04/holman_moody_gt_autojosh.jpg", "publishedAt": "2022-04-09T22:12:20Z", "content": "Ford GT has reached the end of its production life but it’s not going away without offering something special (probably limited) in the veil of the Holman Moody Heritage Edition.\r\nThe American race t… [+1670 chars]"}]}