{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Joan Biskupic, CNN legal analyst & Supreme Court biographer", "title": "Chief Justice John Roberts lost the Supreme Court and the defining case of his generation - CNN", "description": "Chief Justice John Roberts has long piloted America's highest court, securing majorities on controversies over religion, race, voting rights and campaign finance regulation. But on fundamental abortion rights and in the defining case of his generation, Robert…", "url": "https://www.cnn.com/2022/06/26/politics/john-roberts-chief-justice-roe-dobbs-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190320122055-20190320-john-roberts-portrait-biskupic-book-politics-super-tease.jpg", "publishedAt": "2022-06-26T12:58:00Z", "content": "(CNN)Chief Justice John Roberts has long piloted America's highest court, securing majorities on controversies over religion, race, voting rights and campaign finance regulation. But on fundamental a… [+6613 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "David Smith", "title": "‘A mockery of democracy’: US supreme court in question after abortion ruling - The Guardian", "description": "In scrapping the right to terminate a pregnancy the court went against the popular will – only 25% of Americans now have confidence in the institution", "url": "https://amp.theguardian.com/law/2022/jun/26/us-supreme-court-abortion-ruling-democracy", "urlToImage": null, "publishedAt": "2022-06-26T07:00:00Z", "content": "US supreme courtIn abruptly scrapping the constitutional right to terminate a pregnancy the court went against the popular will only 25% of Americans now have confidence in the institution\r\nStriding … [+11973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Uterus, No Opinion\": Massive Protests In US As Abortion Right Ends - NDTV", "description": "Abortion rights defenders fanned out across America Saturday for a second day of protest against the Supreme Court's thunderbolt ruling, as state after conservative state moved swiftly to ban the procedure.", "url": "https://www.ndtv.com/world-news/us-abortion-rights-protests-no-uterus-no-opinion-protests-in-us-as-abortion-right-ends-3100936", "urlToImage": "https://c.ndtvimg.com/2022-06/dr19ilj_abortion-rally-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T23:42:10Z", "content": "US Abortion Rights Protests: At least eight right-leaning states imposed immediate bans on abortion.\r\nWashington: Abortion rights defenders fanned out across America Saturday for a second day of prot… [+4421 chars]"}, {"source": {"id": "axios", "name": "Axios"}, "author": "Stef W. Kight", "title": "After the ruling: Americans ask Google how to move to Canada - Axios", "description": "Abortion is legal at all stages of pregnancy in Canada.", "url": "https://www.axios.com/2022/06/25/after-the-ruling-americans-ask-google-how-to-move-to-canada", "urlToImage": "https://images.axios.com/P_o8x1B8D-stQ0MrL0fhJ85aazA=/0x0:1280x720/1366x768/2022/06/26/1656244502119.png", "publishedAt": "2022-06-25T12:06:15Z", "content": "Data: Google Trends; Chart: Axios Visuals\r\nGoogle searches for how to move to Canada from U.S. surged on Friday following the U.S. Supreme Court decision overturning Roe v. Wade, according to Google … [+1024 chars]"}]}