{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Marc Santora", "title": "Russia-Ukraine War Live: Blinken and Austin Expected in Kyiv - The New York Times", "description": "Secretary of State Antony J. Blinken and Defense Secretary Lloyd J. Austin III would be the highest-ranking American officials to visit Ukraine since Russia invaded.", "url": "https://www.nytimes.com/live/2022/04/24/world/ukraine-russia-war-news", "urlToImage": "https://static01.nyt.com/images/2022/04/24/world/24ukraine-blog-promo-9-30-est/24ukraine-blog-promo-9-30-est-facebookJumbo.jpg", "publishedAt": "2022-04-24T15:58:48Z", "content": "LVIV, Ukraine On the eve of the most important Christian religious festival of the year, Ukrainians clung to centuries-old Easter traditions in the shadow of a war that has brought devastation and so… [+5486 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Six dead in apparent gang violence at Guatemala football match - Guardian Nigeria", "description": "At least six people were killed and four injured during clashes between armed alleged gang members at an indoor football match in Guatemala, police said, in the latest mass violence at sporting events in Latin America. The bloodshed, which occurred Saturday n…", "url": "https://editor.guardian.ng/sport/six-dead-in-apparent-gang-violence-at-guatemala-football-match/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/04/Guatemala-football-match-1.jpg", "publishedAt": "2022-04-24T14:25:00Z", "content": "At least six people were killed and four injured during clashes between armed alleged gang members at an indoor football match in Guatemala, police said, in the latest mass violence at sporting event… [+1232 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Wall St Week Ahead Stakes are high as megacap companies highlight big earnings week - Reuters", "description": "Investors are hoping a flood of U.S. quarterly reports next week, including those from megacap growth titans, will confirm a solid profit outlook for corporate America and bolster the case for stocks after a rocky start to the year.", "url": "https://www.reuters.com/business/wall-st-week-ahead-stakes-are-high-megacap-companies-highlight-big-earnings-week-2022-04-22/", "urlToImage": "https://www.reuters.com/resizer/9e0qopgEGNPZzKQjiT53ir5_zOo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/XNK7SPOX3VPVXLLLENIDJHPQ2I.jpg", "publishedAt": "2022-04-24T13:00:00Z", "content": "NEW YORK, April 22 (Reuters) - Investors are hoping a flood of U.S. quarterly reports next week, including those from megacap growth titans, will confirm a solid profit outlook for corporate America … [+4492 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Zelensky to meet with top American officials in Ukraine - CBC News", "description": "Russian forces called in airstrikes on a besieged steel factory in the southern city of Mariupol to try to dislodge the last Ukrainian troops holding out in the strategic port, Ukrainian officials said Sunday, while President Volodymyr Zelensky said he would …", "url": "https://www.cbc.ca/news/world/russia-ukraine-war-1.6429208", "urlToImage": "https://i.cbc.ca/1.6429209.1650789238!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/aptopix-russia-ukraine-war.jpg", "publishedAt": "2022-04-24T11:53:12Z", "content": "Russian forces called in airstrikes on a besieged steel factory in the southern city of Mariupol to try to dislodge the last Ukrainian troops holding out in the strategic port, Ukrainian officials sa… [+4732 chars]"}]}