{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "Pope Francis names 20 new cardinals, most of whom will likely vote for his successor | DW | 27.08.2022 - DW (English)", "description": "Pope Francis has inducted 20 cardinals from around the world, 16 of whom are young enough to have a say in any potential vote for the next pope. The selections hailed from Asia, Europe, Africa and the Americas.", "url": "https://www.dw.com/en/pope-francis-names-20-new-cardinals-most-of-whom-will-likely-vote-for-his-successor/a-62952830", "urlToImage": "https://static.dw.com/image/62952888_6.jpg", "publishedAt": "2022-08-27T23:56:34Z", "content": "Pope Francis appointed 20 new Roman Catholic Cardinals at a ceremony in St Peter's Basilica on Saturday. \r\nThe 85-year-old presented the new intake with the red square caps and rings typical of their… [+3346 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Paul Farrell", "title": "NASA prepares to launch Artemis 1 as it prepares to return Americans to the surface of the Moon - Daily Mail", "description": "The first Moon rocket launched by NASA since 1973 is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast.", "url": "https://www.dailymail.co.uk/news/article-11152277/NASA-prepares-launch-Artemis-1-prepares-return-Americans-surface-Moon.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/08/27/20/61788699-0-image-a-7_1661627868782.jpg", "publishedAt": "2022-08-27T19:43:39Z", "content": "The first Moon rocket launched by NASA in five decades is expected to take off as early as August 29 from the Kennedy Space Center on Florida's coast. \r\nNASA is preparing the launch of the unmanned S… [+7163 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": "ANI", "title": "Study reveals avocados may lower risk of cardiovascular disease - ThePrint", "description": "Washington [US], August 27 (ANI): Eating two servings of avocados a week was associated with a lower risk of cardiovascular disease, according to a recent study. The study was published in ‘Journal of the American Heart Association’. Avocados contain dietary …", "url": "https://theprint.in/features/study-reveals-avocados-may-lower-risk-of-cardiovascular-disease/1104019/", "urlToImage": null, "publishedAt": "2022-08-27T18:15:14Z", "content": "Washington [US], August 27 (ANI): Eating two servings of avocados a week was associated with a lower risk of cardiovascular disease, according to a recent study.\r\nThe study was published in ‘Journal … [+4279 chars]"}, {"source": {"id": null, "name": "Www.geo.tv"}, "author": "Web Desk", "title": "Meghan Markle angers South Africans - Geo News", "description": "South Africans slam the Duchess: 'Meghan you may fool Americans and celeb friends, but you can’t fool Africans'", "url": "https://www.geo.tv/latest/436450-meghan-you-may-fool-americans-and-celeb-friends-but-you-cant-fool-africans", "urlToImage": "https://www.geo.tv/assets/uploads/updates/2022-08-27/436450_090147_updates.jpg", "publishedAt": "2022-08-27T16:01:00Z", "content": "Prince Harry's wife Meghan Markle has angered some South Africans with her first podcast in which she spoke of an incident which took place during the couple's last royal tour.\r\nIn the first episode … [+1613 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Play A Key Role In Countering China: US Navy Chief - NDTV", "description": "US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in the future, playing a key role in countering China.", "url": "https://www.ndtv.com/india-news/india-to-play-a-key-role-in-countering-china-us-navy-chief-3291871", "urlToImage": "https://i.ndtvimg.com/i/2018-04/india-china-flags_650x400_61523324939.jpg", "publishedAt": "2022-08-27T13:46:39Z", "content": "India presents China with a two-front problem, said the US Navy Chief (Representational)\r\nTokyo: US Chief of Naval Operations Adm Mike Gilday said that India will be a crucial partner for America in … [+3390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Perseverance Rover Discovers Rocks Shaped By Water On Mars - NDTV", "description": "American Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet that may have life-related traces.", "url": "https://www.ndtv.com/world-news/nasas-perseverance-rover-discovers-rocks-shaped-by-water-on-mars-3291878", "urlToImage": "https://c.ndtvimg.com/2022-08/uumg5tto_jezero-crater_625x300_27_August_22.jpg", "publishedAt": "2022-08-27T11:22:22Z", "content": "Scientists believe that the Martian surface was once filled with water.\r\nAmerican Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet t… [+2171 chars]"}, {"source": {"id": null, "name": "Dominicantoday.com"}, "author": "Merit Designs Consulting Group, 2006-2020", "title": "“Vaccinated mosquitoes” used to combat dengue fever - Dominican Today", "description": "<p>This experiment was unveiled at yesterday’s commemoration of International Dengue Day. The Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addition to measures such as the elimination of mosquito breedi…", "url": "https://dominicantoday.com/dr/local/2022/08/27/vaccinated-mosquitoes-used-to-combat-dengue-fever/", "urlToImage": "https://dominicantoday.com/wp-content/uploads/2022/08/14_El-Mundo_27_1p01.jpg", "publishedAt": "2022-08-27T10:11:00Z", "content": "This experiment was unveiled at yesterday’s commemoration of International Dengue Day.\r\nThe Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addit… [+2024 chars]"}]}