{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Psychiatryadvisor.com"}, "author": null, "title": "A Year of Standard Care for Treatment Resistant Depression Fails to Improve Symptoms of Suicidality - Psychiatry Advisor", "description": "The Treatment-resistant Depression in America Latina (TRAL) study was conducted at centers in Argentina, Brazil, Colombia, and Mexico between 2017 and 2018.", "url": "https://www.psychiatryadvisor.com/home/topics/suicide-and-self-harm/year-of-soc-therapy-for-trd-had-suboptimal-effects-on-symptoms-of-depression-and-suicidality/", "urlToImage": "https://www.psychiatryadvisor.com/wp-content/uploads/sites/8/2022/02/Depression-Headache_G_1324340507-1.jpg", "publishedAt": "2022-07-20T14:10:00Z", "content": "A year of standard of care (SOC) therapy for treatment resistant depression (TRD) had suboptimal effects on symptoms of depression and suicidality. These findings were published in the the Revista de… [+3083 chars]"}, {"source": {"id": null, "name": "Lupus.org"}, "author": null, "title": "Machine Learning Methods Can Help Predict Lupus Hospitalizations - Lupus Foundation of America", "description": "A new study shows that machine learning can be used to help predict risk of hospitalization in people with lupus.", "url": "https://www.lupus.org/news/machine-learning-methods-can-help-predict-lupus-hospitalizations", "urlToImage": "https://www.lupus.org/sites/default/files/styles/og_image/public/media/images/disease-ILR.JPG", "publishedAt": "2022-07-20T12:00:00Z", "content": "A new study shows that machine learning can be used to help predict risk of hospitalization in people with lupus. Machine learning refers to the process by which a machine or computer can imitate hum… [+1545 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Solar storm: Aurora puts the dazzling show in sky over North America | Oneindia News *news - Oneindia News", "description": "Aurora puts a stunning show in the sky after a solar storm hits the Earth. Aurora is a natural light display in Earth's sky. Watch the video to know more.#Au...", "url": "https://www.youtube.com/watch?v=c2X-10aiROE", "urlToImage": "https://i.ytimg.com/vi/c2X-10aiROE/maxresdefault.jpg", "publishedAt": "2022-07-20T10:08:09Z", "content": null}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "AL beats NL for ninth straight time, Stanton claims MVP at 2022 MLB All-Star Game - Sportsnet.ca", "description": "Giancarlo Stanton homered in his Dodger Stadium homecoming, Byron Buxton followed with another drive and the American League won its ninth straight All-Star Game, beating the National League 3-2 on Tuesday night.", "url": "https://www.sportsnet.ca/mlb/article/american-league-beats-national-league-in-2022-mlb-all-star-game/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/07/CP160954871-1040x572.jpg", "publishedAt": "2022-07-20T03:32:00Z", "content": "LOS ANGELES -- Giancarlo Stanton homered in his Dodger Stadium homecoming, Byron Buxton followed with another drive and the American League won its ninth straight All-Star Game, beating the National … [+8815 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "After struggling to create dangerous moments, a dubious penalty decides Canada’s fate - Sportsnet.ca", "description": "A controversial penalty decision helped sink the Canadian women’s team in the 2022 CONCACAF W Championship final. But, while the U.S. certainly benefited from it, the Americans were also just the better side based on the balance of play.", "url": "https://www.sportsnet.ca/soccer/article/after-struggling-to-create-dangerous-moments-a-dubious-penalty-seals-canadas-fate/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/07/canada-offence-united-states-soccer-1040x572.jpg", "publishedAt": "2022-07-19T13:32:00Z", "content": "A controversial penalty decision helped sink the Canadian womens team in Mondays 2022 CONCACAF W Championship final in Mexico. \r\nAlex Morgans goal from the penalty spot in the 78th minute was the dif… [+4978 chars]"}]}