{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "17 US Missionaries, Family Members Kidnapped In Haiti: Report - NDTV", "description": "As many as 17 American Christian missionaries and their families, including children, were kidnapped on Saturday by gang members in Haiti's capital of Port-au-Prince, the New York Times reported, citing security officials there.", "url": "https://www.ndtv.com/world-news/15-us-missionaries-family-member-kidnapped-in-haiti-report-2578091", "urlToImage": "https://c.ndtvimg.com/2021-02/3pnmrg9_us-flag-bloomberg_625x300_19_February_21.jpg", "publishedAt": "2021-10-17T03:45:00Z", "content": "They were abducted from a bus headed to the airport to drop off some members of the group\r\nPort-au-Prince: As many as 17 American Christian missionaries and their families, including children, were k… [+1180 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Maria Abi-Habib", "title": "American Missionaries Kidnapped in Haiti, Officials Say - The New York Times", "description": "Up to 17 missionaries and their family members were taken by gangs in the capital of a country where kidnappings have become increasingly common.", "url": "https://www.nytimes.com/2021/10/16/world/americas/missionaries-kidnap-haiti.html", "urlToImage": "https://static01.nyt.com/images/2021/10/16/us/16Haiti/merlin_194308347_31864eee-86b2-4ac6-9cd2-e9f95de2feb4-facebookJumbo.jpg", "publishedAt": "2021-10-17T02:05:08Z", "content": "Security has broken down as the countrys politics have disintegrated. Demonstrators furious at widespread corruption demanded the ouster of President Jovenel Moïse two years ago, effectively paralyzi… [+1503 chars]"}, {"source": {"id": null, "name": "Dot Esports"}, "author": "Tyler Esguerra", "title": "100 Thieves exit Worlds 2021 with a bang by taking down EDG in final match of Group B - Dot Esports", "description": "The North American first seed didn't go down without a fight.", "url": "https://dotesports.com/league-of-legends/news/100-thieves-exit-worlds-2021-with-a-bang-by-taking-down-edg-in-final-match-of-group-b/", "urlToImage": "https://cdn1.dotesports.com/wp-content/uploads/2021/10/14155302/20211007_LEAGUEFEATURES_DAY3-1824-1-768x480.png", "publishedAt": "2021-10-16T19:15:08Z", "content": "It’s been a tough League of Legends 2021 World Championship for 100 Thieves, the LCS’ first seed. After losing to Korea’s T1 in the second match of day five, the team were knocked out in a relatively… [+1491 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Johnson & Johnson booster shots: FDA panel approves additional doses - FOX 5 Atlanta", "description": "The FDA panel voted unanimously to authorize a second shot for Americans who received their first dose of the Johnson & Johnson vaccine at least two months a...", "url": "https://www.youtube.com/watch?v=qIydSswPLIo", "urlToImage": "https://i.ytimg.com/vi/qIydSswPLIo/hqdefault.jpg", "publishedAt": "2021-10-16T14:40:32Z", "content": null}, {"source": {"id": null, "name": "Americanthinker.com"}, "author": null, "title": "The Unvaccinated Are Looking Smarter Every Week - American Thinker", "description": "There is a massive propaganda push against those choosing not to vaccinate against COVID-19 with the experimental mRNA vaccines. Mainstream media, the big tech corporations, and our government have combined efforts to reward compliance and to shame a...", "url": "https://www.americanthinker.com/articles/2021/10/the_unvaccinated_are_looking_smarter_every_week.html", "urlToImage": "https://www.americanthinker.com/images/bucket/2021-10/233124.jpg", "publishedAt": "2021-10-16T07:09:09Z", "content": "There is a massive propaganda push against those choosing not to vaccinate against COVID-19 with the experimental mRNA vaccines. Mainstream media, the big tech corporations, and our government have c… [+7614 chars]"}]}