{"articles": [{"author": "Kate Aurthur", "content": "In Woody Allen’s first interview on American television in nearly 30 years, conducted in July and released Sunday on streamer Paramount Plus, the filmmaker again denies that he ever sexually abused h… [+6162 chars]", "description": "In Woody Allen’s first interview on American television in nearly 30 years, conducted in July and released Sunday on streamer Paramount Plus, the filmmaker again denies that he ever sexually abused his daughter Dylan Farrow. The interview, conducted by CBS Ne…", "publishedAt": "2021-03-28T16:41:00Z", "source": {"id": null, "name": "Variety"}, "title": "Woody Allen Rehashes Old Arguments, Says He’s ‘Perfectly Innocent’ in CBS News Interview - Variety", "url": "https://variety.com/2021/tv/news/woody-allen-dylan-farrow-cbs-interview-1234939719/", "urlToImage": "https://variety.com/wp-content/uploads/2021/03/Screen-Shot-2021-03-28-at-9.15.57-AM.png?w=1024"}, {"author": null, "content": "Grey DeLisle-Griffin, American actress and singer, has narrated how her marriage to Christopher DeLisle, her first husband, crashed after she mistakenly confessed to cheating on him.\r\nThe songwriter … [+1983 chars]", "description": "Grey DeLisle-Griffin, American actress and singer, has narrated how her first marriage to Christopher DeLisle, her first husband", "publishedAt": "2021-03-27T18:57:14Z", "source": {"id": null, "name": "Thecable.ng"}, "title": "Grey DeLisle-Griffin: I lost my first marriage after I mistakenly confessed to cheating - TheCable Lifestyle - TheCable", "url": "http://lifestyle.thecable.ng/grey-delisle-griffin-i-lost-my-first-marriage-after-i-mistakenly-confessed-to-cheating/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/03/Grey_DeLisle-Griffin.jpg"}, {"author": null, "content": "<ul><li>Some widely available hand sanitisers that consumers snapped up to ward off the coronavirus infection has been found to contain high levels of benzene known to cause cancer.</li><li>Benzene i… [+7988 chars]", "description": "Some widely available hand sanitisers that American consumers snapped up last year to ward off coronavirus infection contain high levels of a chemical known to cause cancer, a testing firm’s analysis found.", "publishedAt": "2021-03-26T17:30:14Z", "source": {"id": "news24", "name": "News24"}, "title": "Carcinogen found in hand sanitisers that plugged Covid-19 gap - News24", "url": "https://www.news24.com/fin24/Companies/carcinogen-found-in-hand-sanitisers-that-plugged-covid-19-gap-20210326", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10836/af793168f4e841ef84b04f98773367bd.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "america"}