{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Warns India Of \"Consequences\" Over Avoiding Sanctions On Russia - NDTV", "description": "US cautioned of \"consequences\" for countries attempting to \"circumvent\" American sanctions against Moscow for its invasion of Ukraine and said it would not like to see a \"rapid\" acceleration in India's import of energy from Russia.", "url": "https://www.ndtv.com/india-news/us-warns-india-of-consequences-over-avoiding-us-sanctions-on-russia-2855569", "urlToImage": "https://c.ndtvimg.com/2022-04/n2lkdsbg_usindia-talksforeign-secretary-harsh-vardhan-shringla_625x300_01_April_22.jpg", "publishedAt": "2022-04-01T06:11:00Z", "content": "US said it would not like to see a \"rapid\" acceleration in India's import of energy from Russia\r\nNew Delhi: The US on Thursday cautioned that there will be consequences for countries actively attempt… [+6661 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Evelyn Cheng", "title": "Here's how China's latest Covid lockdowns have affected American businesses in the country - CNBC", "description": "China's worst Covid wave in two years has cut into revenue projections for roughly half of American businesses in the country, a survey showed Friday.", "url": "https://www.cnbc.com/2022/04/01/amcham-survey-on-chinas-latest-covid-lockdowns-american-businesses.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107040141-1648787293930-gettyimages-1239585136-AFP_32778NZ.jpeg?v=1648787389&w=1920&h=1080", "publishedAt": "2022-04-01T05:12:13Z", "content": "BEIJING China's worst Covid wave since the initial shock of the pandemic has cut into annual revenue projections for roughly half of American businesses in the country, a survey showed Friday.\r\nThe B… [+2053 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Record-Setting NASA Astronaut and Two Cosmonauts Return From International Space Station - SciTechDaily", "description": "After extending the record for the longest single spaceflight in history by an American to 355 days, NASA astronaut Mark Vande Hei returned to Earth on Wednesday, March 30, 2022, along with Roscosmos cosmonauts Anton Shkaplerov and Pyotr Dubrov. The trio depa…", "url": "https://scitechdaily.com/record-setting-nasa-astronaut-and-two-cosmonauts-return-from-international-space-station/", "urlToImage": "https://scitechdaily.com/images/NASA-Astronaut-Mark-Vande-Hei-After-Landing.jpg", "publishedAt": "2022-03-31T09:36:18Z", "content": "NASA astronaut Mark Vande Hei is seen outside the Soyuz MS-19 spacecraft after he landed with Russian cosmonauts Anton Shkaplerov and Pyotr Dubrov in a remote area near the town of Zhezkazgan, Kazakh… [+3705 chars]"}]}