{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Tumaini Carayol", "title": "Frances Tiafoe rolls over Andrey Rublev to reach US Open semi-finals - The Guardian", "description": "Frances Tiafoe won in straight sets over Andrey Rublev to become the first American man to reach the US Open semi-finals since Andy Roddick in 2006", "url": "https://amp.theguardian.com/sport/2022/sep/07/frances-tiafoe-andrey-rublev-us-open-tennis-report", "urlToImage": "https://i.guim.co.uk/img/media/4ea09b77438ab004907a5c6de9754f2ff794f429/0_20_2162_1298/master/2162.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c74c6e862857e53616191f3ab48a187e", "publishedAt": "2022-09-07T21:55:00Z", "content": "Andrey Rublev and Frances Tiafoe first stared each other down as rivals on the courts of Flushing Meadows in 2014. They were both 15 years old then, Tiafoe born three months later in January 1998, an… [+5122 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "New GSA Bulletin articles published ahead of print in August - EurekAlert", "description": "The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; Atlantic Canada; the New Caledonian arc; the Farallon plate; and the Hikurangi sub…", "url": "https://www.eurekalert.org/news-releases/963881", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-09-06T20:07:38Z", "content": "Boulder, Colo., USA: The Geological Society of America regularly publishes articles online ahead of print. GSA Bulletin topics studied this month include the nature and dynamics of China and Tibet; A… [+38402 chars]"}, {"source": {"id": null, "name": "The Africa Report"}, "author": "Damien Glez", "title": "Zimbabwe: Africa’s oldest dinosaur might have been… American - The Africa Report", "description": "Scientists have just announced the discovery of the skeleton of the oldest dinosaur in Africa, in the Zimbabwean district of Mbire. The remains seem to confirm the theory of continental drift.", "url": "https://www.theafricareport.com/238642/zimbabwe-africas-oldest-dinosaur-might-have-been-american/", "urlToImage": "https://www.theafricareport.com/media/2022/09/Plus_vieux_dinosaure_africain_zimbabwe_E-scaled-e1662449051103.jpg", "publishedAt": "2022-09-06T07:28:35Z", "content": "It is about a metre high, weighs 30kg, has a long tail and a rather small head. The animal, whose skeleton has just been discovered in Zimbabwe by an international team of palaeontologists, could be … [+2879 chars]"}]}