{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Annette Choi", "title": "Why tariffs on Mexico and Canada could drive up grocery costs, in 3 charts - CNN", "description": "Americans rely heavily on their bordering countries for everyday grocery items. President Trump’s plan to impose a 25% tariff on Mexican and Canadian goods could drive up food prices for the average shopper. We’ve charted why.", "url": "https://www.cnn.com/2025/02/01/us/food-prices-tariffs-trump-dg/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/20250131-tariff-groceries-card-exlargetease.png?c=16x9&q=w_800,c_fill", "publishedAt": "2025-02-01T10:00:00Z", "content": "(CNN) From fresh avocados to dairy products, Americans rely heavily on their bordering countries for everyday grocery items. The White House confirmed that President Donald Trump will impose a 25% ta… [+2357 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "REGINA GARCIA CANO, JOSHUA GOODMAN", "title": "Venezuela frees 6 Americans after meeting between President Maduro and Trump’s envoy - The Associated Press", "description": "Six Americans who had been detained in Venezuela in recent months have freed by the government of President Nicolás Maduro after he met with a senior Trump administration official. U.S. President Donald Trump and his envoy for special missions, Richard Grenel…", "url": "https://apnews.com/article/trump-maduro-envoy-migrants-grenell-edfa58920c0a76f0bbe9de995a07d1a3", "urlToImage": "https://dims.apnews.com/dims4/default/dd1e5ab/2147483647/strip/true/crop/2451x1379+0+311/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2F70%2F32260c896d6b5a323265b1faaff9%2Fdef21896888445e2a1884166b7977fe4", "publishedAt": "2025-02-01T01:52:00Z", "content": "CARACAS, Venezuela (AP) Six Americans who had been detained in Venezuela in recent months were freed by the government of President Nicolás Maduro after he met Friday with a Trump administration offi… [+5958 chars]"}]}