{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Children 5-11 begin COVID vaccine shots - Good Morning America", "description": "As thousands of kids roll up their sleeves to get their first Pfizer coronavirus vaccine shot, some parents are struggling to find available appointments.", "url": "https://www.youtube.com/watch?v=CKPPtbE7JX4", "urlToImage": "https://i.ytimg.com/vi/CKPPtbE7JX4/hqdefault.jpg", "publishedAt": "2021-11-04T14:32:39Z", "content": null}, {"source": {"id": null, "name": "Barrick.com"}, "author": null, "title": "Q3 Operating Result Sets Barrick Up for Strong Finish to 2021 - Barrick Gold Corporation", "description": "Strong third quarter production from our Africa and Middle East and Latin America regions has positioned them to meet the top end of their guidance for the year.", "url": "https://www.barrick.com/English/news/news-details/2021/q3-2021-results/default.aspx", "urlToImage": "https://s25.q4cdn.com/322814910/files/images/news/2021/q2-21_results.jpg", "publishedAt": "2021-11-04T10:12:59Z", "content": "Third Quarter 2021 ResultsAll amounts expressed in US dollars\r\nLondon Strong third quarter production from its Africa and Middle East (AME) and Latin America regions has positioned them to meet the t… [+157755 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Iliyasu Gadu", "title": "USA vs China: Take your pick (2) - TheCable", "description": "In a number of ways, the ongoing global geo-strategic struggle between the United States of America and its allies on one hand and China on the other offers a unique", "url": "https://www.thecable.ng/usa-vs-china-take-your-pick-2", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2021/10/US-China.jpg", "publishedAt": "2021-11-04T09:25:00Z", "content": "In a number of ways, the ongoing global geo-strategic struggle between the United States of America and its allies on one hand and China on the other offers a unique opportunity for Africa led by Nig… [+6061 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "29 Days on the Edge: The Road To Launch and Beyond for NASA’s James Webb Space Telescope - SciTechDaily", "description": "Now that NASA’s James Webb Space Telescope has safely arrived at its launch site in French Guiana, on the northeastern coast of South America, technical teams have begun making progress on the final checklist of preparations before liftoff later this year. Th…", "url": "https://scitechdaily.com/29-days-on-the-edge-the-road-to-launch-and-beyond-for-nasas-james-webb-space-telescope/", "urlToImage": "https://scitechdaily.com/images/NASAs-James-Webb-Space-Telescope.gif", "publishedAt": "2021-11-04T03:23:49Z", "content": "ByThaddeus Cesari, NASAs Goddard Space Flight CenterNovember 3, 2021\r\nNASA’s James Webb Space Telescope. Credit: NASA’s Goddard Space Flight Center Conceptual Image Lab\r\nNow that NASA\r\nEstablished in… [+9349 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Heather Mac Donald", "title": "Minneapolis voters saw life without police — and soundly rejected a Defund ballot initiative - New York Post ", "description": "Minneapolis voters, suffering through endless crime, have rejected a ballot initiative that would have dismantled its police — signaling America’s rebuke to the “defund the police” movement, …", "url": "https://nypost.com/2021/11/03/minneapolis-voters-soundly-rejected-a-defund-ballot-initiative/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/11/minneapolis-police-193.jpg?quality=90&strip=all&w=1024", "publishedAt": "2021-11-04T00:48:00Z", "content": "Reality has caught up with the Defund the Police movement. Minneapolis voters, suffering through a bloody crime wave, resoundingly rejected a ballot initiative Tuesday that would have dismantled the … [+5068 chars]"}]}