{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Supporters Greet Vivek Ramaswamy With \"VP\" Chants, Trump Says This - NDTV", "description": "A day after he withdrew from the 2024 US presidential race, Indian-American entrepreneur Vivek Ramaswamy received an enthusiastic welcome from Donald Trump's supporters while he endorsed his former rival and ex-US president.", "url": "https://www.ndtv.com/world-news/after-supporters-greet-vivek-ramaswamy-with-vp-chants-trump-says-this-4879284", "urlToImage": "https://c.ndtvimg.com/2024-01/uj13ub28_vivek-ramaswamy_625x300_17_January_24.jpeg?ver-20240117.06", "publishedAt": "2024-01-17T09:25:00Z", "content": "As the two leaders shook hands, the crowd broke into chants of \"VP, VP\".\r\nA day after he withdrew from the 2024 US presidential race, Indian-American entrepreneur Vivek Ramaswamy received an enthusia… [+2602 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "India Today Science Desk", "title": "Indian tectonic plate is breaking into two. It's happening beneath Tibet - India Today", "description": "This revelation was presented at the American Geophysical Union conference in San Francisco and offers a fresh perspective on the colossal Himalayan mountain range's formation.", "url": "https://www.indiatoday.in/science/story/indian-tectonic-plate-is-breaking-into-two-its-happening-beneath-tibet-2489741-2024-01-17", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202401/himalayas-1710374-16x9_0.jpg?VersionId=yC0owe0Ubq5Ywu7ZjOO2n_k3P491GFzD", "publishedAt": "2024-01-17T06:10:53Z", "content": "In a new discovery that could reshape our understanding of the forces shaping the Earth's highest mountains, researchers have unveiled new seismic data indicating that the Indian tectonic plate is sp… [+2578 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "US Presidential elections: Vivek Ramaswamy for Vice President? Donald Trump says ‘will be working with us for long time’ | Mint - Mint", "description": "US former President Donald Trump, who registered a big win, held a rally in Atkinson, New Hampshire with fellow GOP leader Vivek Ramaswamy and thanked the Indian-American leader for endorsing him.", "url": "https://www.livemint.com/politics/trump-thanks-ramaswamy-for-endorsement-predicts-long-term-collaboration-11705467833394.html", "urlToImage": "https://www.livemint.com/lm-img/img/2024/01/17/1600x900/AP01-17-2024-000014B-0_1705467993924_1705468014926.jpg", "publishedAt": "2024-01-17T05:59:34Z", "content": "US Presidential Polls: Indian-American businessman and a former president post hopeful Vivek Ramaswamy pulled out of the race after he marked a distant fourth rank in Iowa. Ramaswamy, however, also e… [+3124 chars]"}]}