{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "CHRIS MEGERIAN", "title": "Who is Jason Palmer? A previously unknown Democrat beats Biden in American Samoa's Democratic caucus - The Associated Press", "description": "Jason Palmer, a previously unknown candidate, won the Democratic caucus in American Samoa on Tuesday. Out of 91 ballots cast, Palmer won 51 and President Joe Biden won 40, according to the local party. Palmer told The Associated Press, “I found out that I had…", "url": "https://apnews.com/article/who-is-jason-palmer-american-samoa-primary-c4bc109a16c7ee7b083f6216b44ba0c4", "urlToImage": "https://dims.apnews.com/dims4/default/a4892e0/2147483647/strip/true/crop/3000x1688+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F0a%2F5f%2F9f662ee5bf321be0dfe36b531a63%2F857a7aa7d63147478bb012c2905f06ef", "publishedAt": "2024-03-06T03:03:00Z", "content": "WASHINGTON (AP) President Joe Biden was sweeping every Democratic contest on Super Tuesday except for American Samoa.\r\nHe fell short there to a previously unknown candidate named Jason Palmer. Out of… [+1679 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman", "title": "The Covid-19 pandemic killed off one strain of the flu, and that will change the next vaccines - CNN", "description": "For ten years, Americans have had access to flu shots that protect against four different strains of the flu—two A strains and two B strains.", "url": "https://www.cnn.com/2024/03/05/health/flu-vaccine-yamagata-strains/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231023185521-flu-vaccine-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-03-05T11:19:00Z", "content": "For 10 years, Americans have had access to flu shots that protect against four strains of the virus: two A strains and two B strains.\r\nStarting this fall, however, all the flu shots distributed in th… [+3522 chars]"}]}