{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Healthline"}, "author": "Julia Ries", "title": "Experts on Where Flu Cases are Rising and When to Get Your Flu Shot - Healthline", "description": "While the flu shot appears to be a good match to the circulating strains, a recent survey found that nearly half of Americans don’t plan to get vaccinated against the flu this year. What, exactly, this means for this year’s flu season has yet to be seen, but …", "url": "https://www.healthline.com/health-news/experts-on-where-flu-cases-are-rising-and-when-to-get-your-flu-shot", "urlToImage": "https://assets.healthline.com/content/hl_sharing_v2.jpg", "publishedAt": "2022-10-14T20:09:09Z", "content": "<ul><li>Health experts say this flu season is likely to be severe. </li><li>Currently, Texas, Georgia, and Washington D.C. are all seeing high flu activity and its only the beginning of flu season. <… [+7663 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Feinberg", "title": "Trump will now be forced to testify after bombshell Jan 6 hearing lifts lid on Capitol riot links - The Independent", "description": "‘He is required to answer to those millions of Americans who votes he wanted to throw out as part of his scheme to remain in power and whatever is underway to ensure this accountability under law’", "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-january-6-committee-subpoena-b2202429.html", "urlToImage": "https://static.independent.co.uk/2022/10/14/07/newFile.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-14T13:49:09Z", "content": "The House 6 January select committee on Thursday voted to issue a subpoena demanding testimony from the man whose actions have been at the centre of the nine-member panels investigation over the last… [+9365 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "MLim", "title": "SEVENTEEN Announces Additional Dates And Cities For 2022 World Tour “BE THE SUN” - soompi", "description": "SEVENTEEN has confirmed additional dates and cities for their Asian tour! The day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13, SEVENTEEN gave a pleasant surprise to their fans by releasi…", "url": "https://www.soompi.com/article/1549677wpp/seventeen-announces-additional-dates-and-cities-for-2022-world-tour-be-the-sun", "urlToImage": "https://6.viki.io/image/e080978d62e44f089b59633aa53b8eaf/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-10-14T08:37:26Z", "content": "SEVENTEEN has confirmed additional dates and cities for their Asian tour!\r\nThe day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13… [+504 chars]"}]}