{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "White House defends decision to shoot down flying objects - BBC", "description": "Questions remain over what the three objects shot down over North America this weekend were.", "url": "https://www.bbc.co.uk/news/world-us-canada-64632378", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6088/production/_128621742_gettyimages-1247111962.jpg", "publishedAt": "2023-02-13T20:29:24Z", "content": "The White House has said its decision to shoot down three objects flying over North American airspace this weekend was \"out of an abundance of caution\".\r\nThe objects posed a threat to commercial flig… [+2507 chars]"}, {"source": {"id": "the-globe-and-mail", "name": "The Globe And Mail"}, "author": "Kanishka Singh and Steve Scherer", "title": "Trudeau sees 'some sort of pattern' in downed aerial objects - The Globe and Mail", "description": "American and Canadian officials have struggled to explain the origin of three objects that U.S. fighter jets have brought down over North American airspace", "url": "https://www.theglobeandmail.com/world/article-trudeau-sees-some-sort-of-pattern-in-downed-aerial-objects/", "urlToImage": "https://www.theglobeandmail.com/resizer/jqT8s8hU00M0yIHidBE4ld5YiD8=/1200x801/filters:quality(80)/cloudfront-us-east-1.images.arcpublishing.com/tgam/LSYRUKPKGBNR5DDHC5Y46AP36E.JPG", "publishedAt": "2023-02-13T19:31:13Z", "content": "Prime Minister Justin Trudeau said on Monday that the four aerial objects shot down in recent days, including one over Yukon territory on Saturday, are connected in some way, without elaborating.\r\nOb… [+2066 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tina Burnside, Gregory Clary", "title": "College Board hits back at Florida's initial rejection of AP African American Studies course and admits it made mistakes in rollout - CNN", "description": "The testing organization behind a new college-level African American studies course for high schoolers is hitting back at Florida officials' comments about the Advanced Placement class, accusing the state Education Department of \"slander\" and spreading misinf…", "url": "https://www.cnn.com/2023/02/13/us/florida-ap-african-american-studies-college-board-response/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230209094618-ron-desantis-0208.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-02-13T17:05:00Z", "content": "The testing organization behind a new college-level African American studies course for high schoolers is hitting back at Florida officials comments about the Advanced Placement class, accusing the s… [+6882 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Object shot down over Lake Huron likely landed in Canadian waters, officials say - CBC News", "description": "The U.S. Air Force general overseeing North American airspace said a recovery effort will be undertaken to gain more information about an octagonal object shot down by a fighter jet over Lake Huron, the latest incident since a suspected Chinese surveillance b…", "url": "https://www.cbc.ca/news/world/us-canada-china-balloon-objects-1.6746196", "urlToImage": "https://i.cbc.ca/1.6746203.1676288376!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/usa-china-balloon-biden.JPG", "publishedAt": "2023-02-13T14:52:10Z", "content": "The U.S. Air Force general overseeing North American airspace said a recovery effort will be undertaken to gain more information about an octagonal object shot down by fighter jets over Lake Huron, t… [+4705 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Jake Epstein, Grace Eliza Goodwin", "title": "Why the military is spotting more mysterious flying objects lately - Business Insider", "description": "The command tasked with defending North American airspace changed its radar filters to spot smaller, slower objects, revealing new potential threats.", "url": "https://www.businessinsider.com/why-more-balloons-unidentified-objects-shot-down-military-2023-2", "urlToImage": "https://i.insider.com/63ea5d7996242f0019e893fc?width=1200&format=jpeg", "publishedAt": "2023-02-13T14:35:00Z", "content": "A US Air Force general overseeing commands tasked with defending US and Canadian airspace explained that there's a reason mysterious flying objects seem to suddenly be popping up all over the place. … [+4408 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Will Pavia", "title": "Fourth flying object spotted above the US shot down at Lake Huron - The Times", "description": "A fourth flying object was shot out of the sky above North America yesterday by US fighter jets that intercepted it over the waters of Lake Huron in Michigan, t", "url": "https://www.thetimes.co.uk/article/fourth-object-spotted-flying-above-the-us-shot-down-near-michigan-lake-chg2s790r", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2F79f647e0-ab40-11ed-ad1a-af90319d4b0d.jpg?crop=4312%2C2425%2C740%2C1129&resize=1200", "publishedAt": "2023-02-13T07:45:00Z", "content": "A fourth flying object was shot out of the sky above North America yesterday by US fighter jets that intercepted it over the waters of Lake Huron in Michigan, two members of Congress announced last n… [+520 chars]"}]}