{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Pan American Health Organization"}, "author": null, "title": "Management of Severe Monkeypox in Brazil and Colombia. - Pan American Health Organization", "description": "Between 6-10% of reported MPX cases will require hospital admission. Most common reasons for admission are pain management (usually related to proctitis or tonsillitis), inability to swallow, urine retention, encephalitis or complications including bacterial …", "url": "https://www.paho.org/en/events/management-severe-monkeypox-brazil-and-colombia", "urlToImage": "https://www.paho.org/sites/default/files/styles/max_650x650/public/2022-11/23.jpg?itok=2mYr38sq", "publishedAt": "2022-11-14T20:32:12Z", "content": "Between 6-10% of reported MPX cases will require hospital admission. Most common reasons for admission are pain management (usually related to proctitis or tonsillitis), inability to swallow, urine r… [+1253 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Emily Long", "title": "How to Watch Two Americans Take Their First Spacewalk - Yahoo Life", "description": "While we’re waiting on NASA’s Artemis I moon rocket to (maybe) finally launch this week, there’s another space event worth tuning in for: Two American...", "url": "https://www.yahoo.com/lifestyle/watch-two-americans-first-spacewalk-173000145.html", "urlToImage": "https://media.zenfs.com/en/lifehacker_life_145/4cec6db1ea4f0608326bcbe65510e633", "publishedAt": "2022-11-14T17:30:00Z", "content": "Photo: Dima Zel (Shutterstock)\r\nWhile were waiting on NASAs Artemis I moon rocket to (maybe) finally launch this week, theres another space event worth tuning in for: Two American astronauts currentl… [+1734 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "\"Black Panther: Wakanda Forever\" crushes the box office on release - Africanews English", "description": "\"Black Panther: Wakanda Forever,\" the sequel to the Afro-futuristic Marvel film that bombed in 2018, has largely dominated the North American box office in its first weekend in theatres, according to figures Sunday from trade firm Exhibitor Relations.", "url": "http://www.africanews.com/2022/11/14/black-panther-wakanda-forever-crushes-the-box-office-on-release/", "urlToImage": "https://static.euronews.com/articles/stories/07/19/28/20/1024x538_cmsv2_2f17061d-3dda-590d-a574-ad7ec5995d89-7192820.jpg", "publishedAt": "2022-11-14T10:35:29Z", "content": "\"Black Panther: Wakanda Forever,\" the sequel to the Afro-futuristic Marvel film that bombed in 2018, has largely dominated the North American box office in its first weekend in theatres, according to… [+1785 chars]"}]}