{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Nicki Brown", "title": "Some migrants who were flown to Martha's Vineyard will still 'wind up in Florida anyway,' advocacy organization says - CNN", "description": "Florida Gov. Ron DeSantis spent taxpayers' money on flying migrants to Martha's Vineyard in Massachusetts and some of those people are \"still going to wind up in Florida anyway,\" said Domingo Garcia, the president of the League of United Latin American Citize…", "url": "https://www.cnn.com/2022/09/17/us/marthas-vineyard-migrants-florida-saturday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220917194239-marthas-vineyard-migrants-florida-saturday.jpg?q=w_800,c_fill", "publishedAt": "2022-09-18T01:39:00Z", "content": "Florida Gov. Ron DeSantis spent taxpayers money on flying migrants to Marthas Vineyard inMassachusettsand some of those people are still going to wind up in Florida anyway, said Domingo Garcia, the p… [+3981 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Andrew Miller", "title": "Trump holds Save America rally in Ohio supporting Senate candidate JD Vance - Fox News", "description": "Former President Donald Trump was speaking at a rally in Youngstown, Ohio on Saturday night in support of Republican Senate Candidate J.D. Vance.", "url": "https://www.foxnews.com/politics/trump-holds-save-america-rally-ohio-supporting-senate-candidate-jd-vance", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2022/09/Donald-Trump-Pennsylvania-Rally.jpg", "publishedAt": "2022-09-17T22:51:55Z", "content": "Former President Donald Trump held a rally in Youngstown, Ohio on Saturday night in support of Republican Senate Candidate J.D. Vance with roughly 50 days left until the November midterm elections.\r\n… [+735 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lisalee Solomons", "title": "Ramaphosa vows to improve investment environment for US companies after talks with Biden - News24", "description": "There was agreement on the need to create a more attractive environment for American companies to invest in South Africa.", "url": "https://www.news24.com/news24/southafrica/news/ramaphosa-vows-to-improve-investment-environment-for-us-companies-after-talks-with-biden-20220917", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3873/af387e4cce3544a9bf338786f4a09efe.jpg", "publishedAt": "2022-09-17T20:03:45Z", "content": "<ul><li>President Cyril Ramaphosa has concluded his working visit with US President Joe Biden in Washington DC. </li><li>The two heads of state spent time deliberating on a range of critical issues o… [+5814 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "Associated Press", "title": "Chinese Astronauts Go on Spacewalk From New Station - Voice of America - VOA News", "description": "State media said Saturday that Cai Xuzhe and Chen Dong installed pumps, a handle to open the hatch door from outside in an emergency, and a foot-stop to affix an astronaut’s feet to a robotic arm", "url": "https://www.voanews.com/a/chinese-astronauts-go-on-spacewalk-from-new-station/6751657.html", "urlToImage": "https://gdb.voanews.com/09860000-0aff-0242-8e4d-08da98c2a659_cx0_cy7_cw99_w1200_r1.jpg", "publishedAt": "2022-09-17T15:42:17Z", "content": "Beijing  Two Chinese astronauts went on a spacewalk Saturday from a new space station that is due to be completed later this year.\r\nCai Xuzhe and Chen Dong's installed pumps, a handle to open the hat… [+1214 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "Kinling Lo", "title": "'Striking' that Putin admits Xi's concerns about Russia's war in Ukraine: US State Department - The Star Online", "description": "Russian President Vladimir Putin’s acknowledgement of Chinese counterpart Xi Jinping’s “concerns” about the war in Ukraine was “striking”, the US State Department said, reiterating American concerns about the two countries’ deepening relationship.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/09/17/striking-that-putin-admits-xis-concerns-about-russias-war-in-ukraine-us-state-department", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/09/17/1741091.jpg", "publishedAt": "2022-09-17T05:20:00Z", "content": "Russian President Vladimir Putins acknowledgement of Chinese counterpart Xi Jinpings concerns about the war in Ukraine was striking, the US State Department said, reiterating American concerns about … [+4099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deblina Chakraborty", "title": "Polio is back. How concerned should Americans be? - CNN", "description": "An August report from the US Centers for Disease Control and Prevention said that \"even a single case of paralytic polio represents a public health emergency in the United States.\" CNN Medical Analyst Dr. Leana Wen explains why.", "url": "https://www.cnn.com/2022/09/15/health/polio-paralysis-vaccine-health-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220914213846-04-polio-vaccination-virus-new-york-health-wellness.jpg?q=w_800,c_fill", "publishedAt": "2022-09-15T17:02:00Z", "content": "New Yorks governor has declared a state of emergency after health officials detected poliovirus in the wastewater of five counties evidence the disease is circulating. The declaration also follows a … [+7614 chars]"}]}