{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "Lisa Schlein", "title": "Most Global Deaths Are From Preventable Noncommunicable Diseases - Voice of America - VOA News", "description": "Noncommunicable diseases kill 41 million people each year, equivalent to 74 percent of all deaths globally", "url": "https://www.voanews.com/a/most-global-dearth-are-from-preventable-noncommunicable-diseases/6756652.html", "urlToImage": "https://gdb.voanews.com/09860000-0aff-0242-d31d-08da9bcfaa64_w1200_r1.jpg", "publishedAt": "2022-09-21T13:05:52Z", "content": "GENEVA  The World Health Organization warns noncommunicable diseases kill 41 million people each year, equivalent to 74 percent of all deaths globally.\r\nA new global report by the World Health Organi… [+1922 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "© AFP 2022", "title": "American, Russians to blast off for ISS as war rages in Ukraine - Briefly ", "description": "A US astronaut and two Russian cosmonauts are set to blast off to the International Space Station Wednesday on a Russian-operated flight despite soaring tensions between Moscow and Washington over Russia's invasion of Ukraine.", "url": "https://briefly.co.za/world/139466-american-russians-blast-iss-war-rages-ukraine/", "urlToImage": "https://netstorage-briefly.akamaized.net/images/5e3eec67f0a6f38e.jpg", "publishedAt": "2022-09-21T04:10:20Z", "content": "NASA astronaut Frank Rubio (L), and Russian cosmonauts Sergey Prokopyev and Dmitri Petelin, are set to blast off to the International Space Station (ISS).\r\nPhoto: Dmitry LOVETSKY / POOL/AFPSource: AF… [+3575 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Judge ties Babe Ruth with 60th home run, Yankees stun Pirates with epic comeback - Sportsnet.ca", "description": "The New York Yankees completed a stunning five-run, ninth-inning rally to beat the Pittsburgh Pirates 9-8 while Aaron Judge moved within one of Roger Maris' American League record.", "url": "https://www.sportsnet.ca/mlb/article/yankees-aaron-judge-ties-babe-ruth-with-60th-home-run-of-season/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/09/New-York-Yankees-Aaron-Judge-1040x572.jpg", "publishedAt": "2022-09-21T02:35:00Z", "content": "NEW YORK (AP) Aaron Judge sent a sinker soaring into the left-field bleachers, another of his no-doubt drives, and circled the bases for the 60th time.\r\nModest throughout a march into history that no… [+4800 chars]"}, {"source": {"id": null, "name": "Olt.ubc.ca"}, "author": null, "title": "AI cell analytics app aims to supercharge biotechnology research - UBC Faculty of Medicine - UBC Faculty of Medicine", "description": "Ranked among the world’s top medical schools with the fifth-largest MD enrollment in North America, the UBC Faculty of Medicine is a leader in both the science and the practice of medicine. Across British Columbia, more than 12,000 faculty and staff are train…", "url": "https://med-fom-faculty.sites.olt.ubc.ca/news/ai-cell-analytics-app-aims-to-supercharge-biotechnology-research/", "urlToImage": "https://med-fom-faculty.sites.olt.ubc.ca/files/2022/09/Snapcyte-1200x600-1.png", "publishedAt": "2022-09-20T23:08:12Z", "content": "Transformative technology developed at the Vancouver Prostate Centre (VPC) is putting cell analytics into the hands of scientists around the globe. The technology an artificial intelligence (AI)-driv… [+3995 chars]"}, {"source": {"id": null, "name": "Gizmodo.com"}, "author": "Ed Cara", "title": "America's Sexually Transmitted Disease Problem Is 'Out of Control' - Gizmodo", "description": "At a conference this week, public health experts and health officials sounded an alarm over growing case numbers of syphilis, gonorrhea, and chlamydia.", "url": "https://gizmodo.com/sexually-transmitted-diseases-us-chlamydia-cdc-1849558467", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/ff0c68bfd791491f56d2ec44cab2adc6.jpg", "publishedAt": "2022-09-20T17:20:00Z", "content": "Sexually transmitted diseases in the U.S. are at a crisis point. On Monday, prominent public health experts and government officials raised an alarm over the ongoing annual rise in STDs. Preliminary … [+3650 chars]"}, {"source": {"id": null, "name": "Barcauniversal.com"}, "author": "Michel Durant", "title": "Barcelona and Real Madrid closely scouting teenage wonderkid from Brazil - Barca Universal", "description": "Barcelona are continuing to monitor the Brazilian market to get their hands on the next best talent coming through the South American nation. The Catalan giants have a strong interest in Palmeiras wonderkid Endrick, who they have been monitoring for months. T…", "url": "https://barcauniversal.com/barcelona-and-real-madrid-closely-scouting-teenage-wonderkid-from-brazil/", "urlToImage": "https://barcauniversal.com/wp-content/uploads/2022/09/palmeiras-v-athletico-parananese-copa-conmebol-libertadores-2022-semifinals-1000x600.jpg", "publishedAt": "2022-09-20T11:10:42Z", "content": "Barcelona are continuing to monitor the Brazilian market to get their hands on the next best talent coming through the South American nation.\r\nThe Catalan giants have a strong interest in Palmeiras w… [+2094 chars]"}]}