{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Erin Cunningham", "title": "Covid-19 live updates: Brazil and India now worst-hit hotspots with record new cases and deaths - The Washington Post", "description": "In the United States, some 30.8 million people have been infected by the virus. More than 558,000 Americans have died due to covid-19.", "url": "https://www.washingtonpost.com/nation/2021/04/08/coronavirus-covid-live-updates-us/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PQGFZEUYFMI6XDYKGOCM6T5TTE.jpg&w=1440", "publishedAt": "2021-04-08T08:29:00Z", "content": "Indias Prime Minister Narendra Modi received his second dose of coronavirus vaccine Thursday, posting a photo on Twitter from the vaccination site in New Delhi as daily case numbers hit a record high… [+1298 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Margaret Atwood", "title": "‘It has never been more pertinent’ – Margaret Atwood on the chilling genius of Laurie Anderson’s Big Science - The Guardian", "description": "The seminal album, with its extraordinary hit single O Superman, was unlike anything the writer had ever heard. As Bad Science returns, Atwood pays tribute to its prophetic dissection of 80s America", "url": "https://amp.theguardian.com/music/2021/apr/08/margaret-atwood-laurie-anderson-big-science-o-superman-prophetic-80s-america-pertinent", "urlToImage": null, "publishedAt": "2021-04-08T05:00:00Z", "content": "MusicThe seminal album, with its extraordinary hit single O Superman, was unlike anything the writer had ever heard. As Bad Science returns, Atwood pays tribute to its prophetic dissection of 80s Ame… [+7669 chars]"}, {"source": {"id": "nbc-news", "name": "NBC News"}, "author": "Martha C. White", "title": "Biden's plan to overhaul tax code would close offshore tax loopholes - NBC News", "description": "President Joe Biden’s ambitious tax plan aims to rectify “shortcomings\" and will be more fair for middle-class Americans, the president said Wednesday.", "url": "https://www.nbcnews.com/business/economy/biden-s-plan-overhaul-tax-code-would-close-offshore-tax-n1263372", "urlToImage": "https://media4.s-nbcnews.com/j/newscms/2021_14/3462828/210407-janet-yellen-ew-430p_8998b15975244262a476e4f6f8511895.nbcnews-fp-1200-630.jpg", "publishedAt": "2021-04-07T22:14:00Z", "content": "President Joe Bidens tax plan would hike the corporate tax rate to bring in $2.5 trillion over 15 years to fund the sweeping $2 trillion infrastructure proposal unveiled last week, according to detai… [+6157 chars]"}]}