{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Sarah Fortinsky", "title": "France summons US Ambassador Kushner over allegations concerning antisemitism - The Hill", "description": "France will summon U.S. Ambassador Charles Kushner to its foreign ministry on Monday after the American diplomat levied sharp allegations against his host country over its “lack of sufficient action” in response to the rise of antisemitism. The French Ministr…", "url": "https://thehill.com/policy/international/5468292-kushner-alleges-french-antisemitism/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/11/AP24335672034690-1-e1732993594521.jpg?w=1280", "publishedAt": "2025-08-25T01:40:00Z", "content": "Skip to content\r\nFrance will summon U.S. Ambassador Charles Kushner to its foreign ministry on Monday after the American diplomat levied sharp allegations against his host country over its “lack of s… [+3020 chars]"}, {"source": {"id": null, "name": "NASCAR"}, "author": "Reid Spencer", "title": "Ryan Blaney’s win at Daytona is a powerful omen for Team Penske - NASCAR.com", "description": "DAYTONA BEACH, Fla. -- It happens every fall -- in NASCAR’s Next Gen era, at least. As reliably as jack-o’-lanterns populate the front porches of America with Halloween approaching, the NASCAR Cup Series Playoffs take a turn toward a certain Ford team when th…", "url": "https://www.nascar.com/news-media/2025/08/24/ryan-blaneys-win-at-daytona-is-a-powerful-omen-for-team-penske/", "urlToImage": "https://www.nascar.com/wp-content/uploads/sites/7/2025/08/24/2025-aug23-ryan-blaney-confetti-672x372.jpg", "publishedAt": "2025-08-24T20:22:52Z", "content": "DAYTONA BEACH, Fla. — It happens every fall — in NASCAR’s Next Gen era, at least.\r\nAs reliably as jack-o’-lanterns populate the front porches of America with Halloween approaching, the NASCAR Cup Ser… [+4021 chars]"}]}