{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "SEUNG MIN KIM, COLLEEN LONG, ELLIOT SPAGAT, STEPHEN GROVES", "title": "Biden unveils plans to enact restrictions on migrants seeking asylum at US-Mexico border - The Associated Press", "description": "President Joe Biden says he’s restricting asylum to help “gain control” of the U.S.-Mexico border. The American Civil Liberties Union says it'll sue over Biden's plan to enact immediate significant restrictions on migrants seeking asylum at the border. Biden …", "url": "https://apnews.com/article/biden-asylum-migration-immigration-mexico-border-dec5f83b468b5795479bf1f5e49799d5", "urlToImage": "https://dims.apnews.com/dims4/default/e14359a/2147483647/strip/true/crop/5175x2911+0+270/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7d%2Fa3%2F48be96c00e2014d1b43795b37657%2Fe93ec3aa1a384424bc30ea847f080b24", "publishedAt": "2024-06-04T21:45:00Z", "content": "WASHINGTON (AP) President Joe Biden on Tuesday unveiled plans to enact immediate significant restrictions on migrants seeking asylum at the U.S.-Mexico border as the White House tries to neutralize i… [+8924 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Tara Suter", "title": "By 2050, 61 percent of Americans will have some kind of cardiovascular disease: Report - The Hill", "description": "More than 6 in 10 Americans will have a cardiovascular disease by 2050, according to a new report from the American Heart Association (AHA). The report, published Tuesday in the journal Circulation, found that cardiovascular disease, including hypertension, “…", "url": "https://thehill.com/policy/healthcare/4702826-by-2050-61-percent-of-americans-will-have-some-kind-of-cardiovascular-disease-report/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2024/01/GettyImages-1179846145.jpg?w=1280", "publishedAt": "2024-06-04T18:09:00Z", "content": "Skip to content\r\nMore than 6 in 10 Americans will have a cardiovascular disease by 2050, according to a new report from the American Heart Association (AHA).\r\nThe report, published Tuesday in the jou… [+1789 chars]"}]}