{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "KSL.com"}, "author": "Aya Elamroussi, CNN", "title": "COVID-19 numbers are getting better. But where they go from here will depend on vaccinations, Fauci says - KSL.com", "description": "The rates of COVID-19  cases, hospitalizations and deaths are improving; an optimistic sign for the future of the pandemic. But with so many Americans still unvaccinated, the numbers could still go back up, Dr. Anthony Fauci told Fox News Sunday.", "url": "https://www.ksl.com/article/50263725/covid-19-numbers-are-getting-better-but-where-they-go-from-here-will-depend-on-vaccinations-fauci-says", "urlToImage": "https://img.ksl.com/slc/2840/284083/28408382.jpg?filter=ksl/responsive_story_lg", "publishedAt": "2021-10-18T03:49:29Z", "content": "Estimated read time: 9-10 minutes\r\nWASHINGTON The rates of COVID-19 cases, hospitalizations and deaths are improving; an optimistic sign for the future of the pandemic. But with so many Americans sti… [+10522 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Miriam Berger", "title": "Who is 400 Mawozo, the Haitian gang accused of kidnapping American missionaries? - The Washington Post", "description": "For Haitians rich and poor, gang violence and kidnappings for ransom have become a tragically common facet of life.", "url": "https://www.washingtonpost.com/world/2021/10/17/haiti-kidnapping-400-mawozo-christian-aid/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/A2KC2MRPK4I6ZABWPWZFLP7ROY.jpg&w=1440", "publishedAt": "2021-10-18T00:21:49Z", "content": "Haiti, the Western Hemispheres poorest country, holds the grim record of the worlds highest kidnapping rate per capita. One gang 400 Mawozo was responsiblefor 80 percent of abductions in Haiti from J… [+131 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "NASA’s Latest Mission to Explore Asteroids Near Jupiter’s Orbit - VOA Learning English", "description": "The latest mission of the American space agency, NASA, will explore a group of ancient objects orbiting the sun at the distance of Jupiter. Set to launch October 16, the Lucy spacecraft is designed to study Jupiter’s “Trojan” asteroids.", "url": "https://learningenglish.voanews.com/a/nasa-latest-mission-to-explore-asteroids-near-jupiter-s-orbit/6270940.html", "urlToImage": "https://gdb.voanews.com/EB13CF59-5331-4DBA-93AB-56D45FBC20B0_cx0_cy6_cw0_w1200_r1.jpg", "publishedAt": "2021-10-17T22:02:37Z", "content": "The latest mission of the American space agency, NASA, will explore a group of ancient objects orbiting the sun at the distance of Jupiter.\r\nSet to launch October 16, the Lucy spacecraft is designed … [+3762 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Zahra Tayeb", "title": "NASA is studying how to build a Wi-Fi network on the moon, it hopes it could also solve Earth's digital divide - Business Insider South Africa", "description": "A conceptual NASA study explores the idea of a lunar Wi-Fi network to help fix inadequate internet services in American cities, including Cleveland, Ohio.", "url": "https://www.businessinsider.com/nasa-lunar-moon-wi-fi-network-earth-digital-divide-cleveland-2021-10", "urlToImage": "https://i.insider.com/6168303b38c19600182fd518?width=1200&format=jpeg", "publishedAt": "2021-10-17T14:33:08Z", "content": "A new study revealed by NASA considers the possibility of building a lunar Wi-Fi network, the agency reported. \r\nIt comes in an effort to address inadequate internet access across parts of the US and… [+3133 chars]"}]}