{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New process breaks down biodegradable plastics faster: Invention could solve waste management challenges on the battlefield - Science Daily", "description": "Scientists invented a way to make compostable plastics break down within a few weeks with just heat and water. This advance will potentially solve waste management challenges at forward operating bases and offer additional technological advances for American …", "url": "https://www.sciencedaily.com/releases/2021/04/210421124516.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-04-21T19:44:07Z", "content": "With Army funding, scientists invented a way to make compostable plastics break down within a few weeks with just heat and water. This advance will potentially solve waste management challenges at fo… [+6578 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Alex Woodward", "title": "‘She was a child’: White House calls fatal police shooting of Ma’Khia Bryant ‘tragic’ - The Independent", "description": "Jen Psaki says killing of 16 year old ‘came just as America was hopeful for a step forward’ after Chauvin guilty verdict", "url": "https://www.independent.co.uk/news/world/americas/us-politics/biden-psaki-makhia-bryant-statement-b1835355.html", "urlToImage": "https://static.independent.co.uk/2021/04/21/18/09148772.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-04-21T17:56:08Z", "content": "The White House called the police killing of a Black teenage girl in Ohio, which occurred moments before a guilty verdict was announced in the trial of former police officer Derek Chauvin for the dea… [+2812 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Brazil COVID-19 cases dropping but relaxing health measures could reverse gains: PAHO - CNA", "description": "Brazil is seeing a drop in COVID-19 cases including in the hard-hit Amazon region but the relaxation of measures by some municipal governments could bring reversal in that improvement, the Pan American Health Organization (PAHO) Director Carissa Etienne warne…", "url": "https://www.channelnewsasia.com/news/world/brazil-covid-19-cases-dropping-but-relaxing-health-measures-14667918", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14667916/16x9/991/557/fda89e3b4aae81ddbc4d7d865b03db46/Jz/covid-19-vaccinations-in-duque-de-caxias--near-rio-de-janeiro-1.jpg", "publishedAt": "2021-04-21T17:51:56Z", "content": "SANTIAGO: Brazil is seeing a drop in COVID-19 cases including in the hard-hit Amazon region but the relaxation of measures by some municipal governments could bring reversal in that improvement, the … [+2356 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Christina Maxouris", "title": "The U.S. is vaccinating millions of Americans daily, but here's why COVID-19 cases and hospitalizations are up - CTV News", "description": "Experts say COVID-19 vaccinations in the U.S. are continuing at an impressive pace, and now all Americans 16 and up can get a shot. But a leading health official said that the country remains in a 'complicated stage' of the pandemic.", "url": "https://www.ctvnews.ca/health/coronavirus/the-u-s-is-vaccinating-millions-of-americans-daily-but-here-s-why-covid-19-cases-and-hospitalizations-are-up-1.5395840", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5395844.1618996869!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-04-21T09:23:00Z", "content": "Experts say COVID-19 vaccinations in the U.S. are continuing at an impressive pace, and now all Americans 16 and up can get a shot. But a leading health official said that the country remains in a \"c… [+7607 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "Channel NewsAsia", "title": "Train To Busan actor to star in, produce US remake of Korean series Trap - CNA", "description": "Ma Dong-seok, who’s also known as Don Lee, will play a detective investigating a group of hunters who attacked a famous news anchor and his family while on a camping trip. This is a rare instance of an American remake of a Korean show featuring a Korean lead.", "url": "https://cnalifestyle.channelnewsasia.com/trending/ma-dong-seok-don-lee-club-us-remake-korean-series-trap-14664032", "urlToImage": "https://www.channelnewsasia.com/image/14664068/16x9/768/432/ad178f2b016c976e3dab673a7e96e81e/Fb/korean-actor-ma-dong-seok.jpg", "publishedAt": "2021-04-21T03:30:15Z", "content": null}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Genome-Wide Data from Stone Age Bears Recovered from Cave Sediments | Genetics, Paleontology - Sci-News.com", "description": "Scientists have reconstructed the genomes of the extinct giant short-faced bear (Arctodus simus) and the American black bear (Ursus americanus) using environmental DNA fragments from the remote Chiquihuite Cave in Mexico.", "url": "http://www.sci-news.com/paleontology/stone-age-bear-genome-wide-data-chiquihuite-cave-09572.html", "urlToImage": "http://cdn.sci-news.com/images/2016/04/image_3800-Arctodus-simus.jpg", "publishedAt": "2021-04-20T18:42:15Z", "content": "Scientists have reconstructed the genomes of the extinct giant short-faced bear (Arctodus simus) and the American black bear (Ursus americanus) using environmental DNA fragments from the remote Chiqu… [+3656 chars]"}]}