{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Astronaut Raja Chari Returns To Earth After 6 Months At Space Station - NDTV", "description": "Indian-American astronaut Raja Chari was among the four astronauts aboard a Space X spacecraft which on Friday safely splashed down in the Gulf of Mexico, off the coast of Florida, US after spending nearly six months in space.", "url": "https://www.ndtv.com/world-news/space-x-spacecraft-with-indian-origin-astronaut-aboard-makes-safe-return-to-earth-2952458", "urlToImage": "https://c.ndtvimg.com/2021-11/ljhe564g_raja-chari-astronaut-afp-650_625x300_11_November_21.jpg", "publishedAt": "2022-05-06T15:17:07Z", "content": "The astronauts spent 177 days in orbit on the SpaceX Dragon Endurance craft to the ISS. (File)\r\nWashington: Indian-American astronaut Raja Chari was among the four astronauts aboard a Space X spacecr… [+3650 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "Moohita Kaur Garg", "title": "First Blood Moon of 2022: What is it and why ancient civilisations feared it - WION", "description": "Earth will soon witness a Blood Moon. From parts of Antarctica, the Americas, as well as western Europe, Africa and parts of the eastern Pacific, the eclipse will be visible late May 15th and early May 16th.", "url": "https://www.wionews.com/world/first-blood-moon-of-2022-what-is-it-and-why-ancient-civilisations-feared-it-476857", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2022/05/06/260237-stories-18.jpg", "publishedAt": "2022-05-06T12:27:36Z", "content": "Earth will soon witness a 'Blood Moon'. From parts of Antarctica, the Americas, as well as western Europe, Africa and parts of the eastern Pacific, the eclipse will be visible late May 15th and early… [+2139 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "World’s biggest hydrogen trucks start work at Anglo American - BusinessTech", "description": "Anglo American on Friday unveiled the world’s biggest green-hydrogen powered truck at a platinum mine in northeast South Africa where it aims to replace a fleet of 40 diesel-fueled vehicles that each use about a million liters of the fossil fuel every year.", "url": "https://businesstech.co.za/news/energy/583728/worlds-biggest-hydrogen-trucks-start-work-at-anglo-american/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/05/AngloAmericanTruck-e1651816293802.png", "publishedAt": "2022-05-06T05:53:57Z", "content": "Anglo American on Friday unveiled the worlds biggest green-hydrogen powered truck at a platinum mine in northeast South Africa where it aims to replace a fleet of 40 diesel-fueled vehicles that each … [+2445 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Quinlivan: My third pregnancy was a surprise - The Star Online", "description": "TAIWANESE-American actress Hannah Quinlivan, who is married to King of Mandopop Jay Chou, revealed that her third pregnancy was a surprise and she had only found out about it after experiencing constipation, reported Sin Chew Daily.", "url": "https://www.thestar.com.my/news/nation/2022/05/06/quinlivan-my-third-pregnancy-was-a-surprise", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/05/06/1575252.jpg", "publishedAt": "2022-05-06T00:27:52Z", "content": "Compiled by C. ARUNO and MARTIN CARVALHO\r\nTAIWANESE-American actress Hannah Quinlivan, who is married to King of Mandopop Jay Chou, revealed that her third pregnancy was a surprise and she had only f… [+2243 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Brian P. Dunleavy", "title": "Public Health Watch: Second Thoughts on a Second Booster? - Contagionlive.com", "description": "The number of Americans who opt for an additional booster dose of a COVID-19 vaccine may be limited.", "url": "https://www.contagionlive.com/view/public-health-watch-second-thoughts-on-a-second-booster-", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/02298c211e15a90a670964eac6518178a5f907ff-3984x2656.jpg?fit=crop&auto=format", "publishedAt": "2022-05-05T16:24:16Z", "content": "To boost (again), or not to boost. That is the question (with apologies to Shakespeare).\r\nIn recent weeks, the US Food and Drug Administration expanded its authorization of the Pfizer/BioNTech and Mo… [+2434 chars]"}, {"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "Canada is open to Americans who may lose access to abortions, but there's a catch - POLITICO", "description": "While the offers from Trudeau's government and providers are sincere, the reality is that access in Canada is complicated and \"wait lists are through the roof.\"", "url": "https://www.politico.com/news/2022/05/05/canada-americans-access-abortions-00030209", "urlToImage": "https://static.politico.com/ef/f5/90c388754843b3c76ecf35496181/https-delivery.gettyimages.com/downloads/77159258", "publishedAt": "2022-05-05T15:29:45Z", "content": "Political reaction in Canada to the draft Supreme Court opinion has been swift, with no shortage of posturing. Americans have always been free to travel to Canada for medical care, for example.\r\nIf a… [+6103 chars]"}]}