{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "The Star Online"}, "author": "Che Pan", "title": "Tech war: China's top chip equipment maker removes US employees from product development after Washington imposes restrictions - The Star Online", "description": "China’s top semiconductor equipment maker Naura Technology Group has told its American employees in China to stop taking part in component and machinery development to comply with Washington’s restrictions on the involvement of US citizens in key facilities o…", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/10/15/tech-war-chinas-top-chip-equipment-maker-removes-us-employees-from-product-development-after-washington-imposes-restrictions", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/10/15/1777802.jpg", "publishedAt": "2022-10-15T08:44:00Z", "content": "Chinas top semiconductor equipment maker Naura Technology Group has told its American employees in China to stop taking part in component and machinery development to comply with Washingtons restrict… [+2828 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "MLim", "title": "SEVENTEEN Announces Additional Dates And Cities For 2022 World Tour “BE THE SUN” - soompi", "description": "SEVENTEEN has confirmed additional dates and cities for their Asian tour! The day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13, SEVENTEEN gave a pleasant surprise to their fans by releasi…", "url": "https://www.soompi.com/article/1549677wpp/seventeen-announces-additional-dates-and-cities-for-2022-world-tour-be-the-sun", "urlToImage": "https://6.viki.io/image/e080978d62e44f089b59633aa53b8eaf/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-10-14T08:37:26Z", "content": "SEVENTEEN has confirmed additional dates and cities for their Asian tour!\r\nThe day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13… [+504 chars]"}]}