{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Xtramagazine.com"}, "author": null, "title": "“I felt like they were afraid of me.” Monkeypox patients call out lack of support from healthcare professionals, government - Xtra Magazine", "description": "As cases continue to rise in North America, queer and trans men are still struggling to access monkeypox vaccines, treatment and financial aid", "url": "https://xtramagazine.com/health/monkeypox-stigma-234852", "urlToImage": "https://u2k3a4x7.stackpathcdn.com/wp-content/uploads/2022/08/08_26_MonkeypoxStigma_cr_GettyImages.jpg", "publishedAt": "2022-08-26T15:33:31Z", "content": "Without emergency treatment, lesions from monkeypox would have cost Brandon sight in one of his eyes.\r\nThe 36-year-old from Toronto contracted the virus in mid-June and the effects were physically an… [+11698 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WHO reports 21% decline in monkeypox cases globally, but US still seeing spike - CNA", "description": "The WHO said the number of global monkeypox cases fell by more than 20% last week. While infections in Europe dropped, the US and Latin America are still see...", "url": "https://www.youtube.com/watch?v=6aBVPearjbE", "urlToImage": "https://i.ytimg.com/vi/6aBVPearjbE/hqdefault.jpg", "publishedAt": "2022-08-26T14:25:42Z", "content": null}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "US Senator Blackburn arrives in Taiwan - The Manila Times", "description": "TAIPEI: US Sen. Marsha Blackburn landed in Taiwan late Thursday, the fourth visit by an American politician this month and a move bound to rile Beijing, which has staged huge...", "url": "https://www.manilatimes.net/2022/08/27/news/world/us-senator-blackburn-arrives-in-taiwan/1856139", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2022/08/26/101910.jpg", "publishedAt": "2022-08-26T13:26:21Z", "content": "TAIPEI: US Sen. Marsha Blackburn landed in Taiwan late Thursday, the fourth visit by an American politician this month and a move bound to rile Beijing, which has staged huge military drills to prote… [+3351 chars]"}]}