{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Dhs.gov"}, "author": null, "title": "ICE Launches Operation Midway Blitz in Honor of Katie Abraham to Target Criminal Illegal Aliens Terrorizing Americans in Sanctuary Illinois - Homeland Security (.gov)", "description": "The Department of Homeland Security announced Operation Midway Blitz in honor of Katie Abraham who was killed in a drunk driving hit-and-run car wreck caused by criminal illegal alien Julio Cucul-Bol in Illinois. This ICE operation will target the criminal il…", "url": "https://www.dhs.gov/news/2025/09/08/ice-launches-operation-midway-blitz-honor-katie-abraham-target-criminal-illegal", "urlToImage": "https://www.dhs.gov/sites/default/files/2024-02/24_0206_opa_og-image-dhs.jpg", "publishedAt": "2025-09-08T17:12:18Z", "content": "Thanks to Governor Pritzkers sanctuary policies, TdA gang members, rapists, kidnappers, and drug traffickers are being released onto Chicagos streets\r\nCHICAGO Today, the Department of Homeland Securi… [+4523 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "'Blood moon' gallery: Stunning snaps from last night's total lunar eclipse - Live Science", "description": "A \"blood moon\" hovered above parts of the globe last night. And while North America missed out, we've rounded up some of the best photographs of September 2025's total lunar eclipse.", "url": "https://www.livescience.com/space/the-moon/blood-moon-gallery-stunning-snaps-from-last-nights-total-lunar-eclipse", "urlToImage": "https://cdn.mos.cms.futurecdn.net/9LgdtNG5YGobkphJDuBXgJ.jpg", "publishedAt": "2025-09-08T15:28:18Z", "content": "A lunar eclipse can give the moon a red hue, which is why it's called a \"blood moon.\" Here it is photographed with double exposure above Jiujiang, China. (Image credit: Photo by Shen Junfeng/VCG via … [+3316 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sara  Moniuszko", "title": "Chagas disease, or deadly kissing bug disease, has spread in the U.S. Here's what to know. - CBS News", "description": "Chagas disease​ is already endemic to 21 countries in the Americas, and growing evidence of the parasite is challenging the non-endemic label in the U.S., the CDC says.", "url": "https://www.cbsnews.com/news/chagas-disease-deadly-kissing-bug-spread-us/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2025/09/08/31f4e14c-817f-46d8-9c80-cd7f997a24d3/thumbnail/1200x630/84ac0c84f8073f8e9dce1a3d67b21cc5/gettyimages-1689262788.jpg", "publishedAt": "2025-09-08T14:59:13Z", "content": "Chagas disease, a potentially deadly condition caused by an infected triatomine insect or \"kissing bug,\" may be becoming endemic in the United States, according to a Centers for Disease Control and P… [+4288 chars]"}]}