{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "the-hill", "name": "The Hill"}, "author": "Peter Sullivan", "title": "Why the latest rise in COVID-19 cases is being treated differently - Yahoo News", "description": "COVID-19 cases are showing signs of rising again, even as many Americans are eager to move on. Washington, D.C., has been hit with a string of high-profile cases in Congress and the administration, and cases in the city overall are on the rise. New York and o…", "url": "https://thehill.com/policy/healthcare/3264400-why-the-latest-rise-in-covid-19-cases-is-being-treated-differently/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2022/04/coronavirus_baltimore_040522ap-julio-cortez_rise.jpg?w=1280", "publishedAt": "2022-04-11T20:53:46Z", "content": "COVID-19 cases are showing signs of rising again, even as many Americans are eager to move on.\r\nWashington, D.C., has been hit with a string of high-profile cases in Congress and the administration, … [+6064 chars]"}, {"source": {"id": null, "name": "Standard-Examiner"}, "author": null, "title": "Raising awareness for people diagnosed with IBS | News, Sports, Jobs - Standard-Examiner", "description": "Nearly 45 million Americans suffer from a condition they might find embarrassing to talk about, but health experts say it’s important to discuss with your doctor to find relief. Irritable Bowel Syndrome is a condition of the digestive system that affects peop…", "url": "https://www.standard.net/news/health-news/2022/apr/11/raising-awareness-for-people-diagnosed-with-ibs/", "urlToImage": "https://ogden_images.s3.amazonaws.com/www.standard.net/images/2022/04/09234553/FPbIaOCVEAAQorm.png", "publishedAt": "2022-04-11T17:19:56Z", "content": "Photo supplied\r\nFlier for IBS Awareness month.\r\nNearly 45 million Americans suffer from a condition they might find embarrassing to talk about, but health experts say its important to discuss with yo… [+2844 chars]"}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Lee Khang Yi", "title": "Heads up, burger fans: You can now get your Five Guys hamburger at Pavilion KL for RM2 cheaper than at Genting Highlands outlet - Malay Mail", "description": "KUALA LUMPUR, April 11 — Today marks the opening of the second Malaysian outlet for American burger joint Five Guys at the Connection Level 3, Pavilion Kuala Lumpur. What’s on every burger fan’s mind is whether the menu prices are cheaper compared to their Ge…", "url": "https://www.malaymail.com/news/eat-drink/2022/04/11/heads-up-burger-fans-you-can-now-get-your-five-guys-hamburger-at-pavilion-k/2052927", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-04/five_guys1_pavilion_11042022-seo.jpg", "publishedAt": "2022-04-11T10:28:54Z", "content": "American burger joint Five Guys opened their second outlet at the Connection Level 3 of Pavilion KL. Picture from Five Guys Malaysia\r\nKUALA LUMPUR, April 11 Today marks the opening of the second Mala… [+3773 chars]"}]}