{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Variety"}, "author": "Rebecca Rubin", "title": "‘The Invitation’ Tops Box Office With $7 Million in Catastrophically Slow Weekend - Variety", "description": "If three new movies debut in theaters, but nobody goes to see them… That is how Sony’s creepy thriller “The Invitation” managed to top box office charts with a paltry $7 million from 3,114 North American cinemas. Its win comes with some pretty weak bragging r…", "url": "https://variety.com/2022/film/box-office/the-invitation-box-office-slow-weekend-1235352792/", "urlToImage": "https://variety.com/wp-content/uploads/2022/08/The-Invitation.jpg?w=1000", "publishedAt": "2022-08-28T14:56:00Z", "content": "If three new movies debut in theaters, but nobody goes to see them…\r\nThat is how Sony’s creepy thriller “The Invitation” managed to top box office charts with a paltry $7 million from 3,114 North Ame… [+4958 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Two US Navy warships transit through Taiwan Strait - The Star Online", "description": "Two United States warships sailed through the Taiwan Strait on Sunday, the American navy said, the first such transit since China staged unprecedented military drills around the island.", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2022/08/28/two-us-navy-warships-transit-through-taiwan-strait", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2022/08/28/1715126.jpg", "publishedAt": "2022-08-28T06:23:00Z", "content": "WASHINGTON, Aug 28, 2022 (AFP): Two United States warships sailed through the Taiwan Strait on Sunday, the American navy said, the first such transit since China staged unprecedented military drills … [+2267 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Perseverance Rover Discovers Rocks Shaped By Water On Mars - NDTV", "description": "American Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet that may have life-related traces.", "url": "https://www.ndtv.com/world-news/nasas-perseverance-rover-discovers-rocks-shaped-by-water-on-mars-3291878", "urlToImage": "https://c.ndtvimg.com/2022-08/uumg5tto_jezero-crater_625x300_27_August_22.jpg", "publishedAt": "2022-08-27T11:22:22Z", "content": "Scientists believe that the Martian surface was once filled with water.\r\nAmerican Space Agency NASA's Perseverance rover has discovered stunning Martian rocks in the Jezero crater on the Red Planet t… [+2171 chars]"}, {"source": {"id": null, "name": "Dominicantoday.com"}, "author": "Merit Designs Consulting Group, 2006-2020", "title": "“Vaccinated mosquitoes” used to combat dengue fever - Dominican Today", "description": "<p>This experiment was unveiled at yesterday’s commemoration of International Dengue Day. The Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addition to measures such as the elimination of mosquito breedi…", "url": "https://dominicantoday.com/dr/local/2022/08/27/vaccinated-mosquitoes-used-to-combat-dengue-fever/", "urlToImage": "https://dominicantoday.com/wp-content/uploads/2022/08/14_El-Mundo_27_1p01.jpg", "publishedAt": "2022-08-27T10:11:00Z", "content": "This experiment was unveiled at yesterday’s commemoration of International Dengue Day.\r\nThe Americas continue to fight a tough battle to counteract the advance of dengue fever in the region. In addit… [+2024 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Karyn Maughan and Jan Gerber", "title": "Public Protector paid 'fugitive from justice' Ngobeni R87k for articles bashing Mkhwebane foes - News24", "description": "Paul Ngobeni was disbarred in several states in the US and, after being charged with several counts of larceny, forgery and practising while not an attorney in 2007, he went on the run from American law enforcement agencies.", "url": "https://www.news24.com/news24/southafrica/politics/parliament/public-protector-paid-fugitive-from-justice-ngobeni-r87k-for-articles-bashing-mkhwebane-foes-20220827", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3752/8caecffd900f407b9d16cbe797d204ce.jpeg", "publishedAt": "2022-08-27T04:00:14Z", "content": "\"Fugitive from justice\" Paul Ngobeni was credited for suggesting Public Protector Busisiwe Mkhwebane sue the government for \"insufficient funding\", while he collected massive pay cheques from her off… [+468 chars]"}]}