{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "New York Times"}, "author": "Roni Caryn Rabin", "title": "CDC Will Not Investigate Mild Infections in Vaccinated Americans - The New York Times", "description": "At least 10,000 vaccinated people were infected with the coronavirus through the end of April. Now the agency has stopped pursuing the mildest cases.", "url": "https://www.nytimes.com/2021/05/25/health/cdc-coronavirus-infections-vaccine.html", "urlToImage": "https://static01.nyt.com/images/2021/05/21/science/00VIRUS-BREAKTHROUGH1/00VIRUS-BREAKTHROUGH1-facebookJumbo.jpg", "publishedAt": "2021-05-25T17:11:37Z", "content": "She is still not back to her daily three-mile runs with her dog because of shortness of breath. Im young, 43, healthy, with no pre-existing conditions, but you often find me now on the couch resting,… [+1642 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brooke Singman", "title": "McCarthy, Kustoff introduce bill targeting anti-Semitic hate crimes amid wave of attacks - Fox News", "description": "EXCLUSIVE: House Minority Leader Kevin McCarthy and GOP Rep. David Kustoff on Tuesday rolled out a bill to prevent anti-Semitic hate crimes after a wave of violent attacks against American Jews in the U.S. amid the conflict between Israel and Hamas.", "url": "https://www.foxnews.com/politics/house-republicans-anti-semitic-hate-crimes-bill", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/Kevin-McCarthy-Mask-House-of-Representatives-AP.jpg", "publishedAt": "2021-05-25T16:15:29Z", "content": "EXCLUSIVE: House Minority Leader Kevin McCarthy and GOP Rep. David Kustoff on Tuesday rolled out a bill to prevent anti-Semitic hate crimes amid a wave of violent attacks against American Jews in the… [+11017 chars]"}, {"source": {"id": null, "name": "Bitcoin Magazine"}, "author": "Peter Chawaga", "title": "Elon Musk, Michael Saylor Announce Bitcoin Mining Council - Bitcoin Magazine", "description": "Elon Musk and Michael Saylor attended a private meeting with North American bitcoin miners to propel renewable energy use.", "url": "https://bitcoinmagazine.com/business/musk-saylor-announce-bitcoin-mining-council", "urlToImage": "https://bitcoinmagazine.com/.image/t_share/MTgwODA0OTg3MjcyNjM1NDgw/miners.png", "publishedAt": "2021-05-25T15:45:39Z", "content": "Influential CEOs Elon Musk and Michael Saylor have announced that they held a closed meeting with Bitcoin mining firms based in North America that plan to launch a group called the Bitcoin Mining Cou… [+2066 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Aria Bendix", "title": "Most breakthrough coronavirus cases after vaccine due to variants: CDC - Business Insider", "description": "Just 10,000 out of 100 million fully vaccinated Americans got COVID-19 weeks after their shots, the CDC found.", "url": "https://www.businessinsider.com/breakthrough-coronavirus-caes-after-vaccines-variants-cdc-2021-5", "urlToImage": "https://i.insider.com/60ad00dca412370019d31c3d?width=1200&format=jpeg", "publishedAt": "2021-05-25T15:42:20Z", "content": "By the end of April, more than 100 million Americans had received their coronavirus vaccines.\r\nClinical trial data had indicated that the vaccines would reduce their risk of getting symptomatic COVID… [+3266 chars]"}, {"source": {"id": null, "name": "Investor's Business Daily"}, "author": "Investor's Business Daily", "title": "Dow Jones Today Heads For 4 As Stocks Climb; ASML Holding, Intel Pace Chip Rally - Investor's Business Daily", "description": "America's Car-Mart and ASML Holding climbed as chips rallied and the Dow Jones today aimed to extend its three-day advance.", "url": "https://www.investors.com/market-trend/stock-market-today/dow-jones-today-shoots-for-4-as-futures-rise-asml-holding-intel-pace-chip-rally/", "urlToImage": "https://www.investors.com/wp-content/uploads/2020/03/SMT0800-031120-adobe.jpg", "publishedAt": "2021-05-25T14:00:00Z", "content": "Stocks clung to narrowing gains Tuesday, as the Dow Jones Industrial Average struggled for a fourth-straight advance and the Nasdaq fought to hold its regained support. ASML Holding, Nvidia, America'… [+6943 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, CNN\nVideo by Bryce Urbany, Cassie Spodak, CNN", "title": "More than 50 years before George Floyd's death, lawmakers predicted a growing racial divide - CNN ", "description": "It's been a year since George Floyd's chilling last words, \"I can't breathe,\" sent shock waves around the world. A guilty verdict came down April 20, but Black Americans had no time to celebrate the rare occurrence of a White police officer being convicted of…", "url": "https://www.cnn.com/2021/05/25/us/kerner-commission-report-predicted-racial-divide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210507164109-01-detroit-race-riot-1967-super-tease.jpg", "publishedAt": "2021-05-25T13:01:00Z", "content": "(CNN)A year ago, George Floyd's chilling last words, \"I can't breathe,\" sent shock waves around the world. A guilty verdict came down April 20, but Black Americans had no time to celebrate the rare o… [+13405 chars]"}, {"source": {"id": null, "name": "The Australian"}, "author": null, "title": "Coronavirus: American scientists caught up in Wuhan web of intrigue - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://www.theaustralian.com.au/subscribe/news/1/", "urlToImage": null, "publishedAt": "2021-05-25T11:30:00Z", "content": null}, {"source": {"id": null, "name": "Kion546.com"}, "author": "CNN Newsource", "title": "Young Americans are lagging behind with Covid-19 vaccines. And these threats have experts pushing for their vaccination - KION", "description": "Experts are turning their focus in the fight against Covid-19 to vaccinating young Americans — warning that even though they don’t face a high chance of serious illness, they still risk long-term symptoms if they get coronavirus. The United States has so far …", "url": "https://kion546.com/health/2021/05/25/young-americans-are-lagging-behind-with-covid-19-vaccines-and-these-threats-have-experts-pushing-for-their-vaccination/", "urlToImage": "https://kion546.com/wp-content/uploads/2019/10/kion-health.png", "publishedAt": "2021-05-25T08:19:04Z", "content": "Experts are turning their focus in the fight against Covid-19 to vaccinating young Americans — warning that even though they don’t face a high chance of serious illness, they still risk long-term sym… [+5795 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "PGA apologizes to Mickelson, Koepka for fans on final hole - Sportsnet.ca", "description": "PGA of America CEO Seth Waugh has apologized to winner Phil Mickelson and Brooks Koepka for fans rushing onto the 18th hole at the PGA Championship on Sunday.", "url": "https://www.sportsnet.ca/golf/article/pga-apologizes-mickelson-koepka-fans-final-hole/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2021/05/mickelson-1040x572.jpg", "publishedAt": "2021-05-25T05:22:00Z", "content": "KIAWAH ISLAND, S.C. (AP) -- PGA of America CEO Seth Waugh has apologized to winner Phil Mickelson and Brooks Koepka for fans rushing onto the 18th hole at the PGA Championship on Sunday.\r\nAfter Micke… [+1154 chars]"}, {"source": {"id": null, "name": "KAKE"}, "author": null, "title": "A vaccine marvel is bringing America back - KAKE", "description": "Analysis by Stephen Collinson, CNN America has never been closer to the end of this pandemic, which has inflicted the most universally experienced crisis and assault on national morale since...", "url": "https://www.kake.com/story/43951849/a-vaccine-marvel-is-bringing-america-back", "urlToImage": "http://KAKE.images.worldnow.com/images/10497028_G.jpg", "publishedAt": "2021-05-24T05:08:16Z", "content": "Analysis by Stephen Collinson, CNN\r\nAmericans are getting used to seeing each other inside, unmasked, and learning how to hug and smile again. Grandparents are reuniting with far-flung family. Vaccin… [+8348 chars]"}]}