{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Josh Boak", "title": "AP Interview: Biden says a recession is 'not inevitable' - The Associated Press - en Español", "description": "WASHINGTON (AP) — President Joe Biden said Thursday the American people are “really, really down” after a tumultuous two years with the coronavirus pandemic , volatility in the economy  and now surging gasoline prices  that are slamming family budgets.", "url": "https://apnews.com/article/biden-ap-interview-4d2c2f9015341f280d8078182601ec58", "urlToImage": "https://storage.googleapis.com/afs-prod/media/dee7b68fe297487eb6be1328bc2f9250/3000.jpeg", "publishedAt": "2022-06-16T23:21:46Z", "content": "WASHINGTON (AP) President Joe Biden said Thursday the American people are really, really down after a tumultuous two years with the coronavirus pandemic, volatility in the economy and now surging gas… [+7639 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Yahoo News Video", "title": "'Clear and present danger to American democracy': Jan. 6 testimony warns of efforts to subvert 2024 election - Yahoo Philippines News", "description": "In his closing remarks to the Jan. 6 House select committee on Thursday, J. Michael Luttig, a retired federal judge, testified that he believed former...", "url": "https://ph.news.yahoo.com/clear-present-danger-american-democracy-202934592.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/MHCT9LfRosoFmhpVwvGyWA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://s.yimg.com/os/creatr-uploaded-images/2022-06/d72c0270-edb2-11ec-a7ff-2dee62351da3", "publishedAt": "2022-06-16T20:29:34Z", "content": "In his closing remarks to the Jan. 6 House select committee on Thursday, J. Michael Luttig, a retired federal judge, testified that he believed former President Donald Trump and his supporters repres… [+840 chars]"}, {"source": {"id": null, "name": "Consequence.net"}, "author": "Abby Jones", "title": "Juror in Johnny Depp and Amber Heard Defamation Trial Speaks Out for First Time: “Her Story Didn’t Add Up” - Consequence", "description": "An anonymous juror on the trial spoke to Good Morning America about how the jury came to their guilty verdict.", "url": "https://consequence.net/2022/06/johnny-depp-amber-heard-juror-speaks-out/", "urlToImage": "https://consequence.net/wp-content/uploads/2022/06/Amber-Heard-photo-by-Karwai-TangWireImage.jpg?quality=80", "publishedAt": "2022-06-16T14:42:00Z", "content": "For the first time since reaching a guilty verdict in Johnny Depp’s defamation lawsuit against his ex-wife Amber Heard, a member of the jury has spoken publicly about the case. In an interview with G… [+2809 chars]"}, {"source": {"id": null, "name": "The Times"}, "author": "Anchal Vohra", "title": "US special forces capture senior Isis leader in Syrian village - The Times", "description": "American special forces troops were deployed from Chinook and Black Hawk helicopters in a pre-dawn raid to capture a senior Islamic State leader from his hideout northern Syria. Hani Ahmed Al-Kurdi, known as the governor of Raqqa, the terror group’s former ca…", "url": "https://www.thetimes.co.uk/article/us-special-forces-capture-senior-isis-leader-in-syrian-village-k9jdflbtr", "urlToImage": "https://www.thetimes.co.uk/imageserver/image/%2Fmethode%2Ftimes%2Fprod%2Fweb%2Fbin%2Fc1b195e0-ed6c-11ec-8821-d2e916a7eab3.jpg?crop=4665%2C2624%2C1126%2C472&resize=1200", "publishedAt": "2022-06-16T12:45:00Z", "content": "American special forces were deployed from Chinook and Black Hawk helicopters in a pre-dawn raid to capture a senior Islamic State leader from his hideout in northern Syria.\r\nHani Ahmed Al-Kurdi, kno… [+570 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Who is Radha Iyengar Plumb, Joe Biden's Indian-American nominee for top Pentagon post - Moneycontrol", "description": "Radha Iyengar Plumb has extensive experience working in industry, academia and government and is skilled in policy research and trust and safety matters.", "url": "https://www.moneycontrol.com/news/trends/current-affairs-trends/who-is-radha-iyengar-plumb-joe-bidens-indian-american-nominee-for-top-pentagon-post-8693211.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/06/pjimage-2022-06-16T081925.223-770x433.jpg", "publishedAt": "2022-06-16T02:50:40Z", "content": "The White House on June 15 announced five nominees to top leadership posts in President Joe Bidens administration. Among them is Indian-American official Radha Iyengar Plumb, who has been nominated t… [+1520 chars]"}]}