{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Six die in private plane crash in Haiti — World — The Guardian Nigeria News – Nigeria and World News - Guardian Nigeria", "description": "Six people including two American missionaries were killed when a private airplane crashed southwest of Haiti's capital Port-au-Prince", "url": "https://guardian.ng/news/six-die-in-private-plane-crash-in-haiti/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/03/Airplane.-Photo-Safe-Travel.jpg", "publishedAt": "2021-07-03T20:20:00Z", "content": "Six people including two American missionaries were killed when a private airplane crashed southwest of Haiti's capital Port-au-Prince, local authorities said Saturday.The aircraft had taken off from… [+1477 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "France and Manchester United star Pogba joins Burna Boy's birthday celebration in Miami - Goal.com", "description": "Lionel Messi has never succeeded in leading Argentina to a Copa America triumph although he came close on a few occasions. At age 34, this could be his last chance to do it, although Brazil, the host of the competition, will likely stand in his way.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-07-03T19:39:32Z", "content": ""}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "The Associated Press", "title": "AP PHOTOS: US troops on front lines of America's longest war - Associated Press", "description": "During the course of America’s longest war, more than 800,000 members of the U.S. military served in Afghanistan, a multigenerational fight against a tenacious insurgency. For the troops on the front lines, sometimes it meant holding a remote outpost as morta…", "url": "https://apnews.com/article/taliban-kandahar-afghanistan-c6c91b15d448b79980c4b1c93924ecdc", "urlToImage": "https://storage.googleapis.com/afs-prod/media/e91b9a1e3961434689ae9ed50be82d5d/3000.jpeg", "publishedAt": "2021-07-03T06:20:19Z", "content": "During the course of Americas longest war, more than 800,000 members of the U.S. military served in Afghanistan, a multigenerational fight against a tenacious insurgency.\r\nFor the troops on the front… [+1295 chars]"}, {"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Freed American journalist remembers horrors of Myanmar junta jail - CNA", "description": "FAIRFAX: Journalist Nathan Maung turned to meditation when he was jailed for reporting on Myanmar's bloody coup, but even back home in sleepy Virginia, he can't forget those left behind, including a colleague still at the mercy of their jailers.", "url": "https://www.channelnewsasia.com/news/world/myanmar-military-coup-american-journalist-junta-jail-horrors-15147192", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/15147190/16x9/991/557/61d3082f63b63bfb2148d29bb782bb90/Na/journalist-nathan-maung-says-he-turned-to-meditation-when-he-was-jailed-for-reporting-on-the-myanmar-coup-1625286002450-2.jpg", "publishedAt": "2021-07-03T04:53:36Z", "content": "FAIRFAX: Journalist Nathan Maung turned to meditation when he was jailed for reporting on Myanmar's bloody coup, but even back home in sleepy Virginia, he can't forget those left behind, including a … [+3811 chars]"}]}