{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "politico", "name": "Politico"}, "author": null, "title": "White House warns free Covid treatments are at risk as subsidies run out - POLITICO", "description": "Some Americans might have to pay out of pocket for therapeutics if Congress doesn’t pass a new Covid funding bill.", "url": "https://www.politico.com/news/2022/03/16/white-house-covid-funding-congress-00017886", "urlToImage": "https://static.politico.com/c8/5e/be62518243a590581dd76fd411ef/220316-covid-treatment-ap-773.jpg", "publishedAt": "2022-03-16T22:21:00Z", "content": "Theyre not ready yet, one of those people said of the administration. This would force them to have to do it abruptly.\r\nThe internal discussions are still in preliminary stages, and no decision is im… [+6862 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Bachelor' finale ends with Clayton Echard's shocking choice l GMA - Good Morning America", "description": "Though Echard revealed his heart was \"with Susie\" during the final ceremony with Gabby and Rachel, the two women will continue their quest for love on \"The B...", "url": "https://www.youtube.com/watch?v=O1VArpw8rx0", "urlToImage": "https://i.ytimg.com/vi/O1VArpw8rx0/hqdefault.jpg", "publishedAt": "2022-03-16T15:59:54Z", "content": null}, {"source": {"id": null, "name": "Malay Mail"}, "author": "Lee Khang Yi", "title": "A first for Malaysia: Bukit Jalil’s Eat and Cook honoured by Asia’s 50 Best Restaurants with the 2022 American Express One To Watch Award - Malay Mail", "description": "KUALA LUMPUR, March 15 — Restaurant Eat and Cook has been selected by the organisers of Asia’s 50 Best Restaurants to receive the much coveted American Express One To Watch Award. A first for a Malaysian restaurant, this award recognises Eat and Cook as a ris…", "url": "https://www.malaymail.com/news/malaysia/2022/03/15/a-first-for-malaysia-bukit-jalils-eat-and-cook-honoured-by-asias-50-best-re/2047590", "urlToImage": "https://media2.malaymail.com/resize_cache/uploads/articles/2022/2022-03/eat_and_cook_20220315_3-seo.jpg", "publishedAt": "2022-03-15T10:06:45Z", "content": "Diners at Eat and Cook can experience omakase with local tongues in an island kitchen setting. Picture courtesy of Asias 50 Best Restaurants\r\nKUALA LUMPUR, March 15 Restaurant Eat and Cook has been s… [+3490 chars]"}]}