{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Aap.org"}, "author": null, "title": "Neonatal Admission Temperature in Middle- and High-Income Countries - American Academy of Pediatrics", "description": "BACKGROUNDAND OBJECTIVES:. Despite being preventable, neonatal hypothermia remains common. We hypothesized that the proportion of newborns with hypothermia on admission would be high in all settings, higher in hospitals in middle-income countries (MIC) compar…", "url": "https://publications.aap.org/pediatrics/article/doi/10.1542/peds.2023-061607/193707/Neonatal-Admission-Temperature-in-Middle-and-High", "urlToImage": "/UI/app/svg/umbrella/logo.svg", "publishedAt": "2023-08-17T08:11:23Z", "content": "BACKGROUNDAND OBJECTIVES:\r\nDespite being preventable, neonatal hypothermia remains common. We hypothesized that the proportion of newborns with hypothermia on admission would be high in all settings,… [+1467 chars]"}, {"source": {"id": null, "name": "PBS"}, "author": null, "title": "Trump boasts strong support among Republicans. The general election could be a different story - PBS NewsHour", "description": "In a crucial warning sign for the former president and his supporters, Trump faces glaring vulnerabilities heading into a general election, with many Americans strongly dug in against him.", "url": "https://www.pbs.org/newshour/politics/trump-boasts-strong-support-among-republicans-the-general-election-could-be-a-different-story", "urlToImage": "https://d3i6fh83elv35t.cloudfront.net/static/2023/07/2023-07-07T202403Z_1092689819_RC2JY1AELX5F_RTRMADP_3_USA-ELECTION-TRUMP-1024x683.jpg", "publishedAt": "2023-08-16T21:57:42Z", "content": "NEW YORK (AP) After every new indictment, Donald Trump has boasted that his standing among Republicans only improves and he has a point.\r\nNearly two-thirds of Republicans 63 percent now say they want… [+7377 chars]"}, {"source": {"id": null, "name": "Forbes"}, "author": "Arianna Johnson", "title": "Cancer Rates Among Americans Under 50 Are Slightly Rising, New Study Finds - Forbes", "description": "Though cancer rates in Americans 50 years and older are declining, researchers found rates in Americans under 50 are on the rise, with adults between 30 and 39 seeing the biggest increase.", "url": "https://www.forbes.com/sites/ariannajohnson/2023/08/16/cancer-rates-among-americans-under-50-are-slightly-rising-new-study-finds/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/64dd02819d814fa8f6d8ae1f/0x0.jpg?format=jpg&crop=2824,1590,x0,y112,safe&width=1200", "publishedAt": "2023-08-16T17:09:36Z", "content": "Researchers found that cancer rates in younger Americans, especially women and Asian or Pacific Islanders, are on the rise, with some experts believing lifestyle changeslike drinking alcohol excessiv… [+3272 chars]"}]}