{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "CNA"}, "author": "CNA", "title": "Sinovac COVID-19 vaccine less effective against Gamma variant: Study - CNA", "description": "PARIS: Sinovac's COVID-19 vaccine, a key tool in Brazil's fight against the disease, is less effective against the Gamma variant first detected in the virus-ravaged South American country, a study said on Friday (Jul 9).", "url": "https://www.channelnewsasia.com/news/world/sinovac-covid-19-vaccine-less-effective-against-gamma-variant-15184826", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14576530/16x9/991/557/3e9bce0481133a6f88456608a1e8c25e/ht/file-photo--outbreak-of-the-coronavirus-disease--covid-19--in-anama--amazonas-state-1.jpg", "publishedAt": "2021-07-08T23:19:46Z", "content": "PARIS: Sinovac's COVID-19 vaccine, a key tool in Brazil's fight against the disease, is less effective against the Gamma variant first detected in the virus-ravaged South American country, a study sa… [+3136 chars]"}, {"source": {"id": null, "name": "GMA News"}, "author": "", "title": "CoronaVac jab less effective against Gamma variant - study - GMA News Online", "description": "The Chinese CoronaVac jab, a key tool in Brazil&#39;s fight against COVID-19, is less effective against the Gamma variant first detected in the virus-ravaged South American country, a study said Friday.", "url": "https://www.gmanetwork.com/news/scitech/science/794684/coronavac-jab-less-effective-against-gamma-variant-study/story/", "urlToImage": "https://images.gmanews.tv/webpics/2021/05/2021-05-25T204214Z_1203139106_RC20NN9RR46M_RTRMADP_3_HEALTH-CORONAVIRUS-MEXICO-VACCINE_2021_05_29_03_03_51.JPG", "publishedAt": "2021-07-08T23:16:35Z", "content": "PARIS, France - The Chinese CoronaVac jab, a key tool in Brazil's fight against COVID-19, is less effective against the Gamma variant first detected in the virus-ravaged South American country, a stu… [+2967 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Paris police detain Lil Baby, frisk NBA's James Harden - CBC.ca", "description": "American rapper Lil Baby was detained in Paris on Thursday for allegedly transporting drugs, while NBA star James Harden was also stopped but not detained, according to the city prosecutor's office.", "url": "https://www.cbc.ca/news/entertainment/lil-baby-james-harden-paris-1.6095435", "urlToImage": "https://i.cbc.ca/1.6095454.1625778932!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1325807779.jpg", "publishedAt": "2021-07-08T22:23:08Z", "content": "American rapper Lil Baby was detained in Paris on Thursday for allegedly transporting drugs, according to the city prosecutor's office.\r\nNBA star James Harden was also stopped but not detained, the p… [+636 chars]"}, {"source": {"id": null, "name": "WPLG Local 10"}, "author": "Michael Putney, Hatzel Vela, Andrea Torres", "title": "Haiti probes South Florida Haitian-American connection to president's assassination - WPLG Local 10", "description": "Haitian officers in Port-au-Prince reported Thursday that they have arrested six suspects, including two Haitian-American men, in connection with President Jovenel Moïse’s assassination Wednesday at his home. Four died during a shootout. There are still suspe…", "url": "https://www.local10.com/news/local/2021/07/08/haiti-probes-haitian-american-connection-to-presidents-assassination/", "urlToImage": "https://www.local10.com/resizer/kezQSLf7zxHNY1mk1a_JrSVHjiQ=/800x450/smart/filters:format(jpeg):strip_exif(true):strip_icc(true):no_upscale(true):quality(65):fill(FFF)/d1vhqlrjc8h82r.cloudfront.net/07-08-2021/t_6cc3e9b546db42f68bc0ca738696fdaf_name_image.jpg", "publishedAt": "2021-07-08T20:59:08Z", "content": "MIAMI Haitian officers in Port-au-Prince reported Thursday that they have arrested several suspects in connection with President Jovenel Moïses assassination Wednesday at his home. Four died during a… [+6989 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Evens Sanon, Danica Coto and Joshua Goodman", "title": "2 Haitian Americans detained in slaying of Haiti president - CTV News", "description": "Two men believed to be Haitian Americans -- one of them purportedly a former bodyguard at the Canadian Embassy in Port au Prince -- have been arrested in connection with the assassination of Haiti's president, a senior Haitian official said Thursday.", "url": "https://www.ctvnews.ca/world/2-haitian-americans-detained-in-slaying-of-haiti-president-1.5501888", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5501898.1625770502!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-07-08T19:00:00Z", "content": "PORT-AU-PRINCE, HAITI -- \r\nTwo men believed to be Haitian Americans -- one of them purportedly a former bodyguard at the Canadian Embassy in Port au Prince -- have been arrested in connection with th… [+8333 chars]"}, {"source": {"id": null, "name": "The Star Online"}, "author": "The Star Online", "title": "Soccer-Move over Messi -- Argentina has a new hero - The Star Online", "description": "BRASILIA (Reuters) -     Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout in their Copa America semi-final against Colombia.", "url": "https://www.thestar.com.my/sport/football/2021/07/07/soccer-move-over-messi----argentina-has-a-new-hero", "urlToImage": "https://apicms.thestar.com.my/uploads/images/2021/07/07/1211772.jpg", "publishedAt": "2021-07-07T05:47:00Z", "content": "BRASILIA (Reuters) - Emiliano Martinez needed only a month to establish himself as Argentina's number one goalkeeper and on Tuesday he became a new national hero by saving three times in a shootout i… [+1854 chars]"}]}