{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "US presidential race: Three Indian American Republican party candidates directly challenging Donald Trump | Mint - Mint", "description": "Speculation surrounds potential Republican candidates for 2024 US presidential election. Indian-American leaders Hirsh Vardhan Singh, Nikki Haley, Vivek Ramaswamy challenge Trump's frontrunner position.", "url": "https://www.livemint.com/politics/news/us-presidential-race-indian-americans-hirsh-vardhan-singh-nikki-haley-vivek-ramaswamy-challenging-trump-11690701858067.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/30/600x338/Trump_1690707935561_1690707935828.jpg", "publishedAt": "2023-07-30T09:12:33Z", "content": "In the lead-up to the 2024 US presidential election, speculation surrounds the potential candidates for the Republican Party's nomination. Despite facing legal challenges, former US President Donald … [+2824 chars]"}, {"source": {"id": null, "name": "CarToq.com"}, "author": "Ajeesh Kuttan", "title": "Check out the Knight Rider KITT car which was actually used in the television series [Video] - CarToq.com", "description": "“Knight Rider” was an American action crime drama television series that originally aired from 1982 to 1986. One of the main attractions of the show was KITT, an artificially intelligent car capable of speech and various functions, and it was nearly indestruc…", "url": "https://www.cartoq.com/check-out-the-knight-rider-kitt-car-which-was-actually-used-in-the-television-series-video/", "urlToImage": "https://www.cartoq.com/wp-content/uploads/2023/05/kitt-car-featured.jpg", "publishedAt": "2023-07-30T09:05:41Z", "content": "“Knight Rider” was an American action crime drama television series that originally aired from 1982 to 1986. One of the main attractions of the show was KITT, an artificially intelligent car capable … [+2882 chars]"}]}