{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "Reuters", "title": "Asteroid's Sudden Flyby Shows Blind Spot in Planetary Threat Detection - Voice of America - VOA News", "description": "One major upgrade to NASA's detection arsenal will be NEO Surveyor, a $1.2 billion telescope under development that will launch nearly a million miles from Earth and surveil a wide field of asteroids", "url": "https://www.voanews.com/a/asteroid-s-sudden-flyby-shows-blind-spot-in-planetary-threat-detection/6938690.html", "urlToImage": "https://gdb.voanews.com/06a20000-0aff-0242-8f94-08daff9f231c_w1200_r1.jpg", "publishedAt": "2023-01-29T11:56:05Z", "content": "Washington  The discovery of an asteroid the size of a small shipping truck mere days before it passed Earth on Thursday, albeit one that posed no threat to humans, highlights a blind spot in our abi… [+3770 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Sudamericano sub-20: definidos rivales de Colombia en el hexagonal final - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/appearance/structured-data", "urlToImage": "https://developers.google.com/static/search/images/home-social-share-lockup.png", "publishedAt": "2023-01-29T01:36:03Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Oliver Darcy", "title": "'GMA3' anchors Amy Robach and T.J. Holmes depart ABC after reported romantic relationship - CP24", "description": "T.J. Holmes and Amy Robach, the anchors of the third hour of ABC's flagship morning show \"Good Morning America,\" are leaving ABC News, network president Kim Godwin announced in a memo to staff Friday evening.", "url": "https://www.cp24.com/entertainment-news/gma3-anchors-amy-robach-and-t-j-holmes-depart-abc-after-reported-romantic-relationship-1.6250563", "urlToImage": "https://www.cp24.com/polopoly_fs/1.6250566.1674938611!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2023-01-28T20:44:04Z", "content": "(CNN) -- T.J. Holmes and Amy Robach, the anchors of the third hour of ABC's flagship morning show \"Good Morning America,\" are leaving ABC News, network president Kim Godwin announced in a memo to sta… [+1637 chars]"}, {"source": {"id": null, "name": "World Socialist Web Site"}, "author": null, "title": "Outbreak of avian flu has killed more than 100 million birds and poses a serious threat of becoming a human pandemic - WSWS", "description": "Since October 2021, the spread of the H5N1 highly pathogenic avian flu among birds in North America and Europe has killed more than 140 million poultry and wild birds through disease and culling. The spread of the virus at a mink farm in Spain raises immediat…", "url": "https://www.wsws.org/en/articles/2023/01/28/unuv-j28.html", "urlToImage": "https://www.wsws.org/asset/ec43e59f-7f32-407e-9bd8-613b2101332d?rendition=1600x900", "publishedAt": "2023-01-28T02:27:00Z", "content": "The COVID-19 pandemic, which has killed more than 21 million people, has elevated an existential question into concrete immediacy. Following COVID-19, when will the next pandemic of a highly lethal n… [+9119 chars]"}]}