{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "India.com"}, "author": "Bureau", "title": "NASA shares incredible images of cosmic lights, stuns stargazers - Zee News", "description": "The Univeres is filled with amazing phnomenons which are generally not visible to human eyes but the American space agency, NASA makes it possible to see these incredible extraterrestrial events with the help of its high-tech telescopes, Hubble, Chandray Xray…", "url": "https://zeenews.india.com/viral/nasa-shares-incredible-images-of-cosmic-lights-stuns-stargazers-2433735.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/NASA-Lights-Instagram.jpg", "publishedAt": "2022-02-05T11:38:09Z", "content": "New Delhi: The Univeres is filled with amazing phnomenons which are generally not visible to human eyes but the American space agency, NASA makes it possible to see these incredible extraterrestrial … [+777 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "US Identifies Bad Governance, Corruption as Motivations for Coups in Africa - THISDAY Newspapers", "description": "Ahamefula Ogbu The United States of America has condemned as unacceptable and out of vogue, any change of government in Africa except as constitutionally enshrined through elections and popular bal…", "url": "https://www.thisdaylive.com/index.php/2022/02/05/us-identifies-bad-governance-corruption-as-motivations-for-coups-in-africa/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/6cea8fb9-stephen-townsend.jpg", "publishedAt": "2022-02-05T05:21:25Z", "content": "Ahamefula Ogbu\r\nThe United States of America has condemned as unacceptable and out of vogue, any change of government in Africa except as constitutionally enshrined through elections and popular ball… [+4928 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Julie Bosman, Mitch Smith", "title": "U.S. Covid Death Toll Surpasses 900,000 as Omicron’s Spread Slows - The New York Times", "description": "New case reports are waning, but deaths have yet to peak, and Americans are wondering what long-term coexistence with the coronavirus might look like.", "url": "https://www.nytimes.com/2022/02/04/us/us-covid-deaths.html", "urlToImage": "https://static01.nyt.com/images/2022/02/04/us/04evening-briefing-virus-900kdead2/04virus-900kdead-2SWAP-facebookJumbo.jpg", "publishedAt": "2022-02-05T02:45:00Z", "content": "I refuse to kind of be around anybody that isnt taking the pandemic seriously, said Mikayla Cruickshank, an administrative coordinator in Lincoln, Neb.\r\nShobha Gupta, who runs an accounting business … [+1052 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "U.S. restores sanctions waiver to Iran with nuclear talks in final phase - Reuters", "description": "President Joe Biden's administration on Friday restored sanctions waivers to Iran to allow international nuclear cooperation projects, as indirect American-Iranian talks on reviving the 2015 international nuclear deal with Tehran enter the final stretch.", "url": "https://www.reuters.com/world/middle-east/biden-administration-restores-sanctions-waiver-iran-talks-final-phase-2022-02-04/", "urlToImage": "https://www.reuters.com/resizer/kGIkiHfr6-rxcHu-oX4wWxTfezo=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/NMACDPYQBRNE7N7WJPXMN4OJ5Y.jpg", "publishedAt": "2022-02-05T01:15:00Z", "content": "WASHINGTON, Feb 4 (Reuters) - President Joe Biden's administration on Friday restored sanctions waivers to Iran to allow international nuclear cooperation projects, as indirect American-Iranian talks… [+3799 chars]"}, {"source": {"id": null, "name": "The Weather Network"}, "author": "Pelmorex Weather Networks Inc", "title": "PHOTOS: Thousands without power on the East Coast amid dynamic winter storm - The Weather Network US", "description": "A powerful and disruptive winter storm is nearing the end of its journey across a large portion of North America, bringing significant amounts of freezing rain, ice pellets, snow and rainfall to the East Coast through Saturday.", "url": "https://www.theweathernetwork.com/ca/news/article/photos-thousands-without-power-as-expansive-winter-storm-hits-the-east-coast-halifax-sydney-fredericton-charlottetown-stjohns", "urlToImage": "https://images.twnmm.com/c55i45ef3o2a/3vygPkIhZZwKlM5iXyxYGO/bc7839202a4d903166c5907f37c7738b/Patricia_Hornyak_Moncton__N.B..jpg", "publishedAt": "2022-02-05T00:37:00Z", "content": "Friday, February 4th 2022, 9:01 pm - A powerful and disruptive winter storm is nearing the end of its journey across a large portion of North America, bringing significant amounts of freezing rain, i… [+16216 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Apoorva Mandavilli", "title": "Younger Americans Benefited Less From Booster Shots Than Older People - The New York Times", "description": "Among those under age 50, vaccination even without a booster protected strongly against hospitalization and death, according to new C.D.C. data.", "url": "https://www.nytimes.com/2022/02/04/health/covid-boosters-older-younger.html", "urlToImage": "https://static01.nyt.com/images/2022/02/04/science/04virus-boosters/04virus-boosters-facebookJumbo.jpg", "publishedAt": "2022-02-05T00:12:19Z", "content": "Unvaccinated people in every age group are at higher risk of infection, hospitalization and death than those who have been immunized, according to the C.D.C.s data a persistent trend ever since vacci… [+1408 chars]"}, {"source": {"id": null, "name": "WMAR ABC2News Baltimore"}, "author": "Brittney Verner", "title": "Raising awareness about heart disease in women - wmar2news.com", "description": "Every first Friday in February go red for women day is amplified across the nation. It’s a campaign organized by the American Heart Association that increases awareness about heart disease in women.", "url": "https://www.wmar2news.com/news/local-news/raising-awareness-about-heart-disease-in-women", "urlToImage": "https://ewscripps.brightspotcdn.com/dims4/default/ade0254/2147483647/strip/true/crop/1280x672+0+24/resize/1200x630!/quality/90/?url=https%3A%2F%2Fx-default-stgec.uplynk.com%2Fausw%2Fslices%2F764%2F22f3150cc15946e68b21f11967cfb8d1%2F764ff0da534340f5ae6b91271a4d3d0d%2Fposter_663183c64ed44ee38499e2e232c41e3d.jpg", "publishedAt": "2022-02-04T23:03:00Z", "content": "BALTIMORE Every first Friday in February Go Red for Women day is amplified across the nation. Its a campaign organized by the American Heart Association that increases awareness about heart disease i… [+4884 chars]"}, {"source": {"id": null, "name": "Tennis World USA"}, "author": "Andrea Gussoni", "title": "LPGA Tour, puppies of dogs for the queens - Tennis World USA", "description": "The second test day of the Drive On Championship, the LPGA Tour tournament scheduled in Florida from February 3 to 6, was characterized by a \"four-legged\" surprise organized by the leading American women's golf circuit", "url": "https://www.tennisworldusa.org/other_news/golf/108726/lpga-tour-puppies-of-dogs-for-the-queens/", "urlToImage": "https://www.tennisworldusa.org/imgb/112444/lpga-tour-puppies-of-dogs-for-the-queens.jpg", "publishedAt": "2022-02-04T20:40:48Z", "content": "Sweet puppies of dogs, waiting for the queens of golf after a practice round in Florida, to take hugs and caresses from them. The second test day of the Drive On Championship, the LPGA Tour tournamen… [+2593 chars]"}, {"source": {"id": null, "name": "CP24 Toronto's Breaking News"}, "author": "Amanda Stephenson", "title": "Gasoline prices breaking records as crude oil tops US$90 a barrel - CP24 Toronto's Breaking News", "description": "Gasoline prices across Canada shattered an all-time record high on Friday, as crude prices soared above US$90 per barrel and North American refineries worked full throttle to keep up with demand.", "url": "https://www.cp24.com/news/gasoline-prices-breaking-records-as-crude-oil-tops-us-90-a-barrel-1.5768462", "urlToImage": "https://www.cp24.com/polopoly_fs/1.5768464.1644006892!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2022-02-04T20:35:23Z", "content": "CALGARY - Gasoline prices across Canada shattered an all-time record high on Friday, as crude prices soared above US$90 per barrel and North American refineries worked full throttle to keep up with d… [+4209 chars]"}, {"source": {"id": null, "name": "KSL.com"}, "author": "Ghaith Alsayed, Lolita C. Baldor, Bassem Mroue and Zeke Miller, Associated Press", "title": "Islamic State leader killed as US attacks Syria hideout - KSL.com", "description": "The leader of the violent Islamic State group died in a U.S. military raid Thursday, blowing himself up along with members of his family as American special operations forces assaulted his hideout in northwestern Syria, President Joe Biden said.", "url": "https://www.ksl.com/article/50340665/islamic-state-leader-killed-as-us-attacks-syria-hideout", "urlToImage": "https://img.ksl.com/slc/2862/286240/28624023.jpg?filter=kslv2/responsive_story_lg", "publishedAt": "2022-02-03T15:35:00Z", "content": "Estimated read time: 7-8 minutes\r\nATMEH, Syria The leader of the violent Islamic State group died in a U.S. military raid Thursday, blowing himself up along with members of his family as American spe… [+8921 chars]"}]}