{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Gizmodo.com"}, "author": "George Dvorsky", "title": "Your Definitive Guide to the 2024 Great North American Solar Eclipse - Gizmodo", "description": "Everything you need to know ahead of the historic total solar eclipse on April 8.", "url": "https://gizmodo.com/great-north-american-solar-eclipse-2024-watch-guide-1851290096", "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/fcbf0c6a60392b5a75d40de46398036b.jpg", "publishedAt": "2024-03-03T14:20:00Z", "content": "Millions of people across North America will soon have the opportunity to witness a rare and special astronomical eventa total solar eclipseduring which the Moon will completely obscure the Sun along… [+9873 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Cannabis and Heart Health: A Troubling Connection Uncovered - SciTechDaily", "description": "More frequent use of cannabis was associated with higher odds of adverse cardiovascular outcomes, finds a new study in the Journal of the American Heart Association. Research Highlights: An analysis of survey data for 430,000 adults in the U.S. found that usi…", "url": "https://scitechdaily.com/cannabis-and-heart-health-a-troubling-connection-uncovered/", "urlToImage": "https://scitechdaily.com/images/Cannabis-Doctor.jpg", "publishedAt": "2024-03-03T03:47:05Z", "content": "Cannabis use is associated with higher risks of heart attack and stroke, a study of 430,000 adults indicates, stressing the need for awareness of its cardiovascular effects. Credit: SciTechDaily.com\r… [+8375 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "This Colorectal Cancer Awareness Month, AGA u - EurekAlert", "description": "<p>March marks the beginning of Colorectal Cancer Awareness Month, a time dedicated to increasing awareness and encouraging prevention of one of the deadliest cancers affecting Americans.</p>", "url": "https://www.eurekalert.org/news-releases/1036097", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2024-03-02T07:33:02Z", "content": "Bethesda, MD (March 1, 2024) - March marks the beginning of Colorectal Cancer Awareness Month, a time dedicated to increasing awareness and encouraging prevention of one of the deadliest cancers affe… [+4238 chars]"}, {"source": {"id": null, "name": "Scientific American"}, "author": "Katelyn Jetelina, Kristen Panthagani", "title": "Florida Surgeon General Risks Making a Dangerous Measles Outbreak Much Worse - Scientific American", "description": "By ignoring common sense and medical advice, Florida’s health officials risk accelerating a burgeoning measles outbreak", "url": "https://www.scientificamerican.com/article/florida-surgeon-general-risks-making-a-dangerous-measles-outbreak-much-worse/", "urlToImage": "https://static.scientificamerican.com/dam/m/55f383e654587700/original/GettyImages-1725099437.jpg?w=1200", "publishedAt": "2024-03-01T19:30:45Z", "content": "An outbreak of measles in Florida has grown to 10 cases. Most have been linked to an elementary school with nearly three dozen unvaccinated students. The count includes seven cases tied to the school… [+6321 chars]"}]}