{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Eurosport.com AU"}, "author": "Alasdair Mackenzie", "title": "Iran 0-1 USA: Christian Pulisic goal gives Americans victory to snatch second place in Group B - Eurosport COM", "description": "Christian Pulisic scored a first-half winner and injured himself in the process as the United States earned a 1-0 win over Iran to reach World Cup last 16.", "url": "https://www.eurosport.com/football/world-cup/2022/fifa-world-cup-2022-in-qatar-live-iran-v-usa-updates_sto9248521/story.shtml", "urlToImage": "https://i.eurosport.com/2022/11/29/3499846-71344088-2560-1440.jpg", "publishedAt": "2022-11-29T23:17:00Z", "content": "Christian Pulisic of United States scores their team's first goal during the FIFA World Cup Qatar 2022 Group B match between IR Iran and USA at Al Thumama Stadium on November 29, 2022 in Doha, Qatar.… [+62 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Alex Raskin Sports, Associated", "title": "American and Iranian soccer fans pack Doha's stadium ahead of crucial World Cup clash - Daily Mail", "description": "Red-white-and-blue-clad American soccer fans have flooded Doha's Al Thumama Stadium along with their Iranian counterparts ahead of the Group B finale as both teams seek to advance.", "url": "https://www.dailymail.co.uk/sport/football/article-11482631/American-Iranian-soccer-fans-pack-Dohas-stadium-ahead-crucial-World-Cup-clash.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/11/29/18/65057581-0-image-a-42_1669745611913.jpg", "publishedAt": "2022-11-29T18:15:05Z", "content": "Red-white-and-blue-clad American soccer fans have flooded Doha's Al Thumama Stadium along with their Iranian counterparts ahead of the Group B finale as both teams seek to advance to the World Cup kn… [+9776 chars]"}, {"source": {"id": null, "name": "Sportskeeda"}, "author": "Tariq Hassan", "title": "Genshin Impact 3.3 update time and date for Asia, America and Europe - Sportskeeda", "description": "Genshin Impact fans looking forward to the release of the game's 3.3 update won't have to wait much longer, as the game's next big update is set to arrive in just a few days.", "url": "https://www.sportskeeda.com/esports/genshin-impact-3-3-update-time-date-asia-america-europe", "urlToImage": "https://staticg.sportskeeda.com/editor/2022/11/29042-16697028467602-1920.jpg", "publishedAt": "2022-11-29T14:26:37Z", "content": "Genshin Impact fans looking forward to the release of the game's 3.3 update won't have to wait much longer, as the game's next big update is set to arrive in just a few days. This update will bring n… [+2590 chars]"}]}