{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Chrissie Swan Weight Loss Australia: Reviews (AU) Is Chrissie Swan Keto Gummies Really Work Or Fake Exposed Maggie Beer Keto Gummies? - The Tribune India", "description": "Obesity, being overweight, and fatigue at an early age has become the worst nightmare for so many Americans. Obesity has been linked to the worsening of a number of diseases, including cancer and diabetes. A variety of lifestyle factors can contribute to weig…", "url": "https://www.tribuneindia.com/news/brand-connect/chrissie-swan-weight-loss-australia-reviews-au-is-chrissie-swan-keto-gummies-really-work-or-fake-exposed-maggie-beer-keto-gummies-464197", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1265530691.png", "publishedAt": "2022-12-24T21:07:00Z", "content": "Obesity, being overweight, and fatigue at an early age has become the worst nightmare for so many Americans. Obesity has been linked to the worsening of a number of diseases, including cancer and dia… [+10800 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crematoriums In China Fill Up Amid Rise In Covid Cases: Report - NDTV", "description": "As COVID-19 cases continue to rise at a meteoric pace in China, crematoriums throughout the country are getting packed and people are forced to wait for hours to get their loved ones cremated, American broadcaster CNN reported.", "url": "https://www.ndtv.com/world-news/crematoriums-in-china-fill-up-amid-rise-in-covid-cases-report-3636289", "urlToImage": "https://c.ndtvimg.com/2022-12/majhr76_china-covid-outbreak-afp_625x300_22_December_22.jpg", "publishedAt": "2022-12-24T18:57:48Z", "content": "China is considering only deaths happening due to pneumonia and respiratory failures.\r\nBeijing: As COVID-19 cases continue to rise at a meteoric pace in China, crematoriums throughout the country are… [+3627 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Sam Tabahriti", "title": "FTX founder Sam Bankman-Fried was 'chilling' in the American Airlines lounge at JFK before flying business class to his parents' home to await trial - Yahoo Finance", "description": "The cofounder and former CEO of collapsed crypto trading platform FTX was spotted at JFK airport on Thursday before flying to his parents' home.", "url": "https://www.businessinsider.com/ftx-sam-bankman-fried-aa-lounge-jfk-flight-san-francisco-2022-12", "urlToImage": "https://i.insider.com/63a708f246a5550018b7e7ba?width=1200&format=jpeg", "publishedAt": "2022-12-24T15:37:01Z", "content": "FTX founder Sam Bankman-Fried has been pictured in the American Airlines business class lounge at John F. Kennedy International Airport before flying to his parents' home at Palo Alto, California on … [+1079 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Shooting sends Mall of America into lockdown - WCCO - CBS Minnesota", "description": "A shooting prompted the Mall of America to go on lockdown Friday night on a busy shopping night less than two days before Christmas.", "url": "https://www.youtube.com/watch?v=E3tokRMgEOM", "urlToImage": "https://i.ytimg.com/vi/E3tokRMgEOM/maxresdefault.jpg", "publishedAt": "2022-12-24T04:12:44Z", "content": null}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "US winter storm: Icy blast hits 200 million Americans - BBC", "description": "At least 12 deaths have been linked to the cold snap, which has brought blizzards and floods.", "url": "https://www.bbc.com/news/world-us-canada-64083129", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/18309/production/_128118099_miflint.jpg", "publishedAt": "2022-12-24T03:56:33Z", "content": "Media caption, WATCH: Wind, snow, bitter cold combine for historic storm\r\nSome 200 million Americans are feeling the icy grip of a massive winter storm that has been linked to at least 12 deaths ahea… [+3537 chars]"}]}