{"articles": [{"author": "Chad Pergram", "content": "Its not Dr. Seuss, Mr. Potato Head or Pepe Le Pew. \r\nBut if you really want to understand the arcane mechanics behind the debate about Democrats potentially eliminating the Senate filibuster, perhaps… [+9935 chars]", "description": "The iconic, 1939 Frank Capra classic starring Jimmy Stewart iconized the filibuster in the American political experience. Social studies and history teachers showed the film in class to demonstrate the filibuster.", "publishedAt": "2021-03-21T20:25:35Z", "source": {"id": "fox-news", "name": "Fox News"}, "title": "Dems weigh eliminating filibuster, but most Americans have no idea how it actually works - Fox News", "url": "https://www.foxnews.com/politics/dems-weigh-eliminating-filibuster-but-most-americans-have-no-idea-how-it-actually-works", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/03/US-Capitol.png"}, {"author": "Cole Miller, KOMO News Reporter", "content": null, "description": "On a rain-soaked Saturday evening, a crowd of hundreds, if not close to a thousand, rallied to denounce hate crimes and attacks on Asian Americans in the days following the deadly shootings at Atlanta-area massage and spa parlors. Between speakers, a march ar…", "publishedAt": "2021-03-21T18:46:00Z", "source": {"id": null, "name": "KOMO News"}, "title": "'I feel sad and I feel proud:' Hundreds rally against hate crimes against Asian Americans - KOMO News", "url": "https://komonews.com/news/local/i-feel-sad-and-i-feel-proud-hundreds-rally-against-hate-crimes-against-asian-americans", "urlToImage": "https://static-18.sinclairstoryline.com/resources/media/39d61f16-27a6-4110-8fae-d4e4bb4fb2f1-large16x9_FTP20COLE11PPKGBVUESTOPASIANHATERALLYARP_frame_2586.jpg?1616352026645"}, {"author": "Veronica Stracqualursi, CNN", "content": "(CNN)Sen. Roy Blunt, a member of GOP leadership, argued on Sunday that Americans don't need \"alternative versions\" of what occurred the day of the US Capitol insurrection, pushing back on Republican … [+2437 chars]", "description": "Sen. Roy Blunt, a member of GOP leadership, argued on Sunday that Americans don't need \"alternative versions\" of what occurred the day of the US Capitol insurrection, pushing back on Republican Sen. Ron Johnson's comments that mischaracterize the riot and its…", "publishedAt": "2021-03-21T17:50:33Z", "source": {"id": "cnn", "name": "CNN"}, "title": "Top Senate Republican says Americans don't need 'alternative versions' of January 6 Capitol attack - CNN", "url": "https://www.cnn.com/2021/03/21/politics/roy-blunt-january-6-capitol-insurrection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321121248-roy-blunt-210308-super-tease.jpg"}, {"author": "David Goldman, CNN Business", "content": null, "description": "Two of North America's largest railroad companies announced a merger Sunday that would connect freight customers to Canada, the United States and Mexico on a single network for the first time in history.", "publishedAt": "2021-03-21T17:14:00Z", "source": {"id": "cnn", "name": "CNN"}, "title": "Railroad megamerger would create the first Mexico-US-Canada freight rail network - CNN", "url": "https://www.cnn.com/2021/03/21/investing/canadian-pacific-kansas-city-southern-merger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210321113521-canadian-pacific-train-file-super-tease.jpg"}, {"author": "Sam Barsanti", "content": "The first episode of Marvel Studios The Falcon And The Winter Soldierpremiered on Disney+ on Friday, giving movie-starved Marvel fans a chance to catch back up with Sam Wilson, Bucky Barnes, and the … [+2594 chars]", "description": "Ed Brubaker, the co-creator of the Winter Soldier and an iconic Captain America comic writer, has \"mixed feelings\" about Marvel Studios' continued use of his character.", "publishedAt": "2021-03-21T17:00:00Z", "source": {"id": null, "name": "The A.V. Club"}, "title": "Winter Soldier co-creator Ed Brubaker has \"mixed feelings\" about Bucky getting a TV show - The A.V. Club", "url": "https://tv.avclub.com/winter-soldier-co-creator-ed-brubaker-has-mixed-feelin-1846523107", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/k98qpjftinhx8ktpktz4.jpg"}, {"author": null, "content": "PEORIA, ILLINOIS - Bradley University student Zach Bachmann didnt grow up thinking hed be an astronaut.\r\nIm short, blind and asthmatic, so I cant really be an astronaut if I wished to, he said.\r\nBut … [+3776 chars]", "description": "Bradley University student Zach Bachmann didn’t grow up thinking he’d be an astronaut.\n\n“I’m short, blind and asthmatic, so I can’t really be an astronaut if I wished to,” he said.\n\nBut a lifelong interest in video games and computers is putting him at the ce…", "publishedAt": "2021-03-21T07:15:25Z", "source": {"id": null, "name": "VOA News"}, "title": "NASA Turns to College Students to Design New Suit Technology - Voice of America", "url": "https://www.voanews.com/science-health/nasa-turns-college-students-design-new-suit-technology", "urlToImage": "https://im-media.voltron.voanews.com/Drupal/01live-166/kaltura-video-thumbs/1_0/1_02gatgdj.jpg"}, {"author": "CNA", "content": "ATLANTA: Hundreds of demonstrators gathered outside the Georgia State Capitol in Atlanta on Saturday (Mar 20) in support of the Asian American community after a shooting at three local day spas this … [+3158 chars]", "description": "Hundreds of demonstrators gathered outside the Georgia State Capitol in Atlanta on Saturday in support of the Asian American community after a shooting at three local day spas this week left eight people dead, six of them Asian women.", "publishedAt": "2021-03-20T23:55:52Z", "source": {"id": null, "name": "CNA"}, "title": "Hundreds rally in Atlanta to support Asian American community after fatal shootings - CNA", "url": "https://www.channelnewsasia.com/news/world/atlanta-spa-shootings-rally-support-asian-american-community-14454920", "urlToImage": "https://cna-sg-res.cloudinary.com/image/upload/q_auto,f_auto/image/14455822/16x9/991/557/83257e30744719438b04ce3f7fd1e02f/qX/massage-business-shootings-95316-jpg-1616279801.jpg"}], "message": "Successful api call", "number_of_news": 7, "status": 200, "topic": "america"}