{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Epidemiological Alert: Chikungunya increase in the Region of the Americas, 13 February 2023 - World - ReliefWeb", "description": "Situation Report in English on World about Health and Epidemic; published on 13 Feb 2023 by PAHO and WHO", "url": "https://reliefweb.int/report/world/epidemiological-alert-chikungunya-increase-region-americas-13-february-2023", "urlToImage": "https://reliefweb.int/sites/default/files/styles/large/public/previews/18/8d/188dcbba-ab1c-4404-9f99-e4a00f421720.png", "publishedAt": "2023-02-14T06:20:58Z", "content": "In 2022, the number of cases and deaths due to chikungunya in the Region of the Americas were above the numbers reported in previous years. The first weeks of 2023 have seen this trend continuing wit… [+2016 chars]"}, {"source": {"id": null, "name": "Cslbehring.com"}, "author": "", "title": "American Heart Month Hits Close to Home - CSL Behring", "description": "Jenny Mears is leading CSL’s clinical work in the cardiovascular therapy area. Learn how her father’s heart attack at 50 helped propel her toward a career in heart health.", "url": "https://www.cslbehring.com/vita/2023/american-heart-month-hits-close-to-home", "urlToImage": "https://www.cslbehring.com/-/media/shared/vita-2023/heart-month.jpg", "publishedAt": "2023-02-13T22:52:50Z", "content": "In February 1964, when the first American Heart Month was proclaimed, cardiovascular diseases were responsible for over half of all deaths in the United States annually. Today, even with the current … [+2677 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Sign language performer shines at Super Bowl - CTV News", "description": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl. Videos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise her energetic performances Sunday.", "url": "https://www.ctvnews.ca/entertainment/how-asl-performer-justina-miles-stole-the-show-at-super-bowl-lvii-1.6271922", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2023/2/13/justina-miles-at-the-super-bowl-1-6271929-1676320761688.jpg", "publishedAt": "2023-02-13T20:40:07Z", "content": "Rihanna wasn't the only one shining bright like a diamond during the Super Bowl.\r\nVideos of Justina Miles, a deaf American Sign Language interpreter, are racking up views online as admirers praise he… [+1975 chars]"}, {"source": {"id": null, "name": "Technewsboy.com"}, "author": "Scott Marlette", "title": "The complete history of Apple at the Super Bowl: 1984, Lemmings, HAL, and Rihanna - TechNewsBoy.com - Technewsboy", "description": "You might have heard that the biggest football game of the year happening this Sunday—that’s “American football” for those in the U.K. But it’s not just about the Philadelphia Eagles vs. the Kansas City Chiefs: The Super Bowl is the most-watched spor", "url": "https://technewsboy.com/the-complete-history-of-apple-at-the-super-bowl-1984-lemmings-hal-and-rihanna/", "urlToImage": "https://www.macworld.com/wp-content/uploads/2023/02/super-bowl-apple-4.jpg?quality=50&strip=all&w=1024", "publishedAt": "2023-02-12T15:32:07Z", "content": "You might have heard that the biggest football game of the year happening this Sundaythats American football for those in the U.K. But its not just about the Philadelphia Eagles vs. the Kansas City C… [+5755 chars]"}]}