{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "KABC-TV"}, "author": null, "title": "WGA members overwhelmingly ratify new deal with Hollywood studios, officially ending strike - KABC-TV", "description": "Members of the Writers Guild of America overwhelmingly ratified a new labor contract with Hollywood studios, closing the book on a strike that helped bring film and TV production to a halt.", "url": "https://abc7.com/wga-vote-contract-writers-strike/13883927/", "urlToImage": "https://cdn.abcotvs.com/dip/images/13884422_100923-kabc-4pm-wga-strike-vid.jpg?w=1600", "publishedAt": "2023-10-10T00:00:00Z", "content": "LOS ANGELES (KABC) -- Members of the Writers Guild of America overwhelmingly ratified a new labor contract with Hollywood studios, the union announced Monday, closing the book on a strike that helped… [+1408 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Kaitlin Vogel", "title": "What is Cardiovascular-Kidney-Metabolic Syndrome? What to Know - Healthline", "description": "Officials from the American Heart Association say that multiple chronic conditions can be defined as a new syndrome called cardiovascular-kidney-metabolic syndrome or CKM.", "url": "https://www.healthline.com/health-news/new-syndrome-identified-that-links-heart-disease-metabolic-disorders-and-kidney-disease", "urlToImage": "https://media.post.rvohealth.io/wp-content/uploads/2023/10/doctor-patient-heart-732x549-thumbnail.jpg", "publishedAt": "2023-10-09T22:56:42Z", "content": "<ul><li>The American Heart Association has released a new advisory regarding a new type of condition related to heart, kidney and metabolic disorders. </li><li>Health experts are referring to this as… [+7899 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'Absolute terror': American living in Israel speaks after relatives were kidnapped - MSNBC", "description": "Abbey Onn, an American living in Israel, spoke to Andrea Mitchell about her relatives who have been kidnapped by Hamas and and seen on video posted online.» ...", "url": "https://www.youtube.com/watch?v=pfMoYKTBaTE", "urlToImage": "https://i.ytimg.com/vi/pfMoYKTBaTE/maxresdefault.jpg", "publishedAt": "2023-10-09T19:00:16Z", "content": null}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Tracing Footprints: Humans Got to America 7,000 Years Earlier Than Thought - SciTechDaily", "description": "New research, supported by advanced dating techniques, suggests that humans settled in the Americas around 23,000 years ago, challenging earlier beliefs of a 14,000-year timeline. When and how humans first settled in the Americas is a subject of considerable …", "url": "https://scitechdaily.com/tracing-footprints-humans-got-to-america-7000-years-earlier-than-thought/", "urlToImage": "https://scitechdaily.com/images/White-Sands-National-Park-Fossilized-Footprints.jpg", "publishedAt": "2023-10-09T10:33:03Z", "content": "The footprints come from a group of people of different ages. Credit: National Park Service\r\nNew research, supported by advanced dating techniques, suggests that humans settled in the Americas around… [+6325 chars]"}]}