{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Zeke Miller, Michael Balsamo, Colleen Long, Aamer Madhani", "title": "US downs Chinese balloon, a flashpoint in US-China tensions - The Associated Press", "description": "WASHINGTON (AP) — The U.S. military on Saturday shot down a suspected Chinese spy balloon off the Carolina coast on orders from President Joe Biden after it traversed sensitive military sites across North America, the latest flashpoint in tensions between Was…", "url": "https://apnews.com/article/politics-united-states-government-china-antony-blinken-51e49202f2a0a50541cde059934c4cfb", "urlToImage": "https://storage.googleapis.com/afs-prod/media/44256fa52f8948b9b5fed498480ef07d/781.webp", "publishedAt": "2023-02-04T21:02:08Z", "content": "WASHINGTON (AP) The U.S. military on Saturday shot down a suspected Chinese spy balloon off the Carolina coast on orders from President Joe Biden after it traversed sensitive military sites across No… [+7215 chars]"}, {"source": {"id": null, "name": "RNZ"}, "author": "RNZ News", "title": "US shoots down suspected Chinese spy balloon - RNZ", "description": "The US military hopes to recover debris from the suspected Chinese spy aircraft that flew across America.", "url": "https://www.rnz.co.nz/news/world/483669/us-shoots-down-suspected-chinese-spy-balloon", "urlToImage": "https://rnz-ressh.cloudinary.com/image/upload/s--w8kgcDin--/t_tohu-badge-facebook/4LE3XH2_000_338F4KZ_jpg", "publishedAt": "2023-02-04T20:45:54Z", "content": "The Pentagon tracked the Chinese spy balloon which is pictured here over Billings, Montana. Photo: AFP / Chase Doak\r\nThe US has shot down a suspected Chinese spy balloon that has flown across America… [+3267 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Shoots Down Suspected Chinese Spy Balloon Off Carolina Coast - NDTV", "description": "The US today shot down a Chinese balloon off the country's east coast, American media reported, hours after President Joe Biden vowed to \"take care\" of the suspected spy device.", "url": "https://www.ndtv.com/world-news/us-shoots-down-suspected-chinese-spy-balloon-off-carolina-coast-reports-3754078", "urlToImage": "https://c.ndtvimg.com/2023-02/v6lsioag_chinese-spy-balloon-over-us_625x300_03_February_23.jpg", "publishedAt": "2023-02-04T20:26:00Z", "content": "New Delhi: The United States today shot down a suspected Chinese spy balloon off the country's east coast, the Pentagon said. Earlier this week, US had claimed that the balloon was spying on sensitiv… [+1390 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Stephanie Borys", "title": "Richard Marles hints at three-way AUKUS submarine design as White House unveiling looms - ABC News", "description": "Defence Minister Richard Marles, in America to meet his US counterpart, hints that Australia's future nuclear-powered submarine will improve the capabilities of all three members of the AUKUS agreement.", "url": "https://www.abc.net.au/news/2023-02-04/marles-hints-at-three-way-aukus-submarine-design/101931608", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/d8f16e7ff5b08ac052440a93054c8ce5?impolicy=wcms_crop_resize&cropH=1125&cropW=2000&xPos=0&yPos=85&width=862&height=485", "publishedAt": "2023-02-04T06:12:12Z", "content": "The design of Australia's first fleet of nuclear-powered submarines is expected to be a three-way effort, with the defence minister indicating the AUKUS agreement would result in all countries increa… [+4496 chars]"}, {"source": {"id": null, "name": "Patientcareonline.com"}, "author": "Sydney Jennings", "title": "Long COVID in the US: By the Numbers - Patient Care Online", "description": "How many Americans report having long COVID symptoms? Which demographics is long COVID more prevalent in? A new analysis sheds light.", "url": "https://www.patientcareonline.com/view/long-covid-in-the-us-by-the-numbers", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/patientcare/489a9ce1fd6d062c0e93bd9883679775410c3633-1248x720.jpg?fit=crop&auto=format", "publishedAt": "2023-02-03T16:28:41Z", "content": "Reports of previously healthy individuals experiencing lingering symptoms from an infection with SARS-CoV-2 started shortly after the beginning of the COVID-19 pandemic. Post-COVID conditions, or lon… [+1176 chars]"}]}