{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": "Dempsey Reyes", "title": "PH told to drop plexiglass barriers - INQUIRER.net", "description": "MANILA, Philippines — Instead of face shields and plexiglass barriers, the Philippines should rely more on protective masks and proper ventilation, and even going outdoors, a leading American", "url": "https://www.inquirer.net", "urlToImage": "https://newsinfo.inquirer.net/files/2022/01/232931-620x423.jpeg", "publishedAt": "2022-01-11T20:59:00Z", "content": "MANILA, Philippines Instead of face shields and plexiglass barriers, the Philippines should rely more on protective masks and proper ventilation, and even going outdoors, a leading American aerosol s… [+3271 chars]"}, {"source": {"id": null, "name": "Donegaldaily.com"}, "author": "Staff Writer", "title": "Community’s amazing generosity will bring musician Kieran home - Donegal Daily", "description": "A Go Fund Me page set up just a couple of days ago to help bring home the body of a well-known Donegal musician from America has been swamped with love and generosity. Ballyshannon Kieran Whelan sadly departed this world on Saturday 8th January in Baltimore, …", "url": "https://www.donegaldaily.com/2022/01/11/communitys-amazing-generosity-to-bring-musician-kieran-home/", "urlToImage": "https://www.donegaldaily.com/wp-content/uploads/2022/01/Kieran-Whelan.png", "publishedAt": "2022-01-11T19:43:19Z", "content": "A Go Fund Me page set up just a couple of days ago to help bring home the body of a well-known Donegal musician from America has been swamped with love and generosity.\r\nBallyshannon Kieran Whelan sad… [+1662 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": null, "title": "Common Cold Can Protect Against Coronavirus, Study Finds - Voice of America", "description": "U.S adults usually catch one or two common colds a year. They’re usually little more than an annoyance, but new research suggests they may offer some protection from a virus that’s much more dangerous. Henry Ridgwell reports from London.", "url": "https://www.voanews.com/a/common-cold-can-protect-against-coronavirus-study-finds-/6392393.html", "urlToImage": "https://gdb.voanews.com/9722760e-66f4-4206-bf59-bd42631f072d_tv_w1200_r1.jpg", "publishedAt": "2022-01-11T17:53:00Z", "content": null}]}