{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Guardian"}, "author": "Angelique Chrisafis", "title": "Black French-American rights activist Josephine Baker enters Panthéon - The Guardian", "description": "French-American war hero is first Black woman inducted into Paris mausoleum for revered figures", "url": "https://amp.theguardian.com/world/2021/nov/30/black-french-american-rights-activist-josephine-baker-enters-pantheon", "urlToImage": null, "publishedAt": "2021-11-30T13:44:00Z", "content": "FranceFrench-American war hero is first Black woman inducted into Paris mausoleum for revered figures\r\nJosephine Baker, the French-American civil rights activist, music hall superstar and second worl… [+6819 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Covid: Omicron lockdown not needed for now, Biden says - BBC News", "description": "The president urges Americans not to panic about the new Coronavirus variant, saying a lockdown is avoidable.", "url": "https://www.bbc.com/news/world-us-canada-59469486", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6CF0/production/_121888872_bidengetty.jpg", "publishedAt": "2021-11-30T07:02:38Z", "content": "Image source, Getty Images\r\nImage caption, The US president urged people to get vaccinated and wear masks amid concern over the new Covid variant\r\nUS President Joe Biden has called the Omicron Covid-… [+2998 chars]"}, {"source": {"id": null, "name": "24/7 Wall St."}, "author": "Angelo Young", "title": "Most Common Passwords in America and How Long They Take to Crack - 24/7 Wall St.", "description": "Despite the rise of cyber attacks involving things like phishing, denial of service, and malware, people often still create passwords that are easy to crack (simple numerical sequences, for instance, or personal information that might be publicly accessible, …", "url": "https://247wallst.com/special-report/2021/11/28/most-common-passwords-in-america-and-how-long-they-take-to-crack/", "urlToImage": "https://247wallst.com/wp-content/uploads/2021/09/imageForEntry19-6m6.jpg", "publishedAt": "2021-11-28T15:00:27Z", "content": "Despite the rise of cyber attacks involving things like phishing, denial of service, and malware, people often still create passwords that are easy to crack (simple numerical sequences, for instance,… [+2044 chars]"}]}