{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Safety tips on how to safely watch solar eclipse - NBC Bay Area", "description": "This coming Monday, certain parts of North America will go dark in the middle of the morning as a total eclipse is expected around 11 a.m. While the Bay Area...", "url": "https://www.youtube.com/watch?v=fWT7lygD19A", "urlToImage": "https://i.ytimg.com/vi/fWT7lygD19A/maxresdefault.jpg", "publishedAt": "2024-04-06T03:47:24Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "TOM WITHERS", "title": "South Carolina women stay perfect, surge past N.C. State 78-59 to reach NCAA title game - The Associated Press", "description": "All-America center Kamilla Cardoso scored 22 points and unbeaten South Carolina emphatically kept its perfect season going, advancing to the championship game of the women’s NCAA Tournament with a 78-59 victory over North Carolina State. The talented and tena…", "url": "https://apnews.com/article/march-madness-south-carolina-nc-state-score-abe07dc5601ba92b2f93c68a04a5a668", "urlToImage": "https://dims.apnews.com/dims4/default/4470876/2147483647/strip/true/crop/3856x2169+0+201/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc2%2Fc2%2Fde82b8c27746e06d92089379097f%2F51b45392b3dd4d2590bd9854b17b685c", "publishedAt": "2024-04-06T02:37:30Z", "content": "CLEVELAND (AP) Perfectly dominant. Nothing new for South Carolina.\r\nWith All-America center Kamilla Cardoso scoring 22 points, the Gamecocks emphatically kept their unbeaten season going, advancing t… [+5393 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "MJ Lee, Jennifer Hansler", "title": "US preparing for significant Iran attack on US or Israeli assets in the region as soon as next week - CNN", "description": "The US is on high alert and actively preparing for a “significant” attack that could come as soon as within the next week by Iran targeting Israeli or American assets in the region in response to Monday’s Israeli strike in Damascus that killed top Iranian com…", "url": "https://www.cnn.com/2024/04/05/politics/us-israel-iran-retaliation-strike/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/ap24092585837399.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-04-05T23:55:00Z", "content": "The US is on high alert and actively preparing for a significant attack that could come as soon as within the next week by Iran targeting Israeli or American assets in the region in response to Monda… [+5921 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Statement from President Joe Biden on the March Jobs Report - The White House", "description": "Today’s report marks a milestone in America’s comeback. Three years ago, I inherited an economy on the brink. With today’s report of 303,000 new jobs in March, we have passed the milestone of 15 million jobs created since I took office. That’s 15 million more…", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2024/04/05/statement-from-president-joe-biden-on-the-march-jobs-report/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2024-04-05T22:37:53Z", "content": "Todays report marks a milestone in Americas comeback. Three years ago, I inherited an economy on the brink. With todays report of 303,000 new jobs in March, we have passed the milestone of 15 million… [+885 chars]"}]}