{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Reed Albergotti", "title": "Live updates: Apple puts CEO Tim Cook on the stand to fight the maker of ‘Fortnite’ - The Washington Post", "description": "Tim Cook, one of the most successful corporate leaders in American history, will hammer home a message Apple has repeated throughout the trial: Forcing Apple to open up app distribution to competitors would hurt consumer privacy and security.", "url": "https://www.washingtonpost.com/technology/2021/05/21/apple-tim-cook-epic-fortnite-trial/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/P4HRCXF2JUI6XPCKMKCJZ5WMVE.jpg&w=1440", "publishedAt": "2021-05-21T16:27:00Z", "content": "Apple is about to begin its direct questioning of Tim Cook. What were really waiting for here is the cross examination from Epics lawyers, which will come later in the morning. Thats when Cook is rea… [+1587 chars]"}, {"source": {"id": null, "name": "Macau Business"}, "author": null, "title": "With 70 pct of adults vaccinated, US can avoid later surge of COVID-19 - Macau Business", "description": "If 70 percent of American adults get at least one dose of the coronavirus vaccine by July 4, the United States could avoid a case surge later in the year", "url": "https://www.macaubusiness.com/with-70-pct-of-adults-vaccinated-u-s-can-avoid-later-surge-of-covid-19-expert/", "urlToImage": null, "publishedAt": "2021-05-21T09:48:32Z", "content": "If 70 percent of American adults get at least one dose of the coronavirus vaccine by July 4, the United States could avoid a case surge later in the year, said a top expert on Thursday.\r\n“If we get t… [+977 chars]"}, {"source": {"id": null, "name": "Deccan Chronicle"}, "author": null, "title": "Gum disease could lead to a severe COVID-19 infection - Deccan Chronicle", "description": "The report was published in the US's leading organisation of periodontists, the American Academy of Periodontology (AAP)", "url": "https://www.deccanchronicle.com/science/science/210521/gum-disease-could-lead-to-a-severe-covid-19-infection.html", "urlToImage": "https://s3.ap-southeast-1.amazonaws.com/images.deccanchronicle.com/dc-Cover-ssm6jsl32bc90ov7ng8muncpd4-20210521145705.Medi.jpeg", "publishedAt": "2021-05-21T09:28:00Z", "content": "Washington: As per a new report, studies show that maintaining good oral hygiene can help you overcome COVID-19, implying that there is a direct connection between oral hygiene and the deadly infecti… [+2599 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Paula Span", "title": "Family Caregivers Feel the Pandemic’s Weight - The New York Times", "description": "Early studies reveal the toll that lockdowns, isolation and stress have taken on those who care for older Americans.", "url": "https://www.nytimes.com/2021/05/21/health/coronavirus-home-caregivers-elderly.html", "urlToImage": "https://static01.nyt.com/images/2021/05/21/science/21SCI-SPAN-CAREGIVERS1/21SCI-SPAN-CAREGIVERS1-facebookJumbo.jpg", "publishedAt": "2021-05-21T09:00:28Z", "content": "Other caregivers ran into trouble accessing health care, either for themselves or their loved ones. Ora Larson, 82, was scheduled for back surgery in the spring of 2020 in St. Paul, Minn., and was lo… [+1663 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Yael Halon", "title": "US seeing wave of 'textbook anti-Semitism' amid Israel-Gaza tensions - Fox News", "description": "From New York and California to Illinois and Utah, the recent conflict between Israel and Gaza has generated a disturbing backlash against American Jews – who have found themselves the targets of death threats, hate speech and violent physical attacks.", "url": "https://www.foxnews.com/us/us-seeing-wave-of-textbook-anti-semitism-amid-israel-gaza-tensions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2021/05/Israel-Palestinian-Protest-GETTY-3.jpg", "publishedAt": "2021-05-21T08:04:04Z", "content": "From New York and California to Illinois and Utah, the recent conflict between Israel and Gaza has generated a disturbing backlash against American Jews who have found themselves the targets of death… [+12604 chars]"}]}