{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "New Zealand Herald"}, "author": "Chris Keall", "title": "iPhone SOS-by-satellite service goes live in North America - New Zealand Herald", "description": "Globalstar - Rocket Lab's largest customer - connects you in areas with no cell sites.", "url": "https://www.nzherald.co.nz/business/iphone-sos-by-satellite-service-goes-live-in-north-america/RZPT2S5YP5BNTH7ZCX6JXEJLKE/", "urlToImage": "https://www.nzherald.co.nz/resizer/nCCOCGVAhobp-mx3e8MA0V8kDkU=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/PDS3W5RUSFGFXKEGRHVTN4RQEY.jpg", "publishedAt": "2022-11-16T03:38:31Z", "content": "Apple is using US satellite network provider Globalstar - which has emerged as Rocket Lab's largest single customer - for its new SOS service, for areas with no cellular or Wi-Fi coverage. Photo / Su… [+2014 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Donald Trump announces 2024 presidential bid in Mar-a-Lago speech - BBC", "description": "The former president vows to \"make America great and glorious again\" in a speech at Mar-a-Lago.", "url": "https://www.bbc.co.uk/news/live/world-us-canada-63600151", "urlToImage": "https://m.files.bbci.co.uk/modules/bbc-morph-news-waf-page-meta/5.3.0/bbc_news_logo.png", "publishedAt": "2022-11-16T02:37:30Z", "content": "Donald Trump spent considerable time talking about what he viewed as the highlights of his presidency and the lowlights of the first two years of the Joe Biden administration. As the speech progresse… [+1346 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Kelly Gilmore", "title": "Candace Cameron Bure’s Daughter Natasha Weighs in After Her “Traditional Marriage” Comment - Yahoo Entertainment", "description": "Natasha Bure backed Candace Cameron Bure after she said the Great American Family network \"will keep traditional marriage at the core.” Read Natasha’s...", "url": "https://www.yahoo.com/entertainment/candace-cameron-bure-daughter-natasha-012500781.html", "urlToImage": "https://media.zenfs.com/en/e__181/8fcfc1fa4b3b6bd3e8852b06f97a28c2", "publishedAt": "2022-11-16T02:29:47Z", "content": "Natasha Bure is sticking by her mother's side.\r\nThe 24-year-old daughter of Candace Cameron Bure stood behind the Full House star after Candace said the Great American Family network, where she serve… [+2087 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Limited postpartum follow-up may miss high blood pressure in 1 in 10 new moms - Medical Xpress", "description": "In an analysis of more than 2,400 women, about 1 in 10 without a history of blood pressure issues were diagnosed with high blood pressure in the year after childbirth, according to a research article published today in Hypertension, an American Heart Associat…", "url": "https://medicalxpress.com/news/2022-11-limited-postpartum-follow-up-high-blood.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/1-highbloodpre.jpg", "publishedAt": "2022-11-15T10:00:02Z", "content": "In an analysis of more than 2,400 women, about 1 in 10 without a history of blood pressure issues were diagnosed with high blood pressure in the year after childbirth, according to a research article… [+6796 chars]"}]}