{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Trump extends TikTok ban deadline for a third time, without clear legal basis - AP News", "description": "President Donald Trump on Thursday signed an executive order to keep TikTok running in the U.S. for another 90 days to give his administration more time to broker a deal to bring the social media platform under American ownership. It is the third time Trump h…", "url": "https://apnews.com/article/tiktok-ban-trump-delay-executive-order-3211a98113615be44cf92b32dca69a8e", "urlToImage": "https://dims.apnews.com/dims4/default/e300389/2147483647/strip/true/crop/5135x2888+0+267/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F80%2F10%2F34cb8e838005fc1e3062e5eac8de%2F39f54b4fcba042c689b17de8fe262234", "publishedAt": "2025-06-19T20:02:00Z", "content": "WASHINGTON (AP) President Donald Trump on Thursday signed an executive order to keep TikTok running in the U.S. for another 90 days to give his administration more time to broker a deal to bring the … [+3990 chars]"}, {"source": {"id": "bloomberg", "name": "Bloomberg"}, "author": "Mary Schlangenstein, Leen Al-Rashdan", "title": "American, United Pause Middle East Flights on Rising Tension - Bloomberg.com", "description": "American Airlines Group Inc. suspended daily flights from the US to the capital of Qatar, while United Airlines Holdings Inc. paused service to Dubai because of military actions and heightened tensions in the Middle East.", "url": "https://www.bloomberg.com/news/articles/2025-06-19/american-united-airline-suspend-some-middle-east-flights", "urlToImage": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iFsdxYeqmdGk/v1/1200x778.jpg", "publishedAt": "2025-06-19T16:20:51Z", "content": "American Airlines Group Inc. suspended daily flights from the US to the capital of Qatar, while United Airlines Holdings Inc. paused service to Dubai because of military actions and heightened tensio… [+417 chars]"}, {"source": {"id": null, "name": "HuffPost"}, "author": "Jake Kleinman", "title": "'Jaws' Sparked America's Fascination With Sharks — And Left Behind A Complicated Legacy - HuffPost", "description": "It's been 50 years since the Steven Spielberg blockbuster hit theaters.", "url": "https://www.huffpost.com/entry/jaws-movie-sharks_n_68507d37e4b0b2314479b4d5", "urlToImage": "https://img.huffingtonpost.com/asset/68530ca61900000e6e88159d.jpg?cache=vfy31bqLb1&ops=1200_630", "publishedAt": "2025-06-19T12:00:20Z", "content": "Last summer, a great white shark washed up on the shore of Nantucket, Massachusetts. When a family on vacation came across the beached behemoth as it flailed in the shallow waves, they made a surpris… [+7167 chars]"}]}