{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell, Elizabeth Wolfe, Rosa Flores, Andy Rose", "title": "2 American survivors of deadly Mexico kidnapping are being treated in US hospital, officials say, as bodies of 2 killed are examined. Here's what we know - CNN", "description": "Two Americans have returned to the US from Mexico and are being treated at a hospital after an armed kidnapping left two of their friends dead and spurred a dayslong search for the travelers who had crossed the border for a medical procedure, officials say.", "url": "https://www.cnn.com/2023/03/08/americas/mexico-matamoros-americans-kidnapped-wednesday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230307111057-matamoros-mexico-kidnapping-scene.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-03-08T10:55:00Z", "content": "Two Americans have returned to the US from Mexico and are being treated at a hospital after an armed kidnapping left two of their friends dead and spurred a dayslong search for the travelers who had … [+8205 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrea Blanco", "title": "Mexico kidnapping — live: Americans seized by drug cartel asked for directions before deadly Matamoros attack - The Independent", "description": "Video appears to capture the moment Latavia ‘Tay’ Mcgee, Shaeed Woodard, Zindell Brown and Eric James Williams were kidnapped in Matamoros – an area dominated by the Gulf drug cartel", "url": "https://www.independent.co.uk/news/world/americas/crime/matamoros-mexico-americans-kidnapping-latest-news-b2296246.html", "urlToImage": "https://static.independent.co.uk/2023/03/08/01/AP23066721072548.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2023-03-08T07:00:00Z", "content": "Gulf drug cartel believed to be behind attack\r\nGovernor of Tamaulipas Américo Villarreal said during a press conference that the group was moved from different locations, including a clinic, during t… [+1248 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "Carly Cassella", "title": "Fossils of Hummingbird-Sized Ants Are Challenging What We Know About Insect Sizes - ScienceAlert", "description": "More than 47 million years ago, giant carnivorous ants swarmed the prehistoric forest floors of North America looking for prey.", "url": "https://www.sciencealert.com/fossils-of-hummingbird-sized-ants-are-challenging-what-we-know-about-insect-sizes", "urlToImage": "https://www.sciencealert.com/images/2023/03/GiantAntEocene.jpg", "publishedAt": "2023-03-08T06:17:04Z", "content": "More than 47 million years ago, giant carnivorous ants swarmed the prehistoric forest floors of North America looking for prey.\r\n'Giant' is no exaggeration either. Some ancient colonies that lived in… [+3584 chars]"}]}