{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Reuters", "title": "US Army says soldiers who refuse Covid-19 vaccine could be dismissed - Times of India", "description": "US News: American army officers who refuse to be vaccinated against the coronavirus could be suspended from their duties and possibly discharged, the US Army s.", "url": "https://timesofindia.indiatimes.com/world/us/us-army-says-soldiers-who-refuse-covid-19-vaccine-could-be-dismissed/articleshow/86225577.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-86225953,width-1070,height-580,imgsize-7728,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-09-15T08:54:00Z", "content": "US Army says soldiers who refuse Covid-19 vaccine could be dismissed"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "NASA astronaut to set American record for longest space stay by inhabiting ISS for 353 days - Firstpost", "description": "The extended stay will give NASA the opportunity to study how the human body adapts to life in microgravity for longer time periods.", "url": "https://www.firstpost.com/tech/science/nasa-astronaut-to-set-american-record-for-longest-space-stay-by-inhabiting-iss-for-353-days-9966711.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/09/51251407663_7dc21edc32_k-1.jpg", "publishedAt": "2021-09-15T08:52:26Z", "content": "FP TrendingSep 15, 2021 14:22:26 IST\r\nNASA astronaut Mark Vande Hei and Roscosmos cosmonaut Pyotr Dubrov will remain aboard the International Space Station (ISS) till March 2022. Upon his return, Van… [+3038 chars]"}, {"source": {"id": null, "name": "CinemaBlend"}, "author": "Laura Hurley", "title": "Watch America's Got Talent Comedian Josh Blues Hilarious Simon Cowell Botox Joke, And What He Wishes Was Different About AGT - CinemaBlend", "description": "Comedian Josh Blue opened up about what he wishes was different on AGT, following his hilarious set with a zinger for Simon Cowell.", "url": "https://www.cinemablend.com/television/2573565/watch-americas-got-talent-comedian-josh-blue-simon-cowell-botox-joke-wishes-was-different", "urlToImage": "https://img.cinemablend.com/quill/7/f/a/e/9/0/7fae903bc0325f0e2e708c70efe052c218e175ec.jpg", "publishedAt": "2021-09-15T05:37:00Z", "content": "Spoilers ahead for the performances of the Season 16 finale ofAmerica's Got Talent.\r\nSeason 16 of America's Got Talent is very nearly at an end, and the final ten competitors have delivered their fin… [+5430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh, Joseph Ataman, Saskya Vandoorne and Melissa Bell, CNN", "title": "Will Biden's mandates work? Macron's vaccine pass gamble may hold some clues - CNN", "description": "After US President Joe Biden laid out a wide-ranging plan to tackle the worsening Covid pandemic in America with a raft of new vaccination rules last week, the big question on the minds of many is: Will mandating vaccines work? In France, it's a gamble that i…", "url": "https://www.cnn.com/2021/09/15/europe/france-us-vaccine-mandates-compared-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210914122209-03-france-us-vaccine-mandates-cmd-intl-super-tease.jpg", "publishedAt": "2021-09-15T04:02:00Z", "content": "Paris (CNN)After US President Joe Biden laid out a plan to tackle the worsening pandemic in America with a raft of new vaccination rules last week, the big question on the minds of many is: Will mand… [+9659 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Cronje", "title": "'Spying, sabotage, bribes': The time to probe tobacco claims is now - Johann van Loggerenberg | Fin24 - News24", "description": "Former top SARS executive Johann van Loggerenberg says a recent BBC report about British American Tobacco allegedly sabotaging and spying on rivals in southern Africa was \"independent confirmation\" for what he had long been saying.", "url": "https://www.news24.com/fin24/companies/spying-sabotage-bribes-the-time-to-probe-tobacco-claims-is-now-johann-van-loggerenberg-20210915", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7618/b0906839438246519768110f4c66d910.jpg", "publishedAt": "2021-09-15T03:31:38Z", "content": "Former South African Revenue Service (SARS) executive Johann van Loggerenberg says a recent BBC report about British American Tobacco (BAT) allegedly sabotaging and spying on rivals in southern Afric… [+629 chars]"}, {"source": {"id": null, "name": "NEWS10 ABC"}, "author": "Janel Forte, Nexstar Media Wire", "title": "‘A tragedy’: COVID-19 spike in unvaccinated pregnant women - NEWS10 ABC", "description": "There’s a surge of expectant mothers testing positive for COVID-19 across America. Health officials are urging moms to be vaccinated, but not all are willing to roll up their sleeves.", "url": "https://www.news10.com/top-stories/a-tragedy-covid-19-spike-in-unvaccinated-pregnant-women/", "urlToImage": "https://www.news10.com/wp-content/uploads/sites/64/2021/09/2602ecc374934df0a977ba5a5f67cc43.jpg?w=1280", "publishedAt": "2021-09-14T08:01:51Z", "content": "ATLANTA (NewsNation Now) There’s a surge of expectant mothers testing positive for COVID-19 across America. Health officials are urging moms to be vaccinated, but not all are willing to roll up their… [+2021 chars]"}]}