{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Americankahani.com"}, "author": "Staff Writer", "title": "NASA Chooses Indian American Amit Kshatriya to Head its Most Ambitious Space Exploration Program - American Kahani", "description": "The National Aeronautics and Space Administration (NASA) has chosen Indian American to head its most ambitious space exploration mission ever. It has appointed Amit Kshatriya as the agency’s first head of the new Moon to Mars Program Office. “The Moon to Mars…", "url": "https://americankahani.com/business/nasa-chooses-indian-american-amit-kshatriya-to-head-its-most-ambitious-space-exploration-program/", "urlToImage": "https://americankahani.com/wp-content/uploads/2023/04/MarsIndian.jpg", "publishedAt": "2023-04-03T00:15:29Z", "content": "The National Aeronautics and Space Administration (NASA) has chosen Indian American to head its most ambitious space exploration mission ever. It has appointed Amit Kshatriya as the agencys first hea… [+2645 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Ex-UN ambassador breaks down three reasons behind Russia's move to detain US journalist - CNN", "description": "Former US ambassador to the United Nations Bill Richardson discusses the detainment of American journalist Evan Gershkovich by Russia. #CNN #News", "url": "https://www.youtube.com/watch?v=3k1F2oUCCxw", "urlToImage": "https://i.ytimg.com/vi/3k1F2oUCCxw/maxresdefault.jpg", "publishedAt": "2023-04-02T23:31:38Z", "content": null}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nouran Salahieh, Dakin Andone", "title": "Communities face major destruction after large tornadoes tear through the South and Midwest, leaving at least 24 dead - CNN", "description": "Devastated communities across the American South and Midwest are digging through debris Sunday after ferocious storms and tornadoes this weekend left at least 24 people dead and leveled neighborhoods, as parts of the Southern Plains brace for the possibility …", "url": "https://www.cnn.com/2023/04/02/us/us-severe-storm-south-midwest-sunday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230402020232-01-tornado-indiana-040123.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-04-02T13:16:00Z", "content": "Devastated communities across the American South and Midwest are digging through debris Sunday after ferocious storms and tornadoes this weekend left at least 24 people dead and leveled neighborhoods… [+6385 chars]"}]}