{"articles": [{"author": "Reuters", "content": "The officers walked through the arcade of hair and nail salons, restaurants serving Vietnamese cuisine, and herbal medicine shops on Saturday, April 3, talking to business owners and patrons. They th… [+167 chars]", "description": "A Center for the Study of Hate and Extremism report shows that while hate crimes overall in the US had fallen slightly in 2020, crimes against Asian Americans and Pacific Islanders had jumped by 145%", "publishedAt": "2021-04-05T13:53:00Z", "source": {"id": null, "name": "Rappler"}, "title": "Police, communities across US fight back against anti-Asian hate crimes - Rappler", "url": "https://www.rappler.com/world/us-canada/police-communities-fight-back-against-anti-asian-hate-crimes", "urlToImage": "https://assets2.rappler.com/2021/04/japantown-prepared-march-24-2021-reuters-1617630531724.jpg"}, {"author": null, "content": "Ben Murray-Bruce, former Nigerian senator, says he has sealed a new partnership with Wesley Snipes, American actor and filmmaker, for the production of Hollywood and Nollywood movies.\r\nThe politician… [+1830 chars]", "description": "Ben Murray-Bruce, former Nigerian senator, says he has formed a new partnership with Wesley Snipes, an American actor and filmmaker for the", "publishedAt": "2021-04-05T12:00:00Z", "source": {"id": null, "name": "Thecable.ng"}, "title": "Ben Bruce partners with Wesley Snipes for Nollywood-Hollywood films - TheCable Lifestyle - TheCable", "url": "http://lifestyle.thecable.ng/ben-bruce-partners-with-wesley-snipes-to-produce-nollywood-hollywood-films/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/04/Wesley-Snipes-Ben-Bruce.jpg"}, {"author": "Derek Lawrenson", "content": "Sixty years have now passed since a pugnacious South African upstart flew the oceans and steeled himself to take on the mighty Arnold Palmer and his fanatical Augusta army.\r\nSixty years since the gam… [+6505 chars]", "description": "DEREK LAWRENSON AT AUGUSTA: It's been 60 years since golf's original global ambassador pulled off a triumph that, to this day, still ranks as arguably the most influential victory in the game's history.", "publishedAt": "2021-04-04T21:30:36Z", "source": {"id": null, "name": "Daily Mail"}, "title": "The Grand Old Master: Gary Player recalls how 60 years ago he ended America's Augusta monopoly - Daily Mail", "url": "https://www.dailymail.co.uk/sport/golf/article-9435581/The-Grand-Old-Master-Gary-Player-recalls-60-years-ago-ended-Americas-Augusta-monopoly.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/04/04/21/41334800-0-image-a-20_1617569349244.jpg"}], "message": "Successful api call", "number_of_news": 3, "status": 200, "topic": "america"}