{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "'One of my favorite people': What Queen Elizabeth II meant to decades of American presidents - CNN", "description": "When Princess Elizabeth landed at Washington National Airport on the last day of October 1951, she emerged from her airplane in a raspberry red coat, a new velvet-brimmed hat and, some people observed, more makeup than usual.", "url": "https://www.cnn.com/2022/09/08/politics/american-presidents-queen-elizabeth-ii/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210614172806-02-bidens-queen-elizabeth-0613-super-tease.jpg", "publishedAt": "2022-09-08T23:19:00Z", "content": "(CNN)When Princess Elizabeth landed at Washington National Airport on the last day of October 1951, she emerged from her airplane in a raspberry red coat, a new velvet-brimmed hat and, some people ob… [+11220 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Stretch Drive: Blue Jays in control of playoff destiny with four weeks to go - Sportsnet.ca", "description": "A series win over the Baltimore Orioles this week gave the Toronto Blue Jays some much-needed breathing room in the American League playoff race. Canada's lone Major League Baseball team is in control of its own destiny with four weeks left in the regular sea…", "url": "https://www.sportsnet.ca/mlb/article/stretch-drive-blue-jays-in-control-of-playoff-destiny-with-four-weeks-to-go/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/09/Toronto-Blue-Jays-players-celebrate-1040x572.jpg", "publishedAt": "2022-09-08T18:07:00Z", "content": "A series win over the Baltimore Orioles this week gave the Toronto Blue Jays some much-needed breathing room in the American League playoff race.\r\nCanada's lone Major League Baseball team is in contr… [+4197 chars]"}, {"source": {"id": null, "name": "Latest News in Nigeria & Breaking Naija News 24/7 | LEGIT.NG"}, "author": "Oke-Hortons Nosa", "title": "“Music Is the Weapon”: Nigerian Singer Joeboy Gets a Grammys Recognition Gong - Legit.ng", "description": "Fast-rising Nigerian musician Joeboy gets recognition from Grammys for his collaborative work with the American music group Major Lazer on their 2021 album.", "url": "https://www.legit.ng/entertainment/music/1490698-music-weapon-nigerian-singer-joeboy-a-grammy-recognition-gong/", "urlToImage": "https://netstorage-legit.akamaized.net/images/3884f6dacefe4a1f.jpg", "publishedAt": "2022-09-08T06:58:37Z", "content": "<ul><li>Fast-rising Nigerian singer Joeboy celebrates a huge feat as he gets a recognition plaque from the Grammys for his collaboration work on the album Music is the weapon by Major Lazer</li><li>T… [+2224 chars]"}]}