{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Kemifilani.ng"}, "author": "Harry Onye", "title": "Lori Mccommas age, net worth, wiki, family, biography and latest updates - Kemi Filani News", "description": "Lori Mccommas age, net worth, wiki, family, biography and latest updates. Lori McCommas is an American celebrity who rose to prominence after marrying", "url": "https://www.kemifilani.ng/breaking-news/lori-mccommas-age-net-worth-wiki-family-biography-and-latest-updates", "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2022/10/Lori-McCommas-1300x827.jpg", "publishedAt": "2022-10-18T05:19:30Z", "content": "Lori Mccommas age, net worth, wiki, family, biography and latest updates.\r\nLori McCommas is an American celebrity who rose to prominence after marrying Terrence Howard, an American actor and singer. … [+6705 chars]"}, {"source": {"id": null, "name": "As.com"}, "author": "Gustavo García", "title": "Guardians - Yankees en vivo MLB Playoffs: Juego 5 de la Serie Divisional en directo - AS USA Latino", "description": "Sigue la previa y el minuto a minuto de Cleveland Guardians vs New York Yankees, juego 5 de la Serie Divisional de la Liga Americana desde el Yankee Stadium", "url": "https://us.as.com/mlb/guardians-yankees-en-vivo-mlb-playoffs-juego-5-de-la-serie-divisional-en-directo-n/", "urlToImage": "https://img.asmedia.epimg.net/resizer/x-Q2iFE7RSrbeLO2DoKafOROsJw=/644x362/cloudfront-eu-central-1.images.arcpublishing.com/diarioas/CR366Q56EZD67PVMA3ZIGG5NBA.jpg", "publishedAt": "2022-10-18T02:38:21Z", "content": "El orden al bat de los Guardians estará conformado por Steven Kwan, Amed Rosario, José Ramírez, Josh Naylor, Óscar González, Andrés Giménez, Gabriel Arias, Austin Hedges y Myles Straw\r\nPor su parte, … [+50 chars]"}, {"source": {"id": null, "name": "KGO-TV"}, "author": null, "title": "Coronavirus: Human organs could age 3-4 years faster after COVID infection, study shows - KGO-TV", "description": "Study conducted from millions of Americans showed that several of their organs aged faster by three to four years, with the majority happening among those who were hospitalized, but also to some who had mild COVID symptoms.", "url": "https://abc7news.com/covid-long-haul-study-aging-faster-after-organs-kidney/12340213/", "urlToImage": "https://cdn.abcotvs.com/dip/images/12340492_101722-kgo-patient-generic-img.jpg?w=1600", "publishedAt": "2022-10-18T02:32:25Z", "content": "SAN FRANCISCO (KGO) -- After over two and a half years of COVID research, scientists are seeing the first data points that prove a dramatic change in human organs after a COVID infection.\r\n\"You can s… [+2532 chars]"}, {"source": {"id": null, "name": "Sportsnet.ca"}, "author": null, "title": "Yankees going with Cortes after Game 5 vs. Guardians postponed until Tuesday - Sportsnet.ca", "description": "The final game of the American League Division Series will be played Tuesday at 4:07 p.m. ET / 1:07 p.m. PT on Sportsnet Ontario and SN NOW.", "url": "https://www.sportsnet.ca/mlb/article/yankees-vs-guardians-alds-game-5-postponed-goes-tuesday-at-407-p-m-et/", "urlToImage": "https://www.sportsnet.ca/wp-content/uploads/2022/10/Judge-1-1040x572.jpg", "publishedAt": "2022-10-18T01:41:00Z", "content": "New York Yankees' Aaron Judge watches his home run against the Cleveland Indians during the third inning of Game 3 of a baseball AL Division Series, Saturday, Oct. 15, 2022, in Cleveland. (David Derm… [+11 chars]"}, {"source": {"id": null, "name": "Pandaily.com"}, "author": "Pandaily", "title": "Mathematician Yitang Zhang Claims to Have Proven Riemann Hypothesis Problem - Pandaily", "description": "Yitang Zhang, a Chinese-American mathematician, reportedly disclosed in an online salon organized by the Peking University Alumni Association on October 15 that he has proven the longstanding Landau-Siegel zeros theory.", "url": "https://pandaily.com/mathematician-yitang-zhang-claims-to-have-proven-riemann-hypothesis-problem/", "urlToImage": "https://assets.pandaily.com/uploads/2022/10/rw.jpeg", "publishedAt": "2022-10-17T06:10:46Z", "content": "Yitang Zhang, a Chinese-American mathematician, reportedly disclosed in an online salon organized by the Peking University Alumni Association on October 15 that he has proven the longstanding Landau-… [+3000 chars]"}]}