{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "CNBC"}, "author": "Amanda Macias, Ruxandra Iordache", "title": "Israel-Hamas war live updates: Britain orders deployment of military assets to Mediterranean; at least 27 Americans killed - CNBC", "description": "The death toll continues to mount in Israel and the Gaza Strip, as sirens blare and war wages.", "url": "https://www.cnbc.com/2023/10/12/israel-hamas-war-live-updates-latest-news-on-gaza.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/107316421-1697143152430-gettyimages-1720667139-AFP_33Y72TR.jpeg?v=1697143310&w=1920&h=1080", "publishedAt": "2023-10-12T20:20:00Z", "content": "At least 25 U.S. citizens were killed in the weekend terrorist offensives of Palestinian militant group Hamas against Israel, U.S. Secretary of State Antony Blinken said Thursday from Tel Aviv.\r\n\"Tra… [+1524 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Justin Gomez, Shannon K. Crawford, Ivan Pereira", "title": "State Department announces plan to fly Americans out of Israel - ABC News", "description": "Chartered flights to Europe will offered starting Friday, the White House said.", "url": "https://abcnews.go.com/US/state-department-announces-plan-fly-americans-israel/story?id=103934725", "urlToImage": "https://i.abcnewsfe.com/a/180a60ff-11d4-4c0e-b6c7-becf91a5a41b/flight-gty-er-231012_1697135557130_hpMain_16x9.jpg?w=992", "publishedAt": "2023-10-12T19:26:16Z", "content": "The U.S. State Department will be arranging chartered flights for American citizens who are currently in Israel, the White House announced Thursday.\r\nThe details on the flights are still being worked… [+3098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard", "title": "Despite rocky rollout, more than 7 million Americans have received updated Covid-19 vaccines, HHS says - CNN", "description": "This year’s uptake of the updated Covid-19 vaccine appears to be somewhat slower than last year’s, according to data from the US Department of Health and Human Services and the US Centers for Disease Control and Prevention.", "url": "https://www.cnn.com/2023/10/12/health/hhs-covid-vaccine/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231012111257-covid-vaccine-1006.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-10-12T18:58:00Z", "content": "This years uptake of the updated Covid-19 vaccine appears to be somewhat slower than last years, according to data from the US Department of Health and Human Services and the US Centers for Disease C… [+3647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, MJ Lee, Alex Marquardt", "title": "US and Qatar reach ‘quiet understanding’ not to release $6 billion sent to Iran for now, Treasury official tells House Democrats - CNN", "description": "The United States and Qatar have reached a “quiet understanding” not to allow Iran to access any of the $6 billion in Iranian funds that were transferred to Qatari accounts last month as part of a deal to free Americans detained in Iran for the time being, fo…", "url": "https://www.cnn.com/2023/10/12/politics/us-qatar-iran-funds/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230217202341-01-wally-adeyemo-file-011823.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-10-12T17:41:00Z", "content": "The United States and Qatar have reached a quiet understanding not to allow Iran to access any of the $6 billion in Iranian funds that were transferred to Qatari accounts last month as part of a deal… [+3400 chars]"}, {"source": {"id": null, "name": "State.gov"}, "author": null, "title": "Secretary Antony J. Blinken and Israeli Prime Minister Benjamin Netanyahu After Their Meeting - United States Department of State - Department of State", "description": "PRIME MINISTER NETANYAHU:  Mr. Secretary, my good friend Tony, thank you for your important visit here today.  Thank you, thank President Biden, and thank you to the American people for your incredible support for Israel in our war against the barbarians of H…", "url": "https://www.state.gov/secretary-antony-j-blinken-and-israeli-prime-minister-benjamin-netanyahu-after-their-meeting-2/", "urlToImage": "https://www.state.gov/wp-content/uploads/2021/02/S_light_edited.png", "publishedAt": "2023-10-12T16:20:11Z", "content": "PRIME MINISTER NETANYAHU:  Mr. Secretary, my good friend Tony, thank you for your important visit here today.  Thank you, thank President Biden, and thank you to the American people for your incredib… [+9331 chars]"}]}