{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "New York Post"}, "author": "Betsy McCaughey", "title": "Biden's infrastructure bill is chock-full of anti-white racism - New York Post ", "description": "Americans are enthusiastic about spending money on physical infrastructure — bridges, roads, broadband. But this racist bill hands out jobs and contracts and locates projects based on race, not mer…", "url": "https://nypost.com/2021/08/11/bidens-infrastructure-bill-is-chock-full-of-anti-white-racism/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/08/joe-biden-6.jpg?quality=90&strip=all&w=1200", "publishedAt": "2021-08-11T23:08:00Z", "content": "The infrastructure bill the Senate passed Tuesday discriminates against white people at every turn.\r\nAmericans are enthusiastic about spending money on physical infrastructure bridges, roads, broadba… [+4337 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New study analyzes role of scent compounds in the coevolution of bats and pepper plants - Science Daily", "description": "A study reports on how bats and pepper plants in Central America have co-evolved to help each other survive.", "url": "https://www.sciencedaily.com/releases/2021/08/210811162901.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2021-08-11T21:53:20Z", "content": "A study published Aug. 11 in the Proceedings of the Royal Society B by researchers at the University of Washington and Stony Brook University reports on how bats and pepper plants in Central America … [+5354 chars]"}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Press Association", "title": "Kathy Hochul profile: The 'scrappy' Irish-American who will be New York's first female governor - TheJournal.ie", "description": "Kathy Hochul is taking the reins after Governor Andrew Cuomo’s shock resignation this week.", "url": "https://www.thejournal.ie/kathy-hochul-spotlight-replace-cuomo-as-new-york-governor-5520689-Aug2021/", "urlToImage": "https://img2.thejournal.ie/article/5520689/river/?height=400&version=5520690", "publishedAt": "2021-08-11T21:00:00Z", "content": "KATHY HOCHUL, A New York Democrat unfamiliar to many people in the state even after six years as its lieutenant governor, is to begin reintroducing herself to the public as she prepared to take the r… [+4689 chars]"}, {"source": {"id": null, "name": "autoevolution"}, "author": "Daniel Patrascu", "title": "Russia Claims to Know All About American Spacecraft, Offers Help with Starliner - autoevolution", "description": "Ever since America dumped its use of the Soyuz rocket and found another, Crew Dragon way to reach the International Space Station (ISS), there seems to be a lot of angry looks being shots across the planet all the way from Russia. From time to time, aided by …", "url": "https://www.autoevolution.com/news/russia-claims-to-know-all-about-american-spacecraft-offers-help-with-starliner-167065.html", "urlToImage": "https://s1.cdn.autoevolution.com/images/news/russia-claims-to-know-all-about-american-spacecraft-offers-help-with-starliner-167065_1.jpg", "publishedAt": "2021-08-11T08:26:00Z", "content": "But first, some context. Back in 2019, after the SpaceX Crew Dragon successfully reached space, Boeing tested its own capsule, the Starliner. Because of a software glitch, it failed to reach its inte… [+1348 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Holly Chik, South China Morning Post", "title": "China OKs mixed-use COVID-19 vaccine trials - ABS-CBN News", "description": "China’s medical products regulator has approved local trials for the combined use of the Chinese Sinovac COVID-19 vaccine and a DNA vaccine developed by American biotech company Inovio. The trials are set to begin in the autumn in China and will evaluate the …", "url": "https://news.abs-cbn.com/overseas/08/11/21/china-oks-mixed-use-covid-19-vaccine-trials", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/reuters/01/13/health-coronavirus-vaccine-sinovac.jpg", "publishedAt": "2021-08-11T05:32:00Z", "content": "China’s medical products regulator has approved local trials for the combined use of the Chinese Sinovac Covid-19 vaccine and a DNA vaccine developed by American biotech company Inovio.\r\nThe trials a… [+4530 chars]"}]}