{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Space.com"}, "author": "Hanneke Weitering", "title": "No long weekend this Fourth of July holiday for American astronauts on space station - Space.com", "description": "It's a weekend of spaceship departure preparations for NASA astronauts.", "url": "https://www.space.com/fourth-of-july-in-space-2021-american-astronauts", "urlToImage": "https://cdn.mos.cms.futurecdn.net/nNHAvayAd7R3LGDvvEFqiH-1200-80.jpg", "publishedAt": "2021-07-04T12:23:34Z", "content": "While many Americans will celebrate the Fourth of July with a day off from work, astronauts at the International Space Station are spending their holiday preparing for a cargo ship's return to Earth.… [+2218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Aakash Arya", "title": "Watch: Lionel Messi Dazzles With Splendid Free-Kick Goal In Copa America Quarter-Final Win Against E.. - NDTVSports.com", "description": "Copa America: Argentina football team captain Lionel Messi scored a remarkable free-kick in his side's overwhelming 3-0 win against Ecuador in the quarter-final.", "url": "https://sports.ndtv.com/football/copa-america-lionel-messi-dazzles-with-splendid-free-kick-goal-in-quarter-final-win-against-ecuador-watch-2478951", "urlToImage": "https://c.ndtvimg.com/2021-07/tf6svdo8_lionel-messi-argentina_625x300_04_July_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2021-07-04T09:21:00Z", "content": "Fans all across the world skipped a heartbeat yet again as Lionel Messi scored a breathtaking free-kick to ensure a semi-final qualification for Argentina in the ongoing Copa America. Messi put the b… [+1306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Fewer than half of US states have reached the White House's July 4th vaccine goal as the Delta variant threatens the nation's progress - CNN ", "description": "Twenty states have reached the Biden administration's goal to partially vaccinate 70% of American adults by the Fourth of July as the Delta variant spreads and people gather for holiday celebrations across the country.", "url": "https://www.cnn.com/2021/07/04/health/us-coronavirus-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210703223026-johnson-vaccine-file-super-tease.jpg", "publishedAt": "2021-07-04T08:33:00Z", "content": "(CNN)Twenty states have reached the Biden administration's goal to partially vaccinate 70% of American adults by the Fourth of July as the Delta variant spreads and people gather for holiday celebrat… [+5991 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Martin Pengelly", "title": "Delta variant will cause Covid surges in less-vaccinated US regions, Fauci says - The Guardian", "description": "Biden medical adviser tells NBC vaccination disparities will lead to ‘two types of America’", "url": "https://amp.theguardian.com/world/2021/jul/03/fauci-delta-variant-cases-vaccines", "urlToImage": null, "publishedAt": "2021-07-04T05:01:00Z", "content": "CoronavirusBiden medical adviser tells NBC vaccination disparities will lead to two types of America\r\nThe US will see surges in cases of the Delta variant of Covid-19 in areas where vaccination rates… [+3923 chars]"}, {"source": {"id": null, "name": "Manilastandard.net"}, "author": null, "title": "World's safest place? Vermont leads US vaccine race - manilastandard.net", "description": "Vermontknown for Bernie Sanders, maple syrup, and the birthplace of Ben and Jerrys ice creamhas a new claim to fame: Americas most-vaccinated state against COVID-19.", "url": "https://manilastandard.net/mobile/article/358780", "urlToImage": "https://manilastandard.net/panel/_files/modbuild/ts_logo.png", "publishedAt": "2021-07-04T02:00:00Z", "content": "posted July 04, 2021 at 10:00 am\r\n by AFP and Peter Hutchison\r\nVermont—known for Bernie Sanders, maple syrup, and the birthplace of Ben and Jerry's ice cream—has a new claim to fame: America's most-v… [+4828 chars]"}, {"source": {"id": "newsweek", "name": "Newsweek"}, "author": "Christina Zhao", "title": "Donald Trump Compares New York Tax Fraud Charges to a 'Communist Dictatorship' - Newsweek", "description": "\"It's unprecedented, unheard of, and totally unacceptable in America for prosecutors to run for office on a promise to get their political enemies,\" the former president said at a rally in Sarasota,...", "url": "https://www.newsweek.com/donald-trump-compares-new-york-tax-fraud-charges-communist-dictatorship-1606706", "urlToImage": "https://d.newsweek.com/en/full/1837397/trump-speaks-sarasota-rally-florida.jpg", "publishedAt": "2021-07-04T01:40:51Z", "content": "Former President Donald Trump railed against New York prosecutors on Saturday for charging the Trump Organization and its chief financial executive in what he called a politically motivated effort \"r… [+2991 chars]"}]}