{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Russian fighter jet hits American drone over Black Sea: US - The Indian Express", "description": "The incident comes amid soaring Russian-US tensions over Moscow’s war in Ukraine.", "url": "https://indianexpress.com/article/world/russian-fighter-jet-hits-american-drone-over-black-sea-us-8497317/", "urlToImage": "https://images.indianexpress.com/2023/03/drone.jpg", "publishedAt": "2023-03-15T05:43:15Z", "content": "A Russian fighter jet struck the propeller of a US surveillance drone over the Black Sea on Tuesday in a brazen violation of international law, causing American forces to bring down the unmanned aeri… [+8253 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Honduras to seek China relations, pressuring Taiwan ahead of US trip - Reuters Canada", "description": "Honduran President Xiomara Castro said on Tuesday she had asked the country's foreign minister to open official relations with China, pressuring Taiwan ahead of a sensitive visit by President Tsai Ing-wen to the United States and Central America.", "url": "https://www.reuters.com/world/americas/honduras-president-says-govt-seek-official-relations-with-china-2023-03-14/", "urlToImage": "https://www.reuters.com/resizer/227SlO3dP6rQ18sRj-OorTYmIlc=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/QPS55ZIOAVNT3M742WX45A7YWY.jpg", "publishedAt": "2023-03-15T05:19:00Z", "content": "TEGUCIGALPA/TAIPEI, March 14 (Reuters) - Honduran President Xiomara Castro said on Tuesday she had asked the country's foreign minister to open official relations with China, pressuring Taiwan ahead … [+3804 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Lolita C. Baldor", "title": "Why US troops remain in Iraq 20 years after 'shock and awe' - The Associated Press - en Español", "description": "WASHINGTON (AP) — Twenty years after the U.S. invaded Iraq — in blinding explosions of shock and awe — American forces remain in the country in what has become a small but consistent presence to ensure an ongoing relationship with a key military and diplomati…", "url": "https://apnews.com/article/iraq-war-anniversary-troops-military-d1d9a7e6e83925dec22fce4d2e2c831e", "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d0b926873d4493cafe2e81a0132d851/3000.webp", "publishedAt": "2023-03-15T04:09:03Z", "content": "WASHINGTON (AP) Twenty years after the U.S. invaded Iraq in blinding explosions of shock and awe American forces remain in the country in what has become a small but consistent presence to ensure an … [+6217 chars]"}]}