{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Kemifilani.ng"}, "author": "Gift Adene", "title": "\"Beyoncé could have breast cancer\" Nigerians cry out as Mathew Knowles is diagnosed of \"BRCA2 mutated breast cancer\" - Kemi Filani News", "description": "Beyonce's father, Mathew Knowles has undergone a breast cancer surgery. Mathew Knowles is an American record executive, entrepreneur, and university", "url": "https://www.kemifilani.ng/entertainment/beyonce-could-have-breast-cancer-nigerians-cry-out-as-mathew-knowles-is-diagnosed-of-brca2-mutated-breast-cancer", "urlToImage": "https://www.kemifilani.ng/wp-content/uploads/2022/10/beyonce-nigerians-cry-1300x843.png", "publishedAt": "2022-10-18T19:10:32Z", "content": "Beyonce’s father, Mathew Knowles has undergone a breast cancer surgery.\r\nMathew Knowles is an American record executive, entrepreneur, and university instructor. His role as Destiny’s Child’s manager… [+3257 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's New Science Research To Space Station Could Make Human Life Easier - NDTV", "description": "American space agency NASA is planning to launch the next resupply services mission to the International Space Station (ISS) next month.", "url": "https://www.ndtv.com/world-news/nasas-new-science-research-to-space-station-could-make-human-life-easier-3443771", "urlToImage": "https://c.ndtvimg.com/2022-07/ng9r0t5o_international-space-station-reuters_625x300_28_July_22.jpg", "publishedAt": "2022-10-18T18:44:59Z", "content": "Cygnus spacecraft is scheduled for liftoff on November 6. (File)\r\nAmerican space agency NASA is planning to launch the next resupply services mission to the International Space Station (ISS) next mon… [+3279 chars]"}, {"source": {"id": null, "name": "Barbados Today"}, "author": "Barbados Today", "title": "Statement: Circulation of “Public Warning Alert” on COVID-19 vaccines fraudulently using PAHO’s name and logo - Barbados Today", "description": "Washington, D.C. (PAHO) – A social media video from an unidentified source unlawfully using the logo and name of the Pan American Health Organization (PAHO) is circulating in English-speaking Caribbean countries as a “Public Warning Alert” on COVID-19 vaccina…", "url": "https://barbadostoday.bb/2022/10/17/statement-circulation-of-public-warning-alert-on-covid-19-vaccines-fraudulently-using-pahos-name-and-logo/", "urlToImage": "https://barbadostoday.bb/wp-content/uploads/2022/10/Screen-Shot-2022-10-17-at-12.55.46-PM.png", "publishedAt": "2022-10-17T17:06:19Z", "content": "Washington, D.C. (PAHO) A social media video from an unidentified source unlawfully using the logo and name of the Pan American Health Organization (PAHO) is circulating in English-speaking Caribbean… [+2289 chars]"}]}