{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Statement from President Joe Biden on Supreme Court Decision on Student Loan Debt Relief - The White House", "description": "This fight is not over. I will have more to announce when I address the nation this afternoon. My Administration’s student debt relief plan would have been the lifeline tens of millions of hardworking Americans needed as they try to recover from a once-in-a-c…", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/06/30/statement-from-president-joe-biden-on-supreme-court-decision-on-student-loan-debt-relief/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2023-06-30T20:43:59Z", "content": "This fight is not over. I will have more to announce when I address the nation this afternoon.\r\nMy Administrations student debt relief plan would have been the lifeline tens of millions of hardworkin… [+1592 chars]"}, {"source": {"id": null, "name": "Whitehouse.gov"}, "author": "The White House", "title": "Statement from President Joe Biden on Supreme Court Decision in 303 Creative LLC v. Elenis - The White House", "description": "In America, no person should face discrimination simply because of who they are or who they love. The Supreme Court’s disappointing decision in 303 Creative LLC v. Elenis undermines that basic truth, and painfully it comes during Pride month when millions of …", "url": "https://www.whitehouse.gov/briefing-room/statements-releases/2023/06/30/statement-from-president-joe-biden-on-supreme-court-decision-in-303-creative-llc-v-elenis/", "urlToImage": "https://www.whitehouse.gov/wp-content/uploads/2021/01/wh_social-share.png", "publishedAt": "2023-06-30T16:09:07Z", "content": "In America, no person should face discrimination simply because of who they are or who they love. The Supreme Courts disappointing decision in 303 Creative LLC v. Elenis undermines that basic truth, … [+1432 chars]"}]}