{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "CNN Philippines"}, "author": null, "title": "UnionBank confirms talks with Citi on PH consumer banking business acquisition - CNN Philippines", "description": "The American banking giant announced earlier in April its consumer banking exit in the Philippines and 12 other markets as it hopes to channel investments and resources to business with the largest scale and growth potential.", "url": "http://www.cnnphilippines.com/business/2021/12/2/UnionBank-Citi-talks-PH-consumer-banking-acquisition.html", "urlToImage": "http://cnnphilippines.com/.imaging/mte/demo-cnn-new/750x450/dam/cnn/2021/12/2/UnionBank-facade_CNNPH.jpg/jcr:content/UnionBank-facade_CNNPH.jpg", "publishedAt": "2021-12-02T05:09:07Z", "content": "Metro Manila (CNN Philippines, December 2) UnionBank of the Philippines has confirmed it is in discussions with Citigroup Inc. (Citi) on potentially acquiring its consumer banking business in the Phi… [+1177 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "AP", "title": "America records its first case of the Omicron COVID-19 variant - Economic Times", "description": "The Centers for Disease Control and Prevention was moving to tighten U.S. testing rules for travellers from overseas, including requiring a test for all travellers within a day of boarding a flight to the U.S. regardless of vaccination status. It was also con…", "url": "https://economictimes.indiatimes.com/news/international/world-news/america-records-its-first-case-of-the-omicron-covid-19-variant/articleshow/88041238.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88041255,width-1070,height-580,imgsize-46766,overlay-economictimes/photo.jpg", "publishedAt": "2021-12-02T02:27:00Z", "content": "A person in California who had been vaccinated against COVID-19 became the first in the U.S. to have an identified case of the omicron variant, the White House announced Wednesday as scientists conti… [+2888 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Longer interval between COVID-19 mRNA vaccine doses leads to stronger immune response - News-Medical.net", "description": "The first peer-reviewed study in North America examining the timing between the first and second doses of COVID-19 mRNA vaccines shows that a longer dose interval leads to a stronger immune response. The study is funded by the Government of Canada through its…", "url": "https://www.news-medical.net/news/20211201/Longer-interval-between-COVID-19-mRNA-vaccine-doses-leads-to-stronger-immune-response.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/1/A_doctor_makes_a_vaccination_to_a_child-Yuganov_Konstantin_cdbf1b05417f45e89b8268af4858e1c9-620x480.jpg", "publishedAt": "2021-12-02T01:33:00Z", "content": "The first peer-reviewed study in North America examining the timing between the first and second doses of COVID-19 mRNA vaccines shows that a longer dose interval leads to a stronger immune response.… [+3617 chars]"}]}