{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Daily Mail"}, "author": "Ollie Lewis", "title": "Colby Covington vs Jorge Masvidal - UFC 272 LIVE: Start time, live stream, undercard results - Daily Mail", "description": "These friends-turned-foes have endured one of the most volatile relationships in UFC history, a reality that was unforeseen when the pair lived and trained together while American Top Team team-mates.", "url": "https://www.dailymail.co.uk/sport/mma/article-10548003/Colby-Covington-vs-Jorge-Masvidal-UFC-272-2022-Live-Result.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/03/06/03/55000091-0-image-a-16_1646536044322.jpg", "publishedAt": "2022-03-06T00:01:00Z", "content": "The third of our five main card bouts gets under way in Las Vegas. \r\nBarboza, in his yellow shorts, lands a brutal leg kick on Mitchell, who is wearing camouflage shorts. The Brazilian is already red… [+706 chars]"}, {"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Chris Gardner", "title": "Kristen Stewart Reminisces on Pre-‘Twilight’ Fame, Paparazzi Photo of Her “Smoking a Bowl” - Hollywood Reporter", "description": "The Santa Barbara International Film Festival delivered a Snow White and the Huntsman reunion on Friday night when Charlize Theron turned up to present onetime co-star Kristen Stewart with an American Riviera Award for her Oscar-nominated performance as Princ…", "url": "https://www.hollywoodreporter.com/movies/movie-news/kristen-stewart-twilight-paparazzi-photos-santa-barbara-international-film-festival-1235105136/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2022/03/1379849696.jpg?w=1024", "publishedAt": "2022-03-05T20:53:33Z", "content": "The Santa Barbara International Film Festival delivered a Snow White and the Huntsman reunion on Friday night when Charlize Theron turned up to present onetime co-star Kristen Stewart with an America… [+2918 chars]"}, {"source": {"id": null, "name": "Castanet.net"}, "author": null, "title": "Ukraine war sparks fresh calls for urgency on upgrading North America's defences - Canada News - Castanet.net", "description": "Russian President Vladimir Putin’s decision to put his country’s nuclear arsenal on high alert last weekend has sparked hope that Ottawa and Washington will finally act with urgency in upgrading North America’s defences.", "url": "https://www.castanet.net/news/Canada/361944/Ukraine-war-sparks-fresh-calls-for-urgency-on-upgrading-North-America-s-defences", "urlToImage": "https://www.castanet.net/content/2022/3/20211130171140-fd6bdc70d1efbb92fc70fe5cf49cede514b24c47410b5048e2a59078aa5f0d3c_p3564697_p3580472.jpg", "publishedAt": "2022-03-05T15:19:00Z", "content": "Russian President Vladimir Putin’s decision to put his country’s nuclear arsenal on high alert last weekend has sparked hope that Ottawa and Washington will finally act with urgency in upgrading Nort… [+6016 chars]"}, {"source": {"id": null, "name": "Revyuh.com"}, "author": null, "title": "What Best Protected People During COVID From Chronic Depression – Scientists - Revyuh", "description": "The COVID-19 outbreak has had a significant influence on the mental health of Americans, contributing to an increase in chronic and high depression. The", "url": "https://www.revyuh.com/news/lifestyle/health-and-fitness/what-best-protected-people-during-covid-from-chronic-depression-scientists/", "urlToImage": "https://653015-2129923-2-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/03/What-Best-Protected-People-During-COVID-From-Chronic-Depression-Scientists.jpg", "publishedAt": "2022-03-04T18:48:50Z", "content": "The COVID-19 outbreak has had a significant influence on the mental health of Americans, contributing to an increase in chronic and high depression.\r\nThe first year of the outbreak was less likely to… [+3554 chars]"}, {"source": {"id": null, "name": "TechSpot"}, "author": "TechSpot Deals", "title": "Get Microsoft Office on Windows or Mac for 85% off - TechSpot", "description": "There are plenty of reasons to be fed up with corporate America, from excessive job demands to companies paying people to extoll their virtues online. Fortunately, people...", "url": "https://www.techspot.com/news/93627-get-microsoft-office-windows-or-mac-85-off.html", "urlToImage": "https://static.techspot.com/images2/news/bigimage/2022/03/2022-03-04-image-9.jpg", "publishedAt": "2022-03-04T14:39:19Z", "content": "TL;DR: Microsoft Office needs no introduction. The industry stalwart gives you everything you need to operate your side hustle or business from home. This deal includes lifetime licenses for Word, Ex… [+1856 chars]"}, {"source": {"id": null, "name": "The Sportsrush"}, "author": "Yuvansh Ruia", "title": "NA VCT: Week 5 is reportedly set to be played with the latest Valorant Patch 4.04 - The Sportsrush", "description": "The fifth week of the 2022 North American VALORANT Champions Tour will be played on Patch 4.04. According to a report by Upcomer and a tweet from NRG coach Josh “JoshRT” Lee. With Week 4 in full action, Week 5 is going to be even more exciting and hype.", "url": "https://thesportsrush.com/valorant-news-na-vct-week-5-is-reportedly-set-to-be-played-with-the-latest-patch-4-04/", "urlToImage": "https://cdn-wp.thesportsrush.com/2022/03/f170be77-na-vct-stage-1.jpg", "publishedAt": "2022-03-04T14:25:46Z", "content": "The fifth week of the 2022 North American VALORANT Champions Tour will be played on Patch 4.04. According to a report by Upcomer and a tweet from NRG coach Josh JoshRT Lee.\r\nWith Week 4 in full actio… [+2310 chars]"}]}