{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Ajmc.com"}, "author": "Hayden E. Klein", "title": "Dr Robert Gabbay on COVID-19 Vaccinations in the Diabetes Community - AJMC.com Managed Markets Network", "description": "Robert A. Gabbay, MD, PhD, chief scientific and medical officer at the American Diabetes Association, discusses COVID-19 vaccinations among people with diabetes as they have been disproportionally affected by the pandemic.", "url": "https://www.ajmc.com/view/dr-robert-gabbay-on-covid-19-vaccinations-in-the-diabetes-community", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c139208ca7a16650ae788c2e8ece0beb0944dec3-2874x1616.png?fit=crop&auto=format", "publishedAt": "2021-11-10T17:10:35Z", "content": "Efforts to address COVID-19 in the diabetes community are based, in part, on early recognition that these individuals would be disproportionately impacted, said Robert A. Gabbay, MD, PhD, chief scien… [+1257 chars]"}, {"source": {"id": null, "name": "American Council on Science and Health"}, "author": null, "title": "What COVID-19 Should Teach Us About Future Pandemics - American Council on Science and Health", "description": "What went wrong during the COVID-19 pandemic? A team of public health researchers recently outlined some of the crucial policy mistakes we made and explained how we might avoid them in the future.", "url": "https://www.acsh.org/news/2021/11/10/what-covid-19-should-teach-us-about-future-pandemics-15930", "urlToImage": "https://www.acsh.org/sites/default/files/images/ffffff.PNG", "publishedAt": "2021-11-10T15:30:07Z", "content": "After recognizing SARS-COV-2 as a global threat last spring, the pandemic response quickly devolved into an ideological war. Most people lined up on either side of an oversimplified debate and filter… [+7476 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Alek Korab", "title": "If You Live Here, Beware the COVID Cases — Eat This Not That - Eat This, Not That", "description": "The coronavirus is still stalking America. \"Nationally…the South has really cooled off,\" says virus expert...", "url": "http://www.eatthis.com/news-beware-covid-cases-states/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2020/07/woman-patient-hospital-bed-surgery.jpg?quality=82&strip=all", "publishedAt": "2021-11-09T13:15:50Z", "content": "The coronavirus is still stalking America. \"Nationallythe South has really cooled off,\" says virus expert Ashish Jha, Dean of the Brown University School of Public Health. \"And it's the Midwest and G… [+5028 chars]"}]}