{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "News18"}, "author": "News18", "title": "As Delta Variant Spreads Fast to Become Dominant Strain, Older Americans Show Us How Vaccines Work - News18", "description": "Covid-19 cases jumped 10% in the United States over the last week and the Delta variant could become the dominant strain.", "url": "https://www.news18.com/news/world/as-delta-variant-spreads-fast-to-become-dominant-strain-older-americans-show-us-how-vaccines-work-3929714.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/05/1621826748_vaccine.jpg", "publishedAt": "2021-07-06T03:09:00Z", "content": "Covid-19 cases jumped 10% in the United States over the last week and the Delta variant could become the dominant strain. The variant is more transmissible than most other strains, but we also know t… [+3051 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khanyiso Tshwaku", "title": "Cricket SA's social justice hearings begin as ombud Dumisa Ntsebeza takes the conciliatory path - News24", "description": "In quoting American novelist James Baldwin, Cricket South Africa's Cricket for Social Justice and Nation-building initiative hearings Advocate Dumisa Ntsebeza set the conciliatory tone of the hearings.", "url": "https://www.news24.com/sport/cricket/cricket-sas-social-justice-hearings-begin-as-ombud-dumisa-ntsebeza-takes-the-conciliatory-path-20210705", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8641/cfd888a255d1498db04cb4f5020e8f44.jpg", "publishedAt": "2021-07-05T11:27:22Z", "content": "<ul><li>Cricket South Africa's Cricket for Social Justice and Nation-building initiative ombudsman Advocate Dumisa Ntsebeza said the impact of the hearings is for them to be educational.</li><li>The … [+2418 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Antony Sguazzin", "title": "Anglo American knew of lead danger at Zambian mine, doctor says - News24", "description": "A doctor said Anglo American was aware of the danger lead poisoning posed to employees and commissioned a study into its impact in a community close to a Zambian mine where he worked.", "url": "https://www.news24.com/fin24/companies/mining/anglo-american-knew-of-lead-danger-at-zambian-mine-doctor-says-20210705", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7508/4f8031e4189044b7a7a48d9baa9ef708.jpg", "publishedAt": "2021-07-05T09:11:23Z", "content": "<ul><li>A doctor said Anglo American was aware of the danger lead poisoning posed to employees at a Zambian mine. </li><li>A hearing to consider Anglo's request for an extension so that it can file i… [+4328 chars]"}]}