{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Lower biological age linked to better heart health, study shows - Good Morning America", "description": "New data shows that people with a lower biological age had better cardiovascular health. ABC News chief medical correspondent Dr. Jen Ashton breaks it down.S...", "url": "https://www.youtube.com/watch?v=qzu6NObai_8", "urlToImage": "https://i.ytimg.com/vi/qzu6NObai_8/maxresdefault.jpg", "publishedAt": "2023-11-06T21:04:43Z", "content": null}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Sara Moniuszko", "title": "Following these 8 steps for heart health may slow biological aging by 6 years, research shows - CBS News", "description": "The analysis used the American Heart Association's \"Life's Essential 8\" checklist​, a list of lifestyle behaviors, to determine individuals' levels of heart health.", "url": "https://www.cbsnews.com/news/8-steps-heart-health-slow-biological-aging-by-6-years/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/11/06/0ec959f6-3c45-4408-a770-52d737e16023/thumbnail/1200x630/17ca085dab132d55e261a78cd1ad0ca5/gettyimages-488335523.jpg?v=c81a9d6c51e6280f2f4f876031d7d9bc", "publishedAt": "2023-11-06T17:53:02Z", "content": "Want to live longer? New research shows a link between strong heart health and slower biological aging — and there are certain steps that can help you get there. \r\nThe analysis, using data from 6,500… [+2957 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Fossils tell tale of last primate to inhabit North America before humans - Phys.org", "description": "The story of Ekgmowechashala, the final primate to inhabit North America before Homo sapiens or Clovis people, reads like a spaghetti Western: A grizzled and mysterious loner, against the odds, ekes out an existence on the American Plains.", "url": "https://phys.org/news/2023-11-fossils-tale-primate-inhabit-north.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/fossils-tell-tale-of-l.jpg", "publishedAt": "2023-11-06T14:37:47Z", "content": "The story of Ekgmowechashala, the final primate to inhabit North America before Homo sapiens or Clovis people, reads like a spaghetti Western: A grizzled and mysterious loner, against the odds, ekes … [+7896 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Deidre McPhillips", "title": "Emergency room visits for firearm injuries among children doubled during the pandemic - CNN", "description": "America’s gun epidemic has become deadlier than ever for children since the start of the Covid-19 pandemic, and firearm-related injuries are driving children to emergency rooms at significantly higher rates than before.", "url": "https://www.cnn.com/2023/11/06/health/firearm-injuries-children-emergency-room-pandemic/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/231103205525-02-handgun-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-11-06T05:02:00Z", "content": "Americas gun epidemic has become deadlier than ever for children since the start of the Covid-19 pandemic, and firearm-related injuries are driving children to emergency rooms at significantly higher… [+3535 chars]"}]}