{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Eonline.com"}, "author": "Elyse Dupre", "title": "Ryan Seacrest and Girlfriend Aubrey Paige Make Red Carpet Debut at Jennifer Lopez Film Premiere - E! NEWS", "description": "Ryan Seacrest and Aubrey Paige have kept much of their romance private. But on June 8, the American Idol host and the model made a rare red carpet appearance for Jennifer Lopez's new movie.", "url": "https://www.eonline.com/news/1333969/ryan-seacrest-and-girlfriend-aubrey-paige-make-red-carpet-debut-at-jennifer-lopez-film-premiere", "urlToImage": "https://akns-images.eonline.com/eol_images/Entire_Site/202259/rs_1200x1200-220609041453-1200-ryan-seacrest-aubrey-paige.jpg?fit=around%7C1080:566&output-quality=90&crop=1080:566;center,top", "publishedAt": "2022-06-09T12:51:00Z", "content": "Dim the lights, here we go.\r\nRyan Seacrest and Aubrey Paige just reached a milestone in their relationship.\r\nThe American Idol host and the model made their red carpet debut as a couple when they att… [+899 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "Trudeau to meet with Biden, Google chief on Day 2 of Summit of the Americas - CTV News", "description": "It's an itinerary worthy of Hollywood: the governor of California, the man who runs Google and the president of the United States. Day 2 at the Summit of the Americas is shaping up to be a busy one for Prime Minister Justin Trudeau.", "url": "https://www.ctvnews.ca/canada/trudeau-to-meet-with-biden-google-chief-on-day-2-of-summit-of-the-americas-1.5939445", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/6/9/trudeau--biden-1-5939446-1654764468374.jpg", "publishedAt": "2022-06-09T08:49:18Z", "content": "LOS ANGELES - \r\nIt's an itinerary worthy of Hollywood: the governor of California, the man who runs Google and the president of the United States.\r\nDay 2 at the Summit of the Americas is shaping up t… [+5165 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Never About Money\": Johnny Depp's Lawyer Says Actor Satisfied With \"Total Win\" In Defamation Case - NDTV", "description": "Actor Johnny Depp may not chase his ex-wife Amber Heard for the $10.35 million payout because he is satisfied with his \"total win,\" his attorney Ben Chew told Good Morning America.", "url": "https://www.ndtv.com/world-news/never-about-money-johnny-depps-lawyer-says-actor-satisfied-with-total-win-in-defamation-case-3051421", "urlToImage": "https://c.ndtvimg.com/2022-06/bg210qao_johnny-depp_625x300_02_June_22.jpg", "publishedAt": "2022-06-09T05:48:50Z", "content": "Depp was \"over the moon\" when the verdict was read out in his favour. (File)\r\nActor Johnny Depp is satisfied with his \"total win\" in the defamation suit against his ex-wife Amber Heard, his attorney … [+2531 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Michael D. Shear", "title": "At Summit of Americas, Biden Pledges U.S. Help on Latin American Problems - The New York Times", "description": "Opening the three-day summit, the president delivered a version of his domestic economic pitch, urging governments to invest in workers and the middle class.", "url": "https://www.nytimes.com/2022/06/08/us/politics/biden-summit-americas.html", "urlToImage": "https://static01.nyt.com/images/2022/06/08/us/08dc-biden/08dc-biden-facebookJumbo-v2.jpg", "publishedAt": "2022-06-09T02:21:33Z", "content": "When we invest in strengthening workers and the middle class, he said, the poor have a ladder up, and those at the top do just fine. Thats how we can increase opportunity and decrease persistent ineq… [+912 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Angelique Jackson", "title": "‘Ms. Marvel’ Makes History for Muslim Representation by Showing ‘the Day-to-Day Life of an American Girl’ - Variety", "description": "Popular on Variety When Iman Vellani booked the role of Kamala Khan — the Pakistani American teen superhero also known as Ms. Marvel — it was the first acting gig for the 19-year-old newcomer. But in assuming the mantle, Vellani also took on the responsibilit…", "url": "https://variety.com/2022/tv/news/ms-marvel-muslim-south-asian-representation-iman-vellani-1235288589/", "urlToImage": "https://variety.com/wp-content/uploads/2022/06/Ms-Marvel-3.jpg?w=1000", "publishedAt": "2022-06-08T21:08:00Z", "content": "When Iman Vellani booked the role of Kamala Khan — the Pakistani American teen superhero also known as Ms. Marvel — it was the first acting gig for the 19-year-old newcomer. But in assuming the mantl… [+5802 chars]"}]}