{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Fikayo Olowolagba", "title": "‘Sammie Okposo impregnated me, asked me to abort the child’ – Lady reveals - Daily Post Nigeria", "description": "An American lady, based in Texas, identified as African Doll, has accused Nigerian gospel music minister, Sammie Okposo, of impregnating and abandoning her. The lady in question made the accusation in a discussion with a YouTuber, Obodo Naija TV. She disclose…", "url": "https://dailypost.ng/2022/01/25/sammie-okposo-impregnated-me-asked-me-to-abort-the-child-lady-reveals/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/01/Sammie-Okposo-2.jpeg", "publishedAt": "2022-01-25T09:29:26Z", "content": "An American lady, based in Texas, identified as African Doll, has accused Nigerian gospel music minister, Sammie Okposo, of impregnating and abandoning her.\r\nThe lady in question made the accusation … [+1861 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sania Mirza bids adieu to Australia Open with quarterfinal loss in mixed doubles - The Indian Express", "description": "Sania Mirza, partnering American Rajeev Ram, lost the match 4-6, 6-7 to wildcard entries Fourlis and Kubler in one hour 30 minutes.", "url": "https://indianexpress.com/article/sports/tennis/sania-mirza-bids-adieu-to-australia-open-with-quarterfinal-loss-in-mixed-doubles-7740487/", "urlToImage": "https://images.indianexpress.com/2022/01/Sania-Ram.jpg", "publishedAt": "2022-01-25T06:46:18Z", "content": "Trailblazing India tennis star Sania Mirza’s swansong appearance at the Australian Open ended with a quarterfinal loss to local pair Jaimee Fourlis and Jason Kubler in the mixed doubled event on Tues… [+1243 chars]"}, {"source": {"id": null, "name": "Onmanorama.com"}, "author": "PTI", "title": "Australian Open: Sania Mirza, Rajeev Ram bow out | Tennis News | Onmanorama - Onmanorama", "description": "The unseeded Indo-American duo went down to the Australian pair of Jaimee Fourlis and Jason Kuble in the quarterfinals.", "url": "https://www.onmanorama.com/sports/tennis/2022/01/25/australian-open-sania-mirza-rajeev-ram-bow-out.html", "urlToImage": "https://img.onmanorama.com/content/dam/mm/en/sports/tennis/images/2022/1/25/sania-ram.jpg", "publishedAt": "2022-01-25T05:57:13Z", "content": "Melbourne: Trailblazing Indian tennis star Sania Mirza's swansong appearance at the Australian Open ended with a quarterfinal loss to local pair Jaimee Fourlis and Jason Kubler in the mixed doubles e… [+963 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Alcohol consumption among men drops during pandemic, but problem drinking rises - EurekAlert", "description": "A new study that has tracked Americans’ alcohol consumption during the COVID-19 pandemic finds that drinking has declined among men, while it remained steady among women. Researchers found that alcohol-related problems increased during the pandemic, by 49% fo…", "url": "https://www.eurekalert.org/news-releases/941061", "urlToImage": "https://www.eurekalert.org/images/EurekAlert-bluebg_Twitter_601X601.png", "publishedAt": "2022-01-24T20:21:46Z", "content": "Alcohol consumption during the coronavirus pandemic declined among men, while it remained steady among women, according to a new RAND Corporation study.\r\nResearchers found that alcohol-related proble… [+4044 chars]"}]}