{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Abbey White", "title": "‘American Gigolo’ Showrunner David Hollander Let Go by Showtime - Hollywood Reporter", "description": "David Hollander, set to helm Showtime’s reboot of American Gigolo, has been fired by the network, The Hollywood Reporter has confirmed. “David Hollander is no longer on the drama series American Gigolo and Paramount Television Studios no longer has a producin…", "url": "https://www.hollywoodreporter.com/tv/tv-news/american-gigolo-showrunner-david-hollander-fired-showtime-1235134415/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2022/04/GettyImages-1043396556.jpg?w=1024", "publishedAt": "2022-04-23T23:40:49Z", "content": "David Hollander, set to helm Showtime’s reboot of American Gigolo, has been fired by the network, The Hollywood Reporter has confirmed.\r\n“David Hollander is no longer on the drama series American Gig… [+2399 chars]"}, {"source": {"id": "the-hill", "name": "The Hill"}, "author": "Laura Kelly", "title": "Why the French election matters so much in US - The Hill", "description": "The U.S. holds a key stake in France’s presidential election on Sunday, when voters in one of America’s oldest allies will choose between incumbent President Emmanuel Macron and his far-right opponent Marine Le Pen.  The vote is viewed as a referendum on the …", "url": "https://thehill.com/news/administration/3460024-why-the-french-election-matters-so-much-in-us/", "urlToImage": "https://thehill.com/wp-content/uploads/sites/2/2022/04/macronemmanuel_lepenmarine_042222ap-francois-mori_us-france.jpg?w=1280", "publishedAt": "2022-04-23T21:00:00Z", "content": "The U.S. holds a key stake in Frances presidential election on Sunday, when voters in one of Americas oldest allies will choose between incumbent President Emmanuel Macron and his far-right opponent … [+6476 chars]"}, {"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Experiences of and attitudes towards HIV testing for Asian, Black and Latin American men who have sex with men (MSM) in the SELPHI (HIV Self‐Testing Public Health Intervention) randomized controlled trial in England and Wales: implications for HIV self-te - BMC Public Health", "description": "Background HIV self-testing (HIVST) could play an important role in improving access to testing and therefore reducing inequalities related to late diagnosis of HIV, while also improving access to HIV prevention interventions such as HIV pre-exposure prophyla…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-13189-7", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-04-22T13:45:15Z", "content": null}]}