{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Researchers ID sex pheromone of invasive giant hornet - Phys.org", "description": "The world's largest hornet has been the focus of extensive news coverage of late due to its menacing appearance and expanding footprint in North America.", "url": "https://phys.org/news/2022-03-id-sex-pheromone-invasive-giant.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/researchers-id-sex-phe.jpg", "publishedAt": "2022-03-14T16:20:28Z", "content": "The world's largest hornet has been the focus of extensive news coverage of late due to its menacing appearance and expanding footprint in North America.\r\nBut while the \"murder hornet\" label attached… [+5182 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Russia-Ukraine war: American journalist Brent Renaud killed - Daily Post Nigeria", "description": "The Russia-Ukraine war has claimed the life of an award-winning American journalist Brent Renaud. Renaud, 50, was shot dead Sunday near Kyiv, Regional Police Chief Andriy Nebytov confirmed. \"US citizen Brent Renaud paid with his life for trying to highlight t…", "url": "https://dailypost.ng/2022/03/14/russia-ukraine-war-american-journalist-brent-renaud-killed/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/Brent-Renaud-.jpeg", "publishedAt": "2022-03-14T11:57:33Z", "content": "The Russia-Ukraine war has claimed the life of an award-winning American journalist Brent Renaud.\r\nRenaud, 50, was shot dead Sunday near Kyiv, Regional Police Chief Andriy Nebytov confirmed.\r\n“US cit… [+1158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Mick Krever, Brian Stelter and Lauren Kent, CNN", "title": "Tributes paid to US journalist shot dead in Ukraine - CNN", "description": "Award-winning American journalist Brent Renaud was killed by Russian forces in the Ukrainian city of Irpin, police in Kyiv said. Another American journalist, Juan Arredondo, was wounded.", "url": "https://www.cnn.com/2022/03/13/media/russia-ukraine-brent-renaud-death-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220313163159-brent-renaud-file-super-tease.jpg", "publishedAt": "2022-03-14T10:03:00Z", "content": "Kyiv, Ukraine (CNN)Award-winning American journalist Brent Renaud was killed by Russian forces in the Ukrainian city of Irpin, police in Kyiv said in social media posts on Sunday. Another American jo… [+5877 chars]"}, {"source": {"id": "the-irish-times", "name": "The Irish Times"}, "author": "Donald Clarke", "title": "William Hurt, prominent American actor, has died at the age of 71 - The Irish Times", "description": "His career ranged from an Oscar win to the Marvel Cinematic Universe", "url": "https://www.irishtimes.com/culture/film/william-hurt-oscar-winning-american-actor-with-troubled-personal-life-dies-aged-71-1.4825865", "urlToImage": "https://www.irishtimes.com/image-creator/?id=1.4825863&origw=1440", "publishedAt": "2022-03-13T21:54:00Z", "content": "William Hurt, who has died at the age of 71, was one of the key American actors to emerge in the 1980s.\r\nWinner of an Academy Award for Kiss of the Spiderwoman in 1985, he exuded a smooth patrician e… [+2602 chars]"}, {"source": {"id": null, "name": "Eurasiantimes.com"}, "author": null, "title": "After ‘Czars On The Mars’, China Compete With The US For Space Dominance; Sets 2030 Deadline For The Martian Mission - EurAsian Times", "description": "The race to space has been quietly intensifying in tandem with the geopolitical contest unfolding here on the earth. China, for example, has made significant strides in its space programs and looks to take the mantle from Russia in challenging American domina…", "url": "https://eurasiantimes.com/china-compete-with-the-us-for-space-sets-2030-deadline-martian/", "urlToImage": "https://eurasiantimes.com/wp-content/uploads/2022/03/mars-scaled-e1647147833816.jpg", "publishedAt": "2022-03-13T05:11:26Z", "content": "The race to space has been quietly intensifying in tandem with the geopolitical contest unfolding here on the earth. China, for example, has made significant strides in its space programs and looks t… [+6468 chars]"}]}