{"articles": [{"author": "Eric Levenson, CNN", "content": "(CNN)George Floyd's public death under the knee of former Minneapolis police officer Derek Chauvin last May set off an intense debate about societal issues on anti-Black racism, on police accountabil… [+8815 chars]", "description": "As Derek Chauvin's trial in the death of George Floyd begins Monday, there's a particularly wide gulf between the societal issues at stake and the legal issues that will be the trial's focus.", "publishedAt": "2021-03-28T10:10:00Z", "source": {"id": "cnn", "name": "CNN"}, "title": "Derek Chauvin is on trial for George Floyd's death. America's criminal justice system is not - CNN ", "url": "https://www.cnn.com/2021/03/28/us/derek-chauvin-george-floyd-trial-begin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210303161010-chauvin-floyd-split-super-tease.jpg"}, {"author": null, "content": "Washington, Mar 28 (IANS): Hospitalisations and death rates among the elderly in the US are falling, marking hopeful signs that a Covid-19 vaccinnation push aimed first at older Americans is bearing … [+1918 chars]", "description": "Washington, Mar 28 (IANS): Hospitalisations and death rates among the elderly in the US are falling, marking hopeful signs that a Covid-19 vaccinnation push aimed first at older Americans is bearing fruit, a media report said.\r\nDeaths tied to US nursing homes…", "publishedAt": "2021-03-28T04:45:23Z", "source": {"id": null, "name": "Daijiworld.com"}, "title": "US elderly get big boost from Covid vax - Daijiworld.com", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=817969", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png"}, {"author": null, "content": "New York – Three days after testing positive for COVID-19, “everything tasted like cardboard,” recalls 38-year-old Elizabeth Medina, who lost her sense of taste and smell at the start of the pandemic… [+4251 chars]", "description": "Sensory loss is estimated to affect more than 2 million Americans and 10 million people worldwide, according to an expert.", "publishedAt": "2021-03-28T02:19:37Z", "source": {"id": null, "name": "The Japan Times"}, "title": "Taste and smell gone forever? The anguish of COVID-19 survivors - The Japan Times", "url": "https://www.japantimes.co.jp/news/2021/03/28/world/science-health-world/coronavirus-smell-taste/", "urlToImage": "https://cdn-japantimes.com/wp-content/uploads/2021/03/np_file_78332-870x489.jpeg"}, {"author": null, "content": "Grey DeLisle-Griffin, American actress and singer, has narrated how her marriage to Christopher DeLisle, her first husband, crashed after she mistakenly confessed to cheating on him.\r\nThe songwriter … [+1983 chars]", "description": "Grey DeLisle-Griffin, American actress and singer, has narrated how her first marriage to Christopher DeLisle, her first husband", "publishedAt": "2021-03-27T18:57:14Z", "source": {"id": null, "name": "Thecable.ng"}, "title": "Grey DeLisle-Griffin: I lost my first marriage after I mistakenly confessed to cheating - TheCable Lifestyle - TheCable", "url": "http://lifestyle.thecable.ng/grey-delisle-griffin-i-lost-my-first-marriage-after-i-mistakenly-confessed-to-cheating/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/03/Grey_DeLisle-Griffin.jpg"}, {"author": null, "content": "<ul><li>Some widely available hand sanitisers that consumers snapped up to ward off the coronavirus infection has been found to contain high levels of benzene known to cause cancer.</li><li>Benzene i… [+7988 chars]", "description": "Some widely available hand sanitisers that American consumers snapped up last year to ward off coronavirus infection contain high levels of a chemical known to cause cancer, a testing firm’s analysis found.", "publishedAt": "2021-03-26T17:30:14Z", "source": {"id": "news24", "name": "News24"}, "title": "Carcinogen found in hand sanitisers that plugged Covid-19 gap - News24", "url": "https://www.news24.com/fin24/Companies/carcinogen-found-in-hand-sanitisers-that-plugged-covid-19-gap-20210326", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10836/af793168f4e841ef84b04f98773367bd.jpg"}], "message": "Successful api call", "number_of_news": 5, "status": 200, "topic": "america"}