{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "JAMIE STENGLE", "title": "Boy Scouts is changing its name to Scouting America - The Associated Press", "description": "The Boy Scouts of America is changing its name for the first time in its 114-year history. The Texas-based organization announced Tuesday that it would become Scouting America. It's a significant shift for the organization as it emerges from bankruptcy after …", "url": "https://apnews.com/article/boy-scouts-new-name-scouting-america-d583f5712680f155b4f6b762128734d3", "urlToImage": "https://dims.apnews.com/dims4/default/e77b034/2147483647/strip/true/crop/2323x1307+0+121/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7b%2Fdf%2F5943862ed16d5989a09e26a73ff9%2Fdca8db9105964f9a92095452cb21f9fb", "publishedAt": "2024-05-07T22:11:00Z", "content": "IRVING, Texas (AP) The Boy Scouts of America is changing its name for the first time in its 114-year history and will become Scouting America. Its a significant shift as the organization emerges from… [+4254 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Caitlin Doornbos, Diana Glebova", "title": "US soldier arrested in Russia told local girlfriend he supported Trump, repeated Kremlin line on 'aggressive' NATO, videos show - New York Post ", "description": "WASHINGTON – An American soldier jailed in Russia last week empathized with Russia’s view of the war in Ukraine and repeated Moscow’s talking points decrying NATO in videos posted to hi…", "url": "https://nypost.com/2024/05/07/world-news/us-soldier-arrested-in-russia-told-local-girlfriend-he-supported-trump-repeated-kremlin-line-on-aggressive-nato-videos-show/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2024/05/us-soldier-russia-detained-comp.jpg?quality=75&strip=all&w=1024", "publishedAt": "2024-05-07T19:11:00Z", "content": "WASHINGTON An American soldier jailed in Russia last week empathized with Russia’s view of the war in Ukraine and repeated Moscow’s talking points decrying NATO in videos posted to his Russian ex-gir… [+5464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein", "title": "Biden says antisemitism has no place in America in somber speech connecting the Holocaust to Hamas’ attack on Israel - CNN", "description": "President Joe Biden on Tuesday issued a call to fight a swiftly rising tide of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas’ attack on October 7.", "url": "https://www.cnn.com/2024/05/07/politics/joe-biden-antisemitism-speech/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/eeb4ab60-6fb7-4e38-941d-fae3e6b305c9.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-05-07T18:50:00Z", "content": "President Joe Biden on Tuesday issued a call to fight a ferocious surge of antisemitism, saying such hate has no place in America as he connected the horrors of the Holocaust to Hamas attack on Israe… [+11736 chars]"}]}