{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "More places in the US lift mask mandates. One local leader says the honor system is already not working - CNN ", "description": "Several days since the Centers for Disease Control and Prevention said fully vaccinated Americans can -- for the most part -- ditch their masks, more places are announcing changes to their mask policies, or doing away with the requirement altogether.", "url": "https://www.cnn.com/2021/05/18/health/us-coronavirus-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210517233339-01-mask-mandate-changes-2021-new-york-super-tease.jpg", "publishedAt": "2021-05-18T10:27:00Z", "content": "(CNN)Several days since the Centers for Disease Control and Prevention said fully vaccinated Americans can -- for the most part -- ditch their masks, more places are announcing changes to their mask … [+6030 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "ABS-CBN News", "title": "US NCAA: Fil-Am guard Remy Martin transfers to Kansas - ABS-CBN News", "description": "Filipino-American point guard Remy Martin has transferred to Kansas, but is still planning to test his stock in the upcoming NBA Rookie Draft.", "url": "https://news.abs-cbn.com/sports/05/18/21/us-ncaa-fil-am-guard-remy-martin-transfers-to-kansas", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/reuters/05/18/20210514_ncaa.jpg", "publishedAt": "2021-05-18T03:17:00Z", "content": "Filipino-American point guard Remy Martin has transferred to Kansas, but is still planning to test his stock in the upcoming NBA Rookie Draft, according to reports from US media.\r\nMartin played four … [+804 chars]"}, {"source": {"id": null, "name": "Wdiy.org"}, "author": "Emma Jacobs", "title": "They Had Leftover COVID Vaccines. So They Offered Them To Their Canadian Neighbors - WDIY", "description": "MONTREAL — With just over 3% of Canadians fully inoculated against COVID-19, a growing number of America&#039;s northern border states and communities have", "url": "https://www.wdiy.org/post/border-communities-offer-surplus-covid-vaccines-canadian-neighbors", "urlToImage": "https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202105/996941446.jpg", "publishedAt": "2021-05-17T21:26:46Z", "content": "MONTREAL With just over 3% of Canadians fully inoculated against COVID-19, a growing number of America's northern border states and communities have stepped up to offer excess vaccines to Canadians.\r… [+6215 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Children, teens and COVID vaccines: where is the evidence at, and when will kids in Australia be eligible? - MENAFN.COM", "description": "Adolescents in North America are beginning to roll up their sleeves for the Pfizer-BioNTech vaccine after it was approved for 12-15-year-olds this month.</p>\n<p>The Canadian drug and therapeutic regulator  approved Pfizer-BioNTech's mRNA vaccine for children …", "url": "https://menafn.com/1102093856/Children-teens-and-COVID-vaccines-where-is-the-evidence-at-and-when-will-kids-in-Australia-be-eligible", "urlToImage": "https://menafn.com/updates/pr/2021-05/17/TC_2e7efimage_story.jpg", "publishedAt": "2021-05-17T20:19:10Z", "content": "(MENAFN - The Conversation) Adolescents in North America are beginning to roll up their sleeves for the Pfizer-BioNTech vaccine after it was approved for 12-15-year-olds this month.\r\nThe Canadian dru… [+5321 chars]"}]}