{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Healthday.com"}, "author": "Robert Preidt", "title": "Men Think They're Healthier Than They Are, Don't Need Checkups: Survey - San Francisco Examiner", "description": "WEDNESDAY, June 1, 2022 (HealthDay News) -- It's a classic case of male machismo jeopardizing health: A new survey finds many American men believe they're healthier than other men and don't bother with annual checkups, even though a yearly exam can catch heal…", "url": "https://consumer.healthday.com/b-6-1-men-think-they-re-healthier-than-they-are-don-t-need-checkups-survey-2657406222.html", "urlToImage": "https://consumer.healthday.com/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yOTg2OTQ4NC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTcwMzY3Nzc4Mn0.IspfLcu_rFYbptsT2wSNfQcmgJWIKLnuPq4X4NktIT4/image.jpg?width=1200&coordinates=0%2C670%2C0%2C670&height=600", "publishedAt": "2022-06-01T11:40:09Z", "content": "WEDNESDAY, June 1, 2022 (HealthDay News) -- It's a classic case of male machismo jeopardizing health: A new survey finds many American men believe they're healthier than other men and don't bother wi… [+2721 chars]"}, {"source": {"id": null, "name": "soompi"}, "author": "eclipse01", "title": "Watch: BTS And U.S. President Joe Biden Share Video And Photos From Their Meeting At White House - soompi", "description": "U.S. President Joe Biden has shared a first glimpse of his private meeting at the White House with BTS! On May 31 local time, BTS met with President Biden in honor of AANHPI (Asian American and Native Hawaiian/Pacific Islander) Heritage Month. Ahead of their …", "url": "https://www.soompi.com/article/1528891wpp/watch-bts-and-u-s-president-joe-biden-share-video-and-photos-from-their-meeting-at-white-house", "urlToImage": "https://6.viki.io/image/2e9f7b0a8e464d6db47d9ed7a147ebfa/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-06-01T03:57:33Z", "content": "U.S. President Joe Biden has shared a first glimpse of his private meeting at the White House with BTS!\r\nOn May 31 local time, BTS met with President Biden in honor of AANHPI (Asian American and Nati… [+1575 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Mike Oyebola", "title": "Balogun out of Ecuador friendly, to join Super Eagles for AFCON qualifiers - Daily Post Nigeria", "description": "Leon Balogun has been ruled out of Super Eagles' friendly against La Tri of Ecuador on Thursday. Balogun was earlier expected to travel to New Jersey, United States of America after recovering from a minor calf injury that forced him to miss last Sunday's 2-2…", "url": "https://dailypost.ng/2022/05/31/balogun-out-of-ecuador-friendly-to-join-super-eagles-for-afcon-qualifiers/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/10/skysports-nigeria-international_4317522.jpg", "publishedAt": "2022-05-31T16:54:31Z", "content": "Leon Balogun has been ruled out of Super Eagles’ friendly against La Tri of Ecuador on Thursday.\r\nBalogun was earlier expected to travel to New Jersey, United States of America after recovering from … [+914 chars]"}]}