{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Chidanand Rajghatta", "title": "Biden's democracy summit ignites firefight at home - Times of India", "description": "US News: WASHINGTON: The American commentariat across the political spectrum are unloading on US President Joe Biden for holding a Summit of Democracy, with th.", "url": "https://timesofindia.indiatimes.com/world/us/bidens-democracy-summit-ignites-firefight-at-home/articleshow/88213340.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-88213356,width-1070,height-580,imgsize-30228,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2021-12-10T17:09:00Z", "content": "Biden's democracy summit ignites firefight at home"}, {"source": {"id": null, "name": "Barron's"}, "author": "Alex Williams", "title": "Inflation Is High But Stable in the Latest CPI Data. What That Means for the Fed - Barron's", "description": "The latest CPI figures suggest inflation may have found a ceiling, writes Alex Williams of Employ America.", "url": "https://www.barrons.com/articles/new-inflation-data-cpi-fed-employment-mandate-51639155690", "urlToImage": "https://images.barrons.com/im-448438/social", "publishedAt": "2021-12-10T17:02:00Z", "content": "About the author: Alex Williams is a research analyst at Employ America, an organization that conducts research and advocacy in support of full employment.Inflation may have found a ceiling. Todays C… [+5576 chars]"}, {"source": {"id": null, "name": "Taipei Times"}, "author": "台北時報", "title": "Facebook opens virtual world platform to public - Taipei Times", "description": "Facebook’s parent firm on Thursday opened its Horizon Worlds virtual-reality (VR) platform to the public in North America, in a step toward building its metaverse vision for the future. \r\nHorizon Worlds is far from a fully realized metaverse, a future Interne…", "url": "https://www.taipeitimes.com/News/biz/archives/2021/12/11/2003769375", "urlToImage": "https://www.taipeitimes.com/images/2021/12/11/P10-211211-319.jpg", "publishedAt": "2021-12-10T16:00:00Z", "content": "Facebook opens virtual world platform to public\r\nFacebooks parent firm on Thursday opened its Horizon Worlds virtual-reality (VR) platform to the public in North America, in a step toward building it… [+1826 chars]"}, {"source": {"id": null, "name": "Fox Business"}, "author": "Megan Henney", "title": "Where are surging consumer prices hitting Americans the hardest? - Fox Business", "description": "American households are grappling with the fastest price increases in nearly four decades, with the cost of everything from cars to gasoline to food soaring in November, the Labor Department reported Friday.", "url": "https://www.foxbusiness.com/economy/where-are-consumer-prices-rising-the-fastest", "urlToImage": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2021/12/0/0/fb-category-inflation.png?ve=1&tl=1", "publishedAt": "2021-12-10T15:45:54Z", "content": "American households are grappling with the fastest price increases in nearly four decades, with the cost of everything from cars to gasoline to food soaring in November, the Labor Department reported… [+2612 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Brazil's real falls as inflation sticks to six-year peak - Reuters", "description": "Brazil's real led losses among Latin American currencies on Friday as inflation slowed but remained around a six-year high, while uncertainty over a U.S. Federal Reserve rate hike, amid rising prices, kept most regional assets in a tight range.", "url": "https://www.reuters.com/markets/europe/brazils-real-falls-inflation-sticks-six-year-peak-2021-12-10/", "urlToImage": "https://www.reuters.com/pf/resources/images/reuters/reuters-default.png?d=63", "publishedAt": "2021-12-10T15:02:00Z", "content": "Dec 10 (Reuters) - Brazil's real led losses among Latin American currencies on Friday as inflation slowed but remained around a six-year high, while uncertainty over a U.S. Federal Reserve rate hike,… [+2799 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "U.K. court ruling paves way for Julian Assange to be extradited to U.S. - CBC News", "description": "A British appellate court opened the door Friday for Julian Assange to be extradited to the United States by overturning a lower court ruling that found the WikiLeaks founder's mental health was too fragile to withstand the American criminal justice system.", "url": "https://www.cbc.ca/news/world/uk-court-assange-us-charges-dec2021-1.6280717", "urlToImage": "https://i.cbc.ca/1.6280721.1639135782!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/britain-assange.jpg", "publishedAt": "2021-12-10T14:11:25Z", "content": "A British appellate court opened the door Friday for Julian Assange to be extradited to the United States by overturning a lower court ruling that found the WikiLeaks founder's mental health was too … [+1796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, CNN", "title": "As Biden promotes democracy abroad, advocates urge him to focus on fixing US elections - CNN", "description": "President Joe Biden kicked off the inaugural White House \"Summit for Democracy\" by sounding alarms about challenges to democracy around the globe. But advocates say much more work is needed at home to shore up America's democracy.", "url": "https://www.cnn.com/2021/12/10/politics/biden-democracy-summit-and-election-challenges-at-home/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210722142920-vote-us-super-tease.jpg", "publishedAt": "2021-12-10T12:07:00Z", "content": null}, {"source": {"id": null, "name": "Hitechwiki.com"}, "author": null, "title": "The PS5 first beaten by the Xbox Series in sales! - Hitechwiki.com", "description": "During the last week of November 2021, the Xbox Series sold out in greater quantity than the PS5! Not surprisingly, the PS5 is more successful than la Xbox Series. However, from November 21 to 27, 2021, the American console was sold in greater numbers! MCE TV…", "url": "https://hitechwiki.com/the-ps5-first-beaten-by-the-xbox-series-in-sales/", "urlToImage": "https://hitechwiki.com/wp-content/uploads/2021/12/The-PS5-first-beaten-by-the-Xbox-Series-in-sales.jpg", "publishedAt": "2021-12-09T22:15:18Z", "content": "During the last week of November 2021, the Xbox Series sold out in greater quantity than the PS5!Not surprisingly, the PS5 is more successful than la Xbox Series. However, from November 21 to 27, 202… [+2559 chars]"}]}