{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "www.ekathimerini.com"}, "author": "Newsroom", "title": "US said to recommend Covid vaccine boosters at 8 months - Kathimerini English Edition", "description": "US health experts are expected to recommend Covid-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lasting protection against the coronavirus as the delta variant spreads acros…", "url": "https://www.ekathimerini.com/news/1166367/us-said-to-recommend-covid-vaccine-boosters-at-8-months/", "urlToImage": "https://www.ekathimerini.com/wp-content/uploads/2021/05/north_macedonia_reuters-960x600.jpg", "publishedAt": "2021-08-17T11:58:22Z", "content": "US health experts are expected to recommend Covid-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lasting protectio… [+3804 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Robert Burns", "title": "Billions spent on Afghan army ultimately benefited Taliban - Associated Press", "description": "WASHINGTON (AP) — Built and trained at a two-decade cost of $83 billion, Afghan security forces collapsed so quickly and completely — in some cases without a shot fired — that the ultimate beneficiary of the American investment turned out to be the Taliban.", "url": "https://apnews.com/article/joe-biden-army-taliban-995b069a9008690582cb34f4cacd8515", "urlToImage": "https://storage.googleapis.com/afs-prod/media/fbe7941275b74c3c988a0731fd1a479f/3000.jpeg", "publishedAt": "2021-08-17T04:24:32Z", "content": "WASHINGTON (AP) Built and trained at a two-decade cost of $83 billion, Afghan security forces collapsed so quickly and completely in some cases without a shot fired that the ultimate beneficiary of t… [+6483 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Zeke Miller", "title": "Sources: US to recommend COVID vaccine boosters at 8 months - Associated Press", "description": "WASHINGTON (AP) — U.S. health experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lasting protection against the coronavirus as the delta v…", "url": "https://apnews.com/21cd829d358e9b50b16515025dab2008", "urlToImage": "https://storage.googleapis.com/afs-prod/media/62aceb43ad6e44ab913780aa87ca5efd/2000.jpeg", "publishedAt": "2021-08-17T04:23:51Z", "content": "WASHINGTON (AP) U.S. health experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure… [+3837 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "PTI", "title": "World News | Sources: US to Recommend COVID Vaccine Boosters at 8 Months - LatestLY", "description": "Get latest articles and stories on World at LatestLY.   US experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lasting protection against t…", "url": "https://www.latestly.com/agency-news/world-news-sources-us-to-recommend-covid-vaccine-boosters-at-8-months-2752406.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/Latestly-World-News-784x441.jpg", "publishedAt": "2021-08-17T03:16:08Z", "content": "Washington, Aug 17 (AP) US experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure … [+969 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Zeke Miller", "title": "Sources: US to recommend COVID vaccine boosters at 8 months - Statesville Record & Landmark", "description": "WASHINGTON (AP) — U.S. experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lasting protection against the coronavirus as the delta variant …", "url": "https://apnews.com/36d971bacb42017502f7cc4c2c02ec1c", "urlToImage": "https://storage.googleapis.com/afs-prod/media/d1903324bed04bafb77d8fe68a05addf/3000.jpeg", "publishedAt": "2021-08-17T03:12:57Z", "content": "WASHINGTON (AP) U.S. experts are expected to recommend COVID-19 vaccine boosters for all Americans, regardless of age, eight months after they received their second dose of the shot, to ensure lastin… [+3830 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Staff", "title": "U.S. to advise COVID-19 booster shots 8 months after vaccination - NYT - Reuters", "description": "The administration of U.S. President Joe Biden has decided that most Americans should get a booster shot of a COVID-19 vaccine eight months after they completed their initial vaccination, the New York Times reported on Monday, citing two administration offici…", "url": "https://www.reuters.com/article/health-coronavirus-usa-vaccine-idUSFWN2PN18X", "urlToImage": "https://s1.reutersmedia.net/resources_v2/images/rcom-default.png?w=800", "publishedAt": "2021-08-17T02:55:00Z", "content": "By Reuters Staff\r\nAug 16 (Reuters) - The administration of U.S. President Joe Biden has decided that most Americans should get a booster shot of a COVID-19 vaccine eight months after they completed t… [+324 chars]"}, {"source": {"id": null, "name": "New Straits Times"}, "author": "AFP", "title": "Pfizer submits data for 3rd dose approval in US - New Straits Times", "description": "WASHINGTON: Pfizer and BioNTech on Monday submitted preliminary clinical data to US health authorities as part of their effort to seek authorisation for a third dose of their Covid-19 vaccine for all Americans.", "url": "https://www.nst.com.my/world/world/2021/08/718582/pfizer-submits-data-3rd-dose-approval-us", "urlToImage": "https://assets.nst.com.my/images/articles/Pfizer170821_NSTfield_image_socialmedia.var_1629162216.jpg", "publishedAt": "2021-08-17T01:04:05Z", "content": null}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "editing", "title": "US Asks Afghan Citizens To Relocate To America Following Taliban Takeover - SaharaReporters.com", "description": "The recent unsavoury situation in Afghanistan followed the withdrawal of U.S. troops from the country.", "url": "http://saharareporters.com/2021/08/16/us-asks-afghan-citizens-relocate-america-following-taliban-takeover", "urlToImage": null, "publishedAt": "2021-08-16T20:26:15Z", "content": "The United States Government has stated that following Talibans capture of Afghanistan, Afghan citizens who are seeking to leave their homeland may be received as refugees in the US.\r\nThe US Ambassad… [+2823 chars]"}, {"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "Ahmed Aboulenein", "title": "As Delta spreads, some travelers double up on COVID-19 vaccine in U.S - Yahoo News Canada", "description": "WASHINGTON (Reuters) -Alison Toni felt lucky to get Sinovac's COVID-19 vaccine in Chile earlier this year.  Toni, an American living in Chile, was visiting...", "url": "https://ca.news.yahoo.com/delta-spreads-travelers-double-covid-101100593.html", "urlToImage": "https://s.yimg.com/uu/api/res/1.2/S6wzjYdY.dlU2QuHPuHNLg--~B/aD00OTE7dz04MDA7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/reuters.com/1a60324b4df080839dded1175b31bd7b", "publishedAt": "2021-08-16T10:11:00Z", "content": "By Ahmed Aboulenein\r\nWASHINGTON (Reuters) -Alison Toni felt lucky to get Sinovac's COVID-19 vaccine in Chile earlier this year. A month later, she was in Minnesota getting vaccinated again.\r\nToni, an… [+5556 chars]"}]}