{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": "Peace Akinyode", "title": "American rapper apologises for saying she doesn’t recognise Wizkid, Davido, Burna Boy - Punch Newspapers", "description": "Upcoming American rapper, Bia, has tendered an apology for saying she did not recognise the faces of Nigerian music stars; Wizkid, Burna Boy and Davido.", "url": "https://punchng.com/american-rapper-apologises-for-saying-she-doesnt-recognise-wizkid-davido-burna-boy/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/07/09173548/Bia.png", "publishedAt": "2021-07-09T16:00:05Z", "content": "Upcoming American rapper, Bia, has tendered an apology for saying that she did not recognise the faces of Nigerian music stars Wizkid, Burna Boy and Davido.\r\nThe artiste made the statement on Friday … [+1055 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": "Evens Sanon, Danica Coto and Joshua Goodman", "title": "More suspects arrested in assassination of Haitian president - CTV News", "description": "Haitian authorities have made more arrests in the assassination of President Jovenel Moise, raiding Taiwan's Embassy where several suspects are believed to have sought refuge, while also detaining two Haitian-Americans and several former Colombian soldiers al…", "url": "https://www.ctvnews.ca/world/more-suspects-arrested-in-assassination-of-haitian-president-1.5502725", "urlToImage": "https://www.ctvnews.ca/polopoly_fs/1.5502726.1625821438!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg", "publishedAt": "2021-07-09T15:12:00Z", "content": "PORT-AU-PRINCE, HAITI -- \r\nHaitian authorities have made more arrests in the assassination of President Jovenel Moise, raiding Taiwan's Embassy where several suspects are believed to have sought refu… [+7136 chars]"}, {"source": {"id": "polygon", "name": "Polygon"}, "author": "Susana Polo", "title": "Black Widow timeline and the new Marvel movie order, explained - Polygon", "description": "Black Widow is the first time the Marvel Cinematic Universe employs tons of flashbacks and Marvel movie history. Here’s everything we know about when Scarlett Johansson’s first starring Marvel movie takes place between Captain America: Civil War and Avengers:…", "url": "https://www.polygon.com/movies/22550415/black-widow-marvel-movie-order-timeline-captain-america-civil-war", "urlToImage": "https://cdn.vox-cdn.com/thumbor/pgbEdBSXX6IbUd0F23DRTsD00Gc=/0x0:5408x2831/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/22681337/BBU_12270_R.jpg", "publishedAt": "2021-07-09T14:18:17Z", "content": "With Black Widow in theaters and Disney Plus Premier Access on July 9, its time to get back to the Marvel Cinematic Universe in cinema, not just TV shows. Its been a while since we saw Natasha Romano… [+4093 chars]"}, {"source": {"id": null, "name": "BuzzFeed News"}, "author": "Ade Onibada", "title": "Zaila Avant-Garde Is The First Black American To Win The Scripps National Spelling Bee - BuzzFeed News", "description": "Fourteen-year-old Zaila Avant-garde only began competitive spelling two years ago, but that’s just the beginning of just how gifted she is.", "url": "https://www.buzzfeednews.com/article/adeonibada/zaila-avant-garde-african-american-spelling-bee-winner", "urlToImage": "https://img.buzzfeed.com/buzzfeed-static/static/2021-07/9/16/campaign_images/94cb16360e8e/zaila-avant-garde-is-the-first-black-american-to--2-3855-1625847276-33_dblbig.jpg?resize=1200:*", "publishedAt": "2021-07-09T13:33:00Z", "content": "A teenager from Louisiana has made history by becoming the first African American winner of the Scripps National Spelling Bee and the competition's second Black winner since its inception.\r\nZaila Ava… [+3134 chars]"}, {"source": {"id": null, "name": "CNBC"}, "author": "Robert Ferris", "title": "Americans are spending big money on backyard pools - CNBC", "description": "Many Americans are moving to the suburbs, migrating to warmer states and increasingly looking to make their own yards better places to spend time in.", "url": "https://www.cnbc.com/2021/07/09/americans-are-spending-big-money-on-backyard-pools.html", "urlToImage": "https://image.cnbcfm.com/api/v1/image/106874118-16194746292021-04-26t214122z_2081061450_rc2x3n9y5y83_rtrmadp_0_health-coronavirus-usa-pools.jpeg?v=1619474696", "publishedAt": "2021-07-09T12:01:01Z", "content": "The backyard pool has become a big moneymaker.\r\nA combination of factors has been fueling the trend for years. Many Americans are moving to the suburbs, migrating to warmer states and increasingly lo… [+750 chars]"}, {"source": {"id": null, "name": "New York Post"}, "author": "Yaron Steinbuch", "title": "What we know about James Solages and Vincent Joseph, the Americans detained in Haiti president's assassination - New York Post ", "description": "Two Haitian-Americans with ties to South Florida — including one who previously worked as a bodyguard at the Canadian Embassy in Haiti — are among the 28 alleged assassins of President Jovenel Moïs…", "url": "https://nypost.com/2021/07/09/what-we-know-about-the-americans-detained-in-haiti-assassination/", "urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2021/07/haiti-1.jpg?quality=90&strip=all&w=1200", "publishedAt": "2021-07-09T11:57:00Z", "content": "Two Haitian-Americans with ties to South Florida including one who previously worked as a bodyguard at the Canadian Embassy in Haiti are among the 28 alleged assassins of President Jovenel Moïse, off… [+5892 chars]"}, {"source": {"id": null, "name": "Www.imt.ie"}, "author": "Contributor", "title": "Updates in Prostate Cancer from the American Society of Clinical Oncology (ASCO) 2021 - Irish Medical Times", "description": "Indisputable progress in the treatment of prostate cancer was revealed at the recent ASCO meeting - despite the pandemic restriction writes Dr Emmet", "url": "https://www.imt.ie/clinical/updates-in-prostate-cancer-from-the-american-society-of-clinical-oncology-asco-2021-09-07-2021/", "urlToImage": "https://d1l0gza1nowsqe.cloudfront.net/wp-content/uploads/sites/4/2021/07/clinical_ASCO_620x3330.jpg", "publishedAt": "2021-07-09T09:25:18Z", "content": "Indisputable progress in the treatment of prostate cancer was revealed at the recent ASCO meeting – despite the pandemic restriction writes Dr Emmet Jordan\r\nThe ASCO 2021 meeting was once again held … [+12079 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Who killed Haiti President Jovenel Moise? Everything we know so far - Moneycontrol", "description": "A 28-member hit squad made up of Americans and Colombians assassinated President Jovenel Moise, Haitian police said on July 8, adding that eight were still at large.", "url": "https://www.moneycontrol.com/news/world/who-killed-haiti-president-jovenel-moise-everything-we-know-so-far-7149871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Haiti-770x433.jpg", "publishedAt": "2021-07-09T07:28:30Z", "content": "The assassination of Haitian President Jovenel Moise has plunged the impoverished Caribbean nation into crisis. Interim Prime Minister Claude Joseph, who confirmed the killing, said the police and mi… [+4232 chars]"}, {"source": {"id": null, "name": "Sporting News"}, "author": "Sporting News", "title": "Messi could end GOAT debate forever with Copa America victory - Goal.com", "description": "Goal takes a look at the next FIFA release date, how much it will cost, consoles it will be playable on and more.", "url": "https://www.sportingnews.com/ca/soccer", "urlToImage": "https://images.daznservices.com/di/library/sporting_news/a4/8/sportingnews_blid1xj976d41uqjx0jd6x52p.png", "publishedAt": "2021-07-09T07:04:05Z", "content": ""}, {"source": {"id": null, "name": "Sports Mole"}, "author": "Sam Varley", "title": "Preview: Peru vs. Colombia - prediction, team news, lineups - Sports Mole", "description": "Sports Mole previews Saturday's Copa America clash between Peru", "url": "https://www.sportsmole.co.uk/football/peru/copa-america/preview/preview-peru-vs-colombia-prediction-team-news-lineups_454309.html", "urlToImage": "//b.smimg.net/21/24/640x480/colecu_1.jpg", "publishedAt": "2021-07-09T05:35:04Z", "content": "Having both fallen short in the Copa America semi-finals, Peru and Colombia will battle for third spot in Brasilia on Saturday.\r\nPeru lost 1-0 at the hands of host nation Brazil to prevent them from … [+5167 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Frank LoMonte", "title": "Trump can't beat Facebook, Twitter and YouTube in court – but the fight might be worth more than a win - The Conversation US", "description": "Former President Trump is asking the courts to do what tycoon Trump once would have denounced: tell some of America’s most powerful corporations that they have no choice who they do business with.", "url": "https://theconversation.com/trump-cant-beat-facebook-twitter-and-youtube-in-court-but-the-fight-might-be-worth-more-than-a-win-164146", "urlToImage": "https://images.theconversation.com/files/410457/original/file-20210708-15-xqq91c.jpeg?ixlib=rb-1.1.0&rect=21%2C14%2C4768%2C2384&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-07-08T22:24:59Z", "content": "From condo salesman to reality TV host to leader of the free world, Donald Trump has occupied several lifetimes worth of identities over a remarkable career of reinventions. Even so, the billionaire … [+7578 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Paris police detain Lil Baby, frisk NBA's James Harden - CBC.ca", "description": "American rapper Lil Baby was briefly detained in Paris on Thursday and released shortly after with a drug fine. NBA star James Harden was also stopped but not detained, according to the city prosecutor's office.", "url": "https://www.cbc.ca/news/entertainment/lil-baby-james-harden-paris-1.6095435", "urlToImage": "https://i.cbc.ca/1.6095454.1625778932!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1325807779.jpg", "publishedAt": "2021-07-08T22:23:08Z", "content": "Paris police released rapper Lil Baby from custody on Friday after fining him for having cannabis in his car, according to the city prosecutor's office. He was stopped along with NBA star James Harde… [+3260 chars]"}]}