{"articles": [{"author": "Science X staff", "content": "Whether parents prefer a conformance-oriented or independence-oriented supplemental education program for their children depends on political ideology, according to a study of more than 8,500 America… [+3882 chars]", "description": "Whether parents prefer a conformance-oriented or independence-oriented supplemental education program for their children depends on political ideology, according to a study of more than 8,500 American parents by a research team from Rice University and the Un…", "publishedAt": "2021-03-30T20:20:42Z", "source": {"id": null, "name": "Phys.Org"}, "title": "Kumon or Montessori? It may depend on your politics, according to new study of 8,500 parents - Phys.org", "url": "https://phys.org/news/2021-03-kumon-montessori-politics-parents.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/education.jpg"}, {"author": "ABC News", "content": "An Asian-American woman has been attacked on the streets of New York City by a man who repeatedly kicked her in front of witnesses who seemingly stood by, according to surveillance footage.\r\n<ul><li>… [+3038 chars]", "description": "In the 33rd recorded attack on an Asian victim in the city this year, a 65-year-old woman is kicked and stomped on by a stranger in front of a Manhattan building.", "publishedAt": "2021-03-30T14:01:06Z", "source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "title": "Asian-American woman severely assaulted on New York street as US hate crimes continue to rise - ABC News", "url": "https://www.abc.net.au/news/2021-03-31/asian-american-woman-assaulted-on-new-york-city-street/100039808", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e8fcf51fdd89046d21747ef7621f2330?impolicy=wcms_crop_resize&cropH=350&cropW=622&xPos=701&yPos=46&width=862&height=485"}, {"author": null, "content": "Mya Yafai, American model and social media celebrity, has deactivated her Instagram account amid rumoured affair with Davido, Nigerian singer. \r\nThe spotlight has continued to beam on the 22-year-old… [+1488 chars]", "description": "Mya Yafai, American model and social media celebrity, has deactivated her Instagram page amid rumoured affair with Davido, Nigerian singer.", "publishedAt": "2021-03-30T13:34:13Z", "source": {"id": null, "name": "Thecable.ng"}, "title": "Mya Yafai deactivates IG account amid rumoured affair with Davido - TheCable Lifestyle - TheCable", "url": "http://lifestyle.thecable.ng/mya-yafai-deactivates-ig-account-amid-rumoured-affair-with-davido/", "urlToImage": "https://w9r9i7y2.stackpathcdn.com/wp-content/uploads/2021/03/Mya-Yafai.jpg"}, {"author": "AFP", "content": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May duri… [+4774 chars]", "description": "Prosecutors sought to demonstrate that white then-police officer Derek Chauvin had no justification for using the dangerous move for some nine minutes on Floyd, an African-American man, last May during an arrest on a minor charge.", "publishedAt": "2021-03-30T05:33:16Z", "source": {"id": null, "name": "EWN"}, "title": "Jury in George Floyd murder trial shown harrowing video of his death - Eyewitness News", "url": "https://ewn.co.za/2021/03/30/jury-in-george-floyd-murder-trial-shown-harrowing-video-of-his-death", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/yng9tpllm5leq4xsq2o7"}, {"author": "Maria Godoy", "content": "Lots of people have questions about getting vaccinated against COVID-19. That includes the millions of Americans with weakened immune systems that put them at higher risk of severe disease if they do… [+12073 chars]", "description": "Lots of people have questions about getting vaccinated against COVID-19. That includes the millions of Americans with weakened immune systems that put them", "publishedAt": "2021-03-29T14:07:49Z", "source": {"id": null, "name": "Wprl.org"}, "title": "Immunocompromised And Concerned About The Vaccine? Here's What You Need To Know - WPRL", "url": "https://www.wprl.org/post/immunocompromised-and-concerned-about-vaccine-heres-what-you-need-know", "urlToImage": "https://mediad.publicbroadcasting.net/p/shared/npr/styles/medium/nprshared/202103/981768947.jpg"}, {"author": "Kurt Lozano", "content": "(Photo: Thunder Predator)\r\nThe Group Stage of the ONE Esports Dota 2 Singapore Major started on Monday (29 March), with South American underdogs Thunder Predator coming out of nowhere to finish the f… [+6253 chars]", "description": "As the second-placed team of the traditionally weaker South American regional league, they were expected to struggle against the representatives from other...", "publishedAt": "2021-03-29T13:57:36Z", "source": {"id": null, "name": "Yahoo Entertainment"}, "title": "Singapore Major Day 3 recap: Thunder Predator shred the opposition - Yahoo Singapore News", "url": "https://sg.news.yahoo.com/singapore-major-day-3-recap-thunder-predator-go-undefeated-135736808.html", "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2021-03/dd1d8660-9082-11eb-abc3-c2abad2e01cd"}], "message": "Successful api call", "number_of_news": 6, "status": 200, "topic": "america"}