{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Las razones por las que Brasil es tan superior en el fútbol suramericano - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/advanced/structured-data", "urlToImage": "https://developers.google.com/search/images/home-social-share-lockup.png", "publishedAt": "2022-07-28T03:43:00Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Peter Baker", "title": "China’s Domestic Troubles Will Hang Over Biden-Xi Call - The New York Times", "description": "Some American officials suspect that what is really driving China’s president to lash out recently is a desire to divert attention from his economic and pandemic problems at home.", "url": "https://www.nytimes.com/2022/07/27/us/politics/biden-jinping-china-taiwan.html", "urlToImage": "https://static01.nyt.com/images/2022/07/27/multimedia/27dc-prexy2-copy/27dc-prexy2-facebookJumbo.jpg", "publishedAt": "2022-07-28T01:32:49Z", "content": "Any member that wants to go should. It shows political deterrence to President Xi, said Representative Michael McCaul of Texas, the top Republican on the House Foreign Affairs Committee, who had to d… [+2423 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Caitlin Yilek", "title": "Blinken says U.S. made Russia a \"substantial proposal\" for release of Brittney Griner and Paul Whelan - CBS News", "description": "The secretary of state said securing the Americans' release remains a \"top priority\" for the U.S.", "url": "https://www.cbsnews.com/news/brittney-griner-paul-whelan-release-proposal-made-antony-blinken-says/", "urlToImage": "https://assets1.cbsnewsstatic.com/hub/i/r/2022/07/27/2a4e407c-e937-4e23-a4e1-82708d07709a/thumbnail/1200x630g3/34129ed9ffef7158a69620e52c082ab7/gettyimages-1242139607.jpg", "publishedAt": "2022-07-27T22:50:00Z", "content": "The U.S. has put forward a \"substantial proposal\" to Russia aimed at securing the release of WNBA star Brittney Griner and former U.S. Marine Paul Whelan, Secretary of State Antony Blinken said Wedne… [+5735 chars]"}, {"source": {"id": "news-com-au", "name": "News.com.au"}, "author": null, "title": "Fed attacks US inflation with another interest rate hike - news.com.au", "description": "<p>The US Federal Reserve on Wednesday again raised the benchmark interest rate by three-quarters of a percentage point in its ongoing battle to tamp down raging price pressures that are squeezing American families.</p>", "url": "https://www.news.com.au/breaking-news/fed-attacks-us-inflation-with-another-interest-rate-hike/news-story/84f8eccb6d681a969a9541e353b86f14", "urlToImage": "https://content.api.news/v3/images/bin/33b3ff5d656779acc7551bc66769319d", "publishedAt": "2022-07-27T21:40:37Z", "content": "The US Federal Reserve on Wednesday again raised the benchmark interest rate by three-quarters of a percentage point in its ongoing battle to tamp down raging price pressures that are squeezing Ameri… [+2331 chars]"}, {"source": {"id": null, "name": "Ctvnews.ca"}, "author": null, "title": "In rare contact, U.S. offers Russia deal for Brittney Griner, Paul Whelan - CTV News", "description": "The Biden administration has offered a deal to Russia aimed at bringing home WNBA star Brittney Griner and another jailed American Paul Whelan, Secretary of State Antony Blinken said Wednesday.", "url": "https://www.ctvnews.ca/world/in-rare-contact-u-s-offers-russia-deal-for-brittney-griner-paul-whelan-1.6004564", "urlToImage": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2022/7/27/secretary-of-state-antony-blinken-1-6004568-1658948133317.jpg", "publishedAt": "2022-07-27T18:56:28Z", "content": "WASHINGTON - \r\nThe Biden administration has offered a deal to Russia aimed at bringing home WNBA star Brittney Griner and another jailed American Paul Whelan, Secretary of State Antony Blinken said W… [+1811 chars]"}]}