{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "soompi"}, "author": "MLim", "title": "SEVENTEEN Announces Additional Dates And Cities For 2022 World Tour “BE THE SUN” - soompi", "description": "SEVENTEEN has confirmed additional dates and cities for their Asian tour! The day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13, SEVENTEEN gave a pleasant surprise to their fans by releasi…", "url": "https://www.soompi.com/article/1549677wpp/seventeen-announces-additional-dates-and-cities-for-2022-world-tour-be-the-sun", "urlToImage": "https://6.viki.io/image/e080978d62e44f089b59633aa53b8eaf/dummy.jpeg?s=900x600&e=t", "publishedAt": "2022-10-14T08:37:26Z", "content": "SEVENTEEN has confirmed additional dates and cities for their Asian tour!\r\nThe day after completing their North American tour and the initial last stop for their Asian tour in Singapore on October 13… [+504 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Andrew Feinberg", "title": "Trump will now be forced to testify after bombshell Jan 6 hearing lifts lid on Capitol riot links - The Independent", "description": "‘He is required to answer to those millions of Americans who votes he wanted to throw out as part of his scheme to remain in power and whatever is underway to ensure this accountability under law’", "url": "https://www.independent.co.uk/news/world/americas/us-politics/donald-trump-january-6-committee-subpoena-b2202429.html", "urlToImage": "https://static.independent.co.uk/2022/10/14/07/newFile.jpg?quality=75&width=1200&auto=webp", "publishedAt": "2022-10-14T06:18:02Z", "content": "The House 6 January select committee on Thursday voted to issue a subpoena demanding testimony from the man whose actions have been at the centre of the nine-member panels investigation over the last… [+9365 chars]"}, {"source": {"id": null, "name": "Mdanderson.org"}, "author": "Ronda Wendler", "title": "Exercise during cancer treatment: 4 things to know - MD Anderson Cancer Center", "description": "For years, people believed that patients being treated for cancer should rest and take it easy. But exercise during cancer treatment can help patients experience fewer side effects and recover faster, say new guidelines from the American Society of Clinical O…", "url": "https://www.mdanderson.org/cancerwise/exercise-during-cancer-treatment--4-things-to-know.h00-159543690.html", "urlToImage": "https://www.mdanderson.org/cancerwise/2022/10/exercise-during-cancer-treatment--4-things-to-know/_jcr_content/blog/adaptiveimage.resize.702.404.jpg", "publishedAt": "2022-10-12T14:13:27Z", "content": "For years, doctors have recommended exercise to reduce patients risk of developing cancer, and to help cancer survivors thrive after treatment ends. But what about exercising during treatment? There … [+4444 chars]"}]}