{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Forbes"}, "author": "Paul Tassi", "title": "Massive ‘Apex Legends’ Hack Disrupts NA Finals, Raises Serious Security Concerns - Forbes", "description": "Something rather terrifying has disrupted the North American Finals of Apex Legends, and players are now starting to potentially worry about their own accounts", "url": "https://www.forbes.com/sites/paultassi/2024/03/17/massive-apex-legends-hack-disrupts-na-finals-raises-serious-security-questions/", "urlToImage": "https://imageio.forbes.com/specials-images/imageserve/65f7a1d3473c0ac53bc02e80/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds", "publishedAt": "2024-03-18T02:11:12Z", "content": "Apex Legends\r\nRespawn\r\nSomething rather terrifying has disrupted the North American Finals of Apex Legends, and players are now starting to potentially worry about their own accounts and the overall … [+3029 chars]"}, {"source": {"id": null, "name": "VOA News"}, "author": "VOA Learning English", "title": "North America Prepares for 2024 Total Solar Eclipse - VOA Learning English", "description": "A total solar eclipse takes place in North America on April 8. Millions of people hope to fully experience the event, which is expected to darken the sky for more than four minutes. The path of totality will cover areas of Mexico, the U.S. and Canada.", "url": "https://learningenglish.voanews.com/a/north-america-prepares-for-2024-total-solar-eclipse/7528270.html", "urlToImage": "https://gdb.voanews.com/01000000-0aff-0242-7e80-08dc446b2d55_w1200_r1.jpg", "publishedAt": "2024-03-17T22:05:00Z", "content": "A total solar eclipse will take place in North America on April 8. Millions of people will be able to fully experience the event, which is expected to darken the sky for more than four minutes.\r\nA to… [+3952 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gabriel Hays", "title": "Pelosi suggests Trump meant he will ‘exact a bloodbath’ if he doesn’t win after rally statements - Fox News", "description": "Rep. Nancy Pelosi, D-Calif., wondered if former President Trump's \"bloodbath\" comments meant he was going to cause a bloodbath in America if he loses re-election.", "url": "https://www.foxnews.com/media/pelosi-suggests-trump-meant-exact-bloodbath-doesnt-win-rally-statements", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/Pelosi-bloodbath.png", "publishedAt": "2024-03-17T21:00:00Z", "content": "Former Speaker of the House Nancy Pelosi, D-Calif., weighed in on former President Trumps recent statements at a rally in Ohio, suggesting that Trump could be looking to \"exact a bloodbath\" in Americ… [+3101 chars]"}, {"source": {"id": null, "name": "Arab News"}, "author": null, "title": "Governance is space industry's key issue for 2024 - Arab News", "description": "Last week’s UN-Portugal policy symposium on the “Management and Sustainability of Outer Space Activities” coincided with SpaceX’s successful launch of its Starship, the most powerful rocket ever built. The Starship is important for NASA and the American space…", "url": "https://www.arabnews.com/node/2478331", "urlToImage": "https://www.arabnews.com/sites/default/files/authors/3791251-dramalmudallali.png", "publishedAt": "2024-03-17T20:05:48Z", "content": "https://arab.news/wga3c\r\nLast weeks UN-Portugal policy symposium on the Management and Sustainability of Outer Space Activities coincided with SpaceXs successful launch of its Starship, the most powe… [+7960 chars]"}]}