{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "FRANCE 24 English"}, "author": "Benjamin DODMAN", "title": "Senegal's democratic record on the line as presidential vote delay sparks crisis - FRANCE 24 English", "description": "Violent protests have roiled Senegal since President Macky Sall abruptly called off a planned election at the weekend, with just three weeks to go before the high-stakes vote. The crisis puts one of West Africa’s most stable democracies to the test at a time …", "url": "https://www.france24.com/en/africa/20240206-senegal-s-democratic-record-on-the-line-as-presidential-vote-delay-sparks-political-crisis", "urlToImage": "https://s.france24.com/media/display/33447e8c-c518-11ee-8140-005056bfb2b6/w:1280/p:16x9/000_34HN3ZG-1.jpg", "publishedAt": "2024-02-06T18:41:38Z", "content": "Violent protests have roiled Senegal since President Macky Sall abruptly called off a planned election at the weekend, with just three weeks to go before the high-stakes vote. The crisis puts one of … [+7180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pratyush Raj, Rahul Pandey", "title": "India vs South Africa Live Score, U19 World Cup 2024 Semi-Final: Sachin Dhas (96) and captain Uday Saharan (81) shine as IND win by two wickets to reach final - The Indian Express", "description": "IND vs SA Highlights, U19 World Cup 2024 Semi-Final: Earlier, Raj Limbani struck thrice with the ball as the Proteas bundled out for 244 in the first innings.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-south-africa-live-score-u19-world-cup-2024-semi-final-ind-vs-sa-icc-under-19-wc-latest-scorecard-9146347/", "urlToImage": "https://images.indianexpress.com/2024/02/IND-win-vs-SA-semifinal-U19.jpg", "publishedAt": "2024-02-06T16:12:52Z", "content": "Raj Limbani: A swing bowler from Rann of Kutch shining in U19 World Cup\r\n (LEFT) Raj Limbani's father Basant Patel at his farm in Dayapar in Kutch. (RIGHT) Raj bowls during the ICC U19 Cricket World … [+680 chars]"}]}