{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Carmag.co.za"}, "author": "John Whittle", "title": "The BMW M4 CSL is on its way and its going to be rather special - Carmag South Africa", "description": "More spy shots of the much-anticipated BMW M4 CSL have been released and have brought forth massive speculation as to what the latest M4 derivative will actually offer.", "url": "https://www.carmag.co.za/all-news/bmw-m4-csl-is-on-its-way/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/03/bmw-m4-csl-009.jpg", "publishedAt": "2022-03-07T14:49:48Z", "content": "According to BMWBLOG, the CSL will most likely be released by May 2022. The first appearance of the M4 CSL was allegedly in the We are M video which featured an acid yellow M4 that sported a duckbill… [+1877 chars]"}, {"source": {"id": null, "name": "African.business"}, "author": null, "title": "Canon introduces new web version of PosterArtist, adding new value for Canon printer users - African Business", "description": "Canon (www.Canon-CNA.com) today introduces a new web version of ‘PosterArtist’, making in-house poster design and print easier. All that’s needed to start", "url": "https://african.business/2022/03/apo-newsfeed/canon-introduces-new-web-version-of-posterartist-adding-new-value-for-canon-printer-users/", "urlToImage": "https://www.africa-newsroom.com/files/thumb/58554ae7e629d2a/600/418", "publishedAt": "2022-03-07T14:15:27Z", "content": "Canon (www.Canon-CNA.com) today introduces a new web version of PosterArtist[1], making in-house poster design and print easier. All thats needed to start poster creation is a compatible Canon printe… [+5778 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Dorcas Funmi", "title": "One in 10 children may be obese in Africa by 2023, WHO warns - TDPel Media", "description": "The World Health Organisation (WHO) has predicted that one in five adults and one in 10 children and teenagers will be obese by December 2023 in 10", "url": "https://tdpelmedia.com/one-in-10-children-may-be-obese-in-africa-by-2023-who-warns", "urlToImage": "https://von.gov.ng/wp-content/uploads/2022/03/images-2022-03-07T110606.528.jpeg", "publishedAt": "2022-03-07T10:37:43Z", "content": "The World Health Organisation (WHO) has predicted that one in five adults and one in 10 children and teenagers will be obese by December 2023 in 10 high-burden African countries if no robust measures… [+3682 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "South Africa’s R8 billion 4G and 5G spectrum auction starts tomorrow — what to expect - MyBroadband", "description": "Industry regulator Icasa has issued a brief on the procedure that will be followed for the radio frequency spectrum auction kicking off on Tuesday.", "url": "https://mybroadband.co.za/news/telecoms/436454-south-africas-r8-billion-4g-and-5g-spectrum-auction-starts-tomorrow-what-to-expect.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/03/Keabetswe-Modimoeng-ICASA-chairperson.jpg", "publishedAt": "2022-03-07T09:39:09Z", "content": "The Independent Communications Authority of South Africa (Icasa) has issued a brief summarising the process being followed for its auction of sought-after radio frequency spectrum, which kicks off on… [+4712 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Joseph Benjamin", "title": "RIP DJ Dimplez: A look at the hip-hop star's biggest hits [watch] - TDPel Media", "description": "The South African hip-hop community is mourning the loss of another great talent. Boitumelo Athiel Mooi, popularly known as DJ Dimplez, passed away on", "url": "https://tdpelmedia.com/rip-dj-dimplez-a-look-at-the-hip-hop-stars-biggest-hits-watch", "urlToImage": "https://tdpelmedia.com/wp-content/uploads/2022/02/fig-22-02-2022_22-24-35.jpg", "publishedAt": "2022-03-07T08:50:17Z", "content": "Skip to content\r\nThe South African hip-hop community is mourning the loss of another great talent. Boitumelo Athiel Mooi, popularly known as DJ Dimplez, passed away on Sunday 6 March. In a statement … [+2172 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Massmart reveals massive store expansion plans for Makro and Builder’s Warehouse - BusinessTech", "description": "Retailer Massmart, the owner of Makro and Game in South Africa, says it aims to grow its store footprint over the next five years to generate additional sales. It follows its latest financial performance showing extended losses over the past year.", "url": "https://businesstech.co.za/news/business/565300/massmart-reveals-massive-store-expansion-plans-for-makro-and-builders-warehouse/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/11/Makro-new.jpg", "publishedAt": "2022-03-07T06:59:30Z", "content": "Retailer Massmart, the owner of Makro and Game in South Africa, says it aims to grow its store footprint over the next five years to generate additional sales. It follows its latest financial perform… [+5102 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "UBA Posts N153bn Profit, Records 11% Balance Sheet Growth - THISDAY Newspapers", "description": "Kayode Tokede Africa’s global bank, the United Bank for Africa (UBA) Plc has announced its audited results for the full year ended December 31, 2021, reporting impressive performance in key financi…", "url": "https://www.thisdaylive.com/index.php/2022/03/07/uba-posts-n153bn-profit-records-11-balance-sheet-growth/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2020/07/be11283c-uba.jpeg", "publishedAt": "2022-03-07T06:03:57Z", "content": "Kayode Tokede\r\nAfricas global bank, the United Bank for Africa (UBA) Plc has announced its audited results for the full year ended December 31, 2021, reporting impressive performance in key financial… [+5839 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "WATCH: Gran Turismo 7 opening video is as cinematic as it gets - Carmag South Africa", "description": "It's hard to think how much more realistic video game graphics can get with gaming engines providing the most realistic experiences there have ever been. The Gran Turismo 7 opening video is the latest game to push the envelope, immersing viewers in a virtual …", "url": "https://www.carmag.co.za/news/industry-news/watch-gran-turismo-7-opening-video/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/03/12345.jpg", "publishedAt": "2022-03-06T13:05:31Z", "content": "It’s hard to think how much more realistic video game graphics can get with gaming engines providing the most realistic experiences there have ever been. The Gran Turismo 7 opening video is the lates… [+2065 chars]"}]}