{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "UPDATE | Elgin Fruit Juice is being investigated as the source of SA's apple juice recalls - Business Insider South Africa", "description": "Elgin Fruit Juice in the Western Cape is being investigated as the source of the patulin-induced recalls in South Africa.", "url": "https://www.businessinsider.co.za/south-africa-apple-juice-recall-linked-to-western-cape-supplier-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9097/bf292e1e80aa416d9b0958bf528dd7ee.jpg", "publishedAt": "2021-10-13T09:22:30Z", "content": "<ul><li>Apple juice products produced in South Africa are being recalled due to elevated levels of patulin, a mould which, when consumed, can cause nausea, gastrointestinal disturbances, and vomiting… [+4343 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Antony Sguazzin", "title": "Controversial Karpowership deal for emergency power hit with fresh corruption allegations - News24", "description": "DNG Energy, a losing bidder for state contracts to supply emergency power in South Africa, made fresh corruption allegations against a winning bidder, Karpowership.", "url": "https://www.news24.com/fin24/economy/controversial-karpowership-deal-for-emergency-power-hit-with-fresh-corruption-allegations-20211013", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8755/e28af2b9fee3404b9d64b496cbc28a52.jpg", "publishedAt": "2021-10-13T09:12:27Z", "content": "DNG Energy, a losing bidder for state contracts to supply emergency power in South Africa, made fresh corruption allegations against a winning bidder, Karpowership, and a government official.\r\nIn an … [+1932 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "Briefly Team", "title": "Ukrainian Female Cabin Crew Ditch Tight Skirts and Heels, Embrace Baggy Trouser Suits ▷ South Africa news - Briefly ", "description": "In a bid to make their working experience less strenuous, the SkyUp Airlines management changed the flight attendants' uniforms to loose orange suit coats.", "url": "https://briefly.co.za/111710-ukrainian-female-cabin-crew-ditch-tight-skirts-heels-embrace-baggy-trouser-suits.html", "urlToImage": "https://netstorage-briefly.akamaized.net/images/7e9612bbb3de189a.jpg", "publishedAt": "2021-10-13T07:49:08Z", "content": "<ul><li>Initially, female flight attendants for the airline used to wear skirt suits and heels as their required uniform</li><li>The airline announced its changes in uniform with female flight attend… [+3237 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa should introduce mandatory vaccine policies ahead of December: business group - BusinessTech", "description": "Business for South Africa (B4SA) says that South Africa will need to introduce a combination of mandatory vaccine policies and incentives if the country is to meet its national vaccination target in December.", "url": "https://businesstech.co.za/news/business/528644/south-africa-should-introduce-mandatory-vaccine-policies-ahead-of-december-business-group/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/Covid-e1621428244549.jpeg", "publishedAt": "2021-10-13T05:36:49Z", "content": "Business for South Africa (B4SA) says that South Africa will need to introduce a combination of mandatory vaccine policies and incentives if the country is to meet its national vaccination target in … [+3325 chars]"}, {"source": {"id": "ign", "name": "IGN"}, "author": "Taylor Lyles", "title": "Someone Made the First iPhone with USB-C - IGN SOUTH AFRICA", "description": "A robotics engineering student explains how he modded an iPhone to include a USB-C port.", "url": "https://za.ign.com/iphone-13-pro/158019/news/someone-made-the-first-iphone-with-usb-c", "urlToImage": "https://sm.ign.com/t/ign_za/news/s/someone-ma/someone-made-the-first-iphone-with-usb-c_s5uy.1200.jpg", "publishedAt": "2021-10-12T17:57:35Z", "content": "USB-C has been around since 2014, but if you have ever owned an iPhone or are heavily invested in the iOS ecosystem, you'll know Apple has yet to make an iPhone that uses USB-C charging. If you ever … [+2047 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Tunde Eludini", "title": "Zikora Emerges Winner of 2021 Heineken Design Fashion Africa Competition - Premium Times", "description": "Top Nigerian and African designers partook in the competition", "url": "https://www.premiumtimesng.com/entertainment/naija-fashion/489549-zikora-emerges-winner-of-2021-heineken-design-fashion-africa-competition.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/10/1-4.jpg", "publishedAt": "2021-10-12T17:22:16Z", "content": "Zikoranachukwuebuka Ikebuaku of Zikora has emerged winner of the Heineken Design Fashion Africa (DFA) Showcase 2021 held at the Eko Convention Center, over the weekend in Lagos.\r\nThe winner was then … [+3218 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major strike threatens to make South Africa’s jobs crisis worse - BusinessTech", "description": "South Africa’s ongoing steelworker strike is likely to lead to job cuts, further hammering an industry that’s been in decline for several years, according to the country’s main employer body.", "url": "https://businesstech.co.za/news/business/528634/major-strike-threatens-to-make-south-africas-jobs-crisis-worse/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/BMW-Assembly-plant.png", "publishedAt": "2021-10-12T14:20:40Z", "content": "South Africas ongoing steelworker strike is likely to lead to job cuts, further hammering an industry thats been in decline for several years, according to the countrys main employer body.\r\nThe week-… [+2340 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "Super Eagles not the best African team – Ikpeba - Daily Post Nigeria", "description": "Former Nigeria striker, Victor Ikpeba, has claimed the Super Eagles are not the best team in African football at the moment. Ikpeba stated this in reaction to the team's mixed results in their recent 2022 World Cup qualifying matches. The three-time African c…", "url": "https://dailypost.ng/2021/10/12/super-eagles-not-the-best-african-team-ikpeba/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/11/super-eagles-1.jpg", "publishedAt": "2021-10-12T09:41:49Z", "content": "Former Nigeria striker, Victor Ikpeba, has claimed the Super Eagles are not the best team in African football at the moment.\r\nIkpeba stated this in reaction to the team’s mixed results in their recen… [+713 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mark Heywood", "title": "Maverick Citizen: Tuesday Editorial: South Africa's mental health epidemic: Love Don't Live here Anymore - Daily Maverick", "description": "This is a scream for help that, tragically, will fall on deaf ears. People will harm themselves, harm others and some will die because the government will ignore what I am about to write.", "url": "https://www.dailymaverick.co.za/article/2021-10-12-south-africas-mental-health-epidemic-love-dont-live-here-anymore/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/OD-MC-tuesdayEd.jpg", "publishedAt": "2021-10-12T09:00:52Z", "content": "Research reports from the National Income Dynamics Coronavirus Rapid Mobile Survey (NIDS-CRAM) have documented increasing anxiety and deteriorating mental health as a result of Covid-19. (Photo: cnet… [+8323 chars]"}]}