{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Vaccinations open for children aged 12 – 17 today; Mkhize responds to the Digital Vibes scandal; how do coalition governments compare?; and Zuma ally and former spy boss Athur Fraser has his say on chief justice candidate Raymond Zondo.", "url": "https://businesstech.co.za/news/government/530578/5-important-things-happening-in-south-africa-today-1148/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Vaccine-e1625982135407.jpg", "publishedAt": "2021-10-20T06:13:36Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 453 new cases of Covid-19, taking the total reported to 2,917,255. Deaths have reached 88,… [+3423 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "John Bowker", "title": "ACSA builds defence against pandemic resurgence - News24", "description": "Airports Company South Africa is looking to generate more income from hotels and land, win service contracts and boost cargo revenue to prepare for a potential fresh wave of Covid-19 infections and restrictions.", "url": "https://www.news24.com/fin24/companies/acsa-builds-defence-against-pandemic-resurgence-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11700/d85c06f3c87f4f0ca84153819b2c9beb.jpg", "publishedAt": "2021-10-20T04:07:03Z", "content": "Airports Company South Africa (ACSA) is looking to generate more income from hotels and land, win service contracts and boost cargo revenue to prepare for a potential fresh wave of Covid-19 infection… [+1795 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Graye Morkel", "title": "Lalela Mswane on the road to Miss Universe: 'I've been waiting for this opportunity for the longest time' | Channel - News24", "description": "\"For it to have it become a reality is exciting, but I understand the duty and the weight of the task,\" says Miss South Africa 2021 Lalela Mswane about representing the country at Miss Universe.", "url": "https://www.news24.com/channel/the-juice/news/lalela-mswane-on-the-road-to-miss-universe-ive-been-waiting-for-this-opportunity-for-the-longest-time-20211020-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11696/048a037645334f24bcde9471b371dd14.jpg", "publishedAt": "2021-10-20T03:16:24Z", "content": "\"I am actually in disbelief. It still feels like a dream. But I feel so content,\" said 24-year-old Lalela Mswane on Sunday after being crowned Miss South Africa 2021 the day before. \r\nLalela, a Unive… [+142 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "ADC rejigging membership criteria in anticipation of APC, PDP implosion - Guardian Nigeria", "description": "Against the background of anticipated impasse within the governing All Progressives Congress (APC) and major opposition Peoples Democratic Party (PDP), the African Democratic Congress (ADC), which sells itself as the third way in Nigeria’s democracy says the …", "url": "https://guardian.ng/politics/adc-rejigging-membership-criteria-in-anticipation-of-apc-pdp-implosion/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/01/Kingsley-Moghalu.jpg", "publishedAt": "2021-10-20T02:44:00Z", "content": "Against the background of anticipated impasse within the governing All Progressives Congress (APC) and major opposition Peoples Democratic Party (PDP), the African Democratic Congress (ADC), which se… [+4469 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mark Heywood", "title": "EXCESS DEATHS: 264809 deaths later: Covid-19's terrifying toll on South Africa, almost three times the official figure - Daily Maverick", "description": "How does South Africa measure the scale of its Covid-19 epidemic? ‘Corpses are the one certainty. From the outset, scientists knew that counting deaths would give us the most accurate information about what is happening with the Covid epidemic in South Africa…", "url": "https://www.dailymaverick.co.za/article/2021-10-20-264809-deaths-later-covid-19s-terrifying-toll-on-south-africa-almost-three-times-the-official-figure/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/MC-Excess-Death-1-scaled.jpg", "publishedAt": "2021-10-19T22:33:19Z", "content": "Responding to questions about the Covid-19 death rate in SA and the systems being used to quantify it, Tom Moultrie, director of UCTs Centre for Actuarial Research, explained how since 3 May 2020, th… [+7946 chars]"}, {"source": {"id": null, "name": "Ecr.co.za"}, "author": null, "title": "Surprise! Couple discover stowaway in their luggage as they check in for flight - East Coast Radio", "description": "Hot music; cool people. Come chill on the east coast of South Africa, home to East Coast Radio, KwaZulu-Natal’s leading commercial radio station. Laughs, news, traffic, interviews, sport, jokes and great music – We play KZN’s Widest Variety Of Hit Music, Now …", "url": "https://www.ecr.co.za/", "urlToImage": "", "publishedAt": "2021-10-19T13:47:00Z", "content": "Trying to sneak onto an aeroplane is risky business.\r\nREAD: Buy your #ECRSummerBodyBootcamp ticket here\r\nThere is almost no way you can navigate your way through an airport without showing your board… [+1771 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Graye Morkel", "title": "The reason there is no second and third place at this year's Miss SA - News24", "description": "The top three will represent South Africa at the world's three most prestigious pageants - Miss World, Miss Universe and Miss Supranational.", "url": "https://www.news24.com/channel/the-juice/news/the-reason-there-is-no-second-and-third-place-at-this-years-miss-sa-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11697/afc0e1d97b8040f4b23d2a448e960150.jpg", "publishedAt": "2021-10-19T11:46:19Z", "content": "<ul><li>Lalela Mswane was crowned Miss South Africa 2021 on Saturday at the Grand Arena, GrandWest in Cape Town.</li><li>The two runners-up were Moratwe Masima, from Midrand in Gauteng, and Zimi Mabu… [+2323 chars]"}]}