{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "Mystery over: Betelgeuse, the dimming star that drew world attention, isn't exploding - it was just dusty - Business Insider South Africa", "description": "Betelgeuse made everybody think it was going to explode in a spectacular supernova. It turns out the star just belched and shrouded itself in dust.", "url": "https://www.businessinsider.com/betelgeuse-dimming-star-not-exploding-just-dusty-2021-6", "urlToImage": "https://i.insider.com/60ca7b5a23393a00188e3a6b?width=1200&format=jpeg", "publishedAt": "2021-06-17T14:35:05Z", "content": "Scientists have solved one of the most sensational cosmic mysteries in recent memory and they can chalk the whole thing up to dust.\r\nThe red super-giant star Betelgeuse enraptured the world early las… [+2099 chars]"}, {"source": {"id": null, "name": "Itnewsafrica.com"}, "author": null, "title": "Windows 11 Has Leaked Revealing Brand New Start Menu, UI, and More - IT News Africa", "description": "Microsoft’s upcoming operating system, the much-rumoured and nebulous Windows 11 has leaked online, with footage revealing a new, more-simplified user interface, start menu, acoustics and much more. check out our full Windows 11 hands-on for more. And yes, th…", "url": "https://www.itnewsafrica.com/2021/06/windows-11-has-leaked-revealing-brand-new-start-menu-ui/", "urlToImage": "https://www.itnewsafrica.com/wp-content/uploads/2021/06/Windows-11.jpg", "publishedAt": "2021-06-17T11:30:26Z", "content": "Microsoft’s upcoming operating system, the much-rumoured and nebulous Windows 11 has leaked online, with footage revealing a new, more-simplified user interface, start menu, acoustics and much more.\r… [+3494 chars]"}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Joshua Faleti", "title": "MeerKAT's Stunning Image Reveals Cosmic Threads, Ribbons and Rings - Space in Africa", "description": "A new study using the MeerKAT telescope revealed unexpected details of the inner workings of enormous radio galaxies.", "url": "https://africanews.space/meerkats-stunning-image-reveals-cosmic-threads-ribbons-and-rings/", "urlToImage": "https://africanews.space/wp-content/uploads/2021/06/sarao-1.jpg", "publishedAt": "2021-06-17T10:47:16Z", "content": "A new study using the MeerKAT radio telescope has produced a striking image showing a combination of cosmic features never before seen, revealing unexpected details of the inner workings of enormous … [+2637 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "City Lodge reopens two rebranded hotels – in Johannesburg business nodes - Business Insider South Africa", "description": "Hotel group City Lodge is reopening two more of its hotels in key Johannesburg business districts after 15 months of closure caused by coronavirus lockdown.", "url": "https://www.businessinsider.co.za/city-lodge-reopen-coronavirus-2021-6", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9696/39a32b80064047569a655f0043c5df74.jpg", "publishedAt": "2021-06-17T09:46:00Z", "content": "<ul><li>City Lodge will reopen two of its hotels in Sandton and Eastgate after closing for more than a year.</li><li>The group has rebranded the hotels, adding a new restaurant to the Eastgate locati… [+3270 chars]"}, {"source": {"id": null, "name": "TimesLIVE"}, "author": "Unathi Nkanjeni", "title": "Vaccine picket, alcohol & 'the new black' — 8 quotes from Malema's Youth Day address - TimesLIVE", "description": "EFF leader Julius Malema told supporters at a Youth Day rally on Wednesday that there will be a sleep-in at the South African Health Products Regulatory Authority CEO's house until Covid-19 vaccines are provided by government.", "url": "https://www.timeslive.co.za/politics/2021-06-17-vaccine-picket-alcohol--the-new-black--8-quotes-from-malemas-youth-day-address/", "urlToImage": "https://lh3.googleusercontent.com/pmUt-2EmpEtDdze1U2K-o2_YFtIWinDAESBLpturM5GN8gNvJ5Z6E5Jc0SJLx8HVlhOp_UnSW2wJdRcerL0zJTg30zRDsAm8J0g=s1000", "publishedAt": "2021-06-17T09:35:00Z", "content": null}, {"source": {"id": null, "name": "Variety"}, "author": "Jamie Lang", "title": "New African Series ‘Kizazi Moto’ and ‘Kiff’ Headline Disney EMEA’s Annecy Presentation - Variety", "description": "Disney EMEA hosted its annual Studio Focus at this year’s Annecy Animation Festival, lamentably pre-recorded for the second edition in a row, where the company announced a pair of new African series, the sci-fi anthology series “Kizazi Moto: Generation of Fir…", "url": "https://variety.com/2021/tv/news/kizazi-moto-kiff-disney-emea-annecy-1234998930/", "urlToImage": "https://variety.com/wp-content/uploads/2021/06/Kiff.jpg?w=1000", "publishedAt": "2021-06-17T09:07:00Z", "content": "Disney EMEA hosted its annual Studio Focus at this year’s Annecy Animation Festival, lamentably pre-recorded for the second edition in a row, where the company announced a pair of new African series,… [+4055 chars]"}, {"source": {"id": null, "name": "Variety"}, "author": "Christopher Vourlias", "title": "Disney Taps Top African Toon Talents for Animated Anthology ‘Kizazi Moto’ (EXCLUSIVE) - Variety", "description": "Disney has tapped top toon talents from across the African continent for “Kizazi Moto: Generation Fire,” a Disney Plus Original anthology of animated films set to premiere on the Mouse House’s streaming platform in late 2022. Inspired by the continent’s diver…", "url": "https://variety.com/2021/film/global/disney-plus-kizazi-moto-annecy-1234998580/", "urlToImage": "https://variety.com/wp-content/uploads/2021/06/Kizazi-Moto.jpg?w=1000", "publishedAt": "2021-06-17T07:32:00Z", "content": "Disney has tapped top toon talents from across the African continent for “Kizazi Moto: Generation Fire,” a Disney Plus Original anthology of animated films set to premiere on the Mouse House’s stream… [+4089 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Experts say South Africa should have moved to a level 3 lockdown sooner; Malema and the EFF defy lockdown rules; There continues to be questions around the ‘new SAA’ and former Eskom board chair; and the rand has slid against the dollar on the back of a Feder…", "url": "https://businesstech.co.za/news/government/498831/5-important-things-happening-in-south-africa-today-1061/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/EFF.jpg", "publishedAt": "2021-06-17T05:36:10Z", "content": "Heres what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 13,246 new cases of Covid-19, taking the total reported to 1,774,312. Deaths have reached 5… [+2259 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Goldman Sachs on collision course with South Africa’s biggest banks - BusinessTech", "description": "Goldman Sachs Group Inc’s dash for post-pandemic profits in South Africa is putting it on a collision course with the country’s biggest banks.", "url": "https://businesstech.co.za/news/banking/498837/goldman-sachs-on-collision-course-with-south-africas-biggest-banks/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/01/GoldmanSachs-e1579520573803.png", "publishedAt": "2021-06-17T05:30:56Z", "content": "Goldman Sachs Group Incs dash for post-pandemic profits in South Africa is putting it on a collision course with the countrys biggest banks.\r\nAlready a top trader of South African government bonds, G… [+4186 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Mohale Moloi and Aisha Abdool Karim", "title": "What happens if you walk into a vaccination site? We break it down - News24", "description": "The health department has issued new guidance on how South Africa’s Covid-19 vaccination sites should handle “walk-ins”.", "url": "https://www.news24.com/health24/medical/infectious-diseases/coronavirus/what-happens-if-you-walk-into-a-vaccination-site-we-break-it-down-20210617-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11269/43ee57c91bf442b797a825717684a360.jpg", "publishedAt": "2021-06-17T03:18:25Z", "content": "<ul><li>A new registration platform has\r\nbeen set up for healthcare workers in order to prevent people from falsely\r\nregistering on the system to get vaccinated</li><li>People over 60 can try to get\r… [+5873 chars]"}, {"source": {"id": null, "name": "Olatorera.com"}, "author": "Adedunni Aderoju", "title": "Foods That Lower Cholesterol Level - Olatorera.com", "description": "Get the latest news on business and politics in Africa. Olatorera Consultancy Limited highlights Africa's Best and news that affects development across the continent.", "url": "https://olatorera.com/foods-that-lower-cholesterol-level/", "urlToImage": "https://olatorera.com/wp-content/uploads/2021/06/Foods-that-reduce-cholesterol.jpeg", "publishedAt": "2021-06-16T14:43:25Z", "content": "Heart disease is the world’s leading cause of death and having high cholesterol level especially “bad” LDL is linked to an increased risk of heart disease. Low good HDL cholesterol and high triglycer… [+3122 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Kimberley E.J. Chapelle", "title": "South African dinosaur skeleton scans build up a picture from egg to adult - The Conversation Africa", "description": "This is a crucial dinosaur for palaeontologists; the variety of fossils available means researchers can study the species' growth through its whole life span.", "url": "https://theconversation.com/south-african-dinosaur-skeleton-scans-build-up-a-picture-from-egg-to-adult-161821", "urlToImage": "https://images.theconversation.com/files/406091/original/file-20210614-73350-qzvcq6.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2021-06-16T14:18:16Z", "content": "If you ask children what their favourite dinosaurs are, the answers will undoubtedly include T. rex, Triceratops and maybe Brachiosaurus. Those children answering the question in South Africa may be … [+5543 chars]"}, {"source": {"id": null, "name": "Itnewsafrica.com"}, "author": null, "title": "Windows 10 is Being Retired – What We Know About Windows 11 - IT News Africa", "description": "Windows 10 Home and Pro are set to be retired on 14 October 2025, no doubt as a harbinger to the launch of Windows 11. Pro Educations and Pro for Workstations versions of the OS are also included in the date. This comes according to Microsoft’s official Windo…", "url": "https://www.itnewsafrica.com/2021/06/windows-10-is-being-retired-what-we-know-about-windows-11/", "urlToImage": "https://www.itnewsafrica.com/wp-content/uploads/2020/04/Windows-10-Bugged-2.jpg", "publishedAt": "2021-06-16T13:00:17Z", "content": "Windows 10 Home and Pro are set to be retired on 14 October 2025, no doubt as a harbinger to the launch of Windows 11. Pro Educations and Pro for Workstations versions of the OS are also included in … [+2779 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sport24 staff", "title": "SA in spotlight at US Open: The 9 golfers flying the flag high - News24", "description": "The 121st US Open gets underway in San Diego this week with nine South Africans in the 156-player field at Torrey Pines.", "url": "https://www.news24.com/sport/golf/usopen/sa-in-spotlight-at-us-open-the-9-golfers-flying-the-flag-high-20210616", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10069/d0faf4d762534d88846cc33a51ebe833.png", "publishedAt": "2021-06-16T12:15:49Z", "content": "<ul><li>The 121st US Open gets under way in San Diego from Thursday with Bryson DeChambeau looking to defend his title.</li><li>There will be nine South Africans in the 156-player field at Torrey Pin… [+6758 chars]"}]}