{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Anti-party activities: ADC expels presidential candidate, seven others - Punch Newspapers", "description": "The African Democratic Congress has expelled its presidential candidate, Mr. Dumebi Kachikwu, and seven other chieftains from the party.", "url": "https://punchng.com/anti-party-activities-adc-expels-presidential-candidate-seven-others/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/03/29145111/ADC.jpg", "publishedAt": "2022-09-17T12:28:34Z", "content": "The African Democratic Congress has allegedly expelled its presidential candidate, Mr. Dumebi Kachikwu, and seven other chieftains from the party.\r\nA statement by the party’s national chairman, Ralph… [+1593 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "IN PICS | 'We have a lot to talk about': Biden, Ramaphosa vow to strengthen ties between two countries - News24", "description": "US President Joe Biden praised South Africa as a \"vital voice\" as he met with President Cyril Ramaphosa at the White House for talks that will touch on efforts to tackle the climate crisis, as well as ending the war in Ukraine.", "url": "https://www.news24.com/news24/southafrica/news/in-pics-we-have-a-lot-to-talk-about-biden-ramaphosa-vow-to-strengthen-ties-between-two-countries-20220917", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3873/92facd68d429417983e153d783eba1ec.jpg", "publishedAt": "2022-09-17T08:57:43Z", "content": "<ul><li>President Cyril Ramaphosa met with US President Joe Biden at the White House in Washington on Friday.</li><li>The two leaders discussed strategies to deal with climate change and end the war … [+4489 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Reflecting on the implementation of genomic surveillance for COVID-19 and beyond in the African Region - World - ReliefWeb", "description": "News and Press Release in English on World and 4 other countries about Health and Epidemic; published on 16 Sep 2022 by WHO", "url": "https://reliefweb.int/report/world/reflecting-implementation-genomic-surveillance-covid-19-and-beyond-african-region", "urlToImage": "https://reliefweb.int/modules/custom/reliefweb_meta/images/disaster-type/EP.png", "publishedAt": "2022-09-16T20:52:11Z", "content": "Since its first case was reported on 14 February 2020, the African Region has experienced four distinct waves of COVID-19. Throughout each of these, WHO has continued to work with countries to **scal… [+6019 chars]"}, {"source": {"id": null, "name": "Soccernet.ng"}, "author": "Kelvin Omachonu", "title": "Nigeria handed mild draw in 2022 Beach AFCON - Soccernet.ng", "description": "Two-time African champions The Super Sand Eagles of Nigeria will square off against Mozambique, Malawi, and Morocco in Group A of...", "url": "https://soccernet.ng/2022/09/nigeria-handed-mild-draw-in-2022-beach-afcon.html", "urlToImage": "https://soccernet.ng/wp-content/uploads/2022/09/images-2022-09-16T151453.335.jpeg", "publishedAt": "2022-09-16T14:32:15Z", "content": "The two time African Champions would look to claim their first trophy in 13 years\r\nTwo-time African champions The Super Sand Eagles of Nigeria will square off against Mozambique, Malawi, and Morocco … [+1083 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "'You have to risk it': Viola Davis on the Black female warriors at the centre of The Woman King - CBC.ca", "description": "The Woman King, which stars Viola Davis as regiment leader of the Agojie, tells the story of a group of women warriors who protected the kingdom of Dahomey in 19th century West Africa.", "url": "https://www.cbc.ca/news/entertainment/viola-davis-tiff-red-carpet-1.6578625", "urlToImage": "https://i.cbc.ca/1.6582750.1663180857!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1422332393.jpg", "publishedAt": "2022-09-16T13:40:17Z", "content": "While walking the TIFF red carpet last week, Viola Davis said that embodying an African warrior who leads an all-female battalion in The Woman King was just part of the gig.\r\n\"Your job as an actor is… [+2908 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Omono Okonkwo", "title": "For the third time, Nigeria signs cross-border pipeline MoU with Morocco - Nairametrics", "description": "On Thursday, September 15, the Nigerian National Petroleum Corporation (NNPC) Limited, the Economic Community of West African States (ECOWAS) and", "url": "https://nairametrics.com/2022/09/16/for-the-third-time-nigeria-signs-cross-border-pipeline-mou-with-morocco/", "urlToImage": "https://nairametrics.com/wp-content/uploads/2021/02/Nigeria-Morocco-gas-pipeline.jpg", "publishedAt": "2022-09-16T12:52:56Z", "content": "On Thursday, September 15, the Nigerian National Petroleum Corporation (NNPC) Limited, the Economic Community of West African States (ECOWAS) and Moroccos National Office of Hydrocarbons and Mines (O… [+5060 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Why Africa urgently needs to end malaria | The Guardian Nigeria News - Nigeria and World News — Features - Guardian Nigeria", "description": "Africa, the world's fastest developing and demographically youngest continent, continues to carry a disproportionately high share of the malaria burden in the world. The unsavoury situation has had devastating implications on the continent's economy and the g…", "url": "https://editor.guardian.ng/features/why-africa-urgently-needs-to-end-malaria/", "urlToImage": "https://guardian.ng/wp-content/uploads/2020/08/malaria.jpg", "publishedAt": "2022-09-16T10:54:00Z", "content": "Africa, the world’s fastest developing and demographically youngest continent, continues to carry a disproportionately high share of the malaria burden in the world. The unsavoury situation has had d… [+6307 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Eskom wants a massive 32% electricity price hike in South Africa - BusinessTech", "description": "In its most recent price determination application to the National Energy Regulator of South Africa (Nersa), Eskom seeks tariff hikes that would cover emerging costs.", "url": "https://businesstech.co.za/news/energy/625978/eskom-wants-a-massive-32-electricity-price-hike-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/06/Eskom-1.jpg", "publishedAt": "2022-09-16T06:33:45Z", "content": "Eskom has applied to energy regulator Nersa to hike tariffs by 32% on 1 April next year.\r\nIn its most recent price determination application to the National Energy Regulator of South Africa (Nersa), … [+2885 chars]"}]}