{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Scientists Shed New Light on Triphyophyllum peltatum – A Unique Plant With a Deadly Appetite - SciTechDaily", "description": "Triphyophyllum peltatum is a unique plant native to the tropical regions of West Africa. This particular liana species garners significant attention from the medical and pharmaceutical sectors owing to its special constituents. Laboratory tests have revealed …", "url": "https://scitechdaily.com/scientists-shed-new-light-on-triphyophyllum-peltatum-a-unique-plant-with-a-deadly-appetite/", "urlToImage": "https://scitechdaily.com/images/Carnivorous-Leaf.jpg", "publishedAt": "2023-07-09T18:43:57Z", "content": "ByUniversity of WürzburgJuly 9, 2023\r\nA carnivorous leaf of Triphyophyllum peltatum with glands excreting a sticky liquid to capture insect prey. Credit: Traud Winkelmann / University of Hannover\r\nTr… [+5101 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Rwanda: Why Rwanda Missed Out On Inaugural Malaria Vaccine - AllAfrica - Top Africa News", "description": "On Wednesday, July 5, the World Health Organization and GAVI, The Vaccine Alliance, announced that 12 countries across different regions in Africa are set to receive 18 million doses of the first-ever malaria vaccine over the next two years.", "url": "https://allafrica.com/stories/202307090057.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2023-07-09T15:02:48Z", "content": "On Wednesday, July 5, the World Health Organization and GAVI, The Vaccine Alliance, announced that 12 countries across different regions in Africa are set to receive 18 million doses of the first-eve… [+3636 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "African rift: Massive crack could split the continent in half - Earth.com", "description": "This geographical phenomenon, known as the Eastern African Rift (EARS), is believed to have initiated around 22 million years ago", "url": "https://www.earth.com/news/african-rift-massive-crack-could-split-the-continent-in-half/", "urlToImage": "https://cff2.earth.com/uploads/2023/07/09073123/African-rift-scaled.jpg", "publishedAt": "2023-07-09T13:37:32Z", "content": "A colossal fissure tearing through the southeastern part of Africa might be an omen of a geographical shift, according to recent scientific observations. \r\nThis gigantic rupture, approximately 2,000 … [+5240 chars]"}]}