{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Daily Post Staff", "title": "Cryptocurrency exchange, Quidax unveils one of Africa's biggest music producers as brand ambassador - Daily Post Nigeria", "description": ". . . Announces the launch of its Crypto Academy At a press conference yesterday, African founded cryptocurrency exchange, Quidax announced that it will be collaborating with popular record producer, Micheal Collins popularly known as Don Jazzy. The crypto st…", "url": "https://dailypost.ng/2022/03/24/cryptocurrency-exchange-quidax-unveils-one-of-africas-biggest-music-producers-as-brand-ambassador/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/Quidax-Picture.jpg", "publishedAt": "2022-03-24T10:30:13Z", "content": ". . . Announces the launch of its Crypto Academy\r\nAt a press conference yesterday, African founded cryptocurrency exchange, Quidax announced that it will be collaborating with popular record producer… [+2515 chars]"}, {"source": {"id": null, "name": "Ripplesnigeria.com"}, "author": "Adekunle Fajana", "title": "FCCPC says only Presidential directive can change DSTV, GOTV price hike - Ripples Nigeria", "description": "The Federal Competition and Consumer Protection Commission (FCCPC) has stated that it can’t decide the price MultiChoice chooses for its pay television, DSTV and GOTV, but the Presidency can. The South African-owned cable tv had hiked prices for its pay-to-vi…", "url": "https://www.ripplesnigeria.com/fccpc-says-only-presidential-directive-can-change-dstv-gotv-price-hike/", "urlToImage": "https://i0.wp.com/www.ripplesnigeria.com/wp-content/uploads/2022/03/multichoice.jpg?resize=650%2C350&ssl=1", "publishedAt": "2022-03-24T10:28:21Z", "content": "The Federal Competition and Consumer Protection Commission (FCCPC) has stated that it can’t decide the price MultiChoice chooses for its pay television, DSTV and GOTV, but the Presidency can.\r\nThe So… [+2968 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "What is the new COVID-19 variant BA.2, and will it cause another wave of infections in the US? - Economic Times", "description": "BA.2 is the latest subvariant of omicron, the dominant strain of the SARS-CoV-2 virus that causes COVID-19. While the origin of BA.2 is still unclear, it has quickly become the dominant strain in many countries, including India, Denmark and South Africa. It i…", "url": "https://economictimes.indiatimes.com/news/international/world-news/what-is-the-new-covid-19-variant-ba-2-and-will-it-cause-another-wave-of-infections-in-the-us/articleshow/90418070.cms", "urlToImage": "https://img.etimg.com/thumb/msid-90418284,width-1070,height-580,imgsize-72676,overlay-economictimes/photo.jpg", "publishedAt": "2022-03-24T09:43:00Z", "content": "A new omicron subvariant of the virus that causes COVID-19, BA.2, is quickly becoming the predominant source of infections amid rising cases around the world. \r\nImmunologists Prakash Nagarkatti and M… [+5164 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Agency Report", "title": "World TB Day: 36% of TB deaths occur in Africa, says WHO - Premium Times", "description": "The official said that the UN High-Level world leaders had agreed to mobilise 13 billion dollars per year to finance TB prevention and treatment by 2022.", "url": "https://www.premiumtimesng.com/news/headlines/519267-world-tb-day-36-of-tb-deaths-occur-in-africa-says-who.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2020/07/UDUTH.jpg", "publishedAt": "2022-03-24T07:03:10Z", "content": "The World Health Organisation (WHO) has expressed concern that with 36 per cent of all tuberculosis (TB) deaths occurring in Africa, failure to invest in its response will take a formidable toll on A… [+3802 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "Parliament distances itself from resolution condemning Russia's invasion of Ukraine - News24", "description": "A delegation from the South African Parliament has distanced itself from an international resolution stating that \"the ongoing Russian use of force against Ukraine is a violation of the Charter of the United Nations, including the principle of sovereignty and…", "url": "https://www.news24.com/news24/southafrica/news/parliament-distances-itself-from-resolution-condemning-russias-invasion-of-ukraine-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1623/ad2e3b0f26a14c1a8c53da0ee0e11934.jpg", "publishedAt": "2022-03-23T17:14:19Z", "content": "<ul><li>South Africa has distanced itself from a resolution condemning Russia's use of force against Ukraine. </li><li>South Africa's delegation to the Inter-Parliamentary Union was one of nine count… [+5663 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Tebogo Monama", "title": "UFS to conduct clinical trials on traditional medicine for treating Covid-19 patients - News24", "description": "South Africa is one of the countries at the forefront of finding more treatments for Covid-19, with several clinical trials being conducted locally.", "url": "https://www.news24.com/news24/southafrica/news/ufs-to-conduct-clinical-trials-on-traditional-medicine-for-treating-covid-19-patients-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10701/4b7942a6a6d648ed869a28e47ad83db1.jpg", "publishedAt": "2022-03-23T16:30:00Z", "content": "<ul><li>The University of Free State will start clinical trials to test the use of traditional medicine in patients with mild and moderate Covid-19.  </li><li>The university will enrol 250 people in … [+5103 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khanyiso Tshwaku", "title": "Tamim, Taskin combine to roll SA, claim historic series win as hosts ponder World Cup issues - News24", "description": "South Africa's automatic path to the 2023 Cricket World Cup hasn't just hit an obstacle, but has firmly run aground after their nine-wicket loss to Bangladesh in the third ODI at SuperSport Park on Wednesday.", "url": "https://www.news24.com/sport/cricket/proteas/tamim-taskin-combine-to-roll-sa-claim-historic-series-win-as-hosts-ponder-world-cup-issues-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1607/e3ef63563977449891742ab8ffecd8e9.jpg", "publishedAt": "2022-03-23T16:29:22Z", "content": "<ul><li>South Africa's World Cup qualification path is in tatters after their embarrassing nine-wicket loss to Bangladesh at SuperSport Park on Wednesday.</li><li>South Africa remains ninth on the lo… [+4049 chars]"}, {"source": {"id": null, "name": "The Eagle Online"}, "author": "Hassan Muaz", "title": "Maya Amolo named Spotify's inaugural Fresh Finds Africa artist - - The Eagle Online", "description": "Centered around the Fresh Finds playlist, the programme focuses on helping emerging artists to learn and grow by giving them the tools for long-term and sustained career success. The Fresh Finds playlist serves as a launchpad for up-and-coming artists to get …", "url": "https://theeagleonline.com.ng/maya-amolo-named-spotifys-inaugural-fresh-finds-africa-artist/", "urlToImage": "https://theeagleonline.com.ng/wp-content/uploads/2022/03/FreshFinds_Africa_Maya-Amolo_IsuKim-scaled-e1648051252356.jpg", "publishedAt": "2022-03-23T16:01:08Z", "content": "Spotify on Wednesday announced Kenyan singer Maya Amolo as its first-ever Fresh Finds Africa artist as part of its programme tailored specifically to spotlight and develop emerging independent artist… [+2763 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lenin Ndebele", "title": "US army general concerned about China and Russia's growing influence in Africa - News24", "description": "If African governments overlook the United States as their international partner and opt for China and/or Russia, this will affect the US' global influence, says General Stephen J Townsend, US commander of the United States Africa Command.", "url": "https://www.news24.com/news24/africa/news/us-army-general-concerned-about-china-and-russias-growing-influence-in-africa-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1363/dcd8b4d681a74d39b2e5dd4bc1be1d1e.jpg", "publishedAt": "2022-03-23T13:31:41Z", "content": "<ul><li>The US commander of the United States Africa Command has noted that his country needs Africa for key supplies to produce 21st century technologies.</li><li>He says strategic rivals, China and… [+4389 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Victoria O'Regan", "title": "Ramaphosa's relaxed Covid rules met with relief, but... - Daily Maverick", "description": "The further easing of lockdown regulations on Tuesday has been broadly welcomed, but proposed new regulations recently released under the National Health Act are raising concern. Meanwhile, South Africa recorded 912 new Covid-19 infections on Tuesday.", "url": "https://www.dailymaverick.co.za/article/2022-03-23-relief-over-ramaphosas-relaxed-covid-rules-but-proposed-new-health-regulations-sharply-criticised/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/OD-Pushback-CR-covid1.jpeg?w=1280", "publishedAt": "2022-03-23T12:11:13Z", "content": "While President Cyril Ramaphosas address on Tuesday when he announced changes to some lockdown restrictions, including new rules on the size of gatherings, travel requirements and masks has been some… [+7580 chars]"}]}