{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Felix Njini and Loni Prinsloo", "title": "South African court suspends building at new Amazon Africa site - News24", "description": "The High Court has orderd Amazon to temporarily stop building work on its new Africa headquarters in Cape Town and developer Liesbeek Leisure Properties Trust must undertake “meaningful engagement and consultation” with members of the Khoisan people, the orig…", "url": "https://www.news24.com/fin24/economy/south-african-court-suspends-building-at-new-amazon-africa-site-20220320", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10374/32bd372b5b484fa08a45bac64e4bfe28.png", "publishedAt": "2022-03-20T10:21:52Z", "content": "South Africa’s High Court has temporarily halted construction of Amazon’s planned new Africa headquarters in Cape Town and ordered the company to consult with indigenous people who say the site is sa… [+1428 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Fikayo Olowolagba", "title": "AMVCA: How Funke Akindele, Bisola, Osas Ighodaro, Diane reacted to nomination - Daily Post Nigeria", "description": "Nollywood actresses have reacted to the nominations for eighth Africa Magic Viewers Choice Awards (AMVCA) The nominees for each category were announced on Saturday night by Adesua Wellington and Etim Effiong. Funke Akindele bagged nine nominations, including …", "url": "https://dailypost.ng/2022/03/20/amvca-how-funke-akindele-bisola-osas-ighodaro-diane-reacted-to-nomination/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/AMVCA.webp", "publishedAt": "2022-03-20T08:26:23Z", "content": "Nollywood actresses have reacted to the nominations for eighth Africa Magic Viewers Choice Awards (AMVCA)\r\nThe nominees for each category were announced on Saturday night by Adesua Wellington and Eti… [+1475 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The cheapest new cars you can buy in South Africa from every major brand - BusinessTech", "description": "Here is a list of roughly every major car brands cheapest car in South Africa", "url": "https://businesstech.co.za/news/motoring/569518/the-cheapest-new-cars-you-can-buy-in-south-africa-from-every-major-brand/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Mercedes-e1647695410386.png", "publishedAt": "2022-03-19T15:31:06Z", "content": "President Cyril Ramaphosa says he has established a Committee of Ministers to assess the impact that the conflict in Ukraine will have on food and fuel prices.\r\nThe president said this when he respon… [+4695 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Neesa Moodley", "title": "TransUnion data breach leaves 54 million South Africans... - Daily Maverick", "description": "International credit bureau TransUnion confirmed this morning that it has been the victim of a hack by a 'criminal third party' and will not be paying the extortion demand that was received.", "url": "https://www.dailymaverick.co.za/article/2022-03-19-transunion-union-data-breach-leaves-54-million-south-africans-exposed/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/01/382904542-e1647699802623.jpg?w=1280", "publishedAt": "2022-03-19T14:44:55Z", "content": "Criminal hacking group N4aughtysecTU, allegedly based in Brazil, has claimed responsibility, alleging that it has accessed the personal information of 54 million consumers, amounting to roughly 4 ter… [+5192 chars]"}, {"source": {"id": null, "name": "Expatica.com"}, "author": null, "title": "Unitaid to finance HIV shots in Brazil, South Africa - Expatica Belguim", "description": "International health agency Unitaid said Friday it will finance the introduction of new, long-lasting HIV prevention injections in Brazil and South Africa, providing an alternative to daily pill popping. Taking a drug known as PrEP, normally prescribed to tre…", "url": "https://www.expatica.com/ch/uncategorized/unitaid-to-finance-hiv-shots-in-brazil-south-africa-232222/", "urlToImage": "https://www.expatica.com/app/uploads/sites/9/2014/05/snowy-Switzerland.jpg", "publishedAt": "2022-03-19T09:40:59Z", "content": "International health agency Unitaid said Friday it will finance the introduction of new, long-lasting HIV prevention injections in Brazil and South Africa, providing an alternative to daily pill popp… [+2416 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Dave Johnson", "title": "How to restart the Touch Bar on a Mac when it stops working - Business Insider Africa", "description": "", "url": "https://africa.businessinsider.com/tech-insider/how-to-restart-the-touch-bar-on-a-mac-when-it-stops-working/zzbv7kw#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/TuXktkuTURBXy9jNDlhNzNlNS00Y2RlLTQyYjctYjE3Yi1iZTJiZWE2NDEzMzMuanBlZ5GTBc0EsM0Cdg", "publishedAt": "2022-03-19T02:44:59Z", "content": "How to restart the Touch Bar on a Mac\r\nYou can restart the Touch Bar's background process using the Activity Monitor. Here is what to do:\r\n1. Start the Finder and then search for \"activity.\" Double-c… [+916 chars]"}, {"source": {"id": null, "name": "Stuff.co.za"}, "author": "Brett Venter", "title": "VW launches its new Polo in South Africa alongside an NFT giveaway - Stuff Magazines", "description": "VW does a lot of interesting things in the tech space. It's working on autonomous driving, recycling, there was that whole diesel thing...", "url": "https://stuff.co.za/2022/03/18/vw-launches-its-new-polo-in-south-africa-alongside-an-nft-giveaway/", "urlToImage": "https://stuff.co.za/wp-content/uploads/2022/03/VW-Polo-NFT-ad.png", "publishedAt": "2022-03-18T11:43:43Z", "content": "VW does a lot of interesting things in the tech space. It’s working on autonomous driving, recycling, there was that whole diesel thing we don’t talk about… But VW South Africa’s got something a litt… [+1866 chars]"}]}