{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "The Takeaways from President Buhari's visit to France by Garba Shehu - Guardian", "description": "The first official visit to Europe since the COVID-19 pandemic saw President Muhammadu Buhari going to Paris, France to participate in a summit convened by Emmanuel Macron, his counterpart in France, on the financing of African post-COVID economies.", "url": "https://guardian.ng/features/the-takeaways-from-president-buharis-visit-to-france-by-garba-shehu/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/05/000_9A77QN-scaled-e1621795608307.jpg", "publishedAt": "2021-05-23T18:47:54Z", "content": "France’s President Emmanuel Macron (L) welcomes Nigeria’s President Muhammadu Buhari upon his arrival for a dinner at the Elysee Presidential Palace in Paris, on May 17, 2021, following an internatio… [+6396 chars]"}, {"source": {"id": null, "name": "New York Times"}, "author": "Keith Bradsher, Chris Buckley", "title": "Yuan Longping, Plant Scientist Who Helped Curb Famine, Dies at 90 - The New York Times", "description": "His development of high-yield rice hybrids in the 1970s led to steeply rising harvests in Asia and Africa and made him a national hero in China, credited with saving countless lives.", "url": "https://www.nytimes.com/2021/05/23/world/asia/yuan-longping-dead.html", "urlToImage": "https://static01.nyt.com/images/2021/05/23/world/23yuan-obit-sub/23yuan-obit-sub-facebookJumbo.jpg", "publishedAt": "2021-05-23T14:50:06Z", "content": "Mr. Yuan chose to specialize in crop genetics at a time when the subject was an ideological minefield in China. Mao Zedong had embraced the doctrines of Soviet scientists who rejected modern genetics… [+2018 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Elon Musk says he supports crypto in 'battle' over fiat money, like government-backed coins and bills - Business Insider South Africa", "description": "\"The true battle is between fiat and crypto,\" Elon Musk tweeted on Saturday. \"On balance, I support the latter.\"", "url": "https://www.businessinsider.com/elon-musk-announces-his-support-for-crypto-over-fiat-money-2021-5", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/104/33fdee90f99b461d8f24fb82e2969ea9.jpg", "publishedAt": "2021-05-23T08:14:53Z", "content": "Tesla CEO Elon Musk tweeted his support for crypto over fiat money on Saturday, with Bitcoin prices rising on the sentiment.\r\n\"The true battle is between fiat and crypto,\" Musk tweeted in response to… [+1546 chars]"}, {"source": {"id": null, "name": "eNCA"}, "author": null, "title": "Move to ban guns for self-defence - eNCA", "description": "South African gun owners are furious about a proposal that would remove self-defence as a valid reason to own a firearm.", "url": "https://www.enca.com/news/move-ban-guns-self-defence", "urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/2021-05/web_photo_firearm_230521.jpeg?h=dec22bcf&itok=dKPk3Wfi", "publishedAt": "2021-05-23T07:30:00Z", "content": "JOHANNESBURG - Gun owners are furious as government revealed proposed changes to the law that would remove self-defence as a valid reason to own a firearm.\r\nThe invitation for public comments on the … [+552 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Agency Staff", "title": "Vodacom consortium wins Ethiopia operating licence - TechCentral", "description": "Ethiopia has awarded a new telecommunications licence to a consortium including South Africa's Vodacom Group, paving the way for a long-awaited opening of the sector.", "url": "https://techcentral.co.za/vodacom-consortium-wins-ethiopia-operating-licence/107427/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2018/12/vodacom-2156-1120-1.jpg", "publishedAt": "2021-05-22T12:51:15Z", "content": "Ethiopia has awarded a new telecommunications licence to a consortium including South Africa’s Vodacom Group, paving the way for a long-awaited opening of the sector to outside investors.\r\nThe govern… [+1967 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "New photo shows oldest-ever spiral galaxy, and it formed around 1 billion years earlier than thought - Business Insider South Africa", "description": "The findings can provide clues on how spiral galaxies like the Milky Way have formed, a leading researcher told Insider.", "url": "https://www.businessinsider.com/photo-oldest-spiral-galaxy-formed-billion-years-earlier-than-thought-2021-5", "urlToImage": "https://i.insider.com/60a77249f27b4c0019445c9d?width=1200&format=jpeg", "publishedAt": "2021-05-22T06:09:24Z", "content": "Scientists have captured a picture of the oldest known spiral galaxy, which was formed 12.4 billion years ago.\r\nThe galaxy, officially named BRI 1335-0417, was snapped by the Atacama Large Millimeter… [+2443 chars]"}]}