{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Khanyiso Tshwaku", "title": "Super SA Saturday looms as Stormers, Bulls brace for 'huge' clash - News24", "description": "Stormers coach John Dobson said next week's South African United Rugby Championship derbies will carry even more significance from a log placing perspective.", "url": "https://www.news24.com/sport/rugby/unitedrugbychampionship/super-sa-saturday-looms-as-stormers-bulls-brace-for-huge-clash-20220403", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/4449/f142f070287343f2bcccf54a9d8f6894.jpg", "publishedAt": "2022-04-03T06:47:29Z", "content": "<ul><li>Stormers coach John Dobson said next week's South African United Rugby Championship derbies will have added significance.</li><li>The SA sides have been magnificent at home in the past month,… [+2855 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Africa Magic unveils nominees for premium awards | The Guardian Nigeria News - Nigeria and World News — Guardian Life — The Guardian Nigeria News – Nigeria and World News - Guardian Nigeria", "description": "Africa Magic, in collaboration with MultiChoice, recently unveiled the list of nominees for the eighth edition of its premium awards that included a new category, Best Online Social Content Creator. This inclusion according to the organisers is in recognition…", "url": "https://guardian.ng/life/africa-magic-unveils-nominees-for-premium-awards/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/04/Africa-Magic.jpg", "publishedAt": "2022-04-03T02:40:00Z", "content": "Africa Magic, in collaboration with MultiChoice, recently unveiled the list of nominees for the eighth edition of its premium awards that included a new category, Best Online Social Content Creator. … [+3371 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "Lotto and Lotto Plus results for Saturday, 2 April 2022 - The South African", "description": "Could tonight be your lucky night? Over R39 million is on the line. It's the winning Lotto, Lotto Plus 1 and Lotto Plus 2 numbers for 2 April 2022.", "url": "https://www.thesouthafrican.com/lotto-results/lotto/lotto-and-lotto-plus-results-for-saturday-2-april-2022-winning-numbers-winner/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2020/01/79b3c5f0-lotto-results.jpg", "publishedAt": "2022-04-02T17:03:09Z", "content": "Are you ready for the Lotto and Lotto Plus draw on Saturday, 2 April? It’s yet another chance to find out whether or not you’re South Africa’s latest overnight millionaire.\r\nIf you’ve decided to Phan… [+2018 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Adam Morgan McCarthy", "title": "Russia's biggest bank has been cut out of global financial markets – now it's launched a cryptocurrency - Business Insider South Africa", "description": "Sberbank launched a digital currency just weeks after the invasion of Ukraine, as sanctions cut Russia off from the global financial system.", "url": "https://www.businessinsider.co.za/russian-bank-issues-cryptocurrency-amid-onslaught-of-sanctions-war-ukraine-2022-4", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1917/e98a1ba6a27542a981f4bc9d6b5fd132.jpg", "publishedAt": "2022-04-02T05:43:51Z", "content": "Since Russia began its war on Ukraine, a host of restrictions have been imposed on the country, cutting it off from most of its foreign currency reserves and the global financial system. \r\nIn the mid… [+3421 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s credit outlook upgraded by Moody’s - BusinessTech", "description": "Moody’s Investors Service upgraded its outlook on South Africa’s credit rating as high commodity prices support the government’s efforts to rein in debt and reduce budget deficits.", "url": "https://businesstech.co.za/news/business/573698/south-africas-credit-outlook-upgraded-by-moodys/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2017/06/Moodys-e1497258672382.jpg", "publishedAt": "2022-04-02T05:11:22Z", "content": "Moodys Investors Service upgraded its outlook on South Africas credit rating as high commodity prices support the governments efforts to rein in debt and reduce budget deficits.\r\nThe company kept the… [+2212 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Qaanitah Hunter", "title": "Ramaphosa skirts around ANC's role in July unrest, admits to intelligence failures - News24", "description": "President Cyril Ramaphosa appeared before the South African Human Rights Commission hearings into the July unrest.", "url": "https://www.news24.com/news24/southafrica/news/ramaphosa-skirts-around-ancs-role-in-july-unrest-admits-to-intelligence-failures-20220402", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/414/49c318162b5e4e6784a47fc47b702a87.jpg", "publishedAt": "2022-04-02T02:36:14Z", "content": "President Cyril Ramaphosa appeared before the South African Human Rights Commission (SAHRC) hearings into the July unrest, emphatic that the violence was well-orchestrated and that the intelligence h… [+377 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": "Gabriel Tan", "title": "World Cup 2022 draw: Qatar to face Netherlands, Japan get Spain and Germany - ESPN", "description": "Hosts Qatar have been handed a tough draw for the 2022 World Cup, paired alongside the Netherlands as well as African champions Senegal.", "url": "https://www.espn.com.sg/football/fifa-world-cup/story/4631262/world-cup-2022-draw-qatar-to-face-netherlandsjapan-get-spain-and-germany", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0401%2Fr994002_1296x729_16%2D9.jpg", "publishedAt": "2022-04-02T01:56:03Z", "content": "Asia's hopefuls at the 2022 FIFA World Cup will have it all to do if they are to get out of the group stage, after all five guaranteed contenders were dealt tough hands in the Friday evening Final Dr… [+5032 chars]"}, {"source": {"id": null, "name": "Indiablooms.com"}, "author": "Indiablooms", "title": "A third of the world remains totally unvaccinated against COVID: Tedros - indiablooms", "description": "New York: A third of the world’s population has yet to receive a single dose of COVID-19 vaccine, including a shocking 83 per cent of all Africans, said the head of the World Health Organization (WHO) on Wednesday.", "url": "https://www.indiablooms.com/health-details/H/11330/a-third-of-the-world-remains-totally-unvaccinated-against-covid-tedros.html", "urlToImage": "https://www.indiablooms.com/health_pic/2022/be5d6b0e7ba2200e968511beb2cbf20e.jpg", "publishedAt": "2022-04-01T15:33:00Z", "content": "New York: A third of the world’s population has yet to receive a single dose of COVID-19 vaccine, including a shocking 83 per cent of all Africans, said the head of the World Health Organization (WHO… [+4491 chars]"}, {"source": {"id": null, "name": "Gazettengr.com"}, "author": "News Agency of Nigeria", "title": "83% of Africans unvaccinated against COVID-19: WHO - Peoples Gazette", "description": "“This is not acceptable to me, and it should not be acceptable to anyone. Are some lives worth more than others?” said WHO director-general.", "url": "https://gazettengr.com/83-of-africans-unvaccinated-against-covid-19-who/", "urlToImage": "https://gazettengr.com/wp-content/uploads/2A877ED3-B41E-45CC-B720-B62E30F717D0.jpeg", "publishedAt": "2022-04-01T12:26:16Z", "content": "The World Health Organisation (WHO) says a third of the worlds population has yet to receive a single dose of the COVID-19 vaccine, including a shocking 83 per cent of all Africans.\r\nThis is not acce… [+1714 chars]"}, {"source": {"id": null, "name": "Politicalanalysis.co.za"}, "author": null, "title": "How much do Uber Eats drivers make in South Africa? - Political Analysis South Africa", "description": "The amount of money that Uber Eats drivers in South Africa make is based on a standard fee and other elements which vary from order to order. ContentsOverviewAbout Uber EatsHow much do Uber Eats drivers make in South Africa?Factors that determine Uber Eats dr…", "url": "https://www.politicalanalysis.co.za/how-much-do-uber-eats-drivers-make-in-south-africa/", "urlToImage": "https://www.politicalanalysis.co.za/wp-content/uploads/2022/04/uber-eats-food-delivery--1000x600.jpg", "publishedAt": "2022-04-01T10:50:11Z", "content": "The amount of money that Uber Eats drivers in South Africa make is based on a standard fee and other elements which vary from order to order.\r\nOverview\r\nUber Eats is a popular food delivery service, … [+4456 chars]"}]}