{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "Google-linked DeepMind launches scholarships in South Africa - MyBroadband", "description": "Google parent company Alphabet has donated scholarship funding for Wits University students to complete machine learning degrees.", "url": "https://mybroadband.co.za/news/technology/396671-google-linked-deepmind-launches-scholarships-in-south-africa.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2018/04/Google.jpg", "publishedAt": "2021-05-11T13:36:45Z", "content": "Google parent company Alphabet has donated scholarship funding for four Wits University students to complete their Masters degrees in the field of machine learning.\r\nThe scholarships – which will be … [+2398 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "WRAP | Duarte: Magashule will have to apologise to ANC, South Africa before the end of the week - News24", "description": "ANC acting secretary-general Jessie Duarte briefs the media on the outcomes of NEC meeting held over the weekend.", "url": "https://www.news24.com/news24/southafrica/news/live-anc-nec-acting-secretary-general-jessie-duarte-briefs-media-on-meeting-outcomes-20210511", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11054/e23693efa99847df81454aab5ddf495b.jpg", "publishedAt": "2021-05-11T13:28:30Z", "content": "ANC NEC saga: Former president Thabo Mbeki raises concerns about the state of the ANC\r\nFormer president Thabo Mbeki has expressed concern over the state of the ANC after various national executive co… [+211 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "New Vaccine Blocks Novel Coronavirus, Its Variants in Animals: Study - News18", "description": "New Delhi: A new vaccine candidate has proven effective in protecting monkeys and mice from the novel coronavirus and its variants that first emerged in the UK, South Africa and Brazil, as well as related bat coronaviruses that could potentially cause the nex…", "url": "https://www.news18.com/news/india/new-vaccine-blocks-novel-coronavirus-its-variants-in-animal-study-3727331.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2020/12/1608788106_untitled-design-2020-12-24t110343.113.png", "publishedAt": "2021-05-11T11:20:00Z", "content": "New Delhi: A new vaccine candidate has proven effective in protecting monkeys and mice from the novel coronavirus and its variants that first emerged in the UK, South Africa and Brazil, as well as re… [+2999 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "Pick n Pay says it owes customers R200 million, and they should please claim it - Business Insider South Africa", "description": "Pick n Pay's Smart Shopper comes with discounts at the till, but also with points that accumulate – and expire.", "url": "https://www.businessinsider.co.za/smart-shopper-points-from-pick-n-pay-worth-r200-million-unclaimed-2021-5", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/7963/00d5232651a5437cbf78f992c7330cc0.jpg", "publishedAt": "2021-05-11T10:36:54Z", "content": "<ul><li>Pick n Pay says its customers have accumulated R200 million worth of Smart Shopper points.</li><li>It would like them to spend those.</li><li>The loyalty scheme comes with discounts at the ti… [+1561 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "3 scenarios for South Africa’s third Covid-19 wave - BusinessTech", "description": "While South Africa is unlikely to escape a third wave of Covid-19 infections, the severity in terms of confirmed cases, hospital admissions and deaths will depend on its timing, according to research released by the Covid-19 working group of the Actuarial Soc…", "url": "https://businesstech.co.za/news/trending/489467/3-scenarios-for-south-africas-third-covid-19-wave/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/05/Ramaphosa.jpg", "publishedAt": "2021-05-11T09:00:44Z", "content": "While South Africa is unlikely to escape a third wave of Covid-19 infections, the severity in terms of confirmed cases, hospital admissions and deaths will depend on its timing, according to research… [+5844 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Kelsie Sandoval", "title": "Covid-19 patients in India are developing 'black fungus' infections which can lead to blindness - Business Insider South Africa", "description": "Doctors say steroids, which have proven effective for those severely ill with COVID-19, may inadvertently fuel cases by dampening the immune system.", "url": "https://www.businessinsider.com/covid-patients-in-india-are-developing-life-threatening-black-fungus-2021-5", "urlToImage": "https://i.insider.com/6099f07b342837001822ca7a?width=1200&format=jpeg", "publishedAt": "2021-05-11T04:50:40Z", "content": "In the wake of India's second wave of COVID-19, hospitals are reporting an uptick in cases of mucormycosis or \"black fungus\" a serious but rare fungal infection.\r\nDr. Akshay Nair, an eye surgeon who … [+2126 chars]"}, {"source": {"id": null, "name": "Abs-cbn.com"}, "author": "Jamaine Punzalan, ABS-CBN News", "title": "Duterte declares nationwide state of calamity due to African swine fever - ABS-CBN News", "description": "President Rodrigo Duterte has declared a nationwide state of calamity over the African swine fever that has slashed the local supply of pork and pushed up its prices, based on a document that Malacañang released on Tuesday.", "url": "https://news.abs-cbn.com/news/05/11/21/duterte-declares-state-of-calamity-african-swine-fever", "urlToImage": "https://sa.kapamilya.com/absnews/abscbnnews/media/2021/news/05/11/20210415-pork-prices-mandaluyong-market-md.jpg", "publishedAt": "2021-05-11T04:49:00Z", "content": "MANILA — President Rodrigo Duterte has declared a nationwide state of calamity over the African swine fever that has slashed the local supply of pork and pushed up its prices, based on a document tha… [+788 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Jeremiah", "title": "COVID-19: India’s Battle Causes Vaccine Worries In Africa - LEADERSHIP NEWS", "description": "Africa is watching aghast as India struggles with coronavirus, fearing a long-running shortfall in the Indian-made vaccines that it needs to help protect its people. Often dubbed the “pharmacy of the world”, India is one of the biggest suppliers of the AstraZ…", "url": "https://leadership.ng/covid-19-indias-battle-causes-vaccine-worries-in-africa/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/03/AstraZenecas-COVID-19.jpg", "publishedAt": "2021-05-11T02:04:01Z", "content": "Africa is watching aghast as India struggles with coronavirus, fearing a long-running shortfall in the Indian-made vaccines that it needs to help protect its people.\r\nOften dubbed the pharmacy of the… [+3573 chars]"}]}