{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Mali's president, prime minister arrested by mutinous soldiers - CBC.ca", "description": "Mutinous soldiers arrested Mali's transitional president and prime minister on Monday, hours after a government reshuffle left out two members of the junta that seized power in a coup nine months earlier in the West African nation, the African Union and the U…", "url": "https://www.cbc.ca/news/world/mali-military-president-prime-minister-arrest-1.6038833", "urlToImage": "https://i.cbc.ca/1.6038844.1621898980!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/mali-politics.JPG", "publishedAt": "2021-05-24T23:30:42Z", "content": "Mutinous soldiers arrested Mali's transitional president and prime minister on Monday, hours after a government reshuffle left out two members of the junta that seized power in a coup nine months ear… [+2977 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "Telkom partners with EasyEquities after signing up 10,000 digital wallet users - Business Insider South Africa", "description": "Telkom will allow its Digital Wallet users to invest in stocks through a partnership with EasyEquities.", "url": "https://www.businessinsider.co.za/telkom-partners-with-easyequities-through-its-digital-wallet-service-2021-5", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11193/4dcf040f32524cce97371f5c1c5bb05a.jpg", "publishedAt": "2021-05-24T15:28:13Z", "content": "<ul><li>Telkom is expanding its mobile finance services and has partnered with the low-cost investment platform EasyEquities.</li><li>The telecommunications company will relaunch its Digital Wallet s… [+3656 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "Samsung Online Store Offers Amazing Supercharged Deals to Customers - Samsung Newsroom South Africa", "description": "JOHANNESBURG, South Africa – 24 May 2021 – South Africans can now supercharge their life with incredible special offers on their range of popular devices and", "url": "https://news.samsung.com/za/samsung-online-store-offers-amazing-supercharged-deals-to-customers", "urlToImage": "https://img.global.news.samsung.com/za/wp-content/uploads/2021/05/Supercharge_Deals_31_May_v3_74585.zip-Washing-Members_1440x2280_washing.jpg", "publishedAt": "2021-05-24T15:21:59Z", "content": "JOHANNESBURG, South Africa 24 May 2021 South Africans can now supercharge their life with incredible special offers on their range of popular devices and home appliances including TVs, fridges, washi… [+1405 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Mali's largest union launches fresh strike | The Guardian Nigeria News - Nigeria and World NewsWorld — The Guardian Nigeria News – Nigeria and World News - Guardian", "description": "Mali's largest trade union launched a fresh strike on Monday, an AFP journalist said, slowing or paralysing government offices and banks in the unstable West African country.", "url": "https://guardian.ng/news/malis-largest-union-launches-fresh-strike/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/04/Mali-flag.jpg", "publishedAt": "2021-05-24T14:58:00Z", "content": "A man holds a Mali’s national flag PHOTO: Associated Press\r\nMali’s largest trade union launched a fresh strike on Monday, an AFP journalist said, slowing or paralysing government offices and banks in… [+1946 chars]"}, {"source": {"id": null, "name": "Memeburn"}, "author": null, "title": "Nokia G10 coming to SA in June - price and details - Gearburn - gearburn", "description": "HMD has announced that the recently unveiled Nokia G10 affordable smartphone will launch in South Africa in June. Here's the price for the smartphone...", "url": "https://memeburn.com/gearburn/2021/05/nokia-g10-coming-to-sa-in-june-price-and-details/", "urlToImage": "https://memeburn.com/gearburn/wp-content/uploads/sites/3/2021/05/NokiaG10_Clear_Case.jpg", "publishedAt": "2021-05-24T14:52:27Z", "content": "HMD has announced that the recently unveiled Nokia G10 affordable smartphone will launch in South Africa in June — along with revealing the local price for the smartphone.\r\nThe G10 was announced alon… [+1448 chars]"}, {"source": {"id": null, "name": "Itnewsafrica.com"}, "author": null, "title": "Samsung Unveils 3 New Smart Monitors - IT News Africa", "description": "Samsung has unveiled its newly expanded Smart Monitor lineup which provides more display sizes and design options, along with new and enhanced smart features. “As time spent working, learning and playing from home increases for people around the world, homes …", "url": "https://www.itnewsafrica.com/2021/05/samsung-unveils-3-new-smart-monitors/", "urlToImage": "https://www.itnewsafrica.com/wp-content/uploads/2021/05/Samsung-6.png", "publishedAt": "2021-05-24T12:30:10Z", "content": "Samsung has unveiled its newly expanded Smart Monitor lineup which provides more display sizes and design options, along with new and enhanced smart features.\r\nAs time spent working, learning and pla… [+1843 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "A local designer asked R10,000 for makoti blankets – and they sold out - Business Insider South Africa", "description": "This makoti blanket is on the market for R10,000 - and it sold out in just two days.", "url": "https://www.businessinsider.co.za/most-expensive-blanket-2021-5", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9835/e5638ff5d8c24cec95e023eae1025251.jpg", "publishedAt": "2021-05-24T04:33:10Z", "content": "<ul><li>Matte Nolim, a local African luxury designer outlet, offered makoti blankets for R10,000 a piece.</li><li>All four sold out, in two days.</li><li>Similar blankets are sold at PEP Stores for R… [+3322 chars]"}, {"source": {"id": null, "name": "The Nation Newspaper "}, "author": null, "title": "COVID-19 vaccines supply grinding to halt in Africa – WHO - The Nation Newspaper ", "description": "The World Health Organisation (WHO) has stated that the supply of COVID-19 vaccines to the African region have ground to a near halt", "url": "https://thenationonlineng.net/covid-19-vaccines-supply-grinding-to-halt-in-africa-who/", "urlToImage": "https://thenationonlineng.net/wp-content/uploads/2021/05/Matshidiso-Moeti.jpg", "publishedAt": "2021-05-23T04:34:17Z", "content": "By Moses Emorinken, Abuja\r\nThe World Health Organisation (WHO) has stated that the supply of COVID-19 vaccines to the African region have ground to a near halt, leaving many Africans, including those… [+2377 chars]"}]}