{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": null, "title": "De Kock's refusal to take knee mystifies South Africa - News24", "description": "Quinton de Kock's refusal to take the knee at the T20 World Cup, despite the potential cost to his career, has divided opinion in South Africa.", "url": "https://www.news24.com/sport/cricket/t20worldcup/de-kocks-refusal-to-take-knee-mystifies-south-africa-20211027", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10691/083c2cca213043d5a342bda528ebb9ae.jpg", "publishedAt": "2021-10-27T19:57:12Z", "content": "Quinton de Kock's refusal to take the knee at the T20 World Cup, despite the potential cost to his career, divided opinion in South Africa on Wednesday and highlighted persistent concerns about racis… [+2383 chars]"}, {"source": {"id": null, "name": "Tribuneonlineng.com"}, "author": "Tribune Online", "title": "COVID-19: G20 members get more vaccine doses than Sub-Saharan Africa, UNICEF laments - NIGERIAN TRIBUNE", "description": "It has been observed that G20 members have received 15 times more COVID-19 vaccine doses per capita than sub-Saharan African countriesAhead of the G20 Leaders’ Summit which comes up this weekend, 48 UNICEF Africa Ambassadors and supporters have got u", "url": "https://tribuneonlineng.com/covid-19-g20-members-get-more-vaccine-doses-than-sub-saharan-africa-unicef-laments/", "urlToImage": "https://tribuneonlineng.com/wp-content/uploads/2020/01/unicef.jpg", "publishedAt": "2021-10-27T17:51:09Z", "content": "It has been observed that G20 members have received 15 times more COVID-19 vaccine doses per capita than sub-Saharan African countries\r\nAhead of the G20 Leaders Summit which comes up this weekend, 48… [+4335 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Blackhole with warped accretion disc discovered - Phys.org", "description": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Galaxy, 9,600 light-years from Earth, which they conclude is ca…", "url": "https://phys.org/news/2021-10-blackhole-warped-accretion-disc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/blackhole-with-warped.jpg", "publishedAt": "2021-10-27T16:52:47Z", "content": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Gal… [+5434 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "New pictures show how Apple kept design of first iPod secret by making prototypes look ridiculous - Business Insider South Africa", "description": "This early iPod prototype looks nothing like an iPod, and the device's inventor said the boxy design prevented staff from leaking the final product.", "url": "https://www.businessinsider.com/early-ipod-prototype-photos-disguised-design-2021-10", "urlToImage": "https://i.insider.com/61780bdf5d1dca0019a0fff9?width=1200&format=jpeg", "publishedAt": "2021-10-27T16:20:35Z", "content": "Before former Apple CEO Steve Jobs unveiled what would become the world's most popular portable music player, Apple's iPod was a massive, unwieldy device that looked nothing like the final product.\r\n… [+1667 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Lesley-Anne Johannes", "title": "Majority of local parents are keen to vaccinate their kids, reveal polls - News24", "description": "Polls conducted across South Africa are revealing how parents feel about their young children being eligible for the Covid-19 vaccine.", "url": "https://www.news24.com/parent/Family/Parenting/83-of-parents-feel-children-aged-12-to-18-are-too-young-to-consent-to-vaccination-reports-one-survey-20211027-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11729/f899235922da49f2a0ba15558f5071eb.jpg", "publishedAt": "2021-10-27T11:59:57Z", "content": "Polls conducted across South Africa are revealing how parents feel about their young children being eligible for the Covid-19 vaccine.\r\nParents responding to a News24 survey expressed conflicting emo… [+1721 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "https://www.facebook.com/nkooverjee", "title": "All-new Range Rover revealed with advanced tech and BMW power - Carmag South Africa", "description": "The all-new Range Rover has been unveiled after a number of leaks. The new luxury SUV brings with it an array of powertrain options together with a series of advanced technological features. The flagship offering will be available with a choice of two wheelba…", "url": "https://www.carmag.co.za/news/new-models/new-range-rover-revealed/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/10/All-new-Range-Rover-revealed-with-advanced-tech-and-BMW-power-2.jpg", "publishedAt": "2021-10-27T06:39:24Z", "content": "The all-new Range Rover has been unveiled after a number of leaks. The new luxury SUV brings with it an array of powertrain options together with a series of advanced technological features. The flag… [+2928 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": "Simon Brunsdon", "title": "Australia's Big Bash League emerges as unlikely lifeline for exiled South African captain Quinton de Kock - Wide World of Sports", "description": "De Kock already linked to BBL contract", "url": "https://wwos.nine.com.au/cricket/quinton-de-kock-bbl-australia-t20-world-cup-knee-black-lives-matter-south-africa/157fa555-ce93-48f9-b071-1e350695f47e", "urlToImage": "https://imageresizer.static9.net.au/VufQZ5lWoDcPgMxSnZckx9we7wo=/0x550:1325x1295/0x0/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F617a94d5-7554-4ce2-b3d8-d1e7a21e2f8b", "publishedAt": "2021-10-27T06:17:49Z", "content": "Australia's Big Bash League has emerged as an unlikely cricket lifeline for exiled South Africa captain Quinton de Kock.\r\nDe Kock dropped a bombshell on the Twenty20 World Cup on Tuesday night (AEDT)… [+3031 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Good news for South Africans travelling to the US - BusinessTech", "description": "The US published new rules for travellers on Monday (25 October), removing its country-by-country restrictions and instead introducing international restrictions based on the vaccination status of individual travellers.", "url": "https://businesstech.co.za/news/lifestyle/532024/good-news-for-south-africans-travelling-to-the-us/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2021-10-26T06:52:07Z", "content": "The US has published new rules for travellers, removing its country-by-country travel restrictions and instead introducing international restrictions based on the vaccination status of individual tra… [+4908 chars]"}]}