{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Huge Mob Attacks Delhi Cops After 3 Nigerians Detained For Overstaying - NDTV", "description": "Around100 people of African origin on Saturday surrounded a police team in the Neb Sarai area of South Delhi, clashed with them, and freed Nigerian nationals who had been detained over visa expiration by the anti-drugs force.", "url": "https://www.ndtv.com/india-news/africans-attack-police-in-delhi-delhi-cops-arrest-3-on-drug-charge-foreigners-mob-brings-them-back-3673261", "urlToImage": "https://c.ndtvimg.com/2023-01/7nem61s_africans-attack-police-in-delhi_625x300_08_January_23.jpg", "publishedAt": "2023-01-08T04:15:00Z", "content": "The detaineeswere being taken to the police station.\r\nNew Delhi: Around 100 people of African origin on Saturday surrounded a police team in the Neb Sarai area of South Delhi, clashed with them, and … [+1074 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": null, "title": "Australia v South Africa third Test day five LIVE: Usman Khawaja told Pat Cummins to declare after rain delayed start - Wide World of Sports", "description": "Still 13 wickets away", "url": "https://wwos.nine.com.au/cricket/australia-v-south-africa-third-test-day-five-live-scores-highlights-results-latest-updates/364f8c76-0162-44e9-abcf-f71cb1efb873", "urlToImage": "https://imageresizer.static9.net.au/B1H63ZSa0LzmAIFtUwjG2LTQQq8=/0x92:3338x1969/0x0/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F14bdae41-bcd6-437b-90fd-01dd5a36dc0f", "publishedAt": "2023-01-08T00:21:21Z", "content": "Usman Khawaja said it was the incessant Sydney rain that stranded him shy of a maiden double-ton, rather than any \"harsh\" decision by skipper Pat Cummins.\r\nSpeaking on Triple M after play, Khawaja sa… [+1493 chars]"}, {"source": {"id": "google-news", "name": "Google News"}, "author": null, "title": "Murió Modeste M'Bami, único africano en jugar en Millonarios - El Tiempo", "description": "Use the Rich Result Test to see what Google results can be generated for your pages and the schema markup validator for generic schema validation.", "url": "https://developers.google.com/search/docs/appearance/structured-data", "urlToImage": "https://developers.google.com/static/search/images/home-social-share-lockup.png", "publishedAt": "2023-01-07T20:02:04Z", "content": "The official Google tool for testing your structured data to see which Google rich results can be generated by the structured data on your page. You can also preview how rich results can look in Goog… [+9 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Election: ECOWAS deploys 40 observers to Benin Republic - Punch Newspapers", "description": "The Economic Community of West African States, has deployed 40 observers ahead of the January 8, 2023, legislative elections in Benin to support and monitor the entire electoral process.", "url": "https://punchng.com/election-ecowas-deploys-40-observers-to-benin-republic/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2020/03/17152253/ECOWAS-Commission-Abuja-office.jpg", "publishedAt": "2023-01-07T19:46:02Z", "content": "DECEMBER DEALS FOR YOU!!!! Get the best value for your Bitcoin and Gift Cards. Sign up on Apex Network NOW. Sell your Gifts Card in less than 24 hours. Sign up on Apex Network NOW.\r\nTHE CURRENT NAIRA… [+390 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Ryan Hogg", "title": "Alibaba founder Jack Ma, who disappeared from public view in 2020, appears to resurface in Thailand - Business Insider South Africa", "description": "Bangkok restaurant Jay Fai posted a picture of the elusive billionaire on Instagram just hours before he ceded control of the company he founded.", "url": "https://www.businessinsider.co.za/jack-ma-appears-resurface-thailand-gives-up-control-ant-group-2023-1", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1958/2f650f0f439d4be49cba8aa2873e78e0.jpg", "publishedAt": "2023-01-07T14:58:41Z", "content": "Jack Ma, the elusive billionaire founder of Alibaba, appeared to resurface in Thailand hours before Ant Group said he would give up control of the company.\r\nA picture of Ma was posted on Instagram by… [+1847 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Grace Dean", "title": "Take a look at British Airways' new cabin crew uniforms – its first revamp in 20 years - Business Insider South Africa", "description": "British Airways' new uniform includes a jumpsuit as well as a hijab and tunic option. Engineers and ground-operation agents will be first to switch.", "url": "https://www.businessinsider.co.za/british-airways-uniforms-new-revamp-flight-attendants-pilots-clothes-photos-2023-1", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1942/fc0147df11f04cc680890d40dba8d6e5.jpg", "publishedAt": "2023-01-07T09:56:57Z", "content": "British Airways' announcement comes as other airlines revamp their uniforms to become more inclusive, breaking away from the industry's history of strict dress codes like a ban on tattoos and certain… [+239 chars]"}, {"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Associations between punitive policies and legal barriers to consensual same-sex sexual acts and HIV among gay men and other men who have sex with men in sub-Saharan Africa: a multicountry, respondent-driven sampling survey - The Lancet", "description": "Structural risks including discriminatory country-level policies, prosecutions, and\nlegal barriers might contribute to higher HIV prevalence among MSM. Taken together,\nthese data highlight the importance of decriminalisation and decreasing enforcement,\nalongs…", "url": "https://www.thelancet.com/journals/lanhiv/article/PIIS2352-3018(22)00336-8/fulltext", "urlToImage": "https://www.thelancet.com/pb-assets/Lancet/lanhiv/ogImg-1592318469857.png", "publishedAt": "2023-01-06T23:46:27Z", "content": "Maintenance Warning: TheLancet.com will be undergoing maintenance on Saturday, January 7, 2023, from 8:00 am 11:59 am GMT (3:00 am to 7:00 am US EST). During this window we have temporarily deactivat… [+218 chars]"}]}