{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Crictracker.com"}, "author": "CricTracker Staff", "title": "T20 World Cup 2024: Match 4, SL vs SA Match Prediction – Who will win today’s T20 World Cup match between SL vs SA? - CricTracker", "description": "The encounter between Sri Lanka (SL) and South Africa (SA) will mark the commencement of play for all groups in the T20 World Cup 2024. Match 4 is scheduled to take place in the Nassau County Internat", "url": "https://www.crictracker.com/cricket-match-predictions/t20-world-cup-2024-match-4-sl-vs-sa-match-prediction-who-will-win-todays-t20-world-cup-match-between-sl-vs-sa/", "urlToImage": "https://media.crictracker.com/media/attachments/1717322610707_SL-vs-SA.jpeg", "publishedAt": "2024-06-03T09:15:00Z", "content": "The encounter between Sri Lanka (SL) and South Africa (SA) will mark the commencement of play for all groups in the T20 World Cup 2024. Match 4 is scheduled to take place in the Nassau County Interna… [+3968 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "South Africa's Cyril Ramaphosa faces up to poor ANC election result - BBC.com", "description": "President Ramaphosa says the result was a victory for democracy, but the ANC lost its majority for the first time.", "url": "https://www.bbc.com/news/articles/cx99vww50y5o", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/6e08/live/a62aae20-212b-11ef-80aa-699d54c46324.png", "publishedAt": "2024-06-03T08:07:56Z", "content": "South Africa's President Cyril Ramaphosa has admitted his African National Congress (ANC) party has suffered a challenging election result, after the party lost its majority for the first time since … [+4979 chars]"}, {"source": {"id": "the-jerusalem-post", "name": "The Jerusalem Post"}, "author": "By  JERUSALEM POST STAFF", "title": "New bipedal dinosaur species unearthed in major Zimbabwe discovery - The Jerusalem Post", "description": "Scientists discovered new dinosaur species, in Zimbabwe. The herbivorous dinosaur's remains date back to the late Triassic Period, highlighting Africa's paleontological potential", "url": "https://www.jpost.com/archaeology/article-804604", "urlToImage": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/472184", "publishedAt": "2024-06-01T22:11:46Z", "content": "International scientists discovered the fossilized remains of a previously unknown species of dinosaur in Zimbabwe, Phys.org reported on Thursday.\r\nThe research was an international joint effort by s… [+2560 chars]"}]}