{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Tuesday's weather: Rain expected across the country, with snow in parts of the Eastern Cape, KZN - News24", "description": "The South African Weather Service issued an orange level 5 warning for severe thunderstorms in the central highveld of Mpumalanga and a yellow level 2 for warning for severe thunderstorms over the eastern parts of Limpopo.", "url": "https://www.news24.com/news24/southafrica/news/tuesdays-weather-rain-expected-across-the-country-with-snow-in-parts-of-the-eastern-cape-kzn-20220919", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7187/879b7de478a9426d8f5547c5ced76e84.jpg", "publishedAt": "2022-09-19T16:35:53Z", "content": "The South African Weather Service issued an orange level 5 warning for severe thunderstorms in the central highveld of Mpumalanga and a yellow level 2 for warning for severe thunderstorms over the ea… [+2455 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "Load-shedding is crushing mobile Internet in South Africa - MyBroadband", "description": "A MyBroadband analysis has revealed that South Africa’s mobile networks struggle to maintain performance during continued load-shedding.", "url": "https://mybroadband.co.za/news/cellular/461100-load-shedding-is-crushing-mobile-internet-in-south-africa.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/06/Cellphone-no-signal.jpg", "publishedAt": "2022-09-19T16:01:29Z", "content": "Load-shedding directly impacts mobile network infrastructure, and, as a result, mobile Internet speeds tend to suffer.\r\nA MyBroadband analysis showed that Vodacom and Telkom customers saw the most si… [+4119 chars]"}, {"source": {"id": null, "name": "Htxt.co.za"}, "author": null, "title": "NASA will test its SLS repair job on Wednesday - Hypertext - htxt.africa", "description": "After two failed launch attempts, NASA is testing its repairs out before firing the SLS at the heavens.", "url": "https://htxt.co.za/2022/09/nasa-will-test-its-sls-repair-job-on-wednesday/", "urlToImage": "https://htxt002.azurewebsites.net/wp-content/uploads/2022/09/plumbing-840835_1920.jpg", "publishedAt": "2022-09-19T13:02:29Z", "content": "<ul><li>Following a failure earlier this month, NASA is ready to test the repairs made to the Space Launch System (SLS).</li><li>The test was originally scheduled for Saturday but was moved for opera… [+2393 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "Alex Shahini", "title": "Lights, camera, Alfa Romeo - 2022 Concorso D'Eleganza Johannesburg - Carmag South Africa", "description": "The lawns of the Modderfontein Bird and Sculpture Park were abuzz with pristine Italian metal wearing the iconic Scudetto on Sunday morning. The 2022 Concorso D’Eleganza also served as a celebration of the 30th anniversary of the Alfa Romeo 155 - here are som…", "url": "https://www.carmag.co.za/news/industry-news/gallery-lights-camera-alfa-romeo-2022-concorso-deleganza-johannesburg/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/09/AR-9.jpg", "publishedAt": "2022-09-19T10:39:01Z", "content": "Alfa Romeo159The lawns of the Modderfontein Bird and Sculpture Park were abuzz with pristine Italian metal wearing the iconic Scudetto on Sunday morning. The 2022 Concorso DEleganza also served as a … [+2546 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Dylan Jack", "title": "Permutations: How Boks can win the Rugby Championship - SARugbymag", "description": "With South Africa and New Zealand tied on overall log points going into the decisive final round of the Rugby Championship, here's how the Springboks can trump the All Blacks to claim the title.", "url": "https://www.sarugbymag.co.za/permutations-boks-can-win-rugby-championship/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/09/Damian-Willemse-Damian-de-Allende-e1662210963845.jpg", "publishedAt": "2022-09-19T09:58:31Z", "content": "With South Africa and New Zealand tied on overall log points going into the decisive final round of the Rugby Championship, here’s how the Springboks can trump the All Blacks to claim the title.\r\nAft… [+2462 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What to expect from South Africa’s interest rate hike this week - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary forces.", "url": "https://businesstech.co.za/news/government/626338/what-to-expect-from-south-africas-interest-rate-hike-this-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-09-19T08:32:10Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary f… [+3057 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "Agence France-Presse", "title": "NASA finds sign of LIFE on Mars - The South African", "description": "Although, organic matter has been found on Mars in the past, never before in areas where conditions of life are supported. Now they have!", "url": "https://www.thesouthafrican.com/technology/space/nasa-finds-signs-of-life-on-mars-science-space-exploration-breaking-18-september-2022/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/09/mars-67522_1280.jpg", "publishedAt": "2022-09-18T15:05:08Z", "content": "NASA’s Perseverance Mars rover has detected its highest concentrations yet of organic molecules, in a potential signal of ancient microbes that scientists are eager to confirm when the rock samples a… [+2462 chars]"}, {"source": {"id": null, "name": "Africa Feeds"}, "author": "Elvis Adjetey", "title": "Ghana declares end of Marburg outbreak - Africa Feeds", "description": "Health officials in Ghana have declared that the recent outbreak of the Marburg virus is now over following no positive case in 42 days. In July, an alert over the outbreak of the highly infectious disease related to Ebola was issued  after two deaths were re…", "url": "https://africafeeds.com/2022/09/18/ghana-declares-end-of-marburg-outbreak/", "urlToImage": "https://africafeeds.com/wp-content/uploads/2022/07/Marburg-Ghana.jpg", "publishedAt": "2022-09-18T11:01:39Z", "content": "Health officials in Ghana have declared that the recent outbreak of the Marburg virus is now over following no positive case in 42 days.\r\nIn July, an alert over the outbreak of the highly infectious … [+1073 chars]"}]}