{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "etimes.in", "title": "Khatron Ke Khiladi 13 premiere date; full contestants list and all the details you need to know before the grand launch - Indiatimes.com", "description": "Khatron Ke Khiladi 13 is all set to premiere this weekend with 14 contestants this season. The show is going to be hosted by Bollywood action director Rohit Shetty. Shot in Cape Town, South Africa, the contestants flew back to India after completing more than…", "url": "https://timesofindia.indiatimes.com/tv/news/hindi/khatron-ke-khiladi-13-premiere-date-full-contestants-list-and-all-the-details-you-need-to-know-before-the-grand-launch/photostory/101748670.cms", "urlToImage": "https://static.toiimg.com/photo/msid-101748527.cms", "publishedAt": "2023-07-14T06:30:00Z", "content": "The contestants, who will be seen this season are: Aishwarya Sharma, Anjali Anand, Anjum Fakih, Archana Gautam, Arjit Taneja, Daisy Shah, Dino James, Nyrraa Banerji, Rashmeet Kaur, Rohit Roy, Ruhi Ch… [+55 chars]"}, {"source": {"id": null, "name": "Transcontinentaltimes.com"}, "author": "Russell Chattaraj", "title": "Frozen History: Traces of the World's Oldest Glaciers Discovered in South Africa - Transcontinental Times", "description": "SOUTH AFRICA: In a groundbreaking discovery, scientists have unearthed traces of the world’s oldest known glaciers, dating back a staggering 2.9 billion years, within rocks beneath South Africa’s abundant gold deposits.  These findings provide compelling evid…", "url": "https://www.transcontinentaltimes.com/frozen-history-traces-glacier/", "urlToImage": "https://www.transcontinentaltimes.com/wp-content/uploads/2023/07/befunky_2023-6-4_14-1-2.jpg", "publishedAt": "2023-07-13T09:00:35Z", "content": "SOUTH AFRICA: In a groundbreaking discovery, scientists have unearthed traces of the world’s oldest known glaciers, dating back a staggering 2.9 billion years, within rocks beneath South Africa’s abu… [+3239 chars]"}]}