{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Alex Mitchley", "title": "Police vow to work nonstop to link 82 arrested suspects to Krugersdorp gang rape - News24", "description": "National Police Commissioner General Fannie Masemola has assured South Africans that investigators are working on linking the 82 arrested men to the multiple rapes of eight young women in Krugersdorp.", "url": "https://www.news24.com/news24/southafrica/news/police-vow-to-work-nonstop-to-link-82-arrested-suspects-to-krugersdorp-gang-rape-20220801", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3539/10e4ce436dbc4efebaf55e87909e66d5.jpeg", "publishedAt": "2022-08-01T13:36:17Z", "content": "<ul><li>On Friday, eight women were gang raped in Krugersdorp while shooting a music video at a mine dump. </li><li>Following the incident, 82 men were arrested, however, none of them are facing char… [+2511 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Yoliswa Sobuwa", "title": "'A quarter of new HIV infections in young women due to gender-based violence' - News24", "description": "Young South African women continue to account for most of new HIV infections in the country.", "url": "https://www.news24.com/citypress/news/a-quarter-of-new-hiv-infections-in-young-women-due-to-gender-based-violence-20220801", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3770/04699f3a8af14695855774d4f33e5d22.jpg", "publishedAt": "2022-08-01T11:56:20Z", "content": "NEWS\r\nYoung South African women continue to account for most of new HIV infections in the country. Speaking at the 24th International Aids Conference in Montreal, Canada, Health Minister Dr Joe Phaah… [+2278 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa Fights Monkeypox Without Vaccines As Death Toll Rises - AllAfrica - Top Africa News", "description": "The vast majority of deaths due to monkeypox have been registered on the African continent. Africa remains the only part of the world with no doses of the vaccine, according to the Africa Centers for Disease Control and Prevention.\n\n\r \n\nThe World Health Organ…", "url": "https://allafrica.com/view/group/main/main/id/00082929.html", "urlToImage": "https://cdn01.allafrica.com/download/pic/main/main/csiid/00610284:10ef538fa7b2f6cdf76d6aa22d381bb3:arc614x376:w1200.jpg", "publishedAt": "2022-08-01T11:08:14Z", "content": "The vast majority of deaths due to monkeypox have been registered on the African continent. Africa remains the only part of the world with no doses of the vaccine, according to the Africa Centers for… [+1246 chars]"}, {"source": {"id": null, "name": "Thesportsgrail.com"}, "author": "TheSportsGrail, Subhankar Panigrahy, Subhankar Panigrahy", "title": "Commonwealth Games (CWG) 2022 Badminton Team Results Today, Semi-Final Day 4 Schedule, Date, Time, Venue, Groups, Standings, India vs Singapore Match, Draw, Points Table, Score, Live Stream - The SportsGrail", "description": "The 2022 Commonwealth Games saw India thrash quarterfinal rivals South Africa in mixed team Badminton but now the competition will be tough as they face Singapo", "url": "https://thesportsgrail.com/commonwealth-games-cwg-2022-badminton-team-results-today-semi-final-day-4-schedule-date-time-venue-groups-standings-india-vs-singapore-match-draw-points-table-score-live-stream/", "urlToImage": "https://thesportsgrail.com/wp-content/uploads/2022/07/Commonwealth-Games-2022-Badminton-stock.jpg", "publishedAt": "2022-08-01T10:04:14Z", "content": "The 2022 Commonwealth Games saw India thrash quarterfinal rivals South Africa in mixed team Badminton but now the competition will be tough as they face Singapore in the final four, we take a look at… [+6632 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s best-performing bank right now is going big on renewable energy - BusinessTech", "description": "Nedbank Group wants to almost double its lending to green energy projects in South Africa over the next two years as it seeks to cement its position as a market leader in funding renewable power projects.", "url": "https://businesstech.co.za/news/banking/612599/south-africas-best-performing-bank-right-now-is-going-big-on-renewable-energy/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/08/MikeBrown-e1533622310884.jpg", "publishedAt": "2022-08-01T08:23:22Z", "content": "Nedbank Group wants to almost double its lending to green energy projects in South Africa over the next two years as it seeks to cement its position as a market leader in funding renewable power proj… [+2605 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "The WHO says we must work together to fight monkeypox. African doctors are skeptical - CBC News", "description": "Even though many Africans have suffered from monkeypox over the last five decades, global health experts worry they still won't have equal access to vaccination or treatment as rich countries scramble to battle their first cases.", "url": "https://www.cbc.ca/news/health/monkeypox-covid-19-vaccines-africa-1.6536517", "urlToImage": "https://i.cbc.ca/1.6536605.1659123319!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/montreal-monkeypox-tourists-20220723.JPG", "publishedAt": "2022-08-01T08:00:00Z", "content": "As an infectious diseases specialist in Atlanta, Dr. Boghuma Kabisen Titanji spent much of 2020 on the front lines of the COVID-19 battle raging in the U.S. \r\nWhen a vaccine arrived in December that … [+6880 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Proposed wealth tax could push South Africans to emigrate, say economists - BusinessTech", "description": "Economist warn that a BIG is unsustainable as it could drive the high tax paying population out of hte country.", "url": "https://businesstech.co.za/news/finance/612471/proposed-wealth-tax-could-push-south-africans-to-emigrate-says-economists/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/Airport2-e1634889403792.jpg", "publishedAt": "2022-08-01T06:37:58Z", "content": "A wealth tax could lead to the reduction of the tax base over time as a small group of affluent South Africans try to prevent a higher tax burden, says the Bureau of Economic Research (BER).\r\nThe ANC… [+3609 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Devin Hermanus", "title": "Blitzboks bag gold in Birmingham - SARugbymag", "description": "South Africa thumped reigning Olympic champions Fiji to win the men's sevens gold medal at the Commonwealth Games in Birmingham on Sunday.", "url": "https://www.sarugbymag.co.za/blitzboks-bag-gold-birmingham/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/07/SelvynDavids-e1659298052929.jpg", "publishedAt": "2022-07-31T20:55:23Z", "content": "South Africa thumped reigning Olympic champions Fiji to win the men’s sevens gold medal at the Commonwealth Games in Birmingham on Sunday.\r\nThe Blitzboks, current World Rugby Sevens Series leaders, o… [+1072 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Adelaide Changole", "title": "Black ownership of South African businesses falls below 30% - News24", "description": "In June, President Cyril Ramaphosa appointed 14 people to a Black economic-empowerment council to address inadequate progress with improving some measures of Black involvement in the economy almost three decades after the end of apartheid", "url": "https://www.news24.com/fin24/economy/black-ownership-of-south-african-businesses-falls-below-30-20220731", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3728/08765ce844d949ec8f64121c2b5be8dd.jpeg", "publishedAt": "2022-07-31T14:30:48Z", "content": "Black ownership of businesses in South Africa dropped 1.5 percentage point to below 30% last year, as Africa’s most industrialised nation struggles to economically empower a larger portion of its pop… [+2205 chars]"}, {"source": {"id": null, "name": "Irish Mirror"}, "author": "Nicola Donnelly", "title": "RTE star Dr Eva Orsmond set to divorce husband as 'spark is gone' - Irish Mirror", "description": "Dr Ava and Wyatt, an engineer from South Africa, previously announced that they had broken up in 2016, but got back together two years later.", "url": "https://www.irishmirror.ie/tv/rte-star-dr-eva-orsmond-27622142", "urlToImage": "https://i2-prod.irishmirror.ie/news/irish-news/article11100451.ece/ALTERNATES/s1200/0_I170901_184135_2565804oTextTRMRMMGLPICT000129372466o.jpg", "publishedAt": "2022-07-31T13:21:20Z", "content": "RTE star Dr Eva Orsmond and her husband Wyatt Orsmond are set to divorce as the spark has gone from their relationship.\r\nThe couple, who are parents to two adult sons, will file for divorce after spl… [+1713 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Miengah Abrahams", "title": "Footprints take science a step closer to understanding southern Africa's dinosaurs - The Conversation", "description": "Fossil footprints are a treasure chest of information.", "url": "https://theconversation.com/footprints-take-science-a-step-closer-to-understanding-southern-africas-dinosaurs-185480", "urlToImage": "https://images.theconversation.com/files/476406/original/file-20220727-1332-rnl1.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-07-31T06:44:32Z", "content": "Dinosaurs have captured peoples imaginations more than any other ancient creatures. These reptiles some large, some small; some carnivores and others herbivores rose and dominated the worlds landscap… [+5905 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Reps protest shunning of Nigerians in ECOWAS recruitment - Punch Newspapers", "description": "Members of the House of Representatives, who are also members of the Economic Community of West African States Parliament, have raised the alarm over alleged non-consideration of Nigerian applicants in the ongoing recruitment by the ECOWAS Commission.", "url": "https://punchng.com/reps-protest-shunning-of-nigerians-in-ecowas-recruitment/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2020/07/12161702/House-of-Reps3.jpg", "publishedAt": "2022-07-31T01:01:47Z", "content": "Members of the House of Representatives, who are also members of the Economic Community of West African States Parliament, have raised the alarm over alleged non-consideration of Nigerian applicants … [+2900 chars]"}]}