{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Rosemary Prevec", "title": "Exquisite new fossils from South Africa offer a glimpse into a thriving ecosystem 266 million years ago - Phys.org", "description": "South Africa is famous for its amazingly rich and diverse fossil record. The country's rocks document more than 3.5 billion years of life on Earth: ancient forms of bacterial life, the emergence of life onto land, the evolution of seed-producing plants, repti…", "url": "https://phys.org/news/2022-11-exquisite-fossils-south-africa-glimpse.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/exquisite-new-fossils.jpg", "publishedAt": "2022-11-22T18:30:01Z", "content": "South Africa is famous for its amazingly rich and diverse fossil record. The country's rocks document more than 3.5 billion years of life on Earth: ancient forms of bacterial life, the emergence of l… [+6543 chars]"}, {"source": {"id": "bbc-news", "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "King Charles welcomes South Africa's Cyril Ramaphosa - in pictures - BBC", "description": "South Africa's Cyril Ramaphosa is welcomed to London as Charles III hosts his first state visit as King.", "url": "https://www.bbc.co.uk/news/in-pictures-63714611", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/59B4/production/_127746922_7061d0319affdb3dc409d9a7dfcbd60d84a209d40_0_2020_30001347x2000.jpg", "publishedAt": "2022-11-22T17:03:22Z", "content": "King Charles and Camilla, the Queen Consort, welcomed Cyril Ramaphosa on Tuesday at the beginning of his two-day visit to the UK. It is the King's first state visit since he ascended the throne in Se… [+1022 chars]"}, {"source": {"id": null, "name": "Capetalk.co.za"}, "author": "Devon  Thomas", "title": "What the diabetes community is doing to get medical aids to fund sensor tech - CapeTalk 567", "description": "The founder and editor of 'Sweet Life', South Africa's largest online diabetes community, Bridget McNulty, has pioneered a campaign to get medical aid schemes to fund sensor technology to test blood glucose in people with type one diabetes.", "url": "https://www.capetalk.co.za/articles/460311/what-the-diabetes-community-is-doing-to-get-medical-aids-to-fund-sensor-tech", "urlToImage": "https://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_290,w_480/qjw3ymkrlhgi8xrav4ju.jpg", "publishedAt": "2022-11-22T15:24:27Z", "content": "The founder and editor of 'Sweet Life', South Africa's largest online diabetes community, Bridget McNulty, has pioneered a campaign to get medical aid schemes to fund sensor technology to test blood … [+1640 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "King Charles welcomes South Africa's Cyril Ramaphosa at start of state visit - BBC", "description": "The monarch formally greets South Africa's president ahead of a series of official events in London.", "url": "https://www.bbc.com/news/uk-63711177", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/5DC4/production/_127740042_fb5bca579a5c8d5f402f8aa7b10bd2f4d338d33e0_81_2907_16351000x563.jpg", "publishedAt": "2022-11-22T13:48:00Z", "content": "The King has welcomed South Africa's president at the start of the first state visit he is hosting as monarch.\r\nKing Charles and Camilla, the Queen Consort, formally greeted Cyril Ramaphosa at Horse … [+4960 chars]"}, {"source": {"id": null, "name": "Auburn Citizen"}, "author": "Faizel Patel", "title": "Ookla: These are the fastest 5G smartphones in South Africa - The Citizen", "description": "Ookla said competition for the fastest popular 5G smartphone was incredibly tight in South Africa during the review period.", "url": "https://www.citizen.co.za/lifestyle/technology/ookla-fastest-5g-smartphones-south-africa/", "urlToImage": "https://media.citizen.co.za/wp-content/uploads/2022/11/Ookla-Speed-Test.jpg", "publishedAt": "2022-11-22T10:44:26Z", "content": "With Black Friday and Cyber Monday just a few days away, Ookla has revealed data to help shoppers navigate deals with hard data on the fastest 5G popular devices.\r\nThe Global fixed broadband and mobi… [+2008 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Kenya: Solar Powered Freezers - a Low Cost but High Impact Strategy Making Critical Vaccines Accessible in Southeast Kenya - AllAfrica - Top Africa News", "description": "Blog - Kamboo, Yindalani and Yiuma Mavui are a set of hard-to-reach villages located 17 and 28 kilometres away from Makindu sub-county hospital and 10 and 22 kilometres away from the nearest electricity grid. As a result of the distance from the sub-county ho…", "url": "https://allafrica.com/stories/202211220121.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-11-22T08:55:20Z", "content": "Kamboo, Yindalani and Yiuma Mavui are a set of hard-to-reach villages located 17 and 28 kilometres away from Makindu sub-county hospital and 10 and 22 kilometres away from the nearest electricity gri… [+8825 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa at risk of a total blackout: expert - BusinessTech", "description": "Energy expert Professor Anton Eberhard warns that Eskom’s diesel problems increase the risk of a system failure.", "url": "https://businesstech.co.za/news/energy/645013/south-africa-at-risk-of-a-total-blackout-expert/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Eskom-load-shedding.png", "publishedAt": "2022-11-22T06:39:41Z", "content": "Energy expert Professor Anton Eberhard has warned that Eskoms decision not to refuel its diesel open cycle gas turbines (OCGTs) increases the risk of a system failure.\r\nEberhard is the director of Po… [+3287 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Ed Stoddard", "title": "ECONOMIC OUTLOOK: SA Reserve Bank set to pull the trigger again, taking the prime lending rate back above 10% - Daily Maverick", "description": "The South African Reserve Bank is set to raise its key repo rate again this week, with most economists forecasting a hike of at least 75 basis points. This will take the prime lending rate to 10.5%. As policy ‘normalisation’ continues apace in the US and else…", "url": "https://www.dailymaverick.co.za/article/2022-11-21-sa-reserve-bank-set-to-pull-the-trigger-again-taking-the-prime-lending-rate-back-above-10/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/11/iStock-1388212203.jpg?w=1280", "publishedAt": "2022-11-21T19:31:00Z", "content": "The SA Reserve Banks Monetary Policy Committee (MPC) will deliver another big rate hike on Thursday, 24 November, when its last scheduled three-day meeting for 2022 wraps up. \r\nThe SA Reserve Bank is… [+3838 chars]"}]}