{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Sesona Ngqakamba", "title": "Don't use ivermectin to treat Covid-19 - Sahpra says its stance is aligned with the US' FDA - News24", "description": "The South African Health Products Regulatory Authority has once again warned the public against the use of ivermectin, saying it remains aligned to America's FDA when it comes to the use of the drug.", "url": "https://www.news24.com/news24/southafrica/news/dont-use-it-sahpra-says-its-stance-on-ivermectin-is-aligned-with-the-us-fda-20210903", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11148/4ee769e04a9e4101837dfd746405aa28.jpg", "publishedAt": "2021-09-03T11:43:15Z", "content": "<ul><li>Sahpra says it remains aligned to America's Food and Drug Administration (FDA) when it comes to the use of ivermectin.</li><li>The authority has warned people to refrain from buying drugs fro… [+2127 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Agency Report", "title": "COVID-19: African Countries To Miss Crucial Sept Vaccination Goal – WHO official - LEADERSHIP NEWS", "description": "Africa is likely to miss the urgent global goal of vaccinating the most vulnerable 10 per cent of each country’s population against the Coronavirus Africa is likely to miss the urgent global goal of vaccinating the most vulnerable 10 per cent of each country’…", "url": "https://leadership.ng/covid-19-african-countries-to-miss-crucial-sept-vaccination-goal-who-official/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/03/covid-19-vaccination.jpg", "publishedAt": "2021-09-03T11:42:55Z", "content": "Africa is likely to miss the urgent global goal of vaccinating the most vulnerable 10 per cent of each countrys population against the Coronavirus (COVID-19) by the end of September, according to the… [+3252 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Government will start ‘rewarding’ South Africans for being vaccinated – including reopening sports and events - BusinessTech", "description": "Government is currently discussing the introduction of further initiatives to encourage people to get vaccinated, with these set to be finalised over the next week, says health minister Joe Phaahla.", "url": "https://businesstech.co.za/news/lifestyle/518248/government-will-start-rewarding-south-africans-for-being-vaccinated-including-reopening-sports-and-events/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/Joe-Phaahla.png", "publishedAt": "2021-09-03T08:48:45Z", "content": "The government is currently discussing introducing initiatives to encourage people to get vaccinated, with these set to be finalised over the next week, says health minister Joe Phaahla.\r\nWhile this … [+2647 chars]"}, {"source": {"id": null, "name": "TechCentral"}, "author": "Loni Prinsloo", "title": "Operators in race against time to reach spectrum agreement - TechCentral", "description": "South African telecommunication companies are trying to settle a wireless spectrum auction dispute with the industry regulator out of court to avoid a prolonged legal battle.", "url": "https://techcentral.co.za/operators-in-race-against-time-to-reach-spectrum-agreement/110868/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2020/08/ralph-mupita-2156-1120-4.jpg", "publishedAt": "2021-09-03T06:20:08Z", "content": "MTN Group CEO Ralph Mupita\r\nSouth African telecommunication companies are trying to settle a wireless spectrum auction dispute with the industry regulator out of court to avoid a prolonged legal batt… [+2170 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Mandatory vaccination policies already seeing some backlash; the EU is returning millions of vaccine doses so they can be redistributed in Africa; parliament says its close to finalising land expropriation changes; DA federal chair Helen Zille comes under fir…", "url": "https://businesstech.co.za/news/government/518168/5-important-things-happening-in-south-africa-today-1116/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/Covid-vaccine.png", "publishedAt": "2021-09-03T06:12:52Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 9,203 new cases of Covid-19, taking the total reported to 2,796,405. Deaths have reached 8… [+3227 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "EU to return J&J vaccines made in South Africa - Eyewitness News", "description": "The announcement followed a meeting in Berlin between South African President Cyril Ramaphosa and European Commission President Ursula Von der Leyen, he said, adding that the first supplies were expected this month.", "url": "https://ewn.co.za/2021/09/03/eu-to-return-j-and-j-vaccines-made-in-africa", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/kdxobtbdcamajjyodrhk", "publishedAt": "2021-09-03T05:24:16Z", "content": "The announcement followed a meeting in Berlin between South African President Cyril Ramaphosa and European Commission President Ursula Von der Leyen, he said, adding that the first supplies were expe… [+1795 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "Bafana Bafana starting XI prediction: Zimbabwe vs South Africa 3 September - The South African", "description": "This is how we expect Bafana Bafana will line up against Zimbabwe in the first match of their 2022 Fifa World Cup qualifying campaign.", "url": "https://www.thesouthafrican.com/sport/soccer/bafana-bafana/bafana-bafana-starting-xi-prediction-zimbabwe-vs-south-africa-3-september-2021-fifa-world-cup-qualifiers/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/09/Bafana-Bafana.jpg", "publishedAt": "2021-09-03T03:55:06Z", "content": "Bafana Bafana kick off their Fifa World Cup 2022 qualifying campaign against Zimbabwe in Harare on Friday 3 September.\r\nHere we predict how Bafana Bafana could line up against their neighbours and ri… [+3060 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jeanette Chabalala", "title": "One South African remains in Kabul, 35 have left on various evacuation flights - Dirco - News24", "description": "There is one remaining South African in Kabul and the person will remain there for the foreseeable future, says the Department of International Relations and Cooperation.", "url": "https://www.news24.com/news24/southafrica/news/one-south-african-remains-in-kabul-35-have-left-on-various-evacuation-flights-dirco-20210902", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11416/08ec1217a56046e3aa76fcce03532ed1.jpg", "publishedAt": "2021-09-02T11:29:43Z", "content": "Only one registered South African remains in Kabul, according to the Department of International Relations and Cooperation (Dirco).\r\nIn a statement on Thursday morning, the department said 35 South A… [+1207 chars]"}]}