{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "TechCentral"}, "author": "Huawei", "title": "Four African apps win in Huawei’s Apps UP 2021 competition - TechCentral", "description": "Coresthetics walked away with one of the Best App Awards in the Middle East and Africa, along with $15 000 in prize money.", "url": "https://techcentral.co.za/four-african-apps-win-in-huaweis-apps-up-2021-competition-huaprom/203913/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2021/10/huawei-appsup-2021-2156-1120.jpg", "publishedAt": "2021-10-25T09:45:01Z", "content": "Huawei has announced the winners of the 2021 edition of the Huawei HMS App Innovation Contest (Apps UP), with four African apps being recognised and celebrated. Coresthetics walked away with one of t… [+4414 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "William Ukpe", "title": "Presidency replies The Economist, says Buhari administration is strengthening Africa’s democracy - Nairametrics", "description": "President Muhammadu Buhari’s office has responded to the recent The Economist cover titled, \"Nigeria: the Crime Scene at the Heart", "url": "https://nairametrics.com/2021/10/25/presidency-replies-the-economist-says-buhari-administration-is-strengthening-africas-democracy/", "urlToImage": "https://i0.wp.com/nairametrics-prod-s3.s3.eu-west-2.amazonaws.com/wp-content/uploads/2021/09/21110812/President-Buhari-1.jpg?fit=900%2C600&ssl=1", "publishedAt": "2021-10-25T09:00:04Z", "content": "President Muhammadu Buharis office has responded to the recent The Economist cover titled, “Nigeria: the Crime Scene at the Heart of Africa, stating that it is has sought to push back terrorism which… [+7241 chars]"}, {"source": {"id": null, "name": "Sabcnews.com"}, "author": "Paballo Lephaka", "title": "Namibia to suspend use of Russian COVID-19 vaccine - ministry - SABC News", "description": "Namibia will suspend its rollout of Russia's Sputnik V COVID-19 vaccine, its health ministry said on Saturday, days after the drugs regulator in neighbouring South Africa flagged concerns about its safety for people at risk of HIV.", "url": "https://www.sabcnews.com/sabcnews/namibia-to-suspend-use-of-russian-covid-19-vaccine-ministry/", "urlToImage": "https://www.sabcnews.com/sabcnews/wp-content/uploads/2021/10/Sputnik-V-Vaccine-Reuters-2.png", "publishedAt": "2021-10-25T08:01:32Z", "content": "Namibia will suspend its rollout of Russia’s Sputnik V COVID-19 vaccine, its health ministry said on Saturday, days after the drugs regulator in neighbouring South Africa flagged concerns about its s… [+1937 chars]"}, {"source": {"id": null, "name": "Pulse Nigeria"}, "author": "Pulse Mix", "title": "Hanu Fejiro Agbodje puts Africa in the spotlight, selected for the Amplify 2021 program and to be recognized by Money20/20 - Pulse Nigeria", "description": "One of Africa’s young, future-forward entrepreneurs and tech founders, Hanu Fejiro Agbodje Founder and CEO of Patricia Technologies has been listed among 15 innovative individuals on the inaugural AMPLIFY 2021 program", "url": "https://www.pulse.ng/business/hanu-fejiro-agbodje-puts-africa-in-the-spotlight-selected-for-the-amplify-2021/883y886#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/Fg8ktkpTURBXy8yNjk3ZGNlMDE1NTFmYjY1MzJmYTA4MWJlNmM3MTMyMi5wbmeSlQMSAM0B3M0BDJMFzQSwzQJ2", "publishedAt": "2021-10-25T07:25:44Z", "content": "Hanu, the only African in the 2021 cohort, was listed alongside Ambika Sharma of U.S Bank and Chris Lavato Founder of SOON. The lineup includes the biggest minds and brightest innovators within their… [+1669 chars]"}, {"source": {"id": null, "name": "Fortress of Solitude"}, "author": "https://www.facebook.com/evan.saunders.za", "title": "Xiaomi 11T Pro Officially Launches in South Africa - Fortress of Solitude", "description": "Following weeks of teasing ahead of Xiaomi's virtual event on Facebook, the wait is finally over. The brand has officially launched the all-new Xiaomi 11T", "url": "https://www.fortressofsolitude.co.za/xiaomi-11t-pro-launches-south-africa/", "urlToImage": "https://www.fortressofsolitude.co.za/wp-content/uploads/2021/10/Xiaomi-11T-Pro-01.jpg", "publishedAt": "2021-10-25T07:21:30Z", "content": "Following weeks of teasing ahead of Xiaomi’s virtual event on Facebook, the wait is finally over. The brand has officially launched the all-new Xiaomi 11T Pro.\r\nThe Xiaomi 11T Pro is coming to South … [+2039 chars]"}, {"source": {"id": null, "name": "Nairametrics"}, "author": "Ubah Jeremiah Ifeanyi", "title": "As the eNaira debuts today, here are some reasons you should use the digital currency - Nairametrics", "description": "The fourth industrial revolution has ushered in Africa's first Central Bank Digital Currency (CBDC), the eNaira, set to be launched", "url": "https://nairametrics.com/2021/10/25/enaira-is-set-to-debut-today-here-are-some-reasons-why-you-should-use-the-enaira/", "urlToImage": "https://i0.wp.com/nairametrics-prod-s3.s3.eu-west-2.amazonaws.com/wp-content/uploads/2021/10/01163336/CBN-eNaira.jpg?fit=705%2C401&ssl=1", "publishedAt": "2021-10-25T06:59:54Z", "content": "The fourth industrial revolution has ushered in Africa’s first Central Bank Digital Currency (CBDC), the eNaira, set to be launched by Nigeria. The eNaira is posed to benefit the everyday Nigerians a… [+3683 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Businesses head to court for clarity on mandatory Covid-19 vaccines in South Africa: report - BusinessTech", "description": "Organised business group Business Unity South Africa (BUSA) will approach the High Court for clarity on introducing mandatory Covid-19 vaccinations at businesses in South Africa.", "url": "https://businesstech.co.za/news/business/531666/businesses-head-to-court-for-clarity-on-mandatory-covid-19-vaccines-in-south-africa-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/05/Open-e1526034875521.jpeg", "publishedAt": "2021-10-25T06:45:07Z", "content": "Organised business group Business Unity South Africa (BUSA) says it will approach the High Court for clarity on introducing mandatory Covid-19 vaccinations at businesses in South Africa.\r\nBUSA will a… [+2177 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Updated level 1 lockdown rules for schools and travel in South Africa - BusinessTech", "description": "Government has gazetted updated lockdown regulations for South Africa’s adjusted level 1 lockdown, including changes for schools and transport.", "url": "https://businesstech.co.za/news/government/531626/updated-level-1-lockdown-rules-for-schools-and-travel-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/03/South-Africa-lockdown.png", "publishedAt": "2021-10-25T06:35:16Z", "content": "The government has gazetted updated regulations for South Africa’s adjusted level 1 lockdown, including changes for schools and transport.\r\nThe changes include the relaxation of restrictions for air … [+3981 chars]"}, {"source": {"id": null, "name": "Vanguard"}, "author": null, "title": "AWCON 2022 Qualifiers: Super Falcons qualify for final round despite loss to Ghana - Vanguard", "description": "Nigeria's Super Falcons have qualified for the final round of 2o22 Africa Women's Cup of Nations despite suffering a narrow 1-0 loss to...", "url": "https://www.vanguardngr.com/2021/10/awcon-2022-qualifiers-super-falcons-qualify-for-final-round-despite-loss-to-ghana/", "urlToImage": "https://cdn.vanguardngr.com/wp-content/uploads/2021/10/Super-Falcons-Ghana.jpg", "publishedAt": "2021-10-24T22:08:49Z", "content": "PHOTO CREDIT | Goal\r\nBy Emmanuel Okogba\r\nNigeria’s Super Falcons have qualified for the final round of 2o22 Africa Women’s Cup of Nations despite suffering a narrow 1-0 loss to Ghana on Sunday.\r\nNige… [+744 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Some Young Nigerians Say Heavy Drinking Is Fun - Controls Must Keep Pace With Culture - AllAfrica.com", "description": "Analysis - Alcohol consumption has a long history in Nigeria, especially in the southern region, where it was not forbidden by religion. In the past, only adult men were culturally allowed to drink. It was taboo for young people to drink alcohol because it wa…", "url": "https://allafrica.com/stories/202110240040.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-10-24T14:50:23Z", "content": "Alcohol consumption has a long history in Nigeria, especially in the southern region, where it was not forbidden by religion. In the past, only adult men were culturally allowed to drink. It was tabo… [+6093 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "– Recep Tayyip Erdogan's Tour of AfricaTHISDAYLIVE - THISDAY Newspapers", "description": "Turkey`s President Recep Tayyip Erdogan recently embarked on a tour of Africa where he too k in visits to Angola, Togo and Nigeria. It was no coincidence that Mr. Erdogan chose to travel to Angola,…", "url": "https://www.thisdaylive.com/index.php/2021/10/24/recep-tayyip-erdogans-tour-of-africa/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/22e4f755-recep-tayyip-erdogan.jpg", "publishedAt": "2021-10-24T01:43:04Z", "content": "Turkey`s President Recep Tayyip Erdogan recently embarked on a tour of Africa where he too k in visits to Angola, Togo and Nigeria. It was no coincidence that Mr. Erdogan chose to travel to Angola, T… [+6117 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Poloko Tau", "title": "COP26: SA to call for developed countries to financially help with climate crisis | Citypress - News24", "description": "South Africa will use its presence at the 26th Conference of the Parties, commonly known as COP26, in the UK at the end of this month to emphasise the importance of sustainable finance by developed to developing countries to enable them to set themselves up i…", "url": "https://www.news24.com/citypress/news/cop26-sa-to-call-for-developed-countries-to-financially-help-with-climate-crisis-20211024", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8030/a0aac8144a32478792485b96bba012a5.jpg", "publishedAt": "2021-10-24T00:12:05Z", "content": null}, {"source": {"id": null, "name": "CNBCAfrica.com"}, "author": null, "title": "How BioNTech Used Cancer Research To Create Its Covid Vaccine - CNBCAfrica.com", "description": "Over a month and a half before the World Health Organization officially declared a pandemic, BioNTech CEO Uğur Şahin met with his wife, BioNTech’s co-founder and chief medical officer Özlem Türeci, and together they agreed to redirect most of the company’s re…", "url": "https://www.cnbcafrica.com/2021/how-biontech-used-cancer-research-to-create-its-covid-vaccine/", "urlToImage": "https://cms.cnbcafrica.com/wp-content/uploads/2021/10/hqdefault-61.jpg", "publishedAt": "2021-10-23T21:00:01Z", "content": "Over a month and a half before the World Health Organization officially declared a pandemic, BioNTech CEO Uur ahin met with his wife, BioNTechs co-founder and chief medical officer Özlem Türeci, and … [+686 chars]"}]}