{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Outbreak News Today"}, "author": null, "title": "South Africa reports 397 measles cases since October - Outbreak News Today - Outbreak News Today", "description": "NewsDesk @bactiman63 Since the beginning of October 2022, the South Africa National Institute of Communicable Diseases (NICD) reports 397 laboratory-confirmed measles cases. Declared measles outbreaks have been reported in Limpopo (145 cases), Mpumalanga (79 …", "url": "http://outbreaknewstoday.com/south-africa-reports-397-measles-cases-since-october-31276/", "urlToImage": "http://outbreaknewstoday.com/wp-content/uploads/2016/06/measles-648479_640.jpg", "publishedAt": "2023-01-19T00:13:18Z", "content": "NewsDesk @bactiman63\r\nSince the beginning of October 2022, the South Africa National Institute of Communicable Diseases (NICD) reports 397 laboratory-confirmed measles cases.\r\nImage/geralt\r\nDeclared … [+448 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mariam Isa and Chris Yelland", "title": "ENERGY EMERGENCY OP-ED: Hand-to-Mouth: South Africa's power lifeline frays as Eskom scrambles for diesel - Daily Maverick", "description": "Eskom is struggling in its efforts to obtain the diesel needed to continue running its open-cycle gas turbines which, in the face of prolonged power generation outages, is the only way the utility can stave off severe and ongoing curtailment of South Africa’s…", "url": "https://www.dailymaverick.co.za/article/2023-01-18-hand-to-mouth-south-africas-power-lifeline-frays-as-eskom-scrambles-for-diesel/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2023/01/IsaYelland-SA-power-lifeline-frays-2.jpg?w=1280", "publishedAt": "2023-01-18T21:57:19Z", "content": "In the past two years, Eskom has been forced to rely increasingly on the open-cycle gas turbines (OCGTs) which were intended only for dire emergencies or use during peak demand periods because of a s… [+8278 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Carin Smith", "title": "SAB objects to Heineken's takeover of Distell, wants Hunter's or Savanna to be sold off - News24", "description": "Anheuser-Busch InBev, the parent company of South African Breweries (SAB), is the only party objecting to a proposed takeover by Dutch giant Heineken of parts of South Africa's largest alcohol producer Distell.", "url": "https://www.news24.com/fin24/companies/sab-objects-to-heinekens-takeover-of-distell-wants-hunters-or-savanna-to-be-sold-off-20230118", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8685/124806a88561449b9cd3521fa86f9121.jpg", "publishedAt": "2023-01-18T17:33:08Z", "content": "<ul><li>The Competition Tribunal is hearing the case for and against the proposed takeover by Heineken of Distell.</li><li>In September the Competition Commission conditionally recommended the approv… [+3670 chars]"}, {"source": {"id": null, "name": "African.business"}, "author": "apofeed", "title": "Implementing the African Continental Free Trade Area (AfCFTA) Agreement will boost intra-African trade and industrialization - African Business", "description": "Download logoThe implementation of the African Continental Free Trade Area (AfCFTA) should be expedited as the free trade zone will boost intra-African", "url": "https://african.business/2023/01/apo-newsfeed/implementing-the-african-continental-free-trade-area-afcfta-agreement-will-boost-intra-african-trade-and-industrialization/", "urlToImage": "https://www.africa-newsroom.com/files/large/272b7e64d260a08", "publishedAt": "2023-01-18T12:21:06Z", "content": "Download logoThe implementation of the African Continental Free Trade Area (AfCFTA) should be expedited as the free trade zone will boost intra-African trade and accelerate industrialization, the Eco… [+4783 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s energy crisis becoming an everything crisis - BusinessTech", "description": "Water and food supplies under threat, as businesses and households buckle under the pressure of load shedding.", "url": "https://businesstech.co.za/news/business/657403/south-africas-energy-crisis-becoming-an-everything-crisis/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/Cyril-Ramaphosa-08.png", "publishedAt": "2023-01-18T12:18:06Z", "content": "The most severe power cuts ever experienced in South Africa are threatening food and water supplies and disrupting the lives of millions of people, including chicken farmers.\r\nIn the poultry industry… [+4686 chars]"}, {"source": {"id": null, "name": "Business Day"}, "author": "Natasha Marrian", "title": "ANC in the spotlight as Eskom fails - BusinessLIVE", "description": "The failure of South Africa’s power utility is very much the failure of the ruling ANC. That may come back to bite it in 2024", "url": "https://www.businesslive.co.za/fm/features/2023-01-18-the-ancs-eskom-hypocrisy/", "urlToImage": "https://lh3.googleusercontent.com/1gwft41Y-dboqvmj2hDvwE7vfffdmaaUWmKmwdMWAnnH-vNCNhjy_eIq7t2czGt146ujHWGqzLtT4qZERvoIqo-oonsH3LFUZ6x5P3qDfioG6G4=s1000", "publishedAt": "2023-01-18T10:29:04Z", "content": "power crisis\r\nThe failure of South Africas power utility is very much the failure of the ruling ANC. That may come back to bite it in 2024\r\n 18 January 2023 - 12:29 Natasha Marrian\r\nIn 2011, South Af… [+335 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "Garrin Lambley", "title": "Petrol and diesel update: Price forecast UGLY for February - The South African", "description": "It's too early to predict what lies ahead for diesel and petrol prices in February, but the latest data suggests bad news lies ahead.", "url": "https://www.thesouthafrican.com/news/petrol-diesel-update-price-forecast-ugly-for-february-2023-breaking/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/07/Petrol-pump-and-money.jpg", "publishedAt": "2023-01-18T07:30:00Z", "content": "With just under three weeks to go, it’s too early to predict what lies ahead for diesel and petrol prices in February, but the latest data available from the Central Energy Fund (CEF) isn’t looking g… [+3247 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sean Christie", "title": "A mezuzah, a Christmas wreath and rooibos with milk: Get to know this NICD couple at home - News24", "description": "Anne von Gottberg and Cheryl Cohen are two of South Africa’s foremost scientists. We’ve got them and their colleagues to thank for the country’s world class surveillance of SARS-CoV-2. Bhekisisa's Sean Christie visited them at their Parktown home and talked s…", "url": "https://www.news24.com/news24/health/a-mezuzah-a-christmas-wreath-and-rooibos-with-milk-get-to-know-this-nicd-couple-at-home-20230118", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8072/82b24dccea9241508ba96c219602e3a9.jpg", "publishedAt": "2023-01-18T05:14:35Z", "content": "<ul><li>Anne von Gottberg and Cheryl Cohen are two of South Africa’s foremost scientists. We’ve got them and their colleagues to thank for the country’s world class surveillance of SARS-CoV-2.</li><l… [+13049 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How fees at South Africa’s most expensive private schools have changed in the last 10 years - BusinessTech", "description": "This is how much private schools have increased their tuition fees over the past decade, with one increasing by as much as 90%.", "url": "https://businesstech.co.za/news/lifestyle/656507/how-fees-at-south-africas-most-expensive-private-schools-have-changed-in-the-last-10-years/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/Private-school.jpg", "publishedAt": "2023-01-17T15:10:12Z", "content": "Private schools in South Africa have hiked fees for 2023, with nine out of the top 10 now charging more than R300,000 a year for boarding and tuition.\r\nHistorically, Hilton College has been the most … [+7040 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "SALT discovers new hot white dwarf and pre-white dwarf stars - Phys.org", "description": "Using the Southern African Large Telescope (SALT), an international team of astronomers has discovered eight new very hot white dwarf and pre-white dwarf stars with effective temperatures over 100,000 K. The finding is reported in a paper published in the Mon…", "url": "https://phys.org/news/2023-01-salt-hot-white-dwarf-pre-white.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/salt-discovers-new-hot.jpg", "publishedAt": "2023-01-17T15:10:01Z", "content": "Using the Southern African Large Telescope (SALT), an international team of astronomers has discovered eight new very hot white dwarf and pre-white dwarf stars with effective temperatures over 100,00… [+3303 chars]"}, {"source": {"id": null, "name": "Defenceweb.co.za"}, "author": "Kim Helfrich", "title": "Top achievement award for MeerKAT team - defenceWeb", "description": "The Royal Astronomical Society’s (RAS’s) 2023 group achievement award winner is South Africa’s MeerKAT team. In its citation, RAS recognised the MeerKAT team “for a series of spectacular observations in radio astronomy, the highlight being the images of the G…", "url": "https://www.defenceweb.co.za/aerospace/aerospace-aerospace/top-achievement-award-for-meerkat-team/", "urlToImage": "https://www.defenceweb.co.za/wp-content/uploads/joint/science-a-defence-technology/MeerKAT_array.jpg", "publishedAt": "2023-01-17T12:31:02Z", "content": "The Royal Astronomical Societys (RASs) 2023 group achievement award winner is South Africas MeerKAT team.\r\nIn its citation, RAS recognised the MeerKAT team for a series of spectacular observations in… [+1961 chars]"}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Rorisang Moyo", "title": "South Africa Meerkat Radio Telescope Team Receives International Esteemed Award - Space in Africa", "description": "South Africa’s Meerkat Radio Telescope team has been recognised by the Royal Astronomical Society (RAS) for its series of spectacular observations in", "url": "https://africanews.space/south-africa-meerkat-radio-telescope-team-receives-international-esteemed-award/", "urlToImage": "https://africanews.space/wp-content/uploads/2023/01/2018-MeerKAT-1_small-1500x811-1.jpg", "publishedAt": "2023-01-17T11:32:16Z", "content": "South Africas Meerkat Radio Telescope team has been recognised by the Royal Astronomical Society (RAS) for its series of spectacular observations in radio astronomy. Notable works included images of … [+1409 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Global report raises red flags over corruption and failing rule of law in South Africa - BusinessTech", "description": "Recent data from the latest Human Rights Watch World Report for 2023 shows that social and economic goals are lagging behind.", "url": "https://businesstech.co.za/news/finance/656777/global-report-raises-red-flags-over-corruption-and-failing-rule-of-law-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Cyril-SAPS-Police-Officers--e1673936055427.jpg", "publishedAt": "2023-01-17T08:41:55Z", "content": "South Africa is failing to realise its economic and social rights due to increasing inequality and unemployment, exacerbated by widespread corruption and fallout from the pandemic, says Human Rights … [+5204 chars]"}]}