{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "South Africa vs Australia Semi-Final Live Score Updates, World Cup 2023: Mitchell Starc, Josh Inglis Capitalise On SA's Mistakes, To Win They Need... - NDTV Sports", "description": "SA vs AUS Semi Final Highlights, World Cup 2023: Australia registered a hard-fought victory over South Africa to set a final date with India.", "url": "https://sports.ndtv.com/cricket/south-africa-vs-australia-semi-final-live-updates-world-cup-2023-4578252", "urlToImage": "https://c.ndtvimg.com/2023-10/0lmko05_rohit-cummins-afp_625x300_08_October_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-11-16T16:04:00Z", "content": "SA vs AUS, World Cup 2023 Semi-Final, Highlights: Australia registered a hard-fought win over South Africa to enter the final of Cricket World Cup for a record-extending eighth time on Thursday. Need… [+504 chars]"}, {"source": {"id": null, "name": "Psuwatch.com"}, "author": "PTI", "title": "Merck Foundation Marks World Diabetes Day 2023 by Releasing Sugar Free Jude and Mark’s Pressure the First Animation Films About Diabetes and Hypertension Awareness - PSU Watch", "description": "Mumbai, Maharashtra, India & Accra, Ghana – Business Wire India     •  Merck Foundation in partnership with Africa’s First Ladies and Ministries of Health provided more than 750 scholarships of one-year Post-Graduate Diploma and two-year Master Degree in Diab…", "url": "https://psuwatch.com/newsupdates/press-release/merck-foundation", "urlToImage": "https://gumlet.assettype.com/psuwatch/2023-01/c6a3b929-2a08-4390-9555-705e71eba584/PSUWatch_logo.png", "publishedAt": "2023-11-16T05:46:26Z", "content": "Mumbai, Maharashtra, India &amp; Accra, Ghana Business Wire India Merck Foundation in partnership with Africas First Ladies and Ministries of Health provided more than 750 scholarships of one-year Po… [+9780 chars]"}]}