{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Premium Times"}, "author": "Agency Report", "title": "World TB Day: 36% of TB deaths occur in Africa, says WHO - Premium Times", "description": "The official said that the UN High-Level world leaders had agreed to mobilise 13 billion dollars per year to finance TB prevention and treatment by 2022.", "url": "https://www.premiumtimesng.com/news/headlines/519267-world-tb-day-36-of-tb-deaths-occur-in-africa-says-who.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2020/07/UDUTH.jpg", "publishedAt": "2022-03-24T07:03:10Z", "content": "The World Health Organisation (WHO) has expressed concern that with 36 per cent of all tuberculosis (TB) deaths occurring in Africa, failure to invest in its response will take a formidable toll on A… [+3802 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lameez Omarjee", "title": "Mantashe gushes on gas: 'It will save us from importing' - News24", "description": "Discoveries of domestic gas resources will save South Africa the trouble of importing the resource, says Mineral Resources and Energy Minister Gwede Mantashe.", "url": "https://www.news24.com/fin24/economy/mantashe-gushes-on-gas-it-will-save-us-from-importing-20220324", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10502/d7a72632dd294cfb8ceab5f4f4a1b75f.jpg", "publishedAt": "2022-03-24T03:25:04Z", "content": "<ul><li>Energy Minister Gwede Mantashe is \"enthused\" by the prospect of gas discoveries, as it will attract foreign investment.</li><li>The gas industry, which is currently being developed, will supp… [+2165 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "Parliament distances itself from resolution condemning Russia's invasion of Ukraine - News24", "description": "A delegation from the South African Parliament has distanced itself from an international resolution stating that \"the ongoing Russian use of force against Ukraine is a violation of the Charter of the United Nations, including the principle of sovereignty and…", "url": "https://www.news24.com/news24/southafrica/news/parliament-distances-itself-from-resolution-condemning-russias-invasion-of-ukraine-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1623/ad2e3b0f26a14c1a8c53da0ee0e11934.jpg", "publishedAt": "2022-03-23T17:13:57Z", "content": "<ul><li>South Africa has distanced itself from a resolution condemning Russia's use of force against Ukraine. </li><li>South Africa's delegation to the Inter-Parliamentary Union was one of nine count… [+5663 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khanyiso Tshwaku", "title": "Tamim, Taskin combine to roll SA, claim historic series win as hosts ponder World Cup issues - News24", "description": "South Africa's automatic path to the 2023 Cricket World Cup hasn't just hit an obstacle, but has firmly run aground after their nine-wicket loss to Bangladesh in the third ODI at SuperSport Park on Wednesday.", "url": "https://www.news24.com/sport/cricket/proteas/tamim-taskin-combine-to-roll-sa-claim-historic-series-win-as-hosts-ponder-world-cup-issues-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1607/e3ef63563977449891742ab8ffecd8e9.jpg", "publishedAt": "2022-03-23T16:29:22Z", "content": "<ul><li>South Africa's World Cup qualification path is in tatters after their embarrassing nine-wicket loss to Bangladesh at SuperSport Park on Wednesday.</li><li>South Africa remains ninth on the lo… [+4049 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Victoria O'Regan", "title": "Ramaphosa's relaxed Covid rules met with relief, but... - Daily Maverick", "description": "The further easing of lockdown regulations on Tuesday has been broadly welcomed, but proposed new regulations recently released under the National Health Act are raising concern. Meanwhile, South Africa recorded 912 new Covid-19 infections on Tuesday.", "url": "https://www.dailymaverick.co.za/article/2022-03-23-relief-over-ramaphosas-relaxed-covid-rules-but-proposed-new-health-regulations-sharply-criticised/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/OD-Pushback-CR-covid1.jpeg?w=1280", "publishedAt": "2022-03-23T12:11:13Z", "content": "While President Cyril Ramaphosas address on Tuesday when he announced changes to some lockdown restrictions, including new rules on the size of gatherings, travel requirements and masks has been some… [+7580 chars]"}, {"source": {"id": null, "name": "Tatler"}, "author": "Annabel Sampson", "title": "Modern magic: Yinka Shonibare breathes new life into sketch as he brings his art to the gallery restaurant - Tatler", "description": "Shonibare’s sketch – a collaboration with India Mahdavi – is a scintillating, copper-hued celebration of African culture and its legacy", "url": "https://www.tatler.com/article/sketch-restaurant-yinka-shonibare-india-mahdavi", "urlToImage": "https://media.tatler.com/photos/622f6dc81de4ad23c0ed5eb8/16:9/w_1280,c_limit/Sketch_140322_Modern%20Magic%20by%20Yinka%20Shonibare%20CBE%20at%20the%20Gallery,%20sketch%20designed%20by%20India%20Mahdavi%20%C2%A9%20Edmund%20Dabney%20(3).jpg", "publishedAt": "2022-03-23T11:15:00Z", "content": "Edmund Dabney\r\nSketch has moved out of its angsty teens  the Conduit Street stalwart has, this year, turned 20. Can you believe it? Well, yes, it almost feels like the one time wünderkind has been ar… [+1622 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Qaanitah Hunter", "title": "SA's Constitution in the crosshairs of ANC proxy war - News24", "description": "The ANC is gearing up for a bruising debate in the run-up to its elective conference about whether or not South Africa should be a constitutional or parliamentary democracy.", "url": "https://www.news24.com/news24/southafrica/news/sas-constitution-in-the-crosshairs-of-anc-proxy-war-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11659/b04aaab80ba94302940dfc82e03c7faa.jpg", "publishedAt": "2022-03-23T03:03:31Z", "content": "The ANC is gearing up for a bruising debate in the run-up to its elective conference about whether or not South Africa should be governed through a constitutional democracy. \r\nMonths after Minister L… [+259 chars]"}, {"source": {"id": null, "name": "India TV News"}, "author": "Health Desk", "title": "Malaria Breakthrough! Know symptoms, treatment, prevention and control of mosquito caused disease - India TV News", "description": "Although there is no specific vaccine for Malaria, in 2021, the World Health Organization (WHO) recommended widespread use of the RTS,S/AS01 (RTS,S) malaria vaccine among children in sub-Saharan Africa and in other regions with moderate to high P. falciparum …", "url": "https://www.indiatvnews.com/health/malaria-know-symptoms-treatment-prevention-and-control-of-mosquito-caused-disease-2022-03-22-765461", "urlToImage": "https://resize.indiatvnews.com/en/resize/newbucket/715_-/2022/03/pjimage-12-1647950860.jpg", "publishedAt": "2022-03-22T12:08:16Z", "content": "Summers are back and so are the mosquitoes and Malaria! One of the most dangerous diseases, it is typically transmitted through the bite of an infected Anopheles mosquito. The infected mosquitoes car… [+2499 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Concern over new e-cigarette and vaping rules planned for South Africa - BusinessTech", "description": "The Free Market Foundation has raised concerns about the government’s plans to regulate e-cigarette and vaping products which it says could push more people towards cigarettes and the illicit market.", "url": "https://businesstech.co.za/news/lifestyle/569952/concern-over-new-e-cigarette-and-vaping-rules-planned-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Vape-e1641218102109.jpeg", "publishedAt": "2022-03-22T06:30:07Z", "content": "The Free Market Foundation has raised concerns about the government’s plans to regulate e-cigarette and vaping products, which it says could push more people towards traditional cigarettes and the il… [+2977 chars]"}]}