{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Luke Goodsell", "title": "Descendant: Netflix documentary talks to the descendants of the last slave ship to traffic Africans to the US, the Clotilda - ABC News", "description": "Descendant, on Netflix, reveals the story of the Clotilda: the last to transport African slaves to America, in 1860, and in contravention of the law. It was sunk to hide the evidence.", "url": "https://www.abc.net.au/news/2022-10-23/descendant-documentary-netflix-slave-ship-clotilda/101550516", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/bffafb0cc24745ddd9147b5cb153267a?impolicy=wcms_crop_resize&cropH=1148&cropW=2041&xPos=451&yPos=0&width=862&height=485", "publishedAt": "2022-10-22T22:57:14Z", "content": "That old phrase \"history is written by the victors\" has always been a fraught equation, especially when that history constructed by those in control of the official archive has the power to diminish … [+7162 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Ruaidhri O'Connor", "title": "Leo Cullen allays Tadhg Furlong fears but Joey Carbery a major doubt for South Africa clash - Independent.ie", "description": "Leinster coach Leo Cullen allayed fears over Tadhg Furlong's November participation after the prop was pulled from the starting XV ahead of today's win over Munster, but the signs are not good for Munster's Joey Carbery who left the field with a shoulder issu…", "url": "https://www.independent.ie/sport/rugby/pro14/leo-cullen-allays-tadhg-furlong-fears-but-joey-carbery-a-major-doubt-for-south-africa-clash-42087913.html", "urlToImage": "https://www.independent.ie/sport/rugby/pro14/5da8b/42087912.ece/AUTOCROP/w1240h700/20221022HM0074", "publishedAt": "2022-10-22T19:57:00Z", "content": "Leinster coach Leo Cullen allayed fears over Tadhg Furlong's November participation after the prop was pulled from the starting XV ahead of today's win over Munster, but the signs are not good for Mu… [+4663 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "Chad's leader visits part of capital hit by violent protests | Africanews - Africanews English", "description": "Chad's military ruler Mahamat Idriss Deby on Friday visited a hospital and a protest-hit district of N'Djamena, his office said, after a day of unprecedented violence that left around 50 people dead in the capital and elsewhere", "url": "http://www.africanews.com/2022/10/22/chads-leader-visits-part-of-capital-hit-by-violent-protests/", "urlToImage": "https://static.euronews.com/articles/stories/07/14/53/42/1024x538_cmsv2_4952f37d-e23f-55c8-a66f-3286fda00d08-7145342.jpg", "publishedAt": "2022-10-22T06:04:47Z", "content": "Chad's military ruler Mahamat Idriss Deby on Friday visited a hospital and a protest-hit district of N'Djamena, his office said, after a day of unprecedented violence that left around 50 people dead … [+2052 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The chance to lower interest rates is in government’s hands: Kganyago - BusinessTech", "description": "South Africa’s central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.", "url": "https://businesstech.co.za/news/trending/636989/the-chance-to-lower-interest-rates-is-in-governments-hands-kganyago/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-10-22T05:41:04Z", "content": "South Africas central bank governor urged the government to stick to its plan to reduce debt, as the National Treasury prepares to deliver its medium-term budget policy statement next week.\r\nFiscal c… [+1694 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How South Africa’s tax rates compare to Australia, the UK and other countries - BusinessTech", "description": "Data from the Organisation for Economic Cooperation and Development’s (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with the rest of the world – but the devil’s in the details.", "url": "https://businesstech.co.za/news/business-opinion/635987/how-south-africas-tax-rates-compare-to-australia-the-uk-and-other-countries/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/the-SA-rand.jpg", "publishedAt": "2022-10-22T05:06:35Z", "content": "Data from the Organisation for Economic Cooperation and Developments (OECD) latest 2022 taxing wages report shows that the average personal income tax in South Africa is relatively low compared with … [+4511 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Nick Wilson", "title": "SA's brain drain may not be as bad as feared | Fin24 - News24", "description": "While dinner party conversations and social media posts suggest wealthy South Africans are leaving for Europe, US and Australia in their droves, the actual data around emigration shows the reality may not be quite as bad as the public discourse suggests.", "url": "https://www.news24.com/fin24/economy/sas-brain-drain-may-not-be-as-bad-as-feared-20221022", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2452/ef6ea21565754fea957250de2cab1cac.jpg", "publishedAt": "2022-10-22T03:01:29Z", "content": "While dinner party conversations and social media posts may suggest wealthy South Africans are leaving for Europe, US and Australia in their droves, data regarding emigration shows the reality may no… [+432 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mcebisi Jonas", "title": "COMPREHENSIVE CHANGE OP-ED: South Africa needs these five fundamentals to change course and start rebuilding - Daily Maverick", "description": "The current trajectory of our country is unsustainable as we get nearer and nearer to the precipice. The warning lights are flashing on all key economic and social indices, and yet the only new idea gaining momentum across political lines is to attack and sca…", "url": "https://www.dailymaverick.co.za/article/2022-10-21-south-africa-needs-these-five-fundamentals-to-change-course-and-start-rebuilding/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/Michelle-LGE-food-option-6.jpg?w=1280", "publishedAt": "2022-10-21T20:38:24Z", "content": "This is the text of the speech Mcebisi Jonas delivered at the opening of the Kgalema Motlanthe Foundations Drakensberg Inclusive Growth Forum 2022.\r\nI believe this years assembly is more important th… [+8335 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Characterization of Pseudoterranova ceticola (Nematoda: Anisakidae) larvae from meso/bathypelagic fishes off Macaronesia (NW Africa waters) | Scientific Reports - Nature.com", "description": "Scientific Reports - Characterization of Pseudoterranova ceticola (Nematoda: Anisakidae) larvae from meso/bathypelagic fishes off Macaronesia (NW Africa waters)", "url": "https://www.nature.com/articles/s41598-022-22542-0", "urlToImage": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-022-22542-0/MediaObjects/41598_2022_22542_Fig1_HTML.png", "publishedAt": "2022-10-21T19:58:17Z", "content": "<li>Buchmann, K. &amp; Mehrdana, F. Effects of anisakid nematodes Anisakis simplex (s.l.), Pseudoterranova decipiens (s.l.) and Contracaecum osculatum (s.l.) on fish and consumer health. Food Waterbo… [+22569 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Brian Evans", "title": "Copper supplies are dangerously low and can only cover less than 5 days of global demand, trader says | Businessinsider - Business Insider South Africa", "description": "Global inventories of copper could shrink further, covering 2.7 days of demand by year-end from 4.9 days now, according to Trafigura.", "url": "https://www.businessinsider.co.za/copper-supply-outlook-inventory-shortage-5-days-global-demand-trafigura-2022-10", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7475/c5c1355a1b094f2e99f40e6df6598256.jpg", "publishedAt": "2022-10-21T18:29:40Z", "content": "The global supply of copper is running dangerously low, according to top commodities trading firm Trafigura.\r\nKostas Bintas, Trafigura's co-head of metals and minerals trading, said at the FT Mining … [+1722 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "World Polio Day 2022 Message of WHO Regional Director for Africa, Dr Matshidiso Moeti - WHO | Regional Office for Africa", "description": "World Polio Day is marked annually on October 24, providing an opportunity to highlight global efforts toward a polio-free world, and to honour the unwavering commitment of those on the frontlines of the fight to eradicate polio.", "url": "https://www.afro.who.int/regional-director/speeches-messages/world-polio-day-2022-message-who-regional-director-africa-dr", "urlToImage": "https://www.afro.who.int/sites/default/files/regional_director/HM3A4878.jpg", "publishedAt": "2022-10-21T14:20:43Z", "content": "World Polio Day is marked annually on October 24, providing an opportunity to highlight global efforts toward a polio-free world, and to honour the unwavering commitment of those on the frontlines of… [+3779 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Zimbabwe Is Third Country To Use HIV Prevention Drug in World - The Indian Express", "description": "Zimbabwe HIV Prevention Drug: Zimbabwe becomes the first country in Africa and third in the world to approve the use of HIV prevention drugs recommended by t...", "url": "https://www.youtube.com/watch?v=Oq6UV6z4IAM", "urlToImage": "https://i.ytimg.com/vi/Oq6UV6z4IAM/maxresdefault.jpg", "publishedAt": "2022-10-21T13:30:16Z", "content": null}, {"source": {"id": null, "name": "NAG"}, "author": "NewsBot3000", "title": "TCL South Africa Launches First MINI LED 144 Hz Google TV and full New Google TV Range > NAG - NAG", "description": "press release[/su_label TCL, one of the dominant players in the global TV industry and a leading consumer electronics brand, launched its latest line of Google LED TVs in a glittering event held at the Galleria Sandton. Adding to an already impressive range o…", "url": "https://www.nag.co.za/2022/10/21/tcl-south-africa-launches-first-mini-led-144-hz-google-tv-and-full-new-google-tv-range/", "urlToImage": "https://www.nag.co.za/wp-content/uploads/2022/10/Nag-Press-Release-01.jpg", "publishedAt": "2022-10-21T12:22:32Z", "content": "press release[/su_labelTCL, one of the dominant players in the global TV industry and a leading consumer electronics brand, launched its latest line of Google LED TVs in a glittering event held at th… [+4975 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Red flags over domestic worker wages in South Africa – how much you should be paying - BusinessTech", "description": "The latest Consumer Price Index (CPI) data published by Stats SA this week shows that domestic worker wages in South Africa are tracking far below headline inflation, indicating that household employees are struggling to keep up with the rising cost of living…", "url": "https://businesstech.co.za/news/lifestyle/636827/red-flags-over-domestic-workers-wages-in-south-africa-how-much-you-should-be-paying/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/12/DomesticWork-e1638793152889.jpeg", "publishedAt": "2022-10-21T10:23:46Z", "content": "The latest Consumer Price Index (CPI) data published by Stats SA this week shows that domestic worker wages in South Africa are tracking far below headline inflation, indicating that household employ… [+3548 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Peter Fabricius", "title": "WAR IN EUROPE: South Africa's relations with US 'not under duress' over Ukraine, says American ambassador - Daily Maverick", "description": "President Joe Biden invited Cyril Ramaphosa to the White House last month both to persuade him and reassure him.", "url": "https://www.dailymaverick.co.za/article/2022-10-21-sa-us-relations-not-under-duress-over-ukraine-american-ambassador/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/07/72aa6b3a8762857769690fe8_1160x1160.jpeg?w=1280", "publishedAt": "2022-10-21T09:17:52Z", "content": "The sharp differences between South Africa and the US over Russias war against Ukraine have not placed the Pretoria-Washington relationship under duress, says Americas new ambassador to South Africa,… [+7635 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Charles Pensulo", "title": "More bodies, thought to be of Ethiopian migrants, found in mass grave in Malawi - The Guardian", "description": "Bodies of four men, believed to be en route to South Africa, found less than a mile from where 25 bodies were exhumed in Mzimba", "url": "https://www.theguardian.com/global-development/2022/oct/21/bodies-thought-to-be-ethiopian-migrants-found-mass-grave-malawi", "urlToImage": "https://i.guim.co.uk/img/media/569ddb03ce14ab3e61a447bddb247f0ef9ec5c3b/0_0_1500_900/master/1500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=783b7795a5135e02c327b2f7e06f6f3b", "publishedAt": "2022-10-21T06:11:00Z", "content": "Authorities in Malawi have discovered four bodies in a forest close to where dozens more were found in a mass grave on Wednesday.\r\nPolice say the bodies were found yesterday morning, less than a mile… [+2741 chars]"}]}