{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Andrew Dunn", "title": "The Covid-19 booster debate is a mess. Here's why we'll probably get extra shots anyway. - Business Insider South Africa", "description": "Political, financial and ethical concerns surround the scientific question of whether extra doses are needed now.", "url": "https://www.businessinsider.com/who-needs-covid-19-booster-when-how-debate-got-confusing-2021-9", "urlToImage": "https://i.insider.com/61437b5ff0cb130019e91f58?width=1200&format=jpeg", "publishedAt": "2021-09-17T11:52:16Z", "content": "The debate over COVID-19 booster shots in the US has devolved into a noisy, confusing mess of half-answered scientific, political, and ethical questions.\r\nThe next week should bring some much-needed … [+7179 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "Guinea coup: Osinbajo restates Nigeria’s position, makes demand to ECOWAS - Daily Post Nigeria", "description": "Determined to ensure a prompt return of democratic rule to Guinea following the recent military coup, Nigeria has called on the Economic Community of West African States (ECOWAS) to maintain a short transition programme that will usher in a new civilian gover…", "url": "https://dailypost.ng/2021/09/17/guinea-coup-osinbajo-restates-nigerias-position-makes-demand-to-ecowas/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/03/osinbajo-1.jpeg", "publishedAt": "2021-09-17T10:53:53Z", "content": "Determined to ensure a prompt return of democratic rule to Guinea following the recent military coup, Nigeria has called on the Economic Community of West African States (ECOWAS) to maintain a short … [+1627 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "South Africa’s top court rejects Zuma’s bid to overturn sentence - Al Jazeera English", "description": "Ex-President Jacob Zuma sought to have his jail sentence for contempt overturned, arguing it would endanger his health.", "url": "https://www.aljazeera.com/news/2021/9/17/south-africa-court-rejects-zuma-bid-to-overturn-jail-sentence", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/09/000_9MA4J3.jpg?resize=1200%2C630", "publishedAt": "2021-09-17T09:56:15Z", "content": "South Africas top court has ruled that former President Jacob Zuma had failed in his bid to have his 15-month jail sentence for failing to attend a corruption inquiry overturned.\r\nThe sentence was ha… [+2514 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Zakiyah Ebrahim", "title": "If SA had rolled out AstraZeneca vaccine, up to 22 000 deaths could have been prevented – Prof Madhi - News24", "description": "If South Africa's elderly population had been given the AstraZeneca Covid-19 vaccine, up to 22 000 lives could have been saved, according to Professor Shabir Madhi.", "url": "https://www.news24.com/health24/medical/infectious-diseases/coronavirus/if-sa-had-rolled-out-astrazeneca-vaccine-up-to-22-000-deaths-could-have-been-prevented-prof-madhi-20210917", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10875/b9cb70c0fc4549d58bef5e6b58adc32e.jpg", "publishedAt": "2021-09-17T09:37:41Z", "content": "<ul><li>SA sold 1.5 million doses of the AstraZeneca vaccine earlier this year</li><li>The WHO also recommended that countries continue using the vaccine, even where new variants were circulating.</l… [+5609 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Barnaby Lane", "title": "Cristiano Ronaldo denied noisy sheep forced him to move house after reports their baaing kept waking him - Business Insider South Africa", "description": "The Sun reported that the Portuguese had moved after less than a week back in England because of the vociferous animals.", "url": "https://www.insider.com/cristiano-ronaldo-denies-moving-house-because-of-noisy-sheep-2021-9", "urlToImage": "https://i.insider.com/614349ef2db0850019a9c024?width=1200&format=jpeg", "publishedAt": "2021-09-17T09:29:02Z", "content": "Cristiano Ronaldo has denied that he was forced to recently move house because a herd of noisy sheep that was baa-ing were keeping him up at night.\r\nThe Sun reported on Thursday that the Manchester U… [+2163 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Relaxed lockdown restrictions being considered for South Africa: health minister - BusinessTech", "description": "South Africa continues to see a decline in the third wave of its Covid-19 cases, with the government now considering the further easing of restrictions, says Health minister Joe Phaahla.", "url": "https://businesstech.co.za/news/government/522306/relaxed-lockdown-restrictions-being-considered-for-south-africa-health-minister/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/03/South-Africa-lockdown.png", "publishedAt": "2021-09-17T09:18:09Z", "content": "Health minister Joe Phaahla says South Africa is seeing a decline in the third wave of its Covid-19 cases, and the government is now considering the further easing of lockdown restrictions.\r\nAddressi… [+2689 chars]"}, {"source": {"id": null, "name": "Independent.ie"}, "author": "Simon Jennings", "title": "Rugby 'will be dead in five years if it does' - Clive Woodward on Springbok influence - Independent.ie", "description": "Rugby will be dead in five years if more teams copy South Africa's approach to the game, England's World Cup-winning coach Clive Woodward said, criticising the world champions' reluctance to run with the ball and heavy reliance on the set piece.", "url": "https://www.independent.ie/sport/rugby/rugby-will-be-dead-in-five-years-if-it-does-clive-woodward-on-springbok-influence-40859938.html", "urlToImage": "https://www.independent.ie/sport/rugby/bad98/40859937.ece/AUTOCROP/w1240h700/_AAV8145", "publishedAt": "2021-09-17T08:38:00Z", "content": "Rugby will be dead in five years if more teams copy South Africa's approach to the game, England's World Cup-winning coach Clive Woodward said, criticising the world champions' reluctance to run with… [+1132 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Damning reports strengthen push for new smoking and cigarette laws in South Africa - BusinessTech", "description": "", "url": "https://businesstech.co.za/news/lifestyle/522218/damning-reports-strengthen-push-for-new-smoking-and-cigarette-laws-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/04/Cigarettes-e1586412775192.jpeg", "publishedAt": "2021-09-17T08:06:24Z", "content": "Anti-tobacco and health groups have called on the government to introduce the long-awaited Control of Tobacco Products and Electronic Delivery Systems Bill – or to at least process the bill to Cabine… [+4850 chars]"}, {"source": {"id": null, "name": "New Zealand Herald"}, "author": "Anna Leask", "title": "Timaru tragedy: Three sisters killed, South African family's New Zealand adventure turns to tragedy - New Zealand Herald", "description": "Twin girls and their sister were found dead at their new home in Timaru on Thursday night.", "url": "https://www.nzherald.co.nz/nz/timaru-tragedy-three-sisters-killed-south-african-familys-new-zealand-adventure-turns-to-tragedy/2VMALGN74ITIL75DBEJAJLFJYM/", "urlToImage": "https://www.nzherald.co.nz/resizer/SqBdomlXYnENK3V9GcI_pHDg6JM=/1200x675/filters:quality(70)/cloudfront-ap-southeast-2.images.arcpublishing.com/nzme/2R4OZARRRMY5STMKSUBUAWZFYE.jpg", "publishedAt": "2021-09-17T06:55:43Z", "content": "Police have confirmed three children, all aged under 10, have died at a property in Timaru. Detective Inspector Scott Anderson provided an update at 1pm and said the deceased were siblings. Two were … [+4672 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "Sibusisiwe Lwandle", "title": "Yikes: Anele Mdoda Gets Cooked by Americans Defending Kelly Rowland ▷ South Africa news - Briefly ", "description": "Anele Mdoda has reached international waters after Americans found her post about Kelly Rowland. The SA media personality got roasted as peeps defended Kelly.", "url": "https://briefly.co.za/109689-yikes-anele-mdoda-cooked-by-americans-defending-kelly-rowland.html", "urlToImage": "https://netstorage-briefly.akamaized.net/images/64a85c5f42d75d45.png", "publishedAt": "2021-09-17T06:40:32Z", "content": "<ul><li>American social media users have found Anele Mdoda and saw what she said about their beloved Kelly Rowland</li><li>The defensive group held nothing back while defending their queen and Anele … [+2353 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "It is 99 days until Christmas – and if your shopping isn't done yet, you may be in trouble - Business Insider South Africa", "description": "Global shipping disruptions – and the unpredictable course of the pandemic – are worrying retailers ahead of the biggest shopping season.", "url": "https://www.businessinsider.co.za/christmas-2021-is-coming-up-2021-9", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11584/f8358a0b05fd4a8ba7f0fd2f12d5b8ff.jpg", "publishedAt": "2021-09-17T05:36:13Z", "content": "News analysis\r\n<ul><li>Christmas is in 99 days.</li><li>Thanks to the weirdness of the pandemic, that's not a lot of time left to shop.</li><li>Global shipping delays and manufacturing disruptions ha… [+3586 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "‘Mortal combat’ faces Standard Bank - BusinessTech", "description": "Standard Bank Group Ltd’s goal of adding at least 10 million customers ahead of a 2025 deadline has set the stage for a tug-of-war over Africa’s wealthiest clients.", "url": "https://businesstech.co.za/news/banking/522140/mortal-combat-faces-standard-bank/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/05/StandardBank-e1622442551853.jpg", "publishedAt": "2021-09-17T05:21:17Z", "content": "Standard Bank Group Ltds goal of adding at least 10 million customers ahead of a 2025 deadline has set the stage for a tug-of-war over Africas wealthiest clients.\r\nThe biggest lender in Africa, with … [+2972 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Guinea Declares End of Marburg Virus Disease Outbreak - AllAfrica - Top Africa News", "description": "Press Release - Guinea today declared the end of the Marburg virus disease outbreak having recorded no new cases over the past 42 days--two incubation periods, or the time between infection and the onset of symptoms. The virus was confirmed on 9 August, marki…", "url": "https://allafrica.com/stories/202109170087.html", "urlToImage": "https://cdn03.allafrica.com/download/pic/main/main/csiid/00590422:7f4ae671f414390f6b9a0af77380379a:arc614x376:w1200.jpg", "publishedAt": "2021-09-17T04:37:52Z", "content": "Brazzaville/Conakry — Guinea today declared the end of the Marburg virus disease outbreak having recorded no new cases over the past 42 days--two incubation periods, or the time between infection and… [+2469 chars]"}, {"source": {"id": null, "name": "RugbyPass"}, "author": null, "title": "The All Blacks 'Bomb Squad' set to take down the Springboks - RugbyPass", "description": "The Springboks have their infamous 'Bomb Squad', but the All Blacks look set to deploy their own platoon to defuse South Africa's kick game.", "url": "https://www.rugbypass.com/news/the-all-blacks-bomb-squad-set-to-take-down-the-springboks/", "urlToImage": "https://eu-cdn.rugbypass.com/wp/wp-content/uploads/2021/09/Will-Jordan-Jordie-Barrett-George-Bridge-All-Blacks-1200x630.jpg?id=193710", "publishedAt": "2021-09-16T23:32:08Z", "content": "7:32pm, 16 September 2021The Springboks have their infamous Bomb Squad, the combustible clutch of six forwards and two backs that come off the bench against tiring opponents and blow them away.\r\nThe … [+3376 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Africa COVID jab shortfall could take world 'back to square one': WHO - Eyewitness News", "description": "Only 17% of the continent's population will now be vaccinated by the end of this year, compared with the 40% target set by the World Health Organization, the global agency's Africa unit said at its weekly briefing in the Congolese capita of Brazzaville.", "url": "https://ewn.co.za/2021/09/16/africa-covid-jab-shortfall-could-take-world-back-to-square-one-who", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/xfeo5elfkxz8gfr5uhtf", "publishedAt": "2021-09-16T22:31:52Z", "content": "Only 17% of the continent's population will now be vaccinated by the end of this year, compared with the 40% target set by the World Health Organization, the global agency's Africa unit said at its w… [+2085 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: NITDA Advises Apple Users On System Update - AllAfrica.com", "description": "The National Information Technology Development Agency (NITDA) has advised Apple users in the country to upgrade their devices' operating sysåtem (iOS) with the latest patches iOS 14.8 to guard against a dangerous spyware known as Pegasus. This followed the i…", "url": "https://allafrica.com/stories/202109160710.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-09-15T22:52:30Z", "content": "The National Information Technology Development Agency (NITDA) has advised Apple users in the country to upgrade their devices' operating sysåtem (iOS) with the latest patches iOS 14.8 to guard again… [+1095 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Marianne Guenot", "title": "Gorilla moms carry dead babies around with them, which could prove they grieve, scientists say - Business Insider South Africa", "description": "A study published Wednesday provide clues as to how some primates could experience grief and suggest they could learn what death is over time.", "url": "https://www.businessinsider.com/gorilla-mom-carrying-dead-baby-maybe-grieving-say-scientists-2021-9", "urlToImage": "https://i.insider.com/6140d23b2534ab0018542624?width=1200&format=jpeg", "publishedAt": "2021-09-15T13:59:08Z", "content": "Scientists studying how chimpanzees and gorillas cope with the death of a newborn believe that the harrowing sight of them carrying their dead infants around for days is a sign they feel grief.\r\nThe … [+3242 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "West Africa bloc to review steps after Guinea coup - Guardian Nigeria", "description": "West African bloc ECOWAS said it will meet Thursday to discuss possible steps after Guinea's president was ousted in coup earlier this month, Ghana's foreign minister said.", "url": "https://guardian.ng/news/west-africa-bloc-to-review-steps-after-guinea-coup/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/09/Guinea-1.jpg", "publishedAt": "2021-09-15T13:40:00Z", "content": "Colonel Mamady Doumbouya (C) and his team of Guinean special Forces listen as he holds talks with religious leaders at the Peoples Palace in Conakry on September 14, 2021. – Colonel Mamady Doumbouyas… [+2000 chars]"}]}