{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "Biomedcentral.com"}, "author": null, "title": "Community-based care models for arterial hypertension management in non-pregnant adults in sub-Saharan Africa: a literature scoping review and framework for designing chronic services - BMC Public Health - BMC Public Health", "description": "Background Arterial hypertension (aHT) is the leading cardiovascular disease (CVD) risk factor in sub-Saharan Africa; it remains, however, underdiagnosed, and undertreated. Community-based care services could potentially expand access to aHT diagnosis and tre…", "url": "https://bmcpublichealth.biomedcentral.com/articles/10.1186/s12889-022-13467-4", "urlToImage": "https://media.springernature.com/w200/springer-static/cover/journal/12889.jpg", "publishedAt": "2022-06-04T19:03:17Z", "content": null}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Monkeypox - When the World Did Not Listen to Nigeria - AllAfrica - Top Africa News", "description": "Blog - Again, the world is paying attention to another infectious disease outbreak. This time it is monkeypox, a rare disease that many people may never have heard about, until recently. Named after a well-known primate - monkeys, due to the early origins of …", "url": "https://allafrica.com/stories/202206040305.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-06-04T18:16:10Z", "content": "Again, the world is paying attention to another infectious disease outbreak. This time it is monkeypox, a rare disease that many people may never have heard about, until recently. Named after a well-… [+7457 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Williams Anuku", "title": "Buhari bemoans soaring food prices on African continent over Russia-Ukraine war - Daily Post Nigeria", "description": "President Muhammadu Buhari has decried the impact of the war between Russia and Ukraine, saying it is beginning to take a toll in prices of many commodities, especially foodstuffs. He said the situation is even more devastating when the world is gradually rec…", "url": "https://dailypost.ng/2022/06/04/buhari-bemoans-soaring-food-prices-on-african-continent-over-russia-ukraine-war/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/02/Buhari-1.jpg", "publishedAt": "2022-06-04T16:39:59Z", "content": "President Muhammadu Buhari has decried the impact of the war between Russia and Ukraine, saying it is beginning to take a toll in prices of many commodities, especially foodstuffs.\r\nHe said the situa… [+4672 chars]"}, {"source": {"id": null, "name": "Boksburgadvertiser.co.za"}, "author": "lisasmith", "title": "Let the sun shine with Vitamin D and eggs – plus a delish recipe - Boksburg Advertiser", "description": "If you think vitamin D deficiency is not of concern in sunny Africa, think again. As many as two in 10 Africans may be vitamin D deficient, suggesting that our continent may have the highest levels of", "url": "https://boksburgadvertiser.co.za/444891/let-the-sun-shine-with-vitamin-d-and-eggs-plus-a-delish-recipe/", "urlToImage": "https://boksburgadvertiser.co.za/wp-content/uploads/sites/25/2022/06/Egg-bagel-web-main-scaled.jpg", "publishedAt": "2022-06-04T11:19:53Z", "content": "If you think vitamin D deficiency is not of concern in sunny Africa, think again. As many as two in 10 Africans may be vitamin D deficient, suggesting that our continent may have the highest levels o… [+2589 chars]"}, {"source": {"id": null, "name": "702"}, "author": "Keely  Goodall", "title": "Q4 crime stats paint a horrifying picture of violent crime in South Africa - EWN", "description": "John Perlman spoke to independent crime analyst Dr Johan Burger about these statistics.", "url": "https://www.702.co.za/articles/446550/q4-crime-stats-paint-a-horrifying-picture-of-violent-crime-in-south-africa", "urlToImage": "https://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_290,w_480/uvdzxanst6rdty7ju20q.jpg", "publishedAt": "2022-06-04T06:51:34Z", "content": "John Perlman spoke to independent crime analyst Dr Johan Burger about these statistics.\r\nPolice Minister Bheki Cele and the South African Police Service have released the shocking results of the Q4 c… [+973 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Nonkululeko Matiwane", "title": "SA has one of the highest death rates from it. Here are 3 things to know to help an asthma-sufferer | Drum - News24", "description": "Asthma is a potentially life-threatening affliction that affects millions in South Africa, with many children and adults dying from it", "url": "https://www.news24.com/drum/advice/health/sa-has-one-of-the-highest-death-rates-from-it-here-are-3-things-to-know-to-help-an-asthma-sufferer-20220603", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3445/7556ff56ec734af7b25413b17cc12d46.jpg", "publishedAt": "2022-06-03T15:41:41Z", "content": "One moment you're fine.\r\nThe next, you experience difficulty breathing, chest pains, cough, wheezing and sometimes produce extra mucus, which makes it difficult to breathe.\r\nChildren, as well as adul… [+206 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Kremlin denies blame for food crisis as Putin meets AU leaders - News24", "description": "African countries are acutely affected by the growing crisis which has caused a rise in prices of food and fuels.", "url": "https://www.news24.com/news24/africa/news/kremlin-denies-blame-for-food-crisis-as-putin-meets-au-leaders-20220603", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/700/258b074bcc1e43508ab2341a4882684f.jpg", "publishedAt": "2022-06-03T15:27:58Z", "content": "<ul><li>The Kremlin has refused to accept blame for the food crisis in African countries.</li><li>The Kremlin says it is not Russia that is blocking ports, leading to limited supply of grains, oils, … [+2208 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "Full list: Pirates’ EIGHT reported targets to sign for next season [update] - The South African", "description": "Rain or shine, Orlando Pirates unveil new players before new seasons. Here’s a look at nine names that are linked with Bucs.", "url": "https://www.thesouthafrican.com/sport/soccer/psl-south-africa/orlando-pirates-news-psl-transfers-players-reported-targets-to-sign-for-next-season/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/05/Orlando-Pirates-28.png", "publishedAt": "2022-06-03T05:45:57Z", "content": "It has to be said, Orlando Pirates transfer developments are never always easy to call, a sense of drama is always on the menu. \r\nALSO READ: Orlando Pirates – Benni used to offer Senzo R1 000 says Le… [+2074 chars]"}]}