{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Disrupt Africa"}, "author": "Tom Jackson", "title": "Comparing Africa's \"big four\" startup ecosystems - how do they match up? - Disrupt Africa", "description": "South Africa, Nigeria, Kenya, and Egypt have established themselves over the last few years, by various criteria, as the “big four” African tech startup ecosystems.", "url": "https://disrupt-africa.com/2023/01/09/comparing-africas-big-four-startup-ecosystems-how-do-they-match-up/", "urlToImage": "https://i0.wp.com/disrupt-africa.com/wp-content/uploads/2015/07/africa-from-space.jpg?fit=850%2C671&ssl=1", "publishedAt": "2023-01-09T06:00:33Z", "content": "South Africa, Nigeria, Kenya, and Egypt have established themselves over the last few years, by various criteria, as the big four African tech startup ecosystems. \r\nSlowly but surely, especially when… [+6419 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Irrelevant issues dominate 2023 election campaign – Report - Daily Post Nigeria", "description": "The Centre for Research on Development of African Media and Society (CEREDEMS-Africa) and Positive Agenda Nigeria (PAN) have released a report of their two months of studying the 2023 election. The monitors said the last eight weeks have been a mix of both po…", "url": "https://dailypost.ng/2023/01/09/irrelevant-issues-dominate-2023-election-campaign-report/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/11/2023-elections-1200x684-1.png", "publishedAt": "2023-01-09T05:46:33Z", "content": "The Centre for Research on Development of African Media and Society (CEREDEMS-Africa) and Positive Agenda Nigeria (PAN) have released a report of their two months of studying the 2023 election.\r\nThe … [+2412 chars]"}, {"source": {"id": null, "name": "eNCA"}, "author": null, "title": "Covid-19 in SA | Public warned to remain cautious, vigilant - eNCA", "description": "The department says it's appealing to South Africans to vaccinate, get their boosters, and observe non-pharmaceutical interventions.", "url": "https://www.enca.com/news/covid-19-sa-south-africans-warned-remain-cautious-vigilant", "urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/2021-01/web_photo_masksanitizer_020120.jpg?h=1c9b88c9&itok=_tKHmEUr", "publishedAt": "2023-01-09T05:03:46Z", "content": "CAPE TOWN - Remain cautious and vigilant.\r\nThat's the advice from health professionals and scientists after the country identified its first case of a coronavirus infection caused by the new, highly … [+628 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Tony Elumelu Foundation announces Somachi Chris-Asoluka as CEO - Guardian Nigeria", "description": "The Board of Trustees of Tony Elumelu Foundation, a leading philanthropy empowering young African entrepreneurs from all 54 African countries, has announced the appointment of Somachi Chris-Asoluka as Chief Executive Officer (CEO), following the retirement of…", "url": "https://guardian.ng/news/tony-elumelu-foundation-announces-somachi-chris-asoluka-as-ceo/", "urlToImage": "https://guardian.ng/wp-content/uploads/2023/01/Somachi-Chris-Asoluka-1.jpg", "publishedAt": "2023-01-09T03:41:00Z", "content": "The Board of Trustees of Tony Elumelu Foundation, a leading philanthropy empowering young African entrepreneurs from all 54 African countries, has announced the appointment of Somachi Chris-Asoluka a… [+3364 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "The 2022 Monkeypox Epidemic and What Has Led to the Current State of the Disease in the US: A Systematic Review - Cureus", "description": "Monkeypox virus (MPOX) is a zoonotic disease in humans. It is similar genetically to its virus family member, smallpox. This virus has been studied since the 1970s. The virus remains endemic to the Congo and West African regions, but non-endemic spreads have …", "url": "https://www.cureus.com/articles/127609-the-2022-monkeypox-epidemic-and-what-has-led-to-the-current-state-of-the-disease-in-the-us-a-systematic-review", "urlToImage": "https://assets.cureus.com/uploads/figure/file/504150/article_river_775a14f06b8811edaadfab5ec03d7ddb-monkeypox-picture-1.png", "publishedAt": "2023-01-08T20:32:15Z", "content": "Monkeypox (MPOX) is a smallpox-like viral zoonotic disease caused by an Orthopoxvirus. This virus is an ovoid-shaped double-stranded DNA virus [1,2]. This virus was first noted and studied in central… [+14499 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Knowledge, Attitudes, and Perceptions Regarding CPR Among Non-medical Staff at a Medical School in South Africa - Cureus", "description": "Background\r\n\r\nSudden cardiac arrest can occur unexpectedly in any person and at any place including at medical schools. Improved outcomes after cardiac arrest are dependent on the initiation of early first responder high-quality cardiopulmonary resuscitation …", "url": "https://www.cureus.com/articles/131586-knowledge-attitudes-and-perceptions-regarding-cpr-among-non-medical-staff-at-a-medical-school-in-south-africa", "urlToImage": "https://assets.cureus.com/uploads/figure/file/523100/article_river_ddaaa1d082a711ed8f5183bd30542667-2-Jarghon-Fig.-1-jpeg.png", "publishedAt": "2023-01-08T17:51:48Z", "content": "Background\r\nSudden cardiac arrest can occur unexpectedly in any person and at any place including at medical schools. Improved outcomes after cardiac arrest are dependent on the initiation of early f… [+30172 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "Nokuthula Ngcobo", "title": "‘I was hacked’: Fans convinced Master KG cheated on Makhadzi - The South African", "description": "Before revealing she was hacked, Makhadzi exposed her boyfriend Master KG on Facebook and Twitter for cheating on her.", "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/breaking-hacked-master-kg-cheating-makhadzi-number-botswana-8-january-2023/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/02/New-Music-Friday-8.jpg", "publishedAt": "2023-01-08T09:05:39Z", "content": "Social media users are convinced that there is trouble in paradise between Limpopo-born musicians Master KG and his girlfriend Makhadzi.\r\nThis follows several posts from the Ghanama hitmaker on Satur… [+2977 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Ryan Hogg", "title": "Alibaba founder Jack Ma, who disappeared from public view in 2020, appears to resurface in Thailand - Business Insider South Africa", "description": "Bangkok restaurant Jay Fai posted a picture of the elusive billionaire on Instagram just hours before he ceded control of the company he founded.", "url": "https://www.businessinsider.co.za/jack-ma-appears-resurface-thailand-gives-up-control-ant-group-2023-1", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1958/2f650f0f439d4be49cba8aa2873e78e0.jpg", "publishedAt": "2023-01-07T14:58:41Z", "content": "Jack Ma, the elusive billionaire founder of Alibaba, appeared to resurface in Thailand hours before Ant Group said he would give up control of the company.\r\nA picture of Ma was posted on Instagram by… [+1847 chars]"}]}