{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Livemint"}, "author": "Karishma Pranav Bhavsar", "title": "EU cut off financial support; West Africa leaders to meet over Niger coup, junta warns against intervention. Top Updates | Mint - Mint", "description": "Niger military warns against intervention as West African leaders gather; EU cuts off financial support; coup condemned.", "url": "https://www.livemint.com/news/eu-cut-off-financial-support-west-africa-leaders-to-meet-over-niger-coup-junta-warns-against-intervention-top-updates-11690680043562.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/07/30/600x338/Nigeria_1690680872768_1690680872928.jpg", "publishedAt": "2023-07-30T01:59:45Z", "content": "Niger's military leaders has warned against any armed intervention in the country as West African leaders are set to gather in Nigeria's capital for an emergency summit to decide on further actions t… [+3792 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters", "title": "West African leaders meet over Niger coup, junta warns against intervention - Reuters", "description": "Niger's military leaders warned against any armed intervention in the country as West African leaders are set to gather in Nigeria's capital on Sunday for an emergency summit to decide on further actions to pressure the army to restore constitutional order.", "url": "https://www.reuters.com/world/africa/west-african-leaders-meet-over-niger-coup-junta-warns-against-intervention-2023-07-30/", "urlToImage": "https://www.reuters.com/resizer/oCQ3qCWuXG32t0sKMyxZWNv0KD8=/1200x628/smart/filters:quality(80)/cloudfront-us-east-2.images.arcpublishing.com/reuters/QV7ZOHJXTNLE7JAJJXH4EOPHSI.jpg", "publishedAt": "2023-07-30T01:00:55Z", "content": "NIAMEY/ABUJA, July 30 (Reuters) - Niger's military leaders warned against any armed intervention in the country as West African leaders are set to gather in Nigeria's capital on Sunday for an emergen… [+2851 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Maria Katamadze", "title": "Putin's gamble with Ukraine's grain drags on - DW (English)", "description": "In a show of largesse, Vladimir Putin promised shipments of grain to a handful of African countries affected by shortages caused by Russia's invasion of Ukraine. African leaders responded by telling him to end the war.", "url": "https://www.dw.com/en/russia-africa-summit-vladimir-putins-grain-gamble-goes-on/a-66383466", "urlToImage": "https://static.dw.com/image/66364731_6.jpg", "publishedAt": "2023-07-29T22:09:20Z", "content": "After the International Criminal Court issued a warrant for his arrest in spring for war crimes in Ukraine, this week's summit with African leaders in St. Petersburg served as a rare opportunity for … [+6134 chars]"}]}