{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "John Bowker", "title": "ACSA builds defence against pandemic resurgence - News24", "description": "Airports Company South Africa is looking to generate more income from hotels and land, win service contracts and boost cargo revenue to prepare for a potential fresh wave of Covid-19 infections and restrictions.", "url": "https://www.news24.com/fin24/companies/acsa-builds-defence-against-pandemic-resurgence-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11700/d85c06f3c87f4f0ca84153819b2c9beb.jpg", "publishedAt": "2021-10-20T04:07:03Z", "content": "Airports Company South Africa (ACSA) is looking to generate more income from hotels and land, win service contracts and boost cargo revenue to prepare for a potential fresh wave of Covid-19 infection… [+1795 chars]"}, {"source": {"id": null, "name": "Vanguard"}, "author": null, "title": "Nigerian American-based music executive, Akeju launches Faces of Afrobeats to celebrate African stars - Vanguard", "description": "Afrobeats, a fusion of pop sound originating from Afrobeat, a music genre which involves the combination of elements of West African musical styles such as fuji music", "url": "https://www.vanguardngr.com/2021/10/nigerian-american-based-music-executive-akeju-launches-faces-of-afrobeats-to-celebrate-african-stars/", "urlToImage": "https://cdn.vanguardngr.com/wp-content/uploads/2021/10/Akeju.jpg", "publishedAt": "2021-10-20T02:28:00Z", "content": "Afrobeats, a fusion of pop sound originating from Afrobeat, a music genre which involves the combination of elements of West African musical styles such as fuji music and highlife has earned wide rep… [+1813 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mark Heywood", "title": "EXCESS DEATHS: 264809 deaths later: Covid-19's terrifying toll on South Africa, almost three times the official figure - Daily Maverick", "description": "How does South Africa measure the scale of its Covid-19 epidemic? ‘Corpses are the one certainty. From the outset, scientists knew that counting deaths would give us the most accurate information about what is happening with the Covid epidemic in South Africa…", "url": "https://www.dailymaverick.co.za/article/2021-10-20-264809-deaths-later-covid-19s-terrifying-toll-on-south-africa-almost-three-times-the-official-figure/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/MC-Excess-Death-1-scaled.jpg", "publishedAt": "2021-10-19T22:33:19Z", "content": "Responding to questions about the Covid-19 death rate in SA and the systems being used to quantify it, Tom Moultrie, director of UCTs Centre for Actuarial Research, explained how since 3 May 2020, th… [+7946 chars]"}, {"source": {"id": null, "name": "Cbn.co.za"}, "author": "https://www.cbn.co.za/author/jadine/", "title": "NERSA, Eskom head to court over pricing - Cape Business News", "description": "The National Energy Regulator of South Africa (NERSA) says it is studying a court application by Eskom, which seeks to compel the energy regulator to reconsider Eskom’s tariff increase application. This as NERSA rejected Eskom’s multi-year electricity tariff …", "url": "https://www.cbn.co.za/news/electrical-industry-contractors-suppliers/nersa-eskom-head-to-court-over-pricing/", "urlToImage": "https://www.cbn.co.za/wp-content/uploads/2021/10/nersaeskom-1.jpg", "publishedAt": "2021-10-19T16:18:42Z", "content": "The National Energy Regulator of South Africa (NERSA) says it is studying a court application by Eskom, which seeks to compel the energy regulator to reconsider Eskoms tariff increase application.\r\nT… [+1628 chars]"}, {"source": {"id": null, "name": "Ecr.co.za"}, "author": null, "title": "Surprise! Couple discover stowaway in their luggage as they check in for flight - East Coast Radio", "description": "Hot music; cool people. Come chill on the east coast of South Africa, home to East Coast Radio, KwaZulu-Natal’s leading commercial radio station. Laughs, news, traffic, interviews, sport, jokes and great music – We play KZN’s Widest Variety Of Hit Music, Now …", "url": "https://www.ecr.co.za/", "urlToImage": "", "publishedAt": "2021-10-19T13:47:00Z", "content": "Trying to sneak onto an aeroplane is risky business.\r\nREAD: Buy your #ECRSummerBodyBootcamp ticket here\r\nThere is almost no way you can navigate your way through an airport without showing your board… [+1771 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sizwe Sama Yende", "title": "Botswana president praises controversial Khato Civils - News24", "description": "Botswana president Mokgweetsi Masisi has applauded a South African company – which is fighting to clear its name locally over a R3.5 billion water project – for completing a P900 million (R1.169 billion) water pipeline in his country within budget and record …", "url": "https://www.news24.com/citypress/news/botswana-president-praises-controversial-khato-civils-20211018", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8564/1404c00c7b074bc588af088e5a4f5006.jpg", "publishedAt": "2021-10-18T12:07:24Z", "content": "NEWS\r\nBotswana president Mokgweetsi Masisi has applauded a South African company – which is fighting to clear its name locally over a R3.5 billion water project – for completing a P900 million (R1.16… [+3112 chars]"}]}