{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Charlen Raymond", "title": "X3, Hilux, Polo... Locally-built vehicles that are exported to global markets | Wheels - News24", "description": "South Africa is a hub for vehicle manufacturing, with most models exported to numerous international markets.", "url": "https://www.news24.com/wheels/news/sa_vehicle_sales/x3-hilux-polo-locally-built-vehicles-that-are-exported-to-global-markets-20211013-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11653/f8b6abc19ba541d7a8bcc8aa8246a31b.jpg", "publishedAt": "2021-10-13T02:31:45Z", "content": "• South Africa is a vehicle production hub that exports to global markets.\r\n• Ford, Toyota and BMW are among the automakers that build vehicles locally.\r\n• South Africa produces bakkies, SUVs and pas… [+2352 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "Matt Hancock appointed UN special envoy to help Covid recovery in Africa - The Guardian", "description": "Former health secretary’s role comes as MPs release damning report into UK’s pandemic response", "url": "https://amp.theguardian.com/politics/2021/oct/12/matt-hancock-appointed-un-special-envoy-to-help-covid-recovery-in-africa", "urlToImage": null, "publishedAt": "2021-10-12T20:19:00Z", "content": "Matt HancockFormer health secretarys role comes as MPs release damning report into UKs pandemic response\r\nTue 12 Oct 2021 21.19 BST\r\nMatt Hancock has announced he has been appointed a special represe… [+3399 chars]"}, {"source": {"id": null, "name": "expressandstar.com"}, "author": null, "title": "Activists carry coffins down Whitehall ahead of Covid-19 vaccine patent talks - expressandstar.com", "description": "Last year, India and South Africa called on the WTO to suspend its enforcement of patents amid the pandemic.", "url": "https://www.expressandstar.com/news/uk-news/2021/10/12/activists-carry-coffins-down-whitehall-ahead-of-covid-19-vaccine-patent-talks/", "urlToImage": "https://www.expressandstar.com/resizer/EAit0l7wVHtjfB0dbNA1_ead1y0=/1200x0/cloudfront-us-east-1.images.arcpublishing.com/mna/TTCIAXMFQJAYZOESYBZ6LNFTAU.jpg", "publishedAt": "2021-10-12T19:55:19Z", "content": "Activists have carried coffins down Whitehall to highlight global Covid-19 deaths ahead of crunch vaccine patent talks.\r\nThe protest, organised by campaign group Global Justice Now, comes as a World … [+1763 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Tunde Eludini", "title": "Zikora Emerges Winner of 2021 Heineken Design Fashion Africa Competition - Premium Times", "description": "Top Nigerian and African designers partook in the competition", "url": "https://www.premiumtimesng.com/entertainment/naija-fashion/489549-zikora-emerges-winner-of-2021-heineken-design-fashion-africa-competition.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/10/1-4.jpg", "publishedAt": "2021-10-12T17:22:16Z", "content": "Zikoranachukwuebuka Ikebuaku of Zikora has emerged winner of the Heineken Design Fashion Africa (DFA) Showcase 2021 held at the Eko Convention Center, over the weekend in Lagos.\r\nThe winner was then … [+3218 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "Chemicals in shampoo and makeup are linked to early death, study finds - Business Insider South Africa", "description": "Phthalates are found in hundreds of consumer products, including food storage containers, shampoo, makeup, perfume, and children's toys.", "url": "https://www.insider.com/chemicals-in-shampoo-makeup-linked-to-early-death-study-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11674/4c36030448c849b8a1408740b54c96d0.jpg", "publishedAt": "2021-10-12T17:20:37Z", "content": "Exposure to a common class of chemicals called phthalates is linked to premature deaths, especially due to heart disease, according to a new study published on Tuesday in Environmental Pollution.\r\nTh… [+2988 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This is where South Africa is heading right now: IMF - BusinessTech", "description": "The International Monetary Fund (IMF) has published its latest growth outlook for the world’s major markets, with the group forecasting that the global economic recovery is set to continue, despite the resurgence of Covid-19 in parts of the world.", "url": "https://businesstech.co.za/news/finance/528608/this-is-where-south-africa-is-heading-right-now-imf/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/SouthAfrica-e1622546460781.jpg", "publishedAt": "2021-10-12T13:44:51Z", "content": "The International Monetary Fund (IMF) has published its latest growth outlook for the world’s major markets, with the group forecasting that the global economic recovery is set to continue, despite t… [+4333 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "SAA starts flying to Mauritius in November – and its tickets are the cheapest - Business Insider South Africa", "description": "South Africa's national carrier will restart its flights to Mauritius in November, and is undercutting its direct competitors.", "url": "https://www.businessinsider.co.za/saa-flights-to-mauritius-ticket-prices-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11672/1b9f3db04c7545659841c40bb1686636.jpg", "publishedAt": "2021-10-12T12:52:16Z", "content": "<ul><li>South African Airways will start flying to Mauritius again on 21 November.</li><li>The airline is already taking bookings, with its direct, one-way tickets cheaper than all its local competit… [+3016 chars]"}, {"source": {"id": null, "name": "Stuff.co.za"}, "author": "Brett Venter", "title": "Nokia TVs will soon be available to South African viewers, exclusively through Ellies » Stuff - Stuff Magazines", "description": "Nokia used to be the biggest name in cellular phones before Apple came along and launched the smartphone. Ever since then, the company has attempted to find", "url": "https://stuff.co.za/2021/10/12/nokia-tvs-south-africa-via-ellies/", "urlToImage": "https://stuff.co.za/wp-content/uploads/2021/10/Nokia-TVs-main.jpg", "publishedAt": "2021-10-12T11:52:42Z", "content": "Nokia used to be the biggest name in cellular phones before Apple came along and launched the smartphone. Ever since then, the company has attempted to find its footing again. It did a stint as a Mic… [+1600 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "Super Eagles not the best African team – Ikpeba - Daily Post Nigeria", "description": "Former Nigeria striker, Victor Ikpeba, has claimed the Super Eagles are not the best team in African football at the moment. Ikpeba stated this in reaction to the team's mixed results in their recent 2022 World Cup qualifying matches. The three-time African c…", "url": "https://dailypost.ng/2021/10/12/super-eagles-not-the-best-african-team-ikpeba/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/11/super-eagles-1.jpg", "publishedAt": "2021-10-12T09:41:49Z", "content": "Former Nigeria striker, Victor Ikpeba, has claimed the Super Eagles are not the best team in African football at the moment.\r\nIkpeba stated this in reaction to the team’s mixed results in their recen… [+713 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mark Heywood", "title": "Maverick Citizen: Tuesday Editorial: South Africa's mental health epidemic: Love Don't Live here Anymore - Daily Maverick", "description": "This is a scream for help that, tragically, will fall on deaf ears. People will harm themselves, harm others and some will die because the government will ignore what I am about to write.", "url": "https://www.dailymaverick.co.za/article/2021-10-12-south-africas-mental-health-epidemic-love-dont-live-here-anymore/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/OD-MC-tuesdayEd.jpg", "publishedAt": "2021-10-12T09:00:52Z", "content": "Research reports from the National Income Dynamics Coronavirus Rapid Mobile Survey (NIDS-CRAM) have documented increasing anxiety and deteriorating mental health as a result of Covid-19. (Photo: cnet… [+8323 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Britain's largest port, which handles nearly 40% of all containers, is facing massive backlog of ships - Business Insider South Africa", "description": "The logjam is due, in part, to a shortage of drivers certified to operate heavy goods vehicles, known as HGV drivers. It may need to turn ships away.", "url": "https://www.businessinsider.com/britains-largest-port-so-busy-it-may-turn-ships-away-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10484/d2d60629a6d94d75bfc3ced9a740b0fb.jpg", "publishedAt": "2021-10-12T08:02:19Z", "content": "The largest container port in the UK is taking steps to address increasing cargo congestion but may begin turning incoming ships away if the problem persists, according to ITV News.\r\nThe Port of Feli… [+1937 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "South Africa is in a ‘good place’, with all provinces clear of the third wave of Covid-19; industry tries to sweeten the deal for striking workers; three weeks into its relaunch, SAA’s problems are mounting; and National Treasury has banned the use of foreign…", "url": "https://businesstech.co.za/news/government/528270/5-important-things-happening-in-south-africa-today-1142/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/10/Cosatu-strike.png", "publishedAt": "2021-10-12T06:15:27Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 201 new cases of Covid-19, taking the total reported to 2,912,346. Deaths have reached 88,… [+3323 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Sasha Planting", "title": "A hydrogen economy: Green is the new black - Daily Maverick", "description": "A new report predicts South Africa’s hydrogen economy could add between $3.9bn and $8.8bn to the country’s GDP by 2050. Not to mention thousands of jobs.", "url": "https://www.dailymaverick.co.za/article/2021-10-11-a-hydrogen-economy-green-is-the-new-black/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/BM-Sasha-greenhydrogen-subbedmv.jpeg", "publishedAt": "2021-10-11T19:07:27Z", "content": "(Image: Adobe Stock) \r\nSolar panels, wind turbines and lithium-ion batteries are setting the world on course towards a clean energy future. But to accelerate the pace of change and avert a climate ca… [+5976 chars]"}]}