{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": "Abiodun Sivowaku", "title": "HMD Global, TD Africa Collaborate As Nokia T20 Hits Market - LEADERSHIP NEWS", "description": "HMD Global and TD Africa have collaborated to unveil the first ever tablet in the Nokia mobile stable – the Nokia T20- into the Nigerian market. The device which offers users a suite of cutting-edge functionalities, the device was formally launched in the Nig…", "url": "https://leadership.ng/hmd-global-td-africa-collaborate-as-nokia-t20-hits-market/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/03/nokia-logo.jpg", "publishedAt": "2021-11-07T06:25:23Z", "content": "HMD Global and TD Africa have collaborated to unveil the first ever tablet in the Nokia mobile stable the Nokia T20- into the Nigerian market.\r\nThe device which offers users a suite of cutting-edge f… [+1626 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Elon Musk proposes selling 10% of his Tesla stock in a Twitter poll - Business Insider South Africa", "description": "In the Twitter poll, Tesla CEO Elon Musk promised to \"abide by the results of this poll, whichever way it goes.\"", "url": "https://www.businessinsider.com/elon-musk-proposes-selling-10-percent-tesla-stock-twitter-poll-2021-11", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/627/839d38e74034403c9b6e0eb28a246043.jpg", "publishedAt": "2021-11-07T06:04:00Z", "content": "Billionaire Elon Musk on Saturday asked his Twitter followers to decide whether he should sell 10% of his Tesla stock, promising to \"abide by the results of this poll, whichever way it goes.\" \r\n\"Much… [+2016 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major shift in power as coalitions look to give the ANC the boot: report - BusinessTech", "description": "Coalition talks among South Africa’s biggest parties are ongoing, with reports from inside the negotiations pointing to a massive shift of power in the country’s biggest metros.", "url": "https://businesstech.co.za/news/government/535142/major-shift-in-power-as-coalitions-look-to-give-the-anc-the-boot-report/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/ANC-scaled-e1612863440650.jpg", "publishedAt": "2021-11-07T05:32:43Z", "content": "Coalition talks among South Africa’s biggest parties are ongoing, with reports from inside the negotiations pointing to a massive power shift in the country’s biggest metros.\r\nHeadlining the talks is… [+3339 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Cricketnext Staff", "title": "T20 World Cup: Jason Roy Breaks Into Tears After Getting Injured During South Africa Clash - WATCH - News18", "description": "The incident happened off the first ball of the fifth over when Jos Buttler called through for a single. Roy took off from the non-striker's end and picked up the injury midway.", "url": "https://www.news18.com/cricketnext/news/t20-world-cup-jason-roy-breaks-into-tears-after-getting-injured-during-south-africa-clash-watch-4413614.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-design-4-5-163625492116x9.jpg", "publishedAt": "2021-11-07T02:54:47Z", "content": "England dealt with a major blow on Saturday as opener Jason Roy suffered a calf injury during the chase of 190 against South Africa in Sharjah. The injury seemed serious as the English could barely w… [+1696 chars]"}, {"source": {"id": null, "name": "Newshub"}, "author": null, "title": "'Disgusting', 'outrageous' pitch invader ruins try-scoring chance for Wales against South Africa - Newshub", "description": "The fans in Cardiff made their feelings known as they tossed beer on the pitch invader.", "url": "https://www.newshub.co.nz/home/sport/2021/11/disgusting-outrageous-pitch-invader-ruins-try-scoring-chance-for-wales-against-south-africa.html", "urlToImage": "https://www.newshub.co.nz/home/sport/2021/11/disgusting-outrageous-pitch-invader-ruins-try-scoring-chance-for-wales-against-south-africa/_jcr_content/par/video/image.dynimg.1280.q75.jpg/v1636245586666/GettyImages-1351714397%2B%25281%2529.jpg", "publishedAt": "2021-11-07T00:39:31Z", "content": "It's the second time in two weeks the Principality Stadium has seen a pitch invader get onto the field after 'Jarvo' lined up with the All Blacks for the New Zealand national anthem. \r\nWales legends … [+577 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Mysterious patches of glass scattered across Chilean desert likely products of ancient exploding comet - Business Insider South Africa", "description": "Heat from a comet explosion likely melted and fused soil in the Chilean desert, transforming it into massive patches of glass.", "url": "https://www.businessinsider.com/glass-patches-chile-desert-comet-explosion-2021-11", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11759/3cc01b9e643647e09dc794c064d3202b.jpg", "publishedAt": "2021-11-06T08:24:02Z", "content": "At first glance, the Atacama Desert in northern Chile looks like a forgotten wasteland. It's one of the driest places on Earth, with a climate so arid that few animal species can survive. Humans are … [+4133 chars]"}, {"source": {"id": null, "name": "Sowetourban.co.za"}, "author": "rivellegovindsamy", "title": "The latest on Covid-19: Voting day was 'Covid-19 compliant', and global syringe shortage could hamper Africa's 2022 vaccination roll-out - Soweto Urban", "description": "Voting day declared free, fair and Covid-19 compliantThe Electoral Commission of South Africa (IEC) did its part in ensuring voters, election officials and party representatives were safe on Election", "url": "https://sowetourban.co.za/94826/the-latest-on-covid-19-voting-day-was-covid-19-compliant-and-global-syringe-shortage-could-hamper-africas-2022-vaccination-roll-out/", "urlToImage": "https://sowetourban.co.za/wp-content/uploads/sites/112/2021/11/Round-up-_-5-_-11-_-2021-scaled.jpg", "publishedAt": "2021-11-06T06:46:09Z", "content": "Voting day declared free, fair and Covid-19 compliant\r\nThe Electoral Commission of South Africa (IEC) did its part in ensuring voters, election officials and party representatives were safe on Electi… [+2693 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Fashola, Fayemi to Mobilise N10 Billion to Boost Medical Research Development - AllAfrica.com", "description": "The Minister of Works and Housing, Babatunde Fashola who also doubles as the Chairman, Board of Trustees, Nigerian Institute of Medical Research (NIMR) Foundation, has announced plan to mobilise N10 billion to support medical research initiatives.", "url": "https://allafrica.com/stories/202111050390.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-11-05T10:00:36Z", "content": "The Minister of Works and Housing, Babatunde Fashola who also doubles as the Chairman, Board of Trustees, Nigerian Institute of Medical Research (NIMR) Foundation, has announced plan to mobilise N10 … [+5836 chars]"}]}