{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Mothers adopt Seasonal Malaria chemoprevention drugs to keep malaria at bay in Adamawa State - WHO | Regional Office for Africa", "description": "Yola, 30 September, 2022 - Sitting on a wooden stool in front of her house at Dobeli community in Yola North Local Government Area (LGA), Hajara Yusuf, a (27 years old mother of three) was coaxing her sons to take the seasonal malaria chemoprevention (SMC) dr…", "url": "https://www.afro.who.int/countries/nigeria/news/mothers-adopt-seasonal-malaria-chemoprevention-drugs-keep-malaria-bay-adamawa-state", "urlToImage": "https://www.afro.who.int/sites/default/files/styles/teaser_thumbnail_600x600_/public/2022-09/Hajara%20a%20caregiver%2C%20administering%20malaria%20drug%20to%20her%20eligible%20child..jpg?itok=TYmi2bEr", "publishedAt": "2022-09-30T10:30:28Z", "content": "Yola, 30 September, 2022 - Sitting on a wooden stool in front of her house at Dobeli community in Yola North Local Government Area (LGA), Hajara Yusuf, a (27 years old mother of three) was coaxing he… [+4325 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Why Has My Cold Dragged On So Long? and How Do I Know When It's Morphed Into Something More Serious? - AllAfrica - Top Africa News", "description": "Analysis - Common colds are caused by viruses. There are no effective cures, and antibiotics do not work on viruses, so treatment is targeted at managing the symptoms until your immune system has cleared the cold.", "url": "https://allafrica.com/stories/202209300115.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-30T07:22:38Z", "content": "Common colds are caused by viruses. There are no effective cures, and antibiotics do not work on viruses, so treatment is targeted at managing the symptoms until your immune system has cleared the co… [+5300 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Getting Fit After Covid? Why You Should Be Strength Training - and How to Do It - AllAfrica - Top Africa News", "description": "Analysis - After recovering from COVID, you might be eager to get out and do some exercise, particularly if you'd previously enjoyed keeping fit. While a bit of light cardiovascular training can be a good option, strength training has some particular advantag…", "url": "https://allafrica.com/stories/202209300114.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-30T07:22:38Z", "content": "After recovering from COVID, you might be eager to get out and do some exercise, particularly if you'd previously enjoyed keeping fit. While a bit of light cardiovascular training can be a good optio… [+6558 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The CCMA awards Eskom employees another wage increase; Bain has been banned from public contracts in South Africa for a period of 10 years; Ramaphosa denies money laundering claims; and energy minister Gwede Mantashe insists South Africa has enough electricit…", "url": "https://businesstech.co.za/news/business/629915/5-important-things-happening-in-south-africa-today-1376/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Solar-grid-Eskom.jpg", "publishedAt": "2022-09-30T06:00:44Z", "content": "Heres what is happening in and affecting South Africa today:\r\n<ul><li>Wage increase for Eskom: The CCMA awarded Eskom employees a further 1.5% wage increase, backdated to July 2021. These are unionis… [+2337 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "Rain proposes that Telkom should buy it - MyBroadband", "description": "Rain believes that joining forces with Telkom could create a strong third mobile network operator and “5G powerhouse” in South Africa.", "url": "https://mybroadband.co.za/news/business-telecoms/462613-rain-proposes-that-telkom-should-buy-it.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/08/Telkom-logo-on-Groenkloof-tower.jpg", "publishedAt": "2022-09-30T05:58:03Z", "content": "Telkom has confirmed it received an offer from Rain in mid-September proposing that Telkom acquire Rain in exchange for shares.\r\n“Shareholders are advised that Telkom received a non-binding proposal … [+2102 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": null, "title": "Glo ambassador role thrills Amusan - Punch Newspapers", "description": "World, Commonwealth and African women’s 100m hurdles champion Tobi Amusan is delighted after she was officially unveiled as an ambassador of Nigeria’s digital and telecommunications services provider, Globacom on Thursday in Lagos.", "url": "https://punchng.com/glo-ambassador-role-thrills-amusan/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/08/05213657/hqdefault.jpeg", "publishedAt": "2022-09-29T21:13:45Z", "content": "World, Commonwealth and African womens 100m hurdles champion Tobi Amusan is delighted after she was officially unveiled as an ambassador of Nigerias digital and telecommunications services provider, … [+2373 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Carin Smith", "title": "Licensing council cancels some of SAA's unused flight frequencies - News24", "description": "The International Air Services Council has cancelled some flight frequencies of South African Airways, because they have not been used.", "url": "https://www.news24.com/fin24/companies/licensing-council-cancels-some-of-saas-unused-flight-frequencies-20220929-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7215/3b21473a9181466bbe64d7a831a0bf0b.jpg", "publishedAt": "2022-09-29T15:57:15Z", "content": "<ul><li>The International Air Services Council has cancelled some flight frequencies of SAA because they have not been used.</li><li>After deliberations in September, the council decided to cancel so… [+5406 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Paola Rosa-Aquino,Morgan McFall-Johnsen", "title": "Harrowing views of Hurricane Ian from air and space show how large and powerful the storm is | Businessinsider - Business Insider South Africa", "description": "Satellites and the International Space Station tracked the hurricane as it unleashed dangerous winds and life-threatening storm surge over Florida.", "url": "https://www.businessinsider.co.za/photos-satellites-astronauts-planes-show-hurricane-ian-size-power-2022-9", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3953/588417f372b0450197f3ac3991460028.jpg", "publishedAt": "2022-09-29T10:29:23Z", "content": "Astronauts aboard the International Space Station got a glimpse of mighty Hurricane Ian as it made landfall on Florida's west coast Wednesday afternoon.\r\nThe ISS flew over the storm, beaming down spe… [+2587 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Murray Swart", "title": "A single South African among URC top achievers - SARugbymag", "description": "Only one South African has been listed among the Vodacom United Rugby Championship’s top players in the second round.", "url": "https://www.sarugbymag.co.za/single-south-african-among-urc-top-achievers/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/09/SH_12980557ah.jpg", "publishedAt": "2022-09-29T08:23:22Z", "content": "Only one South African has been listed among the Vodacom United Rugby Championships top players in the second round.\r\nVodacom Bulls hooker Johan Grobbelaar had a standout performance in his sides 33-… [+836 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bobi Wine, Zitto Kabwe, Marie-Noelle Nwokolo and Greg Mills", "title": "Why Ukraine's inevitable victory against Russia will be... - Daily Maverick", "description": "Ukraine should continue to inspire African democrats to fight back. To neglect the Ukrainian struggle or, worse, to take the side of Russia, is to take the side of authoritarianism over democracy, of might over what is right.", "url": "https://www.dailymaverick.co.za/article/2022-09-29-why-ukraines-inevitable-victory-against-russia-will-be-a-win-for-africa/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/09/GettyImages-132735497.jpg?w=1280", "publishedAt": "2022-09-29T03:29:31Z", "content": "Ukraine will win this war against Russia. When it does, it will be a victory for Africa, since oppression threatens freedom everywhere.\r\nIts not just because Ukrainian commanders have outwitted their… [+8682 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Middle-class South Africans are looking for a way out - BusinessTech", "description": "A survey conducted by online market research group InfoQuest shows that one in five working South Africans is either actively making inquiries about leaving the country or are already on their way out the door.", "url": "https://businesstech.co.za/news/lifestyle/629432/middle-class-south-africans-are-looking-for-a-way-out/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/ExitSign-e1631865272252.jpeg", "publishedAt": "2022-09-28T14:42:52Z", "content": "A survey conducted by online market research group InfoQuest shows that one in five working South Africans is either actively making inquiries about leaving the country or are already on their way ou… [+4621 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "John Ele-Ojo Ataguba, Mweete D. Nglazi", "title": "Obesity is on the rise among South African women -- a risk to maternal and child health - The Conversation", "description": "Obesity leads to a number of maternal and child health problems.", "url": "https://theconversation.com/obesity-is-on-the-rise-among-south-african-women-a-risk-to-maternal-and-child-health-189236", "urlToImage": "https://images.theconversation.com/files/484034/original/file-20220912-12-v49dqu.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-09-28T14:37:10Z", "content": "Obesity in adults has nearly tripled between 1975 and 2016 across the world. The World Health Organization estimated that by 2016, about 1.9 billion adults worldwide were overweight. More than 650 mi… [+4537 chars]"}]}