{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Lameez Omarjee", "title": "SA records largest current account surplus on record - News24", "description": "South Africa's current account balance widened to its largest surplus ever at R343 billion, the SA Reserve Bank says.", "url": "https://www.news24.com/fin24/economy/sa-records-largest-current-account-surplus-on-record-20210909", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8923/cd05b0ad627241f79427bf7fff50aad2.jpg", "publishedAt": "2021-09-09T09:31:21Z", "content": "<ul><li>South Africa's current account balance has widened to its largest surplus ever at R343 billion, for the second quarter.</li><li>The current account surplus has been aided by a stronger trade … [+3153 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Amos Tauna", "title": "Military coup: ECOWAS mission to visit Guinea - Daily Post Nigeria", "description": "Following the military coup in Guinea, a mission of the Economic Community of West African States (ECOWAS) will visit the country today (Thursday). A communique issued late Wednesday evening after a virtual meeting of the organization, convened by its chairma…", "url": "https://dailypost.ng/2021/09/09/military-coup-ecowas-mission-to-visit-guinea/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2020/01/ecowas-flag-scaled.jpg", "publishedAt": "2021-09-09T07:43:14Z", "content": "Following the military coup in Guinea, a mission of the Economic Community of West African States (ECOWAS) will visit the country today (Thursday).\r\nA communique issued late Wednesday evening after a… [+1300 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Congo-Kinshasa: Meningitis Outbreak Declared in Democratic Republic of the Congo - WHO - AllAfrica.com", "description": "A deadly outbreak of meningitis has been declared in a northeastern province of the Democratic Republic of the Congo, where the World Health Organization (WHO) have been supporting health authorities to deploy an initial emergency response team.", "url": "https://allafrica.com/stories/202109090076.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-09-09T06:48:21Z", "content": "A deadly outbreak of meningitis has been declared in a northeastern province of the Democratic Republic of the Congo, where the World Health Organization (WHO) have been supporting health authorities… [+3433 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Zelim Nel", "title": "Curious absence of RG Snyman amplifies Bok success - SARugbymag", "description": "While the mysterious absence of RG Snyman has depowered the Bomb Squad, it has magnified South Africa's achievements in 2021, writes ZELIM NEL.", "url": "https://www.sarugbymag.co.za/curious-absence-of-rg-snyman-amplifies-bok-success/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2019/10/RG_Snyman_Franco_Mostert_Boks_replacement_looking_RWC_Steve_Haag-e1631105342306.jpg", "publishedAt": "2021-09-09T05:04:37Z", "content": "While the mysterious absence of RG Snyman has depowered the Bomb Squad, it has magnified South Africa’s achievements in 2021, writes ZELIM NEL.\r\nEben Etzebeth has proven he is more than capable of le… [+2605 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Londiwe Buthelezi", "title": "Pressure mounting to look at anti-vaxxers' premiums differently, says Momentum Metropolitan CEO | Fin24 - News24", "description": "As death claims continue to skyrocket unabated in South Africa, global reinsurers are putting pressure on local insurers to convince their clients to get vaccinated against Covid-19.", "url": "https://www.news24.com/fin24/companies/interview-pressure-mounting-to-look-at-anti-vaxxers-differently-says-momentum-metropolitan-ceo-20210909", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11555/057c0b791beb4a199fc289346b4423cb.jpg", "publishedAt": "2021-09-09T05:01:39Z", "content": "As death claims continue to skyrocket in South Africa, local insurers are at the mercy of global reinsurance giants. \r\nReinsurers are putting pressure on companies such as Momentum Metropolitan Holdi… [+532 chars]"}, {"source": {"id": null, "name": "Planetrugby.com"}, "author": "News Desk", "title": "Duane Vermeulen back, Cheslin Kolbe ruled out for Boks - planetrugby.com", "description": "South Africa have been bolstered by the return of Duane Vermeulen who comes into their starting team to face Australia on the Gold Coast on Sunday.", "url": "https://www.planetrugby.com/duane-vermeulen-starts-but-no-cheslin-kolbe-for-south-africa-against-australia-in-rugby-championship", "urlToImage": "https://d3gbf3ykm8gp5c.cloudfront.net/content/uploads/2021/09/08110257/Duane-Vermeulen-thumbs-up-at-South-Africa-training-PA.jpg", "publishedAt": "2021-09-08T10:08:23Z", "content": "South Africa have been bolstered by the return of Duane Vermeulen, who comes into their starting side to face Australia on the Gold Coast on Sunday.\r\nVermeulen will make his first appearance for the … [+4617 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "One of the best – Cape Verde coach reacts to 2-1 defeat to Nigeria - Daily Post Nigeria", "description": "Cape Verde head coach, Pedro ‘Bubista’ Leitão, has admitted they lost to one of the best teams in Africa, following their 2-1 defeat to Nigeria in a World Cup qualifying match on Tuesday. The hosts took a shock lead through Bryan Tavares, but the Super Eagles…", "url": "https://dailypost.ng/2021/09/08/one-of-the-best-cape-verde-coach-reacts-to-2-1-defeat-to-nigeria/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/09/Nigerian-Super-Eagles.jpg", "publishedAt": "2021-09-08T09:24:09Z", "content": "Cape Verde head coach, Pedro Bubista Leitão, has admitted they lost to one of the best teams in Africa, following their 2-1 defeat to Nigeria in a World Cup qualifying match on Tuesday.\r\nThe hosts to… [+1016 chars]"}]}