{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "TechCentral"}, "author": "Vox", "title": "How Vox is giving South African gamers the edge - TechCentral", "description": "Promoted | Integrated ICT and infrastructure provider Vox has launched Gaming Essentials, a quality-of-service feature that ensures a superior connectivity experience for local gamers.", "url": "https://techcentral.co.za/how-vox-is-giving-south-african-gamers-the-edge-voxprom/110938/", "urlToImage": "https://techcentral.co.za/wp-content/uploads/2021/09/mouse-2156-1120.jpg", "publishedAt": "2021-09-06T07:26:23Z", "content": "With pandemic-related lockdowns resulting in South Africans keeping to their homes, a growing number are turning to gaming as a form of entertainment, or even a livelihood, as can be seen with profes… [+3753 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Medical parole for Jacob Zuma heavily criticised; energy expert pours cold water on South Africa’s nuclear energy build news; disappearing data on Cell C’s network strikes again; and the ANC is in trouble, having missed deadlines for the 2021 elections.", "url": "https://businesstech.co.za/news/government/518558/5-important-things-happening-in-south-africa-today-1117/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2017/04/Zuma-2.jpg", "publishedAt": "2021-09-06T06:06:25Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 5,931 new cases of Covid-19, taking the total reported to 2,819,945. Deaths have reached 8… [+2985 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Adriaan Basson", "title": "Adriaan Basson | Being pro-vaccine is not progressive; it's normal - News24", "description": "It is abundantly clear that Covid-19 vaccines are safe and reduce deaths. We need an Herculean effort to vaccinate 60% of South Africans before the fourth wave hits, writes Adriaan Basson.", "url": "https://www.news24.com/news24/columnists/adriaanbasson/adriaan-basson-being-pro-vaccine-is-not-progressive-its-normal-20210905", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/6900/a0681c6a70514ebc9ab5ee769c4cf2aa.jpg", "publishedAt": "2021-09-06T03:00:37Z", "content": "It is abundantly clear that Covid-19 vaccines are safe and reduce deaths. We need an Herculean effort to vaccinate 60% of South Africans before the fourth wave hits,writes Adriaan Basson.\r\nIt is now … [+5149 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David McKenzie, CNN", "title": "Former South African President Zuma released from prison on medical parole - CNN", "description": "Jacob Zuma, the former South African President, has been released from prison on medical parole due to ill health, the government's correctional services department said Sunday.", "url": "https://www.cnn.com/2021/09/05/africa/jacob-zuma-medical-parole-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180206114738-01-jacob-zuma-0128-super-tease.jpg", "publishedAt": "2021-09-06T02:27:00Z", "content": "Johannesburg (CNN)Former South African President Jacob Zuma has been released from prison on medical parole due to ill health, the government's correctional services department said Sunday. \r\nZuma, 7… [+758 chars]"}, {"source": {"id": "cbc-news", "name": "CBC News"}, "author": null, "title": "Soldiers detain Guinea's president, dissolve government - CBC.ca", "description": "A Guinean army colonel seized control of state television on Sunday and declared that President Alpha Condé's government had been dissolved and the West African nation's borders will be closed, an announcement that came after hours of heavy gunfire erupted ne…", "url": "https://www.cbc.ca/news/world/soldiers-takeover-guinea-government-gunfire-1.6165536", "urlToImage": "https://i.cbc.ca/1.6165657.1630862226!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1235066552.jpg", "publishedAt": "2021-09-05T21:53:06Z", "content": "Mutinous soldiers in the West African nation of Guinea detained President Alpha Condé on Sunday after hours of heavy gunfire rang out near the presidential palace in the capital, then announced on st… [+4483 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "news24", "title": "Elite Guinea army unit says it's overthrown president - News24", "description": "Special forces soldiers apparently ousted Guinea's long-serving President Alpha Conde on Sunday, telling the West African nation they had dissolved its government and constitution and closed its land and air borders.", "url": "https://www.news24.com/news24/africa/news/elite-guinea-army-unit-says-its-overthrown-president-20210905", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11448/302d8161a554437dafabfd2bb169db20.jpg", "publishedAt": "2021-09-05T18:34:11Z", "content": "Special forces soldiers apparently ousted Guinea's long-serving President Alpha Conde on Sunday, telling the West African nation they had dissolved its government and constitution and closed its land… [+3389 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "editing", "title": "South Africa's Jailed Former President, Zuma To Serve Remaining Sentence On 'Medical Parole' - SaharaReporters.com", "description": "Zuma has been hospitalised since August 6, at a health facility outside the prison where he was incarcerated for ignoring a court order to testify before a judicial panel probing corruption during his nine-year tenure which lasted until 2018, NDTV reports.", "url": "http://saharareporters.com/2021/09/05/south-africas-jailed-former-president-zuma-serve-remaining-sentence-medical-parole", "urlToImage": null, "publishedAt": "2021-09-05T17:30:47Z", "content": "South Africa's former president Jacob Zuma, jailed in July for contempt of court after snubbing graft investigators, was on Sunday granted medical parole, prison authorities announced.\r\nZuma has been… [+1260 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "The iPhone 13 could finally lose the dreaded notch. Here are 3 new features to expect on the device. - Business Insider South Africa", "description": "Apple's big iPhone reveal event is expected any day now, but we already know a few key details to expect on the next iPhone.", "url": "https://www.businessinsider.com/apple-iphone-13-what-to-expect-details-2021-9", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10380/41b919cc4f104ac082f53063571aa962.jpg", "publishedAt": "2021-09-05T14:17:32Z", "content": "Apple's annual update to the iPhone line is coming any day: An event is usually held in mid- to late-September at the company's California headquarters, with the subsequent launch of a new line of iP… [+2849 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Getrude Makhafola", "title": "Defend yourselves and others 'within the confines of the law', Ramaphosa tells police officers - News24", "description": "President Cyril Ramaphosa has called on police officers to defend their own lives and those of law abiding South Africans \"within the confines of the law\".", "url": "https://www.news24.com/news24/southafrica/news/defend-yourselves-and-others-within-the-confines-of-the-law-ramaphosa-tells-police-officers-20210905", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10340/dfbf8c7aaf524cf4821216b6c52213e0.jpg", "publishedAt": "2021-09-05T12:18:23Z", "content": "<ul><li>President Cyril Ramaphosa called on police officers to legally defend their own lives and those of citizens against criminals.</li><li>Ramaphosa on Sunday paid tribute to 34 police officers w… [+3875 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "South Africa banning 50ppm diesel - MyBroadband", "description": "The government has published regulations that will ban the sale of diesel grades with more than 10 parts per million (10ppm) in two years’ time.", "url": "https://mybroadband.co.za/news/motoring/412622-south-africa-banning-50ppm-diesel.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/08/fuel-1596622_1920.jpg", "publishedAt": "2021-09-04T14:19:53Z", "content": "South Africa published regulations that lower the sulfur content allowed in the countrys diesel fuel, which may force some oil refineries to upgrade in order to meet the standards.\r\nDiesel grades all… [+811 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Coronavirus – South Africa: More COVID-19 Vaccines Needed in Africa - Guardian", "description": "Download logo At least 80% of African countries are expected to miss the global target of vaccinating at least 10% of their populations against COVID-19 by the end of September. This was revealed by World Health Organisation (WHO) regional director for Africa…", "url": "https://guardian.ng/apo-press-releases/coronavirus-south-africa-more-covid-19-vaccines-needed-in-africa/", "urlToImage": "https://www.africa-newsroom.com/files/large/912c4d03d14212b", "publishedAt": "2021-09-04T12:00:00Z", "content": "Download logo\r\nAt least 80% of African countries are expected to miss the global target of vaccinating at least 10% of their populations against COVID-19 by the end of September.\r\nThis was revealed b… [+1855 chars]"}]}