{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Quinton de Kock surprised Cricket South Africa with refusal to take a knee, chairman Lawson Naidoo says - ABC News", "description": "Cricket South Africa chairman Lawson Naidoo says Quinton de Kock is not a racist, but was caught off-guard by his decision to withdraw from a match instead of taking a knee.", "url": "https://www.abc.net.au/news/2021-10-28/quinton-de-kock-cricket-south-africa-taking-the-knee/100574984", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/e79786d02e41aa8c792b4e185f648c26?impolicy=wcms_crop_resize&cropH=765&cropW=1360&xPos=766&yPos=100&width=862&height=485", "publishedAt": "2021-10-27T23:18:23Z", "content": "Cricket South Africa chairman Lawson Naidoo says Quinton de Kock is unlikely to face punishment for his refusal to take a knee before matches.\r\nKey points:\r\n<ul><li>CSA chairman Lawson Naidoo said th… [+4432 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Fiona Harvey", "title": "World’s chief scientists urge Cop26 attendees to step up low-carbon policies - The Guardian", "description": "Signatories include scientists from US, EU, India and African and South American countries", "url": "https://amp.theguardian.com/environment/2021/oct/28/world-leading-scientists", "urlToImage": null, "publishedAt": "2021-10-27T20:43:23Z", "content": "Cop26Signatories include scientists from US, EU, India and African and South American countries\r\nThu 28 Oct 2021 00.01 BST\r\nChief scientists and presidents of the national science academies of more t… [+4233 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Maryam Abdullahi", "title": "UNICEF: Less than five percent of African population fully vaccinated against COVID - TheCable", "description": "The United Nations Children’s Fund (UNICEF) says less than five percent of the African population has been fully vaccinated against...", "url": "https://www.thecable.ng/unicef-less-than-five-percent-of-african-population-fully-vaccinated-against-covid", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2021/03/TAKING-COVID-19-VACCINE1-e1631697094455.png", "publishedAt": "2021-10-27T18:25:00Z", "content": "The United Nations Childrens Fund (UNICEF) says less than five percent of the African population has been fully vaccinated against the coronavirus.\r\nIn a statement on Wednesday, UNICEF expressed conc… [+2664 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Blackhole with warped accretion disc discovered - Phys.org", "description": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Galaxy, 9,600 light-years from Earth, which they conclude is ca…", "url": "https://phys.org/news/2021-10-blackhole-warped-accretion-disc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/blackhole-with-warped.jpg", "publishedAt": "2021-10-27T16:52:47Z", "content": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Gal… [+5434 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "New pictures show how Apple kept design of first iPod secret by making prototypes look ridiculous - Business Insider South Africa", "description": "This early iPod prototype looks nothing like an iPod, and the device's inventor said the boxy design prevented staff from leaking the final product.", "url": "https://www.businessinsider.com/early-ipod-prototype-photos-disguised-design-2021-10", "urlToImage": "https://i.insider.com/61780bdf5d1dca0019a0fff9?width=1200&format=jpeg", "publishedAt": "2021-10-27T16:20:35Z", "content": "Before former Apple CEO Steve Jobs unveiled what would become the world's most popular portable music player, Apple's iPod was a massive, unwieldy device that looked nothing like the final product.\r\n… [+1667 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "https://www.facebook.com/nkooverjee", "title": "All-new Range Rover revealed with advanced tech and BMW power - Carmag South Africa", "description": "The all-new Range Rover has been unveiled after a number of leaks. The new luxury SUV brings with it an array of powertrain options together with a series of advanced technological features. The flagship offering will be available with a choice of two wheelba…", "url": "https://www.carmag.co.za/news/new-models/new-range-rover-revealed/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2021/10/All-new-Range-Rover-revealed-with-advanced-tech-and-BMW-power-2.jpg", "publishedAt": "2021-10-27T06:39:24Z", "content": "The all-new Range Rover has been unveiled after a number of leaks. The new luxury SUV brings with it an array of powertrain options together with a series of advanced technological features. The flag… [+2928 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Nicole McCain", "title": "Covid-19: South Africa records 331 new infections and 53 deaths - News24", "description": "South Africa recorded 331 new confirmed Covid-19 infections on Tuesday and 53 deaths, bringing the confirmed death toll to 88 987. To date, 14 898 866 people in South Africa are fully vaccinated against Covid-19.", "url": "https://www.news24.com/news24/southafrica/news/covid-19-south-africa-records-331-new-infections-and-53-deaths-20211027", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11606/bd249a2c407546929d53b321ad47a587.jpg", "publishedAt": "2021-10-27T04:37:34Z", "content": "<ul><li>South Africa recorded 331 new confirmed Covid-19 infections on Tuesday.</li><li>53 new deaths have been recorded, bringing the confirmed death toll to 88 987.</li><li>Gauteng accounted for 23… [+1519 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Covid-19 Pandemic Hampers Mental Health Services - Minister Phaahla - AllAfrica.com", "description": "Health Minister, Dr Joe Phaahla, says South Africa still has a long way to go to recover from the effects of the COVID-19 pandemic to rebuild the country's health system and improve mental health services.", "url": "https://allafrica.com/stories/202110260195.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-10-26T08:50:42Z", "content": "Health Minister, Dr Joe Phaahla, says South Africa still has a long way to go to recover from the effects of the COVID-19 pandemic to rebuild the country's health system and improve mental health ser… [+3841 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Good news for South Africans travelling to the US - BusinessTech", "description": "The US published new rules for travellers on Monday (25 October), removing its country-by-country restrictions and instead introducing international restrictions based on the vaccination status of individual travellers.", "url": "https://businesstech.co.za/news/lifestyle/532024/good-news-for-south-africans-travelling-to-the-us/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2021-10-26T06:52:07Z", "content": "The US has published new rules for travellers, removing its country-by-country travel restrictions and instead introducing international restrictions based on the vaccination status of individual tra… [+4908 chars]"}]}