{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "King Charles welcomes South Africa's Cyril Ramaphosa at start of state visit - BBC", "description": "The monarch formally greets South Africa's president ahead of a series of official events in London.", "url": "https://www.bbc.com/news/uk-63711177", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/5DC4/production/_127740042_fb5bca579a5c8d5f402f8aa7b10bd2f4d338d33e0_81_2907_16351000x563.jpg", "publishedAt": "2022-11-22T13:48:00Z", "content": "The King has welcomed South Africa's president at the start of the first state visit he is hosting as monarch.\r\nKing Charles and Camilla, the Queen Consort, formally greeted Cyril Ramaphosa at Horse … [+4960 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Pilot Projects Set to Inform Rollout of HIV Prevention Shot - AllAfrica - Top Africa News", "description": "South Africa is expected to begin piloting the HIV prevention injection early next year as one of several projects that experts hope will reveal the answers to some of the biggest questions about the future of the shot - who will deliver the injection, where,…", "url": "https://allafrica.com/stories/202211220372.html", "urlToImage": "https://cdn09.allafrica.com/download/pic/main/main/csiid/00590078:a88dd204600261a1dc5327fdaba457d5:arc614x376:w1200.jpg", "publishedAt": "2022-11-22T10:47:54Z", "content": "South Africa is expected to begin piloting the HIV prevention injection early next year as one of several projects that experts hope will reveal the answers to some of the biggest questions about the… [+12298 chars]"}, {"source": {"id": null, "name": "Auburn Citizen"}, "author": "Faizel Patel", "title": "Ookla: These are the fastest 5G smartphones in South Africa - The Citizen", "description": "Ookla said competition for the fastest popular 5G smartphone was incredibly tight in South Africa during the review period.", "url": "https://www.citizen.co.za/lifestyle/technology/ookla-fastest-5g-smartphones-south-africa/", "urlToImage": "https://media.citizen.co.za/wp-content/uploads/2022/11/Ookla-Speed-Test.jpg", "publishedAt": "2022-11-22T10:44:26Z", "content": "With Black Friday and Cyber Monday just a few days away, Ookla has revealed data to help shoppers navigate deals with hard data on the fastest 5G popular devices.\r\nThe Global fixed broadband and mobi… [+2008 chars]"}, {"source": {"id": null, "name": "GLITCHED"}, "author": "Sheree Buchholz", "title": "There is Still Time to Enter The RODE Streamer Showdown - GLITCHED", "description": "South Africans can still enter the RODE Streamer Showdown competition where they can stand a chance of winning RODE equipment by showing off their skills.", "url": "https://www.glitched.online/there-is-still-time-to-enter-the-rode-streamer-showdown/", "urlToImage": "https://www.glitched.online/wp-content/uploads/2022/11/RODE-X-Streamer-Showdown-Mailer-Header-1.jpg", "publishedAt": "2022-11-22T10:01:43Z", "content": "If youre an up-and-coming game streamer or even an established streamer looking to level up your stream setup, theres still time for you to enter the RODE Streamer Showdown and win some pretty awesom… [+1374 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Kenya: Solar Powered Freezers - a Low Cost but High Impact Strategy Making Critical Vaccines Accessible in Southeast Kenya - AllAfrica - Top Africa News", "description": "Blog - Kamboo, Yindalani and Yiuma Mavui are a set of hard-to-reach villages located 17 and 28 kilometres away from Makindu sub-county hospital and 10 and 22 kilometres away from the nearest electricity grid. As a result of the distance from the sub-county ho…", "url": "https://allafrica.com/stories/202211220121.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-11-22T08:55:20Z", "content": "Kamboo, Yindalani and Yiuma Mavui are a set of hard-to-reach villages located 17 and 28 kilometres away from Makindu sub-county hospital and 10 and 22 kilometres away from the nearest electricity gri… [+8825 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa at risk of a total blackout: expert - BusinessTech", "description": "Energy expert Professor Anton Eberhard warns that Eskom’s diesel problems increase the risk of a system failure.", "url": "https://businesstech.co.za/news/energy/645013/south-africa-at-risk-of-a-total-blackout-expert/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Eskom-load-shedding.png", "publishedAt": "2022-11-22T06:39:41Z", "content": "Energy expert Professor Anton Eberhard has warned that Eskoms decision not to refuel its diesel open cycle gas turbines (OCGTs) increases the risk of a system failure.\r\nEberhard is the director of Po… [+3287 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "Senegalese fans disappointed but not dispirited after defeat in World Cup opener - Africanews English", "description": "Hundreds of people gathered in a Dakar fan zone to watch the first fixture of the national squad, on Monday. However, enthusiasm turned into disappointment. The Oranje blocked the Teranga Lions’s way. The high pressure second half got the better of Africa’s c…", "url": "http://www.africanews.com/2022/11/22/senegalese-fans-disappointed-but-not-dispirited-after-defeat-in-world-cup-opener/", "urlToImage": "https://static.euronews.com/articles/stories/07/20/69/52/1024x538_cmsv2_3e6498f5-8ed7-5d94-a939-9e8180f4ca99-7206952.jpg", "publishedAt": "2022-11-22T05:13:36Z", "content": "Euphoria following Senegal's AFCON triumph largely influenced the Teranga Lions fans in their World Cup opener on Monday (Nov. 21).\r\nThe enthusiasm in a fan zone in Dakar was a perfect illustration. … [+1996 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Ed Stoddard", "title": "ECONOMIC OUTLOOK: SA Reserve Bank set to pull the trigger again, taking the prime lending rate back above 10% - Daily Maverick", "description": "The South African Reserve Bank is set to raise its key repo rate again this week, with most economists forecasting a hike of at least 75 basis points. This will take the prime lending rate to 10.5%. As policy ‘normalisation’ continues apace in the US and else…", "url": "https://www.dailymaverick.co.za/article/2022-11-21-sa-reserve-bank-set-to-pull-the-trigger-again-taking-the-prime-lending-rate-back-above-10/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/11/iStock-1388212203.jpg?w=1280", "publishedAt": "2022-11-21T19:31:00Z", "content": "The SA Reserve Banks Monetary Policy Committee (MPC) will deliver another big rate hike on Thursday, 24 November, when its last scheduled three-day meeting for 2022 wraps up. \r\nThe SA Reserve Bank is… [+3838 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Black Friday South Africa 2022 – links to all the sales happening this week - BusinessTech", "description": "Here’s a list of over 50 major retailers that will be launching Black Friday sales this week.", "url": "https://businesstech.co.za/news/black-friday/644329/black-friday-south-africa-2022-here-are-links-to-all-the-sales-happening-this-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/11/Black-Friday-South-Africa.jpg", "publishedAt": "2022-11-20T15:04:37Z", "content": "Black Friday week has arrived in South Africa, with a host of retailers launching early deals in the lead-up to the big sale day this Friday, 25 November.\r\nSeveral large retailers have been running B… [+2646 chars]"}]}