{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": "Jonathan Nda-Isaiah", "title": "4 Coups In ECOWAS Dangerous, Unacceptable – Osinbajo - LEADERSHIP NEWS", "description": "BY JONATHAN NDA-ISAIAH, Abuja Vice President Yemi Osinbajo has said the Economic Community of West African States (ECOWAS) must take proactive steps to prevent coup d’etat in the sub-region, and even on the continent, because the unconstitutional seizure of p…", "url": "https://leadership.ng/4-coups-in-ecowas-dangerous-unacceptable-osinbajo/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/07/Yemi-Osinbajo-1.jpg", "publishedAt": "2021-09-10T08:25:39Z", "content": "BY JONATHAN NDA-ISAIAH, Abuja\r\nVice President Yemi Osinbajo has said the Economic Community of West African States (ECOWAS) must take proactive steps to prevent coup detat in the sub-region, and even… [+4482 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Government to introduce new digital Covid-19 certificate for South Africa – what you should know - BusinessTech", "description": "Government has commenced with the development of a digital Covid-19 vaccination certificate which will confirm that a person has been vaccinated in South Africa, says health minister Dr Joe Phaahla.", "url": "https://businesstech.co.za/news/government/520118/government-to-introduce-new-digital-covid-19-certificate-for-south-africa-what-you-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/08/VaccinePassport-e1629274068895.jpg", "publishedAt": "2021-09-10T06:55:22Z", "content": "The government has commenced with the development of a digital Covid-19 vaccination certificate which will confirm that a person has been vaccinated in South Africa, says health minister Dr Joe Phaah… [+2561 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Inside N15 Billion Turnover of Bamboo, Rise Vest, Other Fintech Firms Facing CBN Probe - AllAfrica.com", "description": "A CBN investigative report provides a glimpse into the ownership of the fintech firms and their financial dealings.", "url": "https://allafrica.com/stories/202109100107.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-09-10T06:30:35Z", "content": "A CBN investigative report provides a glimpse into the ownership of the fintech firms and their financial dealings.\r\nA court recently placed restrictions on the bank accounts of six online investment… [+16916 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Antony Sguazzin", "title": "Pandemic at risk of worsening with proliferation of variants in Africa, scientists say - News24", "description": "The proliferation of Covid-19 variants in Africa, partly attributed to the low rates of vaccination, could lead to vaccine-evading mutations that complicate attempts to end the pandemic, a group of 112 African and 25 international organizations said.", "url": "https://www.news24.com/fin24/economy/pandemic-at-risk-of-worsening-with-proliferation-of-variants-in-africa-scientists-say-20210910", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11303/eedb76ce4ce2405ca76a7ada5c5d6b3e.jpg", "publishedAt": "2021-09-10T06:01:25Z", "content": "<ul><li>The proliferation of Covid-19 variants in Africa, partly attributed to the low rates of vaccination, could lead to vaccine-evading mutations which could worsen the pandemic. </li><li>A study … [+3327 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "AFP", "title": "Cooper gets shock Wallabies call up to play Springboks | Sport - News24", "description": "Quade Cooper earned a shock recall to the Wallabies, with the mercurial playmaker named in the starting side to face world champions South Africa after four years in the wilderness.", "url": "https://www.news24.com/sport/rugby/rugbychampionship/cooper-gets-shock-wallabies-call-up-to-play-springboks-20210910", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1402/d05e693448be41d69c9d26a95633f66b.jpg", "publishedAt": "2021-09-10T05:29:18Z", "content": "Quade Cooper earned a shock recall to the Wallabies on Friday, with the mercurial playmaker named in the starting side to face world champions South Africa after four years in the wilderness.\r\nThe se… [+3063 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Marianne Merten", "title": "South Africa shifts the Covid-19 vaccination goal posts... - Daily Maverick", "description": "South Africa has enough Covid-19 jabs, and a stable supply pipeline, according to acting Health Director-General Nicholas Crisp, who on Thursday told MPs of concerns over vaccine penetration variances, including stragglers Gauteng, Mpumalanga and North West.", "url": "https://www.dailymaverick.co.za/article/2021-09-09-south-africa-shifts-the-covid-19-vaccination-goal-posts-to-70-of-adults-by-christmas/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/08/Bateman-crispIntSpotlight-option-2.jpg", "publishedAt": "2021-09-09T21:22:30Z", "content": "The Health Department's acting Director-General Nicholas Crisp. (Photo: Leila Dougan) \r\nWe have sufficient vaccines in the country to last us 2½ to three months, regardless of whats still coming, sai… [+6335 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Warning over further alcohol restrictions for South Africa - BusinessTech", "description": "The Consumer Goods Council of South Africa (CGCSA) and the Liquor Traders Association of South Africa (LTASA) have published a new report on the impact of the government’s Covid-19 regulations on the liquor industry, with the groups warning that continued res…", "url": "https://businesstech.co.za/news/lifestyle/519788/warning-over-further-alcohol-restrictions-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/05/Beer-e1589607714207.jpg", "publishedAt": "2021-09-09T14:19:53Z", "content": "The Consumer Goods Council of South Africa (CGCSA) and the Liquor Traders Association of South Africa (LTASA) have published a new report on the impact of the government’s Covid-19 regulations on the… [+3423 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": "Brand Press", "title": "TECNO's CAMON Series To Be The First To Release MediaTek's Latest Helio G96 Chips In The African Market • Techpoint Africa - Techpoint Africa", "description": "TECNO’s popular CAMON series will be the first to use the MediaTek Helio G96 chipset in the African market in its newest CAMON 18 series to launch in Oct.International smartphone brand, TECNO j", "url": "https://techpoint.africa/2021/09/09/tecnos-camon-series-to-be-the-first-to-release-mediateks-latest-helio-g96-chips-in-the-african-market/", "urlToImage": "https://techpoint.africa/wp-content/uploads/2021/09/image-1.png", "publishedAt": "2021-09-09T12:37:58Z", "content": "TECNOs popular CAMON series will be the first to use the MediaTek Helio G96 chipset in the African market in its newest CAMON 18 series to launch in Oct.\r\nInternational smartphone brand, TECNO just c… [+1675 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "SANSA breach: International hacker group claims responsibility for Space Agency leak - The South African", "description": "SANSA said that a breach to its IT system was under control. The stolen information mostly referred to space science research-related work.", "url": "https://www.thesouthafrican.com/technology/sansa-breach-international-hacker-group-claims-responsibility-for-space-agency-leak-9-september-2021/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/09/E-ttfneVEAMpWSI.jpg", "publishedAt": "2021-09-09T10:26:03Z", "content": "A new internet hacking group has claimed responsibility for a data breach at the South African National Space Agency (SANSA). The group, CoomingProject, emerged recently and according to claims made … [+1380 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mfuneko Toyana", "title": "BUSINESS MAVERICK: South Africa's financial watchdog slaps US short-seller Viceroy with R50m fine over Capitec report - Daily Maverick", "description": "South Africa’s financial markets regulator, the FSCA, has fined notorious US short-seller Viceroy R50-million for a ‘false and misleading’ 2017 report accusing the country’s fourth-largest bank, Capitec, of being a loan shark and concealing defaults on its lo…", "url": "https://www.dailymaverick.co.za/article/2021-09-08-south-africas-financial-watchdog-slaps-us-short-seller-viceroy-with-r50m-fine-over-capitec-report/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/09/Mfuneko-BM-Capitec-option-2.jpg", "publishedAt": "2021-09-08T21:22:30Z", "content": "(Photo: Gallo Images / Jacques Stander) \r\nThe report triggered a sharp fall in Capitecs shares and an angry response by the bank, accusing Viceroy of a smear campaign.\r\nThe Financial Sector Conduct A… [+5372 chars]"}]}