{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Telegraph.co.uk"}, "author": null, "title": "Derek Chauvin to be sentenced for murder of George Floyd - live updates - Telegraph.co.uk", "description": "Derek Chauvin faces up to 30 years in prison when he is sentenced on Friday for the killing of George Floyd, the African American man whose death sparked a global protest movement.", "url": "https://www.telegraph.co.uk/news/2021/06/25/derek-chauvin-sentencing-trial-live-latest-news-verdict/", "urlToImage": "https://img.youtube.com/vi/4bRNTnnoXFE/maxresdefault.jpg", "publishedAt": "2021-06-25T16:24:28Z", "content": "But Professor Richard Frase, from the University of Minnesota's Law School, told The Telegraph he would be very surprised if Chauvin declined to address the judge.\r\n\"At sentencing there's nothing equ… [+721 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Antony Sguazzin", "title": "Cape Town facility could produce Africa's first Covid-19 mRNA vaccines within 15 months - News24", "description": "A facility in Cape Town could produce Africa’s first vaccines using messenger RNA, the breakthrough science of the global inoculation effort against Covid-19, within 15 months of signing a technology transfer agreement.", "url": "https://www.news24.com/fin24/companies/cape-town-facility-could-produce-africas-first-covid-19-mrna-vaccines-within-15-months-20210625", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11303/eedb76ce4ce2405ca76a7ada5c5d6b3e.jpg", "publishedAt": "2021-06-25T13:30:56Z", "content": "<ul><li>The World Health Organization this week announced it will establish its first-ever mRNA technology transfer hub in the city in an agreement with Afrigen Biologics &amp; Vaccines and the Biova… [+3883 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Cheryl Teh", "title": "China wants to up ante on space race with 'sky ladder' to Mars that can beam humans, cargo up in capsule - Business Insider South Africa", "description": "The \"sky ladder\" involves a capsule guided by a series of carbon nanotubes, leapfrogging from one space station to another before landing on the moon.", "url": "https://www.insider.com/china-up-the-ante-space-race-sky-ladder-to-mars-2021-6", "urlToImage": "https://i.insider.com/60d569f782c8960018af1de8?width=1200&format=jpeg", "publishedAt": "2021-06-25T12:10:14Z", "content": "The space race between the US and China is heating up, and the Chinese are bringing something new to the table a \"sky ladder.\"\r\nAccording to Chinese state-owned media Global Times, Wang Xiaojun, the … [+1328 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa could have the biggest crypto investment scam in the world – again - BusinessTech", "description": "South Africa’s Mirror Trading International’s (MTI) scheme was named 2020’s biggest crypto investment scam, and now it seems the country could also have the biggest scam of 2021, say legal experts at Werksmans Attorneys.", "url": "https://businesstech.co.za/news/banking/501251/south-africa-could-have-the-biggest-crypto-investment-scam-in-the-world-again/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/09/Money-Rand.jpg", "publishedAt": "2021-06-25T09:44:43Z", "content": "South Africa’s Mirror Trading Internationals (MTI) scheme was named2020s biggest crypto investment scam – and now it seems the country could also have the biggest scam of 2021, say legal experts at W… [+2373 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "Video shows concrete raining down inside an apartment at the Florida condo moments before collapse - Business Insider South Africa", "description": "A large section of Champlain Towers South in Miami collapsed early Thursday morning. At least one person is dead, and dozens more are missing.", "url": "https://www.insider.com/video-florida-condo-collapse-concrete-falling-inside-apartment-2021-6", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11196/bfb676878b7b4609b9110b02485b6632.jpg", "publishedAt": "2021-06-25T09:43:40Z", "content": "Footage from inside a Florida apartment shows concrete falling from the ceiling moments before the building partially collapsed.\r\nA large section of Champlain Towers South in Miami collapsed at aroun… [+599 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Felix Njini and Antony Sguazzin", "title": "South African CEO of Zim state-owned mine quits - putting economic reboot in doubt - News24", "description": "David Brown, chief executive officer of Zimbabwe’s Kuvimba Mining House, intends to step down, jeopardizing the future of the company the government hopes will spur an economic revival.", "url": "https://www.news24.com/fin24/companies/mining/south-african-ceo-of-zim-state-owned-mine-quits-putting-economic-reboot-in-doubt-20210625", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10387/6fb2a138645845c49e7a2b114e117aff.jpg", "publishedAt": "2021-06-25T07:44:26Z", "content": null}, {"source": {"id": null, "name": "TheJournal.ie"}, "author": "Lauren Boland", "title": "Fianna Fáil councillor becomes first African-Irish woman to be appointed mayor in Ireland - TheJournal.ie", "description": "Uruemu Adejinmi has been elected Cathaoirleach of the Longford Municipal District.", "url": "https://www.thejournal.ie/uruemu-adejinmi-longford-mayor-5477081-Jun2021/", "urlToImage": "https://img2.thejournal.ie/article/5477081/river/?height=400&version=5477084", "publishedAt": "2021-06-25T07:35:00Z", "content": "URUEMU ADEJINMI HAS become the first African-Irish woman to be appointed as a mayor in Ireland.\r\nThe Fianna Fáil councillor has been elected Cathaoirleach of the Longford Municipal District, where sh… [+1596 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sport24 staff", "title": "Wayde van Niekerk, Chad le Clos to lead SA medal charge at Tokyo Olympics - News24", "description": "Sascoc has announced the majority of the Team South Africa squad that will be participating in next month's Tokyo Olympics in Japan.", "url": "https://www.news24.com/sport/othersport/olympics2020/wayde-van-niekerk-chad-le-close-to-lead-sa-medal-charge-at-tokyo-olympics-20210624", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11303/a7cdb461f85049a396a68651d1a007fc.jpg", "publishedAt": "2021-06-24T20:00:17Z", "content": "The South African Sports Confederation and Olympic Committee (Sascoc) on Thursday announced the majority of the Team South Africa squad that will be participating in next month's Tokyo Olympics in Ja… [+4472 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "It’s here! Rare Ford Mustang Mach 1 touches down in South Africa - The South African", "description": "The new Ford Mustang Mach 1 brings the beast mode to South African roads, but there aren't many of these beauties to buy.", "url": "https://www.thesouthafrican.com/news/its-here-rare-ford-mustang-mach-1-touches-down-in-south-africa/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/06/Ford-Mustang-Mach-1.jpg", "publishedAt": "2021-06-24T17:06:10Z", "content": "It’s no secret that the Ford Mustang Mach 1 is an iconic vehicle that has represented Ford’s bold approach to design and performance since its debut in 1969. The Mustang has been a firm favourite amo… [+3682 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: NACA Launches N50 Billion Private Sector-Led Hiv Trust Fund - AllAfrica.com", "description": "The federal government lead agency in the eradication the scourge of Hiv/AIDS, National Agency for the Control of AIDS (NACA), yesterday embarked on a campaign to raise N50 billion private sector-led Trust Fund.", "url": "https://allafrica.com/stories/202106240606.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-06-24T11:18:15Z", "content": "Abuja — The federal government lead agency in the eradication the scourge of Hiv/AIDS, National Agency for the Control of AIDS (NACA), yesterday embarked on a campaign to raise N50 billion private se… [+3041 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Harder lockdown for South Africa beckons as Gauteng passes 10,000 daily Covid cases - BusinessTech", "description": "President Cyril Ramaphosa is expected to meet with the National Coronavirus Command Council (NCCC) on Thursday (24 June) to discuss the government’s response to the third Covid-19 wave of infections and the possibility of introducing new restrictions.", "url": "https://businesstech.co.za/news/government/500697/harder-lockdown-for-south-africa-beckons-as-gauteng-passes-10000-daily-covid-cases/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/04/SA_Lockdown.jpg", "publishedAt": "2021-06-24T05:46:17Z", "content": "President Cyril Ramaphosa is expected to meet with the National Coronavirus Command Council (NCCC) today (Thursday, 24 June) to discuss the government’s response to the third Covid-19 wave of infecti… [+2253 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "AfDB to Support AfCFTA with $208bn Projects - THISDAY Newspapers", "description": "By Dike Onwuamaeze The President of the African Development Bank (AfDB), Dr. Akinwunmi Adesina yesterday disclosed that the bank will support the African Continental Free Trade Area (AfCFTA) with $…", "url": "https://www.thisdaylive.com/index.php/2021/06/24/afdb-to-support-afcfta-with-208bn-projects/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2020/05/41b8ff74-adesina-akinwunmi.jpg", "publishedAt": "2021-06-24T02:37:13Z", "content": "By Dike Onwuamaeze\r\nThe President of the African Development Bank (AfDB), Dr. Akinwunmi Adesina yesterday disclosed that the bank will support the African Continental Free Trade Area (AfCFTA) with $2… [+4411 chars]"}]}