{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Devdiscourse"}, "author": "Devdiscourse News Desk", "title": "Science News Roundup: Elon Musk's Starship explodes minutes after first test flight's liftoff; SpaceX rocket explosion illustrates Elon Musk's 'successful failure' formula and more - Devdiscourse", "description": "The only other mammal known to get so little sleep is the African elephant.  Elon Musk's Starship explodes minutes after first test flight's liftoff  SpaceX's next-generation Starship spacecraft exploded minutes after liftoff in an uncrewed test flight from S…", "url": "https://www.devdiscourse.com/article/science-environment/2426471-science-news-roundup-elon-musks-starship-explodes-minutes-after-first-test-flights-liftoff-spacex-rocket-explosion-illustr", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/25_11_2022_02_35_50_9719217.jpg?width=920&format=jpeg", "publishedAt": "2023-04-22T12:56:49Z", "content": "Following is a summary of current science news briefs.\r\nYou think you need more sleep? Tell that to an elephant seal\r\nSleep is a precious commodity for people and across the animal kingdom, indispens… [+1751 chars]"}, {"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Unicef calls for concerted efforts to address routine immunisation - The Statesman", "description": "Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children's Fund, or Unicef, has disclosed.", "url": "https://www.thestatesman.com/world/unicef-calls-for-concerted-efforts-to-address-routine-immunisation-1503174425.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/01/COVID-1.jpg", "publishedAt": "2023-04-22T08:54:00Z", "content": "Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children’s Fund, or Unicef, has disclosed. \r\nUni… [+1825 chars]"}]}