{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Cricket.one"}, "author": "Debashis Sarangi", "title": "Matt Henry Ruled Out, Jimmy Neesham Injured; Here's New Zealand's Playing XI Vs Pakistan - OneCricket", "description": "In a significant setback for New Zealand, experienced pacer Matt Henry has been ruled out of the ongoing World Cup due to a hamstring injury. Notably, the seamer pulled his right hamstring while bowling in the previous game against South Africa.", "url": "https://cricket.one/cricket-analysis/matt-henry-ruled-out-jimmy-neesham-injured-heres-new-zealands-playing-xi-vs-pakistan/65449938b81274936e9afba0", "urlToImage": "https://onecricketnews.akamaized.net/parth-editor/oc-dashboard/news-images-prod/1698994472712_Untitled design - 2023-11-03T122427.713.jpg", "publishedAt": "2023-11-03T06:54:48Z", "content": "Matt Henry has been ruled out of 2023 WC [X.com]\r\nIn a significant setback for New Zealand, experienced pacer Matt Henry has been ruled out of the ongoing World Cup due to a hamstring injury. Notably… [+1425 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Adolescent and Family Planning Commitments and Method Mix in West Africa - Partnership for Maternal, Newborn and Child Health", "description": "By FP2030Adolescent and youth family planning is a critical component of public health and development in West Africa. Ensuring that young people have unfettered access to an extensive range of reproductive health services is paramount for their well-being an…", "url": "https://pmnch.who.int/news-and-events/events/item/2023/11/09/default-calendar/adolescent-and-family-planning-commitments-and-method-mix-in-west-africa", "urlToImage": null, "publishedAt": "2023-11-02T15:16:14Z", "content": "By FP2030\r\nAdolescent and youth family planning is a critical component of public health and development in West Africa. Ensuring that young people have unfettered access to an extensive range of rep… [+1283 chars]"}, {"source": {"id": null, "name": "ReliefWeb"}, "author": null, "title": "Nigeria, Africa | Diphtheria Outbreak - Emergency Appeal Operational Strategy (MDRNG037) - Nigeria - ReliefWeb", "description": "Situation Report in English on Nigeria about Coordination, Health, Epidemic and more; published on 2 Nov 2023 by IFRC", "url": "https://reliefweb.int/report/nigeria/nigeria-africa-diphtheria-outbreak-emergency-appeal-operational-strategy-mdrng037", "urlToImage": "https://reliefweb.int/sites/default/files/styles/large/public/previews/89/1f/891f45a8-f46b-4187-b892-2bcdf4ce777e.png", "publishedAt": "2023-11-02T13:46:59Z", "content": "Timeline\r\nMarch 2023: IFRC allocates Disaster Response Emergency Funds (DREF) for 355,654 CHF to take early action to contain the outbreak.\r\nJuly 2023: IFRC approves a second DREF allocation for 75,0… [+3092 chars]"}]}