{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Yahoo Entertainment"}, "author": "SAM MEDNICK", "title": "Leading politician says victory for Niger's coup leaders would be 'the end of democracy' in Africa - Yahoo News", "description": "If mutinous soldiers who ousted Niger's president succeed, it will threaten democracy and security across the region and the continent, a high-ranking member...", "url": "https://news.yahoo.com/leading-politician-says-victory-nigers-080020420.html", "urlToImage": "https://s.yimg.com/ny/api/res/1.2/cRoGIZ8BnKjgyNDUfAvqGQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://media.zenfs.com/en/ap.org/55e39308524dd179f715ccc9cac998a7", "publishedAt": "2023-08-18T08:00:20Z", "content": "NIAMEY, Niger (AP) If mutinous soldiers who ousted Niger's president succeed, it will threaten democracy and security across the region and the continent, a high-ranking member of Bazoum's political … [+4203 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Mausam Jha", "title": "South Africa gears up for BRICS Summit as China's Xi Jinping confirms to attend. What's ahead? | Mint - Mint", "description": "South Africa will host a BRICS summit next week, with over 40 leaders attending, including those from China, India, Brazil, and Russia. The summit will focus on the potential expansion of BRICS membership, concept of a common currency, the development bank, s…", "url": "https://www.livemint.com/news/world/south-africa-gears-up-for-brics-summit-as-chinas-xi-jinping-confirms-to-attend-whats-ahead-11692334979113.html", "urlToImage": "https://www.livemint.com/lm-img/img/2023/08/18/600x338/The-Indian-side-has-sought-to-put-focus-on-changes_1692337086349_1692337098879.jpg", "publishedAt": "2023-08-18T05:38:56Z", "content": "South Africa will host a summit of the BRICS group of nations next week and other Global South participants, aiming to counterbalance Western global dominance while addressing their internal differen… [+7665 chars]"}, {"source": {"id": null, "name": "Eos"}, "author": "Nathaniel Scharping", "title": "Evidence of Earth's Oldest Glaciers Found in South Africa - Eos", "description": "The ancient glaciers hint at an Archaean Earth that may have looked similar in some ways to our own time.", "url": "http://eos.org/articles/evidence-of-earths-oldest-glaciers-found-in-south-africa", "urlToImage": "https://eos.org/wp-content/uploads/2023/08/glacier-perito-mereno.jpg", "publishedAt": "2023-08-17T12:17:28Z", "content": "Earth may have hosted glaciers as far back as 3 billion years ago, reports a new study published in Geochemical Perspectives Letters. Drawing on multiple lines of evidence from some of the oldest und… [+5063 chars]"}]}