{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "First West African Case Of Deadly Marburg Virus Detected - Channels Television", "description": "Guinea confirmed a case of Marburg disease, the World Health Organization said on Monday, the first recorded in West Africa of the lethal virus that’s related to Ebola and, like COVID-19, passed from animal hosts to humans. The virus, which is carried by bats…", "url": "https://www.channelstv.com/2021/08/10/first-west-african-case-of-deadly-marburg-virus-detected/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/08/Marburg-Virus.jpg", "publishedAt": "2021-08-10T09:20:35Z", "content": "Guinea confirmed a case of Marburg disease, the World Health Organization said on Monday, the first recorded in West Africa of the lethal virus that’s related to Ebola and, like COVID-19, passed from… [+2941 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Marburg virus: Man who died in Guinea found to have disease - BBC News", "description": "A man who died is found to have had the highly infectious virus, the first human case in West Africa.", "url": "https://www.bbc.com/news/world-africa-58156499", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/EE77/production/_119874016_gettyimages-179793194.jpg", "publishedAt": "2021-08-10T08:16:00Z", "content": "By Vivienne NunisAfrica correspondent, BBC News\r\nimage captionThe Marburg virus was first detected in the city of Marburg in Germany in 1967\r\nGuinea health officials have confirmed West Africa's firs… [+1628 chars]"}, {"source": {"id": null, "name": "Jakarta Post"}, "author": "The Jakarta Post", "title": "First West African case of deadly Marburg virus detected: WHO - Jakarta Post", "description": "The virus, which is carried by bats and has a fatality rate of up to 88 percent, was found in samples taken from a patient who died on August 2 in southern Gueckedou prefecture, the WHO said.", "url": "http://www.thejakartapost.com/life/2021/08/10/first-west-african-case-of-deadly-marburg-virus-detected-who-.html", "urlToImage": "https://img.jakpost.net/c/2020/12/17/2020_12_17_109047_1608177931._large.jpg", "publishedAt": "2021-08-10T05:45:00Z", "content": "Guinea confirmed a case of Marburg disease, the World Health Organization said on Monday, the first recorded in West Africa of the lethal virus that's related to Ebola and, like Covid-19, passed from… [+2953 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "First West African case of deadly Marburg virus detected: WHO - Eyewitness News", "description": "Marburg virus is usually associated with exposure to caves or mines housing colonies of Rousettus bats. Once caught by a human, it is spread through contact with bodily fluids of infected people, or with contaminated surfaces and materials, according to the W…", "url": "https://ewn.co.za/2021/08/10/first-west-african-case-of-deadly-marburg-virus-detected-who", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/bccqder83o2xcdzwwu8h", "publishedAt": "2021-08-10T05:13:48Z", "content": "Marburg virus is usually associated with exposure to caves or mines housing colonies of Rousettus bats. Once caught by a human, it is spread through contact with bodily fluids of infected people, or … [+3256 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Pule Letshwiti-Jones", "title": "Women's League speaks out on future female president for South Africa - News24", "description": "The ANC Women's League has expressed concern about women being the executives who were mostly affected by the President Cyril Ramaphosa's Cabinet reshuffle.", "url": "https://www.news24.com/news24/southafrica/news/womens-league-speaks-out-on-future-female-president-for-south-africa-20210810", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8585/c027585e33c54c9599846681829158bc.jpg", "publishedAt": "2021-08-10T03:19:51Z", "content": "The ANC Women's League (ANCWL) has strongly reiterated its view on having a female president to lead the country, possibly in the next national government elections that are expected to be held in 20… [+219 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "Unease grows in Jersey over British and Irish Lions' return from Covid-ravaged South Africa - Stuff.co.nz", "description": "British, Welsh and Scottish Lions get preferential treatment in Jersey after Springboks series loss.", "url": "https://www.stuff.co.nz/sport/rugby/international/126021748/unease-grows-in-jersey-over-british-and-irish-lions-return-from-covidravaged-south-africa", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/u/5/v/a/image.related.StuffLandscapeSixteenByNine.1420x800.231304.png/1628546720737.jpg", "publishedAt": "2021-08-09T22:05:00Z", "content": "Jersey authorities have warned that allowing the British and Irish Lions to return to the island from South Africa could set a dangerous precedent.\r\n The Lions fly into Jersey on Monday (Tuesday NZ t… [+2620 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": null, "title": "R.I.P: Amapiano musicians Mpura and Killer Kau die in car crash - The South African", "description": "Social media has been awash with moving tributes to Mpura and Killer Kau after the Amapiano stars reportedly died in a car crash", "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/r-i-p-amapiano-musicians-mpura-and-killer-kau-die-in-car-crash/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/08/Mpura-and-Killer-Kau-edited.jpg", "publishedAt": "2021-08-09T15:59:13Z", "content": "More tragic news coming out of the local arts industry: Local Amapiano artists Mpura and Killer Kau have passed away.\r\nThere hasnt been an official statement on the musicians deaths, but both Sunday … [+2043 chars]"}]}