{"articles": [{"author": "Zaahid Nanabhay", "content": "Kaizer Chiefs are back in CAF Champions League action this evening when they take on Petro Atletico in Angola and you can live-stream the match below.\r\nKaizer Chiefs earned their maiden CAF Champions… [+1997 chars]", "description": "Watch today's crunch CAF Champions League group stage clash between Kaizer Chiefs and Angolan outfit Petro Atletico LIVE for free below", "publishedAt": "2021-03-16T15:56:15Z", "source": {"id": null, "name": "The South African"}, "title": "Kaizer Chiefs vs Petro Atletico: LIVE STREAM [Watch for free] - The South African", "url": "https://www.thesouthafrican.com/sport/soccer/caf-champions-league/kaizer-chiefs-vs-petro-atletico-live-stream-watch-for-free/", "urlToImage": "https://www.thesouthafrican.com/wp-content/uploads/2020/11/7d27ee53-b20khgb1513-scaled.jpg.webp"}, {"author": "Oluwanifemi Kolawole", "content": "It is common to see freelance photographers at various functions in Nigeria jostling for the attention of arriving guests. And it seldom ends with arrivals as they continue to take pictures long afte… [+6325 chars]", "description": "Globally, smartphone and digital camera sales are at opposite ends of the spectrum, with the latter steadily declining. In Africa, the impact is felt by photography businesses as smartphones appear to be the go-to option", "publishedAt": "2021-03-16T13:30:28Z", "source": {"id": null, "name": "Techpoint.ng"}, "title": "Race for dominance in the photography space: Smartphones or digital cameras? - Techpoint Africa", "url": "http://techpoint.africa/2021/03/16/smartphone-photography-versus-digital-camera/", "urlToImage": "https://techpoint.africa/wp-content/uploads/2021/03/Photography-2.jpg"}, {"author": null, "content": "Microsoft has launched the Surface Book 3 laptop in South Africa, which the company calls its most powerful laptop yet.\r\nThe hybrid laptop joins Microsoft’s growing range of notebooks and tablets tha… [+1921 chars]", "description": "Microsoft has launched the Surface Book 3 laptop in SA, which the company calls its most powerful laptop yet. Find out the price and other details.", "publishedAt": "2021-03-16T12:21:35Z", "source": {"id": null, "name": "Memeburn"}, "title": "Microsoft Surface Book 3 now available - price for South Africa - Gearburn - gearburn", "url": "https://memeburn.com/gearburn/2021/03/microsoft-surface-book-3-now-available-price-for-south-africa/", "urlToImage": "https://memeburn.com/gearburn/wp-content/uploads/sites/3/2021/03/microsoft-Surface-Book-3.jpg"}, {"author": "Press Releases", "content": "The days when mini laptops used to be slow, bulky and non-impressive is fast gone. The ZenBook Flip 13 (UX363EA) is an elegant laptop from ASUS that spares no chance to impress with its no compromise… [+6708 chars]", "description": "The days when “mini” laptops used to be slow, bulky and non-impressive is fast gone. The ZenBook Flip 13 (UX363EA) is an elegant laptop from ASUS that spares no chance to impress with it’s no compromise performance as it is powered by up to an 11th-generation…", "publishedAt": "2021-03-16T12:05:03Z", "source": {"id": null, "name": "Techpoint.ng"}, "title": "ZenBook Flip 13 (UX 363EA) Review: Unboxing and first impressions - Techpoint Africa", "url": "http://techpoint.africa/2021/03/16/sponsoredzenbook-flip-13-ux-363ea-review-unboxing-and-first-impressions/", "urlToImage": "https://techpoint.africa/wp-content/uploads/2021/03/1-Article-Thumbnail.jpg"}, {"author": "Jonny Whitfield", "content": "Arsenal have been given a glowing transfer review for a top African striker, while Chelsea will fast-track one star’s contract talks – both in all the latest Paper Talk.\r\nAUBAMEYANG RECOMMENDS STRIKE… [+3593 chars]", "description": "Arsenal have been given a glowing transfer review for a top African striker, while Chelsea will fast-track one star's contract talks - both in all the latest Paper Talk.", "publishedAt": "2021-03-16T08:41:29Z", "source": {"id": null, "name": "Teamtalk.com"}, "title": "Paper Talk: Aubameyang offers Arsenal raving review of deadly striker - Teamtalk.com", "url": "https://www.teamtalk.com/news/transfer-gossip-aubameyang-arsenal-aaron-boupendza-chelsea-rudiger-talks", "urlToImage": "https://d3vlf99qeg6bpx.cloudfront.net/content/uploads/2021/03/16082948/Aaron.Boupendza.jpg"}, {"author": null, "content": "<ul><li>New results from an annual survey shows that, of SA's big retail banks, Capitec had the most satisfied clients. </li><li>It also had the lowest rate of complaints.</li><li>Nedbank seems to be… [+3368 chars]", "description": "Consulta polled almost 12,500 customers on their overall satisfaction with South Africa's big six retail banks.", "publishedAt": "2021-03-16T08:12:57Z", "source": {"id": null, "name": "Business Insider South Africa"}, "title": "SA banks with happiest – and most miserable - clients. One bank is making big gains - Business Insider South Africa", "url": "https://www.businessinsider.co.za/what-is-the-best-bank-in-south-africa-2021-3", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10670/da4854f83ec343afa8b07e5a6a9df084.jpg"}, {"author": "Tage Kene-Okafor", "content": "It is nearly impossible for businesses in some African countries to receive money from PayPal. While the payments giant has not given reasons why this is so, speculation hints at factors like insuffi… [+5218 chars]", "description": "It is nearly impossible for businesses in some African countries to receive money from PayPal. While the payments giant has not given reasons why this is so, speculation hints at factors like insufficient regulation and poor banking security in said countries…", "publishedAt": "2021-03-16T06:31:12Z", "source": {"id": "techcrunch", "name": "TechCrunch"}, "title": "Flutterwave and PayPal collaborate to allow African merchants to accept and make payments - TechCrunch", "url": "http://techcrunch.com/2021/03/15/flutterwave-and-paypal-partner-to-allow-african-merchants-to-accept-and-make-payments/", "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/03/Flutterwave-team-image-.jpg?w=587"}, {"author": "https://www.facebook.com/BusinessTechSA", "content": "Statistical data shows that South Africa’s economic recovery remains fragile – which has been reflected by a drop in business confidence, say economists from the Bureau for Economic Research (BER).\r\n… [+3719 chars]", "description": "Statistical data shows that South Africa’s economic recovery remains fragile which has been reflected by a drop in business confidence, say economists from the Bureau for Economic Research (BER).", "publishedAt": "2021-03-15T15:04:10Z", "source": {"id": null, "name": "Businesstech.co.za"}, "title": "South Africa faces fragile recovery as a third Covid-19 wave is expected to hit in coming weeks - BusinessTech", "url": "https://businesstech.co.za/news/business/475696/south-africa-faces-fragile-recovery-as-a-third-covid-19-wave-is-expected-to-hit-in-coming-weeks/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/03/South-Africa-lockdown.png"}, {"author": null, "content": "AstraZeneca insisted Sunday that its Covid-19 vaccine is safe in its firmest rebuttal yet to concerns over its safety that have led to seven countries suspending its use.\r\nSome national health author… [+2461 chars]", "description": "The number of blood clots reported among vaccinated people is lower than in the general population, the company said on Sunday.", "publishedAt": "2021-03-15T13:23:22Z", "source": {"id": "business-insider", "name": "Business Insider"}, "title": "AstraZeneca insists its Covid-19 vaccine is safe and there is no link to blood clots - Business Insider South Africa", "url": "https://www.businessinsider.com/astrazeneca-insists-vaccine-is-safe-after-7-countries-suspend-use-2021-3", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10914/e46f7c3f692d458c86d20310af48c9de.jpg"}, {"author": null, "content": "<ul><li>EskomSePush was suspended from the Google Play app store this weekend. </li><li>This was partly due to the Covid-19 data it was sending subscribers.</li><li>The app is now available on Google… [+1716 chars]", "description": "The massively popular South African app, EskomSePush, was suspended from the Google Play app store this weekend.", "publishedAt": "2021-03-15T13:03:17Z", "source": {"id": null, "name": "Business Insider South Africa"}, "title": "EskomSePush stops Covid updates after Google Play suspension - Business Insider South Africa", "url": "https://www.businessinsider.co.za/eskomsepush-suspended-2021-3", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/8504/8b77df975f6b41a4ab2aad55fc38eb46.png"}, {"author": null, "content": "The African Development Bank (AfDB) is to support African countries to have quality healthcare infrastructure and ensure the continent develops its pharmaceutical capacity as well as produce required… [+3763 chars]", "description": "The African Development Bank (AfDB) is to support African countries to have quality healthcare infrastructure and ensure the continent develops its pharmaceutical capacity as well as produce requir…", "publishedAt": "2021-03-15T08:16:54Z", "source": {"id": null, "name": "THISDAY Newspapers"}, "title": "AfDB to Support Quality Healthcare Infrastructure Across Africa - THISDAY Newspapers", "url": "https://www.thisdaylive.com/index.php/2021/03/15/afdb-to-support-quality-healthcare-infrastructure-across-africa/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2018/11/748882a4-akinwunmi-adesina-1.jpg"}], "message": "Successful api call", "number_of_news": 11, "status": 200, "topic": "africa"}