{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "VOA News"}, "author": "Timothy Obiezu", "title": "Nigeria to Supply Equatorial Guinea With Natural Gas - VOA Africa", "description": "Nigeria has agreed to supply natural gas to Equatorial Guinea at Nigeria's International Energy Summit in Abuja. African energy experts are urging quick implementation of the gas deal amid high demand and supply disruptions caused by Russia's invasion of Ukra…", "url": "https://www.voanews.com/a/nigeria-to-supply-equatorial-guinea-with-natural-gas-/6471212.html", "urlToImage": "https://gdb.voanews.com/01e60000-0aff-0242-1f6e-08d9fe42631a_w1200_r1.jpg", "publishedAt": "2022-03-05T01:15:48Z", "content": "Abuja, Nigeria  Nigeria has agreed to supply natural gas to Equatorial Guinea at Nigeria's International Energy Summit in Abuja. African energy experts are urging quick implementation of the gas deal… [+2314 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Saturday's weather: Heavy rainfall expected across the country - News24", "description": "The South African Weather Service has issued a yellow level 2 warning for disruptive rainfall over the central and western parts of Free State, western parts of the North West, and north-eastern parts of the Northern Cape.", "url": "https://www.news24.com/news24/southafrica/news/saturdays-weather-heavy-rainfall-expected-across-the-country-20220304", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/845/80e59120a4dc476798cab408c5b9582c.jpg", "publishedAt": "2022-03-04T16:26:14Z", "content": "The South African Weather Service has issued a yellow level 2 warning for disruptive rainfall over\r\nthe central and western parts of Free State, western parts of the North West,\r\nand north-eastern pa… [+2292 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Max Du Plessis", "title": "WAR IN EUROPE OP-ED: South Africa's Ukraine failure is an international tragedy that doubles as a constitutional calamity - Daily Maverick", "description": "If South Africa takes these international law obligations seriously it should reverse its position immediately and give up on the ‘quisling’ double-speak about Russia’s aggression and crimes.", "url": "https://www.dailymaverick.co.za/article/2022-03-04-south-africas-ukraine-failure-is-an-international-tragedy-that-doubles-as-a-constitutional-calamity/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/Oped-Ukraine-SA1.jpg?w=1280", "publishedAt": "2022-03-04T12:24:04Z", "content": "The past week has been extraordinary. Not only because of what has happened in Ukraine under Russias unlawful invasion by all standards of international law. But also because of South Africas stomach… [+14959 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "Mia Lindeque", "title": "The 'South African Tinder Swindler' case postponed to next week - EWN", "description": "Amon Namara, 39, made a brief appearance in the Johannesburg Magistrate's Court where he's charged with fraud.", "url": "https://ewn.co.za/2022/03/04/sa-tinder-swindler-case-postponed-to-next-wednesday", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/aqpfp1hnrdjtmdfefjfo", "publishedAt": "2022-03-04T11:55:08Z", "content": "Amon Namara, 39, made a brief appearance in the Johannesburg Magistrate's Court where he's charged with fraud.\r\n JOHANNESBURG - The case against the man dubbed \"the South African Tinder Swindler\" has… [+1138 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "John Whittle", "title": "DRIVEN: BMW M240i xDrive Coupé - Carmag South Africa", "description": "Although BMW doesn’t consciously dabble in the business of psychology (unless you’re after the therapeutic effect of a proper M car), the new M240i xDrive is somewhat reminiscent of a chapter in the theory of middle child syndrome.", "url": "https://www.carmag.co.za/news/driven-bmw-m240i-xdrive-coupe/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/03/P90452933_highRes_bmw-m240i-xdrive-03-.jpg", "publishedAt": "2022-03-04T10:29:15Z", "content": "Although BMW doesnt consciously dabble in the business of psychology (unless youre after the therapeutic effect of a proper M car), the new M240i xDrive is somewhat reminiscent of a chapter in the th… [+3540 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The US Embassy calls for South Africa to take a stance against Russia; bottlenecks because of Transnet infrastructure has had a major impact on South Africa’s largest coal supplier; The City of Tshwane continues its campaign of cutting off utilities; and work…", "url": "https://businesstech.co.za/news/government/564874/5-important-things-happening-in-south-africa-today-1233/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/51903015163_a482f19f64_c.jpg", "publishedAt": "2022-03-04T06:04:41Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 1,853 new cases of Covid-19, taking the total reported to 3,679,539. Deaths have reached 9… [+3558 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ukraine-Russia war: Africans escaping Ukraine, How Africa vote on Russia attack - BBC.com", "description": "Air Peace confam dem don deploy dia aircraft to evacuate Nigerians wey dey stranded for Europe as a result of di invasion of Ukraine by Russia.", "url": "https://www.bbc.com/pidgin/media-60600059", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_pidgin/35AB/production/_123493731_b4898ab7-1454-4a1d-b5a4-b8c37e480360.jpg", "publishedAt": "2022-03-03T11:56:41Z", "content": "Wia dis foto come from, Getty Images\r\nWetin we call dis foto, African woman sitdon for floor after she run away sake of Russia-Ukraine war\r\nUkraine before now na home to over 76,000 foreign students,… [+3686 chars]"}]}