{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Jamey Keaten", "title": "Putin meets with African leaders in Russia to discuss Ukraine peace plan, but no visible progress - The Associated Press", "description": "KYIV, Ukraine (AP) — Russian President Vladimir Putin on Saturday met with a group of leaders of African countries who traveled to Russia on a self-styled “peace mission” the day after they went to Ukraine, but the meeting ended with no visible progress.", "url": "https://apnews.com/article/russia-ukraine-war-peace-plan-africa-1eb9512e45979563c8392fd855f7f4ce", "urlToImage": "https://storage.googleapis.com/afs-prod/media/5ed489c2c2394e86b553c4d91c8079d2/3000.webp", "publishedAt": "2023-06-18T03:15:59Z", "content": "KYIV, Ukraine (AP) Russian President Vladimir Putin on Saturday met with a group of leaders of African countries who traveled to Russia on a self-styled peace mission the day after they went to Ukrai… [+5821 chars]"}, {"source": {"id": null, "name": "India Today"}, "author": "Agence France-Presse", "title": "Ukraine war must be settled: South Africa's Ramaphosa tells Putin - India Today", "description": "After his talks with Russian President Vladimir Putin on Saturday, South Africa's President Cyril Ramaphosa said, \"This war must be settled... through negotiations and through diplomatic means,\" as he spoke about the Russia-Ukraine conflict.", "url": "https://www.indiatoday.in/world/story/ukraine-war-must-be-settled-south-africas-ramaphosa-tells-putin-2394421-2023-06-18", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202306/screenshot_2023-06-18_071452-sixteen_nine.png?VersionId=u96VDuMJMafbcFM5i4W_ZyoEKh3CCVp7", "publishedAt": "2023-06-18T01:51:03Z", "content": "By Agence France-Presse: South Africa's president, in Russia as part of a delegation pushing for peace between Kyiv and Moscow, told his Russian counterpart Vladimir Putin on Saturday that the fighti… [+5570 chars]"}]}