{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "NPR"}, "author": null, "title": "Bus plunges off bridge in South Africa, leaving 45 dead and just 1 survivor - NPR", "description": "An 8-year-old child is only survivor. The passengers were headed to an Easter festival before the bus plunged off a bridge on a mountain pass and burst into flames.", "url": "https://www.npr.org/2024/03/28/1241534694/south-africa-bus-bridge-crash", "urlToImage": "https://media.npr.org/assets/img/2024/03/28/bus-1_wide-231cdc47e718cbb5b1dd2a2f430cbd1fb6761df2-s1400-c100.jpg", "publishedAt": "2024-03-28T23:29:34Z", "content": "In this image taken from video provided by eNCA, a bus carrying worshippers headed to an Easter festival plunged off a bridge on a mountain pass and burst into flames in Limpopo, South Africa, on Thu… [+1859 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "UN top court orders Israel to open more land crossings for aid into Gaza - Hindustan Times", "description": "The order came after South Africa sought more provisional measures, including a cease-fire, citing starvation in Gaza. | World News", "url": "https://www.hindustantimes.com/world-news/un-top-court-orders-israel-to-open-more-land-crossings-for-aid-into-gaza-101711662857745.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/03/28/1600x900/JORDAN-PALESTINIAN-ISRAEL-GAZA-CONFLICT-AID-0_1709391135176_1711667819415.jpg", "publishedAt": "2024-03-28T23:22:31Z", "content": "The top United Nations court on Thursday ordered Israel to take measures to improve the humanitarian situation in Gaza, including opening more land crossings to allow food, water, fuel and other supp… [+4638 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Eritrea Observed World TB Day 2024 - WHO | Regional Office for Africa", "description": "World TB Day was commemorated on 24 March 2024 at Orotta Conference Hall in Asmara, capital city of Eritrea. This year’s theme is “Yes, we can end TB,” highlighting the need to ensure equitable access to prevention and care, in line with our drive towards the…", "url": "https://www.afro.who.int/news/eritrea-observed-world-tb-day-2024", "urlToImage": null, "publishedAt": "2024-03-28T12:00:00Z", "content": "World TB Day was commemorated on 24 March 2024 at Orotta Conference Hall in Asmara, capital city of Eritrea. This years theme is Yes, we can end TB, highlighting the need to ensure equitable access t… [+2903 chars]"}]}