{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Unraveling the origins of humanity: New research challenges single-origin theory - News-Medical.Net", "description": "Researchers explore the complex demographic history of Homo sapiens in Africa, revealing a reticulated population structure dating back to Marine Isotope Stage 5. The study challenges previous assumptions about archaic hominin contributions and emphasizes the…", "url": "https://www.news-medical.net/news/20230521/Unraveling-the-origins-of-humanity-New-research-challenges-single-origin-theory.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_748783_16847113883984891.jpg", "publishedAt": "2023-05-22T01:16:00Z", "content": "In a recent study published in the journal Nature, researchers explore the differences between various demographic models using diversity-based statistics and linkage disequilibrium.\r\nStudy: A weakly… [+5676 chars]"}, {"source": {"id": "cbs-news", "name": "CBS News"}, "author": "Aliza Chasan", "title": "NAACP issues travel advisory for Florida, says state \"has become hostile to Black Americans\" - CBS News", "description": "The NAACP on Saturday issued a travel advisory for Florida, joining two other civil rights groups in warning potential tourists about the state's hostility \"toward African Americans, people of color and LGBTQ+ individuals.\"", "url": "https://www.cbsnews.com/news/naacp-travel-advisory-florida-says-state-hostile-to-black-americans/", "urlToImage": "https://assets2.cbsnewsstatic.com/hub/i/r/2023/05/21/391b6450-1a10-4107-b4e2-2114f6329888/thumbnail/1200x630/b7a7cf23f3dea51329dde18adcc453d0/gettyimages-1244625200.jpg", "publishedAt": "2023-05-21T20:05:00Z", "content": "The NAACP issued a formal travel advisory for Florida on Saturday in response to what the organization described as Gov. Ron DeSantis' \"aggressive attempts to erase Black history and to restrict dive… [+2996 chars]"}]}