{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "South Africa Betrays Mandela by Refusal to Vote Against Russia's Invasion of Ukraine - THISDAY Newspapers", "description": "Chido Nwangwu bemoans the stance of South Africa in the on-going aggression by Russia against Ukraine The United Nations resolution on Wednesday March 2, 2022 passed with a very wide gap-141 votes …", "url": "https://www.thisdaylive.com/index.php/2022/03/04/south-africa-betrays-mandela-by-refusal-to-vote-against-russias-invasion-of-ukraine/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2020/09/8f559d0d-chido-nwangwu.jpg", "publishedAt": "2022-03-04T03:04:32Z", "content": "Chido Nwangwu bemoans the stance of South Africa in the on-going aggression by Russia against Ukraine\r\nThe United Nations resolution on Wednesday March 2, 2022 passed with a very wide gap-141 votes f… [+3348 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Peter Fabricius", "title": "BRICS — has South Africa caught a monster by the tail... - Daily Maverick", "description": "It didn’t take a Nostrodamus to predict that South Africa might be biting off a bit more than it could chew when in 2011 it joined the BRICs (Brazil, Russia, India and China) to create the BRICS (in effect replacing the lower case ‘s’ with an upper case ‘S’).", "url": "https://www.dailymaverick.co.za/article/2022-03-03-brics-has-south-africa-caught-a-monster-by-the-tail-and-should-it-let-it-go/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/02/PeterFab-Brics-SA2-e1646346916411.jpg?w=1280", "publishedAt": "2022-03-03T21:59:55Z", "content": "South Africa was from the start clearly a tiny Gulliver venturing into the land of the Brobdingnags. At the time, most commentators focused on the huge disparity in the size of South Africas economy … [+10293 chars]"}, {"source": {"id": null, "name": "Science.org"}, "author": null, "title": "Africa battles out-of-control polio outbreaks - Science", "description": "Cases tumble in Pakistan and Afghanistan, but African outbreaks have become a grave threat to eradication", "url": "https://www.science.org/content/article/africa-battles-out-of-control-polio-outbreaks", "urlToImage": "https://www.science.org/do/10.1126/science.adb1787/abs/_20220304_nid_polionigeria.jpg", "publishedAt": "2022-03-03T21:40:49Z", "content": "On 17 February, Malawis Ministry of Health announced a nasty surprise: A 3-year-old girl who was paralyzed in November 2021 was infected with the wild poliovirus, which Africa officially vanquished i… [+7708 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lloyd Burnard", "title": "From cleaning boots to a maiden Test century: Why new Proteas star Erwee is 'a coach's dream' - News24", "description": "Sarel Erwee has had to be patient, waiting for his opportunity to play Test cricket, but he is now set for an extended run at the top of the South African order.", "url": "https://www.news24.com/sport/cricket/proteas/from-cleaning-boots-to-a-maiden-test-century-why-new-proteas-star-erwee-is-a-coachs-dream-20220303", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2588/5135d779c5b0486a86437b2cf229c600.jpg", "publishedAt": "2022-03-03T18:02:50Z", "content": "<ul><li>Proteas coach Mark Boucher is thrilled for Sarel Erwee, who took his Test chance against New Zealand.</li><li>\"Good things happen to good people,\" Boucher said. </li><li>Erwee carded a maiden… [+2628 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": "editing", "title": "Africa And Russia's Invasion of Ukraine By Azu Ishiekwene - SaharaReporters.com", "description": "What’s Africa’s interest in Ukraine? A bit more history could be of service in the continent’s quest for an answer.", "url": "http://saharareporters.com/2022/03/03/africa-and-russia%E2%80%99s-invasion-ukraine-azu-ishiekwene", "urlToImage": null, "publishedAt": "2022-03-03T15:46:50Z", "content": "War is messy and never fails to spread responsive misery. When Adolf Hitler asked for safe passage to East Prussia through the Polish corridor and also for the occupied port of Danzig, not many could… [+8818 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "FIBA World Cup: Nigeria’s D’Tigress To Face France In Group B - Channels Television", "description": "The D’Tigress will again face France after they were paired in Group B of the 2022 Women’s World Cup. Nigeria defeated them last month during the qualification tournament for the World Cup. Aside from the Europeans, the defending African champions will also b…", "url": "https://www.channelstv.com/2022/03/03/fiba-world-cup-nigeria-dtigress-to-face-france-in-group-b/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2022/02/dtigress-2.jpg", "publishedAt": "2022-03-03T12:22:50Z", "content": "The Nigerian girls had lost their fight game in the World Cup qualifiers. Photo: FIBA\r\nThe DTigress will again face France after they were paired in Group B of the 2022 Womens World Cup. Nigeria defe… [+684 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "R16 billion in road tenders continue to be delayed by Sanral. South Africa chooses to abstain from voting for if Russia should withdraw from Ukraine at the UN General Assembly. The Ukraine invasion may push the SARB to increase further rate hikes in South Afr…", "url": "https://businesstech.co.za/news/government/564372/5-important-things-happening-in-south-africa-today-1232/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/49559517523_330b2b7b55_c-e1646286151140.jpg", "publishedAt": "2022-03-03T06:26:45Z", "content": "Heres what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 1,995 new cases of Covid-19, taking the total reported to 3,677,686. Deaths have reached 99… [+3368 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "Russia's invasion of Ukraine: It's against SA's 'principles' to take sides, says deputy minister - News24", "description": "With the civilian death toll in Ukraine rising after Russia invaded the country, South Africa will stick with its \"principles\" and not take sides, Deputy International Relations and Cooperation Minister Candith Mashego-Dlamini told the National Assembly.", "url": "https://www.news24.com/news24/southafrica/news/russias-invasion-of-ukraine-its-against-sas-principles-to-take-sides-says-deputy-minister-20220303", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3256/da853da4f1b44e289e26fdbd2da9224b.jpg", "publishedAt": "2022-03-03T00:30:35Z", "content": "With the civilian death toll in Ukraine rising after Russia invaded the country, South Africa will stick with its \"principles\" and not take sides, Deputy International Relations and Cooperation Minis… [+793 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Obesity rising in Africa, WHO analysis finds - WHO | Regional Office for Africa", "description": "One in five adults and one in 10 children and teenagers are projected to be obese by December 2023 in 10 high-burden African countries if no robust measures are taken to reverse the trends, a new World Health Organization (WHO) analysis shows.", "url": "https://www.afro.who.int/news/obesity-rising-africa-who-analysis-finds", "urlToImage": "https://www.afro.who.int/sites/default/files/styles/teaser_thumbnail_600x600_/public/2022-03/WHO_056799.jpg?itok=hDUvSMkR", "publishedAt": "2022-03-02T12:00:00Z", "content": "Brazzaville One in five adults and one in 10 children and teenagers are projected to be obese by December 2023 in 10 high-burden African countries if no robust measures are taken to reverse the trend… [+3286 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This one car is helping to drive a change in consumer behaviour in South Africa - BusinessTech", "description": "New vehicle sales data for February 2022 shows that the vehicle market in South Africa continued to gain traction. Aggregate domestic new vehicle sales in February 2022, at 44,229 units, reflected an increase of 6,860 units, or 18,4%, from the same period a y…", "url": "https://businesstech.co.za/news/motoring/564082/this-one-car-is-helping-to-drive-a-change-in-consumer-behaviour-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/11/Toyota-Corolla-Cross.png", "publishedAt": "2022-03-02T09:22:30Z", "content": "New vehicle sales data for February 2022 shows that the vehicle market in South Africa continued to gain traction.\r\nAggregate domestic new vehicle sales in February 2022, at 44,229 units, reflected a… [+5861 chars]"}]}