{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "Nigeria vs Ghana: Akpoborie predicts team that will qualify as Eguavoen names squad - Daily Post Nigeria", "description": "Former Nigerian striker, Jonathan Akpoborie, has said he expects the three-time African champions to qualify for Qatar 2022. Akpoborie was reacting to the Super Eagles' squad list released by interim coach, Augustine Eguavoen, on Friday, ahead of the playoffs…", "url": "https://dailypost.ng/2022/03/04/nigeria-vs-ghana-akpoborie-predicts-team-that-will-qualify-as-eguavoen-names-squad/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2015/09/Jonathan-Akpoborie.jpg", "publishedAt": "2022-03-04T17:26:27Z", "content": "Former Nigerian striker, Jonathan Akpoborie, has said he expects the three-time African champions to qualify for Qatar 2022.\r\nAkpoborie was reacting to the Super Eagles’ squad list released by interi… [+808 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "'He was my idol, he was everything I wanted to be' - Cassper Nyovest's tribute to Riky Rick - Eyewitness News", "description": "The memorial of the late Riky Rick was held on 4 March 2022, where some of South Africa's top celebrities were in attendance.#CassperNyovest#RikyRick", "url": "https://www.youtube.com/watch?v=Yvp6rlcdwnQ", "urlToImage": "https://i.ytimg.com/vi/Yvp6rlcdwnQ/hqdefault.jpg", "publishedAt": "2022-03-04T12:28:46Z", "content": null}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Max Du Plessis", "title": "WAR IN EUROPE OP-ED: South Africa's Ukraine failure is an international tragedy that doubles as a constitutional calamity - Daily Maverick", "description": "If South Africa takes these international law obligations seriously it should reverse its position immediately and give up on the ‘quisling’ double-speak about Russia’s aggression and crimes.", "url": "https://www.dailymaverick.co.za/article/2022-03-04-south-africas-ukraine-failure-is-an-international-tragedy-that-doubles-as-a-constitutional-calamity/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/Oped-Ukraine-SA1.jpg?w=1280", "publishedAt": "2022-03-04T12:24:04Z", "content": "The past week has been extraordinary. Not only because of what has happened in Ukraine under Russias unlawful invasion by all standards of international law. But also because of South Africas stomach… [+14959 chars]"}, {"source": {"id": null, "name": "Carmag.co.za"}, "author": "John Whittle", "title": "DRIVEN: BMW M240i xDrive Coupé - Carmag South Africa", "description": "Although BMW doesn’t consciously dabble in the business of psychology (unless you’re after the therapeutic effect of a proper M car), the new M240i xDrive is somewhat reminiscent of a chapter in the theory of middle child syndrome.", "url": "https://www.carmag.co.za/news/driven-bmw-m240i-xdrive-coupe/", "urlToImage": "https://www.carmag.co.za/wp-content/uploads/2022/03/P90452933_highRes_bmw-m240i-xdrive-03-.jpg", "publishedAt": "2022-03-04T10:29:15Z", "content": "Although BMW doesnt consciously dabble in the business of psychology (unless youre after the therapeutic effect of a proper M car), the new M240i xDrive is somewhat reminiscent of a chapter in the th… [+3540 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Liberia Records 322 Measles Cases - AllAfrica - Top Africa News", "description": "The ministry of health announces that based on data received from health workers, a total of 322 suspected measles cases have been reported in five counties here. Of the number of cases, laboratory test has identified and confirmed 72 of them.", "url": "https://allafrica.com/stories/202203040267.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-03-04T09:34:42Z", "content": "The ministry of health announces that based on data received from health workers, a total of 322 suspected measles cases have been reported in five counties here. Of the number of cases, laboratory t… [+1995 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "One of South Africa’s richest men is betting big on Virgin Active - BusinessTech", "description": "Virgin Active Holdings raised £88.4 million ($118 million) from backers including billionaire Christo Wiese, and will expand with the acquisition of the nutrition assets of South Africa’s Real Foods Group.", "url": "https://businesstech.co.za/news/business/565024/one-of-south-africas-richest-men-is-betting-big-on-virgin-active/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/09/Virgin-Active.jpg", "publishedAt": "2022-03-04T07:53:31Z", "content": "Virgin Active Holdings raised £88.4 million ($118 million) from backers including billionaire Christo Wiese, and will expand with the acquisition of the nutrition assets of South Africas Real Foods G… [+1992 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Health minister on lifting South Africa’s state of disaster and new vaccine mandates - BusinessTech", "description": "Health minister Joe Phaahla says his department has been hard at work to formulate new regulations to replace the country’s state of disaster and is now ready to present its proposals to the cabinet and the National Coronavirus Command Council (NCCC).", "url": "https://businesstech.co.za/news/trending/564968/health-minister-on-lifting-south-africas-state-of-disaster-and-new-vaccine-mandates/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Joe-Phaahla.png", "publishedAt": "2022-03-04T07:04:56Z", "content": "Health minister Joe Phaahla says his department has been hard at work to formulate new regulations to replace the country’s state of disaster and is now ready to present its proposals to the cabinet … [+3519 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "Nearly 3 million children in Malawi to get polio shot - Africanews English", "description": "Polio is a highly infectious disease that invades the nervous system and can cause total paralysis within hours", "url": "http://www.africanews.com/2022/03/04/nearly-3-million-children-in-malawi-to-get-polio-shot/", "urlToImage": "https://static.euronews.com/articles/stories/06/51/96/68/1024x538_cmsv2_847c02b0-c834-53fc-8d44-caf08b459b36-6519668.jpg?1646377401", "publishedAt": "2022-03-04T07:03:21Z", "content": "Medics will vaccinate about 2.9 million young children against polio in Malawi, the United Nations said on Thursday, after a three-year-old girl fell sick in the capital with Africa's first case of w… [+872 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lynn Butler", "title": "PREVIEW | History beckons as in-form Proteas women look to go all the way in World Cup | Sport - News24", "description": "The Women's Cricket World Cup is finally here and an in-form South African outfit are looking to go all the way in New Zealand. Here's everything you need to know.", "url": "https://www.news24.com/sport/cricket/proteas/preview-history-beckons-as-in-form-proteas-women-look-to-go-all-the-way-in-world-cup-20220304", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2915/b42b95eba72649db871c9d9277d365aa.jpg", "publishedAt": "2022-03-04T03:00:36Z", "content": "The Women's Cricket World Cup is finally here and an in-form South African outfit is looking to go all the way in New Zealand.\r\nThe eight-team tournament was originally scheduled for early 2021, but … [+206 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Juniour Khumalo", "title": "US Embassy urges SA to stop sitting on the fence over Russia-Ukraine conflict - News24", "description": "The US has called on South Africa to desist from sitting on the fence and name the aggressor in the war in Ukraine.", "url": "https://www.news24.com/news24/southafrica/news/us-embassy-urges-sa-to-stop-sitting-on-the-fence-over-russia-ukraine-conflict-20220303", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3261/0c56dbd6b54a4716b829adc024ea0e3d.jpg", "publishedAt": "2022-03-03T19:41:15Z", "content": "<ul><li>The US Embassy in South Africa has called on President Cyril Ramaphosa's administration to take a tougher stance on Russia for its invasion of Ukraine. </li><li>The embassy's chargé d'affaire… [+5140 chars]"}, {"source": {"id": null, "name": "Cajnewsafrica.com"}, "author": null, "title": "Rising obesity a ticking time bomb – CAJ News Africa - Caj News Africa", "description": "from MARIA MACHARIA in Nairobi, Kenya Kenya Bureau NAIROBI, (CAJ News) – MILLIONS of people in the African continent are at risk of death because of the rising problem of obesity. The warning…", "url": "https://www.cajnewsafrica.com/2022/03/03/rising-obesity-a-ticking-time-bomb/", "urlToImage": "https://i0.wp.com/www.cajnewsafrica.com/wp-content/uploads/2022/03/obesity.jpg?fit=900%2C781&ssl=1", "publishedAt": "2022-03-03T03:04:09Z", "content": "from MARIA MACHARIA in Nairobi, KenyaKenya BureauNAIROBI,(CAJ News) – MILLIONS of people in the African continent are at risk of death because of the rising problem of obesity.\r\nThe warning comes ahe… [+1663 chars]"}]}