{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Sabcnews.com"}, "author": "Paballo Lephaka", "title": "Namibia to suspend use of Russian COVID-19 vaccine - ministry - SABC News", "description": "Namibia will suspend its rollout of Russia's Sputnik V COVID-19 vaccine, its health ministry said on Saturday, days after the drugs regulator in neighbouring South Africa flagged concerns about its safety for people at risk of HIV.", "url": "https://www.sabcnews.com/sabcnews/namibia-to-suspend-use-of-russian-covid-19-vaccine-ministry/", "urlToImage": "https://www.sabcnews.com/sabcnews/wp-content/uploads/2021/10/Sputnik-V-Vaccine-Reuters-2.png", "publishedAt": "2021-10-25T08:01:32Z", "content": "Namibia will suspend its rollout of Russia’s Sputnik V COVID-19 vaccine, its health ministry said on Saturday, days after the drugs regulator in neighbouring South Africa flagged concerns about its s… [+1937 chars]"}, {"source": {"id": null, "name": "Leadership.ng"}, "author": "Agency Report", "title": "Salah Breaks Drogba Record As Liverpool Humiliate Man Utd - LEADERSHIP NEWS", "description": "Liverpool star Mohamed Salah has overtaken Didier Drogba as the highest scoring African in Premier League history. The Egypt international scored three goals against Manchester United in the 5-0 battering at Old Trafford on Sunday. Salah now has 107 goals to …", "url": "https://leadership.ng/salah-breaks-drogba-record-as-liverpool-humiliate-man-utd/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/10/2C147DDF-5C11-4992-AF9F-42CD9F7B37B1.jpeg", "publishedAt": "2021-10-25T07:54:10Z", "content": null}, {"source": {"id": null, "name": "Pulse Nigeria"}, "author": "Pulse Mix", "title": "Hanu Fejiro Agbodje puts Africa in the spotlight, selected for the Amplify 2021 program and to be recognized by Money20/20 - Pulse Nigeria", "description": "One of Africa’s young, future-forward entrepreneurs and tech founders, Hanu Fejiro Agbodje Founder and CEO of Patricia Technologies has been listed among 15 innovative individuals on the inaugural AMPLIFY 2021 program", "url": "https://www.pulse.ng/business/hanu-fejiro-agbodje-puts-africa-in-the-spotlight-selected-for-the-amplify-2021/883y886#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/Fg8ktkpTURBXy8yNjk3ZGNlMDE1NTFmYjY1MzJmYTA4MWJlNmM3MTMyMi5wbmeSlQMSAM0B3M0BDJMFzQSwzQJ2", "publishedAt": "2021-10-25T07:25:44Z", "content": "Hanu, the only African in the 2021 cohort, was listed alongside Ambika Sharma of U.S Bank and Chris Lavato Founder of SOON. The lineup includes the biggest minds and brightest innovators within their… [+1669 chars]"}, {"source": {"id": null, "name": "Fortress of Solitude"}, "author": "https://www.facebook.com/evan.saunders.za", "title": "Xiaomi 11T Pro Officially Launches in South Africa - Fortress of Solitude", "description": "Following weeks of teasing ahead of Xiaomi's virtual event on Facebook, the wait is finally over. The brand has officially launched the all-new Xiaomi 11T", "url": "https://www.fortressofsolitude.co.za/xiaomi-11t-pro-launches-south-africa/", "urlToImage": "https://www.fortressofsolitude.co.za/wp-content/uploads/2021/10/Xiaomi-11T-Pro-01.jpg", "publishedAt": "2021-10-25T07:21:30Z", "content": "Following weeks of teasing ahead of Xiaomi’s virtual event on Facebook, the wait is finally over. The brand has officially launched the all-new Xiaomi 11T Pro.\r\nThe Xiaomi 11T Pro is coming to South … [+2039 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "Africans Call On Global Community To Honor Commitment to a \"just and inclusive\" Energy Transition (By NJ Ayuk) - Africanews English", "description": "By NJ Ayuk, Executive Chairman of the African Energy Chamber (www.EnergyChamber.org)\n\nWhen nearly 200 government and business leaders from around the globe signed the Paris Agreement", "url": "http://www.africanews.com/2021/10/25/africans-call-on-global-community-to-honor-commitment-to-a-just-and-inclusive-energy-transition-by-nj-ayuk/", "urlToImage": "https://static.euronews.com/articles/wires/788/10/7881062/1024x538_biq8qzo.jpg?1635145216", "publishedAt": "2021-10-25T07:00:16Z", "content": "By NJ Ayuk, Executive Chairman of the African Energy Chamber (www.EnergyChamber.org)\r\nWhen nearly 200 government and business leaders from around the globe signed the Paris Agreement in December 2015… [+11965 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Updated level 1 lockdown rules for schools and travel in South Africa - BusinessTech", "description": "Government has gazetted updated lockdown regulations for South Africa’s adjusted level 1 lockdown, including changes for schools and transport.", "url": "https://businesstech.co.za/news/government/531626/updated-level-1-lockdown-rules-for-schools-and-travel-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/03/South-Africa-lockdown.png", "publishedAt": "2021-10-25T06:35:16Z", "content": "The government has gazetted updated regulations for South Africa’s adjusted level 1 lockdown, including changes for schools and transport.\r\nThe changes include the relaxation of restrictions for air … [+3981 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Report accuses former Eskom leadership of manipulating data; economists warn of higher petrol prices and inflation to follow; M&G publishes election map, providing a visual guide to the coming elections; and analysts see anti-vaccine sentiment being exploited…", "url": "https://businesstech.co.za/news/government/531636/5-important-things-happening-in-south-africa-today-1151/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/08/PetrolStation-e1533287109402.jpg", "publishedAt": "2021-10-25T06:25:04Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 300 new cases of Covid-19, taking the total reported to 2,919,632. Deaths have reached 88,… [+3517 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "Reuters", "title": "Entertainment News Roundup: Alec Baldwin was aiming at camera when gun discharged - affadavit; Somali drama wins Pan-African film festival grand prize and more - Devdiscourse", "description": "Read more about Entertainment News Roundup: Alec Baldwin was aiming at camera when gun discharged - affadavit; Somali drama wins Pan-African film festival grand prize and more  on Devdiscourse", "url": "https://www.devdiscourse.com/article/entertainment/1780633-entertainment-news-roundup-alec-baldwin-was-aiming-at-camera-when-gun-discharged---affadavit-somali-drama-wins-pan-african", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/19_09_2019_12_07_36_2076064.jpg?width=920&format=jpeg", "publishedAt": "2021-10-25T05:02:46Z", "content": "Following is a summary of current entertainment news briefs.\r\nAlec Baldwin was aiming at camera when gun discharged - affadavit\r\nAlec Baldwin was drawing a revolver across his body and pointing it at… [+4984 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Carien du Plessis", "title": "DA leader John Steenhuisen points out ‘dysfunctional ANC municipalities’ while making his final pitch - Daily Maverick", "description": "Steenhuisen quoted government figures that say 64 municipalities are considered delinquent or dysfunctional, and News24’s Out of Order survey that found 43 more municipalities on the verge of collapse. This meant more than a third of South Africa’s 278 munici…", "url": "https://www.dailymaverick.co.za/article/2021-10-24-da-leader-john-steenhuisen-points-out-dysfunctional-anc-municipalities-while-making-his-final-pitch/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/da8.jpg", "publishedAt": "2021-10-24T21:32:40Z", "content": "The one thing that all these broken towns and cities share is an ANC local government, says Steenhuisen, sweat glistening on his forehead.\r\nYou need to vote with your head, DA leader John Steenhuisen… [+5537 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lwandile Bhengu", "title": "Policing facial expressions a new low, says DA leader after Gareth Cliff panel debate - News24", "description": "DA leader John Steenhuisen says South Africa is starting to reach a new low by policing people's facial expressions.", "url": "https://www.news24.com/news24/southafrica/news/policing-facial-expressions-a-new-low-says-da-leader-after-gareth-cliff-panel-debate-20211024", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/4307/de72457be4d84ac3a5090040d7ada670.jpg", "publishedAt": "2021-10-24T17:43:37Z", "content": "<ul><li>DA leader John Steenhuisen was accused of smirking during a panel debate where Gareth Cliff described One South Africa Movement member Mudzuli Rakhivhane's experiences of racism as \"anecdotal… [+2441 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mpiko Ntsekhe and Tracey Naledi", "title": "We have a crisis: South Africa urgently needs leadership to roll out Covid-19 vaccine mandates - Daily Maverick", "description": "South African society is lit up by discussion and debate about the place of vaccine mandates in the fight against Covid-19. Conspicuous by their absence in this crucial issue are those elected and appointed to provide leadership at local, provincial and natio…", "url": "https://www.dailymaverick.co.za/article/2021-10-24-we-have-a-crisis-south-africa-urgently-needs-leadership-to-roll-out-covid-19-vaccine-mandates/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/MC-VaxMandates.jpg", "publishedAt": "2021-10-24T17:17:07Z", "content": "About 35% of the nation is vaccinated, woefully short of the desired target of 90% most experts agree we need to avert the disastrous consequences of recurring Covid-19 waves.\r\nWhile there are aspect… [+9159 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Some Young Nigerians Say Heavy Drinking Is Fun - Controls Must Keep Pace With Culture - AllAfrica.com", "description": "Analysis - Alcohol consumption has a long history in Nigeria, especially in the southern region, where it was not forbidden by religion. In the past, only adult men were culturally allowed to drink. It was taboo for young people to drink alcohol because it wa…", "url": "https://allafrica.com/stories/202110240040.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-10-24T14:50:23Z", "content": "Alcohol consumption has a long history in Nigeria, especially in the southern region, where it was not forbidden by religion. In the past, only adult men were culturally allowed to drink. It was tabo… [+6093 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Poloko Tau", "title": "COP26: SA to call for developed countries to financially help with climate crisis | Citypress - News24", "description": "South Africa will use its presence at the 26th Conference of the Parties, commonly known as COP26, in the UK at the end of this month to emphasise the importance of sustainable finance by developed to developing countries to enable them to set themselves up i…", "url": "https://www.news24.com/citypress/news/cop26-sa-to-call-for-developed-countries-to-financially-help-with-climate-crisis-20211024", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8030/a0aac8144a32478792485b96bba012a5.jpg", "publishedAt": "2021-10-24T00:12:05Z", "content": null}]}