{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "Tribuneonlineng.com"}, "author": "Paul Omorogbe", "title": "We remain committed to fighting for justice everywhere —Buhari - Tribune Online", "description": "President Muhammadu Buhari has reassured of Nigeria's commitment to pursuing peace and progress in Africa, and other parts of the world, by consistently pushing for justice, fairness and inclusiveness in global affairs.He gave the assurance in a side", "url": "https://tribuneonlineng.com/we-remain-committed-to-fighting-for-justice-everywhere-buhari/", "urlToImage": "//331746-1018445-1-raikfcquaxqncofqfm.stackpathdns.com/wp-content/uploads/2022/01/BUHARI.png", "publishedAt": "2022-02-05T14:54:53Z", "content": "President Muhammadu Buhari has reassured of Nigeria’s commitment to pursuing peace and progress in Africa, and other parts of the world, by consistently pushing for justice, fairness and inclusivenes… [+1206 chars]"}, {"source": {"id": null, "name": "The East African"}, "author": "PAULINE KAIRU", "title": "Children with severe Covid suffer high mortality after ICU admission - The East African", "description": "<p>Researchers say limited availability of paediatric intensive care and lack of jabs to blame for deaths in sub-Saharan Africa.</p>", "url": "https://www.theeastafrican.co.ke/tea/science-health/children-severe-covid-suffer-high-mortality-after-icu-admission-3706408", "urlToImage": "https://www.theeastafrican.co.ke/resource/blob/3706416/556910ed9313af6c8645fb52cc29750a/children-data.jpg", "publishedAt": "2022-02-05T12:52:32Z", "content": "By PAULINE KAIRU\r\nChildren in sub-Saharan Africa with severe Covid-19 are dying at a significantly higher rate than children in the West, a new study has said, challenging the notion that the illness… [+2637 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Agency Report", "title": "Buhari, other African leaders meet in Addis Ababa over coups, others - Punch Newspapers", "description": "Buhari, other African leaders meet in Addis Ababa over coups, others", "url": "https://punchng.com/buhari-other-african-leaders-meet-in-addis-ababa-over-coups-others/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/01/20113702/Buhari-kaduna.jpg", "publishedAt": "2022-02-05T12:49:34Z", "content": "Heads of state gathered Saturday at the African Union headquarters to kick off a two-day summit as the continent reels from a spate of military coups and the coronavirus pandemic.\r\nThe President, Maj… [+3509 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "John Owen Nwachukwu", "title": "Senegal vs Egypt: Jay Jay Okocha predicts country to win AFCON 2021 trophy - Daily Post Nigeria", "description": "Nigerian football legend, Austine Jay Jay Okocha, has tipped Senegal to win the ongoing Africa Cup of Nations in Cameroon. The Taranga Lions will on Sunday lock horns with the Pharaohs of Egypt in the 2021 edition of the binary tournament. The Pharaohs defeat…", "url": "https://dailypost.ng/2022/02/05/senegal-vs-egypt-jay-jay-okocha-predicts-country-to-win-afcon-2021-trophy/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/01/Jay-Jay-Okocha-4.jpg", "publishedAt": "2022-02-05T12:32:45Z", "content": "Nigerian football legend, Austine Jay Jay Okocha, has tipped Senegal to win the ongoing Africa Cup of Nations in Cameroon.\r\nThe Taranga Lions will on Sunday lock horns with the Pharaohs of Egypt in t… [+649 chars]"}, {"source": {"id": null, "name": "P.M. News"}, "author": null, "title": "IAEA launches cancer care initiative in Africa - P.M. News", "description": "The International Atomic Energy Agency launches new initiative aimed at providing cancer care for people living in Africa.", "url": "https://pmnewsnigeria.com/2022/02/05/iaea-launches-cancer-care-initiative-in-africa/", "urlToImage": "https://cdn.pmnewsnigeria.com/wp-content/uploads/2022/02/International-Atomic-Energy-Agency-scaled.jpg", "publishedAt": "2022-02-05T11:46:37Z", "content": "The International Atomic Energy Agency (IAEA) on Friday, World Cancer Day, launched a new initiative aimed at providing cancer care for people living in low and middle-income countries in Africa.\r\nTh… [+1217 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Israel dispute erupts at African Union summit - News24", "description": "Palestinian prime minister Mohammed Shtayyeh on Saturday urged the African Union to withdraw Israel's accreditation, bringing simmering tensions to a head as the 55-member bloc opened a two-day summit in Addis Ababa.", "url": "https://www.news24.com/news24/africa/news/israel-dispute-erupts-at-african-union-summit-20220205", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2870/007d920ada4b4e0eb3534e30285310c8.jpg", "publishedAt": "2022-02-05T10:50:46Z", "content": "<ul><li>The African Union has begun it's two day summit in Addis Ababa.</li><li>During the opening Palestinian prime minister urged the AU to withdraw Israel's accreditation.</li><li>Africa's relatio… [+4674 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Alex Mitchley", "title": "Covid-19: Fifth wave of infections expected as SA approaches winter - News24", "description": "Health Minister Joe Phaahla says he believes that as the country moves closer to winter, there will be an expectation of a fifth wave of Covid-19 infections. South Africa has officially reached the end of the fourth wave.", "url": "https://www.news24.com/news24/southafrica/news/covid-19-fifth-wave-of-infections-expected-as-sa-approaches-winter-20220205", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/645/0382bc58197441e6baf5d072c1f252a6.jpg", "publishedAt": "2022-02-05T06:16:29Z", "content": "<ul><li>During a briefing on Friday, Health Minister Joe Phaahla spoke about the country entering a fifth wave of SARS-CoV-2 later this year. </li><li>Phaahla said there was an expectation that as th… [+4043 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "More South Africans are moving to this island – as it targets skilled tech and finance workers - BusinessTech", "description": "With a population of around 86,000 people, the Isle of Man most likely boasts the highest percentage of South African expats in the world, with figures currently sitting at around 10% of the population, says Marnie Delaney-Parker, director at IOM Opportunitie…", "url": "https://businesstech.co.za/news/technology/553942/more-south-africans-are-moving-to-this-island-as-it-targets-skilled-tech-and-finance-workers/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Isle-of-Man.jpg", "publishedAt": "2022-02-05T05:00:15Z", "content": "With a population of around 86,000 people, the Isle of Man most likely boasts the highest percentage of South African expats in the world, with figures currently sitting at around 10% of the populati… [+2368 chars]"}, {"source": {"id": null, "name": "Mirror Online"}, "author": "Freddie Keighley", "title": "Mohamed Salah taunter Vincent Aboubakar left lost for words after Egypt beat Cameroon - The Mirror", "description": "Egypt captain Mohamed Salah had the last laugh over Cameroon rival Vincent Aboubakar, who sent him a fiery message ahead of Thursday's Africa Cup of Nations semi-final", "url": "https://www.mirror.co.uk/sport/football/news/mohamed-salah-afcon-egypt-final-26141980", "urlToImage": "https://i2-prod.mirror.co.uk/incoming/article26142414.ece/ALTERNATES/s1200/0_Untitled-1.jpg", "publishedAt": "2022-02-04T16:35:11Z", "content": "Mohamed Salah stunned Vincent Aboubakar into silence as Egypt defeated Cameroon to eliminate the hosts from the Africa Cup of Nations. \r\n The Pharaohs will face Senegal in Sunday's final after overco… [+2537 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Londiwe Buthelezi", "title": "'Not a cartel' - WesBank defends agreement with Toyota as it's prosecuted for collusion - News24", "description": "The Competition Commission referred WesBank to the Competition Tribunal for prosecution for allegedly colluding with Toyota Financial Services South Africa.", "url": "https://www.news24.com/fin24/companies/not-a-cartel-wesbank-defends-agreement-with-toyota-as-its-prosecuted-for-collusion-20220204", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2845/caa859e9dd07488c8f96ce4cefce5f48.jpg", "publishedAt": "2022-02-04T10:00:29Z", "content": "Car financier WesBank says its partnership with Toyota Financial Services was a genuine commercial arrangement with no cartel intentions.\r\nThe Competition Commission referred the FirstRand-owned fina… [+1893 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "PlayStation has no major multiplayer games, so Sony spent $3.6 billion to buy a successful one - Business Insider South Africa", "description": "Sony's purchase of \"Destiny\" developer Bungie, Inc. for $3.6 billion wasn't just a response to Microsoft's recent acquisition of Activision.", "url": "https://www.businessinsider.com/why-did-sony-playstation-buy-bungie-2022-2", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/2817/7d4a163487ca4fa1aae177c9bf2c1cad.jpg", "publishedAt": "2022-02-04T09:08:23Z", "content": "Sony announced on Monday that it's buying the veteran game development house Bungie — a studio that's most notable for having created the \"Halo\" franchise, which Microsoft now owns, and more recently… [+2884 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Celebrating 70 Years of GISRS (The Global Influenza Surveillance and Response System) - AllAfrica.com", "description": "Press Release - Founded in 1952, the Global Influenza Surveillance and Response System, or GISRS, is celebrating 70 years of success as a worldwide network founded to protect people from the threat of influenza, reviewing its added value to other respiratory …", "url": "https://allafrica.com/stories/202202040096.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-02-04T07:18:50Z", "content": "Founded in 1952, the Global Influenza Surveillance and Response System, or GISRS, is celebrating 70 years of success as a worldwide network founded to protect people from the threat of influenza, rev… [+4621 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "William Antonelli", "title": "How to accept the license agreements in Rocket League, even if you've rejected them before - Business Insider Africa", "description": "Before you can play online in Rocket League, you need to accept the End User License Agreement.", "url": "https://africa.businessinsider.com/tech-insider/how-to-accept-the-license-agreements-in-rocket-league-even-if-youve-rejected-them/x2y2dhp#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/06SktkuTURBXy9lZjVlOTU2Yi1jOTVjLTQ4YWItYjhiMC04N2RjYWRjY2QzOTYuanBlZ5GTBc0EsM0Cdg", "publishedAt": "2022-02-03T22:17:49Z", "content": "It seems like whenever you sign up for a new game or app, it asks you to read and agree to a novel-length legal document before you can play. And while these documents are important, it's rare that a… [+1497 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "New MeerKAT Image Reveals Radio-Emitting Filaments in Milky Way's Center - Sci-News.com", "description": "The new image from the MeerKAT telescope at the South African Radio Astronomy Observatory (SARAO) in Cape Town, South Africa, shows nearly 1,000 magnetized threads in the Galactic center.", "url": "http://www.sci-news.com/astronomy/radio-emitting-filaments-milky-ways-center-10519.html", "urlToImage": "http://cdn.sci-news.com/images/2022/02/image_10519-Milky-Way-Center.jpg", "publishedAt": "2022-02-03T19:18:26Z", "content": "The new image from the MeerKAT telescope at the South African Radio Astronomy Observatory (SARAO) in Cape Town, South Africa, shows nearly 1,000 magnetized threads in the Galactic center.\r\nAn image o… [+4063 chars]"}]}