{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Herman Mostert", "title": "Bok coach chuffed with SA rugby's depth: No Griquas player in our leading 100 - News24", "description": "Springbok coach Jacques Nienaber says there's no shortage of depth in South African rugby.", "url": "https://www.news24.com/sport/rugby/springboks/bok-coach-chuffed-with-sa-rugbys-depth-no-griquas-player-in-our-leading-100-20220622", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/4374/77dc55f3a1fa4061b7cb6b12dc997431.jpg", "publishedAt": "2022-06-22T12:06:24Z", "content": "<ul><li>Bok coach Jacques Nienaber says there's no shortage of depth in South African rugby.</li><li>Nienaber adds it was welcome to see Griquas and the Pumas reach the Currie Cup final.</li><li>To h… [+2442 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Ghana: Antimicrobial Effects of Antipyretics. - AllAfrica - Top Africa News", "description": "Opinion - This particular piece is triggered by a recent discussion. Does paracetamol have antimicrobial properties? The response is going to cover other agents used as antipyretics. I will be using materials by Zimmermann P, Curtis N. 2017.Antimicrobial effe…", "url": "https://allafrica.com/stories/202206220334.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-06-22T10:52:48Z", "content": "This particular piece is triggered by a recent discussion. Does paracetamol have antimicrobial properties? The response is going to cover other agents used as antipyretics. I will be using materials … [+7878 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The private company taking on South Africa’s biggest universities - BusinessTech", "description": "Stadio, the JSE-listed investment holdings company with investments in three private higher education institutions, has set its sights on creating an alternative to the University of South Africa, the largest university system in the country, with in excess o…", "url": "https://businesstech.co.za/news/business-opinion/599104/the-private-company-taking-on-south-africas-biggest-universities/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/06/Stadio.png", "publishedAt": "2022-06-22T09:25:46Z", "content": "Stadio, the JSE-listed investment holdings company with investments in three private higher education institutions, has set its sights on creating an alternative to the University of South Africa, th… [+3429 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Inflation hits 5-year high in South Africa – here’s what is more expensive - BusinessTech", "description": "Statistics South Africa has published its latest consumer price index, showing that annual consumer price inflation was 6.5% in May 2022, up from 5,9% in April 2022.", "url": "https://businesstech.co.za/news/finance/599092/inflation-hits-5-year-high-in-south-africa-heres-what-is-more-expensive/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Grocery-Shop-Bloomberg.jpg", "publishedAt": "2022-06-22T08:17:22Z", "content": "Statistics South Africa has published its latest consumer price index, showing that annual consumer price inflation has broken through the upper limit of the Reserve Bank’s target range.\r\nInflation w… [+2641 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "Golden Eaglets Qualify for Africa U17 Cup of Nations - THISDAY Newspapers", "description": "*Defender Michael wins third consecutive Man-of-the-Match award For the second time in less than one month, Nigeria underscored her stature in youth football on the African continent as five-…", "url": "https://www.thisdaylive.com/index.php/2022/06/22/golden-eaglets-qualify-for-africa-u17-cup-of-nations/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/d943f780-0.jpg", "publishedAt": "2022-06-22T00:48:06Z", "content": "*Defender Michael wins third consecutive Man-of-the-Match award\r\nFor the second time in less than one month, Nigeria underscored her stature in youth football on the African continent as five-time wo… [+1939 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s first cannabis clinical trial starts – here’s what you need to know - BusinessTech", "description": "JSE-Listed investment holding company Labat Africa says it has begun South Africa’s first ethically-approved cannabis clinical trials – the Pharma Ethics Observational Study.", "url": "https://businesstech.co.za/news/business/598950/south-africas-first-cannabis-clinical-trial-starts-heres-what-you-need-to-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/shutterstock_1958572762-e1646805506258.jpg", "publishedAt": "2022-06-21T15:11:58Z", "content": "JSE-Listed investment holding company Labat Africa says it has begun South Africas first ethically-approved cannabis clinical trials – the Pharma Ethics Observational Study.\r\nThe Biodata research pro… [+4021 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Compiled by Larry Claasen", "title": "Vodacom has best quality network. MTN is fastest. And Cell C ranked last in almost everything. - Business Insider South Africa", "description": "Vodacom was ranked ahead of its rivals when it came to best quality network according to a report. But MTN is faster, and Cell C came last in almost everything.", "url": "https://www.businessinsider.co.za/vodacom-outranks-rivals-as-best-quality-network-but-mtn-is-faster-and-cell-c-came-last-in-almost-everything-report-2022-6", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10519/ecf0113a70cd4e988ea0d78069da01a3.jpg", "publishedAt": "2022-06-21T14:50:01Z", "content": "<ul><li>Vodacom was ranked ahead of its rivals when it came to quality network, according to Tutela's Mobile Experience Snapshot report.</li><li>But MTN's download speeds are faster.</li><li>And Cell… [+2504 chars]"}, {"source": {"id": null, "name": "Deadline"}, "author": "Melanie Goodfellow", "title": "Amazon Prime Video Pushes Further Into Nollywood, Strikes Three Picture Deal With Nemsia Films - Deadline", "description": "Amazon Prime Video is expanding its footprint in Africa with a three-picture deal with Lagos City-based production house Nemsia Films. The first feature in the deal will be Breath of Life. Described as an inspirational story about life and destiny, it is writ…", "url": "https://deadline.com/2022/06/amazon-nemsia-nollywood-africa-1235049059/", "urlToImage": "https://deadline.com/wp-content/uploads/2021/08/Amazon-Prime-Video-Logo.jpg?w=1000", "publishedAt": "2022-06-21T12:35:00Z", "content": "Amazon Prime Video is expanding its footprint in Africa with a three-picture deal with Lagos City-based production house Nemsia Films.\r\nThe first feature in the deal will be Breath of Life. Described… [+1333 chars]"}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Joshua Faleti", "title": "Astronomers link 64 MeerKAT Dishes to Observe the Universe - Space in Africa", "description": "Astronomers have combined the power of 64 radio telescope dishes to detect neutral hydrogen gas across cosmological scales.", "url": "https://africanews.space/astronomers-link-64-meerkat-dishes-to-observe-the-universe/", "urlToImage": "https://africanews.space/wp-content/uploads/2022/06/MeerKAT-dish.jpg", "publishedAt": "2022-06-21T10:03:32Z", "content": "An international team of astronomers has combined the power of 64 radio telescope dishes to detect the faint signatures of neutral hydrogen gas across cosmological scales. The South African-based Mee… [+2576 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Waiyee Yip", "title": "Elon Musk's transgender daughter seeks name change, doesn't wish to be related 'in any way, shape or form' - Business Insider South Africa", "description": "According to legal documents filed by Xavier Musk in a California court, the other reason stated for the name change was \"gender identity,\" per TMZ.", "url": "https://www.businessinsider.co.za/elon-musk-trans-daughter-name-change-cut-ties-2022-6", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3390/d9bd0c6b59054987a7db1159a68ade9a.jpg", "publishedAt": "2022-06-21T05:56:34Z", "content": "Elon Musk's transgender daughter has applied to legally change her name as she no longer wants to be associated with her father. \r\nPer Reuters, Xavier Musk said she no longer wished to be \"related to… [+1659 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "Art Master Africa Kicks Off in its Fifth Edition - THISDAY Newspapers", "description": "Ugo Aliogo BIC has announced today the kick-off of its flagship art competition, Art Master Africa, in its fifth edition. A statement by the organization said the competition invites talent across …", "url": "https://www.thisdaylive.com/index.php/2022/06/21/art-master-africa-kicks-off-in-its-fifth-edition/", "urlToImage": "https://s0.wp.com/i/blank.jpg", "publishedAt": "2022-06-21T00:00:00Z", "content": "Ugo Aliogo\r\nBIC has announced today the kick-off of its flagship art competition, Art Master Africa, in its fifth edition.\r\nA statement by the organization said the competition invites talent across … [+2844 chars]"}]}