{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": null, "name": "The Edge Markets MY"}, "author": null, "title": "BNM joins forces with Australian, Singapore, South African central banks to test central bank digital currencies - The Edge Markets MY", "description": "KUALA LUMPUR (Sept 2): Bank Negara Malaysia (BNM) said it will be joining forces with the Bank for International Settlements (BIS) Innovation Hub, Reserve Bank of Australia (RBA), Monetary Authority of Singapore (MAS) and South African Reserve Bank (SARB) to …", "url": "https://www.theedgemarkets.com/article/bnm-joins-forces-australian-singapore-south-african-central-banks-test-central-bank-digital", "urlToImage": "https://assets.theedgemarkets.com/BNM Bank Negara Zahid Izzani _20210702155750_theedgemarkets_4.jpg?GTqkemsSFbcSuukCeDGS44HjVd0.zKZE", "publishedAt": "2021-09-02T05:54:57Z", "content": "KUALA LUMPUR (Sept 2): Bank Negara Malaysia (BNM) said it will be joining forces with the Bank for International Settlements (BIS) Innovation Hub, Reserve Bank of Australia (RBA), Monetary Authority … [+2504 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Chanyaporn Chanjaroen", "title": "SA to feature in global experiment on the use of digital currencies - News24", "description": "The Bank for International Settlements will test the use of central bank digital currencies with Australia, Malaysia, Singapore and South Africa in an experiment that could lead to a more efficient global payments platform.", "url": "https://www.news24.com/fin24/economy/sa-reserve-bank-digital-currency-to-be-tested-in-global-experiment-20210902", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/5247/e5793cff988e4784977e96ed85e33ce9.jpg", "publishedAt": "2021-09-02T05:38:37Z", "content": "The Bank for International Settlements will test the use of central bank digital currencies with Australia, Malaysia, Singapore and South Africa in an experiment that could lead to a more efficient g… [+1977 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Need To Panic Over C.1.2 Strain Found In South Africa, Says Virologist - NDTV", "description": "Scientists in South Africa have discovered a new viral variant of SARS-CoV-2, the virus that causes COVID-19.", "url": "https://www.ndtv.com/world-news/covid-19-news-will-new-c-1-2-variant-be-more-infectious-virologist-tackles-faqs-2527034", "urlToImage": "https://c.ndtvimg.com/2021-06/3edhl1f4_coronavirus-generic_625x300_17_June_21.jpg", "publishedAt": "2021-09-02T05:37:19Z", "content": "C.1.2 is distinct from but on a genetic branch near the Lambda variant. (Representational image)\r\nScientists in South Africa have discovered a new viral variant of SARS-CoV-2, the virus that causes C… [+4736 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Kyle Cowan", "title": "Covid-19: Top scientist warns of SA's complacency as excess deaths near 250 000 - News24", "description": "In the past 16 months, an estimated 250 000 people have died from natural causes in South Africa and evidence continues to mount that these deaths are linked to Covid-19. But a top scientist is growing concerned that we are not taking the impact of the virus …", "url": "https://www.news24.com/news24/southafrica/investigations/covid-19-top-scientist-warns-of-sas-complacency-as-excess-deaths-near-250-000-20210902", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/9523/3aa1d9f87c224fb68ddb6a21d10aab47.jpg", "publishedAt": "2021-09-02T05:10:06Z", "content": "<ul><li>Excess deaths, a key measure used to track the impact of epidemics or even wars, are nearing 250 000 in South Africa.</li><li>Researchers believe the majority of these deaths are linked to Co… [+6103 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Candice Sehoma", "title": "OPINION | Old habits die hard: J&J's failure to deliver Covid-19 jabs to SA is more of the same - News24", "description": "South Africa is still awaiting millions of vaccines from Johnson & Johnson, even though the country contributed to the company's Covid-19 research through the Ensemble and Sisonke studies.", "url": "https://www.news24.com/news24/columnists/guestcolumn/old-habits-die-hard-jjs-failure-to-deliver-covid-19-jabs-to-sa-is-more-of-the-same-20210902", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/4234/e6079874d7a04a82aa7e88330f46312d.jpg", "publishedAt": "2021-09-02T04:24:54Z", "content": "<ul><li>South Africa will only have received about a quarter of its Johnson &amp; Johnson vaccine supply by the end of September.</li><li>The company has been delaying dose deliveries to Africa and i… [+6829 chars]"}, {"source": {"id": null, "name": "Tech Times"}, "author": "RJ Pierce", "title": "Epilepsy Treatment Research Gains Hope After Discovery of West African Fruit's Promising Potential - Tech Times", "description": "Researchers from Nigeria have discovered potential epilepsy treatment properties from the extract of a fruit that is endemic to West Africa.", "url": "https://www.techtimes.com/articles/264872/20210901/epilepsy-treatment-west-african-fruit.htm", "urlToImage": "https://1734811051.rsc.cdn77.org/data/images/full/391765/epilepsy-art.jpg", "publishedAt": "2021-09-01T20:58:55Z", "content": "Epilepsy treatments have manifested in many ways, from specially formulated AEDs to long-term therapies that help patients improve their overall well-being. But perhaps this recent discovery may help… [+3181 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Tony Carnie", "title": "OUR BURNING PLANET: Going nuclear: Mantashe's big push to build South Africa's second nuke power station under fire - Daily Maverick", "description": "The microphones at a two-day government ‘public consultation’ session had barely been switched off last week when Gwede Mantashe’s Department of Mineral Resources and Energy dashed out a media statement trumpeting plans for South Africa’s second nuclear power…", "url": "https://www.dailymaverick.co.za/article/2021-09-01-going-nuclear-mantashes-big-push-to-build-south-africas-second-nuke-power-station-under-fire/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/08/TonyC-Nukesdecision-1000x500.jpg", "publishedAt": "2021-09-01T20:52:06Z", "content": "From left: Ukraines Chernobyl nuclear power plants fourth reactor, destroyed in the 26 April 1986 explosion. (Photo: Yuri Kozyrev / Newsmakers) | The Koeberg nuclear power station near Melkbos, Cape … [+11549 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Tammy Petersen", "title": "Judge Desai hits back at Zionist Federation complaint as part of 'pro-Israel activities' - News24", "description": "Retired Western Cape High Court Judge and current Legal Services Ombud Siraj Desai has labelled a complaint lodged against him by the South African Zionist Federation over his pro-Palestine activities as an unfair “scatter-shot approach”, an attempt to discre…", "url": "https://www.news24.com/news24/southafrica/news/judge-desai-hits-back-at-zionist-federation-complaint-as-part-of-pro-israel-activities-20210901", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/9622/e746eb0ad2ff4fbdba965d503a1e9aa5.jpg", "publishedAt": "2021-09-01T17:41:11Z", "content": "<ul><li>Retired Judge and Legal Services Ombud Siraj Desai says the complaint lodged against him by the SA Zionist Federation has the \"express aim of furthering [its] pro-Israel goals and political o… [+8175 chars]"}, {"source": {"id": null, "name": "Channels Television"}, "author": null, "title": "Egypt Plans To Make One Billion Doses Of Sinovac Vaccine In A Year - Channels Television", "description": "Egypt said Wednesday it plans to manufacture one billion doses a year of China’s Sinovac vaccine, claiming it would become the Middle East and Africa’s “biggest vaccine producer”. Under the deal with the Chinese pharmaceutical company, a factory in Cairo will…", "url": "https://www.channelstv.com/2021/09/01/egypt-plans-to-make-one-billion-sinovac-vaccines-in-a-year/", "urlToImage": "https://www.channelstv.com/wp-content/uploads/2021/09/Egypt-Sinocav-vaccine.jpg", "publishedAt": "2021-09-01T17:20:37Z", "content": "Egypt said Wednesday it plans to manufacture one billion doses a year of China’s Sinovac vaccine, claiming it would become the Middle East and Africa’s “biggest vaccine producer”.\r\nUnder the deal wit… [+1102 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Prof. Wolfgang Preiser", "title": "South African health experts have identified a new lineage of SARS-CoV-2 - Medical Xpress", "description": "As a team of South African researchers we have identified a new lineage of SARS-CoV-2, the virus causing COVID-19. A lineage represents a genetically distinct virus population with a common ancestor. This virus may be designated as a variant in future, based …", "url": "https://medicalxpress.com/news/2021-09-south-african-health-experts-lineage.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/south-african-health-e.jpg", "publishedAt": "2021-09-01T12:18:34Z", "content": "by Prof. Wolfgang Preiser, Cathrine Scheepers, Jinal Bhiman, Marietjie Venter, Penny Moore, Tulio de Oliveira, The ConversationAs a team of South African researchers we have identified a new lineage … [+8457 chars]"}, {"source": {"id": null, "name": "Techpoint.ng"}, "author": "Brand Press", "title": "ASUS ZenBook 13 OLED (UX325) - Affordable OLED Display Ultrabook • Techpoint Africa - Techpoint Africa", "description": "As the name could have suggested, the main highlight for this ZenBook series is its OLED screen. Asus has nailed what should define an ultrabook in 2021 with the ZenBook 13 OLED (UX325). It is very r", "url": "https://techpoint.africa/2021/09/01/asus-zenbook-13-oled-ux325-affordable-oled-display-ultrabook/", "urlToImage": "https://techpoint.africa/wp-content/uploads/2021/09/b.png", "publishedAt": "2021-09-01T11:39:52Z", "content": "As the name could have suggested, the main highlight for this ZenBook series is its OLED screen. Asus has nailed what should define an ultrabook in 2021 with the ZenBook 13 OLED (UX325). It is very r… [+5491 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Government withdraws controversial social security green paper; the WHO has its eyes on a new Covid variant from Colombia; the City of Joburg has extended its debt relief programme; and heads are expected to roll at the Department of Health over the Digital V…", "url": "https://businesstech.co.za/news/government/517410/5-important-things-happening-in-south-africa-today-1114/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Lindiwe-Daphne-Zulu-South-African-Minister-of-Social-Development-2.jpg", "publishedAt": "2021-09-01T06:09:30Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 7,086 new cases of Covid-19, taking the total reported to 2,777,659. Deaths have reached 8… [+3226 chars]"}, {"source": {"id": null, "name": "Samsung.com"}, "author": null, "title": "[Interview] Exploring Infinite Possibilities for Lifestyle TVs – Samsung Newsroom South Africa - Samsung Newsroom South Africa", "description": "JOHANNESBURG, South Africa – 31 July 2021 – The characteristics of TVs are continuing to evolve in line with the latest trends and lifestyle patterns. Against", "url": "https://news.samsung.com/za/interview-exploring-infinite-possibilities-for-lifestyle-tvs", "urlToImage": "https://img.global.news.samsung.com/za/wp-content/uploads/2021/09/the-lifestyle-TV-product-planners.jpg", "publishedAt": "2021-09-01T05:41:17Z", "content": "JOHANNESBURG, South Africa 31 July 2021 The characteristics of TVs are continuing to evolve in line with the latest trends and lifestyle patterns. Against this backdrop, the role of the television ha… [+5205 chars]"}, {"source": {"id": null, "name": "The BMJ"}, "author": null, "title": "Malaria: Combining vaccine with prophylaxis cuts child deaths by 73%, study finds - The BMJ", "description": "Hundreds of thousands of children’s lives could be saved each year in Africa by combining the world’s first effective malaria vaccine with the current recommended approach of giving children prophylactic antimalarials for four months each year, a large study …", "url": "https://www.bmj.com/content/374/bmj.n2137", "urlToImage": "", "publishedAt": "2021-08-31T14:04:26Z", "content": "Hundreds of thousands of childrens lives could be saved each year in Africa by combining the worlds first effective malaria vaccine with the current recommended approach of giving children prophylact… [+552 chars]"}]}