{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Highly infectious Delta Covid variant is ripping through South Africa: health department - BusinessTech", "description": "Acting health minister Mmamoloko Kubayi-Ngubane has confirmed that the highly infectious Delta variant of Covid-19 is likely behind the current surge in new cases in South Africa, with new data showing that the variant is rapidly becoming the dominant one in …", "url": "https://businesstech.co.za/news/government/501397/highly-infectious-delta-covid-variant-is-ripping-through-south-africa-health-department/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Mmamoloko-Tryphosa-Kubayi-Ngubane-South-African-Minister-of-Tourism-.jpg", "publishedAt": "2021-06-26T11:57:41Z", "content": "Acting health minister Mmamoloko Kubayi-Ngubane has confirmed that the highly infectious Delta variant of Covid-19 is likely behind the current surge in new cases in South Africa, with new data showi… [+4045 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "Stefan Mack", "title": "Siya Flexes His Luxury Whip and South Africa Agrees That It Is a Nice Car ▷ South Africa news - Briefly ", "description": "Siya Kolisi says his car is so comfortable it feels like he's driving in the clouds without any turbulence and South Africans agreed that he has a nice car.", "url": "https://briefly.co.za/103135-siya-flexes-luxury-whip-south-africa-agrees-a-nice-car.html", "urlToImage": "https://netstorage-briefly.akamaized.net/images/387b474beb213d0a.png", "publishedAt": "2021-06-26T11:24:36Z", "content": "<ul><li>Springbok captain Siya Kolisi took to social media to flex his luxury Mercedes Benz S 560 and remarked that it was a very nice car</li><li>Social media users agreed with Kolisi and praised hi… [+3018 chars]"}, {"source": {"id": null, "name": "Briefly.co.za"}, "author": "Naomi Kobbie", "title": "Proud Man Shares Cool Then & Now Snaps of His Crib, Mzansi Impressed ▷ South Africa news - Briefly ", "description": "A man has headed online to share a few snaps of his stylish new pad. The stunning photos instantly went viral online & definitely left a few jaws wide open.", "url": "https://briefly.co.za/103122-proud-man-shares-then-now-snaps-his-crib-mzansi-impressed.html", "urlToImage": "https://netstorage-briefly.akamaized.net/images/4144042fe6f0b9d0.png", "publishedAt": "2021-06-26T05:55:23Z", "content": "<ul><li> A young man who certainly started from humble beginnings has dazzled social media with pictures of his newly re-furbished place</li><li> The new bachelor pad looks as elegant as ever with it… [+4168 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "COVID-19: China will always appreciate Africa's support, envoy declares - Guardian", "description": "The Consul General of the People’s Republic of China in Lagos, Chu Maoming, has declared that his country would never forget the support it received from African countries, including Nigeria, during the peak of the Coronavirus (COVID-19) pandemic.", "url": "https://guardian.ng/news/covid-19-china-will-always-appreciate-africas-support-envoy-declares/", "urlToImage": "https://guardian.ng/wp-content/uploads/2020/01/Maoming.jpg2_.jpg", "publishedAt": "2021-06-26T04:04:00Z", "content": "[FILES] Consul General of the Peoples Republic of ChinChu Maoming\r\nThe Consul General of the Peoples Republic of China in Lagos, Chu Maoming, has declared that his country would never forget the supp… [+8241 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lynsey Chutel", "title": "SADC troops a sign of progress in Mozambique conflict, but who will pay for it, ask experts - News24", "description": "This week, the Southern African Development Community has endorsed sending troops to Mozambique, but the actual deployment may be way off as leaders grapple with who will pay for it and who will command the force.", "url": "https://www.news24.com/news24/africa/news/sadc-troops-a-sign-of-progress-in-mozambique-conflict-but-who-will-pay-for-it-ask-experts-20210625", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1102/a66560c207644f0db63c2c5e7844ab67.jpg", "publishedAt": "2021-06-26T03:52:30Z", "content": "The Southern African Development Community's (SADC) endorsement of troops for Mozambique's restive Cabo Delgado province was welcomed as progress in the nearly three-year conflict. But deploying the … [+516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Ex-Police Officer Sentenced To Over 22 Years For George Floyd Murder - NDTV", "description": "Former policeman Derek Chauvin was sentenced to 22 and a half years in jail Friday for murdering African American George Floyd, a killing that sparked America's biggest demonstrations for racial justice in decades.", "url": "https://www.ndtv.com/world-news/us-ex-police-officer-sentenced-to-22-5-years-for-george-floyd-murder-2472684", "urlToImage": "https://c.ndtvimg.com/2021-06/nqdregm_former-policeman-derek-chauvin-afp_625x300_26_June_21.jpg", "publishedAt": "2021-06-25T20:46:43Z", "content": "US Ex-Police Officer as he heard his sentence in the Hennepin County Government Center in Minneapolis\r\nMinneapolis, United States: Former policeman Derek Chauvin was sentenced to 22 and a half years … [+5117 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Africrypt brothers deny involvement in Bitcoin 'heist' - BBC News", "description": "Investors accuse South African firm of absconding with Bitcoin valued at billions of dollars.", "url": "https://www.bbc.com/news/technology-57582805", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/16B78/production/_119084039_gettyimages-1305523759.jpg", "publishedAt": "2021-06-25T16:46:18Z", "content": "By Chris VallanceTechnology Reporter\r\nimage copyrightGetty Images\r\nA lawyer for two brothers who founded a South African Bitcoin investment firm has told the BBC they categorically deny any involveme… [+3613 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "Video shows concrete raining down inside an apartment at the Florida condo moments before collapse - Business Insider South Africa", "description": "A large section of Champlain Towers South in Miami collapsed early Thursday morning. At least one person is dead, and dozens more are missing.", "url": "https://www.insider.com/video-florida-condo-collapse-concrete-falling-inside-apartment-2021-6", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11196/bfb676878b7b4609b9110b02485b6632.jpg", "publishedAt": "2021-06-25T09:43:40Z", "content": "Footage from inside a Florida apartment shows concrete falling from the ceiling moments before the building partially collapsed.\r\nA large section of Champlain Towers South in Miami collapsed at aroun… [+599 chars]"}]}