{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Leadership.ng"}, "author": "Abiodun Sivowaku", "title": "HMD Global, TD Africa Collaborate As Nokia T20 Hits Market - LEADERSHIP NEWS", "description": "HMD Global and TD Africa have collaborated to unveil the first ever tablet in the Nokia mobile stable – the Nokia T20- into the Nigerian market. The device which offers users a suite of cutting-edge functionalities, the device was formally launched in the Nig…", "url": "https://leadership.ng/hmd-global-td-africa-collaborate-as-nokia-t20-hits-market/", "urlToImage": "https://leadership.ng/wp-content/uploads/2021/03/nokia-logo.jpg", "publishedAt": "2021-11-07T06:25:23Z", "content": "HMD Global and TD Africa have collaborated to unveil the first ever tablet in the Nokia mobile stable the Nokia T20- into the Nigerian market.\r\nThe device which offers users a suite of cutting-edge f… [+1626 chars]"}, {"source": {"id": null, "name": "The Manila Times"}, "author": "Agence France-Presse", "title": "Organic farmers find fertile ground in North Africa - The Manila Times", "description": "TUNIS: Proudly displaying her freshly picked pomegranates, Tunisian farmer Sarah Shili says going organic is 'the future of farming' — and as demand surges in North Africa and...", "url": "https://www.manilatimes.net/2021/11/07/news/organic-farmers-find-fertile-ground-in-north-africa/1821287", "urlToImage": "https://www.manilatimes.net/manilatimes/uploads/images/2021/11/07/24978.jpg", "publishedAt": "2021-11-07T05:08:20Z", "content": "TUNIS: Proudly displaying her freshly picked pomegranates, Tunisian farmer Sarah Shili says going organic is \"the future of farming\" and as demand surges in North Africa and beyond, the sector is blo… [+4389 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Cricketnext Staff", "title": "T20 World Cup: Jason Roy Breaks Into Tears After Getting Injured During South Africa Clash - WATCH - News18", "description": "The incident happened off the first ball of the fifth over when Jos Buttler called through for a single. Roy took off from the non-striker's end and picked up the injury midway.", "url": "https://www.news18.com/cricketnext/news/t20-world-cup-jason-roy-breaks-into-tears-after-getting-injured-during-south-africa-clash-watch-4413614.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/untitled-design-4-5-163625492116x9.jpg", "publishedAt": "2021-11-07T02:54:47Z", "content": "England dealt with a major blow on Saturday as opener Jason Roy suffered a calf injury during the chase of 190 against South Africa in Sharjah. The injury seemed serious as the English could barely w… [+1696 chars]"}, {"source": {"id": null, "name": "Newshub"}, "author": null, "title": "'Disgusting', 'outrageous' pitch invader ruins try-scoring chance for Wales against South Africa - Newshub", "description": "The fans in Cardiff made their feelings known as they tossed beer on the pitch invader.", "url": "https://www.newshub.co.nz/home/sport/2021/11/disgusting-outrageous-pitch-invader-ruins-try-scoring-chance-for-wales-against-south-africa.html", "urlToImage": "https://www.newshub.co.nz/home/sport/2021/11/disgusting-outrageous-pitch-invader-ruins-try-scoring-chance-for-wales-against-south-africa/_jcr_content/par/video/image.dynimg.1280.q75.jpg/v1636245586666/GettyImages-1351714397%2B%25281%2529.jpg", "publishedAt": "2021-11-07T00:39:31Z", "content": "It's the second time in two weeks the Principality Stadium has seen a pitch invader get onto the field after 'Jarvo' lined up with the All Blacks for the New Zealand national anthem. \r\nWales legends … [+577 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lynn Butler", "title": "Mark Boucher laments Proteas' T20 World Cup exit as a 'bitter pill to swallow' - News24", "description": "Proteas coach Mark Boucher says it is a \"bitter pill to swallow\" after South Africa beat England but were knocked out of the T20 World Cup.", "url": "https://www.news24.com/sport/cricket/t20worldcup/mark-boucher-laments-proteas-t20-world-cup-exit-as-a-bitter-pill-to-swallow-20211106", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10550/9b947ff429c944c5be78e7ec0fe9cd15.jpg", "publishedAt": "2021-11-06T20:06:19Z", "content": "<ul><li>Proteas coach Mark Boucher says it is a \"bitter pill to swallow\" after SA defeated England, but were knocked out of the T20 World Cup.</li><li>Boucher admitted that restricting England to 131… [+3840 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "Videos show chaos at Travis Scott's concert before a 'mass casualty event' that left 8 dead - Business Insider South Africa", "description": "Videos show a stampede of fans breaking through a fence and dancing on ambulances at the music festival in Houston, Texas.", "url": "https://www.insider.com/watch-videos-show-chaos-at-travis-scotts-astroworld-houston-concert-2021-11", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/2992/d644f3fedb0442cdab3d38640e0e0eb0.jpg", "publishedAt": "2021-11-06T13:48:21Z", "content": "At least eight people died and many more were injured when chaos broke out at Travis Scott's Astroworld music festival in Houston, Texas, on Friday night, authorities said.\r\nVideo footage of the fest… [+1686 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Mysterious patches of glass scattered across Chilean desert likely products of ancient exploding comet - Business Insider South Africa", "description": "Heat from a comet explosion likely melted and fused soil in the Chilean desert, transforming it into massive patches of glass.", "url": "https://www.businessinsider.com/glass-patches-chile-desert-comet-explosion-2021-11", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11759/3cc01b9e643647e09dc794c064d3202b.jpg", "publishedAt": "2021-11-06T08:24:02Z", "content": "At first glance, the Atacama Desert in northern Chile looks like a forgotten wasteland. It's one of the driest places on Earth, with a climate so arid that few animal species can survive. Humans are … [+4133 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Fashola, Fayemi to Mobilise N10 Billion to Boost Medical Research Development - AllAfrica.com", "description": "The Minister of Works and Housing, Babatunde Fashola who also doubles as the Chairman, Board of Trustees, Nigerian Institute of Medical Research (NIMR) Foundation, has announced plan to mobilise N10 billion to support medical research initiatives.", "url": "https://allafrica.com/stories/202111050390.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-11-05T10:00:36Z", "content": "The Minister of Works and Housing, Babatunde Fashola who also doubles as the Chairman, Board of Trustees, Nigerian Institute of Medical Research (NIMR) Foundation, has announced plan to mobilise N10 … [+5836 chars]"}]}