{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "South Africa’s mobile networks have bid over R8 billion in spectrum auction - MyBroadband", "description": "Icasa has announced that its spectrum auction is not over, and that mobile network operators have bid already over R8 billion to secure precious cellular network capacity.", "url": "https://mybroadband.co.za/news/telecoms/437148-south-africas-mobile-networks-have-bid-over-r8-billion-in-spectrum-auction.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/03/Keabetswe-Modimoeng-ICASA-chairperson.jpg", "publishedAt": "2022-03-11T17:52:31Z", "content": "The Independent Communications Authority of South Africa (Icasa) has announced that South Africas mobile network operators have already bid R8 billion in its radio frequency spectrum auction.\r\nIcasa … [+2472 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jason Felix", "title": "Be careful of what Russia tells you - Ukrainian ambassador to South Africa - News24", "description": "Ukraine's ambassador to South Africa, Liubov Abravitova, was speaking at the Cape Town Press Club on Friday, where she delved into South Africa's stance on Russia's invasion of Ukraine.", "url": "https://www.news24.com/news24/southafrica/news/be-careful-of-what-russia-tells-you-ukrainian-ambassador-to-south-africa-20220311", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1235/e9f9cfdb3d7a4dd3a7805aaffc2b205e.jpg", "publishedAt": "2022-03-11T15:28:30Z", "content": "<ul><li>Ukraine's ambassador to South Africa says, since Russia's invasion, the situation has worsened.</li><li>Ambassador Liubov Abravitova has warned of \"massive problems\" if Russia is not stopped.… [+3783 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Juniour Khumalo", "title": "SA turns to Mozambique's vast natural gas reserves as Eskom battles to keep the lights on - News24", "description": "President Cyril Ramaphosa has announced that South Africa will seek to bolster its energy security by tapping into neighbouring Mozambique's vast natural gas reserves.", "url": "https://www.news24.com/news24/southafrica/news/sa-turns-to-mozambiques-vast-natural-gas-reserves-as-eskom-battles-to-keep-the-lights-on-20220311", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1173/1e7de42b9bcf4f5f8e8ea5e5ee07696f.jpg", "publishedAt": "2022-03-11T13:12:54Z", "content": "<ul><li>South Africa will attempt to bolster its energy security by tapping into neighbouring Mozambique's vast natural gas reserves.</li><li>President Cyril Ramaphosa made the announcement on Friday… [+3729 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "Ramaphosa says South Africa has been approached for a ‘mediation’ role in the Russia-Ukraine crisis; Eskom says its system is slowly getting back online, but stage 2 sticks until Monday; Treasury raises eyebrows with ‘no more tenders’ advisory; and reaction t…", "url": "https://businesstech.co.za/news/government/567098/5-important-things-happening-in-south-africa-today-1238/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/Putin.jpg", "publishedAt": "2022-03-11T06:26:06Z", "content": "Here’s what is happening in and affecting South Africa today:\r\nCoronavirus: In South Africa, there have been 25 new Covid-19 deaths, taking the total reported to 99,681. The country has 18,852 active… [+3050 chars]"}]}