{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa has introduced stricter rules for crypto traders – and it’s causing headaches - BusinessTech", "description": "Crypto assets continue to be a concern for government and regulators around the world as their novelty, diversity and accessibility opened them up to scrutiny from fiscal authorities, while their volatility opened investors up to susceptibility.", "url": "https://businesstech.co.za/news/banking/532148/south-africa-has-introduced-stricter-rules-for-crypto-traders-and-its-causing-headaches/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/Bitcoin-crypto.png", "publishedAt": "2021-10-31T13:00:08Z", "content": "Crypto assets continue to be a concern for government and regulators around the world as their novelty, diversity and accessibility opened them up to scrutiny from fiscal authorities, while their vol… [+5499 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "South Africa to get a new space-junk tracking facility – part-owned by Russia - Business Insider South Africa", "description": "The South African National Space Agency (Sansa) and Russian space agency Roscosmos announced a new space-debris tracking antenna to be based at Sansa's Hartebeeshoek facility in the North West province.", "url": "https://www.businessinsider.co.za/south-africa-to-get-a-new-space-junk-tracking-facility-part-owned-by-russia-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11735/32d040bddd5a4f5a89ed95632c6217c0.jpg", "publishedAt": "2021-10-31T03:26:41Z", "content": "<ul><li>A new space-junk detection facility will be based at Hartebeeshoek in the North West province.</li><li>As humanity launches more satellites and spacecraft into space, the debris left behind i… [+2940 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": null, "title": "A Chinese man made bank staff count R12 million by hand because guards were rude to him - Business Insider South Africa", "description": "The man said he had received the \"worst customer service.\" The bank said the man got angry after a guard asked him to wear a face mask.", "url": "https://www.insider.com/china-millionaire-withdraws-savings-asks-bank-staff-count-notes-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/9280/65214044c00e4c368a51d902c60d9932.jpg", "publishedAt": "2021-10-30T11:19:50Z", "content": "A Chinese millionaire said he withdrew his savings and ordered the staff at a Shanghai bank to count his cash by hand after getting into a disagreement with security guards.\r\nThe man, known only as \"… [+1582 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Tyler Sonnemaker", "title": "The creator of the term 'metaverse' wants people to know he has 'nothing to do' with Facebook's Meta plans - Business Insider South Africa", "description": "Author Neal Stephenson coined the term \"metaverse\" in his book \"Snow Crash,\" but said he isn't advising Facebook on its plans for a virtual world.", "url": "https://www.businessinsider.com/metaverse-term-creator-neal-stephenson-distances-himself-from-facebook-zuckerberg-2021-10", "urlToImage": "https://i.insider.com/617c92d41037b1001815124c?width=1200&format=jpeg", "publishedAt": "2021-10-30T10:17:07Z", "content": "Facebook changed its name to Meta this week amid a wave of scandals, hoping to distract people with its massive investment in a virtual world that CEO Mark Zuckerberg called a \"metaverse.\"\r\nThat's ca… [+1779 chars]"}, {"source": {"id": null, "name": "Sanews.gov.za"}, "author": null, "title": "SAHPRA approves protocol for J&J vaccine booster trial for health workers - Lowvelder", "description": "The South African Health Products Regulatory Authority (SAHPRA) and Johnson & Johnson (J&J) on Friday approved vaccine booster doses for all healthcare workers who received the first shot as part of the Sisonke Study.", "url": "https://www.sanews.gov.za/south-africa/sahpra-approves-protocol-jj-vaccine-booster-trial-health-workers", "urlToImage": "https://www.sanews.gov.za/sites/default/files/2012/images/newsstorytemplate/202110/jjvaccinesnipped.jpg", "publishedAt": "2021-10-30T06:23:58Z", "content": "The South African Health Products Regulatory Authority (SAHPRA) and Johnson &amp; Johnson (J&amp;J) on Friday approved vaccine booster doses for all healthcare workers who received the first shot as … [+3532 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "The squeeze: 3 biggest parties' big guns in final push for votes - News24", "description": "\"The squeeze\" – this is what politicos call the final days of an election campaign, and on Friday, South Africa's three biggest party's leaders were out to squeeze the electorate for votes ahead of Monday's municipal election.", "url": "https://www.news24.com/news24/southafrica/news/the-squeeze-3-biggest-parties-big-guns-in-final-push-for-votes-20211030", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1996/309f2316adb844208339ba785ea840f7.jpg", "publishedAt": "2021-10-30T03:15:03Z", "content": "\"The squeeze\" - this is what politicos call the final days of an election campaign, and on Friday, South Africa's three biggest party's leaders were out to squeeze the electorate for votes ahead of M… [+227 chars]"}]}