{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "How much money you would have if you invested R1,000 in South African tech companies in 2022 - MyBroadband", "description": "Here is how much more or less money you would have had by the end of 2022 if you bought shares in one of the South African technology companies listed on the JSE at the start of that year.", "url": "https://mybroadband.co.za/news/business/475955-how-much-money-you-would-have-if-you-invested-r1000-in-south-african-tech-companies-in-2022.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2021/05/Naspers.jpg", "publishedAt": "2023-01-19T05:57:27Z", "content": "Many investors who bought shares in South African technology companies at the start of 2022 would have lost money by the end of the year.\r\nGlobally, the technology industry has been among the worst h… [+5166 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "AfCFTA: Private sector moves to resolve tariff, rule of origin, payment platform - Guardian Nigeria", "description": "Members of the private sector in Africa have called for the completion of negotiations on schedule of tariff offers, finalisation of work on Rules of Origin, full operationalisation of the Pan African Payment Platform and the speedy resolution of all outstand…", "url": "https://guardian.ng/business-services/afcfta-private-sector-moves-to-resolve-tariff-rule-of-origin-payment-platform/", "urlToImage": "https://guardian.ng/wp-content/uploads/2020/06/AfCFTA-1.jpg", "publishedAt": "2023-01-19T03:55:00Z", "content": "Members of the private sector in Africa have called for the completion of negotiations on schedule of tariff offers, finalisation of work on Rules of Origin, full operationalisation of the Pan Africa… [+3434 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mariam Isa and Chris Yelland", "title": "ENERGY EMERGENCY OP-ED: Hand-to-Mouth: South Africa's power lifeline frays as Eskom scrambles for diesel - Daily Maverick", "description": "Eskom is struggling in its efforts to obtain the diesel needed to continue running its open-cycle gas turbines which, in the face of prolonged power generation outages, is the only way the utility can stave off severe and ongoing curtailment of South Africa’s…", "url": "https://www.dailymaverick.co.za/article/2023-01-18-hand-to-mouth-south-africas-power-lifeline-frays-as-eskom-scrambles-for-diesel/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2023/01/IsaYelland-SA-power-lifeline-frays-2.jpg?w=1280", "publishedAt": "2023-01-18T21:57:19Z", "content": "In the past two years, Eskom has been forced to rely increasingly on the open-cycle gas turbines (OCGTs) which were intended only for dire emergencies or use during peak demand periods because of a s… [+8278 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Estelle Ellis", "title": "Measles cases drop in S Africa, but reopening schools a... - Daily Maverick", "description": "Between October and December 2022, measles outbreaks were declared in five provinces, but on Wednesday, the National Institute for Communicable Diseases said it was seeing a decrease in cases for a third consecutive week. However, concerns remain about whethe…", "url": "https://www.dailymaverick.co.za/article/2023-01-18-measles-cases-drop-in-s-africa-but-reopening-schools-a-concern/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2023/01/MC-Measles-Outbreak4.jpg?w=1280", "publishedAt": "2023-01-18T18:33:45Z", "content": "Since October 2022, measles outbreaks have been declared in Limpopo (145 cases), Mpumalanga (79), North West (125), Gauteng (18) and the Free State (15), but the National Institute for Communicable D… [+2148 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s energy crisis becoming an everything crisis - BusinessTech", "description": "Water and food supplies under threat, as businesses and households buckle under the pressure of load shedding.", "url": "https://businesstech.co.za/news/business/657403/south-africas-energy-crisis-becoming-an-everything-crisis/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/Cyril-Ramaphosa-08.png", "publishedAt": "2023-01-18T12:18:06Z", "content": "The most severe power cuts ever experienced in South Africa are threatening food and water supplies and disrupting the lives of millions of people, including chicken farmers.\r\nIn the poultry industry… [+4686 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sean Christie", "title": "A mezuzah, a Christmas wreath and rooibos with milk: Get to know this NICD couple at home - News24", "description": "Anne von Gottberg and Cheryl Cohen are two of South Africa’s foremost scientists. We’ve got them and their colleagues to thank for the country’s world class surveillance of SARS-CoV-2. Bhekisisa's Sean Christie visited them at their Parktown home and talked s…", "url": "https://www.news24.com/news24/health/a-mezuzah-a-christmas-wreath-and-rooibos-with-milk-get-to-know-this-nicd-couple-at-home-20230118", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8072/82b24dccea9241508ba96c219602e3a9.jpg", "publishedAt": "2023-01-18T05:14:35Z", "content": "<ul><li>Anne von Gottberg and Cheryl Cohen are two of South Africa’s foremost scientists. We’ve got them and their colleagues to thank for the country’s world class surveillance of SARS-CoV-2.</li><l… [+13049 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How fees at South Africa’s most expensive private schools have changed in the last 10 years - BusinessTech", "description": "This is how much private schools have increased their tuition fees over the past decade, with one increasing by as much as 90%.", "url": "https://businesstech.co.za/news/lifestyle/656507/how-fees-at-south-africas-most-expensive-private-schools-have-changed-in-the-last-10-years/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2023/01/Private-school.jpg", "publishedAt": "2023-01-17T15:10:12Z", "content": "Private schools in South Africa have hiked fees for 2023, with nine out of the top 10 now charging more than R300,000 a year for boarding and tuition.\r\nHistorically, Hilton College has been the most … [+7040 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Tomasz Nowakowski", "title": "SALT discovers new hot white dwarf and pre-white dwarf stars - Phys.org", "description": "Using the Southern African Large Telescope (SALT), an international team of astronomers has discovered eight new very hot white dwarf and pre-white dwarf stars with effective temperatures over 100,000 K. The finding is reported in a paper published in the Mon…", "url": "https://phys.org/news/2023-01-salt-hot-white-dwarf-pre-white.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2023/salt-discovers-new-hot.jpg", "publishedAt": "2023-01-17T15:10:01Z", "content": "Using the Southern African Large Telescope (SALT), an international team of astronomers has discovered eight new very hot white dwarf and pre-white dwarf stars with effective temperatures over 100,00… [+3303 chars]"}, {"source": {"id": null, "name": "Defenceweb.co.za"}, "author": "Kim Helfrich", "title": "Top achievement award for MeerKAT team - defenceWeb", "description": "The Royal Astronomical Society’s (RAS’s) 2023 group achievement award winner is South Africa’s MeerKAT team. In its citation, RAS recognised the MeerKAT team “for a series of spectacular observations in radio astronomy, the highlight being the images of the G…", "url": "https://www.defenceweb.co.za/aerospace/aerospace-aerospace/top-achievement-award-for-meerkat-team/", "urlToImage": "https://www.defenceweb.co.za/wp-content/uploads/joint/science-a-defence-technology/MeerKAT_array.jpg", "publishedAt": "2023-01-17T12:31:02Z", "content": "The Royal Astronomical Societys (RASs) 2023 group achievement award winner is South Africas MeerKAT team.\r\nIn its citation, RAS recognised the MeerKAT team for a series of spectacular observations in… [+1961 chars]"}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Rorisang Moyo", "title": "South Africa Meerkat Radio Telescope Team Receives International Esteemed Award - Space in Africa", "description": "South Africa’s Meerkat Radio Telescope team has been recognised by the Royal Astronomical Society (RAS) for its series of spectacular observations in", "url": "https://africanews.space/south-africa-meerkat-radio-telescope-team-receives-international-esteemed-award/", "urlToImage": "https://africanews.space/wp-content/uploads/2023/01/2018-MeerKAT-1_small-1500x811-1.jpg", "publishedAt": "2023-01-17T11:32:16Z", "content": "South Africas Meerkat Radio Telescope team has been recognised by the Royal Astronomical Society (RAS) for its series of spectacular observations in radio astronomy. Notable works included images of … [+1409 chars]"}]}