{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Claire Mom", "title": "Terror alert: Back your claim with evidence, South African political party tells US - TheCable", "description": "The Economic Freedom Fighters (EFF) has asked the US to provide evidence of its claim of possible terrorist attack in South Africa.", "url": "https://www.thecable.ng/terror-alert-back-your-claim-with-evidence-south-african-political-party-tells-us", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2022/10/Economic-Freedom-Fighters-EFF-in-South-Africa-e1666896131380.jpg", "publishedAt": "2022-10-27T16:55:00Z", "content": "The Economic Freedom Fighters (EFF), a political party in South Africa, has asked the United States to provide evidence of its claim of possible terrorist attack in South Africa.\r\nOn Wednesday, the U… [+2319 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "(WATCH) Evaluating Impact On Africa's Financial Landscape - TVC News Nigeria", "description": "Between 2020 and 2021, the number of tech start-ups in Africa tripled to around 5,200 companies. Just under half of these are fintech, which is making it the...", "url": "https://www.youtube.com/watch?v=UBFOcdNKasY", "urlToImage": "https://i.ytimg.com/vi/UBFOcdNKasY/maxresdefault.jpg", "publishedAt": "2022-10-27T16:04:50Z", "content": null}, {"source": {"id": null, "name": "Space in Africa"}, "author": "Joshua Faleti", "title": "Analysing the Nigerian Commercial Satellite Communications Guidelines - Space in Africa", "description": "An analysis of Nigerian commercial satellite communication guidelines through a section-by-section commentary of its relevant provisions.", "url": "https://africanews.space/analysing-the-nigerian-commercial-satellite-communications-guidelines/", "urlToImage": "https://africanews.space/wp-content/uploads/2022/10/Nigcomsat1R_Xinhua02-636x485-1.jpg", "publishedAt": "2022-10-27T15:26:56Z", "content": "In 2018, the Nigerian Communications Commission (NCC) enacted a series of guidelines concerning Nigeria’s satellite communications market. As a result, this article will offer an expert analysis of t… [+480 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The average take home pay in South Africa right now - BusinessTech", "description": "The average nominal take-home pay reflected a marginal uptick in September 2022 while fewer salaries were paid during the month, suggesting some job losses in the struggling economy, according to the latest data in the BankservAfrica Take-home Pay Index.", "url": "https://businesstech.co.za/news/wealth/638131/the-average-take-home-pay-in-south-africa-right-now-15/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/11/Rand1-scaled-e1606294571290.jpg", "publishedAt": "2022-10-27T06:40:53Z", "content": "The average nominal take-home pay reflected a marginal uptick in September 2022 while fewer salaries were paid during the month, suggesting some job losses in the struggling economy, according to the… [+3151 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Press Release", "title": "#COP27: CJID to launch three research papers, discuss climate change in West Africa - Premium Times", "description": "The maiden summit, themed; “Road to COP 27” is organised by the Centre for Journalism Innovation and Development (CJID), through its Development Programme.", "url": "https://www.premiumtimesng.com/news/top-news/561932-cop27-cjid-to-launch-three-research-papers-discuss-climate-change-in-west-africa.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2022/09/20220906_105043-scaled.jpg", "publishedAt": "2022-10-27T05:57:57Z", "content": "As representatives from countries across the world will be convening in Egypt for the 27th Conference of the Parties, COP27, stakeholders working on Climate Change across the Anglophone countries are… [+3120 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "A look at Heineken’s massive new solar plant in South Africa – with 14,000 panels tracking the movement of the sun - BusinessTech", "description": "Heineken South Africa launched a solar power plant at its Sedibeng, Midvaal brewery in Gauteng on Wednesday (26 October) – moving closer to reducing carbon emissions in all its operations.", "url": "https://businesstech.co.za/news/energy/638279/a-look-at-heinekens-massive-new-solar-plant-in-south-africa-with-14000-panels-tracking-the-movement-of-the-sun/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/10/Heineken-solar.jpg", "publishedAt": "2022-10-27T05:33:20Z", "content": "Heineken South Africa launched a solar power plant at its Sedibeng, Midvaal brewery in Gauteng on Wednesday (26 October) moving closer to reducing carbon emissions in all its operations.\r\nThe solar p… [+1905 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Richard Poplak", "title": "Meet the Highwaymen stealing your democracy - Daily Maverick", "description": "The UK is a mess. AmeriKKKa is scary. Brazil needs a shrink. A new podcast tells the story of South Africa’s democratic meltdown, and places it in the context of a global surge in illiberalism.", "url": "https://www.dailymaverick.co.za/article/2022-10-26-meet-the-highwaymen-stealing-your-democracy/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/10/HWM_2000x1000_v2.jpg?w=1280", "publishedAt": "2022-10-26T21:12:45Z", "content": "Liberal democracy is having a bad century.\r\nDont take my word for it. According to the Carnegie Endowment for International Peace, there were more than 76 major popular uprisings on the planet last y… [+8197 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Second day of Ethiopia-Tigray peace talks in South Africa - News24", "description": "The first formal peace talks between the warring sides in the brutal two-year conflict in Ethiopia's Tigray region went into a second day in South Africa on Wednesday.", "url": "https://www.news24.com/news24/africa/news/second-day-of-ethiopia-peace-talks-in-south-africa-20221026", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2114/aa7d7f039117487d9f8b6a758405f1a1.jpg", "publishedAt": "2022-10-26T17:50:23Z", "content": "<ul><li>The peace talks between Ethiopia and Tigray entered its second day on Wednesday.</li><li>The talks are being held in Pretoria, and media has not been allowed inside the venue.</li><li>They ar… [+4541 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Big fast food price hikes coming for South Africa - BusinessTech", "description": "Quick service and casual dining group Famous Brands says that higher fuel costs and inflationary pressure have led to major price hikes at South Africa’s favourite fast food chains – and the trend is expected to continue.", "url": "https://businesstech.co.za/news/business/637895/big-fast-food-price-hikes-coming-for-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2017/10/Rocomamas-burger.png", "publishedAt": "2022-10-26T06:13:44Z", "content": "Quick service and casual dining group Famous Brands says that higher fuel costs and inflationary pressure have led to major price hikes at South Africa’s favourite fast food chains – and the trend is… [+3182 chars]"}]}