{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Jasprit Bumrah likely to be ruled out of T20 World Cup - The Indian Express", "description": "Bumrah didn’t play the first T20 against South Africa Wednesday and, a day later, flew to the National Cricket Academy in Bengaluru for the back condition to be monitored.", "url": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-ruled-out-of-t20-world-cup-8180399/", "urlToImage": "https://images.indianexpress.com/2022/07/jasprit-bumrah-3.jpg", "publishedAt": "2022-09-30T11:29:31Z", "content": "WITH JUST weeks to go for the T20 World Cup in Australia, Team India suffered a huge setback with ace pacer Jasprit Bumrah rendered doubtful for the tournament after he complained of back pain.Bumrah… [+3159 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "These hospitals are now exempt from load shedding in South Africa - BusinessTech", "description": "The department of health has announced a number of initiatives to assist the healthcare sector through record rolling blackouts, including exempting hospitals from load shedding.", "url": "https://businesstech.co.za/news/government/629979/these-hospitals-are-now-exempt-from-load-shedding-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Joe-Phaahla.png", "publishedAt": "2022-09-30T08:32:31Z", "content": "The department of health has announced a number of initiatives to assist the healthcare sector through record rolling blackouts, including exempting hospitals from load shedding.\r\nThis follows indust… [+3976 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Cronje", "title": "NPA charges McKinsey SA with fraud over Transnet locomotive debacle - News24", "description": "The National Prosecuting Authority has indicted McKinsey South Africa on charges of fraud, theft and corruption related to state capture at Transnet.", "url": "https://www.news24.com/fin24/companies/npa-charges-mckinsey-sa-with-fraud-over-transnet-locomotive-debacle-20220930", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3855/813d1f3cf7064b0fb9aa2409fd1d73e0.jpg", "publishedAt": "2022-09-30T08:15:47Z", "content": "The National Prosecuting Authority (NPA) has indicted McKinsey South Africa on charges of fraud, theft and corruption related to state capture at Transnet. \r\nThe NPA's Investigating Directorate annou… [+1906 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Why Has My Cold Dragged On So Long? and How Do I Know When It's Morphed Into Something More Serious? - AllAfrica - Top Africa News", "description": "Analysis - Common colds are caused by viruses. There are no effective cures, and antibiotics do not work on viruses, so treatment is targeted at managing the symptoms until your immune system has cleared the cold.", "url": "https://allafrica.com/stories/202209300115.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-30T07:22:38Z", "content": "Common colds are caused by viruses. There are no effective cures, and antibiotics do not work on viruses, so treatment is targeted at managing the symptoms until your immune system has cleared the co… [+5300 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Getting Fit After Covid? Why You Should Be Strength Training - and How to Do It - AllAfrica - Top Africa News", "description": "Analysis - After recovering from COVID, you might be eager to get out and do some exercise, particularly if you'd previously enjoyed keeping fit. While a bit of light cardiovascular training can be a good option, strength training has some particular advantag…", "url": "https://allafrica.com/stories/202209300114.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-30T07:22:38Z", "content": "After recovering from COVID, you might be eager to get out and do some exercise, particularly if you'd previously enjoyed keeping fit. While a bit of light cardiovascular training can be a good optio… [+6558 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "How to access Sunbet from South Africa — Technology - Guardian Nigeria", "description": "Many players in South Africa ask the same question: \"How do I log in to my personal account on the official Sunbet website?\". Although there is nothing complicated in this, users still face the same problems every time. Now we will analyze all the subtleties …", "url": "https://editor.guardian.ng/technology/how-to-access-sunbet-from-south-africa/", "urlToImage": "https://guardian.ng/wp-content/uploads/2019/11/computer.jpg", "publishedAt": "2022-09-30T07:00:00Z", "content": "Many players in South Africa ask the same question: “How do I log in to my personal account on the official Sunbet website?”. Although there is nothing complicated in this, users still face the same … [+2786 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 important things happening in South Africa today - BusinessTech", "description": "The CCMA awards Eskom employees another wage increase; Bain has been banned from public contracts in South Africa for a period of 10 years; Ramaphosa denies money laundering claims; and energy minister Gwede Mantashe insists South Africa has enough electricit…", "url": "https://businesstech.co.za/news/business/629915/5-important-things-happening-in-south-africa-today-1376/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Solar-grid-Eskom.jpg", "publishedAt": "2022-09-30T06:00:44Z", "content": "Heres what is happening in and affecting South Africa today:\r\n<ul><li>Wage increase for Eskom: The CCMA awarded Eskom employees a further 1.5% wage increase, backdated to July 2021. These are unionis… [+2337 chars]"}, {"source": {"id": null, "name": "The Africa Report"}, "author": "David Whitehouse", "title": "Shell’s solar acquisition Daystar Power plans pan-African expansion - The Africa Report", "description": "Royal Dutch Shell is buying West African solar power provider Daystar as part of its diversification into renewable energy.", "url": "https://www.theafricareport.com/245282/shells-solar-acquisition-daystar-power-plans-pan-african-expansion/", "urlToImage": "https://www.theafricareport.com/media/2022/09/Daystar-Primlaks-5437-scaled-e1664474176524.jpg", "publishedAt": "2022-09-30T04:16:18Z", "content": "Eastern and southern Africa are attractive markets with huge potential, says Ghana-based Osoka. We can address those markets. The company is aiming to increase its installed solar capacity from a cur… [+490 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber and Karyn Maughan", "title": "Paul Ngobeni, one of Mkhwebane's main legal advisors, not registered to practice law in SA - News24", "description": "\"Fugitive from justice\" Paul Ngobeni has emerged as one of the architects of Public Protector Busisiwe Mkhwebane's legal campaign to challenge the impeachment inquiry, despite being unable to practice law in South Africa.", "url": "https://www.news24.com/news24/politics/parliament/paul-ngobeni-one-of-mkhwebanes-main-legal-advisors-not-registered-to-practice-law-in-sa-20220930", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7147/ef8b25bcf72f48baaff4a4eb77eb7d33.jpeg", "publishedAt": "2022-09-30T03:04:55Z", "content": "\"Fugitive from justice\" Paul Ngobeni has emerged as one of the architects of Public Protector Busisiwe Mkhwebane's legal campaign to challenge the impeachment inquiry, despite being unable to practic… [+491 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Carin Smith", "title": "Licensing council cancels some of SAA's unused flight frequencies - News24", "description": "The International Air Services Council has cancelled some flight frequencies of South African Airways, because they have not been used.", "url": "https://www.news24.com/fin24/companies/licensing-council-cancels-some-of-saas-unused-flight-frequencies-20220929-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7215/3b21473a9181466bbe64d7a831a0bf0b.jpg", "publishedAt": "2022-09-29T15:57:15Z", "content": "<ul><li>The International Air Services Council has cancelled some flight frequencies of SAA because they have not been used.</li><li>After deliberations in September, the council decided to cancel so… [+5406 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Paola Rosa-Aquino,Morgan McFall-Johnsen", "title": "Harrowing views of Hurricane Ian from air and space show how large and powerful the storm is | Businessinsider - Business Insider South Africa", "description": "Satellites and the International Space Station tracked the hurricane as it unleashed dangerous winds and life-threatening storm surge over Florida.", "url": "https://www.businessinsider.co.za/photos-satellites-astronauts-planes-show-hurricane-ian-size-power-2022-9", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3953/588417f372b0450197f3ac3991460028.jpg", "publishedAt": "2022-09-29T10:29:23Z", "content": "Astronauts aboard the International Space Station got a glimpse of mighty Hurricane Ian as it made landfall on Florida's west coast Wednesday afternoon.\r\nThe ISS flew over the storm, beaming down spe… [+2587 chars]"}, {"source": {"id": null, "name": "SARugbymag"}, "author": "Murray Swart", "title": "A single South African among URC top achievers - SARugbymag", "description": "Only one South African has been listed among the Vodacom United Rugby Championship’s top players in the second round.", "url": "https://www.sarugbymag.co.za/single-south-african-among-urc-top-achievers/", "urlToImage": "https://www.sarugbymag.co.za/wp-content/uploads/2022/09/SH_12980557ah.jpg", "publishedAt": "2022-09-29T08:23:22Z", "content": "Only one South African has been listed among the Vodacom United Rugby Championships top players in the second round.\r\nVodacom Bulls hooker Johan Grobbelaar had a standout performance in his sides 33-… [+836 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Things fall apart at Eskom - BusinessTech", "description": "Power utility Eskom has suffered yet another blow with one of its most outspoken board members, Business Leadership South Africa chief executive Busi Mavuso, reportedly resigning from the board with immediate effect.", "url": "https://businesstech.co.za/news/energy/629568/things-fall-apart-at-eskom/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/08/Eskom-2-e1629377530966.jpg", "publishedAt": "2022-09-29T07:47:32Z", "content": "Power utility Eskom has suffered yet another blow with one of its most outspoken board members, Business Leadership South Africa chief executive Busi Mavuso, reportedly resigning from the board with … [+5605 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Marianne Merten", "title": "Expropriation Bill finally approved — the end of a long... - Daily Maverick", "description": "The Expropriation Bill was adopted by the National Assembly late on Wednesday evening after the opposition DA, EFF, IFP, Freedom Front Plus and African Christian Democratic Party put their objections on record.", "url": "https://www.dailymaverick.co.za/article/2022-09-29-controversial-expropriation-bill-is-finally-approved-after-navigating-a-14-year-rocky-road/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/09/Merten-Expropriation-Passed2.jpeg?w=1280", "publishedAt": "2022-09-29T06:59:31Z", "content": "The Expropriation Bill democratic South Africas third attempt since 2008 to replace apartheid legislation still on the statute books has been enmeshed in controversial, but ultimately stalled moves f… [+7063 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bobi Wine, Zitto Kabwe, Marie-Noelle Nwokolo and Greg Mills", "title": "Why Ukraine's inevitable victory against Russia will be... - Daily Maverick", "description": "Ukraine should continue to inspire African democrats to fight back. To neglect the Ukrainian struggle or, worse, to take the side of Russia, is to take the side of authoritarianism over democracy, of might over what is right.", "url": "https://www.dailymaverick.co.za/article/2022-09-29-why-ukraines-inevitable-victory-against-russia-will-be-a-win-for-africa/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/09/GettyImages-132735497.jpg?w=1280", "publishedAt": "2022-09-29T03:29:31Z", "content": "Ukraine will win this war against Russia. When it does, it will be a victory for Africa, since oppression threatens freedom everywhere.\r\nIts not just because Ukrainian commanders have outwitted their… [+8682 chars]"}]}