{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Costs Cast Cloud Over Nigeria's HPV Vaccine Plan - AllAfrica - Top Africa News", "description": "Nigeria's latest target for introducing a life-saving vaccine against cervical cancer has been branded unrealistic by health specialists as cost concerns have yet to be addressed, leaving thousands of Nigerian women at risk.", "url": "https://allafrica.com/stories/202208290524.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-08-29T11:52:26Z", "content": "Lagos — Nigeria's latest target for introducing a life-saving vaccine against cervical cancer has been branded unrealistic by health specialists as cost concerns have yet to be addressed, leaving tho… [+4730 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Kelsey Vlamis", "title": "Monkeys in Indonesia use stones as sex toys, study suggests, in example of creative tool use in animals - Business Insider South Africa", "description": "Long-tailed macaques were observed tapping and rubbing stones against their genitals, behavior that appeared \"sexually motivated,\" researchers said.", "url": "https://www.businessinsider.co.za/monkeys-in-indonesia-use-stones-as-sex-toys-study-suggests-2022-8", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3750/90eb05ab628c43ae88528f44208dfb91.jpg", "publishedAt": "2022-08-29T08:35:18Z", "content": "Tool use in animals is well documented, but researchers recently discovered some monkeys in Indonesia that appeared to be using stones in a very specific way: as sex toys.\r\nWhile studying a populatio… [+1887 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Good news for petrol and food prices in South Africa - BusinessTech", "description": "Consumers are in for a reprieve in the coming months in South Africa as economic indicators point to food price inflation stabilising, while end-month data from the Central Energy Fund shows a likely petrol price cut for September.", "url": "https://businesstech.co.za/news/energy/620635/good-news-for-petrol-and-food-prices-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/Fuel-petrol.png", "publishedAt": "2022-08-29T07:30:37Z", "content": "Consumers are in for a reprieve in the coming months in South Africa as economic indicators point to food price inflation stabilising, while end-month data from the Central Energy Fund shows a likely… [+4728 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "Dominic Majola", "title": "Gayton Mackenzie launches attack on illegal migrants - EWN", "description": "He said he supported Limpopo Health MEC Phophi Ramathuba's view that foreign nationals were draining South African resources.", "url": "https://ewn.co.za/2022/08/29/gayton-mackenzie-launches-attack-on-illegal-migrants", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/idribyt4978tuf1qghep", "publishedAt": "2022-08-29T05:43:26Z", "content": "He said he supported Limpopo Health MEC Phophi Ramathuba's view that foreign nationals were draining South African resources.\r\n JOHANNESBURG - Patriotic Alliance leader Gayton Mackenzie has launched … [+1194 chars]"}, {"source": {"id": null, "name": "Tribuneonlineng.com"}, "author": "Tribune Online", "title": "Raising alarm on Nigeria's rising yellow fever epidemic - Tribune Online", "description": "OVER 160 million people - more than half of the country’s current estimated population - are at risk of yellow fever in Nigeria, reports by the World Health Organisation (WHO) Africa Region have recently highlighted. Lately, the yellow fever virus ha", "url": "https://tribuneonlineng.com/?p=584250", "urlToImage": "https://tribuneonlineng.com/wp-content/uploads/2021/03/opinions-1.jpg", "publishedAt": "2022-08-29T04:50:55Z", "content": "OVER 160 million people – more than half of the countrys current estimated population – are at risk of yellow fever in Nigeria, reports by the World Health Organisation (WHO) Africa Region have recen… [+5498 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Mike Oyebola", "title": "CHAN 2023 Qualifier: Ghana floor Nigeria again in jollof derby - Daily Post Nigeria", "description": "Ghana outclassed perennial rivals Nigeria 2-0 in the first leg of their African Nations Championship (CHAN) qualifier at the Cape Coast Stadium on Sunday. The first half ended goalless with the hosts having the better advantage. Ghana were awarded a penalty t…", "url": "https://dailypost.ng/2022/08/28/chan-2023-qualifier-ghana-floor-nigeria-again-in-jollof-derby/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/08/20220828_184900.jpg", "publishedAt": "2022-08-28T18:39:07Z", "content": "Ghana outclassed perennial rivals Nigeria 2-0 in the first leg of their African Nations Championship (CHAN) qualifier at the Cape Coast Stadium on Sunday.\r\nThe first half ended goalless with the host… [+560 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "Rae Seleme", "title": "‘Died without a will’: Riky Rick’s ‘wife’ fights for his assets - The South African", "description": "Rapper Riky Rick's live-in partner Bianca Naidoo has dragged Home Affairs Minister Aaron Motsoaledi to court to claim his estate.", "url": "https://www.thesouthafrican.com/lifestyle/celeb-news/breakking-died-without-a-will-riky-rick-bianca-naidoo-wife-fights-for-his-assets/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/08/Untitled-design-10-8.jpg", "publishedAt": "2022-08-28T07:39:19Z", "content": "Riky Ricks baby mama and partner, Bianca Naidoo has taken the Johannesburg Master of the High Court and Home Affairs Minister Aaron Motsoaledi to court to be recognised as his wife and executor of hi… [+2349 chars]"}]}