{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How government can stop a R2/litre petrol price hike in South Africa next month - BusinessTech", "description": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says Investec chief economist Annabel Bishop.", "url": "https://businesstech.co.za/news/finance/565806/how-government-can-stop-a-r2-litre-petrol-price-hike-in-south-africa-next-month/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2016/03/South-Africa-Rand-Money-Notes-Coins.jpg", "publishedAt": "2022-03-08T14:01:12Z", "content": "Global markets are beginning to consider Russia’s invasion of Ukraine as a long-term issue, and a lengthy invasion will have severe effects on the global supply chain, and so commodity prices, says I… [+2216 chars]"}, {"source": {"id": null, "name": "TimesLIVE"}, "author": "Mawande AmaShabalala", "title": "Sanco vows to make Joburg mayor’s job untenable as 130 city workers face the chop - TimesLIVE", "description": "The South African National Civic Organisation has vowed that Joburg mayor Mpho Phalatse will never find peace until she reverses a decision to review the permanent employment of 130 city employees.", "url": "https://www.timeslive.co.za/politics/2022-03-08-sanco-vows-to-make-joburg-mayors-job-untenable-as-130-city-workers-face-the-chop/", "urlToImage": "https://lh3.googleusercontent.com/QnohO5ASc4bapUFcJE5B8iBtNir2ca5SbXWQoNi-4-Yss-1gesFVrQ3fC_h_fIMdFZbYKjin1erV6T53nx2beJJCnhnezk-SlVM=s1000", "publishedAt": "2022-03-08T13:56:51Z", "content": null}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa’s economy is now the same size it was almost five years ago - BusinessTech", "description": "South Africa’s gross domestic product (GDP) increased by 4.9% in 2021, rising significantly from a low base following the Covid pandemic and associated lockdowns restrictions which saw the economy contract by 6.4% in 2020.", "url": "https://businesstech.co.za/news/business/565902/south-africas-economy-is-now-the-same-size-it-was-almost-five-years-ago/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2020/05/Johannesburg-e1589961673248.jpg", "publishedAt": "2022-03-08T09:48:03Z", "content": "South Africas gross domestic product (GDP) increased by 4.9% in 2021, rising significantly from a low base following the Covid pandemic and associated lockdowns restrictions which saw the economy con… [+1570 chars]"}, {"source": {"id": null, "name": "Auburn Citizen"}, "author": "https://www.facebook.com/Citizencitilife", "title": "Makhadzi explains why she pushed her dancer off stage - The Citizen", "description": "South African musician Makhadzi explained that pushing her dancer off stage, as seen in a viral video, was not what she intended to do.", "url": "https://www.citizen.co.za/entertainment/3044036/makhadzi-why-she-pushed-dancer-off-stage/", "urlToImage": "https://media.citizen.co.za/wp-content/uploads/2022/03/makhadzi-and-her-dancers.jpeg", "publishedAt": "2022-03-08T09:07:16Z", "content": "People were left mortified after seeing Makhadzi push one of her dancers off stage in the middle of a performance earlier this week, however, the singer has said that she believes she had a good reas… [+2098 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Morgan McFall-Johnsen", "title": "A stunning photo from NASA's Hubble Space Telescope reveals 3 galaxies colliding - Business Insider South Africa", "description": "Galaxies merging together create starbursts and supermassive black hole collisions. The new James Webb Space Telescope is poised to study both.", "url": "https://www.businessinsider.com/nasa-hubble-space-telescope-photographs-three-galaxies-colliding-2022-2", "urlToImage": "https://i.insider.com/6215837745889c0019d1d5b5?width=1200&format=jpeg", "publishedAt": "2022-03-08T07:55:34Z", "content": "The Hubble Space Telescope has captured a distant tangle of three galaxies crashing into each other and slowly merging.\r\nThe image reveals a cosmic collision 681 million light-years away, in the cons… [+4223 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Omicron Doesn't Need Its Own Custom Covid Vaccine - Here's Why - AllAfrica - Top Africa News", "description": "Analysis - The Omicron variant of the SARS-CoV-2 virus was discovered in South Africa and emerged in November 2021. Scientists have already learned a lot about Omicron. One of the key questions that remains is how well our immune systems deal with infection b…", "url": "https://allafrica.com/stories/202203080123.html", "urlToImage": "https://cdn07.allafrica.com/download/pic/main/main/csiid/00591409:c38b59adf61355052a01e30d127dc205:arc614x376:w1200.jpg", "publishedAt": "2022-03-08T07:30:22Z", "content": "The Omicron variant of the SARS-CoV-2 virus was discovered in South Africa and emerged in November 2021. Scientists have already learned a lot about Omicron. One of the key questions that remains is … [+6336 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Rebecca Davis", "title": "Untangling the narrative web surrounding South Africa's stance on the Russia-Ukraine conflict - Daily Maverick", "description": "Former president Jacob Zuma says Vladimir Putin is a ‘man of peace’. President Cyril Ramaphosa says the West isn’t doing enough to support a peaceful resolution to the Russia-Ukraine conflict. We unpack the issues around South Africa’s stance of neutrality on…", "url": "https://www.dailymaverick.co.za/article/2022-03-08-untangling-the-narrative-web-surrounding-south-africas-stance-on-the-russia-ukraine-conflict/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/Becs-Fact-check-SA-russia-2.jpg?w=1280", "publishedAt": "2022-03-07T22:52:59Z", "content": "South Africas decision to abstain from a United Nations vote condemning Russias February invasion of Ukraine has caused revulsion for many. In his regular newsletter on Monday, President Cyril Ramaph… [+15545 chars]"}, {"source": {"id": null, "name": "African.business"}, "author": null, "title": "Canon introduces new web version of PosterArtist, adding new value for Canon printer users - African Business", "description": "Canon (www.Canon-CNA.com) today introduces a new web version of ‘PosterArtist’, making in-house poster design and print easier. All that’s needed to start", "url": "https://african.business/2022/03/apo-newsfeed/canon-introduces-new-web-version-of-posterartist-adding-new-value-for-canon-printer-users/", "urlToImage": "https://www.africa-newsroom.com/files/thumb/58554ae7e629d2a/600/418", "publishedAt": "2022-03-07T14:15:27Z", "content": "Canon (www.Canon-CNA.com) today introduces a new web version of PosterArtist[1], making in-house poster design and print easier. All thats needed to start poster creation is a compatible Canon printe… [+5778 chars]"}, {"source": {"id": null, "name": "Munsterrugby.ie"}, "author": null, "title": "Munster Travelling Squad For South Africa Tour - Munster Rugby", "description": "Munster Rugby - Munster Travelling Squad For South Africa Tour", "url": "https://www.munsterrugby.ie/2022/03/07/munster-travelling-squad-for-south-africa-tour/", "urlToImage": "https://d2cx26qpfwuhvu.cloudfront.net/munster/wp-content/uploads/2022/03/07114837/inpho_01934999-scaled-e1646653733950.jpg", "publishedAt": "2022-03-07T12:30:31Z", "content": "Alex Kendellen is one of six Greencore Munster Rugby Academy players in the travelling squad. \r\n Inpho The Munster travelling party departed Ireland for South Africa on Sunday ahead of the provinces … [+2156 chars]"}, {"source": {"id": null, "name": "Tdpelmedia.com"}, "author": "Dorcas Funmi", "title": "One in 10 children may be obese in Africa by 2023, WHO warns - TDPel Media", "description": "The World Health Organisation (WHO) has predicted that one in five adults and one in 10 children and teenagers will be obese by December 2023 in 10", "url": "https://tdpelmedia.com/one-in-10-children-may-be-obese-in-africa-by-2023-who-warns", "urlToImage": "https://von.gov.ng/wp-content/uploads/2022/03/images-2022-03-07T110606.528.jpeg", "publishedAt": "2022-03-07T10:37:43Z", "content": "The World Health Organisation (WHO) has predicted that one in five adults and one in 10 children and teenagers will be obese by December 2023 in 10 high-burden African countries if no robust measures… [+3682 chars]"}]}