{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Monkeypox - When the World Did Not Listen to Nigeria - AllAfrica - Top Africa News", "description": "Blog - Again, the world is paying attention to another infectious disease outbreak. This time it is monkeypox, a rare disease that many people may never have heard about, until recently. Named after a well-known primate - monkeys, due to the early origins of …", "url": "https://allafrica.com/stories/202206040305.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-06-04T18:16:10Z", "content": "Again, the world is paying attention to another infectious disease outbreak. This time it is monkeypox, a rare disease that many people may never have heard about, until recently. Named after a well-… [+7457 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Stephen Angbulu", "title": "Coups: Consider vulnerable citizens as you impose sanctions, Buhari urges ECOWAS leaders - Punch Newspapers", "description": "The President, Major General Muhammadu Buhari, on Saturday in Accra, urged leaders of the Economic Community of West African States to consider the welfare of the vulnerable citizens of Mali, Guinea and Burkina Faso who he described as the real victims of the…", "url": "https://punchng.com/coups-consider-vulnerable-citizens-as-you-impose-sanctions-buhari-urges-ecowas-leaders/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/05/22025355/Buhari-m.jpg", "publishedAt": "2022-06-04T17:23:37Z", "content": "The President, Major General Muhammadu Buhari, on Saturday in Accra, urged leaders of the Economic Community of West African States to consider the welfare of the vulnerable citizens of Mali, Guinea … [+4906 chars]"}, {"source": {"id": null, "name": "Boksburgadvertiser.co.za"}, "author": "lisasmith", "title": "Let the sun shine with Vitamin D and eggs – plus a delish recipe - Boksburg Advertiser", "description": "If you think vitamin D deficiency is not of concern in sunny Africa, think again. As many as two in 10 Africans may be vitamin D deficient, suggesting that our continent may have the highest levels of", "url": "https://boksburgadvertiser.co.za/444891/let-the-sun-shine-with-vitamin-d-and-eggs-plus-a-delish-recipe/", "urlToImage": "https://boksburgadvertiser.co.za/wp-content/uploads/sites/25/2022/06/Egg-bagel-web-main-scaled.jpg", "publishedAt": "2022-06-04T11:19:53Z", "content": "If you think vitamin D deficiency is not of concern in sunny Africa, think again. As many as two in 10 Africans may be vitamin D deficient, suggesting that our continent may have the highest levels o… [+2589 chars]"}, {"source": {"id": null, "name": "702"}, "author": "Keely  Goodall", "title": "Q4 crime stats paint a horrifying picture of violent crime in South Africa - EWN", "description": "John Perlman spoke to independent crime analyst Dr Johan Burger about these statistics.", "url": "https://www.702.co.za/articles/446550/q4-crime-stats-paint-a-horrifying-picture-of-violent-crime-in-south-africa", "urlToImage": "https://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_290,w_480/uvdzxanst6rdty7ju20q.jpg", "publishedAt": "2022-06-04T06:51:34Z", "content": "John Perlman spoke to independent crime analyst Dr Johan Burger about these statistics.\r\nPolice Minister Bheki Cele and the South African Police Service have released the shocking results of the Q4 c… [+973 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Ukraine war: Hungry Africans are victims of the conflict, Macky Sall tells Vladimir Putin - BBC", "description": "African Union head Macky Sall urges Russia's president to ease grain and fertiliser exports.", "url": "https://www.bbc.com/news/world-africa-61685383", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/11AAE/production/_125266327_mediaitem125264383.jpg", "publishedAt": "2022-06-03T21:08:46Z", "content": "Image caption, Macky Sall said Africa was suffering from the Ukraine war\r\nAfrican countries are innocent victims of the war in Ukraine and Russia should help ease their suffering, the head of the Afr… [+2876 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Nonkululeko Matiwane", "title": "SA has one of the highest death rates from it. Here are 3 things to know to help an asthma-sufferer | Drum - News24", "description": "Asthma is a potentially life-threatening affliction that affects millions in South Africa, with many children and adults dying from it", "url": "https://www.news24.com/drum/advice/health/sa-has-one-of-the-highest-death-rates-from-it-here-are-3-things-to-know-to-help-an-asthma-sufferer-20220603", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3445/7556ff56ec734af7b25413b17cc12d46.jpg", "publishedAt": "2022-06-03T15:41:41Z", "content": "One moment you're fine.\r\nThe next, you experience difficulty breathing, chest pains, cough, wheezing and sometimes produce extra mucus, which makes it difficult to breathe.\r\nChildren, as well as adul… [+206 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Kremlin denies blame for food crisis as Putin meets AU leaders - News24", "description": "African countries are acutely affected by the growing crisis which has caused a rise in prices of food and fuels.", "url": "https://www.news24.com/news24/africa/news/kremlin-denies-blame-for-food-crisis-as-putin-meets-au-leaders-20220603", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/700/258b074bcc1e43508ab2341a4882684f.jpg", "publishedAt": "2022-06-03T15:27:58Z", "content": "<ul><li>The Kremlin has refused to accept blame for the food crisis in African countries.</li><li>The Kremlin says it is not Russia that is blocking ports, leading to limited supply of grains, oils, … [+2208 chars]"}]}