{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: No, Covid Vaccines Don't Cause Body to Produce Toxic Spike Proteins That Cause Cancer - AllAfrica - Top Africa News", "description": "IN SHORT: A US doctor, who has previously made untrue claims about Covid-19 and vaccines, is on thin ice in saying the vaccines make your body produce a &quot;toxin&quot; spike protein which causes a number of cancers. There is no evidence for this.", "url": "https://allafrica.com/stories/202209200522.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-20T13:44:05Z", "content": "IN SHORT: A US doctor, who has previously made untrue claims about Covid-19 and vaccines, is on thin ice in saying the vaccines make your body produce a \"toxin\" spike protein which causes a number of… [+4398 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Nike Adebowale-Tambe", "title": "Nigeria launches campaign to curb HIV spread among young persons - Premium Times", "description": "NACA said YAaH Naija is Nigeria’s version of U-Test, which is a West African regional innovative intervention by UNICEF.", "url": "https://www.premiumtimesng.com/health/health-news/555037-nigeria-launches-campaign-to-curb-hiv-spread-among-young-persons.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/03/hiv-aids-title-image_tcm7-188226.jpg", "publishedAt": "2022-09-20T11:04:08Z", "content": "The Nigerian government on Monday launched the Youthful Alive and Healthy (YAaH Naija) campaign, an innovative intervention that aims to scale up the uptake of high-impact HIV prevention tools.\r\nThe … [+4578 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "3 new programmes to boost Eskom’s power capacity in South Africa – but there’s a catch - BusinessTech", "description": "The national power utility announced that its new procurement programmes would focus on generators capable of supplying more than one megawatt to the grid.", "url": "https://businesstech.co.za/news/energy/626736/3-new-programmes-to-boost-eskoms-power-capacity-in-south-africa-but-theres-a-catch/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/09/shutterstock_1747984340-e1663653466964.jpg", "publishedAt": "2022-09-20T06:42:31Z", "content": "Eskom has launched three power purchase programmes to boost South Africa’s energy supply, but they are not immediate.\r\nIn a media statement on Monday (19 September), the national power utility announ… [+2601 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "John Fallon", "title": "Pete Wilkins: Adam Byrne's omission from South Africa tour 'no big story' - The42", "description": "Byrne will have to wait until at least the first home game against Munster next month to make his debut.", "url": "https://www.the42.ie/pete-wilkins-5870615-Sep2022/", "urlToImage": "https://img2.thejournal.ie/article/5870615/river/?height=400&version=5870641", "publishedAt": "2022-09-20T06:00:00Z", "content": "CONNACHT HEAD COACH Pete Wilkins is confident that newly appointed captain Jack Carty will join them during their two-match tour in South Africa and that he might make his seasonal debut in the third… [+3773 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Compiled by Larry Claasen", "title": "South Africa's bars and restaurants are filling up, reports Stats SA - Business Insider South Africa", "description": "South Africa’s bars and restaurants are filling up. But that is not the whole story.", "url": "https://www.businessinsider.co.za/south-africas-bars-and-restaurants-are-filling-up-2022-9", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3889/c4bfa55d900449c3b45df00c6eabd60f.jpg", "publishedAt": "2022-09-20T04:13:11Z", "content": "<ul><li>There was a 55.8% increase in income generated by the food and beverages industry in July.</li><li>The largest annual growth rates were recorded for income from overall bar sales, which was u… [+1583 chars]"}, {"source": {"id": null, "name": "Htxt.co.za"}, "author": null, "title": "NASA will test its SLS repair job on Wednesday - Hypertext - htxt.africa", "description": "After two failed launch attempts, NASA is testing its repairs out before firing the SLS at the heavens.", "url": "https://htxt.co.za/2022/09/nasa-will-test-its-sls-repair-job-on-wednesday/", "urlToImage": "https://htxt002.azurewebsites.net/wp-content/uploads/2022/09/plumbing-840835_1920.jpg", "publishedAt": "2022-09-19T13:02:29Z", "content": "<ul><li>Following a failure earlier this month, NASA is ready to test the repairs made to the Space Launch System (SLS).</li><li>The test was originally scheduled for Saturday but was moved for opera… [+2393 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Rand eyes R18.00 to the dollar as load shedding and rate uncertainty bite - BusinessTech", "description": "The South African rand has come under immense pressure on Monday (19 September) as the country feels the pressure of stage 6 load shedding, and markets look ahead to interest rate hikes from major central banks.", "url": "https://businesstech.co.za/news/finance/626572/rand-eyes-r18-00-to-the-dollar-as-load-shedding-and-rate-uncertainty-bite/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/02/South-Africa-rand-money-01.png", "publishedAt": "2022-09-19T12:29:44Z", "content": "The rand has come under immense pressure on Monday (19 September) as the country feels the pressure of stage 6 load shedding, and markets look ahead to interest rate hikes from major central banks.\r\n… [+3106 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "What to expect from South Africa’s interest rate hike this week - BusinessTech", "description": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary forces.", "url": "https://businesstech.co.za/news/government/626338/what-to-expect-from-south-africas-interest-rate-hike-this-week/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/LesetjaKganyago-e1643356278764.jpg", "publishedAt": "2022-09-19T08:32:10Z", "content": "The South African Reserve Bank’s (SARB) Monetary Policy Committee (MPC) is set to hike interest rates on Thursday (22 September) this week in an attempt to support the rand and control inflationary f… [+3057 chars]"}]}