{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Jeanette Chabalala", "title": "Freedom Under Law raises concerns over composition of selection panel for new Chief Justice - News24", "description": "Freedom Under Law (FUL) says while it notes President Cyril Ramaphosa's decision to invite public participation in selecting South Africa's next Chief Justice, it has several concerns relating to the composition of the panel appointed to shortlist nominees.", "url": "https://www.news24.com/news24/southafrica/news/freedom-under-law-raises-concerns-over-composition-of-selection-panel-for-new-chief-justice-20210917", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11586/b46f0219ba87478cb817b3669ff639ef.jpg", "publishedAt": "2021-09-17T17:44:28Z", "content": "<ul><li>Chief Justice Mogoeng Mogoeng's term will come to an end on 11 October. </li><li>President Cyril Ramaphosa has called on the public to nominate South Africa's next Chief Justice to promote tr… [+2658 chars]"}, {"source": {"id": null, "name": "Bloomberglaw.com"}, "author": null, "title": "Children Dying of Covid in South Africa Often Also Have HIV (2) - Bloomberg Law", "description": "South Africa should consider vaccinating adolescents against the coronavirus after data showed that the most common underlying cause of death among youngsters who contracted Covid-19 during the ongoing third wave was HIV infection, the National Institute for …", "url": "https://news.bloomberglaw.com/health-law-and-business/children-dying-of-covid-in-south-africa-often-also-have-hiv-2", "urlToImage": "https://aboutblaw.com/Q2V", "publishedAt": "2021-09-17T15:25:12Z", "content": "South Africa should consider vaccinating adolescents against the coronavirus after data showed that the most common underlying cause of death among youngsters who contracted Covid-19 during the ongoi… [+456 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Stephen Angbulu", "title": "ECOWAS freezes financial assets, places travel ban on Guinea junta - Punch Newspapers", "description": "West African leaders to meet Guinea junta", "url": "https://punchng.com/west-african-leaders-to-meet-guinea-junta/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/09/05230959/Colonel-Mmady-Doumbouya-Guinean-coup-leader.jpg", "publishedAt": "2021-09-17T13:48:22Z", "content": "*Gives junta six months to restore civilian rule\r\nFollowing Thursdays Extraordinary Summit of the Authority of Heads of State and Government of ECOWAS member-states on the political situation in Guin… [+3135 chars]"}, {"source": {"id": null, "name": "Memeburn"}, "author": null, "title": "New Apple iPad Mini pre-orders are now open in South Africa - price and details - Gearburn - Gearburn", "description": "The iStore has opened pre-orders and revealed local prices for the new iPad Mini in South Africa, with several configurations to choose from.", "url": "https://memeburn.com/gearburn/2021/09/new-apple-ipad-mini-pre-orders-are-now-open-in-south-africa-price-and-details/", "urlToImage": "https://memeburn.com/gearburn/wp-content/uploads/sites/3/2021/09/Apple_iPad-mini_smart-folio_09142021.jpg", "publishedAt": "2021-09-17T12:20:35Z", "content": "The iStore has opened pre-orders and revealed local prices for the new iPad Mini in South Africa, with several configurations to choose from.\r\nThe device was recently unveiled alongside the iPhone 13… [+2005 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Sam Cooper", "title": "A steward asked Cristiano Ronaldo if she had died after being hit by the soccer star's wayward shot - Business Insider South Africa", "description": "The woman was reassured by the Portuguese forward that she was still alive and was given his shirt as a way to say sorry.", "url": "https://www.insider.com/steward-hit-by-cristiano-ronaldo-asked-him-she-had-died-2021-9", "urlToImage": "https://i.insider.com/614453912257350018f74ccf?width=1200&format=jpeg", "publishedAt": "2021-09-17T12:16:03Z", "content": "A woman who was hit by a wayward Cristiano Ronaldo shot asked the Portuguese forward if she had died.\r\nMarisa Nobile was hit during the warmup to Manchester United's UEFA Champions League clash again… [+867 chars]"}, {"source": {"id": null, "name": "EWN"}, "author": "AFP", "title": "Africa COVID jab shortfall could take world 'back to square one': WHO - Eyewitness News", "description": "Only 17% of the continent's population will now be vaccinated by the end of this year, compared with the 40% target set by the World Health Organization, the global agency's Africa unit said at its weekly briefing in the Congolese capita of Brazzaville.", "url": "https://ewn.co.za/2021/09/16/africa-covid-jab-shortfall-could-take-world-back-to-square-one-who", "urlToImage": "http://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_437,w_700/xfeo5elfkxz8gfr5uhtf", "publishedAt": "2021-09-16T22:31:52Z", "content": "Only 17% of the continent's population will now be vaccinated by the end of this year, compared with the 40% target set by the World Health Organization, the global agency's Africa unit said at its w… [+2085 chars]"}]}