{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "Technologytimes.pk"}, "author": "Ghulam din", "title": "Monkeypox: Nigeria leads as Africa records 524 infections, 12 deaths - Technology Times Pakistan", "description": "Africa records 524 infections, According to Ms Moeti, Nigeria recorded six of the 12 deaths, while Ghana reported four and two were", "url": "https://technologytimes.pk/2022/09/11/monkeypox-nigeria-leads-as-africa-records-524-infections-12-deaths/", "urlToImage": "https://technologytimes.pk/wp-content/uploads/2022/09/Monkeypox-Nigeria-leads-as-Africa-records-524-infections-12-deaths.jpg", "publishedAt": "2022-09-10T20:13:29Z", "content": "Africa records 524 infections, According to Ms Moeti, Nigeria recorded six of the 12 deaths, while Ghana reported four and two were recorded in the Central African Republic.\r\nData from the World Heal… [+1775 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Richard Gibson", "title": "England lead South Africa by 36 runs... with Robinson stealing the show on day 3 of deciding Test - Daily Mail", "description": "England hold a narrow advantage over South Africa in the third and final Test after 17 wickets fell on a poignant day three of the third Test.", "url": "https://www.dailymail.co.uk/sport/cricket/article-11199575/England-make-incredible-start-against-South-Africa-Proteas-reach-69-6-lunch-Oval.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/09/10/20/62273873-0-image-a-61_1662839204250.jpg", "publishedAt": "2022-09-10T19:48:02Z", "content": "All the talk prior to this Test resuming on Saturday was of how South Africa didnt want to stick around any longer than necessary. Well, they certainly backed up those sentiments with the way they ba… [+6779 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa's Dinosaur Discoveries - Five Essential Reads - AllAfrica - Top Africa News", "description": "Analysis - Few prehistoric creatures generate as much excitement and awe as dinosaurs. Whether it's the &quot;tyrant&quot; T-Rex or a slim-necked Brachiosaurus, people are fascinated by these creatures that dominated landscapes all over the world - including …", "url": "https://allafrica.com/stories/202209100031.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-10T10:26:16Z", "content": "Few prehistoric creatures generate as much excitement and awe as dinosaurs. Whether it's the &amp;quot;tyrant&amp;quot; T-Rex or a slim-necked Brachiosaurus, people are fascinated by these creatures … [+3821 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 ways South Africa could fund a basic income grant – and why Treasury doesn’t want to hear any of it - BusinessTech", "description": "South Africa’s National Treasury has voiced its opposition to a campaign by the Department of Social Development and civil rights groups for stipends to be paid to millions of the country’s poorest citizens on a permanent basis.", "url": "https://businesstech.co.za/news/finance/624553/5-ways-south-africa-could-fund-a-basic-income-grant-and-why-treasury-doesnt-want-to-hear-any-of-it/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/02/Enoch-Godongwana-04.png", "publishedAt": "2022-09-10T10:20:38Z", "content": "South Africas National Treasury has voiced its opposition to a campaign by the Department of Social Development and civil rights groups for stipends to be paid to millions of the countrys poorest cit… [+3312 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "South African retail CEO that dominated his competition - MyBroadband", "description": "Daily Investor analysed the shareholder returns generated under various retail CEOs.", "url": "https://mybroadband.co.za/news/business/460075-south-african-retail-ceo-that-dominated-his-competition.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/09/Whitey-Basson.jpg", "publishedAt": "2022-09-10T04:59:58Z", "content": "New analysis by Daily Investor revealed that former Shoprite CEO Whitey Basson created a 2,450% return in shareholder value during his fifteen-year tenure.\r\nFor this analysis, Daily Investor looked a… [+2875 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "Ons Jabeur becomes first African woman to reach US Open final - Al Jazeera English", "description": "Ons Jabeur outclassed France’s Caroline Garcia to become the first African and Arab woman ever to reach US Open final.", "url": "https://www.aljazeera.com/news/2022/9/9/ons-jabeur-becomes-first-african-woman-to-reach-us-open-final", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/09/063_1422066205.jpg?resize=1920%2C1440", "publishedAt": "2022-09-09T11:54:47Z", "content": "Tunisian tennis player Ons Jabeur has reached her second consecutive Grand Slam title match, two months after playing as a finalist at Wimbledon, as she hopes to add a major trophy to her list of gro… [+2894 chars]"}]}