{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "The Conversation Africa"}, "author": "Carine Smith", "title": "Zebrafish research reveals green rooibos tea's anxiety-busting properties - The Conversation Africa", "description": "Zebrafish are ideal for drug discovery especially in the context of neurological and inflammatory conditions.", "url": "https://theconversation.com/zebrafish-research-reveals-green-rooibos-teas-anxiety-busting-properties-176165", "urlToImage": "https://images.theconversation.com/files/443686/original/file-20220201-25-7le1xb.jpg?ixlib=rb-1.1.0&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-02-06T08:34:19Z", "content": "Rooibos tea is a uniquely South African product. The plant, Aspalathus linearis, grows mainly in the Cederberg area of the countrys Western Cape province. And its not just a tasty beverage. It is caf… [+5947 chars]"}, {"source": {"id": null, "name": "THISDAY Newspapers"}, "author": null, "title": "– The Return of Military Coups to AfricaTHISDAYLIVE - THISDAY Newspapers", "description": "IN THE ARENA As African Union and ECOWAS offer sterner pushback against military coupists in Mali, Guinea, Chad, and Burkina Faso, elected rulers running despotic regimes in West Africa should reth…", "url": "https://www.thisdaylive.com/index.php/2022/02/06/the-return-of-military-coups-to-africa/", "urlToImage": "https://storage.googleapis.com/thisday-846548948316-wp-data/wp-media/2020/07/1da114d5-tukur-buratai.gif", "publishedAt": "2022-02-06T06:57:01Z", "content": "IN THE ARENA\r\nAs African Union and ECOWAS offer sterner pushback against military coupists in Mali, Guinea, Chad, and Burkina Faso, elected rulers running despotic regimes in West Africa should rethi… [+6077 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Don Silas", "title": "AFCON 2021: Cameroon coach, Conceiçao reacts to his side’s win over Burkina Faso - Daily Post Nigeria", "description": "Cameroon coach, Antonio Conceiçao has reacted to his side's 2021 Africa Cup of Nations, AFCON, third-place final win over Burkina Faso on Saturday night. Conceiçao said he was satisfied with the performance of some of his players as Cameroon defeated Burkina …", "url": "https://dailypost.ng/2022/02/06/afcon-2021-cameroon-coach-conceicao-reacts-to-his-sides-win-over-burkina-faso/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/02/Cameroon-vs-Egypt.jpg", "publishedAt": "2022-02-06T05:49:10Z", "content": "Cameroon coach, Antonio Conceiçao has reacted to his side’s 2021 Africa Cup of Nations, AFCON, third-place final win over Burkina Faso on Saturday night.\r\nConceiçao said he was satisfied with the per… [+854 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Ifreke Inyang", "title": "AFCON 2021: Intrigues, drama on the road to a Senegal vs Egypt final - Daily Post Nigeria", "description": "Senegal vs Egypt. Sadio Mane vs Mohamed Salah. Never won vs seven-time champions. Choose your preferred storyline. But the 2021 Africa Cup of Nations, which was actually played in 2022 because of COVID-19, ends this Sunday. It has been a tournament full of dr…", "url": "https://dailypost.ng/2022/02/06/afcon-2021-intrigues-drama-on-the-road-to-a-senegal-vs-egypt-final/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/02/Senegal-vs-Egypt-final.png", "publishedAt": "2022-02-06T05:26:15Z", "content": "Senegal vs Egypt. Sadio Mane vs Mohamed Salah. Never won vs seven-time champions.\r\nChoose your preferred storyline.\r\nBut the 2021 Africa Cup of Nations, which was actually played in 2022 because of C… [+2120 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How much money you need to have saved for retirement based on your age - BusinessTech", "description": "Historically, South Africans have been poor savers. However, the onset of the pandemic, coupled with a historical economic downturn has placed the importance of saving under the spotlight. And for some South Africans, this reality hit home, says Nirdev Desai,…", "url": "https://businesstech.co.za/news/finance/554926/how-much-money-you-need-to-have-saved-for-retirement-based-on-your-age/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/02/South-Africa-rand-money-01.png", "publishedAt": "2022-02-06T05:01:59Z", "content": "Historically, South Africans have been poor savers. However, the onset of the pandemic, coupled with a historical economic downturn has placed the importance of saving under the spotlight. And for so… [+6390 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Nigeria unrelenting in fight for global peace, justice — Buhari - Guardian", "description": "President Muhammadu Buhari, yesterday, in Addis Ababa, Ethiopia, said that the country would continue to pursue peace and progress in Africa, and other parts of the world, by consistently pushing for justice, fairness and inclusiveness in global affairs.", "url": "https://editor.guardian.ng/news/nigeria-unrelenting-in-fight-for-global-peace-justice-buhari/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/02/000_9YB2YX.jpg", "publishedAt": "2022-02-06T04:37:00Z", "content": "President Muhammadu Buhari, yesterday, in Addis Ababa, Ethiopia, said that the country would continue to pursue peace and progress in Africa, and other parts of the world, by consistently pushing for… [+1032 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Israel dispute erupts at African Union summit - News24", "description": "Palestinian prime minister Mohammed Shtayyeh on Saturday urged the African Union to withdraw Israel's accreditation, bringing simmering tensions to a head as the 55-member bloc opened a two-day summit in Addis Ababa.", "url": "https://www.news24.com/news24/africa/news/israel-dispute-erupts-at-african-union-summit-20220205", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2870/007d920ada4b4e0eb3534e30285310c8.jpg", "publishedAt": "2022-02-05T14:20:44Z", "content": "<ul><li>The African Union has begun it's two day summit in Addis Ababa.</li><li>During the opening Palestinian prime minister urged the AU to withdraw Israel's accreditation.</li><li>Africa's relatio… [+4674 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "More South Africans are moving to this island – as it targets skilled tech and finance workers - BusinessTech", "description": "With a population of around 86,000 people, the Isle of Man most likely boasts the highest percentage of South African expats in the world, with figures currently sitting at around 10% of the population, says Marnie Delaney-Parker, director at IOM Opportunitie…", "url": "https://businesstech.co.za/news/technology/553942/more-south-africans-are-moving-to-this-island-as-it-targets-skilled-tech-and-finance-workers/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/01/Isle-of-Man.jpg", "publishedAt": "2022-02-05T05:00:15Z", "content": "With a population of around 86,000 people, the Isle of Man most likely boasts the highest percentage of South African expats in the world, with figures currently sitting at around 10% of the populati… [+2368 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Coca-Cola HBC launches global sustainability challenge, targets startups - Guardian Nigeria", "description": "Breaking Nigerian News - Leading Nigeria Newspaper - Top News from Nigeria, Africa and the world", "url": "https://editor.guardian.ng/", "urlToImage": "https://guardian.ng/wp-content/themes/guardian2021/img/facebook_gdn_banner.png", "publishedAt": "2022-02-05T03:03:00Z", "content": "Get the latest news and analysis of issues from Nigeria, Africa and around the world, direct into your inbox, daily"}, {"source": {"id": null, "name": "Liverpool Echo"}, "author": "Tom Cavilla", "title": "AFCON top scorer refuses to speak after controversial Mohamed Salah comments backfire - Liverpool Echo", "description": "Liverpool forward Mohamed Salah booked his place in the final of the Africa Cup of Nations on Thursday evening", "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/afcon-mohamed-salah-comments-backfire-22990616", "urlToImage": "https://i2-prod.liverpoolecho.co.uk/incoming/article22990721.ece/ALTERNATES/s1200/0_Image-from-iOS.jpg", "publishedAt": "2022-02-04T17:00:00Z", "content": "Cameroon international Vincent Aboubakar refused to stop for reporters after his controversial Mohamed Salah comments backfired on Thursday evening.\r\nAboubakar and his the rest of his international t… [+1923 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "Airtel Africa Q3 results: Net profit up 54% to $180 mn - Economic Times", "description": "The underlying revenue of Bharti Airtel's African telecom arm increased by 17.9 per cent on a reported currency basis to $1.22 billion, from $1.03 billion in the December 2020 quarter. It was up 20 per cent on a constant currency basis.", "url": "https://economictimes.indiatimes.com/markets/stocks/earnings/airtel-africa-q3-results-net-profit-up-54-to-180-mn/articleshow/89352484.cms", "urlToImage": "https://img.etimg.com/thumb/msid-89352498,width-1070,height-580,imgsize-17544,overlay-etmarkets/photo.jpg", "publishedAt": "2022-02-04T16:10:00Z", "content": "New Delhi: Telecom operator Airtel Africa on Friday reported a 54.4 per cent increase in profit after tax (PAT) to $180 million for the December 2021 quarter. The company had posted a PAT of $116 mil… [+1410 chars]"}]}