{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Sky Sports"}, "author": "Sky Sports", "title": "Bundee Aki banned for eight games and will miss Ireland Autumn International Tests vs South Africa, Fiji - Sky Sports", "description": "Ireland centre Bundee Aki has been banned for eight games, meaning he will miss Tests vs South Africa and Fiji in November.", "url": "https://www.skysports.com/rugby-union/news/12321/12707788/bundee-aki-banned-for-eight-games-and-will-miss-ireland-autumn-international-tests-vs-south-africa-fiji", "urlToImage": "https://e1.365dm.com/22/07/1600x900/skysports-bundee-aki-ireland_5833752.jpg", "publishedAt": "2022-09-29T16:02:05Z", "content": "Ireland and Connacht centre Bundee Aki has been banned for eight games after picking up the third red card of his career last weekend, meaning he will miss Tests vs South Africa and Fiji in November.… [+4641 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Naira hits new lows as CBN begins CRR debits - CNBCAfrica", "description": "The naira hit new lows at the parallel market at 734 naira to the dollar as the Central Bank begins to mop liquidity from banks to reduce speculative use of ...", "url": "https://www.youtube.com/watch?v=2AxP3xvs0v0", "urlToImage": "https://i.ytimg.com/vi/2AxP3xvs0v0/maxresdefault.jpg", "publishedAt": "2022-09-29T14:16:30Z", "content": null}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Jasprit Bumrah likely to be ruled out of T20 World Cup - The Indian Express", "description": "Bumrah didn’t play the first T20 against South Africa Wednesday and, a day later, flew to the National Cricket Academy in Bengaluru for the back condition to be monitored.", "url": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-ruled-out-of-t20-world-cup-8180399/", "urlToImage": "https://images.indianexpress.com/2022/07/jasprit-bumrah-3.jpg", "publishedAt": "2022-09-29T13:57:29Z", "content": "WITH JUST weeks to go for the T20 World Cup in Australia, Team India suffered a huge setback with ace pacer Jasprit Bumrah rendered doubtful for the tournament after he complained of back pain.Bumrah… [+3159 chars]"}, {"source": {"id": null, "name": "Saharareporters.com"}, "author": null, "title": "AAC To Kick Off Presidential Campaign In Kano, Promises Total Liberation Of Nigeria From Bad Leadership - SaharaReporters.com", "description": "As political campaigns for the 2023 general elections officially start on Wednesday, September 28, according to the timetable of the Independent National Electoral Commission (INEC), the African Action Congress (AAC) has said that its mission is to liberate N…", "url": "https://saharareporters.com/2022/09/29/aac-kick-presidential-campaign-kano-promises-total-liberation-nigeria-bad-leadership", "urlToImage": null, "publishedAt": "2022-09-29T12:05:57Z", "content": "As political campaigns for the 2023 general elections officially start on Wednesday, September 28, according to the timetable of the Independent National Electoral Commission (INEC), the African Acti… [+6370 chars]"}, {"source": {"id": null, "name": "The42"}, "author": "Murray Kinsella", "title": "Doak and Crowley at 9 and 10 in exciting Emerging Ireland side - The42", "description": "Max Deegan captains the team for tomorrow’s clash with the Griquas in South Africa.", "url": "https://www.the42.ie/emerging-ireland-team-news-5879764-Sep2022/", "urlToImage": "https://img2.thejournal.ie/article/5879764/river/?height=400&version=5879780", "publishedAt": "2022-09-29T11:10:00Z", "content": "ULSTER SCRUM-HALF Nathan Doak and Munster out-half Jack Crowley will steer Emerging Ireland from the halfback slots for their clash with the Griquas in Bloemfontein tomorrow [KO 12.45pm Irish time, l… [+1894 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Paola Rosa-Aquino,Morgan McFall-Johnsen", "title": "Harrowing views of Hurricane Ian from air and space show how large and powerful the storm is | Businessinsider - Business Insider South Africa", "description": "Satellites and the International Space Station tracked the hurricane as it unleashed dangerous winds and life-threatening storm surge over Florida.", "url": "https://www.businessinsider.co.za/photos-satellites-astronauts-planes-show-hurricane-ian-size-power-2022-9", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3953/588417f372b0450197f3ac3991460028.jpg", "publishedAt": "2022-09-29T10:29:23Z", "content": "Astronauts aboard the International Space Station got a glimpse of mighty Hurricane Ian as it made landfall on Florida's west coast Wednesday afternoon.\r\nThe ISS flew over the storm, beaming down spe… [+2587 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Africa: Obesity Is On the Rise Among South African Women - A Risk to Maternal and Child Health - AllAfrica - Top Africa News", "description": "Analysis - Obesity in adults has nearly tripled between 1975 and 2016 across the world. The World Health Organization estimated that by 2016, about 1.9 billion adults worldwide were overweight. More than 650 million of these adults were obese. These represent…", "url": "https://allafrica.com/stories/202209290096.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-09-29T07:33:45Z", "content": "Obesity in adults has nearly tripled between 1975 and 2016 across the world. The World Health Organization estimated that by 2016, about 1.9 billion adults worldwide were overweight. More than 650 mi… [+4973 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Devadyuti Das", "title": "IND vs SA 1st T20: Rohit Sharma and Virat Kohli give PRICELESS reactions after failed DRS call, WATCH - Zee News", "description": "Team India had a perfect start to the three-match T20I series against South Africa in Thiruvananthapuram on Wednesday (September 28), thrashing Temba Bavuma’s side by eight wickets in the opening encounter.", "url": "https://zeenews.india.com/cricket/ind-vs-sa-1st-t20-rohit-sharma-and-virat-kohli-give-priceless-reactions-after-failed-drs-call-watch-2515721.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/09/29/1096421-rohitkohli.jpg", "publishedAt": "2022-09-29T06:36:34Z", "content": "Team India had a perfect start to the three-match T20I series against South Africa in Thiruvananthapuram on Wednesday (September 28), thrashing Temba Bavumas side by eight wickets in the opening enco… [+1744 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Bobi Wine, Zitto Kabwe, Marie-Noelle Nwokolo and Greg Mills", "title": "Why Ukraine's inevitable victory against Russia will be... - Daily Maverick", "description": "Ukraine should continue to inspire African democrats to fight back. To neglect the Ukrainian struggle or, worse, to take the side of Russia, is to take the side of authoritarianism over democracy, of might over what is right.", "url": "https://www.dailymaverick.co.za/article/2022-09-29-why-ukraines-inevitable-victory-against-russia-will-be-a-win-for-africa/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/09/GettyImages-132735497.jpg?w=1280", "publishedAt": "2022-09-29T03:29:31Z", "content": "Ukraine will win this war against Russia. When it does, it will be a victory for Africa, since oppression threatens freedom everywhere.\r\nIts not just because Ukrainian commanders have outwitted their… [+8601 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Marianne Merten", "title": "Expropriation Bill finally approved — the end of a long... - Daily Maverick", "description": "The Expropriation Bill was adopted by the National Assembly late on Wednesday evening after the opposition DA, EFF, IFP, Freedom Front Plus and African Christian Democratic Party put their objections on record.", "url": "https://www.dailymaverick.co.za/article/2022-09-29-controversial-expropriation-bill-is-finally-approved-after-navigating-a-14-year-rocky-road/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/09/Merten-Expropriation-Passed2.jpeg?w=1280", "publishedAt": "2022-09-28T22:17:11Z", "content": "The Expropriation Bill democratic South Africas third attempt since 2008 to replace apartheid legislation still on the statute books has been enmeshed in controversial, but ultimately stalled moves f… [+7063 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Middle-class South Africans are looking for a way out - BusinessTech", "description": "A survey conducted by online market research group InfoQuest shows that one in five working South Africans is either actively making inquiries about leaving the country or are already on their way out the door.", "url": "https://businesstech.co.za/news/lifestyle/629432/middle-class-south-africans-are-looking-for-a-way-out/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/09/ExitSign-e1631865272252.jpeg", "publishedAt": "2022-09-28T14:42:52Z", "content": "A survey conducted by online market research group InfoQuest shows that one in five working South Africans is either actively making inquiries about leaving the country or are already on their way ou… [+4621 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "Reeshni Chaslyn Chetty", "title": "Save the date! Mercury is nearly at its Greatest Western Elongation - The South African", "description": "Mercury will soon be at its Greatest Western Elongation and you don’t want to miss it! Here is how and when you will see it in South Africa.", "url": "https://www.thesouthafrican.com/news/save-date-mercury-greatest-western-elongation-28-september-2022/", "urlToImage": "https://www.thesouthafrican.com/wp-content/uploads/2022/09/Mercury.jpg", "publishedAt": "2022-09-28T05:01:50Z", "content": "On Saturday, 8 October 2022, the planet Mercury will reach its greatest western elongation of 18 degrees from the Sun.\r\nWhat is the best time to view the planet?\r\nThis is regarded as the BEST time to… [+1529 chars]"}]}