{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Shehu Usman", "title": "West African Court suspends sanctions imposed on Mali - Daily Post Nigeria", "description": "A West African Court has ordered the suspension of some punitive sanctions imposed on Mali by the eight-nation West African Economic and Monetary Union with the French acronym UEMOA, ahead of the ECOWAS Extraordinary summit scheduled to hold on Friday in Ghan…", "url": "https://dailypost.ng/2022/03/24/west-african-court-suspends-sanctions-imposed-on-mali/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2019/12/Ecowas-Court.jpg", "publishedAt": "2022-03-24T17:41:19Z", "content": "A West African Court has ordered the suspension of some punitive sanctions imposed on Mali by the eight-nation West African Economic and Monetary Union with the French acronym UEMOA, ahead of the ECO… [+836 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Tiyese Jeranji for Spotlight", "title": "SPOTLIGHT: Finding 'missing persons' with TB a priority for new National Strategic Plan to combat the disease - Daily Maverick", "description": "The period covered by South Africa’s National Strategic Plan (NSP) for HIV, TB, and STIs 2017-2022 will soon come to an end. Against the backdrop of another World TB Day, Spotlight asked several tuberculosis experts what they think the priorities should be as…", "url": "https://www.dailymaverick.co.za/article/2022-03-24-finding-missing-persons-with-tb-a-priority-for-new-national-strategic-plan-to-combat-the-disease/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/MC-TB-Priorities.jpg?w=1280", "publishedAt": "2022-03-24T16:40:55Z", "content": "The new National Strategic Plan is being developed in the context of a Covid-19 pandemic that has severely affected the TB response in South Africa and elsewhere. \r\nIn South Africa, the impact was pa… [+7166 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "DA distances itself from Parliament's rejection of motion condemning Russia - News24", "description": "The DA member of the South African Parliament's delegation to the Inter-Parliamentary Union, Annelie Lotriet, said she fully supports a resolution stating that \"the ongoing Russian use of force against Ukraine is a violation of the Charter of the United Natio…", "url": "https://www.news24.com/news24/southafrica/news/da-distances-itself-from-parliaments-rejection-of-motion-condemning-russia-20220324", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/9514/79310f724dd14f0a817e7f726d1b64d4.jpg", "publishedAt": "2022-03-24T14:45:26Z", "content": "<ul><li>The DA distanced itself from the South African parliamentary delegation's rejection of a resolution condemning Russia's invasion of Ukraine. </li><li>The South African delegation was one of n… [+5325 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Daily Post Staff", "title": "Cryptocurrency exchange, Quidax unveils one of Africa’s biggest music producers as brand ambassador - Daily Post Nigeria", "description": ". . . Announces the launch of its Crypto Academy At a press conference yesterday, African founded cryptocurrency exchange, Quidax announced that it will be collaborating with popular record producer, Micheal Collins popularly known as Don Jazzy. The crypto st…", "url": "https://dailypost.ng/2022/03/24/cryptocurrency-exchange-quidax-unveils-one-of-africas-biggest-music-producers-as-brand-ambassador/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/03/Quidax-Picture.jpg", "publishedAt": "2022-03-24T10:30:13Z", "content": ". . . Announces the launch of its Crypto Academy\r\nAt a press conference yesterday, African founded cryptocurrency exchange, Quidax announced that it will be collaborating with popular record producer… [+2515 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Graye Morkel", "title": "'It wasn't staged, nothing was put on' - Young, Famous & African cast on feuds, flirting and more! | Channel - News24", "description": "Netflix's Young, Famous & African follows the biggest stars from South Africa, Nigeria, Tanzania and Uganda as they manoeuvre tempestuous love lives, feuds and demanding careers in The City of Gold.", "url": "https://www.news24.com/channel/tv/news/it-wasnt-staged-nothing-was-put-on-young-famous-african-cast-on-feuds-flirting-and-more-20220324-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1571/1a5c6e838ebb446080b40fd772031def.jpeg", "publishedAt": "2022-03-24T03:46:13Z", "content": "Netflix's Young, Famous &amp; African follows the biggest stars from South Africa, Nigeria, Tanzania and Uganda as they manoeuvre tempestuous love lives, feuds and demanding careers in The City of Go… [+518 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Tebogo Monama", "title": "UFS to conduct clinical trials on traditional medicine for treating Covid-19 patients - News24", "description": "South Africa is one of the countries at the forefront of finding more treatments for Covid-19, with several clinical trials being conducted locally.", "url": "https://www.news24.com/news24/southafrica/news/ufs-to-conduct-clinical-trials-on-traditional-medicine-for-treating-covid-19-patients-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10701/4b7942a6a6d648ed869a28e47ad83db1.jpg", "publishedAt": "2022-03-23T16:30:00Z", "content": "<ul><li>The University of Free State will start clinical trials to test the use of traditional medicine in patients with mild and moderate Covid-19.  </li><li>The university will enrol 250 people in … [+5103 chars]"}, {"source": {"id": null, "name": "The Eagle Online"}, "author": "Hassan Muaz", "title": "Maya Amolo named Spotify's inaugural Fresh Finds Africa artist - - The Eagle Online", "description": "Centered around the Fresh Finds playlist, the programme focuses on helping emerging artists to learn and grow by giving them the tools for long-term and sustained career success. The Fresh Finds playlist serves as a launchpad for up-and-coming artists to get …", "url": "https://theeagleonline.com.ng/maya-amolo-named-spotifys-inaugural-fresh-finds-africa-artist/", "urlToImage": "https://theeagleonline.com.ng/wp-content/uploads/2022/03/FreshFinds_Africa_Maya-Amolo_IsuKim-scaled-e1648051252356.jpg", "publishedAt": "2022-03-23T16:01:08Z", "content": "Spotify on Wednesday announced Kenyan singer Maya Amolo as its first-ever Fresh Finds Africa artist as part of its programme tailored specifically to spotlight and develop emerging independent artist… [+2763 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lenin Ndebele", "title": "US army general concerned about China and Russia's growing influence in Africa - News24", "description": "If African governments overlook the United States as their international partner and opt for China and/or Russia, this will affect the US' global influence, says General Stephen J Townsend, US commander of the United States Africa Command.", "url": "https://www.news24.com/news24/africa/news/us-army-general-concerned-about-china-and-russias-growing-influence-in-africa-20220323", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1363/dcd8b4d681a74d39b2e5dd4bc1be1d1e.jpg", "publishedAt": "2022-03-23T13:31:41Z", "content": "<ul><li>The US commander of the United States Africa Command has noted that his country needs Africa for key supplies to produce 21st century technologies.</li><li>He says strategic rivals, China and… [+4389 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Victoria O'Regan", "title": "Ramaphosa's relaxed Covid rules met with relief, but... - Daily Maverick", "description": "The further easing of lockdown regulations on Tuesday has been broadly welcomed, but proposed new regulations recently released under the National Health Act are raising concern. Meanwhile, South Africa recorded 912 new Covid-19 infections on Tuesday.", "url": "https://www.dailymaverick.co.za/article/2022-03-23-relief-over-ramaphosas-relaxed-covid-rules-but-proposed-new-health-regulations-sharply-criticised/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/OD-Pushback-CR-covid1.jpeg?w=1280", "publishedAt": "2022-03-23T12:11:13Z", "content": "While President Cyril Ramaphosas address on Tuesday when he announced changes to some lockdown restrictions, including new rules on the size of gatherings, travel requirements and masks has been some… [+7580 chars]"}]}