{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Blackhole with warped accretion disc discovered - Phys.org", "description": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Galaxy, 9,600 light-years from Earth, which they conclude is ca…", "url": "https://phys.org/news/2021-10-blackhole-warped-accretion-disc.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2021/blackhole-with-warped.jpg", "publishedAt": "2021-10-27T16:52:47Z", "content": "An international team of astrophysicists from South Africa, the UK, France and the US have found large variations in the brightness of light seen from around one of the closest black holes in our Gal… [+5434 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Ben Gilbert", "title": "New pictures show how Apple kept design of first iPod secret by making prototypes look ridiculous - Business Insider South Africa", "description": "This early iPod prototype looks nothing like an iPod, and the device's inventor said the boxy design prevented staff from leaking the final product.", "url": "https://www.businessinsider.com/early-ipod-prototype-photos-disguised-design-2021-10", "urlToImage": "https://i.insider.com/61780bdf5d1dca0019a0fff9?width=1200&format=jpeg", "publishedAt": "2021-10-27T16:20:35Z", "content": "Before former Apple CEO Steve Jobs unveiled what would become the world's most popular portable music player, Apple's iPod was a massive, unwieldy device that looked nothing like the final product.\r\n… [+1667 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khanyiso Tshwaku", "title": "SACA CEO Andrew Breetzke on how the Quinton de Kock fallout could have been avoided - News24", "description": "South African Cricketer's Association chief executive officer Andrew Breetzke said Cricket South Africa should have dealt with the taking the knee matter before the tournament instead of raising it on the world stage.", "url": "https://www.news24.com/sport/cricket/proteas/saca-ceo-andrew-breetzke-on-how-the-quinton-de-kock-fallout-could-have-been-avoided-20211027", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11731/e9deaec70d9c41bf8b3f9437b9374a3f.jpg", "publishedAt": "2021-10-27T14:26:56Z", "content": "<ul><li>South African Cricketer's Association chief executive officer Andrew Breetzke said Cricket South Africa's board should have dealt with the kneeling controversy last year.</li><li>The CSA boar… [+2689 chars]"}, {"source": {"id": null, "name": "Thenet.ng"}, "author": "", "title": "Go Behind The Scenes As First-Ever BBNaija Documentary Premieres This November! - Nigerian Entertainment Today", "description": "The first-ever documentary about BBNaija titled, BBNaija: The Fame, the Fans, the Frenzy, will premiere on Africa Magic in November.", "url": "https://thenet.ng/go-behind-the-scenes-as-first-ever-bbnaija-documentary-premieres-this-november/", "urlToImage": "https://thenet.ng/wp-content/uploads/2021/10/BBNaija-Documentary.png", "publishedAt": "2021-10-27T13:55:06Z", "content": "Read Later(0)\r\nThe first-ever documentary about Big Brother Naija is set to drop this month. The mini-documentary titled, BBNaija: The Fame, the Fans, the Frenzy, produced by ID Africas The Bang Stud… [+2549 chars]"}, {"source": {"id": null, "name": "DW (English)"}, "author": "Deutsche Welle (www.dw.com)", "title": "Crude oil price fluctuations expose Africa's fossil fuel dependence - DW (English)", "description": "Africa's abundant sunshine is ideal for renewable energy production. But the continent relies heavily on crude oil. Experts warn that the economy will continue to suffer if governments don't wean themselves off of oil.", "url": "https://www.dw.com/en/high-fuel-prices-africa-oil-dependence/a-59632323", "urlToImage": "https://static.dw.com/image/18721338_6.jpg", "publishedAt": "2021-10-27T12:47:29Z", "content": "As fuel prices skyrocket around the world, it has become clear that African countries will remain exposed to the detrimental impacts of sporadic price fluctuations  at least until the global shift to… [+4336 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "You could get as rich as Elon Musk on a South African salary – in 15 million years - Business Insider South Africa", "description": "The South African born world's richest man is quite a lot richer than the average South African salary earner can realistically hope to ever be – even given millions of years.", "url": "https://www.businessinsider.co.za/elon-musks-wealth-compared-to-south-african-income-and-billionaires-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10529/c20817561de943ecbaa3872b9ad82d17.jpg", "publishedAt": "2021-10-27T12:35:12Z", "content": "<ul><li>The South African born Elon Musk is now pretty rich.</li><li>He is richer than all South Africa's dollar billionaires put together – by a factor of more than ten.</li><li>The difference betwe… [+2715 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Lesley-Anne Johannes", "title": "Majority of local parents are keen to vaccinate their kids, reveal polls - News24", "description": "Polls conducted across South Africa are revealing how parents feel about their young children being eligible for the Covid-19 vaccine.", "url": "https://www.news24.com/parent/Family/Parenting/83-of-parents-feel-children-aged-12-to-18-are-too-young-to-consent-to-vaccination-reports-one-survey-20211027-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11729/f899235922da49f2a0ba15558f5071eb.jpg", "publishedAt": "2021-10-27T11:59:57Z", "content": "Polls conducted across South Africa are revealing how parents feel about their young children being eligible for the Covid-19 vaccine.\r\nParents responding to a News24 survey expressed conflicting emo… [+1721 chars]"}, {"source": {"id": null, "name": "Nine"}, "author": "Simon Brunsdon", "title": "Australia's Big Bash League emerges as unlikely lifeline for exiled South African captain Quinton de Kock - Wide World of Sports", "description": "De Kock already linked to BBL contract", "url": "https://wwos.nine.com.au/cricket/quinton-de-kock-bbl-australia-t20-world-cup-knee-black-lives-matter-south-africa/157fa555-ce93-48f9-b071-1e350695f47e", "urlToImage": "https://imageresizer.static9.net.au/VufQZ5lWoDcPgMxSnZckx9we7wo=/0x550:1325x1295/0x0/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F617a94d5-7554-4ce2-b3d8-d1e7a21e2f8b", "publishedAt": "2021-10-27T06:17:49Z", "content": "Australia's Big Bash League has emerged as an unlikely cricket lifeline for exiled South Africa captain Quinton de Kock.\r\nDe Kock dropped a bombshell on the Twenty20 World Cup on Tuesday night (AEDT)… [+3031 chars]"}, {"source": {"id": null, "name": "eNCA"}, "author": null, "title": "Bavuma surprised at De Kock's refusal to take knee in T20 World Cup clash - eNCA", "description": "South Africa captain Temba Bavuma said star teammate Quinton de Kock's refusal to take the knee ahead of Tuesday's Twenty20 World Cup clash came as a surprise on what turned out to be one of his \"toughest days\" as skipper.", "url": "https://www.enca.com/news/bavuma-surprised-de-kocks-refusal-take-knee-t20-world-cup-clash", "urlToImage": "https://www.enca.com/sites/default/files/styles/facebook/public/afp/2021-10/doc-9QF8EN-%40photo0.jpg?h=4bf1c8f5&itok=1uh0_Uzo", "publishedAt": "2021-10-27T03:45:00Z", "content": "But the wicketkeeper-batsman and former captain chose to opt out of the match that South Africa went on to win by eight wickets, bouncing back from their opening loss to Australia.\r\n\"We were obviousl… [+2643 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Opinion", "title": "African leaders must urge G20 to stop Covid-19 vaccine apartheid to save our world - Punch Newspapers", "description": null, "url": "https://punchng.com/african-leaders-must-urge-g20-to-stop-covid-19-vaccine-apartheid-to-save-our-world/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2021/09/25094747/COVID-19-Coronavirus-vaccine.jpg", "publishedAt": "2021-10-26T23:31:02Z", "content": "The novel coronavirus has shown glaring flaws in the worlds collective ability to respond to infectious disease outbreaks, with none more evident than wealthy countries self-destructive unwillingness… [+3876 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Zukiswa Pikoli", "title": "Investment in mental health services vital for welfare and economy — health minister - msnNOW", "description": "Officials agree that South Africa’s long-standing lack of state psychological assistance and aftercare needs to be urgently remedied.", "url": "https://www.dailymaverick.co.za/article/2021-10-26-investment-in-mental-health-services-vital-for-welfare-and-economy-health-minister/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/MC-MentalHealth.jpg", "publishedAt": "2021-10-26T17:32:18Z", "content": "A report titled Mental Health Systems cost, resources and constraints in South Africa presented at the Department of Healths World Mental Health Month commemoration has shown that 24% of patients dis… [+3525 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Pursuing the Endgame - Novel Polio Vaccine Rollout in Africa - AllAfrica.com", "description": "Interview - In November 2020, the novel Oral Polio Vaccine type 2 (nOPV2) became the first vaccine to be authorized under the WHO Emergency Use Listing. The vaccine has since been rolled out for limited initial use in countries to tackle vaccine-derived polio…", "url": "https://allafrica.com/stories/202110260534.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-10-26T12:49:32Z", "content": "Brazzaville — In November 2020, the novel Oral Polio Vaccine type 2 (nOPV2) became the first vaccine to be authorized under the WHO Emergency Use Listing. The vaccine has since been rolled out for li… [+6193 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Good news for South Africans travelling to the US - BusinessTech", "description": "The US published new rules for travellers on Monday (25 October), removing its country-by-country restrictions and instead introducing international restrictions based on the vaccination status of individual travellers.", "url": "https://businesstech.co.za/news/lifestyle/532024/good-news-for-south-africans-travelling-to-the-us/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/03/JoeBiden-e1615373900339.jpg", "publishedAt": "2021-10-26T06:52:07Z", "content": "The US has published new rules for travellers, removing its country-by-country travel restrictions and instead introducing international restrictions based on the vaccination status of individual tra… [+4908 chars]"}]}