{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": "Khulekani Magubane", "title": "ACSA records worst first-half results in its history as it turns net loss of R2.6bn - News24", "description": "Airports Company South Africa projects that international air travel will only be back at pre-pandemic levels in 2025, while South Africa and the region lag behind west Africa.", "url": "https://www.news24.com/fin24/companies/acsa-records-worst-first-half-results-in-its-history-as-it-turns-net-loss-of-r26bn-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10365/4010defbf35b42f98579dc45e385500b.jpg", "publishedAt": "2021-10-19T14:39:49Z", "content": "<ul><li>Airports Company South Africa says the first half in its 2021 financial results captured are the worst first-half results of the company's history.</li><li>ACSA CFO Sphamandla Mthethwa says t… [+5869 chars]"}, {"source": {"id": null, "name": "Ecr.co.za"}, "author": null, "title": "Surprise! Couple discover stowaway in their luggage as they check in for flight - East Coast Radio", "description": "Hot music; cool people. Come chill on the east coast of South Africa, home to East Coast Radio, KwaZulu-Natal’s leading commercial radio station. Laughs, news, traffic, interviews, sport, jokes and great music – We play KZN’s Widest Variety Of Hit Music, Now …", "url": "https://www.ecr.co.za/", "urlToImage": "", "publishedAt": "2021-10-19T13:47:00Z", "content": "Trying to sneak onto an aeroplane is risky business.\r\nREAD: Buy your #ECRSummerBodyBootcamp ticket here\r\nThere is almost no way you can navigate your way through an airport without showing your board… [+1771 chars]"}, {"source": {"id": null, "name": "Itnewsafrica.com"}, "author": null, "title": "Want to Watch the Google Pixel 6 Launch in Africa Today? Here’s How - IT News Africa", "description": "The launch date for Google’s Pixel 6 Series is finally here. The event is schedule for 19 October 2021 at 10 am PT. If you’re looking forward to the launch of Google’s new smartphone, but are confused as to when and where the launch will be hosted, look no fu…", "url": "https://www.itnewsafrica.com/2021/10/want-to-watch-the-google-pixel-6-launch-in-africa-today-heres-how/", "urlToImage": "https://www.itnewsafrica.com/wp-content/uploads/2021/10/Google-Pixel-6.jpeg", "publishedAt": "2021-10-19T12:06:55Z", "content": "The launch date for Google’s Pixel 6 Series is finally here. The event is schedule for 19 October 2021 at 10 am PT.\r\nIf you’re looking forward to the launch of Google’s new smartphone, but are confus… [+1882 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Graye Morkel", "title": "The reason there is no second and third place at this year's Miss SA - News24", "description": "The top three will represent South Africa at the world's three most prestigious pageants - Miss World, Miss Universe and Miss Supranational.", "url": "https://www.news24.com/channel/the-juice/news/the-reason-there-is-no-second-and-third-place-at-this-years-miss-sa-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11697/afc0e1d97b8040f4b23d2a448e960150.jpg", "publishedAt": "2021-10-19T11:46:19Z", "content": "<ul><li>Lalela Mswane was crowned Miss South Africa 2021 on Saturday at the Grand Arena, GrandWest in Cape Town.</li><li>The two runners-up were Moratwe Masima, from Midrand in Gauteng, and Zimi Mabu… [+2323 chars]"}, {"source": {"id": null, "name": "IOL"}, "author": "Shakirah Thebus", "title": "HIV concerns over Russia's Sputnik V obstructs Sahpra approval - IOL", "description": "The South African Health Products Regulatory Authority (Sahpra) has for the moment rejected the application for the use of Russia’s Sputnik V Covid-19 vaccine over concerns related to HIV acquisition.", "url": "https://www.iol.co.za/capeargus/news/hiv-concerns-over-russias-sputnik-v-obstructs-sahpra-approval-42587cbf-00e8-430d-95a9-d353fc867329", "urlToImage": "https://image-prod.iol.co.za/resize/650x366/The-Sputnik-V-Covid-19-vaccine-has-not-received-Emergency-Use-Listing-by-the-World-Health-Organization-File-picture-AP?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/0ae9e075-5285-5bf9-82e5-10d453d78990&operation=CROP&offset=0x105&resize=2000x1125", "publishedAt": "2021-10-19T11:30:39Z", "content": "Cape Town - The South African Health Products Regulatory Authority (Sahpra) has for the moment rejected the application for the use of Russias Sputnik V Covid-19 vaccine over concerns related to HIV … [+3013 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khulekani Magubane", "title": "Employer group warns of wage and jobs wipeout if Numsa strike drags on | Fin24 - News24", "description": "South African Engineering and Founders' Association executive director Gordon Angus called the steel and engineering strike a culmination of troubles that have dogged the sector for over a decade.", "url": "https://www.news24.com/fin24/economy/employer-group-warns-of-wage-and-jobs-wipeout-if-numsa-strike-drags-on-20211019", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11695/3c9afe09255f49de862c8c9b784bbdce.jpg", "publishedAt": "2021-10-19T10:45:42Z", "content": "As the strike by the National Union of Metalworkers of South Africa (Numsa) in the steel and engineering sector enters its second week, more employer associations are voicing the concerns regarding a… [+694 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Cara Anna", "title": "Climate report: Africa's rare glaciers soon to disappear - Associated Press", "description": "NAIROBI, Kenya (AP) — Africa’s rare glaciers will disappear in the next two decades because of climate change, a new report warned Tuesday amid sweeping forecasts of pain for the continent that contributes least to global warming but will suffer from it most.", "url": "https://apnews.com/article/climate-change-africa-environment-and-nature-glaciers-kenya-dce9713dbcca056bc16e0ca1553b2c0b", "urlToImage": "https://storage.googleapis.com/afs-prod/media/734011dda646414d85a22785414bb19a/3000.jpeg", "publishedAt": "2021-10-19T08:35:13Z", "content": "NAIROBI, Kenya (AP) Africas rare glaciers will disappear in the next two decades because of climate change, a new report warned Tuesday amid sweeping forecasts of pain for the continent that contribu… [+2750 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This CEO wants all public holidays to be long weekends in South Africa - BusinessTech", "description": "Low-cost airline FlySafair has drafted a proposal that will change public holidays in South Africa to be less disruptive to the country’s work week.", "url": "https://businesstech.co.za/news/business/530282/this-ceo-wants-all-public-holidays-to-be-long-weekends-in-south-africa/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/FlySafair1-e1633422809975.jpg", "publishedAt": "2021-10-19T06:18:40Z", "content": "Low-cost airline FlySafair has drafted a proposal to change public holidays in South Africa to be less disruptive to the country’s workweek.\r\nThe airline proposes that public holidays that fall in th… [+2089 chars]"}]}