{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": null, "name": "The South African"}, "author": "https://www.facebook.com/theprincessay9", "title": "It's over': Replacement named as Manchester United finally pull the trigger on Ole Gunnar Solskjaer's rein- reports - The South African", "description": "Manchester United’s board have finally decided to pull the trigger on manager Ole Gunnar Solskjaer’s three-year rein at the club.", "url": "https://www.thesouthafrican.com/sport/soccer/epl/its-over-replacement-named-as-manchester-united-finally-pull-the-trigger-on-ole-gunnar-solskjaers-rein-reports/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/10/Ole_Gunnar_Solskjaer_AFP.jpg", "publishedAt": "2021-11-21T07:08:59Z", "content": "Manchester Uniteds board have finally decided to pull the trigger on manager Ole Gunnar Solskjaers three-year rein at the club.\r\nREAD | MANCHESTER UNITED FINALLY BEGIN PROCESS TO SACK OLE GUNNAR SOLS… [+2022 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa faces a massive car problem, analysts warn - BusinessTech", "description": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030 which means there is an urgent need for added investment to shift to electric vehicle (EV) manufacturin…", "url": "https://businesstech.co.za/news/motoring/533744/south-africa-faces-a-massive-car-problem-analysts-warn/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/03/I-pace-electric-car.png", "publishedAt": "2021-11-20T10:01:14Z", "content": "South Africa’s major export car markets such as the UK and Europe will no longer allow the importation of internal combustion engine (ICE) vehicles by 2030, which means there is an urgent need for ad… [+4181 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Kabir Yusuf", "title": "US urges African leaders to promote democracy, pledges non-exploitative relationship with Nigeria, others - Premium Times", "description": "The U.S. will partner Nigeria to change past exploitative approach, Mr Blinken says.", "url": "https://www.premiumtimesng.com/news/headlines/496389-u-s-urges-african-leaders-to-promote-democracy-pledges-non-exploitative-relationship-with-nigeria-others.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/11/IMG-5343-scaled-e1637400064857.jpg", "publishedAt": "2021-11-20T09:18:22Z", "content": "Nigeria deserves a prominent seat wherever the most consequential issues are discussed, the United States Secretary of State, Antony Blinken, has said, adding that his country was ready to partner wi… [+6697 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Khulekani Magubane", "title": "Saccawu starts strike at Makro, Game - but Massmart says only a quarter of union members take part - News24", "description": "The South African Commercial Catering and Allied Workers' Union is preparing to increase the pressure of its strike on Massmart by planning a consumer boycott.", "url": "https://www.news24.com/fin24/companies/industrial/saccawu-starts-strike-at-makro-game-but-massmart-says-only-a-quarter-of-union-members-take-part-20211119", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/9111/8bcf2c177e084a08b213c9cafc0a6605.jpg", "publishedAt": "2021-11-19T16:59:51Z", "content": "<ul><li>The South African Commercial Catering and Allied Workers' Union started its strike at Massmart outlets on Friday with pickets. </li><li>Massmart CEO Mitch Slape said the company engaged for m… [+4556 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Loni Prinsloo and Dinesh Nair", "title": "Oreo and Cadbury's US owner considers bid for I&J and Five Roses manufacturer AVI - insiders - News24", "description": "Mondelez International is weighing a bid for South African food and beverage company AVI, a deal that would help the US multinational extend its presence in Africa, according to people familiar with the matter.", "url": "https://www.news24.com/fin24/Companies/Retail/oreo-and-cadburys-us-owner-considers-bid-for-ij-and-five-roses-manufacturer-avi-insiders-20211119", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/4440/e4e113fd533849e583a9f1fb21853084.jpg", "publishedAt": "2021-11-19T13:25:26Z", "content": "Mondelez International is weighing a bid for South African food and beverage company AVI, a deal that would help the US multinational extend its presence in Africa, according to people familiar with … [+1051 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Maria Cheng", "title": "Scientists mystified, wary, as Africa avoids COVID disaster - Citrus County Chronicle", "description": "HARARE, Zimbabwe (AP) — At a busy market in a poor township outside Harare this week, Nyasha Ndou kept his mask in his pocket, as hundreds of other people, mostly unmasked, jostled to buy and sell fruit and vegetables displayed on wooden tables and plastic sh…", "url": "https://apnews.com/fcf28a83c9352a67e50aa2172eb01a2f", "urlToImage": "https://storage.googleapis.com/afs-prod/media/f942bde7560e4a2a8098b4e9b2160c6a/3000.jpeg", "publishedAt": "2021-11-19T11:09:50Z", "content": "HARARE, Zimbabwe (AP) At a busy market in a poor township outside Harare this week, Nyasha Ndou kept his mask in his pocket, as hundreds of other people, mostly unmasked, jostled to buy and sell frui… [+6857 chars]"}]}