{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Wale Odunsi", "title": "Coup wave in Africa hits Sudan as military takes over government - Daily Post Nigeria", "description": "Just over a month after the coup attempt in Sudan, the military has assumed control of the country's government. The takeover occurred six weeks after elite soldiers in Guinea overthrew President Alpha Conde and his administration. On Tuesday, Sudan’s top gen…", "url": "https://dailypost.ng/2021/10/25/coup-wave-in-africa-hits-sudan-as-military-takes-over-government/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/10/XefrzJi5.jpeg", "publishedAt": "2021-10-25T16:32:19Z", "content": "Just over a month after the coup attempt in Sudan, the military has assumed control of the country’s government.\r\nThe takeover occurred six weeks after elite soldiers in Guinea overthrew President Al… [+1375 chars]"}, {"source": {"id": null, "name": "FRANCE 24 English"}, "author": "NEWS WIRES", "title": "Nigeria, Africa's largest economy, launches digital currency eNaira - FRANCE 24 English", "description": "Nigerian President Muhammadu Buhari launched the country's new digital eNaira currency on Monday as Africa's largest economy looked to tap into the growing popularity of virtual money and cryptocurrencies.", "url": "https://www.france24.com/en/africa/20211025-nigeria-africa-s-largest-economy-launches-digital-currency-enaira", "urlToImage": "https://s.france24.com/media/display/c3536ab4-35a6-11ec-890c-005056bf30b7/w:1280/p:16x9/AP16172470541369%20%281%29.jpg", "publishedAt": "2021-10-25T15:32:52Z", "content": "Nigerian President Muhammadu Buhari launched the country's new digital eNaira currency on Monday as Africa's largest economy looked to tap into the growing popularity of virtual money and cryptocurre… [+2600 chars]"}, {"source": {"id": null, "name": "IOL"}, "author": "Wesley Diphoko", "title": "Africa gets a more dangerous version of Facebook, says whistle-blower - Independent Online", "description": "Frances Haugen has triggered a deep crisis at Mark Zuckerberg’s social media empire after she released tens of thousands of internal documents", "url": "https://www.iol.co.za/technology/africa-gets-a-more-dangerous-version-of-facebook-says-whistle-blower-8bf1a821-f893-430b-91ab-f419404bff61", "urlToImage": "https://image-prod.iol.co.za/resize/650x366/?source=https://xlibris.public.prod.oc.inl.infomaker.io:8443/opencontent/objects/566aa526-e744-5cb8-88a8-68d727fe5f5f&operation=CROP&offset=0x244&resize=4109x2311", "publishedAt": "2021-10-25T15:01:04Z", "content": "PEOPLE in Africa are getting a raw version of Facebook which is more dangerous, Frances Haugen said in her address to UK Members of Parliament. \r\nThe Facebook whistle-blower has been giving evidence … [+1543 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Oladayo Jonathan", "title": "South Africa's construction mafia trains its sights on local government - Premium Times", "description": "With elections a week away, attacks on ward councillors are bad for democracy and reflect the country’s organised crime problem.", "url": "https://www.premiumtimesng.com/news/top-news/491615-south-africas-construction-mafia-trains-its-sights-on-local-government.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/10/2021-10-25-iss-today-construction-mafia-banner.jpg", "publishedAt": "2021-10-25T13:27:26Z", "content": "A growing extortion mafia is sweeping across South Africa, crippling construction and small businesses with threats and bribes, and more recently killing political ward councillors if demands are not… [+6993 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: 'Technology Will Be Vital to Increase Remittance Inflow' - AllAfrica.com", "description": "The Chief Executive Officer, Baxi, Degbola Abudu, has revealed that improved technology adoption would increase remittance inflow in Africa especially Nigeria, noting that the global remittance market is estimated at $25million inflow opportunities.", "url": "https://allafrica.com/stories/202110250110.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-10-25T07:37:44Z", "content": "The Chief Executive Officer, Baxi, Degbola Abudu, has revealed that improved technology adoption would increase remittance inflow in Africa especially Nigeria, noting that the global remittance marke… [+1541 chars]"}, {"source": {"id": null, "name": "Pulse Nigeria"}, "author": "Pulse Mix", "title": "Hanu Fejiro Agbodje puts Africa in the spotlight, selected for the Amplify 2021 program and to be recognized by Money20/20 - Pulse Nigeria", "description": "One of Africa’s young, future-forward entrepreneurs and tech founders, Hanu Fejiro Agbodje Founder and CEO of Patricia Technologies has been listed among 15 innovative individuals on the inaugural AMPLIFY 2021 program", "url": "https://www.pulse.ng/business/hanu-fejiro-agbodje-puts-africa-in-the-spotlight-selected-for-the-amplify-2021/883y886#article", "urlToImage": "https://ocdn.eu/pulscms-transforms/1/Fg8ktkpTURBXy8yNjk3ZGNlMDE1NTFmYjY1MzJmYTA4MWJlNmM3MTMyMi5wbmeSlQMSAM0B3M0BDJMFzQSwzQJ2", "publishedAt": "2021-10-25T07:25:44Z", "content": "Hanu, the only African in the 2021 cohort, was listed alongside Ambika Sharma of U.S Bank and Chris Lavato Founder of SOON. The lineup includes the biggest minds and brightest innovators within their… [+1669 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Poloko Tau", "title": "COP26: SA to call for developed countries to financially help with climate crisis | Citypress - News24", "description": "South Africa will use its presence at the 26th Conference of the Parties, commonly known as COP26, in the UK at the end of this month to emphasise the importance of sustainable finance by developed to developing countries to enable them to set themselves up i…", "url": "https://www.news24.com/citypress/news/cop26-sa-to-call-for-developed-countries-to-financially-help-with-climate-crisis-20211024", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/8030/a0aac8144a32478792485b96bba012a5.jpg", "publishedAt": "2021-10-24T00:12:05Z", "content": null}]}