{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Stambaugh, Dhruv Tikekar, Heather Chen", "title": "Johannesburg building fire: Death toll rises to 52 in South Africa - CNN", "description": "The death toll from a raging fire in a five-story building in central Johannesburg has risen to 63, according to the city’s emergency services.", "url": "https://www.cnn.com/2023/08/31/africa/johannesburg-fire-south-africa-death-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230830213642-01-johannesburg-fire-screengrab.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-08-31T06:27:00Z", "content": "The death toll from a raging fire in a five-story building in central Johannesburg has risen to 63, according to the citys emergency services. \r\nThe number of people injured stands at 43, said spokes… [+933 chars]"}, {"source": {"id": null, "name": "The Cricket Times"}, "author": "Anirudh Singh", "title": "Twitter Reactions: Mitchell Marsh, Tanveer Sangha power Australia to their biggest victory over South Africa in T20Is - Cricket Times", "description": "The first T20I encounter between South Africa and Australia, part of the Australia tour of South Africa 2023, took place at Kingsmead in Durban on Wednesday. After winning the toss, South Africa chose to bowl first, setting the stage for a competitive battle.…", "url": "https://crickettimes.com/2023/08/twitter-reactions-mitchell-marsh-tanveer-sangha-power-australia-to-their-biggest-victory-over-south-africa-in-t20is/", "urlToImage": "https://crickettimes.com/wp-content/uploads/2023/08/Australia-hammer-South-Africa-in-the-first-T20I.webp", "publishedAt": "2023-08-31T05:35:55Z", "content": "The first T20I encounter between South Africa and Australia, part of the Australia tour of South Africa 2023, took place at Kingsmead in Durban on Wednesday. After winning the toss, South Africa chos… [+3854 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "52 Killed After Massive Fire At 5-Storey Building In S Africa's Johannesburg - NDTV", "description": "The death count from a fire that engulfed a five-storey building in central Johannesburg on Thursday has risen to 63, the South African city's emergency services said.", "url": "https://www.ndtv.com/world-news/20-killed-after-massive-fire-at-5-storey-building-in-s-africas-johannesburg-4344271", "urlToImage": "https://c.ndtvimg.com/2023-08/k949v9a8_johannesburg-fire_625x300_31_August_23.jpg", "publishedAt": "2023-08-31T05:23:04Z", "content": "It was not immediately clear what caused the blaze, which broke out overnight.\r\nJohannesburg: More than 60 people have died in a fire that engulfed a five-storey building in central Johannesburg on T… [+1938 chars]"}]}