{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "The Statesman"}, "author": "IANS", "title": "Unicef calls for concerted efforts to address routine immunisation - The Statesman", "description": "Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children's Fund, or Unicef, has disclosed.", "url": "https://www.thestatesman.com/world/unicef-calls-for-concerted-efforts-to-address-routine-immunisation-1503174425.html", "urlToImage": "https://www.thestatesman.com/wp-content/uploads/2022/01/COVID-1.jpg", "publishedAt": "2023-04-22T08:54:00Z", "content": "Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children’s Fund, or Unicef, has disclosed. \r\nUni… [+1825 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "Unicef calls for concerted efforts to address routine immunisation - Punjab News Express", "description": "<p><strong>ADDIS ABABA</strong>: Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children's Fund, or Unicef, has disclosed.</p>", "url": "https://www.punjabnewsexpress.com/health/news/unicef-calls-for-concerted-efforts-to-address-routine-immunisation-206622", "urlToImage": "https://www.punjabnewsexpress.com/images/article/article206622.jpg", "publishedAt": "2023-04-22T04:42:41Z", "content": "ADDIS ABABA: Some 12 million children in Eastern and Southern Africa missed out entirely or partially on routine immunisation from 2019 to 2021, the United Nations Children's Fund, or Unicef, has dis… [+1841 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Sabes", "title": "State Department says it's in contact with 'several hundred' American citizens in Sudan - Fox News", "description": "The State Department says it's in touch with several hundred of American citizens in Sudan as a growing civil conflict in the African country has emerged.", "url": "https://www.foxnews.com/world/state-department-says-contact-several-hundred-american-citizens-sudan", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2023/04/7599c3c9-Sudan.jpg", "publishedAt": "2023-04-22T00:22:00Z", "content": "The U.S. Department of State says that it's in contact with several hundreds of American citizens in Sudan as a growing civil conflict is emerging in the African nation.\r\nExplosions and gunfire began… [+2370 chars]"}]}