{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "WHO's recommendation for malaria vaccine offers a glimmer of hope for Sub-Saharan Africa - News-Medical.Net", "description": "The World Health Organization's recommendation of broad deployment of the first malaria vaccine among children in Sub-Saharan Africa has been widely celebrated, but scientists warn it could face hurdles in its acquisition and distribution by endemic countries.", "url": "https://www.news-medical.net/news/20211012/WHOs-recommendation-for-malaria-vaccine-offers-a-glimmer-of-hope-for-Sub-Saharan-Africa.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Malaria_3-620x480.jpg", "publishedAt": "2021-10-13T00:01:00Z", "content": "The World Health Organization's recommendation of broad deployment of the first malaria vaccine among children in Sub-Saharan Africa has been widely celebrated, but scientists warn it could face hurd… [+4415 chars]"}, {"source": {"id": "independent", "name": "Independent"}, "author": "Adam Forrest", "title": "Matt Hancock given new job as UN envoy helping Africa’s Covid recovery - The Independent", "description": "Appointment comes as Dominic Cummings renews attack on former health secretary", "url": "https://www.independent.co.uk/news/uk/politics/matt-hancock-un-africa-covid-b1937194.html", "urlToImage": "https://static.independent.co.uk/2021/07/23/09/newFile-4.jpg?width=1200&auto=webp&quality=75", "publishedAt": "2021-10-12T19:18:13Z", "content": "Boris Johnsons former health secretary Matt Hancock has been handed a new role with the United Nations as a special representative to Africa.\r\nMr Hancock said he was honoured to have been named by th… [+2623 chars]"}, {"source": {"id": null, "name": "Premium Times"}, "author": "Tunde Eludini", "title": "Zikora Emerges Winner of 2021 Heineken Design Fashion Africa Competition - Premium Times", "description": "Top Nigerian and African designers partook in the competition", "url": "https://www.premiumtimesng.com/entertainment/naija-fashion/489549-zikora-emerges-winner-of-2021-heineken-design-fashion-africa-competition.html", "urlToImage": "https://media.premiumtimesng.com/wp-content/files/2021/10/1-4.jpg", "publishedAt": "2021-10-12T17:22:16Z", "content": "Zikoranachukwuebuka Ikebuaku of Zikora has emerged winner of the Heineken Design Fashion Africa (DFA) Showcase 2021 held at the Eko Convention Center, over the weekend in Lagos.\r\nThe winner was then … [+3218 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Major strike threatens to make South Africa’s jobs crisis worse - BusinessTech", "description": "South Africa’s ongoing steelworker strike is likely to lead to job cuts, further hammering an industry that’s been in decline for several years, according to the country’s main employer body.", "url": "https://businesstech.co.za/news/business/528634/major-strike-threatens-to-make-south-africas-jobs-crisis-worse/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/10/BMW-Assembly-plant.png", "publishedAt": "2021-10-12T14:20:40Z", "content": "South Africas ongoing steelworker strike is likely to lead to job cuts, further hammering an industry thats been in decline for several years, according to the countrys main employer body.\r\nThe week-… [+2340 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "This is where South Africa is heading right now: IMF - BusinessTech", "description": "The International Monetary Fund (IMF) has published its latest growth outlook for the world’s major markets, with the group forecasting that the global economic recovery is set to continue, despite the resurgence of Covid-19 in parts of the world.", "url": "https://businesstech.co.za/news/finance/528608/this-is-where-south-africa-is-heading-right-now-imf/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/SouthAfrica-e1622546460781.jpg", "publishedAt": "2021-10-12T13:44:51Z", "content": "The International Monetary Fund (IMF) has published its latest growth outlook for the world’s major markets, with the group forecasting that the global economic recovery is set to continue, despite t… [+4333 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "SAA starts flying to Mauritius in November – and its tickets are the cheapest - Business Insider South Africa", "description": "South Africa's national carrier will restart its flights to Mauritius in November, and is undercutting its direct competitors.", "url": "https://www.businessinsider.co.za/saa-flights-to-mauritius-ticket-prices-2021-10", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11672/1b9f3db04c7545659841c40bb1686636.jpg", "publishedAt": "2021-10-12T12:52:16Z", "content": "<ul><li>South African Airways will start flying to Mauritius again on 21 November.</li><li>The airline is already taking bookings, with its direct, one-way tickets cheaper than all its local competit… [+3016 chars]"}, {"source": {"id": null, "name": "Stuff.co.za"}, "author": "Brett Venter", "title": "Nokia TVs will soon be available to South African viewers, exclusively through Ellies » Stuff - Stuff Magazines", "description": "Nokia used to be the biggest name in cellular phones before Apple came along and launched the smartphone. Ever since then, the company has attempted to find", "url": "https://stuff.co.za/2021/10/12/nokia-tvs-south-africa-via-ellies/", "urlToImage": "https://stuff.co.za/wp-content/uploads/2021/10/Nokia-TVs-main.jpg", "publishedAt": "2021-10-12T11:52:42Z", "content": "Nokia used to be the biggest name in cellular phones before Apple came along and launched the smartphone. Ever since then, the company has attempted to find its footing again. It did a stint as a Mic… [+1600 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mark Heywood", "title": "Maverick Citizen: Tuesday Editorial: South Africa's mental health epidemic: Love Don't Live here Anymore - Daily Maverick", "description": "This is a scream for help that, tragically, will fall on deaf ears. People will harm themselves, harm others and some will die because the government will ignore what I am about to write.", "url": "https://www.dailymaverick.co.za/article/2021-10-12-south-africas-mental-health-epidemic-love-dont-live-here-anymore/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/OD-MC-tuesdayEd.jpg", "publishedAt": "2021-10-12T09:00:52Z", "content": "Research reports from the National Income Dynamics Coronavirus Rapid Mobile Survey (NIDS-CRAM) have documented increasing anxiety and deteriorating mental health as a result of Covid-19. (Photo: cnet… [+8323 chars]"}, {"source": {"id": null, "name": "Africanews English"}, "author": null, "title": "TECNO CAMON 17 to launch the all-new Android 12 through its upcoming HiOS 8.5 - Africanews English", "description": "With the public release of the much anticipated Android 12, the TECNO CAMON 17 will be amongst the first few phones to deploy the major", "url": "http://www.africanews.com/2021/10/12/tecno-camon-17-to-launch-the-all-new-android-12-through-its-upcoming-hios-8-5/", "urlToImage": "https://static.euronews.com/articles/wires/783/95/7839552/1024x538_zdkjfg.jpg?1634029221", "publishedAt": "2021-10-12T09:00:21Z", "content": "With the public release of the much anticipated Android 12, the TECNOCAMON 17 will be amongst the first few phones to deploy the major update. The update will overhaul a number of major aspects, incl… [+3536 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Sasha Planting", "title": "A hydrogen economy: Green is the new black - Daily Maverick", "description": "A new report predicts South Africa’s hydrogen economy could add between $3.9bn and $8.8bn to the country’s GDP by 2050. Not to mention thousands of jobs.", "url": "https://www.dailymaverick.co.za/article/2021-10-11-a-hydrogen-economy-green-is-the-new-black/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/10/BM-Sasha-greenhydrogen-subbedmv.jpeg", "publishedAt": "2021-10-11T19:07:27Z", "content": "(Image: Adobe Stock) \r\nSolar panels, wind turbines and lithium-ion batteries are setting the world on course towards a clean energy future. But to accelerate the pace of change and avert a climate ca… [+5976 chars]"}, {"source": {"id": null, "name": "INSIDER"}, "author": "Cheryl Teh", "title": "A real-life 'Squid Game' is being organised in Abu Dhabi - Business Insider South Africa", "description": "Fortunately, the games won't involve violent player eliminations. Unfortuantely, they won't involve millions in prize money either.", "url": "https://www.insider.com/real-life-squid-game-is-being-organized-in-abu-dhabi-2021-10", "urlToImage": "https://i.insider.com/6163b3e35ae4fe0018a7565a?width=1200&format=jpeg", "publishedAt": "2021-10-11T04:51:10Z", "content": "Fans of the wildly popular \"Squid Game\" series on \r\n Netflix in Abu Dhabi will be given a chance to experience a real-life \"Squid Game,\" sans the murder and bloodshed. \r\nThe Korean Cultural Center in… [+2840 chars]"}]}