{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "news24", "name": "News24"}, "author": null, "title": "DEVELOPING | South Africa deluge easing but flood emergency lingers - News24", "description": "Relief efforts are underway in KwaZulu-Natal where the current death toll from the recent floods has climbed to nearly 400. Concerned citizens have been urged to donate funds and supplies to reputable organisations for distribution to those in need.", "url": "https://www.news24.com/news24/southafrica/news/live-rain-flooding-hit-kwazulu-natal-20220412", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3081/21af1c335baa4cb1ae75ecffeeb6a846.jpg", "publishedAt": "2022-04-17T22:40:43Z", "content": "UPDATE BY KZN HEALTH MEC NOMAGUGU SIMELANE\r\nThe torrential rains that have ravaged parts of KwaZulu-Natal, leaving almost 400 people dead and thousands homeless, have also caused substantial damage t… [+3351 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "IPL 2022, GT vs CSK Report: David Miller's Unbeaten 94 Powers Gujarat Titans To Thrilling Win Over C.. - NDTV Sports", "description": "IPL 2022: South Africa's David Miller smashed an unbeaten 94 to lead Gujarat Titans to a thrilling three-wicket victory over holders Chennai Super Kings in the Indian Premier League on Sunday.", "url": "https://sports.ndtv.com/ipl-2022/indian-premier-league-gt-vs-csk-report-david-millers-unbeaten-94-powers-gujarat-titans-to-thrilling-win-over-chennai-super-kings-2896288", "urlToImage": "https://c.ndtvimg.com/2022-04/e7jr2a9_david-miller-bcci_625x300_17_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-17T21:48:29Z", "content": "South Africa's David Miller smashed an unbeaten 94 to lead Gujarat Titans to a thrilling three-wicket victory over holders Chennai Super Kings in the Indian Premier League on Sunday. Chasing 170 for … [+1467 chars]"}, {"source": {"id": null, "name": "Ripplesnigeria.com"}, "author": "Olalekan Fakoyejo", "title": "FLUTTERWAVE: Iyinoluwa Aboyeji hints on probe against Olugbenga Agboola - Ripples Nigeria", "description": "Flutterwave co-founder, Iyinoluwa Aboyeji, said he was horrified by the allegations against the current Chief Executive Officer of the African unicorn, Olugbenga Agboola, a day after confirming he deceived him in the creation of the firm. Aboyeji in a stateme…", "url": "https://www.ripplesnigeria.com/flutterwave-iyinoluwa-aboyeji-hints-on-probe-against-olugbenga-agboola/", "urlToImage": "https://i0.wp.com/www.ripplesnigeria.com/wp-content/uploads/2018/04/Iyinoluwa-Aboyeji.jpg?resize=640%2C350&ssl=1", "publishedAt": "2022-04-17T19:51:53Z", "content": "Flutterwave co-founder, Iyinoluwa Aboyeji, said he was horrified by the allegations against the current Chief Executive Officer of the African unicorn, Olugbenga Agboola, a day after confirming he de… [+1791 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "facebook.com/Soccerzela", "title": "Orlando Pirates vs Simba SC: LIVE scores and updates! - The South African", "description": "Follow all of the live action from this evening's crunch CAF Confederation Cup clash between Orlando Pirates and Simba SC below", "url": "https://www.thesouthafrican.com/sport/soccer/caf-champions-league/orlando-pirates-simba-sc-live-scores-live-updates-live-stream-commentary-highlights-tv-channel-supersport-sabc-sunday-17-april-2022-breaking-result-exclusive-trending/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/12/Bandile-Shandu-Orlando-Pirates-starting-XI-scaled.jpg", "publishedAt": "2022-04-17T15:33:13Z", "content": "Orlando Pirates return to CAF Confederation Cup action when they travel to the Benjamin Mkapa stadium in Tanzania to face Simba SC in a crucial quarter-final first leg clash.\r\nREAD: Watch Furious Pit… [+2125 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "https://www.facebook.com/garrin.lambley", "title": "Two Oceans Marathon result: Golden girl Gerda Steyn SMASHES record - The South African", "description": "Gerda Steyn claimed a spectacular record-breaking third consecutive Two Oceans Marathon title in Cape Town on Sunday morning.", "url": "https://www.thesouthafrican.com/sport/two-oceans-marathon-result-gerda-steyn-smashes-record-breaking-latest-news-frith-van-der-merwe/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2022/04/Gerda-Steyn.jpg", "publishedAt": "2022-04-17T10:05:04Z", "content": "Gerda Steyn claimed a spectacular record-breaking third consecutiveTwo Oceans Marathon title in Cape Town on Sunday morning.\r\nREAD | TWO OCEANS HALF MARATHON RESULTS: ZIMBABWE RUNNERS DOMINATE\r\n The … [+1355 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Bronwyn McKay", "title": "WATCH | Kelly Rowland praises local dancer-choreographer Bontle Modiselle - News24", "description": "Kelly Rowland is already on her way back home after a whirlwind trip to South Africa.", "url": "https://www.news24.com/channel/gossip/news/watch-kelly-rowland-praises-local-dancer-choreographer-bontle-modiselle-20220417", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1749/555790ee86854defbc09413cde860e95.jpg", "publishedAt": "2022-04-17T08:40:45Z", "content": "Kelly Rowland is already on her way back home after a whirlwind trip to South Africa.\r\nThe former Destiny’s Child member shared photos and videos of her visit on social media on Saturday.\r\nAfter spen… [+793 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Orlando Julius, the Last of Highlife Titans Goes Home - AllAfrica - Top Africa News", "description": "One of the heroes of Nigerian music, a master of the simple, stomping riff with a significant influence on Afrobeat music, the last of Nigeria's titans in the highlife music genre, Orlando Julius simply slept into eternity. Or how best can it be described? Th…", "url": "https://allafrica.com/stories/202204160193.html", "urlToImage": "https://cdn04.allafrica.com/download/pic/main/main/csiid/00600987:816ed38611ef9d0c4c886fc83f5585d5:arc614x376:w1200.jpg", "publishedAt": "2022-04-16T13:25:28Z", "content": "One of the heroes of Nigerian music, a master of the simple, stomping riff with a significant influence on Afrobeat music, the last of Nigeria's titans in the highlife music genre, Orlando Julius sim… [+4870 chars]"}, {"source": {"id": null, "name": "CanIndia News"}, "author": null, "title": "Countries renewing efforts for wastewater analysis to detect Covid surge - CanIndia News", "description": "A slew of countries, including Australia, South Africa, New Zealand, the US and Canada, are increasingly turning towards analysing sewage water, which plays an increasingly critical role in monitoring transmission of Covid virus and its variants within commun…", "url": "https://www.canindia.com/countries-renewing-efforts-for-wastewater-analysis-to-detect-covid-surge/", "urlToImage": "https://www.canindia.com/wp-content/uploads/2022/03/imageCireplace.png", "publishedAt": "2022-04-16T11:20:05Z", "content": "A slew of countries, including Australia, South Africa, New Zealand, the US and Canada, are increasingly turning towards analysing sewage water, which plays an increasingly critical role in monitorin… [+2903 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "More rain lashes South Africa's flood ravaged east - Guardian Nigeria", "description": "South Africa's flood-ravaged east was hit by more rain Saturday after the deadliest storm to hit the country in living memory killed nearly 400 people and left tens of thousands homeless.", "url": "https://editor.guardian.ng/news/more-rain-lashes-south-africas-flood-ravaged-east/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/04/South-Africas-flood-scaled-e1650107483555.jpg", "publishedAt": "2022-04-16T11:12:00Z", "content": "South Africa’s flood-ravaged east was hit by more rain Saturday after the deadliest storm to hit the country in living memory killed nearly 400 people and left tens of thousands homeless.\r\nFloodwater… [+2364 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Andrew Thompson", "title": "Your air fryer is saving you 200% in cooking oil costs — and stores are seeing a surge in sales - Business Insider South Africa", "description": "Spiralling cooking oil prices mean deep frying now costs around R29 more per meal than if you just joined the masses and bought an air fryer.", "url": "https://www.businessinsider.co.za/air-fryer-oil-saving-surge-in-sales-at-retailers-2022-4", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2845/9385d5e84eab49e38da58e0ffa611c1d.jpg", "publishedAt": "2022-04-16T08:02:50Z", "content": "<ul><li>Air fryers are now a global industry worth over R13 billion.</li><li>Although they don't exactly need a boost, South African retailers are reporting a new surge in their popularity.</li><li>T… [+5280 chars]"}, {"source": {"id": null, "name": "Ntd.com"}, "author": null, "title": "Powerful Space Laser Detected by South African Telescope - NTD News", "description": "Astronomers have detected a powerful radiowave laser, known as a megamaser, in space. This record-breaking megamaser is the ...", "url": "https://www.ntd.com/powerful-space-laser-detected-by-south-african-telescope_766740.html", "urlToImage": "https://img.ntd.com/assets/uploads/2022/04/Space-Megamaser.jpg", "publishedAt": "2022-04-16T07:51:55Z", "content": "Astronomers have detected a powerful radiowave laser, known as a megamaser, in space.\r\nThis record-breaking megamaser is the most distant one ever observed at 5 billion light-years away from Earth.\r\n… [+2627 chars]"}]}