{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Maggie Fox, CNN", "title": "Omicron coronavirus variant partly evades Pfizer vaccine's protection, study shows - CNN", "description": "The Omicron coronavirus variant partly escapes the protection offered by the Pfizer vaccine, but people who have been previously infected and then vaccinated are likely to be well protected, researchers working in South Africa reported Tuesday.", "url": "https://www.cnn.com/2021/12/07/health/omicron-variant-pfizer-vaccine-south-africa-study/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211207174255-pfizer-vaccine-south-africa-113021-restricted-super-tease.jpg", "publishedAt": "2021-12-08T19:06:00Z", "content": "(CNN)The Omicron coronavirus variant partly escapes the protection offered by the Pfizer vaccine, but people who have been previously infected and then vaccinated are likely to be well protected, res… [+4043 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "5 in-demand tech jobs in South Africa – including one with an average salary of R868,000 - BusinessTech", "description": "As the school year draws to a close, many matriculants are wondering what to study next year. Riaz Moola, CEO at HyperionDev lists his top five tech careers for matriculants to consider pursuing studying for in 2022.", "url": "https://businesstech.co.za/news/cloud-hosting/544980/5-in-demand-tech-jobs-in-south-africa-including-one-with-an-average-salary-of-r868000/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/11/DeveloperJob-e1637215102752.jpeg", "publishedAt": "2021-12-08T15:00:00Z", "content": "With close to 900,000 matric students having completed their final exams, it is vital for them to start planning for their future. As with any career, students need to bear in mind how likely it is t… [+6250 chars]"}, {"source": {"id": null, "name": "The South African"}, "author": "https://www.facebook.com/profile.php?id=100004380495265", "title": "SAFA issue strong warning to Kaizer Chiefs and the PSL - The South African", "description": "SAFA have issued a stern warning to Kaizer Chiefs and the PSL amidst their recent NO SHOW and silence.", "url": "https://www.thesouthafrican.com/sport/soccer/psl-south-africa/safa-issue-strong-warning-to-kaizer-chiefs-and-the-psl/", "urlToImage": "http://www.thesouthafrican.com/wp-content/uploads/2021/12/fnb-stadium-1.jpg", "publishedAt": "2021-12-08T13:33:53Z", "content": "SAFA has issued a stern warning to Kaizer Chiefs and the PSL amidst their recent NO SHOW and silence.\r\nREAD |BAFANA BAFANA NOT DONE YET! SAFA PRESIDENT DANNY JORDAAN REVEALS LATEST PLANS TO TAKE ON F… [+1317 chars]"}, {"source": {"id": null, "name": "Media Update"}, "author": "Media Update", "title": "SHAREit ranked as a leading global media publisher - Media Update", "description": "SHAREit has announced that it has seen explosive growth, and has ranked fourth globally after Google, Facebook and TikTok in the AppsFlyer non-gaming Retention and IAP Index report across all categories. In Africa, the app has placed eighth in the Gaming cate…", "url": "https://www.mediaupdate.co.za/social/151341/shareit-ranked-as-a-leading-global-media-publisher", "urlToImage": "https://dash.mediaupdate.co.za/story/image/151341/151341.jpg?v=637745866007840525", "publishedAt": "2021-12-08T13:00:00Z", "content": "The app says that the proposition to share files and games without using costly data has ensured its popularity in South Africa. It has around 20 million monthly active users. SHAREit's Game Centre h… [+1562 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "ANC plans to introduce land expropriation in South Africa without Constitution change: minister - BusinessTech", "description": "South Africa’s ruling party has scrapped plans to change the constitution to make it easier for the state to take land without paying for it after failing to secure sufficient backing from the opposition and will now resort to using regular legislation to fac…", "url": "https://businesstech.co.za/news/property/545192/anc-plans-to-introduce-land-expropriation-in-south-africa-without-constitution-change-minister/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/01/Mr-Ronald-Ozzy-Lamola-Minister-of-Justice-and-Correctional-Services-3.jpg", "publishedAt": "2021-12-08T10:42:41Z", "content": "South Africas ruling party has scrapped plans to change the constitution to make it easier for the state to take land without paying for it after failing to secure sufficient backing from the opposit… [+1974 chars]"}, {"source": {"id": null, "name": "Daily Sun"}, "author": "Rapheal", "title": "WHO confirms reduction in HIV/AIDS infections, deaths in Africa – The Sun Nigeria - Daily Sun", "description": "From Fred Ezeh, Abuja World Health Organization (WHO) admitted, yesterday, that Africa has made significant progress against HIV/AIDS over the", "url": "https://www.sunnewsonline.com/who-confirms-reduction-in-hiv-aids-infections-deaths-in-africa/", "urlToImage": "https://sunnewsonline.com/wp-content/uploads/2020/04/ap_who_world_health_organization.jpg", "publishedAt": "2021-12-08T04:46:36Z", "content": "From Fred Ezeh, Abuja\r\nWorld Health Organization (WHO) admitted, yesterday, that Africa has made significant progress against HIV/AIDS over the past decade, reducing new infections by 43 percent and … [+1295 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Mia Malan for the Bhekisisa Centre for Health Journalism", "title": "BHEKISISA OP-ED: The joke's on us, South Africa. The cruel logic of Omicron travel bans — debunked - Daily Maverick", "description": "Wealthy nations were quick to ban southern African nations from entering their borders when the Omicron variant of Covid-19 was identified — but not against each other. Unfortunately, this type of discrimination is nothing new.", "url": "https://www.dailymaverick.co.za/article/2021-12-07-the-jokes-on-us-south-africa-the-cruel-logic-of-omicron-travel-bans-debunked/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2021/12/MC-Travel-Bhekisisa.jpg?w=1280", "publishedAt": "2021-12-07T19:17:02Z", "content": "Last week, on a late afternoon, panic consumed Tulio de Oliveira, who led the team of South African scientists that identified the new Omicron Covid variant in the county two weeks ago.  \r\nHe was rap… [+10070 chars]"}]}