{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy", "title": "Xi Jinping had one message for dozens of visiting African leaders: choose China - CNN", "description": "Xi Jinping had a clear aim as he hosted delegates from more than 50 African countries for a major summit in Beijing this week: proving beyond doubt that China is the continent’s premier foreign partner.", "url": "https://www.cnn.com/2024/09/06/china/china-africa-us-xi-jinping-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2169623340.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2024-09-07T01:35:00Z", "content": "Xi Jinping had a clear aim as he hosted delegates from more than 50 African countries for a major summit in Beijing this week: proving beyond doubt that China is the continents premier foreign partne… [+8115 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "MONIKA PRONCZUK", "title": "WHO and Africa CDC launch a response plan to the mpox outbreak - The Associated Press", "description": "The Africa Center for Disease Control and Prevention and the World Health Organization have launched a continent-wide response plan to the outbreak of mpox. The plan was launched on Friday. It came three weeks after WHO declared mpox outbreaks in 12 African c…", "url": "https://apnews.com/article/mpox-response-plan-africa-cdc-who-vaccines-3cc38727dc1f546f43d80b72b0277c6d", "urlToImage": "https://dims.apnews.com/dims4/default/99b8a99/2147483647/strip/true/crop/9504x5346+0+495/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F6a%2Fcb%2F4804d5b72a2028fe78911bcbd1f6%2Ff5d811d2ce6f40bea8c120e9b7e713ed", "publishedAt": "2024-09-06T16:54:00Z", "content": "DAKAR, Senegal (AP) The Africa Center for Disease Control and Prevention and the World Health Organization launched on Friday a continent-wide response plan to the outbreak of mpox, three weeks after… [+2912 chars]"}]}