{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "The Role Of Palm Trees In Shaping African Society - Guardian Nigeria", "description": "The sacredness of the palm tree spreads to its edible and non-edible parts while the roots of palm trees are used to ward off evil spirits", "url": "https://guardian.ng/life/the-role-of-palm-trees-in-shaping-african-society/", "urlToImage": "https://guardian.ng/wp-content/uploads/2022/03/Atlas-Obscura.jpg", "publishedAt": "2022-03-21T12:40:00Z", "content": "Man usually builds relationships with people but also the environment with things around, such as the intimate relationship with the palm tree.The sacredness of the palm tree spreads to its edible an… [+3348 chars]"}, {"source": {"id": null, "name": "Thecable.ng"}, "author": "by  Vivian Chime", "title": "Climate Watch: African countries to demand continued use of fossil fuel at COP27 - TheCable", "description": "Despite directly impacting our communities, health and livelihood, climate-related reports usually take a back seat to dominant news beats like politics and business. Climate Watch aims to ensure you never", "url": "https://www.thecable.ng/climate-watch-african-countries-to-demand-continued-use-of-fossil-fuel-at-cop27", "urlToImage": "https://f5p3e9e4.stackpathcdn.com/wp-content/uploads/2021/11/COP26.jpg", "publishedAt": "2022-03-21T10:38:00Z", "content": "Despite directly impacting our communities, health and livelihood, climate-related reports usually take a back seat to dominant news beats like politics and business. Climate Watch aims to ensure you… [+2903 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "AMVCA: 2022 Africa Magic Awards Nominees don land- See who dey list - BBC.com", "description": "Africa Magic Viewers' Choice Awards wey be like Africa version of Oscar, dey celebrate di work and talent of pipo wey dey di film industry.", "url": "https://www.bbc.com/pidgin/tori-60818021", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_pidgin/CE48/production/_123780825_untitleddesign.png", "publishedAt": "2022-03-21T07:37:10Z", "content": "Wia dis foto come from, Instagram @nacyisime @funkeakindele \r\nAfrica Magic Viewers' Choice Awards (AMVCA) wey be like Africa version of Oscar don release full list of nominees for di 2022 edition.\r\nA… [+12408 chars]"}, {"source": {"id": null, "name": "Cgtn.com"}, "author": null, "title": "Polio vaccine campaign to begin in East and Southern Africa countries - cgtn.com", "description": "More than nine million children will be vaccinated against the poliovirus in the first round", "url": "https://africa.cgtn.com/2022/03/20/polio-vaccine-campaign-to-begin-in-east-and-southern-africa-countries/", "urlToImage": "https://africa.cgtn.com/wp-content/photo-gallery/2020/11/gettyimages-536201604-594x594.jpg", "publishedAt": "2022-03-20T20:19:53Z", "content": "Nurse Agnes from the Bwindi Community Hospital administers a Polio vaccination during a Polio and Measles vaccination program for newborn children in the community.(Photo via Getty Images)\r\nMore than… [+1548 chars]"}, {"source": {"id": null, "name": "Daily Maverick"}, "author": "Malibongwe Tyilo", "title": "SATIRICALLY SPEAKING: Dearest Ma'am Bathabile Dlamini – Stay strong, you are not alone, ThugLife chose you - Daily Maverick", "description": "I urge all South Africans to join me and reach into our bottomless well of ubuntu, and let former minister Bathabile Dlamini know that she is not alone during these testing times.", "url": "https://www.dailymaverick.co.za/article/2022-03-20-maam-bathabile-dlamini-stay-strong-you-are-not-alone/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/0000249302-e1647797884522.jpeg?w=1280", "publishedAt": "2022-03-20T18:03:33Z", "content": "Dearest Honourable Bathabile Olive Dlamini,\r\nI am so sorry that it has taken me so long to write to you. Although you and I may not be personally acquainted, the spirit of ubuntu that burns in my hea… [+6645 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Kenya Has a Yellow Fever Outbreak - How to Deal With It - AllAfrica - Top Africa News", "description": "Analysis - On 5 March 2022, Kenya declared an outbreak of yellow fever in Isiolo County after the death of three people. More than 20 people were reported to have contracted the deadly viral disease in Isiolo in the previous month. Counties bordering Isiolo w…", "url": "https://allafrica.com/stories/202203200191.html", "urlToImage": "https://cdn07.allafrica.com/download/pic/main/main/csiid/00501146:ad16f79b51e7a5b93558fa3d874bc900:arc614x376:w1200.jpg", "publishedAt": "2022-03-20T17:27:37Z", "content": "On 5 March 2022, Kenya declared an outbreak of yellow fever in Isiolo County after the death of three people. More than 20 people were reported to have contracted the deadly viral disease in Isiolo i… [+6383 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South African court suspends building at new Amazon Africa site - BusinessTech", "description": "South Africa’s High Court has temporarily halted the construction of Amazon.com Inc’s planned new Africa headquarters in Cape Town and ordered the company to consult with indigenous people who say the site is sacred land.", "url": "https://businesstech.co.za/news/cloud-hosting/569902/south-african-court-suspends-building-at-new-amazon-africa-site/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/04/Amazon.png", "publishedAt": "2022-03-20T11:18:52Z", "content": "South Africas High Court has temporarily halted the construction of Amazon.com Incs planned new Africa headquarters in Cape Town and ordered the company to consult with indigenous people who say the … [+1510 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "TransUnion faces R10-million fine for hack - MyBroadband", "description": "Credit bureau TransUnion could be slapped with a R10-million fine after it suffered a data breach that supposedly compromised the personal information of millions of South Africans.", "url": "https://mybroadband.co.za/news/security/438098-transunion-faces-r10-million-fine-for-hack.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2022/03/TransUnion-hack-new-.jpg", "publishedAt": "2022-03-20T07:01:40Z", "content": "Credit bureau TransUnion could be slapped with a R10-million fine after it suffered a data breach that compromised the personal information of millions of South Africans, the Information Regulator of… [+3784 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": null, "title": "Google's African internet cable is heading to SA. First stop: Togo - News24", "description": "The West African country will be the first landing of the ‘Equiano’ cable, which will run from Portugal to South Africa.", "url": "https://www.news24.com/fin24/companies/ict/googles-african-internet-cable-is-heading-to-sa-first-stop-togo-20220320", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3779/431cdeca813e4c57bd56abcc1c14c6be.jpg", "publishedAt": "2022-03-20T02:11:44Z", "content": "The West African country of Togo will be the first landing of a new Google undersea connected to Europe, in what the tech giant and the Togolese government have hailed as a “major digital infrastruct… [+2650 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "The cheapest new cars you can buy in South Africa from every major brand - BusinessTech", "description": "Here is a list of roughly every major car brands cheapest car in South Africa", "url": "https://businesstech.co.za/news/motoring/569518/the-cheapest-new-cars-you-can-buy-in-south-africa-from-every-major-brand/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2022/03/Mercedes-e1647695410386.png", "publishedAt": "2022-03-19T15:31:06Z", "content": "President Cyril Ramaphosa says he has established a Committee of Ministers to assess the impact that the conflict in Ukraine will have on food and fuel prices.\r\nThe president said this when he respon… [+4695 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Ahmed Areff", "title": "Don’t panic, the Ukraine war is not going to leave SA with food shortages, govt says - News24", "description": "Agriculture, Land Reform and Rural Development Minister Thoko Didiza said South Africans don’t need to panic about any impending food shortages in the wake of Russia’s invasion of Ukraine because there is currently enough supplies locally", "url": "https://www.news24.com/fin24/economy/dont-panic-the-ukraine-war-is-not-going-to-leave-sa-with-food-shortages-govt-says-20220319", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/119/ce47e35c614c4c2ca0e45900a51172e4.jpg", "publishedAt": "2022-03-19T14:00:37Z", "content": "The government says South Africans don’t\r\nneed to panic about any impending food shortages in the wake of Russia’s invasion\r\nof Ukraine because there is currently enough supplies locally.\r\n\"We have g… [+1558 chars]"}]}