{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Kenya: Funding Cuts Threaten HIV/Aids Treatment Efforts - AllAfrica.com", "description": "HIV positive people fear losing access to free treatment services as Kenya coasts towards a crisis while donor funding declines amid insufficient domestic funds, reveals a NationNewsplex review of HIV financing.", "url": "https://allafrica.com/stories/202107060673.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-07-06T12:20:20Z", "content": "HIV positive people fear losing access to free treatment services as Kenya coasts towards a crisis while donor funding declines amid insufficient domestic funds, reveals a NationNewsplex review of HI… [+6526 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "South Africa will now offer Covid-19 vaccines to some people under 50 – what you should know - BusinessTech", "description": "The Department of Health says it will offer Covid-19 vaccines to some South Africans, even if they don’t meet the current criteria of being aged 50 years or older.", "url": "https://businesstech.co.za/news/government/503697/south-africa-will-now-offer-covid-19-vaccines-to-some-people-under-50-what-you-should-know/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/02/Ramaphosa-vaccine.png", "publishedAt": "2021-07-06T11:16:03Z", "content": "The Department of Health says it will offer Covid-19 vaccines to some South Africans even if they don’t meet the current criteria of being aged 50 years or older.\r\nIn a circular published this week, … [+2646 chars]"}, {"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Sikiru Obarayese", "title": "PIB: North constituting threat to Nigeria’s corporate existence – ADAPHAI - Daily Post Nigeria", "description": "An NGO, Advocacy for Advancement of Peace and Harmony in Africa Initiative (ADAPHAI) has raised the alarm over what it termed a divisive tendency of the Northern region of Nigeria. The group, through a press statement signed by it's National Coordinator, Comr…", "url": "https://dailypost.ng/2021/07/06/pib-north-constituting-threat-to-nigerias-corporate-existence-adaphai/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2021/01/ADAPHAI.jpg", "publishedAt": "2021-07-06T09:54:55Z", "content": "An NGO, Advocacy for Advancement of Peace and Harmony in Africa Initiative (ADAPHAI) has raised the alarm over what it termed a divisive tendency of the Northern region of Nigeria.\r\nThe group, throug… [+3048 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Sport24 staff", "title": "Magala ruled out as Proteas update Ireland tour squad - News24", "description": "Proteas paceman Sisanda Magala has been ruled out of South Africa's tour to Ireland with the first ODI starting this weekend.", "url": "https://www.news24.com/sport/cricket/proteas/magala-ruled-out-out-as-proteas-update-ireland-tour-squad-20210706", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/3639/9e028e070ba94732bf954a7779d1f90b.png", "publishedAt": "2021-07-06T08:06:48Z", "content": "Proteas paceman Sisanda Magala has been ruled out of South Africa's tour to Ireland with the first ODI starting on Sunday.\r\nThe Proteas come off a stellar tour of the West Indies where they claimed b… [+2113 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "Alcohol ban to be challenged in court as South Africa faces extended lockdown - BusinessTech", "description": "Vinpro, a non-profit company that represents 3,500 South African wine producers, will begin its challenge the government’s adjusted level 4 lockdown restrictions this week in a bid to have the prohibition around the sale of alcohol relaxed.", "url": "https://businesstech.co.za/news/lifestyle/503539/alcohol-ban-to-be-challenged-in-court-as-south-africa-faces-extended-lockdown/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2019/11/Wine-e1574865541144.jpeg", "publishedAt": "2021-07-06T07:23:43Z", "content": "Vinpro, a non-profit company that represents 3,500 South African wine producers, will challenge the government’s adjusted level 4 lockdown restrictions in court this week in a bid to have the prohibi… [+3394 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Nimr Screens 143000 Pregnant Women for HIV, Enrolls 7076 On Arv Treatment - AllAfrica.com", "description": "No less than 143,000 pregnant women have been screened for HIV at the Nigerian Institute for Medical Research, NIMR, Lagos, even as 7,076 out of those screened are enrolled on Antiretroviral drug treatment.", "url": "https://allafrica.com/stories/202107060325.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-07-06T07:21:17Z", "content": "No less than 143,000 pregnant women have been screened for HIV at the Nigerian Institute for Medical Research, NIMR, Lagos, even as 7,076 out of those screened are enrolled on Antiretroviral drug tre… [+2746 chars]"}, {"source": {"id": null, "name": "The Nation Newspaper "}, "author": "https://www.facebook.com/amokeoja.oluwatemitomisin/", "title": "Wanted: Uniformity in ground handling charges - The Nation Newspaper ", "description": "Charges for ground handling for foreign carriers are the lowest in the West African sub region. This disparity has led to complaints by ope...", "url": "https://thenationonlineng.net/wanted-uniformity-in-ground-handling-charges/", "urlToImage": "https://thenationonlineng.net/wp-content/uploads/2021/07/aviation-players.png", "publishedAt": "2021-07-06T06:54:13Z", "content": "Charges for ground handling for foreign carriers are the lowest in the West African sub region. This disparity has led to complaints by operators who insist that their inability to collect cost-refle… [+18808 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Bashiera Parker (@bparks_)", "title": "Princess Charlene tells us as she recovers in SA: 'It's been a trying time for me' - News24", "description": "Princess Charlene on Monaco tells us: \"I miss my husband and children dearly,\" as she continues to recover in South Africa after contracting an infection.", "url": "https://www.news24.com/channel/gossip/royal-news/princess-charlene-tells-us-as-she-recovers-in-sa-its-been-a-trying-time-for-me-20210706-2", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11213/6fa9a048e7394b35a5fa5367de50c015.jpg", "publishedAt": "2021-07-06T05:41:02Z", "content": "<ul><li>Princess Charlene on Monaco tells us: \"I miss my husband and children dearly,\" as she continues to recover in South Africa.</li><li>The princess underwent multiple procedures after contractin… [+2722 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "TAKE A LOOK | SA's first electric bus has started carrying passengers - Business Insider South Africa", "description": "Golden Arrow’s electric bus was officially launched in Cape Town on Monday.", "url": "https://www.businessinsider.co.za/first-electric-bus-in-south-africa-from-golden-arrow-2021-7", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11334/5196e9567ab34b57bd48f4cce48d5d5f.jpg", "publishedAt": "2021-07-06T05:22:18Z", "content": "<ul><li>The 160-year-old Golden Arrow Bus Services has introduced two new electric busses to its fleet in Cape Town.</li><li>These are the first fully electric busses in South Africa to transport pas… [+2933 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Suspense as South African police await new orders on Zuma's arrest - Guardian Nigeria", "description": "South Africa's police minister on Monday said he was awaiting court instructions on whether to arrest ex-president Jacob Zuma, who has been given a 15-month jail term for contempt.", "url": "https://guardian.ng/news/suspense-as-south-african-police-await-new-orders-on-zumas-arrest/", "urlToImage": "https://guardian.ng/wp-content/uploads/2021/07/Jacob-Zuma-1.jpg", "publishedAt": "2021-07-05T14:33:00Z", "content": "Former South African president Jacob Zuma addresses the media in his home in Nkandla, KwaZulu-Natal on July 4, 2021. – South Africa’s former president Jacob Zuma, ordered to surrender himself to star… [+4643 chars]"}, {"source": {"id": null, "name": "GCR"}, "author": null, "title": "After 30 years of planning, work begins on €1.3bn radio telescope in South Africa and Australia - News - GCR - GCR", "description": "South Africa’s National Research Foundation and the South African Radio Astronomy Observatory jointly announced last ......", "url": "https://www.globalconstructionreview.com/news/after-30-years-planning-work-begins-13bn-radio-tel/", "urlToImage": "http://www.globalconstructionreview.com/client_media/images/ska.jpg", "publishedAt": "2021-07-05T11:44:17Z", "content": "South Africa’s National Research Foundation and the South African Radio Astronomy Observatory jointly announced last week that work was about to begin on a €1.3bn project to build the world’s largest… [+1823 chars]"}]}