{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Daily Post Nigeria"}, "author": "Seun Opejobi", "title": "US African Leaders Summit: Why Nigeria should be admitted to G-20 – Jack-Rich - Daily Post Nigeria", "description": "A former All Progressives Congress, APC, presidential aspirant, Tein Jack-Rich, has appealed for admission of Nigeria into the G-20 economic group. Jack-Rich made the appeal during the US Africa Leaders Summit in Washington DC. He noted that the inclusion of …", "url": "https://dailypost.ng/2022/12/21/us-african-leaders-summit-why-nigeria-should-be-admitted-to-g-20-jack-rich/", "urlToImage": "https://dailypost.ng/wp-content/uploads/2022/12/Collage-Maker-21-Dec-2022-11.00-AM.jpg", "publishedAt": "2022-12-21T10:07:23Z", "content": "A former All Progressives Congress, APC, presidential aspirant, Tein Jack-Rich, has appealed for admission of Nigeria into the G-20 economic group.\r\nJack-Rich made the appeal during the US Africa Lea… [+2291 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Chickenpox and Shingles Virus Lying Dormant in Your Neurons Can Reactivate and Increase Your Risk of Stroke - New Research Identified a Potential Culprit - AllAfrica - Top Africa News", "description": "Analysis - Over 90% of the world population has the virus that causes chickenpox lying dormant in their nervous system. Most people contract the varicella zoster virus, or VZV, when they get chickenpox as children. For around a third of these people, this sam…", "url": "https://allafrica.com/stories/202212210005.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2022-12-21T04:53:43Z", "content": "Over 90% of the world population has the virus that causes chickenpox lying dormant in their nervous system. Most people contract the varicella zoster virus, or VZV, when they get chickenpox as child… [+5030 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Consonant-like calls from orangutans provide clues to the origins of human spoken language - News-Medical.Net", "description": "New research from The University of Warwick has revealed that orangutans, the most arboreal of the great apes, produce consonant-like calls more often and of greater variety than their African ground-dwelling cousins (gorillas, bonobos and chimpanzees).", "url": "https://www.news-medical.net/news/20221220/Consonant-like-calls-from-orangutans-provide-clues-to-the-origins-of-human-spoken-language.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/5/Frontal_Portrait_of_a_Young_Chimpanzee_Relaxing_on_a_Tree_Branch-Abeselom_Zerit2_bfb49c8e60d94522a492ca5a66b84f75-620x480.jpg", "publishedAt": "2022-12-20T17:56:00Z", "content": "New research from The University of Warwick has revealed that orangutans, the most arboreal of the great apes, produce consonant-like calls more often and of greater variety than their African ground… [+4543 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": "Morgan McFall-Johnsen", "title": "NASA hasn't heard from its InSight lander in 5 days. It may have run out of power and died on Mars. - Business Insider South Africa", "description": "InSight revealed Mars's deep interior to scientists for the first time by capturing more than 1,300 Mars quakes. But the lander was struggling.", "url": "https://www.businessinsider.co.za/nasa-insight-mars-lander-mission-ending-dust-power-crisis-2022-12", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7976/4e4cbaf55e9a4248a5dccfa2f6c6eaea.jpg", "publishedAt": "2022-12-20T15:41:17Z", "content": "NASA suspects its $813 million InSight lander has succumbed to dust on the surface of the red planet, ending its four-year mission of listening to Mars quakes, dust devils, and meteor impacts.\r\nInSig… [+6848 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Carin Smith", "title": "SAA recovering some of the R1 billion in funds blocked in Zimbabwe, Nigeria | Business - News24", "description": "South African Airways still has about US$67 million (about R1.1 billion) in blocked funds owed to it, mainly in Zimbabwe and Nigeria.", "url": "https://www.news24.com/fin24/companies/saa-recovering-some-of-the-r1-billion-in-funds-blocked-in-zimbabwe-nigeria-20221220", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2326/9b8562f0a7134b6ea14353b16cea03dc.jpg", "publishedAt": "2022-12-20T02:30:35Z", "content": "South African Airways (SAA) is in the process of trying to recover about R1.1 billion in blocked funds that it has been unable to extract from Zimbabwe and Nigeria, with the help of the International… [+256 chars]"}]}