{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Daily Maverick"}, "author": "Victoria O'Regan", "title": "POWER FAILURE: 'We do apologise again,' says Eskom as South Africans grapple with Stage 4 load shedding – and a warning of Stage 6 - Daily Maverick", "description": "Stage 4 load shedding was implemented on Wednesday morning to prevent Eskom’s diesel and pump storage dam supplies from reaching ‘critically low levels’. Should it run out of diesel and water supplies, South Africans could face Stage 6 blackouts, the power ut…", "url": "https://www.dailymaverick.co.za/article/2022-03-09-we-do-apologise-again-says-eskom-as-south-africans-grapple-with-stage-4-load-shedding-and-a-warning-of-stage-6/", "urlToImage": "https://www.dailymaverick.co.za/wp-content/uploads/2022/03/OD-Tori-Loadshedding1.jpeg?w=1280", "publishedAt": "2022-03-09T19:00:04Z", "content": "Due to further failures of generation units, Eskom announcedregrettably, and with a great deal of disappointment that load shedding would intensify from Stage 2 to 4 on Wednesday. This was to preserv… [+4002 chars]"}, {"source": {"id": null, "name": "MyBroadband"}, "author": "https://www.facebook.com/mybroadband", "title": "How much money MTN made from Cell C - MyBroadband", "description": "MTN South Africa recorded a jump in wholesale revenue thanks to the national roaming agreement it has with Cell C.", "url": "https://mybroadband.co.za/news/cellular/436768-how-much-money-mtn-made-from-cell-c.html", "urlToImage": "https://mybroadband.co.za/news/wp-content/uploads/2020/10/MTN-Cell-C-Network-Share.jpg", "publishedAt": "2022-03-09T08:14:54Z", "content": "MTN released its annual results for 2021 on Wednesday, reporting 21.7% increased wholesale revenue in its South African division.\r\nThe revenue increase was supported by MTN South Africas national roa… [+1940 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Africa: Omicron Doesn't Need Its Own Custom Covid Vaccine - Here's Why - AllAfrica - Top Africa News", "description": "Analysis - The Omicron variant of the SARS-CoV-2 virus was discovered in South Africa and emerged in November 2021. Scientists have already learned a lot about Omicron. One of the key questions that remains is how well our immune systems deal with infection b…", "url": "https://allafrica.com/stories/202203080123.html", "urlToImage": "https://cdn07.allafrica.com/download/pic/main/main/csiid/00591409:c38b59adf61355052a01e30d127dc205:arc614x376:w1200.jpg", "publishedAt": "2022-03-08T07:30:22Z", "content": "The Omicron variant of the SARS-CoV-2 virus was discovered in South Africa and emerged in November 2021. Scientists have already learned a lot about Omicron. One of the key questions that remains is … [+6336 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Catherine Tomlinson", "title": "In-depth: How a Cape Town company made an mRNA vaccine and what happens next - News24", "description": "Catherine Tomlinson takes an in-depth look at how Afrigen managed to reach this point and what further challenges have to be overcome before mRNA vaccines can be produced at scale in South Africa.", "url": "https://www.news24.com/health24/medical/infectious-diseases/coronavirus/in-depth-how-a-cape-town-company-made-an-mrna-vaccine-and-what-happens-next-20220307", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11627/546a4ec0fc834a7688e852b71a4b6b60.jpg", "publishedAt": "2022-03-07T22:47:09Z", "content": "In January, Cape Town-based biotechnology company Afrigen Biologics\r\nannounced that it has successfully produced a lab-scale batch of a Covid-19\r\nvaccine that is similar to that made by pharmaceutica… [+16867 chars]"}]}