{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": null, "name": "The Punch"}, "author": "Stephen Angbulu", "title": "Africa needs visionary leadership, says Buhari - Punch Newspapers", "description": null, "url": "https://punchng.com/africa-needs-visionary-leadership-says-buhari/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2022/01/13140734/President-Muhammadu-Buhari-.jpg", "publishedAt": "2022-02-06T23:17:44Z", "content": "The President, Major General Muhammadu Buhari (retd.), has said that Africas growth and development will require strong, visionary leadership that caters to the peoples needs and effectively strength… [+2086 chars]"}, {"source": {"id": null, "name": "Espn.com.sg"}, "author": null, "title": "Senegal vs. Egypt - Football Match Report - February 7, 2022 - ESPN", "description": "Get a report of the Senegal vs. Egypt 2021 Africa Cup of Nations, Final football match.", "url": "https://www.espn.com.sg/soccer/report/_/gameId/629153", "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F0206%2Fr971010_1296x729_16%2D9.jpg", "publishedAt": "2022-02-06T22:01:06Z", "content": "Senegal defeated Egypt 4-2 on penalties in Sunday's Africa Cup of Nations final after the sides couldn't be separated over 120 minutes of scoreless football. Chelsea goalkeeper Edouard Mendy made a f… [+2417 chars]"}, {"source": {"id": null, "name": "BusinessWorld Online"}, "author": null, "title": "Agriculture companies sign up for post-ASF hog repopulation - BusinessWorld Online", "description": "THE Department of Agriculture (DA) said it has signed a partnership agreement with private companies seeking to participate in the hog repopulation effort following the reduction of the herd due to the outbreak of African Swine Fever (ASF).", "url": "https://www.bworldonline.com/agriculture-companies-sign-up-for-post-asf-hog-repopulation/", "urlToImage": "https://www.bworldonline.com/wp-content/uploads/2021/05/pig-farm-061118.jpg", "publishedAt": "2022-02-06T16:01:04Z", "content": "THE Department of Agriculture (DA) said it has signed a partnership agreement with private companies seeking to participate in the hog repopulation effort following the reduction of the herd due to t… [+1623 chars]"}, {"source": {"id": null, "name": "WFUV News"}, "author": null, "title": "Drug-resistant malaria is emerging in Africa. Doctors are worried — yet hopeful - WFUV News", "description": "In June 2017, Betty Balikagala traveled to a hospital in Gulu District in northern Uganda. It was the rainy season: a peak time for malaria transmission. Balikagala, a researcher at Juntendo University in Japan, was back in her home country to hunt for", "url": "https://wfuv.org/content/drug-resistant-malaria-emerging-africa-doctors-are-worried-—-yet-hopeful", "urlToImage": null, "publishedAt": "2022-02-06T14:33:50Z", "content": "In June 2017, Betty Balikagala traveled to a hospital in Gulu District in northern Uganda. It was the rainy season: a peak time for malaria transmission. Balikagala, a researcher at Juntendo Universi… [+14601 chars]"}, {"source": {"id": null, "name": "The Punch"}, "author": "Agency Report", "title": "African Union condemns coups, dodges Israel vote - Punch Newspapers", "description": "The African Union has condemned a recent \"wave\" of military coups that has seen an unprecedented number of member states suspended", "url": "https://punchng.com/african-union-condemns-coups-dodges-israel-vote/", "urlToImage": "https://cdn.punchng.com/wp-content/uploads/2018/11/23172936/African-Union-Hq.jpg", "publishedAt": "2022-02-06T14:09:21Z", "content": "The African Union has condemned a recent “wave” of military coups that has seen an unprecedented number of member states suspended from the bloc, a senior official said Sunday, the last day of its an… [+4266 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "How South Africa's electricity price compares to those around the world - Business Insider South Africa", "description": "Believe it or not, our price isn't too bad - even though it's more expensive than what  neighbouring countries pay.", "url": "https://www.businessinsider.co.za/how-south-africas-electricity-price-compares-to-other-countries-around-the-world-2022-2", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/10653/d2e7129d137e432fa639c3ebb44b1e28.jpg", "publishedAt": "2022-02-06T13:50:10Z", "content": "<ul><li>If Eskom has its way, South Africans will soon need to fork up a lot more for electricity.</li><li>But even if they receive the requested 20.5% increase, the country's electricity price is av… [+3206 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Compiled by Nicole McCain", "title": "Appointing a female Chief Justice will be a progressive move - Black Business Council - News24", "description": "The Black Business Council has thrown its weight behind a recommendation that Supreme Court of Appeal president Judge Mandisa Maya be appointed as the next Chief Justice of South Africa.", "url": "https://www.news24.com/news24/southafrica/news/appointing-a-female-chief-justice-will-be-a-progressive-move-black-business-council-20220206", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1543/b2a9e4e8212c4ef58c84a318e6d598db.jpg", "publishedAt": "2022-02-06T13:15:29Z", "content": "<ul><li>The Black Business Council has supported a recommendation for the appointment of a woman Chief Justice.</li><li>The Judicial Service Commission has recommended SCA president Judge Mandisa May… [+2046 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Jan Gerber", "title": "Africa is not responsible for climate change but bears the brunt of it - President Cyril Ramaphosa - News24", "description": "Although they are not responsible for causing climate change, Africans are the ones who are bearing the brunt and the cost of the phenomenon, says President Cyril Ramaphosa.", "url": "https://www.news24.com/news24/southafrica/news/africa-is-not-responsible-for-climate-change-but-bears-the-brunt-of-it-president-cyril-ramaphosa-20220206", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/1897/964f5aea7e534c99a3654929b1d03ca6.jpg", "publishedAt": "2022-02-06T10:35:42Z", "content": "<ul><li>Africans are bearing the brunt of climate change, says President Cyril Ramaphosa. </li><li>He says the financial flows to developing countries are inadequate.</li><li>According to Ramaphosa, … [+2244 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "How much money you need to have saved for retirement based on your age - BusinessTech", "description": "Historically, South Africans have been poor savers. However, the onset of the pandemic, coupled with a historical economic downturn has placed the importance of saving under the spotlight. And for some South Africans, this reality hit home, says Nirdev Desai,…", "url": "https://businesstech.co.za/news/finance/554926/how-much-money-you-need-to-have-saved-for-retirement-based-on-your-age/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2018/02/South-Africa-rand-money-01.png", "publishedAt": "2022-02-06T05:01:59Z", "content": "Historically, South Africans have been poor savers. However, the onset of the pandemic, coupled with a historical economic downturn has placed the importance of saving under the spotlight. And for so… [+6390 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Lenin Ndebele", "title": "AU calls for permanent seats on UN Security Council - News24", "description": "Prime Minister Abiy Ahmed of Ethiopia has called for Africa to be given a bigger role in the UN, especially on the Security Council where peace and security matters are handled.", "url": "https://www.news24.com/news24/africa/news/au-calls-for-permanent-seats-on-un-security-council-20220205", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/2872/7960ce05d04c4108a30753d7f2ada9c4.jpg", "publishedAt": "2022-02-05T18:18:59Z", "content": "<ul><li>The African Union (AU) says Africa's voice on the world stage needs to be heard loud and clear.</li><li>The AU is demanding at least two permanent and five non-permanent seats on the Security… [+2653 chars]"}, {"source": {"id": "business-insider", "name": "Business Insider"}, "author": null, "title": "Teen who runs Twitter account tracking Elon Musk's private jet rejects offer of free Tesla to delete it - Business Insider South Africa", "description": "Jack Sweeney told Elon Musk he'd accept a free Tesla to delete the account. But on Friday, Sweeney rejected an offer of a free Tesla for three years.", "url": "https://www.businessinsider.com/elon-musk-private-jet-tracking-twitter-turns-down-free-tesla-2022-2", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/2869/c2d7aae41bea42fbabb1a9ddf384c9e9.jpg", "publishedAt": "2022-02-05T12:35:57Z", "content": "A 19-year-old famous for his Twitter account that tracks Elon Musk's private jet was on Friday offered a free Tesla to delete it – but rejected the offer.\r\nJack Sweeney had said previously that he'd … [+1672 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Alex Mitchley", "title": "Covid-19: Fifth wave of infections expected as SA approaches winter - News24", "description": "Health Minister Joe Phaahla says he believes that as the country moves closer to winter, there will be an expectation of a fifth wave of Covid-19 infections. South Africa has officially reached the end of the fourth wave.", "url": "https://www.news24.com/news24/southafrica/news/covid-19-fifth-wave-of-infections-expected-as-sa-approaches-winter-20220205", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/645/0382bc58197441e6baf5d072c1f252a6.jpg", "publishedAt": "2022-02-05T06:01:41Z", "content": "<ul><li>During a briefing on Friday, Health Minister Joe Phaahla spoke about the country entering a fifth wave of SARS-CoV-2 later this year. </li><li>Phaahla said there was an expectation that as th… [+4043 chars]"}, {"source": {"id": null, "name": "Guardian Nigeria"}, "author": null, "title": "Coca-Cola HBC launches global sustainability challenge, targets startups - Guardian Nigeria", "description": "Breaking Nigerian News - Leading Nigeria Newspaper - Top News from Nigeria, Africa and the world", "url": "https://editor.guardian.ng/", "urlToImage": "https://guardian.ng/wp-content/themes/guardian2021/img/facebook_gdn_banner.png", "publishedAt": "2022-02-05T03:03:00Z", "content": "Get the latest news and analysis of issues from Nigeria, Africa and around the world, direct into your inbox, daily"}]}