{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "business-insider", "name": "Business Insider"}, "author": "Avery Hartmans", "title": "It looks like Tim Cook may have taken a field trip ahead of the iPhone 13 reveal - Business Insider South Africa", "description": "\"Good morning from somewhere a little different this time,\" Apple CEO Tim Cook tweeted ahead of Tuesday's iPhone event.", "url": "https://www.businessinsider.com/apple-event-tim-cook-teases-iphone-13-joshua-tree-photo-2021-9", "urlToImage": "https://i.insider.com/6140b15b3dd24f0019c335d7?width=1200&format=jpeg", "publishedAt": "2021-09-14T16:28:22Z", "content": "It appears that Apple took a little field trip to prepare for the debut of the latest iPhone. \r\nApple CEO Tim Cook tweeted on Tuesday morning that he's \"somewhere a little different this time,\" along… [+1638 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "WHO-backed vaccine hub for Africa to copy Moderna COVID-19 shot - Al Jazeera English", "description": "WHO official says stalled talks between tech transfer hub and US company could slow project to produce shots for Africa.", "url": "https://www.aljazeera.com/news/2021/9/14/who-backed-vaccine-hub-for-africa-to-copy-moderna-covid-19-shot", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2021/09/000_9MH7BG.jpg?resize=1200%2C630", "publishedAt": "2021-09-14T16:04:47Z", "content": "Efforts to develop an African base for COVID-19 vaccine production will focus on trying to replicate Modernas shot, but a lack of progress in talks with the US company mean the project will take time… [+4117 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Rahul Singh", "title": "Central Vista revamp: 7,000 defence ministry officials to move to new offices - Hindustan Times", "description": "More than 7,000 defence ministry officers and staff are set to move into brand new offices at Africa Avenue and Kasturba Gandhi Marg from their existing decades-old workplaces in a clutch of pre-Independence era hutments in the vicinity of the North and South…", "url": "https://www.hindustantimes.com/india-news/central-vista-revamp-7-000-defence-ministry-officials-to-move-to-new-offices-101631631338663.html", "urlToImage": "https://images.hindustantimes.com/img/2021/09/14/1600x900/89ea59aa-156b-11ec-a13e-d4a68f9db710_1631631335258.png", "publishedAt": "2021-09-14T14:55:38Z", "content": "More than 7,000 defence ministry officers and staff are set to move into brand new offices at Africa Avenue and Kasturba Gandhi Marg from their existing decades-old workplaces in a clutch of pre-Inde… [+2688 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "South Sudan Receives Its First Consignment of Johnson & Johnson Covid-19 Vaccines Through the Covax Facility - AllAfrica - Top Africa News", "description": "South Sudan received its first consignment of 152,950 doses of the Johnson & Johnson 'Janssen' COVID-19 vaccines today. These single dose Johnson & Johnson COVID-19 vaccines are the third batch of vaccine shipments to South Sudan through the COVAX Facility.", "url": "https://allafrica.com/stories/202109140651.html", "urlToImage": "https://cdn02.allafrica.com/download/pic/main/main/csiid/00581559:e80e49bcb147db5b99d0c058c14a047d:arc614x376:w1200.jpg", "publishedAt": "2021-09-14T13:06:01Z", "content": "South Sudan received its first consignment of 152,950 doses of the Johnson &amp; Johnson 'Janssen' COVID-19 vaccines today. These single dose Johnson &amp; Johnson COVID-19 vaccines are the third bat… [+5727 chars]"}, {"source": {"id": null, "name": "Moneyweb.co.za"}, "author": "https://www.facebook.com/Moneyweb/", "title": "Patrice Motsepe's African Rainbow eyes fintech investments - Moneyweb", "description": "Sets as much as R350 million aside.", "url": "https://www.moneyweb.co.za/news/companies-and-deals/patrice-motsepes-african-rainbow-eyes-fintech-investments/", "urlToImage": "https://www.moneyweb.co.za/wp-content/uploads/2021/03/232257428-1024x696.jpg", "publishedAt": "2021-09-14T12:44:07Z", "content": "African Rainbow Capital Investments is planning to expand its portfolio and has entered negotiations to add a fintech conglomerate to the group.\r\nThe firm, controlled by South African billionaire Pat… [+824 chars]"}, {"source": {"id": null, "name": "Business Insider South Africa"}, "author": null, "title": "You can now tip petrol attendants at Engen garages with this mobile app - Business Insider South Africa", "description": "Engen has partnered with Telkom Pay to facilitate cashless tips for petrol attendants and cashiers.", "url": "https://www.businessinsider.co.za/how-to-tip-a-petrol-attendant-in-south-africa-2021-9", "urlToImage": "http://cdn.24.co.za/files/Cms/General/d/11573/950da946554941d1b71dc0ffd155046c.jpg", "publishedAt": "2021-09-14T11:54:44Z", "content": "<ul><li>Cash is king when it comes to tipping petrol attendants in South Africa.</li><li>But more and more South Africans are moving away from cash and towards contactless forms of payment.</li><li>T… [+2608 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "Christian Berthelsen, Javier Blas and Bob Van Voris", "title": "Corrupt oil trader turns on colleagues in massive Africa bribe case - News24", "description": "Glencore and some of its executives face the prospect of steep fines and prison in a far-reaching investigation of tactics in numerous countries and commodity markets.", "url": "https://www.news24.com/fin24/companies/mining/corrupt-oil-trader-turns-on-colleagues-in-massive-africa-bribe-case-20210914", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/10012/cea1917e023447179fdf2097ee203b4a.jpg", "publishedAt": "2021-09-14T11:17:46Z", "content": "<ul><li>Former Glencore trader Anthony Stimler paid large bribes to African officials and intermediaries.\r\n</li><li>He is now helping the US government investigate Glencore and his former colleagues.… [+11109 chars]"}, {"source": {"id": null, "name": "Businesstech.co.za"}, "author": "https://www.facebook.com/BusinessTechSA", "title": "No deaths attributed to Covid vaccines in South Africa – while the latest data shows they work - BusinessTech", "description": "New data from the South African Health Products Regulatory Authority (Sahpra) and the Department of Health shows that, while there have been many reports of common negative side-effects from Covid-19 vaccines, none have directly been attributed to deaths in t…", "url": "https://businesstech.co.za/news/lifestyle/521252/no-deaths-attributed-to-covid-vaccines-in-south-africa-while-the-latest-data-shows-they-work/", "urlToImage": "https://businesstech.co.za/news/wp-content/uploads/2021/06/Vaccine-e1625982135407.jpg", "publishedAt": "2021-09-14T10:49:33Z", "content": "New data from the South African Health Products Regulatory Authority (Sahpra) and the Department of Health shows that, while there have been many reports of common negative side-effects from Covid-19… [+3981 chars]"}, {"source": {"id": null, "name": "AllAfrica - Top Africa News"}, "author": null, "title": "Nigeria: Fitch Rates Lagos Aaa, Attests to Good Standing, Resilience - AllAfrica - Top Africa News", "description": "Fitch Ratings, an internationally rating agency that determines the standing of countries, states and multinational corporation's financial and debt standing worldwide in its recent publication has upgraded Lagos State ratings from AA+ (nga) to AAA(nga) for i…", "url": "https://allafrica.com/stories/202109140129.html", "urlToImage": "https://cdn08.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png", "publishedAt": "2021-09-14T08:16:39Z", "content": "Fitch Ratings, an internationally rating agency that determines the standing of countries, states and multinational corporation's financial and debt standing worldwide in its recent publication has u… [+3271 chars]"}, {"source": {"id": "news24", "name": "News24"}, "author": "AFP", "title": "Quade Cooper's Wallaby heroics over Springboks ease path to Australian citizenship - News24", "description": "Wallabies flyhalf Quade Cooper welcomed immigration reforms that could ease his path to Australian citizenship, linking the changes to his last-gasp heroics against South Africa at the weekend.", "url": "https://www.news24.com/sport/rugby/rugbychampionship/quade-coopers-wallaby-heroics-of-over-springboks-ease-path-to-australian-citizenship-20210914", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/11568/0b44ea1a4adb460d83259e8eae4829e0.jpg", "publishedAt": "2021-09-14T05:22:21Z", "content": "Wallabies flyhalf Quade Cooper welcomed immigration reforms that could ease his path to Australian citizenship, on Tuesday linking the changes to his last-gasp heroics against South Africa at the wee… [+2422 chars]"}, {"source": {"id": null, "name": "Stuff.co.nz"}, "author": null, "title": "All Blacks zero in on Springboks at top of world rugby rankings - Stuff.co.nz", "description": "South Africa's loss to Wallabies costly as consistent ABs look to reclaim their mantle.", "url": "https://www.stuff.co.nz/sport/rugby/international/126370360/all-blacks-zero-in-on-springboks-at-top-of-world-rugby-rankings", "urlToImage": "https://resources.stuff.co.nz/content/dam/images/4/y/u/q/f/r/image.related.StuffLandscapeSixteenByNine.1420x800.238jzs.png/1631565201438.jpg", "publishedAt": "2021-09-13T20:33:00Z", "content": "The All Blacks are closing in on the Springboks at the top of the world rugby rankings.\r\n Last weekends Rugby Championship results were favourable to New Zealands quest to regain the No 1 position.\r\n… [+1710 chars]"}]}