{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "On Jonny Bairstow 'Spirit Of Cricket' Debate, Ashwin's Take Is Full Of Sarcasm | Cricket News - NDTV Sports", "description": "Star India spinner Ravichandran Ashwin has taken a jibe at the ones who have been criticising Alex Carey and the Australian cricket team for stumping Jonny Bairstow in a controversial manner in the second Ashes Test.", "url": "https://sports.ndtv.com/ashes-2023/ravichandran-ashwin-has-a-sarcastic-take-on-spirit-of-cricket-after-jonny-bairstow-controversy-4177402", "urlToImage": "https://c.ndtvimg.com/2023-06/jbu7k0s_r-ashwin-test-bcci_625x300_16_June_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-07-05T02:57:00Z", "content": "Star India spinner Ravichandran Ashwin has taken a jibe at the ones who have been criticising Alex Carey and the Australian cricket team for stumping Jonny Bairstow in a controversial manner in the s… [+1760 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Climate change's impact on health and healthcare in Northern NSW: Urgent action needed - News-Medical.Net", "description": "A systematic review published in the International Journal of Environmental Research and Public Health describes the impact of climate change on health and health services in Northern New South Wales, Australia. This region is considered a “hotspot” for flood…", "url": "https://www.news-medical.net/news/20230704/Climate-changes-impact-on-health-and-healthcare-in-Northern-NSW-Urgent-action-needed.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_752813_16885239466294274.jpg", "publishedAt": "2023-07-05T02:33:00Z", "content": "A systematic review published in the International Journal of Environmental Research and Public Health describes the impact of climate change on health and health services in Northern New South Wales… [+7808 chars]"}]}