{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Hollywood Reporter"}, "author": "Abid Rahman", "title": "Tenacious D Australia Concert Postponed After Trump Shooting Joke, As Local Politician Calls for Band to be Deported - Hollywood Reporter", "description": "The comedy rock duo, comprising Jack Black and Kyle Gass, made a bad taste joke about the former president at a gig in Sydney on Sunday and postponed a concert in Newcastle at short notice.", "url": "http://www.hollywoodreporter.com/news/politics-news/australian-politician-deportation-tenacious-d-trump-shooting-joke-1235949450/", "urlToImage": "https://www.hollywoodreporter.com/wp-content/uploads/2024/07/GettyImages-1664789522-1.jpg?w=1296&h=730&crop=1", "publishedAt": "2024-07-16T10:05:05Z", "content": "An Australian politician has called for the comedy rock band Tenacious D, comprising Jack Black and Kyle Gass, to be deported from the country after a comment a band member made about the assassinati… [+1991 chars]"}, {"source": {"id": null, "name": "WION"}, "author": null, "title": "Sunspot AR3738 releases X-class solar flare triggering radio blackouts in Australia and Japan - WION", "description": "Sun released another set of solar flares on Saturday and the explosion was captured by NASA's Solar Dynamics Observatory from space. The X-class flare, the most powerful class of solar flare, was released from Sunspot AR3738. The solar flares resulted in shor…", "url": "https://www.wionews.com/science/sunspot-ar3738-releases-x-class-solar-flare-triggering-radio-blackouts-in-australia-and-japan-741344", "urlToImage": "https://cdn.wionews.com/sites/default/files/2024/07/16/443839-untitled-design-2024-07-16t134905784.png", "publishedAt": "2024-07-16T08:11:36Z", "content": "Sun released another set of solar flares on Saturday and the explosion was captured by NASA's Solar Dynamics Observatory from space. The X-class flare, the most powerful class of solar flare, was rel… [+1988 chars]"}]}