{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "India Today News Desk", "title": "IND vs AUS Live, World Cup 2023 Final: PM Narendra Modi arrives in Ahmedabad - India Today", "description": "India (IND) vs Australia (AUS), Live Updates, World Cup 2023 Final: PM Narendra Modi has arrived in Ahmedabad. India were bowled out for the 1st time in World Cup 2023. The Men in Blue were bundled for 240 runs with Mitchell Starc picking 3 wickets in the fin…", "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-world-cup-2023-india-australia-final-live-weather-ahmedabad-2464725-2023-11-19", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/breaking_news/202311/ind-vs-aus-live--world-cup-2023-final-reuters-photo-195154377-16x9_0.jpg?VersionId=HNy_buhCdqkCDBYufMOB3xMd4lYcfUgN", "publishedAt": "2023-11-19T12:25:21Z", "content": "Hello and welcome to our live coverage of the India vs Australia final from Ahmedabad\r\nWorld Cup Final: Warner gets a repreive \r\nDavid Warner gets a reprieve in the very first over of Australia's run… [+19465 chars]"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "Fan Invades Pitch, Hugs Virat Kohli In Massive Security Breach During Cricket World Cup 2023 Final - NDTV Sports", "description": "A fan invaded the pitch at the Narendra Modi Stadium in Ahmedabad during the Cricket World Cup 2023 final between India and Australia.", "url": "http://www.bbc.com/news/world-us-canada-39324587", "urlToImage": "https://c.ndtvimg.com/2023-11/h64ee6uo_palestine_625x300_19_November_23.jpg", "publishedAt": "2023-11-19T10:45:00Z", "content": "A fan invaded the pitch and hugged Virat Kohli in a massive security breach at the Narendra Modi Stadium in Ahmedabad during the Cricket World Cup 2023 final between India and Australia on Sunday. Du… [+1720 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Deep dive on sea level rise: New modeling gives better predictions on Antarctic ice sheet melt - Phys.org", "description": "Using historical records from around Australia, an international team of researchers have put forward the most accurate prediction to date of past Antarctic ice sheet melt, providing a more realistic forecast of future sea level rise.", "url": "https://phys.org/news/2023-11-deep-sea-antarctic-ice-sheet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/ice.jpg", "publishedAt": "2023-11-17T19:00:01Z", "content": "Using historical records from around Australia, an international team of researchers have put forward the most accurate prediction to date of past Antarctic ice sheet melt, providing a more realistic… [+4179 chars]"}]}