{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Edna Tarigan", "title": "How to watch the rare solar eclipse crossing over remote Australia, Indonesia - The Associated Press", "description": "JAKARTA, Indonesia (AP) — Under a cloudless sky, 20,000 eclipse chasers crowded a tiny outpost to watch a rare solar eclipse plunge part of Australia's northwest coast into brief midday darkness Thursday while temporarily cooling the tropical heat.", "url": "https://apnews.com/article/hybrid-solar-eclipse-australia-indonesia-east-timor-76c01e7b0dcd3154ba1250d8f0c73b59", "urlToImage": "https://storage.googleapis.com/afs-prod/media/ca758524fa244d12bda543933c3bdf1e/3000.webp", "publishedAt": "2023-04-20T09:35:21Z", "content": "JAKARTA, Indonesia (AP) Under a cloudless sky, 20,000 eclipse chasers crowded a tiny outpost to watch a rare solar eclipse plunge part of Australias northwest coast into brief midday darkness Thursda… [+4584 chars]"}, {"source": {"id": null, "name": "WION"}, "author": "WION Video Team", "title": "Rare 'hybrid' solar eclipse seen in Australia, a visual treat for skywatchers - WION", "description": "Skywatchers witness a rare hybrid solar eclipse, which appears total or annular, depending upon where you are viewing it from. The celestial event gives scientists a chance to study the Sun's corona. NASA says hybrid eclipses will happen only four more times …", "url": "https://www.wionews.com/videos/rare-hybrid-solar-eclipse-seen-in-australia-a-visual-treat-for-skywatchers-584351", "urlToImage": "http://cdn.wionews.com/sites/default/files/2023/04/20/2004_AK_WION_SKY_WATCHERS_130PM-1681981507-00000003.jpg", "publishedAt": "2023-04-20T09:05:01Z", "content": "© 2023. Indiadotcom Digital Private Limited. All Rights Reserved."}, {"source": {"id": null, "name": "BBC News"}, "author": "https://www.facebook.com/bbcnews", "title": "Solar eclipse: Thousands flock to remote Australian town for rare celestial event - BBC", "description": "Tourists and scientists swell the population of a Western Australia town to view a rare solar eclipse.", "url": "https://www.bbc.com/news/world-australia-65332061", "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/F7F9/production/_129418436_gettyimages-1167289001.jpg", "publishedAt": "2023-04-20T05:22:51Z", "content": "Media caption, Solar eclipse: Watch the moment the sky turned dark over remote Australia\r\nA rare solar eclipse has thrilled thousands of people who flocked to a remote Australian town for the best va… [+1907 chars]"}]}