{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "Motley Fool Australia"}, "author": null, "title": "AGL share price makes partial recovery as expert declares demerger favourable - The Motley Fool Australia", "description": "The AGL Energy Limited (ASX: AGL) share price closed lower on Friday following the release of more details on the company's planned demerger.", "url": "https://www.fool.com.au/2022/05/06/agl-share-price-makes-partial-recovery-as-expert-declares-demerger-favourable/", "urlToImage": "https://www.fool.com.au/wp-content/uploads/2022/05/thumbs-up-new.jpg", "publishedAt": "2022-05-06T07:02:28Z", "content": "The AGL Energy Limited (ASX: AGL) share price closed higher than the broader market on Friday following the release of more details on the company’s planned demerger.\r\nThe demerger’s scheme booklet d… [+4034 chars]"}, {"source": {"id": null, "name": "MacroBusiness"}, "author": "Unconventional Economist", "title": "Markets forecast interest rate tsunami, house price crash - MacroBusiness", "description": "The futures market has truly lost its marbles, ratchetting up its Australian interest expectations even higher. As shown below, the RBA cash rate is now forecast by the market to hit 2.75% by the end of this year and around 3.7% by September 2023: The next ta…", "url": "https://www.macrobusiness.com.au/2022/05/markets-forecast-interest-rate-tsunami-house-price-crash/", "urlToImage": "https://www.macrobusiness.com.au/wp-content/uploads/2022/05/Worried-face-2.png", "publishedAt": "2022-05-06T04:00:11Z", "content": "The futures market has truly lost its marbles, ratchetting up its Australian interest expectations even higher.\r\nAs shown below, the RBA cash rate is now forecast by the market to hit 2.75% by the en… [+1994 chars]"}, {"source": {"id": null, "name": "InDaily"}, "author": null, "title": "The Pub Test: Boothby voters react to the interest rate hike - InDaily", "description": "We headed down to a pub in South Australia's most marginal seat - Boothby - to gauge voters' verdicts on whether the Morrison Government's economic credibility has taken a hit from this week's interest rate increase.", "url": "https://indaily.com.au/news/local/2022/05/05/the-pub-test-boothby-voters-react-to-this-weeks-interest-rate-hike/", "urlToImage": "https://indaily.com.au/wp-content/uploads/2022/05/Screen-Shot-2022-05-05-at-12.41.26-pm.png", "publishedAt": "2022-05-05T00:02:37Z", "content": "The Pub Test: Boothby voters react to the interest rate hike\r\nWe headed down to a pub in South Australia’s most marginal seat – Boothby – to gauge voters’ verdicts on whether the Morrison Government’… [+6770 chars]"}]}