{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Chrissie Swan Weight Loss Australia: Reviews (AU) Is Chrissie Swan Keto Gummies Really Work Or Fake Exposed Maggie Beer Keto Gummies? - The Tribune India", "description": "Obesity, being overweight, and fatigue at an early age has become the worst nightmare for so many Americans. Obesity has been linked to the worsening of a number of diseases, including cancer and diabetes. A variety of lifestyle factors can contribute to weig…", "url": "https://www.tribuneindia.com/news/brand-connect/chrissie-swan-weight-loss-australia-reviews-au-is-chrissie-swan-keto-gummies-really-work-or-fake-exposed-maggie-beer-keto-gummies-464197", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/12/2022_12$largeimg_1265530691.png", "publishedAt": "2022-12-24T21:07:00Z", "content": "Obesity, being overweight, and fatigue at an early age has become the worst nightmare for so many Americans. Obesity has been linked to the worsening of a number of diseases, including cancer and dia… [+10800 chars]"}, {"source": {"id": null, "name": "The Sydney Morning Herald"}, "author": "George Brandis", "title": "If you no longer pray, spare a thought today for persecuted Christians - Sydney Morning Herald", "description": "Fewer than half of Australians now identify as Christians, but we should not forget that faith is a fundamental human right denied to many Christians worldwide.", "url": "https://www.smh.com.au/world/middle-east/if-you-no-longer-pray-spare-a-thought-today-for-persecuted-christians-20221222-p5c8dh.html", "urlToImage": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_124/t_crop_custom/q_86%2Cf_auto/t_smh_opinion_no_age_social_wm/8003c76d02d61abf2cb5e5c5ab2acc9854dd8e09", "publishedAt": "2022-12-24T18:00:00Z", "content": "Yet in Australia in recent years, it has somehow become socially acceptable to ridicule people for holding Christian beliefs, though it would be regarded as unacceptable to ridicule other religions, … [+4214 chars]"}, {"source": {"id": null, "name": "Press Start Australia"}, "author": "Kieron Verbrugge", "title": "The Best Boxing Day Gaming, Tech And Entertainment Deals On Amazon - Press Start Australia", "description": "Boxing Day sales have kicked off, and as usual Amazon is bringing the heat with its deals on everything gaming, tech and entertainment. You can browse their Boxing Day sale in full right here, but we've taken the time to round up what we feel are some of the …", "url": "https://press-start.com.au/bargains/2022/12/24/amazon-boxing-day-2022/", "urlToImage": "https://press-start.com.au/wp-content/uploads/2022/08/Amazon-Prime-Free-One-Day-Delivery.jpg", "publishedAt": "2022-12-24T13:51:17Z", "content": null}, {"source": {"id": "news24", "name": "News24"}, "author": "AFP", "title": "'I didn't have any support': Warner fires shot at Cricket Australia over leadership appeal - News24", "description": "Veteran David Warner accused Cricket Australia Saturday of a lack of support in his appeal against a lifetime leadership ban and revealed he struggled mentally during the recent series against the West Indies.", "url": "https://www.news24.com/sport/cricket/i-didnt-have-any-support-warner-fires-shot-at-cricket-australia-over-leadership-appeal-20221224", "urlToImage": "https://cdn.24.co.za/files/Cms/General/d/7617/11aa7ea266c3490eb4947d3a62d873c8.jpg", "publishedAt": "2022-12-24T09:11:22Z", "content": "Veteran David Warner accused Cricket Australia Saturday of a lack of support in his appeal against a lifetime leadership ban and revealed he struggled mentally during the recent series against the We… [+1993 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "ABC News", "title": "Anthony Albanese and Peter Dutton thank emergency services, defence force members in Christmas messages - ABC News", "description": "The prime minister and opposition leader wish Australians relaxed and happy holidays and thank emergency services and defence personnel for their ongoing service.", "url": "https://www.abc.net.au/news/2022-12-24/anthony-albanese-peter-dutton-deliver-christmas-messages/101804794", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/0b1b142dd36c6b73eeae908a957a2d60?impolicy=wcms_crop_resize&cropH=450&cropW=800&xPos=0&yPos=1&width=862&height=485", "publishedAt": "2022-12-24T06:03:42Z", "content": "The prime minister and opposition leader have released their Christmas messages, wishing Australians relaxed and happy holidays and thanking emergency services and defence personnel for their ongoing… [+2958 chars]"}, {"source": {"id": null, "name": "Kotaku Australia"}, "author": null, "title": "Australian-Made RPG Sports Story Is Finally Out, This Is Not A Drill - Kotaku Australia", "description": "Sports Story, the latest game from Queensland studio Sidebar Games, has had a surprise launch on Switch today, just in time for Christmas", "url": "https://www.kotaku.com.au/2022/12/australian-studio-sidebar-games-launches-sports-story-on-final-day-of-nintendo-shadowdrops/", "urlToImage": "https://www.kotaku.com.au/wp-content/uploads/sites/3/2022/12/24/wall5big-e1671835017288.png?quality=80&resize=1280,720", "publishedAt": "2022-12-23T22:47:00Z", "content": "Sports Story, the highly anticipated sequel to Queensland developer Sidebar Games’ surprise hit RPG Golf Story, is out now on the Nintendo Switch eShop.\r\nThe Sports Story has been a long and winding … [+2239 chars]"}, {"source": {"id": "australian-financial-review", "name": "Australian Financial Review"}, "author": "Damian Troise", "title": "Wall Street wavers after mixed data on the economy - The Australian Financial Review", "description": "The S&P 500 closed higher on Friday (Saturday AEDT) as investors assessed inflation data against rate hike and recession fears while energy shares jumped on higher oil prices.", "url": "https://www.afr.com/markets/equity-markets/wall-street-wavers-after-mixed-data-on-the-economy-20221224-p5c8mx", "urlToImage": "https://static.ffx.io/images/$zoom_0.2491%2C$multiply_3%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_39/t_crop_custom/c_scale%2Cw_800%2Cq_88%2Cf_jpg/t_afr_no_label_no_age_social_wm/667404d7d582546e6dd7f5b9f01cbe2efef89503", "publishedAt": "2022-12-23T21:07:00Z", "content": "This is a clear indication that this is a bad news is good news kind of market. The market wants the Fed to feel what theyre doing has been enough, said Cruz.\r\nIt is on edge over what the path for Fe… [+1476 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Zebra finches might sing to synchronize their breeding with each other - Phys.org", "description": "Australian wild zebra finches sing more with others around when breeding conditions are favorable. Their song also changes based on their breeding stage and it attracts other zebra finches. A possible explanation for this behavior is that birds try to influen…", "url": "https://phys.org/news/2022-12-zebra-finches-synchronize.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/zebra-finches-might-si.jpg", "publishedAt": "2022-12-23T15:57:38Z", "content": "Australian wild zebra finches sing more with others around when breeding conditions are favorable. Their song also changes based on their breeding stage and it attracts other zebra finches. A possibl… [+2722 chars]"}, {"source": {"id": null, "name": "ESPN Australia"}, "author": "Mark Ogden", "title": "Haaland looks rested, Man City look like Carabao Cup faves - ESPN Australia", "description": "Erling Haaland showed just how refreshed he is after the World Cup break, and Man City look ready for the Premier League to resume.", "url": "https://www.espn.com.au/football/english-carabao-cup/story/4837136/haaland-looks-restedman-city-look-like-carabao-cup-faves", "urlToImage": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2022%2F1222%2Fr1109850_1296x729_16%2D9.jpg", "publishedAt": "2022-12-22T22:40:05Z", "content": "MANCHESTER, England -- Liverpool will not be winning back-to-back Carabao Cups after Manchester City sent them home on Thursday with a dramatic 3-2 fourth round win for City at the Etihad. Man City a… [+10111 chars]"}]}