{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "India Today"}, "author": "India Today Sports Desk", "title": "Rohit Sharma breaks silence on World Cup final heartbreak: It was not easy to move on - India Today", "description": "Captain Rohit Sharma finally opened up about how he dealt with the heartbreak of losing the World Cup 2023 Final to Australia. In an emotional video, Rohit thanked his family and friends for helping him deal with the situation.", "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-world-cup-final-2023-defeat-first-reaction-video-mumbai-indians-heartbreak-2475410-2023-12-13", "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202312/20231130-301926112-16x9.jpg?VersionId=DiHFTq2WCIyZomBMiYJ6v6aLuloxGVSW", "publishedAt": "2023-12-13T07:28:00Z", "content": "India captain Rohit Sharma finally opened up about the World Cup 2023 Final defeat, saying it was very tough for him to move on from the disappointment that he faced on the big night. Rohit, speaking… [+3463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Why Usman Khawaja won’t be wearing shoes featuring human rights slogans for Palestinians in Gaza - The Indian Express", "description": "On Wednesday, Australia captain Pat Cummins said: \"Khawaja had 'all lives are equal' (on his shoes). I don't think that's very divisive. I don't think anyone can have too many complaints about that.\" But the Pakistan-born opener won't sport the messages.", "url": "https://indianexpress.com/article/sports/cricket/why-usman-khawaja-wont-be-wearing-shoes-featuring-human-rights-slogans-for-palestinians-in-gaza-9066028/", "urlToImage": "https://images.indianexpress.com/2023/12/Usman-Khawaja-VIA-X-CROP.png", "publishedAt": "2023-12-13T06:00:36Z", "content": "Australian cricketer Usman Khawaja has decided to abort his plan to have sporting messages of support for Palestinians in Gaza written on his shoes for the first Test against Pakistan at Perth’s Optu… [+5116 chars]"}]}