{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "Republic World"}, "author": "Press Trust Of India", "title": "India tour of Australia: Savita Punia and co., come crushing down to Aussies by 2-4 - Republic World", "description": "It was one-way traffic at the start of the third quarter as three minutes later, the hosts extended their lead when Schonell found the back of the Indian net with a reverse hit. Sharmila reduced the margin to 2-4 for India five minutes", "url": "https://www.republicworld.com/sports-news/hockey-news/india-tour-of-australia-savita-punia-and-co-dot-come-crushing-down-to-aussies-by-2-4-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/dezjzvqwpnyrt3ax_1684415586.jpeg", "publishedAt": "2023-05-18T13:13:00Z", "content": "The Indian women's hockey team started its tour of Australia on a disappointing note, losing 2-4 against the hosts in the first Test of the three-match series at the Mate Stadium here on Thursday. Af… [+2772 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Quad meet cancelled, PM Modi to go ahead with Australia visit - The Indian Express", "description": "“The Quad leaders’ meeting will not be going ahead in Sydney next week,” Albanese then said in Tweed Heads, a town in New South Wales. He said the Quad leaders — Australia, the US, India and Japan – would now meet at the G7 Summit in Hiroshima this weekend.", "url": "https://indianexpress.com/article/india/quad-meet-cancelled-pm-modi-to-go-ahead-with-australia-visit-8615307/", "urlToImage": "https://images.indianexpress.com/2023/05/modi-albanese-1.jpg", "publishedAt": "2023-05-17T22:44:53Z", "content": "WITH US President Joe Biden cancelling his trip to Australia due to the crucial debt-ceiling talks in Washington, Australian Prime Minister Anthony Albanese announced that the Quad leaders summit wou… [+2650 chars]"}]}