{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Lawrence Richard", "title": "Australian killer's father reveals why son targeted women during deadly stabbing at Sydney mall - Fox News", "description": "The father of the man who went on a deadly stabbing spree at a busy Australian shopping mall shared why the attack specifically targeted women.", "url": "https://www.foxnews.com/world/australian-killers-father-reveals-why-son-targeted-women-during-deadly-stabbing-sydney-mall", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2024/04/GettyImages-2147763977.jpg", "publishedAt": "2024-04-15T14:03:00Z", "content": "The father of an Australian man who went on a deadly stabbing spree at a busy Sydney shopping mall on Saturday has a theory as to why the attack targeted women while mostly avoiding men.\r\nOn Saturday… [+3175 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "“Ghostly” – Scientists Discover Mysterious Creature From the Shadows in Australia - SciTechDaily", "description": "In the sun-baked Pilbara region of northwestern Australia, researchers have discovered a mysterious creature from the shadows – a new ant species of the elusive genus Leptanilla. The new species, Leptanilla voldemort – L. voldemort for short – is a pale ant w…", "url": "https://scitechdaily.com/ghostly-scientists-discover-mysterious-creature-from-the-shadows-in-australia/", "urlToImage": "https://scitechdaily.com/images/Full-Face-View-of-Leptanilla-voldemort-scaled.jpg", "publishedAt": "2024-04-15T08:22:04Z", "content": "In Australia’s Pilbara region, a new ant species, Leptanilla voldemort, has been discovered. It is characterized by its pale, slender form and underground habitat, shedding light on the unique biodiv… [+4732 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Emma Bryce", "title": "Drowned land off Australia was an Aboriginal hotspot in last ice age, 4000 stone artifacts reveal - Livescience.com", "description": "The landscape features in the dreamtime stories of Australia's Indigenous people.", "url": "https://www.livescience.com/archaeology/drowned-land-off-australia-was-an-aboriginal-hotspot-in-last-ice-age-4000-stone-artifacts-reveal", "urlToImage": "https://cdn.mos.cms.futurecdn.net/Nf6BW3xP7TipgsxV2GetLh-1200-80.jpg", "publishedAt": "2024-04-14T13:00:00Z", "content": "An analysis of over 4,000 stone artifacts discovered on an island off northwestern Australia provides a snapshot of Aboriginal life tens of thousands of years ago.\r\nThe discovery underscores the \"lon… [+6136 chars]"}]}