{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "InsideClimate News"}, "author": "Katelyn Weisbrod", "title": "How Wildfire Smoke from Australia Affected Climate Events Around the World - InsideClimate News", "description": "The aerosol fallout from wildfires that burned across more than 70,000 square miles of Australia in 2019 and 2020 was so persistent and widespread that it brightened a vast area of clouds above the subtropical Pacific Ocean.  Beneath those clouds, the ocean s…", "url": "https://insideclimatenews.org/news/10052023/wildfire-smoke-aerosol-la-nina-climate-change/", "urlToImage": "https://insideclimatenews.org/wp-content/uploads/2023/05/ocean-smoke_orbital-horizon-copernicus-sentinel-data-gallo-images-getty-1-1024x657.jpg", "publishedAt": "2023-05-10T18:00:48Z", "content": "The aerosol fallout from wildfires that burned across more than 70,000 square miles of Australia in 2019 and 2020 was so persistent and widespread that it brightened a vast area of clouds above the s… [+9166 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Zee Media Bureau", "title": "ICC Shares Names Of Teams Qualified For 2023 ODI World Cup After South Africa Seals Berth - Zee News", "description": "India, England, New Zealand, Pakistan, Australia, Bangladesh, Afghanistan and South Africa. While India have qualified as the hosts, the other seven have qualfied by finishing in the top of the ICC Super League table at the end of the cut off date.  The road …", "url": "https://zeenews.india.com/cricket/icc-shares-names-of-teams-qualified-for-2023-odi-world-cup-after-south-africa-seals-berth-2605557.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2023/05/10/1197448-untitled-design-2023-05-10t132725.229.png", "publishedAt": "2023-05-10T07:57:39Z", "content": "South Africa confirmed their participation in the 2023 ODI World Cup in India on Tuesday. They were benefitted by the Ireland vs Bangladesh 1st ODI getting washed out at Chelmsford. Ironically, rain … [+2468 chars]"}]}