{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Boeing Starliner pilots' return to Earth indefinitely delayed due to technical failure | ABC News - ABC News (Australia)", "description": "Two NASA astronauts' return to earth has been indefinitely delayed after flying the Boeing Starliner space capsule to the International Space Station. The US...", "url": "https://www.youtube.com/watch?v=FVm7eghNx3E", "urlToImage": "https://i.ytimg.com/vi/FVm7eghNx3E/maxresdefault.jpg", "publishedAt": "2024-06-27T01:06:34Z", "content": null}, {"source": {"id": null, "name": "Democracy Now!"}, "author": "Democracy Now!", "title": "“Julian Is Free”: Assange Back Home in Australia After Taking U.S. Plea Deal in “Espionage” Case - Democracy Now!", "description": "Julian Assange has landed in Australia a free man, reuniting with his family Wednesday after pleading guilty to one charge of violating the U.S. Espionage Act as part of a deal with the Justice Department. The WikiLeaks publisher entered his plea on the Pacif…", "url": "https://www.democracynow.org/2024/6/26/julian_assange_lands_in_australia", "urlToImage": "https://www.democracynow.org/images/story/60/72660/full_hd/Seg1-AssangefreeUSETHIS.jpg", "publishedAt": "2024-06-26T12:00:00Z", "content": "AMYGOODMAN: WikiLeaks founder Julian Assange is home in Australia a free man. Assange landed in the Australian capital of Canberra today to cheers from supporters. He disembarked from a chartered jet… [+12006 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "AP", "title": "WikiLeaks founder Julian Assange returns to Australia a free man after US legal battle ends - Hindustan Times", "description": "WikiLeaks founder Julian Assange returned to his homeland Australia aboard a charter jet on Wednesday. | World News", "url": "https://www.hindustantimes.com/world-news/wikileaks-founder-julian-assange-returns-to-australia-a-free-man-after-us-legal-battle-ends-101719397163672.html", "urlToImage": "https://www.hindustantimes.com/ht-img/img/2024/06/26/1600x900/BRITAIN-ASSANGE-NFT-2_1644421477364_1719397356892.JPG", "publishedAt": "2024-06-26T10:25:57Z", "content": "WikiLeaks founder Julian Assange returned to his homeland Australia aboard a charter jet on Wednesday, hours after pleading guilty to obtaining and publishing U.S. military secrets in a deal with Jus… [+6962 chars]"}]}