{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy,Angus Watson", "title": "Quad summit in Australia canceled after Joe Biden shortens Asia trip - CNN", "description": "A planned summit of Quad leaders from the United States, India, Australia, and Japan in Sydney next week has been canceled after US President Joe Biden pulled out of his visit, Australia’s Prime Minister Anthony Albanese said on Wednesday, adding that talks c…", "url": "https://www.cnn.com/2023/05/16/asia/quad-canceled-biden-visit-australia-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/230517112341-restricted-quad-meeting.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2023-05-17T07:32:00Z", "content": "A planned summit of Quad leaders from the United States, India, Australia, and Japan in Sydney next week has been canceled after US President Joe Biden pulled out of his visit, Australias Prime Minis… [+5482 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "PTI", "title": "President Biden postpones Australia trip; Quad leaders summit in Sydney cancelled - Economic Times", "description": "A bilateral programme in Sydney with Indian Prime Minister Narendra Modi could still go ahead next week, Albanese said. Albanese did not comment on whether Japanese Prime Minister Fumio Kishida would still visit Sydney next week. The Quad is an informal group…", "url": "https://economictimes.indiatimes.com/news/defence/australia-cancels-quad-meeting-after-biden-postponement/articleshow/100290569.cms", "urlToImage": "https://img.etimg.com/thumb/msid-100290632,width-1070,height-580,imgsize-75998,overlay-etdefence/photo.jpg", "publishedAt": "2023-05-17T05:22:00Z", "content": "US President Joe Biden has postponed a visit to Australia, the second leg of his upcoming Asia trip, to focus on crucial debt-ceiling talks to prevent a catastrophic federal default, prompting the ca… [+5992 chars]"}]}