{"status": "ok", "totalResults": 2, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Australian researchers discover how COVID-19 can infect the human placenta - News-Medical.Net", "description": "In a landmark study published in Nature Cell Biology, Australian researchers, led by Professor Jose Polo from Monash University and the University of Adelaide and University of Melbourne's Professor Kanta Subbarao from the Peter Doherty Institute for Infectio…", "url": "https://www.news-medical.net/news/20230714/Australian-researchers-discover-how-COVID-19-can-infect-the-human-placenta.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/6/Pregnancy-620x480.jpg", "publishedAt": "2023-07-14T17:45:00Z", "content": "In a landmark study published in Nature Cell Biology, Australian researchers, led by Professor Jose Polo from Monash University and the University of Adelaide and University of Melbourne's Professor … [+2780 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": null, "title": "Active Keto Gummies Avis (Australia & Canada) Dragons Den Keto Gummies in United Kingdom - Deccan Herald", "description": "Get Rid of All your Extra Pounds with Active Keto Gummies Avis: Know Everything Before. You Trust Active Keto Gummies Avis are highly beneficial and effective for those fighting obesity. Obesity is a curse to humankind that accelerate the risk of multiple dea…", "url": "https://www.deccanherald.com/brandspot/sponsored-health/active-keto-gummies-avis-australia-canada-dragons-den-keto-gummies-in-united-kingdom-1236996.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/Pict%201330-1236996-1689336811.jpg", "publishedAt": "2023-07-14T12:12:35Z", "content": "Get Rid of All your Extra Pounds with Active Keto Gummies Avis: Know Everything Before. You Trust Active Keto Gummies Avis are highly beneficial and effective for those fighting obesity. Obesity is a… [+17068 chars]"}]}