{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": null, "name": "Zoom"}, "author": "TN Sports Desk", "title": "Massive Security Breach In IND vs AUS World Cup Final, Palestine Supporter Interrupts Play, Hugs Virat Kohli - Times Now", "description": "There was a massive security breach during the India vs Australia World Cup final as a Palestine supporter interrupted play. He came close to Virat Kohli before being taken away by the security. India are up against five-time champions Australia in the World …", "url": "https://www.timesnownews.com/sports/cricket/massive-security-breach-in-india-vs-australia-world-cup-final-palestine-supporter-interrupts-play-wach-article-105330669", "urlToImage": "https://static.tnn.in/thumb/msid-105330781,thumbsize-45078,width-1280,height-720,resizemode-75/105330781.jpg", "publishedAt": "2023-11-19T09:47:49Z", "content": "India vs Australia: Rohit Sharma, Virat Kohli Get Emotional During National Anthem In World Cup Final: WATCH"}, {"source": {"id": null, "name": "DNA India"}, "author": "Mahipal Chouhan", "title": "Animals that are only found in Australia - DNA India", "description": "Here' a list of Animals that are only found in Australia", "url": "https://www.dnaindia.com/web-stories/viral/animals-that-are-only-found-in-australia-kangaroo-cassowary-worldcup--1700377514363", "urlToImage": null, "publishedAt": "2023-11-19T07:15:41Z", "content": "Nov 19, 2023, 12:45PM IST"}, {"source": {"id": null, "name": "BBC News"}, "author": null, "title": "\"Can Afford Full Suit For Final: Mayanti Langer Shuts Down Trolls In Epic Fashion - NDTV Sports", "description": "Trolled for her attire for the World Cup semi-final, Mayanti Langer hit the trolls for a six ahead of the summit clash between India and Australia.", "url": "http://www.bbc.com/news/world-us-canada-39324587", "urlToImage": "https://c.ndtvimg.com/2023-11/5qdkpolo_mayanti-langer_625x300_19_November_23.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2023-11-19T04:22:08Z", "content": "As sports presenter Mayanti Langer appeared on television for the semi-final clash between India and New Zealand, several trolled her for her attire. Some even decided to surface edited pictures of h… [+2134 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X", "title": "Deep dive on sea level rise: New modeling gives better predictions on Antarctic ice sheet melt - Phys.org", "description": "Using historical records from around Australia, an international team of researchers have put forward the most accurate prediction to date of past Antarctic ice sheet melt, providing a more realistic forecast of future sea level rise.", "url": "https://phys.org/news/2023-11-deep-sea-antarctic-ice-sheet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2019/ice.jpg", "publishedAt": "2023-11-17T19:00:01Z", "content": "Using historical records from around Australia, an international team of researchers have put forward the most accurate prediction to date of past Antarctic ice sheet melt, providing a more realistic… [+4179 chars]"}]}