{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": null, "name": "Press Start Australia"}, "author": "Shannon Grixti", "title": "Amazon’s Black Friday Sale Starts At Midnight Tonight And Here’s A Tease Of What To Expect - Press Start Australia", "description": "Even though there's been more than a few deals drop early (find them below), Amazon has confirmed that it's Black Friday sale will officially kick off at Midnight tonight. Generally with Amazon, the best deals are live right as the sale goes live. Given the s…", "url": "https://press-start.com.au/bargains/2021/11/21/amazon-black-friday-sale-starts-at-midnight-tonight/", "urlToImage": "https://cdn.pressstart.com.au/wp-content/uploads/2020/10/Amazon-Boxing-Day-1-770x433-1.jpg", "publishedAt": "2021-11-21T07:13:00Z", "content": "Even though there’s been more than a few deals drop early (find them below), Amazon has confirmed that it’s Black Friday sale will officially kick off at Midnight tonight. Generally with Amazon, the … [+10401 chars]"}, {"source": {"id": null, "name": "Newscorpaustralia.com"}, "author": null, "title": "Virgin Australia’s chief of corporate affairs, Moksha Watts, quits after behaviour review - The Australian", "description": "Subscribe to The Australian to get unrestricted digital access, home paper delivery, Apps for iPad and Android, member only +Rewards and much more...", "url": "https://dsf.newscorpaustralia.com/theaustralian/subscription/", "urlToImage": null, "publishedAt": "2021-11-21T05:16:00Z", "content": null}, {"source": {"id": null, "name": "The Guardian"}, "author": "Guardian staff reporter", "title": "‘Horrendous’: Dave Rennie castigates officials after Wallabies’ Wales loss - The Guardian", "description": "Australia’s coach lashed out after a controversial red card to Rob Valetini left his side without a single on their European spring tour", "url": "https://amp.theguardian.com/sport/2021/nov/21/horrendous-dave-rennie-castigates-officials-after-wallabies-wales-loss", "urlToImage": null, "publishedAt": "2021-11-21T02:52:00Z", "content": "Australia rugby union team<ul><li>Australia coach to lodge complaint over controversial red card</li><li>Leaves Wallabies without a single win on European spring tour</li></ul>\r\nAustralian Associated… [+3549 chars]"}, {"source": {"id": null, "name": "Nation.lk"}, "author": null, "title": "Breast cancer Australia: Sydney mum Emma Gorrick battles disease for second time in 10 years - nation.lk - The Nation Newspaper", "description": "David Gorrick works up to 60 hours a week and is preparing to sell his car to pay for therapies that could extend the life of his beloved wife Emma, 35, who is resistant to chemotherapy.", "url": "https://www.nation.lk/online/breast-cancer-australia-sydney-mum-emma-gorrick-battles-disease-for-second-time-in-10-years-144528.html", "urlToImage": "https://i.dailymail.co.uk/1s/2021/11/17/22/50631449-0-image-a-21_1637189370586.jpg", "publishedAt": "2021-11-20T22:57:19Z", "content": "The husband of a young mum given months to live after doctors found 30 tumours in her bones has sold almost everything they own to keep her alive.\r\nDavid Gorrick works up to 60 hours a week managing … [+6298 chars]"}, {"source": {"id": "abc-news-au", "name": "ABC News (AU)"}, "author": "Jessica Longbottom, Eden Hynninen, Danielle Bonica, Kate Higgins, Joseph Dunstan", "title": "When two of Australia's richest men came to Pearcedale, locals didn't realise what it would cost them - ABC Local", "description": "Residents of Pearcedale, an hour's drive from Melbourne, still think of it as a country town, and the local shops are the heart of the community. When two billionaires snapped up the strip six years ago, locals didn't bat an eyelid.", "url": "https://www.abc.net.au/news/2021-11-20/local-stores-rent-increases-pearcedale-melbourne/100633160", "urlToImage": "https://live-production.wcms.abc-cdn.net.au/3bee71295ccd90008242b9cdac96750b?impolicy=wcms_crop_resize&cropH=2813&cropW=5000&xPos=0&yPos=104&width=862&height=485", "publishedAt": "2021-11-19T19:09:06Z", "content": "For many residents in the quiet township of Pearcedale, the local shops are the heart of the community. \r\nOn this weekday, the complex an hour's drive south-east of Melbourne is beating strong.\r\nShop… [+13164 chars]"}]}